{
  "data":
  {
    "YoutubeMetadata": {
      "author": "MCB5",
      "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
      "title": "Full Board Meeting",
      "publishDate": "2020-12-11T00:00:00",
      "shortDescription": "",
      "lengthSeconds": "2:16:40"
    },
    "metadata": {
      "ID": "uSTNS7gQsL8.json",
      "creationDate": "2020-12-12T20:34:48.087384"
    },
    "CommunityBoardInfo": {
      "communityID": "MCB5",
      "normalizedName": "Manhattan Community Board 5",
      "twitterName": "Community Board Five",
      "youtubeChannelName": "Manhattan Community Board Five",
      "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
      "twitterHandle": "@ManhattanCB5",
      "hashtags": null,
      "dateCheckLast": "11/28/2020",
      "status": "live"
    },
    "properties": {
      "videoURL": "uSTNS7gQsL8",
      "fillerWordCount": {
        "uh": 547,
        "um": 237
      },
      "readTimeFullTranscript": "71 min read",
      "readTimeSummary": "11 min read",
      "wordCountFullTranscript": {
        "building": 73,
        "space": 32,
        "proposal": 25,
        "street": 22,
        "development": 20,
        "island": 19,
        "liquor": 19,
        "holidays": 18,
        "license": 18,
        "law": 16
      },
      "wordCountSummary": {
        "building": 15,
        "space": 10,
        "position": 6,
        "proposal": 6,
        "liquor": 6,
        "applications": 4,
        "powers": 4,
        "buildings": 4,
        "license": 4,
        "wine": 4
      },
      "fullTranscript": "Hi we're working our way toward a quorum. Almost there bicky hi. How are we doing Craig almost there, where we're there? Okay, all right good evening. This is the full board meeting of Community Board five, I'm Vicki Barbera the chair and, as usual, we'll begin. The meeting by hearing from our elected officials who are in attendance and wish to speak, and please use the raised hand feature to let us know, and then we will hear from any of the representatives of the other elected officials who would like to report to the board and they'll have two minutes each. We then enter the public session. This is an opportunity for anyone from the public to bring information to the board. Anyone wishing to speak, please sign up by 6:30, be sure to include the subject. You'll be addressing as well as contact information should just in case we need to contact. You remember, there's a time limit of two minutes also and please respect the time constraints for the board during each of its meetings, the business session. We then enter, which consists of the adoption of the minutes. The chairs report, the committee reports, resolutions, questions and comment period and voting and comments or questions from other applicants or the public or if additional information is needed, is only allowed with the chair's approval. So I will start this evening's meeting by calling any of our elected representatives who are here. I know: Gail was going to be here, I, don't know if she's joined us. Yet he has not. Okay and I do see. Keith is here, hey there, hi Keith hi there hi everyone and I'm always glad to go before Gail, because she always has a way of outshining us all. I just want to. You know: I wanted to spend and say hi, I'm not. We have a lot to discuss, but I really wanted to just come in before the holidays. To first wish everybody a happy holidays and to say thank you for everything that the community board does throughout a very difficult year. I mean all the time, but through a particularly challenging year and I know that when it comes to a variety of issues in my part of CB5, there's lots ahead in the next calendar year and we are I, always enjoy kind of working and working alongside everyone on this board. Smart, talented, reasonable people that I, you know, we always forget our volunteers and so I just always want to make sure that I say. Thank you for your another really hard year here, but all your efforts and talent to help work on our behalf of our community I also wanted everybody's leadership here on issues that affect Midtown and all of CB5. So I wanted to just first and say thank you. It is December 10th, so we are kind of ending this awful year, but to a better year ahead, but I also wanted to first say: I didn't get a chance. I know she's been here for a while, but to really say how much I'm happy to have Marissa here at the board. Now, who is a great addition? I've had a lot of opportunities to work with her in the city council and with the Manhattan delegation and all the issues affecting Manhattan. So you guys have picked up a real great leader here for your board and somebody who's gonna. Who knows that? Noodles really knows how the government works. I also wanted to. You know: I think you guys. Some of you have met him, but you know introduced Franklin from my office who is replacing Abigail. We hate losing people because Abigail is so fantastic. It started with me, but I really have a great addition in Franklin who's. Here he's the bottom of my screen: I, don't know where he's in yours, but is fantastic and has been hitting the ground running and really we wanted to make sure everybody got a chance to get to know him and although we won't see each other soon, he's like I always available to talk about relationships are happening in the district and he's getting caught up to speed on a number of issues, whether it's land use issues or transportation or quality of life. You know lots to do and lots happening. So that's all I wanted to say. I do look forward to you know, seeing all you applications come in, make sure you reapply if you're up this year and if you're, if you are, you know one of mine, you're, probably in good hands, because you're all doing such a great job but we'll say we'll see your attendance record, but anyway, I want to end I just want to add there. I want to introduce Franklin he's make sure you guys treat him well and he's going to be great, welcome, say hello to Marissa, because I don't think I've seen you since you've been here and also just say, thank you and happy holidays to everybody for well. It was a really tough year for the city and in our community here a lot of views. It's always but to say thank you because you're putting in a lot of work for it- and you guys deserve somebody to come here, sometimes and say thank you for all that you're doing, and so that's it happy holidays Happy new year. If we don't speak before then, and please stay safe and healthy, and do all the necessary steps here to make sure you keep everyone in our community healthy thanks, Keith, Happy, holidays to you and stay safe and welcome Franklin right, yes, okay, I think Liz Krueger, yes, Senator Liz Krueger is with us welcome Liz. Ah there we go hi, everyone well, I, don't even want to go after Keith, because he pretty much said what I was also coming here. To say, which is thank you for all the work that this community board does and doing such an extraordinary job representing the people of CB5 and making it easy for your elected officials to learn about issues that matter and to work with you to try to come to the best resolution. I. Also, I'm so honored that I get to overlap, really excellent elected officials, not just in this community board, but my entire district Keith powers and I actually share an office on opposite ends of a hall, not that I think either of us really go to offices anymore. We live on Hollywood squares like this, but work continues in a very difficult time, and so many people in our city and our country are suffering but government, even when we get things wrong and we do, but I'm confident that government is attempting to do the best we can and I have been badly joking as we move to 21. the light at the tunnel is not a train aimed at you, I think it's the vaccine I think it's actually. The end is seeable for this disastrous period of time between Covid-19 economic recession and Donald Trump in the White House, they are all moving along and out the door. I did want to just share one quick thing with, because I was just still dancing today. From my experience yesterday, I worked for four years with colleagues and with an enormous universe of environmental activists to get an agreement to divest the New York state, pension funds from fossil fuels and other polluting companies and industries, and yesterday I stood with Tom Dinapoli our state controller, as he announced our deal, he and I worked at a deal where he was doing exactly the divestment. Everyone wanted not through a legislative passage but through voluntary decision making by him at the controller's office, and the environmental activists were just beside themselves and I am also just so proud of the work I've done, and this and I want to shout out that my staffer, who did all of the work in negotiations with the controller's office, was Justin Flagg, my representative, to Community board. Five people might not know that Justin's true passion in life is environmental and climate change efforts, and so we have done some amazing work together. He can't be here tonight: Brad Usher, my chief of staff, is here and I. Think it's going to stay and people who don't know Brad who's been with me the entire time I've been a state senator and we're starting our 20th year in January. So this is old, Brad Usher here and old Liz Krueger continuing to work on behalf of our community. So thank you again. I hope everybody has happy and safe holidays. Stay socially distanced, wear the masks, wash the hands and get the vaccine as soon as you're eligible. So thank you very much. Thank you. Senator Krueger and the best to you and happy holidays good to see you thank you, I think Carlina's with Us Carlina. Are you there, our council member, I'm here hi hello, good evening? Everyone. Thank you. So much I'll be brief. So I'm very happy to be here. We had another stated meeting today, always exciting in the council. We've had lots and lots of hearings since the start of the pandemic via zoom. It has been pretty much non-stop. So you know, in my capacity as the chair of the committee on hospitals, I've done a number of hearings on the pandemic on readiness on lessons learned on testing and tracing I did a hearing actually on maternal mortality. This past Monday because of the issue and familial support and visitation to those in labor and delivery rooms, and we also did another hearing on vaccines which, if you haven't seen, they are expected to roll out in a phased approach as soon as December 15th lots of questions and concerns there, but hopefully, in this united front and with the new administration, we'll get the help and relief that we need I just want to. Thank you all for being such great partners. You know if it's on quality of life issues, you know, we've been working to restore some of the sanitation services that have been cut or working with some of the local block associations, even to remove something like a couple phone booths that have been incredibly problematic throughout the community. So you know delivering food still to people that need it and, of course, making sure that we're passing legislation to support small businesses I did pass a bill a few weeks ago, an extension of a bill through March of 2021 to suspend the personal liability provisions in commercial leases if you're Imp impacted by Covid-19, but we are still working on a lot in the council. So I just wanted to be here. To tell you all thanks, because this is, you know, an ongoing effort to be on a path towards a full recovery. It will take a lot of time. I know there are a lot of there's a lot of news out there on schools, opening and closing and pausing indoor dining, which actually could happen as soon as Monday and some of the businesses that have remained open in spite of this surge in cases and this uptick that we're seeing in hospitalizations. So you know, if you need anything, please always consider our office a resource and I just wanted to. Thank you all and say happy holidays, and please know that I'm always at your service. We thank you right back and we wish you happy holidays as well good to see you Carlina. Thank you thanks Vicky. Thank you. Everyone I think, let's see do we have any more of our. Do you think we're going into our representatives now? Is that correct? Yes, okay, starting with Jessie K two minutes, each hi Jesse, you can unmute yourself Jesse. Can you hear us just a second Jesse can hear us? Okay, maybe we'll move on to Luke Wolf and if Jesse comes in, you can. Let us know later on. Luke are you there from I? Am Bringer's office hi everyone, Luke Wolf with Comptroller Scott Stringer's office, want to start by wishing everyone a happy holidays and hope all as well. We'll just give a few quick updates from our office, because I know that we have a busy agenda ahead. I want to start by talking about our response to the Covid-19 health crisis. So at the start of the pandemic, our office launched an investigation into the city's response and we wanted to find out what happened in those early days, weeks and months to make sure that next time around now, when we're in the second wave we'd be able to respond better to this crisis. So when we first launched that investigation in April, we asked for a number of documents from city hall about how and what they knew and when they knew it. Now we are about seven or eight months into that investigation and we have actually not received one document from City Hall. So, two weeks ago we took the administration to court and we're hoping to be able to follow through on that investigation, to make sure that we're able to provide a timely update on what best practices are. So as we move into this second wave, we can respond in a more efficient fashion. I also want to talk about something else that I know is close to CB5 and that's police accountability. So, two weeks ago the comptroller wrote an op-ed about Ccrb reform with specific recommendations to make sure the police will be more accountable going forward. So there's three core recommendations and I'll drop the whole op-ed in the chat. The first is to grant the Ccrb more power to have final disciplinary authority. So right now the cops can treat the Ccrb decisions as purely advisory. We want to change that. The second is removing the NYPD office of trials, which currently reviews the series cases out of the NYPD jurisdiction and, lastly, expand the Ccrb's power to cover more cases I'll leave it there I'll make sure to drop that as well as my email address in the chat and hope everyone has a nice holiday and feel free to reach out with anything else, our office can do to help. Thank you, Luke same to you I see Gail is on. Thank you very much. I am great greatly honored to be here, Madam chair, so a few things I, never forget how much work you did and you're bored on the garment center. We have not forgotten it. We are still focused on it. There was quite a bit of PPE manufactured there and challenging apparently I asked about the hospitals recently because they obviously need more and apparently they work a lot with their distributors like Honeywell and don't focus locally. So we're going to try to work with the hospitals to get more business for the garment center, but at the same time, I think a little bit of silver lining in Covid-19. The EDC has changed the Iba program so that more owners of buildings want to participate, and that was what we had asked for some time ago. So we have now signed up some more owners, another 40,000 square feet of garment manufacturing space and we hope for more because I think people are realizing that the garment center can still be a place that you want to have garment manufacturing, given the fact that retail and business and so on, is not so fast returning. So we still need more, but it's a better place to be in second place is just you know, we're all gonna be working on the MTA. Their hearings coming up, we're gonna be testifying. The helicopter is ongoing. I think I've mentioned this before, but we have, in the middle of December we're going to have a meeting with the Faa elected officials. Any community board is welcome, certainly with the Eastern District Helicopter Association Etc and some of the companies have agreed to participate and then, when we figure out exactly what New York's position is we're going to meet with all of the folks in New Jersey we've been in touch with all the elected officials in New Jersey. There are about 50 airports in New Jersey. Now some of them have helicopters and they're coming over here and looking at our beautiful city and driving people crazy, Julie, Vertilla Martin is a writer and she wrote an excellent article in Gotham gazette recently. If you want to follow it, she went out to New Jersey. She did a huge amount of research, so FYI we're still focused on the child care slots. We lost about 500 of them in the most recent budget and we are not going to give up. These would end in July 2021 at the beginning of the next fiscal year, so we haven't gone yet and we want to make sure we get them back. Obviously, we got some pre-k that doesn't help with full day that doesn't help with head start and we'll. Let you know if we hear anything else, I think we always talk about the devices. Certainly the school parents school boards talk about the Cec's and we have 15 million dollars still sitting in the budget, OMB wanting to be spent for devices, and we are fighting with DOE school construction authority and OMB we're getting a little bit closer. It has to do with things that weren't necessary when you had a cart and now you have an actual device and so that it's looked upon differently, it's craziness. So just so you know we are focused on that. Trying to make sure that takes place. I want to thank you for your public realm proposal, you're the first board to do it like you're the first board on so many other things. We are working on a very long letter to the mayor on the same topic. We will certainly reference your amazing support for this concept and every time I have to figure out how to deal with different issues. Now the city Council to their credit today passed a bill that says art in the broadest sense can be in the streets. If you make an application, you know it's one of those good things, but it needs a public realm czar, because now there's another agency to add to your list. I think go up to 25. in terms of those who work in our streets. So we need a public realms are, for obvious reasons, we're working on the Grand Hyatt redevelopment as I think you are I, think you know that you have made some fabulous suggestions about the scope of work, and we have also this when we did all of the work on the east. Midtown I would think was one of the few people and your board has backed me up that we knew that this particular hotel would probably be going down and it is so. The question is: how is it going to be reconstituted, this good for the community and you've done a great job same thing with governors Island? Thank you for being involved. It's a city-wide island, and so everybody needs to have input. As you know, Committee Board applications for new members and for those who are hopefully reapplying are due February. First, and in terms of our budget, we had a couple of wonderful sessions recently about how to apply for school money for capital and how to apply for nonprofits for capital, and they are all on our website. They would took place in the last couple of days and tons of people participated. Those who have done well Pat in the past on applying for money were the heroes and it's all on YouTube. Thank you very much. Community board number five for everything. Thank you, Gail I, think. Most of the things you mentioned are on our agenda again tonight. We're for you, yeah we're doing the official director of public realm resolution tonight. So we'll talk about some more Pearl Board yep. Okay, thank you! Happy holidays. Okay, I think Brad is joining us. Is that correct? Yes, hi? How are you I just lit the Hanukkah candles with my daughters, so I'll get back to them shortly as they open their gifts. I, don't know they think they're getting eight gifts. Tonight I tried to tell them that's not the case, but there seemed to be a lot of gifts there very briefly. I again want to thank everyone and the president on the public realm proposal. I think it's a really smart idea and appreciate the board's support I wanted to let you know. Vicky and Caroline. Wexlebaum is filling in for Annabelle, who many of you know tonight. Hi Caroline just wanted to. Let you know that I've introduced a bill that we're calling Sami's law to allow New York City to lower its speed limit, it's hard to believe, but Albany controls, New, York, City's, speed limit and there's a mandatory minimum speed limit in New York City, which is 25 miles per hour on most streets. My bill called Sami's law named after Sammy Cohen exceeding a young man who was struck down by an automobile just a few months before his bar mitzvah would allow New York City to have control over that I think it's a really important step forward in New, York, City having home rule over its traffic laws and we're going to fight for that up in Albany. When we get back speaking of going back to Albany, we may be going back as soon as next week to look at the all-important question of revenue. You know the city and the state are really deeply in the whole because of Covid-19 and other factors, including the MTA, and our mass transit system is really operating. You know kind of on a thread right now, so if the federal government isn't coming through, I've been a staunch advocate of additional revenue that New York state has to raise to keep our homeless shelters and you know operating to the extent we can. Our mass transit moving public schools. Gail is talking about those laptops that costs a lot of money and we have to make sure we have the revenue, so I'll be fighting for that over the next few weeks, third I advocated, along with councilmember powers, a survival plan for small businesses in grand central terminal that have had little to no revenue because of the foot traffic. Having ceased in that and that great space, we worked out a deal with the MTA, where the small businesses are going to be giving a portion of their actual earned revenue to the MTA, and we think it's a model for other commercial landlords and we hope to continue that effort through a bill that I carry with assembly. Member Harvey Epstein called save our storefronts. You can go to save our storefronts.nyc to see how you can support our efforts to try to make this model statewide and then finally, I wanna, two things in terms of Lgbtq Rights, I wanna. Thank Councilmember Rivera for her very principled stance today on passing a resolution urging Albany to use its powers to repeal the so-called walking Wall Trans Ban. That is a that's a statute in the criminal law that allows our law enforcement to essentially profile transgender women of color. Simply for the purposes of the fact that they were loitering or hanging out with their friends, and they may look a little different. It has resulted in some arrests and harassment of transgender people and then finally, World Aids Day was last week and for many people in the Lgbtq community. This pandemic that we're currently going through was not their first rodeo and we think about all the lives lost, but we try to think forward and how we can make sure that HIV Aids is not transmitted. If you're a black man in the city of New York, you have about a one in three chance of contracting at HIV. If you sleep with other men, and we have proven medical advances to stop the prevention, transmission of HIV called pre-exposure prophylaxis and I carry legislation along with assembly member Dick Godfrey. That would do a few things. One require that there be no pre-authorization by buy your insurance plan to get prep, as it's called to that pharmacist be allowed to distribute prep without a prescription and third, that your health insurance plan actually has to pay for it. So we hope to advance that which we think will work toward universal Prep and pep, which is post-exposure prophylaxis, which allows you to take these drugs if you've been exposed to HIV and stop it from entering your immune system and then finally, the FDA approved the Pfizer, provide 19 vaccine I think just an hour ago wanted to let you know that I was a guinea pig for that at the Nyu Lange Langone Vaccine Center, I'm still standing had a few side effects, it must be said, I'm pretty sure I got the vaccine as a result of that and not the placebo, although I had a 50 chance of getting the placebo, but it's very important that we spread vaccine awareness and safety and efficacy of vaccine. The Fda's regulations are in place for a reason to make sure that the safety is upheld and I really want to thank Nyu Langone for participating in this trial and making sure that you know we fight our way out of this virus as soon as possible, and that the vaccine is widely distributed and fairly distributed to the communities, mostly black and brown, that have suffered the hardest during this crisis. Thanks Brett regarding the save our storefronts, we weighed in on that and supported it a couple of months ago. Thank you for anything else. We should be doing now. I think you should be anyone on the zoom individuals should be going on and signing the petition. That would be super helpful. Okay, great thank you and happy holidays to you. Happy holidays to the entire board. Okay, I think we're now back to our representatives of our Electeds Jessie K hi. Can everyone hear me now? Yes, all right, so my name's Jessie, I'm filling in for my colleague Betsy this week the congresswoman released a statement on why she will be voting against the Ndaa her bill. The corporate transparency Act is likely to be passed in an upcoming vote. Her legislation for a Smithsonian women's museum was passed unanimously in Senate Committee and she voted alongside her colleagues to pass the marijuana opportunity, reinvestment and Expungement act and then, along with colleagues in the New York delegation, the congresswoman pushed for emergency MTA funding. She joined small business owners in demanding crucial Covid-19 relief, including her Pandemic risk Insurance Act. She also continued to fight for the passage of another stimulus package, as well as other Covid-19 relief funding. Like the save our stages act and on the oversight committee. She called the heads of Purdue and Sackler to a hearing on their role in fueling the opioid epidemic, and they will appear in a hearing next week, she's also seeking accounting of political appointees in career positions. She issued a subpoena regarding mistreatment at Irwin, County, Detention Center and, as you know, the congresswoman has been committed to a complete and accurate census count. Today she issued a subpoena for Secretary Ross, as he has continued to refuse to hand over documents regarding errors and delays with the census and, as always, more information can be found on our website by subscribing to our newsletter or by contacting Betsy or any other member of the staff and I hope that everyone has a safe and happy holiday season. Thank you, Sam to you. No problem Laurie from Corey's office Lori. Are you on I? Am I'm going to just bring some good news? So yesterday we had the speaker's office partnered with the NYC department of Housing preservation, development and the Stonewall Community Development Corporation on a virtual tenant housing resource fair. We had over 120 people attend and they received information about a litany of NYC housing programs and tools such as Screedri housing, connect and housing court, and given the current environment, this information is more important than ever so next up is our toy drive. I'm happy to report that the pandemic did not stop our office from holding its third annual holiday toy drive with holy apostles soup kitchen. Our community, which always responds generously, was especially generous. This year, with just two days open for donations, due to Covid-19, we received over a thousand toys. These toys were delivered to holy apostles soup kitchen and will be distributed to families and children in the community on December, 15th I just want to say a big. Thank you news in order once again to the Uniform Fire Newport Fire, Officers Association. They also donated toys to Penn, South, Manhattan, Plaza and West village houses for establishing toy collection boxes in their buildings and, finally, just kind of an end-of-year wrap-up. Our district office and community volunteers have continued throughout this year to ensure that residents will not go hungry during cobia 19. Our office delivered 8675 meals and 2,250 pantry boxes to seniors and families in council district 3. great. Thank you. So much have a nice holiday you too, okay, do we have anyone else representing the electeds I, don't see it I? Oh sorry as Franklin we're just from Keith Power's office, okay, you're, not making report, though right because Keith made a report, I'm or did you plan yeah I mean we have just got one more item that Keith did not say earlier. If I can just make that real, quick, it's about our also having a toy drive with the partnership with New York cares and room to grow, and that can be found on our newsletter. That's also coming out, and also by going to bitly that's b I t DOT, L, Y, Slash powers, code, drive and fiddly or is toy drive, so one is a coat drive and one is a eight toy drive for me. Okay, that's it! Thank you! So much Franklin nice to meet you! Okay, thank you, nice to meet you! Okay, I think we now go to the public session. Unless someone else is on there that we don't that doesn't show up in the raised hand, I don't see anybody else if any of our elected representatives would like to give an update, feel free to raise your hand at this time. Okay, we'll go to the public session members of the public members of the Pueblo. Please press the raise hand button at the center of your screen. If you're joining from a phone, you can press star 9 to indicate that you'd like to speak Vicky. Would you like I, see four people raise their hands from the public? Okay, let's start with Leslie Hendricks, okay Leslie, I'm unmuted hi, I'm Leslie Hendricks, I'm a member of the Board of 29th Street Association, I'm also the president of my co-op flower, tenants corporation at 50, West, 29th, Street and I worked on the Broadway Corridor liquor license tax force. Our building, I'm speaking tonight as the president of our co-op. All of our windows are within the site of glass ceiling, an applicant for a liquor license that was unanimously thought to be the worst location possible. We worked on that. We thought everything was good there and we were really just stressed to learn that they did a go-around with Keith powers and went to the SLA. To me. This basically CB5 is a is wonderful. The community gets input if every occupant every applicant for a liquor license knows they can just go to an electric elected representative, then they're not going to work with the community and the community's interests are not going to be, are not going to be taken into account, so I'm very distressed at Keith Powers. He changed his mind and really let everybody down we'll think of him. Every time we can't hear ourselves and I hope that CB5 can rest control back so that we continue to have some input. But I'm very discouraged right now and I wanted to voice that. Thank you, Leslie, okay, next Up, Alex, Young or young hi CB5. How are you I am Alex, Young and I live on the western edge of CB5 I like to say, I can take a bean bag and throw it across the asphalt and they'll land in CB4, so I am on the western knife's edge. I want to get I want to say. Thank you for this opportunity and the timing is pretty perfect because it pertains to Airbnb which had their ipo today on the Nasdaq. So I created a dossier for anybody who would like to see the latest shenanigans. That Airbnb is using against New York City to try to out Fox the city and Out Fox New York state. You can find it on my Twitter Social Alex. That's s o c I, a L Alex, a l e x and there's a link there that says Alex young.com, don't click on it. I meant to get rid of that today, but I forgot, so just click on the other link, because it'll show you the dossier but I guess Luke at your discretion. If you don't mind typing in the dossier's url, it's gigi, DOT Gg, slash, airbnb hyphen is hyphen the hyphen Hydra H-Y-D-r-a and that's the mythical seven-headed creature from mythology: that's not to destroy everything but itself. Thank you, Alex, okay, next up, Lisa, Wager, I hope everyone had a tasty and safe Thanksgiving. My name is Lisa Wager, I'm the director of government and community relations at the Fashion Institute of Technology, this SUNY college on 27th between 7th and 8th. Even in a pandemic, our students are doing and winning a team of fit. Students took third place out of 1,600 competing teams from around the world in this year's Adobe Analytics challenge. This is an annual competition in which undergraduate and graduate students, many from prominent business schools, crunch real data from major corporations and make recommendations to the businesses. This year, Nike sponsored the challenge and past brand partners have included Conde Nast T-Mobile major league baseball. It's the real deal. Our team flash was comprised of three fashion business management seniors, one of whom was from Brooklyn, and they won six thousand dollars and made a heck of a lot of connections. It was a great thing for them. You can take credit and non-credit courses at fit center for continuing in professional studies without going through a formal application to the college. The only requirements are a high school diploma or its equivalent and the legal ability to take credit courses in the United States, I.e, you're, not here on a tourist visa. Thank you. Department of Homeland Security credit courses taught by fit faculty, are available in art and design, business and technology and liberal arts and they'll run through the full winter term, which is January 4th to January. 20Th non-credit courses are short, intensive seminars or workshops taught by an expert in the topic. Registration has begun for the winter term and runs through January 3rd. You can just go to the center for continuing and professional studies website, which is Fitnyc, DOT, Edu backslash Ccps best wishes for happy holidays and stay safe. Thank you Lisa same to you, Mimi Pearl. Sorry hi. Can you hear me? Yes, hi. My name is Mimi Pearl, I'm a science and health teacher as well as a graduate student at CUNY. School of public Health and I also grew up in district five and went to school in district five, so I. Thank you for your time. Research from around the world has shown that when nutrition education is taught by qualified teachers, the dietary habits of young people are positively impacted well into adulthood. Yet in direct violation of New York State Education Law, 97 percent of New York, City, middle and high school health teachers are not licensed to teach health. The very class where nutrition is a required topic in some schools. Principals contract with outside nutrition, education programs to fill staffing gaffes gaps, but there have sorry, but there have been limited research on the quality of these programs and the qualification of their instructors. These realities mean that most New York City public school children are missing out on lessons that will enable them to live longer and healthier lives and make educated choices about their diet. That would also protect them from experiencing the more severe consequences of Covid-19 should they become infected supporting quality nutrition and health. Education starts when we demand that the DOB provides transparency about their level of compliance with New York State education law, particularly during this Pandemic City Council Bill 1283, would require the Doa to publish annual information regarding the minutes in frequency of nutrition, education in schools, the qualification of health teachers in New, York, City, public schools and the availability of professional development and training and nutrition education for teachers. Now more than ever, we must make sure our students are learning about nutrition and health from qualified individuals for the appropriate amount of time. Therefore, I urge this council to consider drafting a resolution in support of this bill. Okay, thank you very much. Next up, Paul Cardozo hi Paul, just unmute yourself, okay, good, I'm unmuted. Can you hear me now? Yes, thank you very much. I am representing guilty house, and I want to basically represent how disappointed sad and frustrated we are with the decision that recently was passed by the SLA to approve the beer and wine license of 1204 broadway. From what we've heard, it was based upon the recommendation of council member Keith powers whom this whole building, including our attorney Kate Quinn, and of Course Leslie Hendricks. You heard from as well and a lot of associations rallied to not vote in support of this bill. Now we guilty house live completely adjoining to this place. That is now going to be this bar and, notwithstanding its restrictions for timing, it's sad to say that the owner of the bar has not exhibited great behavior in the past and the fact that we will be now subjected to this and as per Nick and Luke and Kate my our attorney. This is not an appealable decision, so I just wanted to register our frustration with this decision and also very much to congratulate CB5 that has been with us all along in opposing the full liquor license, and this particular one as well. So, thank you again, CB5 for being a true community board and that's all I had to say thank you Paul we're right there with you. We are very dismayed as well. Next up Anna Mackie Good evening, thank you to the board for hearing me out. My name is Anna Mackie and I live at the guilty house, with my husband, six-year-old daughter and six-month-old son. We've lived here since 2010, I'm speaking out to express my deep disappointment at the Sla's decision to approve the wine and beer application at the glass ceiling located right next door at 1204 Broadway. I'm similarly genuinely surprised and disappointed by the support for this license by council member Keith powers in whose district I am a registered and voting voter I understand that Mr powers took a tour of the proposed venue. However, surprisingly Mr powers did not seem interested to do the same for the residents opposing the license and take a tour of our apartments. Had Mr powers toured my apartment, he would have seen that my son's nursery is 10 feet away from the venue, and any noise from the rooftop will be clearly audible. I sent a letter to councilmember powers last week with a picture showing him the proximity from our son's window, I also expressed in my letter to council member powers. My concern that the applicant at 1204 Broadway has demonstrated time and again that they are not interested in abiding by the rules of law when they were constructing the venue, we would consistently be disturbed by illegal after-hours construction, noise, often past midnight and at times all throughout the night. As late as five in the morning, equally disturbingly after I spoke out at the prior CB5 meeting opposing a prior liquor license application by the same applicant, the applicant, through their lawyers slipped under my door. A letter threatening to sue me personally at the time I was pregnant with our son, which was particularly stressful. For me, any such mobster tactic should be unacceptable to anyone, especially to our elected officials. Thank you to the CB5 for your support to our community Vicky you're on mute. Sorry about that. Thank you. Next up looks like Dionne Anderson Morrison, hi Dion. You can unmute at this time. Not there Dion. Can you hear us yeah? It doesn't seem like they're, okay, is there anyone else, I, don't see any other raised, hands I, don't see any either. Okay, then that ends the public session. We will now enter into our business session of the board where, as I mentioned earlier, only board members are allowed to speak. I always ask that, since we're now in virtual board meetings to please try to have your videos on during the meeting and I'd like to go over the use of the chat feature, and that is that the chat feature is to be used only to alert us to any technical difficulties or operational questions or information like an email address or a link. That was already stated aloud on the record during the meeting, in keeping with our mandate to adhere to the open meetings law. Any remarks about Cb5's business or questions about the agenda or any of the topics should be made on the record by raising your hand, through the raise hand, feature please keep this in mind tonight and for all future public virtual meetings of the board and its committees. So we are now entering the business session and I'd like a motion to accept the November minutes so moved and a second except okay, roll call vote. Craig. Thank you. Vicky Achalas, yes, Athanal, yes, Ahar Behar I saw him before come back. He was on yeah. He was heichmann. Yes, rosnahan! Oh that's a good one! Burton! Yes, Gefarro! Yes, true! Yes, Clark! Yes, Dale! Yes, Docent! Yes, Ford! Yes, Brewer! Yes, Garcia! Yes, goshow! Yes, Haas! Yes, Harris! Yes, Hartman! Yes, higher! Yes, Johnson! Yes, Quebec! Yes, Kalaforsky! Yes, Spang Stella! Yes, Lagusico! Yes, usyk Lucic! Yes! Thank you! Mafia! Yes, Mccall! Yes, Myerson! Yes, Miller! Yes, Pawson! Yes, Raybar! Yes, Shapiro! Yes, Slutskin! Yes, Smith! Yes, Vandorf! Yes, Spence! Yes, Stern! Yes, song! Yes, Webb! Yes, Weintraub! Yes, Waylon! Yes, Yang! Yes and I'll just check again Behar! Okay! He did come back on in the middle Zach. I see him. I see a picture of him. Sorry! Yes, okay, thanks Zach, okay, Motion passes, okay, good, the minutes pass and well it's almost the end of 2020, and since this has been more than memorable, but unfortunately mostly negative. Since a terrible year, I decided to take a look at some of our actions, our concerns and accomplishments throughout a very difficult year. But I'd do this after looking at it, I thought. Well, you know I ought to share it with the rest of all of you, because you've worked so hard on these things, but just to give you an idea of what we really accomplished this year so bear with me, because here we go in January, we learned that Gail was opposed to term limits for board members and she encouraged members who agreed to voice their opposition. We sent a letter to DOT on another subject: rate preliminary findings on the pilot 14th street busway, citing our specific concerns and requests for better data. In February, we supported the local law to amend the administrative code in relation to the use of pesticides by city agencies. We passed resolves on two landmark buildings: the paramount and the Flatiron building. We passed a resolution ray congestion pricing requesting at least two members of the traffic Mobility Review board to include one individual, representing interests of those living within the area and one living outside. We recommended approval of the design concept and planned capital improvement for Pershing Square East Plaza. We supported the development of the Bleecker Street site and the creation of a department of Education public school for dyslexic students at that school site in March. We did not hold our regular meeting. That was the fateful lockdown due to the pandemic, as city went into the lockdown the day after that full board meeting. But we did proceed with our resolutions for the month with the exec committee approving them and the full board ratifying them in April. The actions that we took in March included reaffirming a previous here. We go denial of a very controversial rooftop lounge event. Space liquor license for the glass ceiling on Broadway between 29th and 30th streets. We heard about this tonight. Quite often we recommended approval of a 22-story building at 241 west 28 that will include 98 units of affordable housing. We recommended approval of Rockefeller Center's certificate of appropriateness for master plan expansion, retail signage throughout the center and alterations for the street, the retail store fronts. We recommended denial of the request by guilty house at 1200 Broadway to permit the transfer of development rights. We approved the five post-parade events in our district and then in April. We held our first virtual meeting I think it went well. We recommended approval to install lighting to illuminate artwork throughout Rockefeller Center and, among other things, we recommended approval of dot's request for the installation of a northbound protective bike lane and requested D.O.T, accelerate efforts to identify and install a safe, southbound cycling route through the core of Midtown, then came May and we welcomed our new Board members, Zach Bahar Mary Brosnahan, Kelly, Burton, Joseph, Freeward, Jamie, Kang, Noah, Stern and B.J Song. We recommended approval of the central park conservancies project regarding the conservatory garden and dairy access path in the park in June, we issued a statement of solidarity to protest racial injustice. We announced that our committees will be holding a series of meetings to address issues such as alternative policing models, access to housing, etc, and we invited and encourage the public to attend and participate in order to best represent the needs of everyone in our district and provide a voice for all the committees of the board reported on their letters to the mayor. Regarding the shaping of the city's response to Covid-19, we recommended enactment of the alcohol delivery bill and to go legislation and conditions. We recommended denial of the glass ceiling events requests for a wine and beer. The second request, which was mentioned this evening for the rooftop bar lounge event, space at 1204 Broadway. We sent a letter to the mayor and to the local electeds asking that they consider the summer youth employment program before accessing it from the budget. We supported the core act rate, composting and electronics Dropo sites, and this was the month that we responded to the mayor's executive 2021 budget in July. That was a difficult month. We had to deal with Wally's departure at the end of that month, but we forged ahead and we recommended the approval of an open-air cafe with the pops at 1633 Broadway. We weighed in on the D.O.T proposal for installation of pedestrian enhancements around Central Park South in Grand Army Plaza, and we weighed in on dot's installation of crosstown protected bike lanes on 38th and 39th streets. We insisted that the New York City Parks Department, provide robust park, Covic 19 opportunities and safe spaces for kids to learn, grow, heal and belong this summer. We urgently requested removal of the current moratorium on park, space and ball field permits, and we urge the parks department to consider and remove all structural barriers regarding participation in summer youth programs in the fall in September with the city proposing the relocation of clients from the Lucerne hotel to the Harmonia permanent Shelter at 31St street. We spent actually our Bex Committee, in particular an inordinate amount of time working with various agencies, our electeds and community members. In our district, we published our core budget principles regarding NYPD. We supported the bill to exempt additional small businesses from New York City commercial rent tax, and we addressed and supported the municipal arts, society's advocacy and proposal for a new position in city government called director of the public realm in October. We welcomed Marissa mock our new Dm yay. We supported the save our storefronts bill, we recommended approval of the court, theaters rehabilitation and restoration. We recommended approval of the Flatiron buildings alterations and in November we address fiscal year, 22 district needs statement and budget priorities and the and we address, by way of a statement of principles, the design and reconstruction of the Park Avenue malls. That's a lot. I really think we, it was nice to go over it all over again. I. Don't want us to forget the hard work that we do, and here we are now midway to the end of December in 2020. Thank goodness. We've obviously accomplished a great deal during the past 12 months and putting all of that good stuff aside. Let's hope that next year, at this time, we will no longer be talking about thinking about worrying about Covid-19 matters or what the latest twitter will be coming out of. The White House I would like to take this moment to wish you all a joyous and have a healthy holiday season and look forward to zooming and meeting with you all in 2021. So now on to tonight's agenda, starting with psql. Thank you Vicky, that was lovely. Ps2L has a report on one item. As we've heard during the public session, the state liquor authority has approved the tavern wine liquor license for glass ceiling. Events at 1204 Broadway, the tavern wine license, allows the premises to serve beer wine cider things like that anything but hard liquor. This location for people who don't know is immediately adjacent to the guilty house, residential building and some other residential buildings in the area. To give you a brief history, so that, for some context on this application, we first received their full liquor license application a year ago, December of 2019 and we denied the application, which is rare for us, we reserve the denial of liquor license applications only for those most extreme cases and because of the rooftop location, so immediately adjacent to the residential building. We outright denied this application. They came back to us a couple months later asking for us to reconsider the application. We did a thorough reconsideration of some additional facts that they presented and again because of the location of the rooftop so immediately adjacent to the residential building. We again denied it. Our denial was supported by guilty house, of course, other neighboring buildings, the 29th Street Association, as well as various elected officials, assembly, member Gottfried, Senator Krueger for President Brewer and council member Keith powers in April. The state liquor authority agreed with us and denied the applicant's application for a full liquor license. Exactly one month later, we received a notice from the applicant saying that they were then going to apply for a tavern wine license. We immediately responded to their application again requesting denial on the same grounds, the fact that the rooftop is so close to the residential building. It doesn't matter what they're serving whether it's beer or wine or hard liquor. The same issue exists and then the application went dark. We didn't hear anything for months we submitted our denial in June, July, August, September, October November. We didn't hear anything about it and then on November 23rd we get an email from the council for Guilty House. That says: hey. This item is on the SLA calendar for tomorrow. So for some reason we didn't get any notice that this was going to be heard by the state liquor authority, the full board of the SLA. Nobody got notice guilty house didn't get noticed their attorney, who had submitted a notice of appearance, didn't get noticed. Nobody got notice of this hearing that was happening the very next day after they posted it on their website. So we sent a letter to the SLA objecting to having a hearing without notifying us guilty house, and others probably did as well and in response the state liquor authority postponed. The hearing to December 8th, which was just on Tuesday, so in preparation for the hearing on Tuesday. We revisited our support. We reconnected with the residents took action, they said letters, they did everything that they had to do and we revisited with our elected officials as well. At that point, we realized we were told that all of the electeds continued their opposition of the license. With the exception of council member Keith powers, we had learned during his requesting for his continued support. We learned that he had changed his mind and he had switched his position the week prior, he had gone to visit the rooftop application, the rooftop premises. He was given a personal tour of the space and that changed his mind about the application like was mentioned during the public session. He didn't give the residents that same courtesy. He visited the rooftop space, but he didn't visit. He didn't bother visiting the resident's apartments immediately adjacent to it. So we're a little bit disappointed in council member powers for his lack of transparency for failing to consult with us before he changed his position on us and for his lack of hearing the resident's position before he changed his position, and it was mentioned during the SLA hearing, the members of the liquor authority said that the electeds being in favor of the new application was dispositive, so we believe that it was his change of position that changed the SLA position as well or was at least significantly dispositive the SLA unilaterally imposed some restrictions and I'll read them. That's just a handful, no service of alcohol outside so the structure for those of you who aren't familiar with it. It's an open rooftop and they built a glass structure on the roof. The glass structure has the rooftop can open. The sides can open it's partially enclosed, partially unenclosed, no service of alcohol outside, but drinks purchased inside may be carried outside indoor service must end at 9:00 pm in inside the glass container and outdoor occupancy must end at 8 pm, no outdoor, music, no dj and a maximum of 10 events per month. Generally, restrictions like that you know could certainly be appreciated, but in a situation like this, where the rooftop is so immediately adjacent to a residential building, even restrictions like this can not mitigate the disturbance that this is going to cost to the residents. The other concern we have about this is that now that they have their foot hold in with a wine and beer license, they can get these hours amended by the state liquor authority, and they can also now apply again for a full liquor license much easier than before. That's my sorrowful tale. Okay, thank you. Nick very disconcerting, 10 a month is like every weekend on a Friday and Saturday Correct and more yeah, okay and there's no restriction on brunch service. So you know on a weekend when people are home, I mean everyone's home. Now, anyway, yeah there's no restrictions. During the day. It's disappointing, yep. Okay, thank you very much. Thanks for the work that was done on this okay, we are on now to land use, housing and zoning Layla all right good evening. Everyone. We had a very lengthy agenda this month with some significant applications. The first one is 109 East 42nd street. This is the Grand Hyatt hotel. This is in the east Midtown sub district that was recently rezoned. The applicant is proposing to tear down the existing structure and redevelop using pretty much all the mechanisms that the new zoning text provide. As a result, the tower that they're proposing will be over 1600 foot tall and you know, obviously, will raise a number of environmental concerns. The stage at which we reviewed this proposal is very at the very beginning. So what was issued last month is a draft scope of work. The draft scope of work basically defines what should be reviewed in the environmental study, so the question that was in front of us was not really whether we like the building or we don't like the building or if the building should be improved, or you know, maybe masked differently or altered in any way, shape or form. What we're looking at is making sure that the environmental impacts that this building may have are going to be deemed in scope and are going to be properly evaluated and then hopefully mitigated so you know it was a lengthy discussion, as you can imagine, a building of that size and that height and that bulk, you know, raises a number of concerns. I'm gonna try to just underscore the most important ones, so we're making some comments about pedestrian traffic. You know very obviously it's already a very congested area. We want to make sure that you know the additional pedestrian traffic that is going to be caused by this building is not only mitigated, but that the original you know like the like structural, endemic pedestrian congestion is also taken into account and mitigated. We are talking about shadows and air and light you know. Obviously, this building is going to be very tall, very bulky. As a result, it will block some of the light that accesses the streets. So we emphasize that we talk about sustainability and we want to make sure that this building is going to be as efficient as possible and you know and how it's going to be efficient. We also want to know what is the source of energy that this build building is going to use, and we are also raising concerns about the base formula by which the density is being calculated. So it's actually quite interesting. I'm gonna get a little more technical, so bear with me, but, as you know, the far the floor area ratio, so it's a ratio, meaning that it's a proportion of a fixed number that is multiplied by its denim numerator. So in that particular case, the site where the building is going to be built, is you know where the current Grant Hyatt sits, but the applicant did something that is, you know quite interesting, and we had not seen that before. They basically did a lot merger with the Hsn parcel, which happens to be grand central terminal, so they so now the footprint of the qualifying development side becomes that much broader and therefore, if you take this whole area, this whole surface and you multiply it with the bonus fear that they're seeking you get a much larger number of square feet that you're allowed to build than if you're, basing your calculation strictly on the size of the development side, which is the Grand Hyatt land. So we're raising that in the concerns you know this is quite technical, but you know it's important that it is taken into the scope of the environmental review and then you know we talk about the things that were. You know like the bread and butter of reviewing East Midtown zoning, open space, shadows, historic and cultural resources. The building is going to sit between our grand central terminal and the Chrysler building, so very important, very significant historic resources. We want to make sure that the massing will take that into account and will be as minimally obstructive as a 1600 foot tower can be. We talk about urban design and visual resources. You know like plugging such a density into an already very dense area. Is you know quite a feast? We also want to make sure that you know these new developments are coming online are not designed in a vacuum. There's a you know a whole new streetscape that is being developed. One vendor build is now almost completed and any new buildings in the this vicinity. This one is, you know like the mirror image of Vanderbilt. You know sitting to the East of grand central terminal. There has to be some cohesion. They should not be designed in a vacuum. I should add that, in order for the developer to get this bonus density that they're applying for they are doing some transit upgrades, we did talk about the transit upgrades at our land use committee meeting, but we feel that the transportation and environment Committee should take a look at it, which they're going to do that will happen in January, so the transportation section will be. You know fleshed out after Tna has a chance to look at. You know the granular aspects of transportation in this application, and you know we talk about air quality and also construction. You know it's gonna be quite a challenge to demolish this building which, by the way, although it does not look historic at all, the historic building is still there. It is basically behind this gross black glass cladding that Trump decided to use when he took ownership of the building in the 1980s. So it's going to be quite a challenge to demolish a 1916 building and put it in the dumpster in place and then go on to rebuilding the proposed building. So we talk about all of that and we basically ask that the environmental impact statement incorporates all these elements and looks deep into those issues so that we have as good a building as we can possibly can. We will have an opportunity to weigh in on the project itself and its merits. That will be done when the draft environmental impact statement is released, fantastic work, you and your committee really wonderful. Before we go to questions and so on, do you want to bundle any of these Layla sure? Yes, we can bundle everything. Okay, all right. Does anyone have a conflict with this application? Raise your hand if you do raise, use the race hand feature I, don't see any questions to the resolution Clayton. Thank you. This is such fantastic work Layla on the part of the committee and I'm sorry that I wasn't there for this. My question is about the parallels between this and the chase property on Park Avenue. You know the two things they have in comp. Well, they have a lot in common. Actually, one of them, as the borough president alluded to, is that she- and we were both on the record adamantly saying to city planning that we saw that these properties would be on the table for redevelopment at the time of the Eastman town, rezoning deliberations that went on and the city kept coming back to us and saying: no, you guys, you worry so much, there's no way, that'll never happen and both of them are happening. The other thing they have in common is the 10,000 square. Foot open space issue and I really applaud how comprehensive the committee was in covering all of these potential areas of concern when it comes to the 10,000 square feet. We had this exact thing with the chase property and we had all of this storm and drawing and back and forth, and then compromised with that applicant about that open space, and my question is: if we gained anything, we certainly I know we didn't gain anything statutorily, but that was a case-by-case situation with that property. So did we did the city gain anything from that fight that we can apply to the open space issue when it comes to this development? Is there anything that helps us aside from starting over from scratch, with advocacy again for this one? So with this particular application, they are actually proposing an amount of open space that is conforming in compliant with the zoning resolution, so they're not asking for any special permit or amendment they are from the get-go proposing ten thousand square feet of open space. They may actually end up, give us a little more and when I say us, they're, actually not giving us anything. It's actually the bare minimum amount to contribute so that they can get. You know in exchange from us this extraordinary density, the building, it's actually kind of hard to calculate exactly what is going to be the fr of the building, because, as I explained, the footprint that they're basing their calculation is actually the entire pretty much the entire block, including the train station terminal, but the building will be at least 30 far. So you know the bare minimum in terms of open space, publicly accessible, open space is 10,000 and we're gonna get at least that much now. The question with this particular project is that the proposal calls for this open space to be actually located on the second and third level of the building, and you know th. This is unusual because whether I mean it will be accessible, meaning you know there will be elevators and these elevators will. You know, take you directly to the space and it will be. You know, hopefully, at grade from you know the street, to the elevator and then to the open space, but nonetheless anything that is not at great fully upgrade. It has the perception of being less accessible, and you know this is something that we talk about in the resolution where we want to make sure that accessibility and perceived accessibility are assessed and addressed. I. Don't know how to do that. You know. Maybe it's through surveys or you know something, but we want to make sure that you know it's a clever idea to actually locate the open space on a higher level, but we want to make sure that they don't fail so, but we will get at least 10,000 square feet of open space, that's built in their application. Okay, Leila, before we go on I think when this got transferred into the package you know with cutting and pasting. It says the committee vote on flood, resiliency and I. Think it's exactly the same except the heading is different. Was the vote? Unanimous 12? Wasn't it? Yes, that's right! Okay, fine! Any other questions to this resolution, Michael Mike, your need to unmute. Yes, I'm sorry I have two questions. One has to do with the Pew Alley and how that figures into the total square footage the sixteen thousand squiffy and the second one has to do with the Covid-19, putting a lot of square footage, availability out and now they're talking about adding all these thousands and thousands of additional square feet, I'm thinking the empty state building from the 1930s that has that I know. You mentioned something like that in the proposal. But can you explain a little bit more about how the Pew Alley figures in this and about the office space preponderance of office space yeah sure? So, if I think I understand your question regarding debut alley, if or correct me, if I'm wrong, I'm gonna respond and then hopefully I'm giving you the I'm addressing your question. So the Pew Alley basically sits between the development side and which is you know currently the Grand Hyatt and the terminal. Dupu Alley has been de-mapped as a street and has been incorporated into the footprint of the qualifying development site. The Pew Alley is going to stay where it is and the purely is going to continue to fulfill its function. It serves as a you know, a loading area for the post office and other buildings, so the functionality is not going to change. It is just that it's been d mapped, it still belongs to the city, but it has been incorporated into the qualifying site and it will generate bonus far for the development I. Think that was your question. Is it did yes? Okay? Now your question regarding Covid-19, basically, you know what we see, whether it's for this proposal or you know similarly for the Penn Station Redevelopment empire, complication complex. Basically, when we raise these questions, the response that we get is completion is in 2030 and therefore we can not make any assumptions based on a sanitary crisis today that we assume and anticipate will be solved and that maybe something else will have happened, which we don't know. So basically we are in the unknown and we're basing the development on the old normal and therefore these considerations are not really part of any planning so that that's a response that we receive. You know whether we're satisfied with it or not. You know is another question. You know we are certainly on record, saying that you know developing so much commercial office space in our district may turn out to be problematic and we're actually calling in this particular document for the scope to actually encompa to be much broader. You know, so the radius study should be much broader to really incorporate and take into account this influx of new development. Whether it is you know, Penn station redevelopment, the MTA site on Madison and Vanderbilt, that is being redeveloped, Jp Morgan Chase, that is bringing you know, an additional 6,000 employees into their new headquarters, the possible redevelopment of Macy's and the upzoning. So we know that you know there's a number of land use, actions that are in the pipelines and that the evaluation of this particular project must be done, taking all of that into account. So you know that this we're you know specifically asking that they brought in the scope. Thankfully, okay, any other questions seeing none, we will move into comments, use the raised hand David Aquilas. Yes, just to give a little bit of background to this project. Can you hear me a little louder? It's a little. Can you yeah just to give a little background in part to answer Clayton's question? If you can look at the drawing, you will see that the open space that is provided at the base of the third floor, the building itself the base will be bowl shaped so that the building will can deliver over the open, free space and rise into that space, something which I find very disturbing. The met life building the Pan Am building directly behind grand central station. You know what a big building that is. That's 800 feet tall! This building will be twice the size of the Pan Am building it's directly across the street, from the Chrysler Building, one of the most beautiful buildings, not just in New York, but in the whole world. So there we have a little grand central station that huge mass that is now one Vanderbilt, Plaza Little grand central station, and this huge gigantic project which will be directly across the street from the Chrysler building. It's a building, that's taller than the empire state building. We we've got to find some way to pull back in and have some level of reality to the real estate industry and what they're planning on doing the homeless situation. It's just the homeless situation around grand central. We all know about, and none of this real estate that has happened in the last 10 years, including the Hudson yards and the West 57th Street 59th Street area. None of this just helped the city in any way that I can see the homeless problem was there way before Covent, and here we are, we've got this project that is just so out of bounds to what the city really needs, but I hope somewhere. The finishing date for this is 2030, so I'm hoping somewhere in the next 10 years. We can catch our breath and pull back on this outrageous project. That's that that's my two sets. So thank you. Okay, any other comments. I, don't see any so seeing none. We will take this to a vote. Actually I think it's okay to find our bundle right, yeah! Okay, we go on to the next one correct okay, so the next application was for a site at 118, West 28th street. This is an application for BSA variants to permit the development of a non-conforming, 12-story, mixed-use commercial ground floor and residential above building in an m16 district. So we deal with these applications actually quite often, so this is a site that is located in an m16 district, which means that it is zoned for manufacturing in a manufacturing district, the permitted uses are commercial and manufacturing and residential is absolutely not permitted. The applicant is making an application with the BSA the board of standards and appeal basically saying that it is a hardship and that, in the current situation condition they can not get a return on their investment unless they build a residential building. So in order for the BSA to grant such variance, five findings need to be met, and the committee discussed the matter the applicant, you know provided some information and you know they made their case and we found that actually two of the findings were actually not met. One of them is that the site is too narrow for a commercial building, and the other argument that they made is that the building will not have any impact on the character of the neighborhood. Okay, we noted that the site is indeed narrow. If the site was located in a residential zone, this building would actually not be permitted because it would be prohibited by the sliver law. This liver law says that a site that is narrower than 25 feet a resident for residential or commercial building that such building should not be taller than basically either the lowest of the adjacent buildings or the width of the street. Whichever one is lowest so here, they're proposing a building that would be taller than any of those criteria applying to the sliver rule. We also found that it would be non non-compliant with the sky exposure plane, meaning that the building would stick out and basically take away from. You know the air and light in a way that would not conform with the zoning requirement of the m16 district, and we found that actually commercial use for class b and class c office space is much needed in cv5. And finally, our overall, you know like overarching way of looking at these applications is that we really try to discourage any Bsc variances, and we feel that if there is a need or a reason or justification for use change, they should be pursued through a rezoning, and you know we said during the committee meeting that maybe the time has come for this area to actually be rezoned and become a commercial district in which residential uses are permitted. The benefit to the community, if it is through rezoning, is that the impact of the rezoning is then being assessed. Budget is, then, you know able to be allocated accordingly and all of a sudden. You know it triggers the good. You know planning and zoning of a city. So, for example, if it were to go through a rezoning, you know, let's say, for you know the entire block. There would be an evaluation of impact on school capacity, and maybe they would find that you know it would overburden the local school, which would then trigger the ability, for you know the city or the state to allocate more funds going through a BSA variance, basically deprives our city and our state of doing their job properly allocating resources for the new use that is being enacted. So we voted to deny the application for this BSA variance. Okay, does anyone have a conflict with this application? Okay, I, don't see any. Are there any questions to the resolution and seeing nine whoops Joseph Frewer hi thanks Laila I was just looking over the resolution package. I saw that a few folks voted against this one in committee. I was just curious. If you know anyone who voted against it would be willing to talk about why or what the rationale was Joseph. That's something that we usually move into comment period. Okay, that would be a comment by anyone who wishes to comment they don't have to. But if they wish to comment it's done during the comment period. Okay got it sorry! Thank you. Any other questions: okay, we're on to the next reso. Are we doing any comments for this one? Oh, we didn't that's right. I was just talking about comments and didn't do them. Thank you, Laila. Okay, any comments. Nancy, okay, so I opposed this resolution for three reasons. I do believe the site is too narrow for a commercial building. It's only 20 feet. High brown. There are more brown stones in the city of New York that are more than 20 feet wide than this building I do not think it will impact. The neighborhood already has a number of tall buildings on the street, and my understanding is that the sliver law only applies in residential zones, and this is not a residential zone. Okay, any other comments. Tristan hi, so I also oppose this resolution for pretty much the same reasons that Nancy cited additionally I would say that you know focusing on rationale for opposing. It seems that we seem to be relying a lot on the potential to convert the building into a hotel, and so my personal view is that I think that this building would better serve the community. The neighborhood in our district, if it's adding to the housing stock of Manhattan, which is not a great supply rather than just adding another hotel to our district, then I also just like to point out like in terms of being like consistent across multiple different applications. I would just highlight that in the last application we were highlighting. This fear of you know too much commercial development going into Manhattan, whereas this is something you know going the opposite direction. It's not exactly. You know the same situation, but it's something that I think we can keep in mind like I. Don't think that moving this small building, which it's not really unreasonable, that they would struggle to turn a profit to be a commercial use given the size is really going to take too much away from the district or this community all right, any other comments. Laila there was a statement made about the whether or not this is residential. Is that something that needs clarification, because I believe that it was posed differently in the resolution, if I'm not mistaken, so you know specifically on this liberal law. So this civil law applies only to commercial and residential districts, for the very reason that it is basically meant to protect a residential use which is permitted as of right in residential and commercial districts, from the construction of buildings that are so narrow, it doesn't apply to manufacturing districts because residential use is not permitted. So if the zone and the use being permitted becomes residential, this little law should apply to this particular law that has been granted a variance, okay and that is in the resolution, am I, correct, I! Think, yes, okay! Thank you very much. Okay, all right, I, don't see any other comments, then we're on to the next resolution. Okay. So the next resolution is the zoning for coastal flood resiliency, a city-wide tax amendment to update and make permanent the temporary 2013 flood resilience Zoning tax amendment, so you're probably wondering why we're even discussing that we are land blocked and we don't have any coasts, but we felt that it was actually important to look at this text because it's a city-wide text and what we wanted to weigh in is not whether you know it's a good text. It in overall I think we're reaching the conclusion that it is a very good tax and you know very much needed for these community districts that are dealing with coastal flood type of situations during hurricanes and other. You know like heavy rain situations, and that resiliency, of course, is very critical. We were really looking at it, making sure that there's no unintended consequences that would you know be, you know, applied it Layla. Can you hear us? The one concern that we had was that this text would basically allow diesel generators to be installed in the rear yards of buildings. So you know we're a very dense built environment. You know vastly different from you know the urban contacts that you can find in Queens or Staten Island, and you know in these areas it makes total sense to allow for a generator to be installed. You know off the ground, but you know in the yard of a property, a you know, semi-detached or detached house in our district. That would mean that all of a sudden, it would be permissible to install a diesel generator at the back of a building in this rear yard alley. That, basically, is meant to provide. You know clean air and a little bit of quiet. So if you put a generator there, you would deal with bleeding fumes and noise and we felt that it was. You know a part of the text that should not apply to us, so we're flagging that, overall, you know everything else we found was good and there were no other unintended consequences. We're concerned about the possibility to use sellers as mechanical rooms. This is still permissible. We believe that it's a good use in CB5, because we're so far from any coastal environment- and you know that if it's done properly it it's a use- that is, you know, efficient for buildings in our district, but the only issue that we had was with you know, putting generators at the rear of the building in rare yards. Okay, thank you. Laila. Does anyone have a conflict with this application? I see no raised hands. Okay. Are there any questions to the resolution? I, don't see any comments, whoops wait, a minute, I think I see someone just disappeared. Did someone have their hand raised so that Nancy did, but it's gone away? Is every she's on mute, I, don't know what she's? Okay I have a comment, not a question: okay, I! Put it up too soon. Sorry, oh, okay! No questions from anyone else. Okay, comments, Nancy I think it's important to for everyone to understand that diesel generators have to be tested once a month so that an emergency situation comes up they're working properly. Not only do they create significant air pollution, but they're very noisy so having any of these generators in these back yards, which are basically small, little courtyards would be a nightmare for anyone living or working in these areas once a month. You would have this thing. Go off, so I really think the generators have to be removed from this legislation. Okay, any other comments. I, don't see any okay next resolution, all right, so the next application was 21 East 21st street. This is the Gramercy condominium. This is a building located between Fifth Broadway and Park Avenue South. This is in the ladies male historic district and although it's a land use application, the fact that it is in a historic district is actually very relevant here. This building is located in an m15 district, so it's also M stands for manufacturing, so it's also located in a mat in a manufacturing district and the applicant is seeking a use change and they want to convert the building from commercial. It's currently a commercial condo, and they want to turn it into a residential. What's interesting here is that it is not a BSA variance, it is a it is. The use. Change is done using a mechanism that is built into the zoning resolution for a building that is in either an individual landmark or in a historic district. The property has the ability to seek a use change, provided that they do a couple of things. They have to provide a maintenance plan in perpetuity for the landmark property. So you know if you're familiar with the local law 11, you know that requires for a facade to be inspected and kept in good condition. Just imagine that it's local 11 on steroids- it's you know you have to basically have a an inspection of your building and any historic parts of your building, which is you know, pretty much. The exteriors have to be in pristine, impeccable condition, so that is seen as a benefit so that you know the building is kept in. You know pristine condition. The other part of the criteria is that some commercial use has to be retained. In this particular case, the applicant should have protected 25. He is, you know, 21. He is only saving 10 percent, but overall the committee felt you know. Although we were not thrilled, we felt that it met the criteria. It's not really a discretionary action, so you know if all the criteria is met. The use change can proceed. So we voted to support this application for the use change at 2125, East 21St street. Okay. Does anyone have a conflict with this application? Are there any questions to the resolution? Are there any comments? Okay, seeing none. We go to the last resolution, all right, so the last resolution is for governors Island proposed rezoning. Once again, you probably wonder why are we weighing in on governors island? As our borough president said in her comment earlier tonight, governor's island is really a city-wide resource, so it is technically part of community board. One and CB1 is in the process of reviewing this very important, very significant major land use proposal that entails a number of things, including the redevelopment of 4.7 million square feet of development on the island because of its significance, CB1, basically reached out to all the Manhattan community boards and asked for our input. So we looked at the proposal once again, you know from the point of view of community part five. This is a an island that you know, residents and other stakeholders of CB5 may patronize the same way we go to Randalls, Island or Roosevelt Island. You know it's one of those rare, very expensive pieces of land with you know passive views, recreational use, bowl games, you know access for children and to open space, and you know a very important resource for the city. So we made a number of comments about the proposal. The first comment that we made is that you know we believe that overall governor's island should remain open and unobstructed, and that developing and building governors island is overall a bad idea. The second comment that we made is that you know if we want governor's island to continue to be a successful island serving its purpose, which is you know, providing recreational space to residents of New York City access to governor's island has to be really thought and part of this proposal. Currently there's a ferry service, it can be improved, and this is something that really should be a very clear focus of this proposal for rezoning and then the third comment that we made is that the rationale- the very rationale for this rezoning of governor's island and this development of governors, islands- that the trust of governors Island that has jurisdiction over the island- believes that governors island should pay for itself and in order to pay for itself. They think that you know building buildings is a good idea, so we this is giving us pause, and the committee you know felt that it was a flawed logic, because if you apply this logic to our parks, then I mean we currently know that you know that this little budget that is given to operations of our parks and they have to organize events, which you know we fight quite often, and some of them we can live with, but I, don't know that we could live with our parks being developed because they need more funding and basically this particular action would basically like ratify this type of logic and would basically say that you know if you really are faced with a hardship, then you know chopping off a little bit of the park and you know turning it into a building so that you can generate funding is okay, so we're basically saying that you know it's a slippery slope and certainly a you know, an economic model that governors island should not embrace. So those are the comments that we made on this particular proposal. These are going to CB1 because they are the ones who are seeking comments from community boards, but we will also share it with our elected officials. Okay, thank you. Does anyone have a conflict with this proposal? Are there any questions? Seeing none? Are there any comments, Clayton just quickly to say that we should not overestimate how alarming this proposal for the self-funding model is. It is really the I wholeheartedly agree with the committee's position on this, and that language should really cause us all to be very concerned about the city's thinking, just imagine if the Central Park Conservancy or the Madison Square Park Conservancy or the Bryant Park Corporation, if the dire economic crisis that has happened this year continued or there were other reasons why such a thing would happen that this that the city's solution would then be well, there's no more conservancy, so let's just build a building in the corner of one of these spaces and fund the public space. That way it's alarming and so I just wanted to have that comment? Okay, thank you buzz. Can you hear me? I'm sorry, I really have a question and I couldn't find that raised hand. Okay, go ahead. I have seen a plan that includes a substantial residential development on governor's island. This resolution opposes that plan, we're basically making specific and pointed comments on the proposal without getting granular, but really keeping it from the point of view of CB5. So we're saying that overall, we feel that the proper use for governor's island should remain recreational and open and should not be overburdened by development. We don't get into you know like CB1 is going to do this. You know this beautiful work of looking at the intricacies of a very broad and very complicated proposal that comes with you know all sorts of layers of complexities we're taking a step out as it pertains to us CB5, and you know the way we would use governors island. We're basically saying that we are much better off keeping governors, island, unobstructed and unencumbered by development. But does this rule out residential development partially? Currently, residential is not a permitted use on governors island and this proposal is not calling for permanent residential use is not permitted on governors. Island, temporary residential use is meaning. You know, like dorms, for example, would be a permitted use under this plan, but residential use under this plan- or you know, the current condition is not permitted on governor's island. Thank you. Okay. Any other comments, all right, seeing none. We will vote on these five one. Two. Three. Four. Five resolutions: hey Achilles, yes, Athanal! Yes, Behar! Yes, weichmann! Yes, Rosnahan! Yes, Burton! Yes, Cafaro! Yes, Clark! Yes, Dale! Yes, Docent! Yes, Ford Brewer! No! On all five! Sorry, no, but I thought we just had to group all of them. No, you can do an individual one if you wish. Oh okay, oh so, no just on. Let me scroll back up to the address 28. Yes, on the rest, thanks: okay, Garcia, yes, goshow! No, on two and four yes on one: three: five: okay, Haas! No on 28th street, yes to the rest: okay, Harris! Yes, Hartman! Yes, higher! Yes, Johnson! Yes, Quebec! Yes, kalaFARky! Yes, Kang! Yes, Kinsella! Yes, leaving! Yes, Lucy! Yes, Mafia! Yes, Mccall! Yes, Myerson! Yes, Miller! Yes, Pawson! Yes, Raybar! Yes, Shapiro! Yes, Slutskin! Yes, Smith! Yes, Spandorff! Yes, Spence! No! On 28th street, yes, on the rest, thank you stern. Thank you soon. Yes, Webb. Yes, one trout, no on 28th street, yes, one, the rest Waylon, yes, Yang! Yes, all pass! Okay! Thank you! So much Leila, wonderful job by you and that committee and the community really should have seen, and it was a great meeting. It really was thank you. Okay parks and public spaces Clayton all right. We have two resolutions tonight, I'd like to have them deemed red, so the first is the proposal from municipal art society for the creation of the position of director of the public realm in New, York, City government I think you all are familiar with this proposal and with our record on this, but basically to sum up. Why we're hearing this tonight at full board three months ago, when the parks and public Spaces Committee first heard this very initial policy proposal from the municipal arts, society and New Yorkers for parks. We determined that, as a committee, the most appropriate thing was for us to weigh in on the matters that pertain to our committee's jurisdiction and that the way that was most kind of accurate and appropriate for us to do. That was a letter of support regarding those particular parameters. After that, the same proposal was heard both at the transportation committee and also at the land use committee, and so with all of that extra information and input and questions from other board members and then to Beck's, where it became a priority for the parks component of the budget request process. We then had so much more input that the letter from the Parks committee seemed like it didn't reflect the conversations that had happened. So we heard them again at our committee meeting this cycle, and this resolution reflects issues about the street bed and department, transportation and sunlight issues that land use heard and refers to the budget process. That Beck's heard so that it's more of a robust response from the full board, and that gives us I think a greater position of strength to advocate for this position. Even as we understand that there's so many details that have yet to be hammered out, this is really kind of a statement of support for the creation of the position and a kind of you know kind of clarion call to other boards to do the same and I. I'm sure that we'll take this because Gail's super on board with this to Burro Board as well and do whatever we can to be part of the process in the next iterations of deliberating how this position could best be actualized to serve all New Yorkers and for our district. So all that said, it was a unanimous resolution of support to endorse the proposal of the position. Okay, thank you. Clayton. Does anyone have a conflict with this proposal? Are there any questions? Seeing none? Are there any comments? Okay, I, don't see any so we're on to the next one. Actually, let's go ahead and take this to a vote vicky, oh you didn't! You were going to bundle them. You don't want to well like we can bundle them. That's fine! No! It's! Okay! We can bundle save time. Our next application is from the Madison Square Park Conservancy for a installation and marketing event in Madison Square Park on behalf of the Salvation Army. So this is a it falls under the rubric of a marketing event, because it is one of four that the conservancy is contractually allowed to host in the park for their revenue raising purposes. However, this is not a marketing event in the traditional sense that we are used to hearing the associating charity that they are doing. This, for is the Salvation army and the event is basically the installation of a oversized red kettle in the southwest Gravel area of Madison Square Park to act as a reminder to the public that they exist and that they are accepting online donations, since there are no street cuddles and no coins being thrown in this year because of the pandemic. That is the reason why they have come up with this idea. The installation will have very few staff aside from security. There will be no nothing handed out no flyers or anything like that. No amplified sound whatsoever. We were concerned about maybe like an amplified like bell ringing, which would make everyone go psychotic. There will be no sound at all. There will be some lights on the kettle, which will be turned off at a certain point. Every evening there will be a generator used to illuminate the to power those lights, but it is the quietest. It's an 1800 watt generator. This is the type that the conservancy has lobbied, their event applicants to use to great success. In our opinion, over the years there will be a fixed camera that will show on kind of wide lens the existence of the installation in the park, but it is not meant to capture anyone's likeness. There won't be any interviews or anything like that, and none of the footage is going to be used aside from the live stream. So none of the footage is meant will be recorded. In fact, they said that, at the end of every day, the live stream, you know, will be like tossed it like regenerates itself, which is one of our main concerns that any footage be used for some type of commercial purpose, and they were very open to all of our typical requests about signage, using any kind of like foreboding language that you must vacate this public space. If you don't like the camera, and they were happy to commit to not using scary language, there will be no trash or anything like that. That's generated as part of the event- and this is the only marketing event that the conservancy. This is the only marketing of an application that the conservancy received this year for very obvious reasons, and as it is only one out of four and as they are at a I believe. The executive director reflected it committee that they're at a 90 loss of expected revenue for the year due to the pandemic. They are happy to have the application, and, given that our committee and this board for about a decade now, has used a matrix of 12 different categories of ways. In which an event impacts the public space, we use that matrix to determine whether or not we can support a given event. This installation certainly passed that rubric with flying colors, and so the committee did vote majority to approve the application. Okay, thanks Clayton. Are there any conflicts with this application? Are there any questions to the resolution? See none. Are there any comments? Okay, we will take this to a vote of both resolutions. There is a comment: Vicky oh Chris, Clark, Christopher, yeah, I just wanted to and sorry I was a little late with raising my hand. I just wanted to clarify. I was one of the people who abstained the first time around I just want to provide some background to that. Mary had brought up some issues with how Salvation Army has run their homeless shelters from her personal experience, her career experience and given the focus of this installation on Salvation Army as an organization rather than on a product that was being debuted. For example, it was my thinking that and I can't speak for anyone else who abstained, but my thinking that hosting this event would in some ways serve as an endorsement not by us but a use of the public space to promote an organization and that the value of that work is being called into question and so I just wanted to explain. That was the intention behind the abstention in the committee vote. Okay, are there any other comments? Okay? Now we will take this to a vote for both resolutions. Thank you, Yang. Yes, waylon. Yes, Wine Trail, yeah Webb, yes, zoom! Yes, stern! Yes, Spence! Yes, Standoff! Yes, Smith! Yes, Slutskin! Yes, Shapiro! Yes, Raybar! Yes, Pawson Ross, Miller, yes, Myerson! Yes, Mccall! Yes, Mafia! Yes, Lucy! Yes, Levy Logosico! Yes, Kinsella! Yes, Kang! Yes, kalaFARky! Yes, payback! Yes, Johnson! Yes, higher! Yes, Hartman! Yes, Harris! Yes, Haas! Yes, Goshau! Yes, Garcia Brewer! Yes, Ford! Yes, Dosan! Yes, Dale! Yes, Clark! Yes, I'm number one abstain on number. Two: okay, Clark! I'm sorry chew! Yes, cafaro! Yes, sorry keep being on zoom. It's okay! Burton! Yes, Brosnahan! Yes, on the first abstaining on the second bikeman: yes, Behar, yes, Athanal, yes, Michaelis; yes, I'm the first I'm staying on the second. Thank you motions all passed over all pass. Okay, thank you! Clayton! We are on to budget education and city services Renee for a report. Hi Vicki. Thank you. I just want to report on Beck's presentation from the New York smoke free and their youth group reality check, which is made up of local students, New York's, small korean reality. Checks purpose is to reduce tobacco usage and secondhand smoke exposure, and they do it through education policy and advocacy initiatives, so they provided the committee with a 15-minute video entitled black lives, black lungs, which showcased the exploitation of communities of color by the tobacco industry. The film demonstrated how tobacco companies have strategically targeted the black community in their marketing and advertising campaigns specifically around when promoting menthol cigarettes. Obviously this results in health disparities, so our board office I think has shared the black lives black lungs video link with everybody here, so they would the reality check presented to Bex in their quest to reach a greater audience and educate. As many people as possible, so I urge everyone to have a look at that and share the video if they can. Okay. Thank you very much. It was interesting and I loved seeing some of those students. They were wonderful, absolutely okay, landmarks Layla for the last two russels of the evening. All right, let's bundle first resolution is for 122 fifth Avenue. This is an application for storefront alterations, Rooftop edition landscape roof at the existing building and a new building at the adjacent parking lot at 9, West 17th street. So this is the ladies mile historic district between 5th and sixth avenues. This application actually came to us in 2019. They wanted to build a very large, a very visible rooftop edition and we didn't like it at all. Somehow, although they were approved by LPC for a rooftop edition that was actually pretty substantial, they decided to go back to the drawing board and instead they decided that they would build the existing vacant plot. That is to the west of their property. They would infill this slot and they would build a one-story rooftop edition. As a result of rooftop edition is entirely non-visible from any thoroughfares, it is actually pushed back, so it's also not obstructing windows from their adjacent neighbors, and so overall we felt that it was an improvement. Now we still had some concerns. Two concerns we have the first one is they want to install flagpoles two flagpoles on their fifth Avenue facade. We felt that it was inappropriate. It would be visual clutter. We told them that Fifth Avenue normally at that particular area, is a you know, part of the landmark district, but it is also a exceptional vista corridor. As for the charter of New York, so that type of intrusion is not appropriate, not contextual. The other issue that we had was with the proposed canopy that they want to install in front of the new entrance at the new building, so the new building would now serve as the main entrance to the office building. It would be connected to the existing building and the entrance would now be on 17th street. If you look in your reso package, you have the renderings. Basically, the canopy sticks out from the new building. Pretty much all the way to the curb very prominent, very big, very bulky. You know very much visual clutter and although we say in the resolution that we can live with some canopy, it has to be drastically reduced in its width to be conforming with the hit the historic district. So we voted to deny unless those two aspects were reworked so eliminating the flagpoles and drastically reducing the academy thanks, Leila. Okay, does anyone have a conflict with this application? Are there any questions to the resolution? See none. Are there any comments? I, don't see any so we can move to the next one oops all right. Do we have someone? No okay, so next one 18 east 50th street, this is an individual landmark. It's across the street from Saint Patrick's Cathedral, beautiful building they are proposing to replace their windows. The existing windows are non-historic. They are ugly, terrible and done in a way that is absolutely not contextual. They are proposing windows that are still non-historic, obviously, but they are much more sympathetic with the way the building was built, originally they're, getting rid of the like hideous transom bands that sit on top of the windows currently so they're, not removing any historic fabric, they're, putting windows that are much more pleasing. We approved we liked it. A lot. Tell us how you really feel yeah. Okay, any comments to this resolution, any I'm! Sorry, any conflicts, nope any questions, any comments to the hideousness I, don't see any okay. That means we can take a vote on the last two resolutions and this will be the last vote of the evening and then we are on our way to finishing out 2020. Thank goodness Achaelis, yes, ethanelle, yes, bayhawk, yes, weichmann, yes, Rosnahan, yes, Burton or yes, Dale! Yes, doesn't yes, Ford? Yes, roar! Yes, Garcia! Yes, Joshua! Yes, Haas Harris! Yes, Hartman! Yes, higher! Yes, Johnson! Yes, Kbac! Yes, Kaliforski! Yes, Kang! Yes, Kinsella! Yes, Levy! Yes, Mafia! Yes, Mccall! Yes, Myerson! Yes, Miller! Yes, Fossen! Yes, Raybar! Yes, Shapiro! Yes, let's get into the yes Smith; yes, Spandor! Yes, Spence! Yes, Stern! Yes soon, yes, Webb, yes, wine, Trout, yes, Wayland, yes, Yang, yes, Resolution path! Okay, that wraps us up. I wish all of you a very happy holiday and a great new year see you in January good night, hey good night holidays, Happy, New, Year, Happy, holidays, Happy, New, Year, Happy, holidays, Happy, New year, Happy, holidays.",
      "summary": "The chairs, report, the committee reports, resolutions, questions and comment period and voting and comments or questions from other applicants or the public or if additional information is needed, is only allowed with the chair's approval.\nFirst wish everybody a happy holidays and to say thank you for everything that the community board does throughout a very difficult year.\nI. Do look forward to you know, seeing all you applications come in, make sure you reapply if you're up this year and if you're, if you are, you know one of mine, you're, probably in good hands, because you're all doing such a great job.\nAnd he's going to be great, welcome, say hello to Marissa, because I, don't think I've seen you since you've been here and also just say, Thank you and happy holidays to everybody for well.\nI, think Liz Krueger, yes, Senator, Liz Krueger is with us welcome Liz. We go hi, everyone, well, I, don't even want to go after Keith, because he pretty much said what I was also coming.\nTo say, which is thank you for all the work that this community board does and doing such an extraordinary job representing the people of CB5 and making it easy for your elected officials to learn about issues that matter and to work with you to try to come to the best resolution.\nWe live on Hollywood squares like this, but work continues in a very difficult time, and so many people in our city and our country are suffering but government, Even when we get things wrong.\nAnd, I, Think, it's going to stay and people who don't know Brad who's been with me.\nI did a hearing actually on maternal mortality, This past Monday because of the issue and familial support and visitation to those in labor and delivery rooms, and we also did another hearing on vaccines which, If you haven't seen, they are expected to roll out in a phased approach as soon as December 15th lots of questions and concerns, there.\nYou know if it's on quality of life issues, you know, we've been working to restore some of the sanitation services that have been cut or working with some of the local block associations, even to remove something like a couple phone booths that have been incredibly problematic throughout the community.\nAt the start of the pandemic, our office launched an investigation into the city's response, and we wanted to find out what happened in those early days, weeks and months to make sure that next time, around now, when we're in the second wave we'd be able to respond better to this crisis.\nWe hope for more, because I think people are realizing that the garment center can still be a place that you want to have garment manufacturing, given the fact that retail and business and so on, is not so fast returning.\nAny community board is welcome, certainly with the Eastern District Helicopter Association Etc and some of the companies have agreed to participate and then, When we figure out exactly what New York's position is we're going to meet with all of the folks in New Jersey we've been in touch with all the elected officials in New. Jersey.\nI want to thank you for your public realm proposal, you're, the first board to do it.\nYou make an application, You know it's one of those good things, but it needs a public realm czar, because now there's another agency to add to your list.\nAs you know, Committee, Board applications for new members and for those who are hopefully reapplying are due February.\nI. Think it's a really important step forward in New, York, City having home rule over its traffic laws.\nWe have to make sure we have the revenue, so I'll be fighting for that over the next few weeks, third I advocated, along with councilmember powers, a survival plan for small businesses in grand central terminal that have had little to no revenue because of the foot.\nHaving ceased in that and that great space, We worked out a deal with the MTA, where the small businesses are going to be giving a portion of their actual earned revenue to the MTA, and we think it's a model for other commercial landlords.\nI think just an hour ago wanted to let you know that I was a guinea pig for that at the Nyu Lange Langone Vaccine Center.\nThe Fda's regulations are in place for a reason to make sure that the safety is upheld and I really want to thank Nyu Langone for participating in this trial and making sure that you know we fight our way out of this virus as soon as possible, and that the vaccine is widely distributed and fairly distributed to the communities, mostly black and brown, that have suffered the hardest during this crisis.\nIn their buildings, and, finally, just kind of an end-of-year wrap-up, Our district office and community volunteers have continued throughout this year to ensure that residents will not go hungry.\nThe community gets input if every occupant every applicant for a liquor license knows they can just go to an electric elected representative, Then they're not going to work with the community and the community's interests are not going to be, are not going to be taken into account, so, I'm, very distressed at Keith Powers.\nI am representing guilty house, and I want to basically represent how disappointed sad and frustrated we are with the decision that recently was passed by the SLA to approve the beer and wine license of 1204 broadway.\nWhat we've heard, it was based upon the recommendation of council member Keith powers, whom this whole building, including our attorney Kate Quinn, and of Course Leslie Hendricks.\nWe've lived here since 2010, I'm speaking out to express my deep disappointment at the Sla's decision to approve the wine and beer application at the glass ceiling located right next door at 1204, Broadway.\nWell, you know I ought to share it with the rest of all of you, because you've worked so hard on these things, but just to give you an idea of what we really accomplished this year so bear with me, because here we go in January, we learned that Gail was opposed to term limits for board members and she encouraged members who agreed to voice their opposition.\nWe passed a resolution ray congestion pricing requesting at least two members of the traffic Mobility Review board to include one individual, representing interests of those living within the area and one living outside.\nWe announced that our committees will be holding a series of meetings to address issues such as alternative policing, models, access to housing, etc, and we invited and encourage the public to attend and participate in order to best represent the needs of everyone in our district and provide a voice for all the committees of the board reported on their letters to the mayor.\nWe urgently requested removal of the current moratorium on park, space and ball field permits, and we urge the parks department to consider and remove all structural barriers regarding participation in summer youth programs in the fall in September with the city proposing the relocation of clients from the Lucerne hotel to the Harmonia permanent Shelter at 31St, street.\nWe spent actually our Bex Committee, in particular an inordinate amount of time working with various agencies, our electeds and community members.\nWe supported the bill to exempt additional small businesses from New York, City commercial, rent, tax, and we addressed and supported the municipal arts, society's advocacy and proposal for a new position in city government called director of the public realm in October.\nWe recommended approval of the Flatiron buildings alterations and in November we address fiscal year, 22 district needs statement and budget priorities and the.\nLet's hope that next year, at this time, we will no longer be talking about thinking about worrying about Covid-19 matters or what the latest twitter will be coming out.\nEvents at 1204 Broadway, the tavern wine license, allows the premises to serve beer wine cider things like that anything, but hard, liquor, This location for people who don't know is immediately adjacent to the guilty.\nWe denied the application, which is rare for us, We reserve the denial of liquor license applications only for those most extreme cases and because of the rooftop location, so immediately adjacent to the residential building.\nOur denial was supported by guilty house, of course, other neighboring buildings, the 29th Street Association, as well as various elected officials, assembly, member Gottfried, Senator Krueger for President Brewer and council member Keith powers in April, The state liquor authority agreed with us and denied the applicant's application for a full liquor.\nWe immediately responded to their application again requesting denial on the same grounds, The fact that the rooftop is so close to the residential building.\nSo we're a little bit disappointed in council member powers for his lack of transparency for failing to consult with us before he changed his position on us and for his lack of hearing the resident's position before he changed his position, and it was mentioned during the SLA hearing, The members of the liquor authority said that the electeds being in favor of the new application was dispositive.\nGenerally, Restrictions like that you know, could certainly be appreciated, but in a situation like this, where the rooftop is so immediately adjacent to a residential building, Even restrictions like this can not mitigate the disturbance that this is going to cost to the residents.\nDraft scope of work basically defines what should be reviewed in the environmental study, So the question that was in front of us was not really whether we like the building.\nWe want to make sure that you know the additional pedestrian traffic that is going to be caused by this building is not only mitigated, but that the original you know like the like structural, endemic pedestrian congestion, is also taken into account and mitigated.\nWe emphasize that we talk about sustainability and we want to make sure that this building is going to be as efficient as possible.\nWe also want to know what is the source of energy that this build building is going to use, and we are also raising concerns about the base formula by which the density is being calculated.\nSo in that particular case, the site where the building is going to be built, is you know where the current Grant Hyatt sits, but the applicant did something that is, you know quite interesting, and we had not seen that before.\nYou know like the bread and butter of reviewing East Midtown zoning, open, space, shadows, historic and cultural resources.\nWe also want to make sure that you know these new developments are coming online are not designed in a vacuum.\nI should add that, in order for the developer to get this bonus density that they're applying for they are doing some transit upgrades, We did talk about the transit upgrades at our land use committee meeting, but we feel that the transportation and environment Committee should take a look at it, which they're going to do.\nWe basically ask that the environmental impact statement incorporates all these elements and looks deep into those issues so that we have as good a building as we can possibly can.\nSo with this particular application, they are actually proposing an amount of open space that is conforming in compliant with the zoning resolution, so they're not asking for any special permit or amendment they are from the get-go proposing ten thousand square feet of open space.\nThe question with this particular project is that the proposal calls for this open space to be actually located on the second and third level of the building, and you know, th.\nIt has the perception of being less accessible, and you know this is something that we talk about in the resolution where we want to make sure that accessibility and perceived accessibility are assessed and addressed.\nNow they're, talking about adding all these thousands and thousands of additional square, feet, I'm thinking the empty state building from the 1930s that has that I know.\nIt serves as a you know, a loading area for the post office and other buildings, so the functionality is not going to change.\nWe are certainly on record, saying that you know developing so much commercial office space in our district may turn out to be problematic.\nThis is an application for BSA variants to permit the development of a non-conforming, 12-story, mixed-use commercial ground floor and residential above building in an m16 district.\nWe deal with these applications actually quite often, So this is a site that is located in an m16 district, which means that it is zoned for manufacturing in a manufacturing district, the permitted uses are commercial and manufacturing, and residential is absolutely not permitted.\nYou know the air and light in a way that would not conform with the zoning requirement of the m16 district, and we found that actually commercial use for class b and class c office space is much needed in cv5, And finally, our overall, you know.\nAnd you know we said during the committee meeting that maybe the time has come for this area to actually be rezoned and become a commercial district in which residential uses are permitted.\nThink that moving this small building, which it's not really unreasonable, that they would struggle to turn a profit to be a commercial use given the size is really going to take too much away from the district or this community.\nThe next resolution is the zoning for coastal flood resiliency, a city-wide tax amendment to update and make permanent the temporary 2013 flood resilience Zoning tax amendment, so you're probably wondering why we're even discussing that we are land blocked and we don't have any coasts, but we felt that it was actually important to look at this text because it's a city-wide text and what we wanted to weigh in is not whether you know it's a good text.\nI, don't see any okay next resolution, all right, so the next application was 21, East 21st, street.\nWe voted to support this application for the use change at 2125, East 21St street.\nOur borough president said in her comment earlier: tonight, governor's island is really a city-wide resource, so it is technically part of community board.\nOne and CB1 is in the process of reviewing this very important, very significant major land use proposal that entails a number of things, including the redevelopment of 4.7 million square feet of development on the island because of its significance, CB1, basically reached out to all the Manhattan community boards and asked for our input.\nThe second comment that we made is that you know if we want governor's island to continue to be a successful island serving its purpose, which is you know, providing recreational space to residents of New York City.\nI wholeheartedly agree with the committee's position on this, and that language should really cause us all to be very concerned about the city's thinking, Just imagine if the Central Park Conservancy or the Madison Square Park Conservancy or the Bryant Park Corporation, If the dire economic crisis that has happened this year continued or there were other reasons.\nWhy we're hearing this tonight at full board three months ago, when the parks and public Spaces Committee first heard this very initial policy proposal from the municipal arts, society and New Yorkers for parks.\nAfter that, The same proposal was heard both at the transportation committee and also at the land use committee, and so with all of that extra information and input and questions from other board members and then to Beck's, where it became a priority for the parks component of the budget request.\nMy thinking that hosting this event would in some ways serve as an endorsement not by us, but a use of the public space to promote an organization and that the value of that work is being called into question and.\nThis is an application for storefront alterations, Rooftop edition landscape roof at the existing building and a new building at the adjacent parking lot at 9, West 17th, street.",
      "execSummary": "I am representing guilty house, and I want to basically represent how disappointed sad and frustrated we are with the decision that recently was passed by the SLA to approve the beer and wine license of 1204 broadway.\nOur denial was supported by guilty house, of course, other neighboring buildings, the 29th Street Association, as well as various elected officials, assembly member Gottfried, Senator Krueger for President Brewer and council member Keith Powers in April.\nGenerally, restrictions like that you know could certainly be appreciated, but in a situation like this, where the rooftop is so immediately adjacent to a residential building, even restrictions like this can not mitigate the disturbance that this is going to cost to the residents.\nSo in that particular case, the site where the building is going to be built, is you know where the current Grand Hyatt sits, but the applicant did something that is, you know quite interesting, and we had not seen that before.\nThe question with this particular project is that the proposal calls for this open space to be actually located on the second and third level of the building.\nThis is an application for BSA variants to permit the development of a non-conforming, 12-story, mixed-use commercial ground floor and residential above building in an m16 district.\nThis Sliver Law says that a site that is narrower than 25 feet a resident for residential or commercial building that such building should not be taller than basically either the lowest of the adjacent buildings or the width of the street.\nYou know the air and light in a way that would not conform with the zoning requirement of the m16 district, and we found that actually commercial use for class b and class c office space is much needed in CB5.\nAnd finally, our overall, you know like overarching way of looking at these applications is that we really try to discourage any BSC variances, and we feel that if there is a need or a reason or justification for use change, they should be pursued through a rezoning, and you know we said during the committee meeting that maybe the time has come for this area to actually be rezoned and become a commercial district in which residential uses are permitted.\nOne and CB1 is in the process of reviewing this very important, very significant major land use proposal that entails a number of things, including the redevelopment of 4.7 million square feet of development on the island because of its significance, CB1, basically reached out to all the Manhattan community boards and asked for our input.\nThe second comment that we made is that you know if we want governor's island to continue to be a successful island serving its purpose, which is you know, providing recreational space to residents of New York City access to governor's island has to be really thought and part of this proposal.",
      "meetingType": "Infrastructure",
      "readTimeExecSummary": "2 min read"
    }
}
}