{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UCBi2mrWuNuyYy4gbM6fU18Q",
            "title": "Community Board 14 Public Hearing",
            "publishDate": "2020-10-01",
            "shortDescription": "Brooklyn Community Board 14\\nPublic Hearing\\nWednesday, September 30, 2020\\n6:30 PM"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "dateCheckLast": "10/1/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 38,
                "um": 28
            },
            "wordCountFullTranscript": {
                "building": 11,
                "r2": 10,
                "floor": 9,
                "feet": 9,
                "space": 9,
                "portion": 8,
                "permit": 7,
                "zoning": 7,
                "r32": 7,
                "yard": 7
            },
            "wordCountSummary": {
                "portion": 4,
                "permit": 4,
                "zoning": 3,
                "home": 2,
                "enlargement": 2,
                "street": 2,
                "coverage": 2,
                "space": 2,
                "r2": 2,
                "sections": 1
            },
            "fullTranscript": "The purpose of this hearing is to hear public testimony with respect to a special permanent application to the board of standards and appeals, calendar number 2020-50, b, z, 4, 2, 3, 2, 8 olean street block 7677 lot, 7 8 special permit applications have been filed with the board of standards and appeals. Pursuant to the sections, 73-621 and 73-622 of the zoning resolution of the city of new york, as amended to request two special permits to enlarge an existing single-family residence, one for the portion located in a residential r2 zoning district and one for the portion located in a residential r3-2 zoning district. If you wish to testify on this issue, please use the webex, raise your hand, function to speak or email. Your comments and questions to info at cbb, 14, Brooklyn DOT com comments received during the hearing will be read aloud for the record. Please state clearly for the record, your name address and organization prior to giving testimony at this time, I'm going to ask the board members who are present to unmute yourselves and introduce yourselves I'll start. I'm ed powell, chair of community board, 14. gail smith. First, vice chair, hello, remember greg alvarez member maria sirivan hazelwood member. I believe I saw some more members present. This is ed sun member right here. Remember: there are additional members present, please unmute yourselves and introduce michelle brunson member hello. Earlier. I think someone just talked over me. Sorry, I'm a member by the way, okay, the first speaker will be lira. Hartman, all right, good evening, lira altman from the office of lyra altman. Do you want me to go through the case or do you want to introduce it? Mr powell, pardon me laura. Would you repeat that I said: would you like to introduce the case, or would you like me to just go right into it? Please go right into it. Perfect, I'm lyra altman and I'm representing the hatted family and maya hattie's with us this evening. As I said, she's 39 weeks pregnant, so she excuses herself. Please understand they are looking for a special permit for a home enlargement for their home at 2328, olean street and I've emailed around for your request documents. What I'm going to do here is I'm going to hold this up for you, and what you're going to see is a very unusual lot and one portion of it, which is a long olean street, is in an r2 zoning district. This portion right here is an r32 zoning district and, as I said, you do have this in your email as well from anya what they are looking to do. This is the existing building and I will show you the proposed in a moment with images they are looking to enlarge in the front yard here that enlargement will maintain the required 15 foot, front yard, they're, also looking to add, on top of the existing building. By doing that, they will be putting a full second floor and a partial attic. This piece right here will only have second floor. The remainder will have the second floor and attic, as I said, they're also looking to enlarge right here and, as we said right here, those are the portions. I will hold it up now, the amended portion just to give you somewhat of a visual and then, of course, I will go through what the zoning waivers are, but I want you to see what we're looking at since you don't have the advantage of looking at a model while we're talking now holding up the images of the home what they are proposing to provide. You is quite a lovely home. This is what the front will look like. The beautiful mansard style roof the side view of the building right here. This is the rear view, and here is the other side. Now let me go through the waivers that are being requested in order to obtain this first they're requesting a flurry waiver in both the r2 and the r32 zoning districts in the r2 zoning district. It's going to be a typical 73, 622 request, which means we're allowed to 0.5. We typically request up to approximately 1.0. In this case, we are looking to request a 0.98 which is a total of 1889 square feet. The other waivers in this district are open space ratio, as we all understand, as the floor area goes up, the amount of open space goes down and a side yard waiver. When you look at the existing building, I'm going to pull the image up you're going to see one of them is it one of them. Has a 7.54 interest side yard right here we are just looking to extend it. Okay, we are not looking to reduce the required side yard we're just looking to extend the pre-existing non-complying side yard. They should be five and eight they're. Actually, five foot, four or five point four and seven point: five: four! So that's in the r2 district in the r32 district, it's a little different, we're looking for a 73 621 special permit. The difference is in that special permit. We can only request a 10 enlargement floor area, a 10 increase on the lot coverage and a 10 decrease in the amount of open space. Now, although the base floor area is also 0.5 in that district, what we're able to do is we're able to add 20 under a sloping roof between 5 and 8 feet in height, which brings us to a total permitted, far 0.6. We are requesting a total of 0.63 in this district and once again we're impacting the open space and the lot coverage because, as the building gets bigger, the amount of lot coverage once again will increase. The amount of open space will again decrease for the record. The amount of floor area on this portion will be 995.25 square feet. Those are the waivers its floor area in both districts. It's the open space and lot coverage in the r2 and the r32. I apologize open space ratio and the r2 and one side yard in the r2. So if you have any questions, I'm happy to answer them. Thank you. Yes, any questions or comments from board members. Please raise your hand virtually and I don't see any hands, but I do know that there are a couple of attendees who could not get on as panelists. I'm gonna ask if alex could please make sure all? Oh, maybe there's only one attendee if you could make sure that attendee and any others that I've not seen are unmuted, I believe, is just our client right now. No there's! I think we have michael sedillo one of our board members on as an attendee. I just got an email to that effect, not sure you raised my hand, I just muted him. Oh yes, hi! I have no questions. Thank you so much so sean well welcome to the talkers. Yes, sean! I thought I virtually raised my hand, I'm not sure. If you can see it or maybe I just hit the wrong button. I just didn't scroll up high enough, but go ahead barton you're, the only one with a hand up right now, so it seems like the problem with being tall. You have to keep scrolling up looking at the numbers. Do I see that the finished new building will be 57 feet high and that the two adjacent buildings are roughly half that size? No, the proposed finish building is 35 feet. I can show you the drawing okay, because I'm looking on page 11 of a11 is roof elevation 57.63, that's elevation, that's not height from the seller, so I see so you lose 20. yeah! That's! This is what the actual height is. It's 35 feet, and here is an image of it with the block got it. That makes much better sense. Thank you. No, we would not bring you a house that was 50 feet high. I greatly appreciate that my bad apology is. I will now lower my body's necessary. That's why we're here? Okay, are there any other hands raised? Yes ed. I have my hand up at sean. Okay lear is there more than one building on this lot specifically? Is there a garage? There is. Let me you know what I'm gonna have to use my big plans, because those are the ones I've now ripped apart, the other ones. This is what the lot looks like, and here it is in the back. Could you because this board customarily has a concern about garages that are located too close to the residence? Could you tell me the distance between the garage and the wall? This is quite a distance. You guys typically request three feet. We don't have a dimension here, because it's such a large space looking at it and scaling it. I would say it's probably approximately 10 feet, there's a large different distance between the two okay, that wasn't a question just wanted to make sure that was clear to the board right and I will tell you the building. Remember is already existing in that area. If you compare the existing and the proposed okay, any other board, any board members hands. Okay, hearing none. Are there any pre-registered speakers sean there was nobody pre-registered. I think there are a couple members of the public on the meeting tonight I don't know. Can I speak just identify yourself, please hi everyone. My name is marie antoine pierre and I'm a residence of east 16th street between beverly and the dead end. This is like my first meeting, so I was introduced by monique chandler waterman from east families village. So this is pretty much my first meeting, so I'm thank you for having me on to you, know, to assist and see what any other members of the public like to speak. Please unmute yourself or raise your hand, and I see this is anya. I see that greg alvarez has his hand up. Okay, greg, please, oh sure, thank you. Thank you for the presentation and the house looks lovely. I just had a question when you were talking about the waivers that are being requested, and that is that under 73 60 30. Is that correct? The waivers there's two sets of waivers we're requesting a special permit under 73 621 for the r2 and 73 622 for the r2, because in the 73 622 special permit, which is what you typically see in your board, is only permitted in the r2 zoning district, because the lot is split. We've had to do two special permits, one for each zoning district right. Okay, you mentioned, though the 10 requirements that you can exceed up to them. Oh, it's under 621 as well correct, 73 621 is the 10 enlargement that you get for anything that's in the r32 on this slot 783622 is the special permit you're used to seeing, which is what we're using on the r2 portion of the lot. Okay yeah. I see that now. Okay, thank you and we're not exceeding that ten percent. The 110 percent requirement anyway, 0.6, is what we're allowed we're going to 0.63, that's well below 10. Okay, thank you. I just wanted to make sure that and then just one question design question on the exterior: are there any? Is there any external lighting? That's proposed other than your typical? You know front door light that would go on the outside. Obviously, that hasn't been designed yet or even considered. Yet until we get through BSA and trying to determine the bulk of the building, we don't start designing, or I should say the client doesn't design. I step out at that point things like lighting and landscaping. Okay, I just wanted to see if there was any intention of putting any sort of additional lighting. I don't know if you've talked with that with your client. I have it because it's really not part of the application and something again until we know what the final outcome on the building is going to be it's too premature to start designing the landscaping and the lighting that goes with it. Well, I mean part of part of our review is to ensure that it fits into the harmony of the of the community as well. So it does seem like a consideration, at least at this point, but you're saying that it hasn't been considered. At this point, I can truthfully say in 20 years you're the first person to ask me that question on the house on a gas station. I get that question. A lot on a house is not often yeah. Okay, just checking all right. Thank you very much. That's all I don't mind answering that question. Actually, regarding lighting hi, it's maya, she lear is right. It hasn't been designed because we wanted to make sure everything was approved before we spent the time doing that and landscaping as well. We do plan on having outdoor lighting but conservative so something that doesn't really doesn't shine on the neighbors or is an interference. Obviously I would hate that I have that problem now elsewhere, but something conservative to kind of highlight the features of the home, but nothing too nothing to make it stand out too much kind of low-key, but absolutely a little bit of lighting. Okay yeah, nothing to spill over, though, to the to the neighbors or anything. Oh, no, okay, all right yeah! All right! Thank you! Thank you for waiting. Okay. So thank you, maya for shedding some light, as it were on that. Are there any other members of the of the public that would like to speak on this? I see that byron percent has his hand up, but okay, that's a new question. Sorry, should I go ahead sure, oh thanks! So, first of all, I someone may have asked at the very start, but we've had no letters or anything sent and they sent out the round of notifications. Lira did clara did do a mailing lira. Will you address that you did do a mailing to everybody notified radius, of course, and we don't have any other input we didn't receive any. We did not. We did not get any. No, we don't have any pre-registered speakers or pre-registered remarks and I received no phone calls. Okay, great one other question: again: I'm going to show my ignorance but lear if you could just walk me through a little bit. So the aggregate far is point nine, eight correct on the entire. Well, it's not the entire. We have to split the lot by zoning district, so in the r2, it's gonna be my question just really briefly, through what the ramifications were and how you apportioned parts of the enlargement within two different zoning strips. If you look at the lot this portion of the lot, this triangular piece right, I see that is in the r3 too right. So I saw the demarcation what we did was we took this area the lot area we multiplied it by 0.5 and that got us our permitted far. So this is what we use for the far for that for the open space. For the lot coverage everything r32 is based on this triangle. Everything r2 goes up here across comes down comes here. I know this is here. It comes back here comes back in so this is a little bit of an odd spot right here, but it's still easier. R2 is based on the calculation of this area. Only so we cannot look at the aggregate floor area is an accurate depiction of anything so we're 0.63 in the r32 we're 0.98 in the r2, okay, based on their respective lot area. Yeah. We had an instance with a lot up on sure. Rauschel triori has joined the meeting. Sorry I was just saying we had an instance with a lot up on church. I believe where again, the lot was split into two different zoning districts and the developer seemed to be pushing more of the higher far section. That naturally makes sense with. So I just was just happy to hear you just spell that out exactly as I hope you would so and by the way, the permitted far in both the base in both is a 0.5. You just get a 10 bump or 20 bump automatically under a sloping roof in the r32, which you don't get in the r2. There's, really not a tremendous difference between the two districts: okay. Well, that's a nice one where the two are roughly commensurate, rather than ones where you have all of a sudden, a sudden jarring break a single lot between two massively different zoning. Okay, thank you. Love my hand. Are there any additional questions or comments? No hands are up ed, okay, so this is. This is the time that we huddle board members and arrive at consensus. Who was that frying? The erenberger motion to approve okay, he bends off? Second, okay, to be clear: the board members are really frying. I just want to be picky about this you're, making a motion to recommend approval to the full board at our full board. Meeting on October 13th, I stand corrected. Thank you. Okay, you've heard the motion it's been seconded. Is there anyone opposed raise your hand if you're opposed or unmute yourself and speak? There are no hands raised and there are no speakers speaking okay and then I take that as full concordance with the board members. This will be will it will be recommended at the full board members at the full board meeting. Forgive me tonight that you know we will. We will recommend approval at the full board member at the board meeting and that meeting for the record is tuesday, October 13th, that's an unusual day of the week for us to hold a meeting, but it is tuesday October 13th. We will meet on webex again at 6 30.. Thank you very much. Everybody thanks. Everybody. Thank you. Lyra. Thank you, nice to see your face nice to see everyone. Thank you. Everyone bye, this hearing is concluded at 6 57. great ed. Thank you bye-bye. Thank you. Everyone browse tell them stories. Thank you have left the meeting you.",
            "summary": "Pursuant to the sections, 73-621 and 73-622 of the zoning resolution of the city of new york, as amended to request two special permits to enlarge an existing single-family residence, one for the portion located in a residential r2 zoning district and one for the portion located in a residential, r3-2 zoning district.\nAnd I'm, representing the hatted family and maya hattie Please understand they are looking for a special permit for a home enlargement for their home at 2328, olean street What I'm going to do here is I'm going to hold this up for you, and what you're going to see is a very unusual lot and one portion of it, which is a long olean street, is in an r2 zoning district.\nWe can only request a 10 enlargement floor, area, a 10 increase on the lot coverage and a 10 decrease in the amount of open, space.\nWe are requesting a total of 0.63 in this district and once again we're impacting the open space and the lot coverage because, as the building gets bigger.\nThere's two sets of waivers we're requesting a special permit under 73 621 for the r2 and 73 622 for the r2, because in the 73 622 special permit, which is what you typically see in your board, is only permitted in the r2 zoning district, because the lot is split.\nOne for each zoning district Is the special permit you're used to seeing, which is what we're using on the r2 portion of the lot."
        }
    }
}