{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "title": "Community Board 10 November 16th General Board Meeting",
            "publishDate": "2020-11-17",
            "shortDescription": "",
            "lengthSeconds": "2:05:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "-DaJbc83Y_8",
            "fillerWordCount": {
                "uh": 136,
                "um": 316
            },
            "readTimeFullTranscript": "67 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "building": 48,
                "hotel": 43,
                "favor": 41,
                "street": 25,
                "zoning": 25,
                "rezoning": 23,
                "parking": 21,
                "services": 20,
                "developer": 18,
                "businesses": 16
            },
            "wordCountSummary": {
                "hotel": 12,
                "businesses": 10,
                "right": 6,
                "developer": 6,
                "street": 5,
                "zoning": 5,
                "building": 5,
                "parking": 5,
                "business": 4,
                "restaurants": 4
            },
            "fullTranscript": "Yes, please anyone who is not speaking, please put yourself on mute. That goes anytime, you're, not speaking during the meeting please. This is why sorry Larry now the audio doesn't work marking the speaker. Doesn't sorry, okay, so Joe, okay, so we are now live streaming and I'm going to share my computer okay. So I'm going to mute everyone, Laurie and then you're going to unmute yourself. Thank you. Okay, you ready to go Joe. Just let me know: okay, I'm ready. Okay, there we are okay, so it is. This. Is the community board 10 of Brooklyn general board, meeting for November, 16th 2020 and calling the meeting to order at 704 pm? We do have a quorum and this meeting is live stream on YouTube at Wwe, Backslash, Channel, Backslash, Upc, Ucp, Ue Xmst, and you can find us if you, google us so I'd like to start this meeting with the honor of the pledge, as we usually do and I believe that this evening's honor of the pledge is I, think very special. So last week we observed veterans day and at this meeting we are pleased to award the opera of the pledge to Mr Dino Lamia, who will be viewing us on not on here. What's wrong Joe? Oh I'm sorry I had the slide with dino and it's not on here. For some reason: okay, don't worry about. It is a World War, Ii veteran and a former member of Community Board 10 and a long time resident. He. It was honored at Fort, Hamilton Army base at their veterans day ceremony for his service in World, War Ii and was photographed with Brigadier General Thomas Tickner Sergeant Command Major, Michael Mccabe and Colonel Craig Martin. The event was reported in the Brooklyn reporter the engraving on the award presented to Mr Lamia at the Fort Hamilton event reads. Thank you for taking the time to share your experience as a World War Ii veteran with the Fort Hamilton community. During our 2020 veterans day ceremony, we appreciate your service in World, War Ii and your contributions to your community upon your return home, Mr Lamia. Excuse me one moment: I apologize, technical difficulties, I apologize, Mr, Lamia retired in 2012, from community board 10 after 27 years of service, with a standing ovation from the board. He volunteered as a member of the board, while working as a real estate agent. Excuse me in having a family and resigned to spend more time with his wife, Ann and their family. During his tenure, he worked on the rezoning to create the Special Bay, Ridge District and the plague of illegal curb cuts. The story of how Josephine Beckman met Mr Lamia even before she was district manager, was reported on April 5th 2012 in the Brooklyn eagle. She was a block association president who was seeking the board's help with problematic cyber cafes popping up on Fort Hamilton Parkway. She was walking down her block one day when Mr Dean Olamia drove up got out of his car introduced himself as a board 10 member and asked her to show him where the trouble spots were located. He made it clear that the board wanted to help the residents tonight. We want to thank Mr Lamia for his service to his country and this community, and we humbly present him with the honor of the pledge. There's one thing I would like to add is that he gets the minutes from the board meeting every month sends him and he continues to read them. So please join us as we pledge allegiance to the flag of the United States of America and public, for which it stands. One man under God indivisible with liberty and justice, so I'm very happy and he he's a valued member of his community and we're very happy to honor him this evening. So with that, I would like to move on to the adoption of the agenda and, let's see, if we can have do we have anybody adoption of the agenda. Thank you, yeah thank you Joe and for I know, I told everyone to mute themselves and for an option of the minutes. Please I'll do it. Thank you, Julie! Thank you, Dan and now I'd like to move to the public session. We have a number of people who would like to speak this evening, we're going to try very hard to keep it to 10 minutes if possible. We try and the first person signed up to speak is controller Scott stringer he's here. Okay, he should be on hi everybody. You hear me yes, well, it's great to come by the community board and ordinarily I really wish. I was with you all in person, but right now we're going to be zooming, at least for the short term, but I wanted to just come by and talk to you directly about some of the issues we're facing in the city, but I just wanted to briefly talk about where we are economically in the city and I know you have a lot of elected officials on tonight. So I won't I'll. Be brief, because- and so yes Laura V. Please help me with this. I'm sorry, that's normal continue! We're sorry, that's right, but let me first acknowledge Laurie Willis, our great CB10 chair and Josephine Beckman, the district manager I know Councilmember Brandon, and so many others are on the call tonight. But I want everyone to just think back for a second in February 2020. when the pandemic hit in March, the unemployment rate was at 3.4 and we were coming off a record run of job creation. In fact, the city had added 970,000 jobs over the last 10 years and once that pandemic hit within 30 days, the unemployment rate went from 3.4 to over 20 percent and we lost 907,900 000 of those 907,000 jobs and so right. Now, as we look at rebuilding we're going to have to rebuild slowly through the lens of medicine, but also understanding that a lot of our workforce is still unemployed. Fortunately, we're going to get I believe a stimulus package from Washington, but we also have to take real measures now to create a foundation to bring back our business and our revenue. First and foremost, we should recognize that roughly one-third of the city's 240,000 small businesses may never reopen that's a lot of small businesses that have been blindsided by the pandemic and when you think about the fact that 98 of city, employee city employers, provide business or jobs for 3 million people, we first have to go directly to help our small businesses. So a couple of things. First, we're going to have to invest in tax deferrals for our small businesses that are struggling right now, they're trying to navigate city agencies, especially the restaurants that are moving from indoor to outdoor dining or did that during the warmer weather. We're also going to have to incentivize some tax credits, new businesses that will come to vacant commercial corridors, whether we're in this community or in communities around the city. We now have 17 million square foot of vacant, real estate space, and so we're going to have to incentivize and lift up businesses to go into our neighborhoods or we're not going to bring back this economy. I want to talk a little bit about how we do that, and obviously we're going to have to help our small businesses with tech and give them the assistance to expand their businesses. We also have to stop the fines and fees once and for all. If we keep finding, if we keep adding more fees to our small businesses, they will never come back. So for me, we have to think about small businesses. We have to think about recognizing that we can't wait until there's a vaccine to think about small business opportunities. The city is going to have to become more user-friendly. The department of buildings, the consumer affairs Department, the people who come in and find the restaurant because they find a fruit fly in the vodka bottle. All of this has to stop and I also just want to mention to parents. We need to also let the bear understand that you have to plan with parents and work with communities to understand that you can't simply turn on school turn off school at a whim. You have to work with the parents and communities. There are many people who are struggling with remote learning and the lack of internet access. My office has done those investigations and it's pretty disgraceful that you could have single parents with three kids and one remote learning device. This the city has got to come clean and tell us exactly which people are struggling. My office has continued to work with parents around the city and look I know from personal experience. I have an eight-year-old and a seven-year-old, a third grader and a second grader they're, going to remote learning right now, they're on remote learning and I can tell you it's one of the hardest things I've had to face as a parent, but I also know my wife and I are privileged. We have resources, we can fill in the gaps too. Many parents can't do that, so I'm just wanted to come by and let you know that my office is here to help. If you have ideas for audits, for investigations on how we can hold city government accountable, please let my office know we're always represented at the committee boards. Lastly, I just want to say to all of you tell me, where you're seeing the trash pile up, we're spending a whole lot of time in our office, trying to understand why the mayor is cutting such essential services like trash pickup, when at a time we want to show that the city is by it is vital and on the way back, you don't cut programs that really impact communities. We've got more rats standing up than people sometimes and we've got to change that as well. So that's what I wanted to come and say and I know you have a big agenda. So let me just say I hope. I can see all of you soon and I look forward to working with all of you in the future. Thank you very much controller stringer and now the next person signed up for a public session is assembling matild Frontis. Do we have her Joe? Is here she's on you yeah she has to unmute. Forgive me, I started talking and didn't realize. No one can hear me how's everyone tonight. It's good lots of familiar faces. Lots of familiar faces today is a very anxiety invoking provoking day, but I wanted to come by tonight to make sure that I say hello to everyone and to remind you that our office in Bay Ridge is here for you we were. Oh is someone without a message: I, don't know. If someone was trying to get my attention a couple of months ago, we moved to 93rd street. We used to be on third between 85th and 86th. Most of you know now that we are right across the street from the Prince hotel on 93rd right off the corner of third I. Think my legislative director is here: Jacob Goldfinger, there's normally at least one person in the office. If not two, when Bay Ridge was in one of the orange or yellow zones we started doing, you know practicing no contact, but anybody who needs help there's a sign on the door. You can let us know what you need and we are available. I want to make sure that everyone is staying in touch with the office and know what we have planned tomorrow night. There is a event that we have planned: the southern Brooklyn community roundtable. It was this big idea that I shared two years ago. We used to call it the southern Brooklyn community think tank, and we now call it the southern Brooklyn community round table every couple of months or so will convene people from around southern Brooklyn to discuss a topic of interest where we all sit around and brainstorm solutions. So I wanted to invite everybody here, to the extent that you are available and interested in the subject, we'll be discussing specialized high school admissions here in New York state and we have a guest speaker who's going to be discussing how New York compares to other states across the country. So that's going to be six to eight, it's actually on zoom, but anybody who's interested. You can go to my social media, page and I'll. Also, let me see if we could I'm going to find out text Jacob to see if we could possibly drop it here as well, so that all of you can have it here for your convenience. I want to echo some of what I heard the controller say and just let everyone know that I continue to monitor, what's going on here, not only in Bay Ridge but across southern Brooklyn vis-a-vis, the Covid-19 ray and the precautions that we're taking a lot of people are suffering now, not just people who are falling behind on their rent, people who lost their work. We have small businesses who need assistance and again I just want to say that we are here to help. My colleagues and I in the assembly continue to stay in touch and brainstorm solutions that we can come up with and legislation that we can pass to provide additional relief. We know that we pass some legislation earlier on in the year and we know that it's not nearly enough in terms of what the people of New York state need and I want to make sure that I. Let people know that so I'm hoping that soon and very soon that you guys will see more relief coming from the state, because we know that in January, if we don't do something and if we don't move fast, we're looking at a catastrophic situation when the moratorium is over with people not being able to catch up, and we don't want that to happen. So just wanted you to know what was on my mind, Josephine. If anyone has any questions, I'm more than happy to stay for a little bit and take any questions that people might have. Thank you, okay, Lori, Joe, yeah, okay, sorry, thank you very much and now we have a councilman Justin Brennan hi everybody. Can you hear me? Yes, okay, cool hi, everybody, councilman Justin Brannon. Here it's good to see you guys happy Diwali for everyone who is celebrating it's the most important hindu holiday of the year for everyone celebrating in our neighborhood. It's good to see everybody. We have thanksgiving coming up a lot of talk about as Covid-19 numbers rise. You know what our holiday is going to look like. I know it's going to feel different this year, it's going to look different this year, I think this holiday season. It's really simple. We all just have to use our head. You know making sure that your family is healthy and happy for the holidays to come might be worth more than seeing them next week for Thanksgiving. So it's just something to keep in mind. We are monitoring the Covid-19 numbers. The second wave seems to be knocking at our doors, something that they've been. You know warning us about for quite a while. It seems like it's here now, but there's a light at the end of the tunnel this time, because we have two vaccines on the way that gives us some hope and certainly we're better prepared this time around. We know what to do. We know much more than we did back in March and April about this virus and I think that's going to help us out this time around, but we still have to you know, keep using our heads and being smart and safe, practicing safe social, distancing wearing our masks all that stuff. Everybody knows what to do by now. We just have to keep it, but also too, you know some things: I have no sound. I can't hear what anyone's saying something says, detective problem and needs to restart your computer audio. It's the username and I put password really trying to mute Larry. We can only hear you, please mute. Larry I can't hear anybody. It says restart your computer's audio, so I I'll wrap it up. Just never happened before I'm sorry, Justin, I'm going to mute all, and then you can unmute yourself. You got me. Yes, okay, go ahead, okay, cool yeah, so lots going on we'll have more news soon, we're certainly working on some stuff for the holidays. Trying to have you know the most normal holiday as we can with all the covered measures in place. I'm also announcing that I'm allocating close to 300,000 for some more Argus cameras around the neighborhood and I certainly want to hear from people in the neighborhood where they think these cameras should go so I'll be putting some stuff out on my social media and in the press about this. So we can solicit some input from the community about these cameras that make life a little bit easier for the police and crack down on some of the quality of life crimes and handle surfing and that kind of stuff that we're seeing out there with that I'll. Let you guys get to work. Thank you guys. So much happy, thanksgiving and I will see you next month. Thank you very much and next to speak is incumbent Congresswoman, Nicole Malliotakis, who has joined us good evening. It's Kathy. Unfortunately, okay, oh hi, Kathy, that's! Okay! I'm sorry to disappoint everyone good evening. Everyone, the assemblywoman, sends her regrets, unfortunately, for not being able to attend tonight and she does hope everyone as well just want to give you a heads up. We have mass gloves sanitizers like every other, probably elected officials and then what just listen on the phone. I'm sorry to see the pictures that you might need. Please contact our office, we're at 7716. Third Avenue on Monday, Wednesdays and Fridays number I, don't see that, but the number is 718-439-8090 in a year that has been very challenging to all of us. Let's all focus on the many blessings we do have and the assembly woman and I would like to wish everyone in their families a happy, healthy and a safe thanksgiving. Thank you very much and next to speak is Jessica callow from the borough president's office. Thank you, Lori, no problem, I hope everyone is doing well. I just want to wish everyone a Thanksgiving, happy, Thanksgiving, first off and then second I know that we have the you I, don't know exactly when I'll have a chance to speak. If I'll have a chance to speak, so I'm just going to bring it up now for the Fifth Avenue Euler peering that we're going to have if anyone from the public or from the community board wants to submit testimony to the borough president's office. We already had our public hearing, but that's up on YouTube and on our website. But if you want to still submit testimony to us, because we didn't get a lot, you can email us, you can either email me and I will forward it on or you can email ask Eric that's a-s-k-e-r-I-c at brooklynbp.net and we will add it to the testimony. Thank you very much. Jessica and now we have Sarah Anders from state Senator, Andrew Gnardis's office. You see Sarah, oh she's, on I'm sorry, Lori I, think she's here I have to okay. She should be on now hi folks. Can you hear me yep? Okay, yes, hi everyone, so obviously, as so many others have mentioned, this is an incredibly challenging time and Covid-19 numbers are on the rise and we're dealing with some of the economic ramifications. So that's what our office is really focused on we're. Certainly here should you need anything. Please give us a call we're at 718-238-6044 and we're taking in-person appointments as well. We will be we've been in the process of announcing the empire awards for some local small businesses, just honoring those who have really given back to their community and what has undoubtedly been an incredibly challenging time for them. Southern Brooklyn has some of the most special small businesses in New, York, City and in the world, and we want to honor those small businesses and just a quick note. Over the weekend it was World day of remembrance for victims of traffic violence and, and that's something that has you know, always been a huge part of the senator's policy efforts and what's on his mind, so that's something that you know he's very committed to working on and something that we want to mention and last but not least, happy thanksgiving to everyone. Thank you very much. Sarah, and now we have Nancy Lulu from the Brooklyn district attorney's office good evening. Everyone hope everyone is doing well. I would like to extend greetings on behalf of D.A Gonzalez to each and every one of you at the Brooklyn Da's office. Our core obligation still remains the same. We continue to hear and prosecute cases to make sure Brooklyn stays safe, D.A, Gonzalez and members of the Da's office have been in the community partnering and providing services. So far, we've had 38 community services, those community events, sorry food and PPE events and others throughout the pandemic. Last week, district attorney Eric Gonzalez, together with New York City Police Commissioner Dermond Shea, announced the indictment of an alleged gun trafficking room that purchased firearms from South, Carolina and Virginia, and then were transported on the iron pipeline to be sold on the streets of Brooklyn. Our office is committed to protecting the public safety of Brooklyn and focusing our resources on these gun traffickers and criminals. Criminal enterprises who compromise it just in closing I, would like to provide my contact information which is Lulu and Brooklynda.Org, and also, if an individual or would like to address a matter or file a complaint to please reach out to the Brooklyn Da's action center at 718-250-2340 and finally, on behalf of D.A Gonzalez and myself, even though this thanksgiving is not going to be the same, but we would like to wish everyone a very safe and blessed thanksgiving. I would like to thank community board 10 for allowing me to speak this evening, and I would like to thank all the elected officials for their leadership and partnership. Thank you very much and be well. Thank you, Nancy and next to speak. We have Sharon Pope from Bike New York hi everybody. Can you hear me? Yes, we can hi Sharon, yes, hi, Chairperson Willis! Thank you very much. Community board members and residents I appreciate the opportunity to talk with you briefly this evening, but before I do that as I do with my other presentations. I want to recognize where, in the middle of a pandemic, wear a mask socially distance and washers sanitize your hands. My name is Sharon Pope Marshall I am with bike New York. We have begun a brand new program in which we work with people who are interested in taking a look at their very block and who are wanting to implement some changes to improve their blocks. So, for example, your street may not have a curb cut so that an elderly person or a person in a wheelchair is not able to move from the sidewalk to the street bed as an example. If there's something bothering you about your street, what we will do is we'll work with you to work with the community boards, I'm sorry to work with the Community Board's Committee of Transportation Committee, I'm sorry about that, as well as the Department of transportation. So we'll work with you hand in hand and I just want to leave you with my email address, which is s as in Sharon Pope P-o-p-e at bike. B-I-K-E, DOT, NYC and I will also leave information in the chat. Wear a mask socially distance and wash and sanitize your hands happy Thanksgiving, everybody happy Thanksgiving! Thank you! Sharon and next we have resident Chris Masculino, oh where'd, she go. You should be able to unmute herself. Now, yes, Christine, would you like to speak? I, see she's still, muted. Oh there, we go! No! Thank you! Okay and we have community board 11 member and Visitation Academy Representative Eileen Laroffa, Eileen, you're, muted, Eileen, okay, I'm just listening to everybody. Okay, oh thank you! Don't have to speak if you don't want to okay, so I think that's everyone. What was that other thing? And so now we will move on to the public hearing and Doris Cruz very busy woman on this community board your muted doors? Okay, yes, and it is a very busy hard-working committee and I. Thank them all for their efforts. The committee met in quorum via zoom on Thursday October, 29th 2020. We met to review a zoning, a rezoning application for 91, 14, fifth avenue and adjacent Loss, Euler preference number four 19044, seven Z Mk and one nine zero, four eight z Mk. If this seems familiar, it is because the committee heard an informational report on the proposed rezoning and it was reported on at the February meeting general meeting and again at the October meeting after the application was certified and new procedures had been resumed at the October 29th meeting. The public was invited to participate in the meeting, and we can not hear and offer comments. As mentioned in the last informational report, it was decided to have a committee meeting which was available to the public general public and then have a second meeting allowing comments and questions. This procedural decision was made due to the uniqueness of Zuma meetings, some history and perspective. The lot at 9114 Fifth Avenue, was purchased by a local doctor who wanted to build a hotel, 91 14 5th avenue is located within the Special Bay Ridge Zoning district within the c82 district, which allows for the construction of commercial community facilities buildings with a maximum height of 70 feet. Right now, as of right, the developer can construct a seven-story hotel without any public review. In fact, the developer has approved department of building plans ready to go to build the hotel. There were several community protests. We have many needs in Bay Ridge, but a hotel has never been identified as a community need school. The school construction authority was contacted and reviewed the lot and determined that it was too small to build a school. The developer was willing to build residential units, but zoning regulations of the c82 do not permit construction of residential units. The developer agreed to submit a rezoning application which would allow construction of market rate rentals. The application included a wider area beyond his lot because of existing legal precedent that does not allow developers to limit a rezoning application to a single lot doesn't allow spot zoning. The r7a c42a overlay was selected because it is the most comparable residential district to the density bulk of the c82 r7a. The R78 district allows a waiver of parking requirements. This is in the zoning resolution and the community board can not change this provision of the plans. The r7a district is the highest density currently zoned in community board 10. In addition to this proposed site. Sure Sherrod and Third Avenue in the high 90s is also R78. Mih allows MIH, mandatory and collusional housing, which was adopted several years ago, allows an additional two stories within the contextual district for the development of affordable housing. The reason for the extra height in this proposal. If the zoning change is approved, the developer plans to build 41 total new apartments, 13 of which will be affordable as per MIH rules in accordance with area median income, it will be a mix of studios and one and two bedroom apartments. At the October 29th meeting members of the public raised good points about maintaining the commercial uses in the area and the residential mix, block density and scale again any of the properties along 90. Second street can be torn down today and replaced with a nine story. Commercial Building board members consider the testimony and motion to approve the rezoning application number two: zero one: nine, oh four: seven: two: zero one: nine zero four: eight z rk to project address, 91, 08 to 91, 28, 5th avenue, blocks, 23, 26, 28 and 27, and 29 and 405 for 19 90 second sheet, and they voted to reduce the project area in the mid block area of 92nd street by three zoning lots, 405, 47 and 409. for Eula and Community Board review. The community board has 60 days to review the proposal and hold a public hearing. The board approves provides an advisory opinion on the application. It then moves to the border president's office for its opinion. Following the borough president's review, the application moves to the City Council for review and modifications. I lost page three community boards do not have the right or power to just tell people what they can do with their property. The community Board review is limited to an advisory recommendation. There is zoning laws in place that we do not control. Today, a seven story building can be built on any underbuilt location in the c82 district. The community board can not change its own current zoning, contextual district regulations, again the discussion by the committee and comments from the public, most of which concern the scale of the building and the impact on an area that already has many traffic problems and that we have this proposal as an alternative to an as of right hotel. A motion was made. The first motion was to approve a rezoning of one lot, only 914 fifth avenue, with no other loss included. It was argued that this would be a spot rezoning and is not allowed and would be denied by the Department of City planning. A denial of the rezoning application could result in a hotel at the site. The motion was not seconded. A second motion was made to approve the application, but reduce the number of lots considered for rezoning. Three lots facing 90 seconds would be removed from the application, less 32, 33 and 34. those closest to Fourth Avenue, because 90 second street is narrower than both fourth and fifth avenues. It was felt that the zoning change would be inappropriate for that block. The motion was made and seconded and approving and I just would like to note in addition to the community discussion at the October 29th meeting district manager, Beckman had lengthy discussions with residents and business owners who contacted her with concerns about the site and the proposal. Thank you. The meeting was adjourned. So we have a motion on the floor. Do we have any? Can we start with so with committee questions right? Yes, Lori I just want to also mention that the applicant is present through their representative fan and available to show any slides or if you wanted to do a you know, a brief run through visually of the project. Okay, so the committee went met in quorum and the motion is on the floor. So do we have any questions or comments by board members yeah, it's Steve, okay, Steve go ahead, yeah I could dars. Just please read what the motion was again. I may not have had my I may not have the precise wording I and we can revisit that. A motion was made to approve the application, but to reduce the number of lots considered for his owning three launch states in 92nd street would be removed, plus 32 33 and 34. yeah. The difficulty I have with that is I, don't think. That's the exact motion, Dars, okay. The motion was to approve flat out to approve and at the same time, to write and ask that while we approve- because we don't want to lose that at the same time, we said that we would have a right to the city planning or excuse me, who is it zoning on the zoning board? Or is this no? This is and request that they review it for the purposes of making the determination as to whether they could reduce the size of the zoning, but there's no contingency here that it was contingent upon them, making the change again. We don't want to lose the what we have all right. In a sense, we have a a developer who is willing to work with us and if we make it contingent, they might say no and then or they might, if they went along with us, we're afraid that we would lose what we have here so I think that the motion has to be read differently. It's not the motion. We agreed to you're correct, so we have a motion to approve the resulting application as presented and then to write to the department of City planning and the borough president to request the reduction of the number of lots as 32 33 and 34. Okay, that's correct! Okay! So that's that is the I recall it as that way as well from the meeting. So now that the motion is on the floor stated clearly so that everyone understands what we're voting on questions or comments. I see, Judith Grimaldi has had her hand up so go ahead. Judy I, don't know if I lost it in the shuffle, but I'm not absolutely clear what the proposed development is. So you would the applicant be willing to go through a reminder of the aspects of this development that we're approving hi Fan Baton from Sheldon Mobile Pc applicant representatives. I'm happy to go through I, do have some slides from the previous meetings. I, don't know Josephine if I could share my screen. Yes, you know, okay, you should be able to see. Okay, can everyone see, looks good, okay, perfect, so I could go through a quick, quick, little presentation. So everyone knows what the proposal is. I know: we've presented a few times at the land use committee and procedurally, as Doris said, we're in new larp and we're towards the end of the community Board review. So this is the 9114 Fifth Avenue of rezoning, it's on Fifth Avenue between 91St Street and 92nd street, and we're seeking rezoning from a Ca2 Zoning district to an r7a c24 zoning district. As you know, I'm just going to restate some of what Doris already mentioned. As you can see from the zoning map, the property is located within a Ca2 Zoning district and within the Special Bay Ridge District, all right. So the building itself currently is proposed to be a nine story, building which is going to be around 45,000 square feet. It will consist of 41 dwelling units ranging in size from studios, one bedrooms and two bedrooms. As you can see, the frontage they'll have frontage on fifth Avenue, as well as 92nd street on 92nd street. There's only it's a narrow street there's going to be a one-story commercial building that will kind of connect into the building. That's on Fifth, Avenue and I'll, just scroll down a little bit more. The ground floor will be commercial, local, retail uses and a residential lobby as well as here just general I mean it's just general floor plans consisting of the bedroom layout. So if I don't know, if it's too small, let me just view full screen. Okay, so you can see a little bit. These are the sections of the buildings as you're, where the building will set back at 75 feet, which is around seven stories. The building will step back. So then the eighth and ninth floor will be set back from the street wall. This is what the proposed building would look like, and this is kind of in context with the surrounding area. The building is in yellow and these surrounding neighborhoods buildings. As of right now and I think Doris had mentioned that we could build a 63 unit hotel. That is six stories with a seller. So this is a few stories taller but does provide the residential units instead of the hotel that was currently approved at D.O.B. Okay, so does that familiarize you Judy? Okay? Do we have anyone else? I'm sorry if we could just yeah. Yes, thank you. Stephanie Mahany raised her hand, go ahead. Stephanie I just wanted to raise some of the concerns that we addressed in the committee meeting. Unfortunately, this discussion has been shaped by the threat of the hotel over and over again, but the one of the things I had asked at the last meeting is: couldn't there be a more modest rezoning, maybe an R6A, but apparently that wasn't enough of an incentive for the builder and so consequently, now it's not just this project, not just this building, but it would be an additional nine lots on the block around the block. That would also receive this rezoning and with the MIH. Each lot would also receive the bonus far and that's just the height and the bulk just seemed to violate the you know the intent of the Special Bay Ridge District, and it really I, don't see it as characteristic for this neighborhood, particularly on such a narrow portion of Bay Ridge. Additionally, there were many concerns raised by the community and I do know that at the November 10th public hearing the borough president's public hearing, those community concerns were not heard. I guess the community residents were not in attendance and I. Think it's incumbent upon the board here to make sure that those concerns are heard and, as Jessica Kahlo had invited everyone in the community to submit their testimony. I think that's a great thing if they could do that, but the project was because there were no community participation. The project was presented as having near unanimous support and I do not see. That was the case at the time and that's all I wanted to offer. Thank you. Okay, do you have comments from anyone else? Yes, Steve wait a minute. Steve we've got Julie. Do you have your hand up Julie down? Yes, I just had a question I just wanted to clarify this is affordable housing. Is that what was said I, I'm not sure if I caught that correctly, a portion of it but Doris, do you want to speak to that 41 units, a total of 13 would be affordable and the rest would be market rate right and there's no parking of any kind right, and it's not required to supply some it's being waived. The zoning allows that the zoning allows for no parking right now. Correct I just want to be clear. Thank you so much. Thank you. Okay, I'm sorry go ahead. Steve, yeah, I just wanted to reply. Stephanie is absolutely correct. With the exception that it is not, the threat of a hotel is as of right there. That means that if we don't change the zoning to allow for this residential building, we will get a hotel. That's not a threat. The gentleman who owns that has a right to build that, and the thing is that this whole controversy stemmed from the fact originally that the community did not want to see a hotel there directly across the street from the school. So there's really you know it's one of two things. We either say yes to this, or we say yes to the hotel and, in my view, in view of the fact that the owner has worked with the community, and we asked him to do that. It seems strange that we wouldn't take yes for an answer. So, under these circumstances, I intend to vote for this because I think it's the best thing for the community. Okay, thank you. Steve I still I, see Jill and Phantolino. Hajjar has her hand up and then Ruth Mazur go ahead. Jill. Thank you. I was just curious. If the committee spoke anything about how the community would support that amount of housing, but not just that building if there would be nine other lots that would build or have the right to build to that height in that capacity, how the Bay Ridge community itself as far as schools. As far as transportation, you know cars was there any discussion about that at all. Stephanie I was just curious. I'm sorry I think that would be for Doris to respond to oh, okay. Doris go ahead. There was very definitely discussion about the traffic impact on that area. It was tremendous concern, but it was also mentioned that a commercial building of comparable size could be built at that at on any of those lots right now and commercial buildings can also bring heavy traffic. The committee and the public members of the publicly spoke were very concerned about the traffic issues in that area. No question about it, but there is this euphemism that it is in a traffic zone. It's in a transit zone. It is near the subway line and several bus lines, so it is considered acceptable to waive the parking. That's one of the reasons it was allowed to be waived and Doris. If I might add that this question was raised, it was raised by a number of residents and there was a environmental impact study that they had noted where they said that, according to their study, I'm just reporting what was said there according to their study, that they would see no increase in traffic I. Don't yeah I can't speak to true or not that's what their study said, but the issue was definitely raised and it was raised by a number of people. The concern about you know basically the infrastructure that you're talking about Joe I, don't know now: we've got wait. A minute wait. I did say that Ruth could speak. We've got news, it's been waiting patiently. Thank you. I need some clarification about these other nine lots, I'm not clear about that. Is that the rest of the yellow? That goes on to 91st street. You might want to talk about spot zoning. Really quick one. Second Dan. Are you just asking us to put the graphic up, so you can see where they are Ruth or are you asking about? Yes, I'm asking to have those nine spots pointed out. Okay, Stella. It's wait, one minute. It's Ruth's turn one. Second, I'm trying to get the detailed tax map, so you can see those lots, I, don't know if you can see it, so it's lots, 34, 33, 32, then the applicant slots and then on the corner. 30, no I, don't see it well on that yeah I think you had a better graphic. I'm going to put this one, just a it's a large file, so it takes a second sorry. Everyone yeah that I think that would be better. So it's these lots. So I just want to note. I know it. We do bring in nine lots. They are smaller lots and in terms of the environmental review, we look at those as soft sites. So we look at the ones that say two over here because they're two stories as one soft site and another soft site on the corner lot. So while there are nine, it's not determine that you're going to build a nine-story building on such a narrow lot like a three 30 foot wide lot, so that was in the environmental review and just to add to that a little bit more when- and why is this? What is this corridor here? This is I mean this is fifth Avenue to the east and fourth Avenue to the west. Is that what you're doing and 90 seconds on 92nd street there's a what can be described just as a corridor leading to the large lot? Oh, this is part of the applicant's lot. It's vacant, it's a vacant lot. He owns this one, that's in red and then the two gray ones he owns all the current. So the current construction- that's on the table now is that on the narrow lot, as well as the large lie- or just it is yes, it's, but it's only one story: commercial and then the bulk of the building is going to be along the Fifth Avenue Frontage, so that corridor will be built up just one story: that is a plan for a commercial, yes, commercial, it's like one behind the other is that it I mean it's a contiguous l-shaped building, but it's built up taller on the Fifth Avenue side. So what you're, referring to as a corridor, which runs from 92nd, that portion of the building will be one story, but it's one building and the concern is that the builder is going to combine all the twos and all the threes into two separate developments, not this builder, but that the zoning, the rezoning would permit someone else to build higher. Basically, so this builder does doesn't currently own those properties. No, he only owns the ones that have that red line around it. Okay, so that's not! Those are not on the table for the moment, not for the moment. Okay and this large space will be nine stories at the current time. Nine stories with a setback at the seventh story. Okay, okay, I'm sorry are we. Can we move on to another speaker? I know we have a yeah sure go ahead. I'm sorry, I just want to make sure you're good Ruth, I'm good I got it now. Thank you and okay. I see. Carmen Feliciano has her hand up Carmen. You haven't spoken yet go ahead karma you have to unmute I, can't hear you where'd. She go now. I, don't see her either. She might have accidentally left the meeting. All right, Carmen I'll have we'll have to get back to you. Let me see someone else had their hand up Ann. Oh I'm sorry, Ann go ahead. I would like to have a clarification. Hello. Can you hear me yeah one second, Stella I think we were trying to get we had called on and the question I had was previously asked. Thank you. Okay, go ahead, Stella! I'm sorry! No Steve mentioned before that the owner had a chance or an option to have a hotel or this affordable family building. I. Didn't quite understand he has to have one or the other or it's better one than the other Taurus. Do you want to take that? Currently, the developer can build a seven story: hotel with 60 plus units. It's a the community does not want it. There is no need, there's been no demonstrating need in this community for a hotel after community concerns the councilman reached out to the developer and he agreed to a rezoning and he requested a rezoning that would give him comparable density. It's like he can have a floor area ratio of 4.6 somewhere on a note, I, don't know which one that's for, and the other was 4.2, so he's looking for similar density to build the same amount of stuff that he could under current zoning. So that's why this zoning lot was. The zoning designation was chosen so basically Stella when he bought the property he wanted to build the hotel. The community response was that we don't really need or want a hotel right across the street from the school. So he, the developer, said okay I will look into building residential as opposed to hotel, but the current zoning does not permit that residential use. So that's basically what happened, but he is willing to do it and that's what he's asking for now so he's asking for us to give our recommendation to permit him to change the zoning to allow that use. Do we have anyone else? Any other? Yes, Judy, Grimaldi I know I'm probably coming late to the discussion, but I can't get past no parking and I just want to ask the question of Doris or if Steve knows when they did, that environmental impact study on the no need for parking, because we were in a was that done for a hotel, slash, commercial building versus a residential, because I understand a commercial building like the one across the street. Many people come from other neighborhoods to work there. There they might use public transportation, but when you live in a building when it's a residential building, you're, certainly not going to you're going to have your car there. So parking for residents is very different than parking for a hotel which may be transient or for a commercial building and I just want to clarify that environmental study was done for residential and the environmental study was done for this project, which would be residential, and they said that their study showed that there would be an average of 10 vehicle trips in the morning and in the evening the am rush and the pm rush, and during the midday there would be five vehicles. Five vehicle trips, I, don't know. If that's true, but that's what their environmental assessment. What do you want? Family can I. Just explain that. Thank you, Jordan! Okay, do we have anyone else? Yes could the could the I heard that the developers architect was going to say something right there and explain, go ahead fans? Sorry I just wanted to explain that the environmental assessment statement follows the Seeker technical manual and it's it looks at the no action which is what's as of right, so it would compare the hotel use to the residential, which is the with action, and it looks at the reasonable worst case. I have the environmental consultant on. If you have more specific questions regarding this, he could explain more about the parking, but it looks at what is an as of right, which is the no action which would have been the hotel versus the residential and does a quick question on that. Actually, does it look at just that one lot in development or the entire rezoning and what could possibly be built in the future on that site? It looks at the entire project area, so all of those lots included. It looks at it's something called the reasonable worst case, so it's the maximum build out and the worst case scenario the largest bill down, so all right, all three laps, so those numbers would be for an eventual future case where everything is developed as of right on that land, including those extra lots correct of the as of right versus proposed. So we could expect for this specific development less than the seven the to ten trips based on and though those numbers are based on community board, 10 data or like citywide data I, would defer to Rob Green. We have Robert Greene here. Yeah I am here hi. Thank you. If you could answer that question for Dan, that would be great sure, absolutely yeah. So it's actually it's not even just the community district data. It's it's actually used from like census data for these specific census tracts. So it's actually it hammers down to the specific area. Excellent! Okay! Thank you. Do we have anyone else? Yes, I'd like to I know I'm okay, one! Second Ruth! Let me just take a look. I want to see if there's someone else, Carmen is back yes, oh Carmen hi go ahead. Carmen go ahead. Well, I just want to say real quick, I'm glad it was changed from a hotel to an apartment building, but mines is of just a simple question with the stoning board: I guess letting them go to it. You know to like say nine stories: will that open the door then for us battling everybody else to try to keep to our height requirement Doris. Do you want to take that or I think the answer is yes, unfortunately, and there's no way to stop that now to try to keep them down to six or six stories, I think each application has to be reviewed individually. We can't make a blanket statement. Okay, all right I mean we had another development, a block away that was open for a special permit and was not looking for additional height. They built with lower than they're allowed to build I think or at least within okay. Do we have any other questions? Okay, Ruth did you want to come? I want to comment in support of what Judy Grimaldi said. I really think that parking is very important in our neighborhood and to build a development of such a large development with no opportunity for parking I. Don't really don't see how, as a community board, we could approve that knowing what's going on in our neighborhood also, if the developer would build a hotel, he would certainly have to have an opportunity for parking. For example, at the Gregory hotel they don't have on-site parking and they have people running over to the municipal lot back and forth. So I think that if the developer built a hotel, he would probably build parking inside and frankly, we have one hotel in this neighborhood I know we're all threatened by what could be, but there could be positive hotels also. So I'm really not that worried about it and I think that to make these concessions of two extra floors and no parking is really not a good precedent for us and it's not a good idea for our neighborhood. So I stand firm with you know, and I'm sorry that you know to hear that all these planning went into changing and getting a special consideration and everything, but I personally, don't think it's a good idea. I'd rather see a structure with parking and not as dense for our neighborhood. Okay. Thank you. Ruth fan, I do have a question one minute, Stella fan I, do have a question. The approved plans that the that your client had for the hotel, the prior plans did. They include parking. They included four spaces. Okay, thank you. Okay, I'm sorry, Stella go ahead. Did you want to speak yeah I, just I think the hotel doesn't need a lot of parking, although you say that, of course they have to have parking availability, but the customers of the hotel don't have cars, they just come to sleep and go out or they come from the airport or they don't need parking facilities really I would prefer the hotel versus the building a residential building. Okay, thank you. Stella, I'm going to try to wrap this up because we have sorry a lot of. We have a lot of people speaking and I think that councilman Brannan would like to say something might off mute. Hello. Yes, did you want to say something? Councilman, Brandon, yeah, really quick, I, mean I. Think some I think some of us were have been really close to this issue and others are somewhat hearing about it for the first time tonight. So I'm really quick. The lot here has been vacant for several decades. It was purchased by a local doctor who wanted to build a hotel and, as the current zoning says, you can build a hotel here, but you can not build an apartment building. So, like Steve Harrison said, if we sat on our hands and it didn't do anything by law, developer could start building a seven-story hotel tomorrow if they wanted to, and there would be nothing we could do to stop them. So the reason why we're here is because there were lots of protests and people were very upset and angry at the idea of a hotel being built across the street from school. Frankly, I struggle to disagree. I, don't I think we need a lot of things in Bay, Ridge I. Don't think we need another hotel, our first idea to get the school construction authority to purchase the lot. Unfortunately, they felt it was too small. So the next option, if we didn't want a hotel, was to try to do what we're doing now, which would be to allow the developer to do much needed rental housing. But in order to do that, we have to rezone. So you know we're not up zoning here, we're not upsetting Bay Ridge for skyscrapers or anything like that. That's just not what we're doing and not what anybody wants. Certainly you know I think all the laws here certainly are being followed. I think it's just important to remember that the developer has purchased this lot and he you know he has a right to build something here and if we don't approve the rezoning, he can by law, build a hotel and he already has plans submitted to build a hotel. So we got involved here because the community was certainly seemingly in agreement that they did not want a hotel across from the school, and we thought this would be the best compromise. So that's why we are where we are right now. I just wanted to give a little bit of color. You know for those who had haven't been following this as closely as as the rest of us may have. Okay. Thank you, councilman! Thank you. Okay, I see one more hand up. I'm taking this last comment, because I really would like to wrap this up. If we can so go ahead, Jill and Phantolino Hijar Justin. Are you still there? Okay, my only concern not so much with the hotel this or this one apartment building the rezoning concerns me because it will give or set precedent over the rest of Bay Ridge. I'm not sure if that's accurate or not, but I know that the similar thing happened in park. Slope. Fourth avenue and buildings are going up like crazy, so my only concern is, like I, said, the community support for these buildings and families. As far as schools go to begin with, they're crowded and I'm just concerned for the community to have as many buildings that might go up in the future. I think we need to consider that, because once you rezone it's going to be very hard to stop everyone else to want to rezone certain areas. So that's okay, so I would like to just speak to one thing, just because just a point of Fact Bay Ridge, when this community board worked very hard to get it rezoned left only certain areas open in that zoning. That would lend themselves to a bit more development, and this is one of them. So we don't. You know most of our avenues, most of our the areas in Bay Ridge and in community board 10 as a whole. There are very few sites that are vulnerable to this kind of development, because we specifically made we down zoned and made our zoning more restrictive, but we did leave areas where there is room for development, because you do, you know, need to have that latitude and so I. Don't really think that our present zoning lends itself to the kind of situation you're describing, and so that's just Josephine, if you want to chime in on that. But that's just a point: I just want to clarify yeah I. Think I want to echo that just to clarify for you Jill is that right now this building can be developed. You know, I mean every lot in you know in the district can be, but, as Laurie said, you know all the Bay Region Tiger Heights was rezoned and it was down zone for the most part. There are certain areas. This ca corridor is very limited into what could be built there and unfortunately, some of the uses in that area have changed, but it's a very small, narrow triangle area. So there's not this widespread potential. It really is narrow and limited. Okay, so that having been said, I would like to call the question if I may I, hopefully, I would like to make one comment before we go. It was noted that there were no comments at the borough president's meeting and I want to say that I logged on to the meeting at six o'clock and at 8:20 the first issue about a development in community board 14 on East 16Th street was still going on and I hadn't eaten I had a headache and I lobbed off and I sent. My regrets to both the presenter and the host and also I was surprised at the borough president held their public hearing prior to community Board 10's public hearing, it's not the normal procedure, but they will be accepting comments for the next several for 40 days, and so we will be on record with the concerns of the community. Okay, thank you Doris. So now I would like to call the question. We are going to have a roll call vote on this matter. So Josephine. If you would kindly do the honors great I will, can we read the full we have to read the motion is that I don't know if it's required book ahead, Doris? Okay, we approve the rezoning application as submitted and then separate from that approval. We will ask the Department of City planning to review our requests to have the number of zoning lots reduced by three to remove three lots which I don't have off the top the three locks on here. Okay, thank you! So Josephine go ahead! Please! Yes, Tracy Britton! In favor, Jane Kappa Tanakis in favor, Shirley Chin in favor, Judy, Collins Judy. You have to press the space bar okay in favor. Thank you. Judy Doris Cruz in favor Richard day in favor, Michael Devine in favor, Chris, Ellison, favor and volutico favor, Carmen, Feliciano yeah. Don't use check it out Carmen in favor. Sorry, can you hear me yes, Michael? Thank you Michael Festa, I'm in favor! Thank you. Barbara Gurmak in favor Diane Grinardis in favor, Judy Grimaldi in Favor, Steve Harrison in Favor, Dan paddocks in favor, Justin Hyatt in favor, Jill Hajjar in favor, Stella Cocholas in favor, Marty Lens in favor waging Leo Nick Leonardo's your favor Stephanie Mahany, No, Ryan Mahoney, again voting against okay Anthony Moreno in Favor Ruth Mazur Ruth opposed Iris mullet in favor Robert Oliva in favor Marissa Perez in favor, Susan, Pulaski Susan. You have to unmute yourself yeah. She said yes, I'm sorry Susan I couldn't hear you did you vote. Did you hear her? I was in favor? Okay, got you: okay, Joe Sokolowski Joe! You see Joe he's on phones, he's on attendees he's on the telephone he's on we'll go back to him. Okay, we'll go back to Joe, okay, Larry Stelter! That's probably a refusal right! Oh he's joined on the phone because his audio was out, so we might need to add him as a panelist. Just hear me now. Yes, you know your recusal. Yes thank you. Henry Stewart in favor, Janet Taub, your favor Julie thumb in favor, Sandy Valles in favor, Barbara Velucci as the least of all evils. I'll say in favor thank you: Lori Willis in favor Michael G in favor, I'm going back to Joe Suckalovsky Joe, he's muted in favor. Okay, thank you. So much did I miss anyone. Okay, Madam chair. That concludes. The role motion carries okay. Thank you very much and I thank the committee and the committee chair for all their hard work on this matter. Okay, and we are now moving on to the chairs report so good evening this month. Once again, our meeting is being conducted by a zoom and in accordance with executive orders. I wanted to mention, because in the course of rezoning this rezoning application, for which we've had a number of meetings among which was a forum to obtain the public's feedback about the application. At that meeting, I was reminded that there is so often a misperception of what the community board is and what it does. So. I would like to say a few words about that. We are essentially the lowest level of city government and what I consider to be the most basic democracy by that I mean that we are the lowest paid, we're not paid at all and comprised of people from the community who have no special training and who volunteer their time. We all get together and we debate and eventually vote on issues that affect the district. The members are varied and diverse, with the common goal of bettering our community. Generally speaking, our mandate is to voice the concerns of our community, as they pertain to the matters that come before us and to voice the unique needs of our portion of this vast city to the local officials and agencies. The matters that come before us are things that the law requires be brought to us for our input and recommendation to the agency that will ultimately make the decision on the matter like the zoning application. We just heard so on a given matter that comes before us there's a framework within which we are required to work and considerations with the which the law determines are relevant to that matter. Like the local zoning resolutions we just discussed, then there are the needs and concerns of the community that we hear from you and we use our form to relay them, to the elected officials and to city agencies and during our public hearings on matters that come before us, we often hear concerns and ideas which don't necessarily fall within the legal consideration of that particular matter. However, I want to make clear that does not mean that they are not heard or that they are disregarded, they can spark inquiry or they can be directed to a different forum or a different agency for consideration or action and board members also raise those ideas and concerns that they've heard in debate and discussion when we vote on board recommendations. So please keep your comments and input coming. This board is a city mandated group of people from your district who want to hear from you, so we can properly represent your voice and make our district better, and we can only do that when we hear from you so keep it coming. I would like to mention also that the Angel Guardian Home application for landmark status for the building was approved. Securing the preservation of this local treasure I thank and applaud the efforts of the community, including councilman Menchaca and Councilman Brannan, this board, the historic Districts Council and the Duiker Heights Civic Association in obtaining this first landmark designation in diker heads I. Note that, despite the board's recommendation and our subsequent urgings to the landmark preservation committee that just the designation for some reason carved out the convent or mercy building on 63rd street, and this is something that I intend on raising in new business at the end of tonight's meeting, as we continue to watch Covid-19 infection rates, increase I continue to urge everyone to. Please wear your masks in public and maintain social distancing. This will not only keep everyone healthy, but it will help keep our economy going by avoiding shutdowns as the weather turns colder. Please remember: you can still enjoy your favorite meals from our local eating and drinking establishments by ordering takeout. This will help them stay in business while outdoor dining dwindles and keep them open so that, hopefully we can return there when we finally get this situation under control. We observe veterans day this month and I would like to thank all our veterans for their service and I hope you all have a happy thanksgiving and I. Thank you all for attending this meeting stay safe and well respectfully submitted, and now we were on to the district manager's report Josephine. Thank you Lori, so Good Evening board members I too, want to thank everyone tonight for donating food for the food drive in memory of our late board, member Helen Sukholovsky, who was a dedicated volunteer and was very passionate about the need to collect food and to donate to needy families. So we have done this as a tradition as a board for many years during the month of November. So to date, I'm pleased to announce that community board 10 has sent over 300 to St Patrick, Food, Pantry and loving memory of Helen, and it's still not too late to contribute. If you'd like to either make a monetary donation or to drop off canned foods to St Patrick's rectory located at 9511 4th avenue, I would also like to share with the board tonight and thank all who volunteer in our community during this time to support local efforts to help feed those in Need community board. 10 Board member Iris, Mullay who's, chair of our senior issues, housing, Health and Welfare. Committee will speak about Bay Ridge cares tonight in her report, but I too want to highlight Pam from Pc's bar and grill, who organized with the help of the Fifth Avenue business improvement, district and 28 local Bay, Ridge bars and restaurants account on Us food drive that ran from November 2nd to November 11, and we also made a contribution to that effort. The Fifth, Avenue business improvement district and third Avenue merchants asked me to remind all tonight that small business Saturday is November 28th, so please shop, local. The district office has received several inquiries about Psycholite, so we're getting ready for thanksgiving. But soon after that, we know that community focuses on the diker lights in our community and I. Just wanted to add. The bottom line is that right now we don't know what to expect. This year, it's going to be a very different year. We've heard from some honor some homeowners who will be decorating and some who have indicated that they will be scaling back. I've spoken to the 68 precinct, who reached out to some of the main bus companies and due to Covid-19, will not have charter services this year. Others may have some, it's really. You know pretty much up in the air and I wanted to assure board members that we will be monitoring the situation. I've spoken to Councilman Justin Brennan he's arranged an interagency call to prepare for the 2020 light season and those meetings will be taking place over the next week. The New York City Department of sanitation, has also transitioned to its winter schedule operation. So you may all notice that you're getting your garbage collected at different times of the day and that's to allow to enable the department to have pre-scheduled staff on hand to respond promptly to snow events. The governor has announced Covid-19 restrictions on bars, restaurants and gyms and gatherings. In New, York state we've received notification and, as Laurie mentioned, you know we can still all eat out, but bars and restaurants are going to be limited now to 10 p.m and outdoor dining areas you may have noticed, are permitted now to have heat outside and different types of heating guidelines have been sent to the board, and you know we see many businesses on the avenue who are changing the looks of their restaurants, so we do want to support them in and moving forward. The New York City Department of transportation and buildings announced the extension of the outdoor dining areas. As I mentioned, the New York City Parks Department, in partnership with New York City DOT, will be hosting a public input meeting and open house tomorrow, November 17th at 6:30. I'm going to send out a reminder tomorrow, if you have not yet registered still able to go. Their meeting is to kick off a conceptual planning process for improvements in New York, City Parks Greenway in southwest Brooklyn, from Leif Erikson Park in Bay, Ridge, past Owls Head park and along shore parkway down to the Coney Island boardwalk. The pre-registration is required. So if you are interested, you need to pre-register. I just have a few announcements. The New York City Department of sanitation, will be changing their collection schedule next week for Thanksgiving Day. So please make note of that. I will email that out to everyone. The Friday after Thanksgiving is not a city holiday each year we come in Monday morning and we get lots and lots of complaints of people who don't move their vehicles for alternate side parking and our summons. So please help spread the word and we will do so via social media and through our newsletter, our next General Board meeting will be on Monday, December 21st right here on zoom and on behalf of the District office staff. We too would like to wish everyone a very happy Thanksgiving. Thank you Josephine and now our treasures report with Shirley Chin good evening Everyone Treasurer's report. As of October 31st 2020 total personal services is 78,721 in 99 cents, total other than personal services is 2492 and 24 cents, leaving an Un encumbered budget balance of 172,580 and 77 cents and happy thanksgiving to everyone. Thank you. Shirley and now we have committee reports. The police and Public Safety Committee report with Barbara Villucci I couldn't get two months off in a row. Now could I no, but this is good liquor license. Applications means you know businesses. So let's go very happy two great places. Okay, so we met on November 12th and we were in quorum. The first establishment is a request for alteration for certification for liquor: beer wine cider for Sam's Bakery Llc doing business. What are you doing? Are you with me? Yes, I'm getting to the portion, I'm sorry here we go ahead, doing business as a townhouse lounge located at 93, 24 3Rd avenue. This is an alteration of application of the lounge which is located on 93rd street, which it says Sam's bakery the owner, Robert Ziati was present and is taking over the adjacent premises, formerly known as kimchi restaurant on the corner of third Avenue, creating one establishment. This application has the certificate of occupancy a menu and photos were provided and he will be continuing the korean cuisine. They will be outdoor dining. As per the New York City New York State Covid-19 regulations. The owner intends to maintain outdoor dining as it will be a permanent practice here in New York City, there will only be background recorded music and occasional live jazz music, as is in the smaller bar up the block. There is no adverse history associated with this owner after a discussion period, the committee's decision was to deny this application. Unless the owner agreed to the following stipulations, the premises will operate as a restaurant. There will be no sale or consumption of alcohol on the premises until appropriate authorization is issued by SLA. The hours of operation will be sunk, be Sunday through Thursday 11 a.m, to 11 P.M and Friday, and Saturday 11 A.M to 2:30 a.m. The doors and windows are to remain closed in coordination with any amplified music. There will only be background, recorded music and occasional live jazz. Music. The sound level will remain below the level permitted by the New York City Noise code. There will be no use or music on the outside of the premises. The licensee shall not use any promoter or have promoted events. There will be no smoking permitted. The applicant agrees that should it change its method of operation, it will give notice and meet with the community board, and the committee at least 45 days in advance of such change and the applicant has agreed to the above stipulations. So with that the committee requests a motion to approve this recommendation. Okay hours of operation did the committee, I'm sorry. The committee met in Cora, yes, okay, so I'm sorry Julie, you had a question: don't the hours of operation have to be changed now, based on the New York City mandates of the hours? If the restaurants are elected right now, but one but they're talking about you know under normal circumstances. So that's a general okay. Just asking thank you. Okay, do we have any other they would have to close at 10 o'clock now, if they were, you know operating now. Okay, any other questions. Anyone I don't see any hands up. Okay, just a clarification on the hi. This is yes, go ahead: Robert, yeah, just a clarification on the hours we are going to be doing Sunday through Wednesday 11 to 11 and then Thursday 11 to 12 and then Friday Saturday 11 to 2, not 2:30. just it's just a little bit different. But it's that's what we can you just the last meeting all right about it and I think that's what we came up with and it's 94th Street 93Rd Street did I, say: 95th street, it's 93, 24, 3Rd, avenue, yeah, it's the corner of 94th! That's what you had on your application. Yeah 90 yeah, correct, that's 94.! That can always be changed so just Robert. Can you just give me your hours again? So it goes into the record as part of the motion sure it's 11 to 11 Sunday through Wednesday 11 to 11 Sunday through Wednesday, and then Thursday 11 to 12. Thursday 11 through 11 a.m, to 12 p.m, right, okay and 12. It's 12 a.m, midnight and Friday and Saturday 11 to 2 a.m. Eleven to two a.m: correct and you've spoken to Josephine about this will be operated as one establishment of the one liquor license right, correct, okay, so I have amended the hours in my in my report and I will fix that for you Josefina. So that's you tomorrow! Okay, thank you, okay, so that that's the recommendation that the committee presents to the board and I ask for that to be moved. Okay, so do we have any other questions or comments? I don't see any so we will call the question Josephine. Do you want to do a roll call? Do you think we can do this by hand raising I think we could do it by hand raising so okay. So all in favor, everyone just raise your hand. Okay, I'm actually looking at the screen and Dorothy's taking a picture. Okay, there's the hair. Everybody got that Joe, yes, I got it okay and for anyone opposed okay, I see no one opposed; okay, any abstentions or recusals one for Janna one for Janet one for Janna. Is that a recusal yeah recuse them okay, and did we miss anybody? Let's see Barbara your hands are still opposite. Yes, Joe, I'm in favor, yes, okay, thank you can I just say one other thing: I, don't know if it matters at all, but it's not going to be a korean restaurant. It's going to be a japanese noodle bar now, it's japanese! It was japanese on the last meeting too, but someone at the end of me last meeting said they'd hoped that I'd keep one of the korean dishes, but that was it no I thought you would say that. Well, it doesn't matter. Okay, I, don't think it's I, don't think it's salient to what we're talking about but yeah. Thank you. Okay! Thank you had a menu, so I'm good. Okay, do we have let's see Larry Stelzner Larry was also on the phone. Yes, okay, great, okay, thank you! Okay, and do we have a tally? Does the motion carry or motion carries? Yes, okay, thank you, Barbara! You want to go ahead to the next item. Yes, I! Do! Okay! Thank you, Robert! Thank you! Everyone! Thank you and good luck. The second establishment is a request. It's a new application for liquor, beer wine, insider for Fra, Vemma, Corporation, doing business as Bona, Cera, restaurant and pizzeria. This will be a full restaurant. The owner of Vincenzo Triolo was present via zoom. Also, this application has a certificate of occupancy photos of the establishment. Are there were some pictures of it under repair? We do not have a menu as of yet but the premises was formerly known as La Sorrentina, Pizzeria and restaurant. The address is 6522 6524, 11Th Avenue there will be a. They will be outdoor dining until the New York State New York City Covid-19 restrictions are removed. Then he will not have outdoor dining. They will only be background recorded, keep on getting distracted by the noise in the bathroom. There is nowhere. There is history associated with this address and Mr Triola is experiencing business as he owns a restaurant named Sal's family pizzeria, located at 384 Broom street in Manhattan after a discussion period. The committee's decision was to deny this application. Unless the owner agreed to the following stipulations, the premises will operate as a restaurant. There will be no sale or consumption of alcohol on the premises until appropriate authorization is issued by SLA. The hours of operation will be Monday through Sunday 11 A.M to 11 pm. The doors and windows are to remain closed in coordination with any amplified music. They will only be background recorded music and the sound level will remain below the level permitted by New York City Noise code. There will be no use or music on the outside of the premises. The licensees shall not use any promoter or have promoted events. There will be no smoking committed, and the applicant agrees that, should it change its method of operation, it will give notice and meet with the community board at least 45 days in advance of any such change. The applicant has agreed to all of the above stipulations, so with that the committee requests a motion to approve this recommendation. Okay, so the motion is on the floor. Do we have any discussion? Yes, any okay go ahead. Ann question: is it one they still have? Sorrentino was a row of buildings about four or five buildings. Is this application pertaining to one of those or the entire run? They have two house numbers. They have two 65 22 and 65 24. the two of the buildings. Thank you. Are there any other questions? Anyone I do not see any I, don't see anyone with a handcuff, no okay, then we will call the question I'm going to try to do this by show of hands again so all in favor. So for those of you who don't have your video on, please put it on so Josephine can see your hand or not okay, great I'm in favor, okay, Joe in favor, great okay, so just hold them up until okay, yep nope. We have everyone. Let me get one Dan, put the other hand down all right. Anyone opposed okay, no Julie, you're opposed no. Okay, no Stella your hand is up. Okay, yes, Stella is in favor, okay and then do we have anyone who's on the phone we got, Joe Larry chimed in and any abstentions or recusals. Okay. So how are we doing what's? This motion carries okay. Thank you very much. Thank you to the applicant and good luck. I'm looking forward to it. I like styles on Broome Street. So next we're not there. We have one. You have one more item right, okay, so the six eight police precinct also was part of this meeting. There were four offices of the precinct present. They were Michael Pena Pinto. Forgive me officer if I don't pronounce your names correctly: Frank Ing, Brethsen, I-N-g-e, b-r-e-t-H-s-E-n and highway officers. Eric Miller and the community board requested enforcement data in response to a resident who attended the public session of last month's General Board meeting and spoke on behalf of several residents and business owners. She raised pedestrian safety concerns related to a growing number of motorized vehicles, known as scooters riding recklessly on local sidewalks and on the Fifth Avenue commercial corridor. She added that the outdoor restaurant seating areas were because of that many patrons were fearful. The officers spoke about local enforcement efforts to address safety concerns regarding these motorized vehicle operators, not following the rules of the road which include wearing helmets, obeying traffic signals riding in the proper direction, overloading the vehicle with too many passengers and riding on the sidewalk. So the office has talked about some of the tickets that have gone out because of that on. This committee discussed a future community education campaign, perhaps through our traffic and transportation committee. In addition, we invited in we we're going to invite Councilman Brennan to this meeting, as we need to learn more about the new legislation that will soon legalized motorized scooters in New York City respectfully submitted. Thank you Barbara, so that report is just informational, does not require any vote, and now we have senior issues, housing, health and welfare report, an update on a number of items, so thank you. Lori you're welcome go ahead. Thank you. Iris. The meeting the committee meeting was held on October 22nd. It was a zoom meeting. It was con convened by the chair at 7 pm and live streamed on YouTube Marissa Perez New committee member was introduced at that meeting. This is the first committee meeting held since the spring. As such, we invited representatives of three community-based agencies to tell us about their important activities, which have supported vulnerable neighbors during the covit 19 Pandemic Emergency Panda Bay Ridge cares. Their website is simplybayridgecares.org Karen, Tedros she's. The founding president, gave a brief overview of how Bay Ridge cares began in 2012 at a time of another crisis, superstorm Sandy, when now Councilman Brannan reached out to Karen. Together with the help of volunteers and local elected officials, they provided 25,000 meals to those in need. After that, the non-profit agency emerged and over the last eight years, the agency now has over 600 volunteers providing services that range from orchestrating a full renovation of the Fort Hamilton Senior Center to small local cleanup events, so they're involved in so much in the community during the Pandemic Bay Ridge cares with added Covid-19 relief funds is again addressing needs during an emergency extending services beyond Bay Ridge to all communities served by our local elected officials. Where am I? Sorry, it's not I'm reading off my report and now I didn't move it and it's not moving for me. There we go sorry so, specifically during the Covid-19 Crisis Bay Ridge cares partnered with other organizations such as the Bay Ridge, Center and catholic charities to provide their members and clients with mass and fresh food all were delivered to homes by volunteers. Their volunteers also ran a wide range of errands and made follow-up. Wellness calls to all that sought their services again this year, Bay Ridge cares will be serving Thanksgiving meals. Traditionally, that's done at shore Hill, both for its residents and people of the community come in for the meal this year with people unable to gather all male meals will be delivered again to those residents at your hill and to residents throughout the community. The meals will be delivered on November 25th the day before Thanksgiving and then on. Thanksgiving everyone will receive a wellness call from the volunteers committee. Members were very impressed with all that they heard about what Bay Ridge cares has done and is doing and has done during this Covid-19 Crisis committee members expressed their gratitude to Karen for her leadership and the wonderful work of the volunteers, this volunteer-based organization and its significant contribution to the community. Thank you so much really tremendous in the fact that there are only 600 volunteers and clearly welcome any others from the community would like to participate. The next agency that was presented a program this is called Bay Ridge Village. Its website is Bay Ridge, Village.Org and David Dring he's the director of innovative programming for older adults. He introduced us to Bay Ridge village. It's a new online community initiative for older adults created as an insular platform for those who may not be technologically savvy negotiating Facebook, YouTube's and other complex websites. The village initiated by Baybridge Center and Bay Ridge connects launched on March 19th. This was a planned launch, but it was very fortuitous that this online community would be available at a time when people were really sheltering in place. So it is managed with the support of a tremendous group of social work students this year through Bay Ridge, Center and Bay Ridge connects 17 social work. Students are having their internships and many are working on this project. In addition to social aspects, the platform connects members with information resources and programming from Bay Ridge, Center and Bay Ridge connects. So we gave some statistics of all the services that were provided again during this pandemic time. So 550 email blasts have gone out. Informing members of services and programs resulting in 15,000 wellness check-in calls. 280 people were enrolled in get Food New York City during the summer 63 air conditioners were placed over this time. A hundred and one thousand home delivered meals were provided. 163 uber rides mostly to medical appointments, were given 56 art programs, 117, ed Rec programs, 108 health management services, 192 physical exercise activities and 157 technology services, so tremendous amount of service provided in our community, a Bay Ridge Village demonstration was given, so we could actually see the website feedback was very positive with common flag. This is amazing. Jeffrey a village member spoke about how Bay Ridge Village helped with the isolation of sheltering in place during the pandemic, and the discussion followed very active because everyone was very excited about all that they have been hearing from both of these programs and really wanting to explore collaborative initiatives. First off is everyone present. All the members were talking about sharing information about programs on our various websites. There was discussion about exploring grants for large screen tablets or computers for older adults in need, and also how to fund or advocate for affordable internet wi-fi hotspot connections. Various ways older adults can learn about technology, including offering training through the community Board and Josephine had suggested. Considering this, as a committee initiative, it was suggested that Fort Hamilton High School has a large volunteer program for their students and that we tap that to see about meeting the needs of teaching seniors about technology and having an intergenerational project that way the Bay Ridge Jewish, Center Ruth was talking about, has resources to help seniors, find available technology to loan out and she's. Also aware of someone who refurbishes desktops and may be donating them and Judy Grimaldi volunteered that she has 25 desktop towers and screens to donate, because her elder law office is upgrading to laptops and Marianne Nicolosi was saying how very often there's a talk about tablets or laptops for seniors when in fact they really benefit by having the large screens. This really wonderful donation that Judy offered and lastly, I presented I- am the director of the Bay Ridge Counseling Center, it's a program of the Jewish Board and our website is simply Jewishboard.Org. I spoke about how the clinic has been operating during the pandemic. The clinic has had an increase in service requests, as anyone would expect with the mental health toll that this is taking. So it being a serious mental health crisis, others are experiencing anxiety, depression due to the pandemic, they're seeking assistance and support. You know whether it be processing trauma, managing the mental health challenges associated with loss, illness, isolation, financial hardship, there's a wide range of family stressors we've seen a real increase in domestic violence, and our clinic kind of always has tended this way and continues to in that. A third of our clients are under the age of 18. so working closely with children and families in our community, the clinic transitioned to providing all services through telehealth by March 20th. So, whereas we always provided services face-to-face in person within a very short span of time, as many did, we transition to providing remote services. During that time we have been able to and consistently throughout retained every staff. Member and with the use of zoom or phone calls have provided remote services to all of our clients. Telehealth has been very successful with the clinic and we hope to be able to continue to offer some form of it after the pandemic to reach those with limited access to on-site services due to a wide range of personal issues. The clinic physically reopened this summer, taking every health and safety precaution first to offer the staff an opportunity to work remotely from the site. People just wanted to get out of their living rooms off the kitchen table. We welcome staff back and now we are providing a limited number of face-to-face services. I want to interject here that anyone interested in services. Please contact us. Since we are a program of the Jewish Board, there is a central point of entry. It's one phone call, it's called one call and that phone number is eight four one call those numbers translate to eight four six: three: two five and the clinic accepts Medicare and Medicaid. Most insurances and financial need-based. Fighting skill for those without insurance I also want to give a shout out and thank Lilly one of those social work students. She took minutes for the meeting and that was very helpful for this report and that meeting did adjourn at 808 pm respectfully submitted. Thank you very much iris, and that concludes our committee reports. And now do we have any old or unfinished business that anyone like would like to raise. No okay, any new, oh wait! We have Larry unmute yourself, please Larry did you want to speak? I can't hear you there you go. No I complain, I meant to Josephine about this drag racing only fourth Avenue, and it's not just during the night. It's even through the middle of the day. People start drag racing down, Bay Ridge Parkway, also on Fourth Avenue Johnson. Have you heard that Larry I did relayed that to the captain of the precinct, and he assured me that they are doing enforcement of drag racing throughout the community and he did. We did know both Bay Ridge Parkway and Fourth Avenue right, okay. Anyone else would anyone else like to raise anything. Okay, I know this has been a long meeting. I would like to mention one thing that I had mentioned in my chairs report. That was the landmarking of the Angel Guardian home one, I'm very happy that it did achieve landmark status. However, the application was put in much of that site had previously been demolished and they were able to get landmarking for the main building. But there was a second building also on the site that requested to be landmarked, which was the convent, which has the same architectural value and architectural details as the main building and for some reason that building was not included. The landmarks committee carved that out and this board had voted to include that in the landmarking and I was hoping that maybe we could just send a letter to our local elected officials and councilman Menchaca, who did also support this board's recommendation to reaffirm our request that be landmarked and that we send out that letter. I, don't know if it will. If the board does support that I, don't know if it would reach it in time, but hopefully in order to save that building, so I would request. I, don't know, oh and I'm sorry, Anne, Flutico, I, agree wholeheartedly and also I. Think it's not just about adding another building of value, but that I would suggest that the two buildings together are a more potent historical piece of work in combination with each other. Okay, thank you and I. Don't know if there's any anyone else have a comment on that: go ahead, Steve. What is the proposed use of the building? I know it's landmarked and I absolutely support that, but what's the support the proposed use and would the convent somehow another tie into that? Well, I think that I don't know if the convent would tie into it, because I think that the present developer doesn't want. The convent I think that they would seek to tear that down Joe. What is the proposed? What's the proposed use? Is it right now the main post yeah for the main building I? Believe it's going to be a yeshiva yeah. You know a school yeah, it has it it's a deed restriction. That is that it must be a community facility, so I believe I, don't know if there's a firm tenant yet or purchaser, but we had heard that a yeshiva I believe was mentioned during the hearing. Yes, I, don't understand why the convent couldn't you know, tie into that in some way as a facility that would go along with the issue, nor do we and we thought it an odd move by landmarks. There was some commentary in that regard from some of the other landmarks members, and so we are hoping to possibly just re-send a letter America. My motion would be to send a letter to request our you know, just a reaffirmance of the board's position and to urge our local electeds to make a last push for this. Thank you, Larry. Does the new developer want to just tear it down to you know, build a larger facility there Joe. Do you know what, if there's something else there or what so the because the building was not landmark, it can be raised. The Landmarks Preservation Commission said that they would be working with the developer on the size of the building, but under zoning I believe that the current bulk of that building, if the building was raised, could not be restored in its present form. So it would require significant renovation if they were to keep that as a school and to maintain that bulk and density of that building, it would really change a lot at the hearing. The commissioner said that they had a commitment from the developer to kind of work with them, but not save the building kind of work on scope and design of the building build something larger on that side. Can they within the same footprint right the convent building? Yes, we can make it four stars if they wanted to yep, they could square it off. Okay, so I would move that we send that letter just re reinforcing what this board is already voted in favor of to our local electeds and including councilman Menchaca. So if I have a second on that- and thank you, Anne and I don't see any other discussion. Oh Janna, oh yeah, okay, sorry so I would like to. Since that motion is on the floor. Is there any discussion, any questions or comments? Okay, so any all who would be in favor of that motion? Please raise your hand. Okay any. Do you have that Joe? Yes, I! Have it any okay, stellar opposed Stella? Are you opposed Stella? Can you tell us what your vote is? I was confused. You had your hands up for a while. No I'm in favor, okay, thank you. Okay, Joe Suckalovsky you're on the phone I can't see your hand. Oh I, think we lost Joe I. Think we lost Joe. Okay and lobby raised his hand. Okay, so motion carries. We have 38 members present all in favor. Okay. Thank you very much and that would ask for a motion to adjourn. Oh I see lots of him all right. We've got that. Okay! Thank you. Everyone! Thank you very much for bearing with us through this happy thanksgiving.",
            "summary": "We want to thank Mr Lamia for his service to his country and this community, and we humbly present him with the honor of the pledge.\nI was with you all in person, but right now we're going to be zooming, at least for the short term, but I wanted to just come by and talk to you directly about some of the issues we're facing in the city.\nThat's right, but let me first acknowledge Laurie Willis, our great CB10 chair and Josephine Beckman, the district manager I know Councilmember Brandon.\nWe should recognize that roughly one-third of the city's 240,000 small businesses may never reopen that's a lot of small businesses that have been blindsided by the pandemic and when you think about the fact that 98 of city, employee city employers, provide business or jobs for 3 million people, we first have to go directly to help our small businesses.\nFirst, we're going to have to invest in tax deferrals for our small businesses that are struggling right, now, they're, trying to navigate city agencies, especially the restaurants that are moving from indoor to outdoor dining or did that during the warmer weather.\nWe're, also going to have to incentivize some tax credits, new businesses that will come to vacant commercial corridors, whether we're in this community or in communities around the city.\nI want to talk a little bit about how we do that, and obviously we're going to have to help our small businesses with tech and give them the assistance to expand their businesses.\nMy office has continued to work with parents around the city and look I know from personal experience.\nThey're, going to remote learning right, now, they're on remote learning and I can tell you it's one of the hardest things I've had to face as a parent, but I also know my wife.\nMany parents can't do that, so I'm just wanted to come by and let you know that my office is here to help.\nLastly, I just want to say to all of you tell me, where you're seeing the trash pile up, we're spending a whole lot of time in our office, trying to understand why the mayor is cutting such essential services like trash pickup, when at a time we want to show that the city is by it is vital and on the way, back, you don't cut programs that really impact communities.\nLots of familiar faces today is a very anxiety invoking provoking day, but I wanted to come by tonight to make sure that I say hello to everyone and to remind you that our office in Bay Ridge is here for you.\nWhen Bay Ridge was in one of the orange or yellow zones, we started doing, you know practicing no contact, but anybody who needs help.\nI want to make sure that everyone is staying in touch with the office and know what we have planned tomorrow.\nI want to echo some of what I heard the controller say and just let everyone know that I continue to monitor.\nWhat's going on here, not only in Bay Ridge but across southern Brooklyn vis-a-vis, the Covid-19 ray and the precautions that we're taking a lot of people are suffering now, not just people who are falling behind on their rent.\nAnd I certainly want to hear from people in the neighborhood where they think these cameras should go so I'll be putting some stuff out on my social media and in the press about this.\nIf I'll have a chance to speak, so I'm just going to bring it up now for the Fifth Avenue Euler peering that we're going to have if anyone from the public or from the community board wants to submit testimony to the borough president's office.\nSouthern Brooklyn has some of the most special small businesses in New, York, City and in the world, and we want to honor those small businesses and just a quick note.\nSo, that's something that you know he's very committed to working on and something that we want to mention and last, but not least, happy thanksgiving to everyone.\nI would like to thank community board 10 for allowing me to speak.\nWe have begun a brand new program in which we work with people who are interested in taking a look at their very block and who are wanting to implement some changes to improve their blocks.\nThe lot at 9114, Fifth Avenue, was purchased by a local doctor who wanted to build a hotel, 91 14 5th avenue is located within the Special Bay Ridge Zoning district within the c82 district, which allows for the construction of commercial community facilities buildings with a maximum height of 70 feet.\nThe application included a wider area beyond his lot because of existing legal precedent that does not allow developers to limit a rezoning.\nAt, the October 29th meeting members of the public raised good points about maintaining the commercial uses in the area and the residential mix, block density and scale again any of the properties along 90.\n08 to 91, 28, 5th avenue, blocks, 23, 26, 28 and 27, and 29 and 405 for 19 90 second sheet, and they voted to reduce the project area in the mid block area of 92nd street by three zoning lots, 405, 47 and 409.\nThe community board can not change its own current zoning, contextual district regulations.\nAgain the discussion by the committee and comments from the public, most of which concern the scale of the building and the impact on an area that already has many traffic problems and that we have this proposal as an alternative to an as of right.\nA second motion was made to approve the application, but reduce the number of lots considered for rezoning.\nJust would like to note, in addition to the community discussion at the October 29th meeting district manager, Beckman, had lengthy discussions with residents and business owners who contacted her with concerns about the site and the proposal.\nYes, Lori I just want to also mention that the applicant is present through their representative fan and available to show any slides or if you wanted to do a you know, a brief run through visually of the project.\nThe motion was to approve flat out, to approve and at the same time, to write and ask that, while we approve-- because we don't want to lose that at the same time, we said that we would have a right to the city planning or excuse me.\nWe agreed to you're correct, so we have a motion to approve the resulting application as presented and then to write to the department of City planning and the borough president to request the reduction of the number of lots as 32 33 and 34.\nI know: we've presented a few times at the land, use committee and procedurally, as Doris said, we're in new larp and we're towards the end of the community Board review.\nStephanie I just wanted to raise some of the concerns that we addressed in the committee meeting.\nEach lot would also receive the bonus far and that's just the height and the bulk just seemed to violate the you know the intent of the Special Bay Ridge District, and it really.\nThat means that if we don't change the zoning to allow for this residential building, we will get a hotel.\nThe gentleman who owns that has a right to build that, and the thing is that this whole controversy stemmed from the fact originally that the community did not want to see a hotel there directly across the street from the school.\nThe committee spoke anything about how the community would support that amount of housing, but not just that building if there would be nine other lots that would build or have the right to build to that height in that capacity, how the Bay Ridge community itself as far as schools.\nWhat you're, referring to as a corridor, which runs from 92nd, that portion of the building will be one story, but it's one building and the concern is that the builder is going to combine all the twos and all the threes into two separate developments, not this builder, but that the zoning, the rezoning would permit someone else to build.\nThe community response was that we don't really need or want a hotel right across the street from the school.\nSo he, the developer, said: okay, I will look into building residential as opposed to hotel, but the current zoning does not permit that residential use.\nAnd I just want to ask the question of Doris or, if Steve knows when they did, that environmental impact study on the no need for parking, because we were in.\nHe could explain more about the parking, but it looks at what is an as of right, which is the no action which would have been the hotel versus the residential and does a quick question on that.\nYou know to like say nine stories: Will that open the door then, for us battling everybody else to try to keep to our height requirement.\nWe could approve that knowing what's going on in our neighborhood also, if the developer would build a hotel, he would certainly have to have an opportunity for parking.\nSo I think that if the developer built a hotel, he would probably build parking inside and frankly.\nI, just I think the hotel doesn't need a lot of parking, although you say that.\nIt, was purchased by a local doctor who wanted to build a hotel and.\nI, don't I think we need a lot of things in Bay, Ridge, I.\nDon't think we need another hotel, our first idea to get the school construction authority to purchase the lot.\nIf we didn't want a hotel, was to try to do what we're doing now, which would be to allow the developer to do much needed rental, housing.\nSo, you know we're not up zoning here, we're not upsetting Bay Ridge for skyscrapers or anything like that.\nI. Think it's just important to remember that the developer has purchased this lot and he you know he has a right to build something: here.\nSo my only concern is, like I, said, the community support for these buildings and families.\nI think we need to consider that, because once you rezone it's going to be very hard to stop everyone else to want to rezone certain areas.\nI would like to just speak to one thing, just because just a point of Fact Bay Ridge, when this community board worked very hard to get it.\nYou know most of our avenues, most of our the areas in Bay Ridge and in community board 10 as a whole.\nIt was noted that there were no comments at the borough president's meeting and I want to say that I logged on to the meeting at six o'clock and at 8:20 the first issue about a development in community board 14 on East 16Th street was still going.\nOur mandate is to voice the concerns of our community, as they pertain to the matters that come before us and to voice the unique needs of our portion of this vast city to the local officials and agencies.\nLike, the local zoning resolutions we just discussed, then there are the needs and concerns of the community that we hear from you, and we use our form to relay them, to the elected officials and to city agencies and during our public hearings on matters that come before us.\nThis board is a city mandated group of people from your district who want to hear from you.\nThe preservation of this local treasure I thank and applaud the efforts of the community, including councilman Menchaca and Councilman Brannan, this board, the historic Districts Council and the Duiker Heights Civic Association in obtaining this first landmark designation in diker heads.\nDespite the board's recommendation and our subsequent urgings to the landmark preservation committee that just the designation for some reason carved out the convent or mercy building on 63rd street, and this is something that I intend on raising in new business at the end of tonight's meeting.\n4Th avenue, I would also like to share with the board tonight and thank all who volunteer in our community during this time to support local efforts to help feed those in Need community board.\nRidge cares tonight in her report, but I too want to highlight Pam from Pc's bar and grill, who organized with the help of the Fifth Avenue business, improvement, district and 28 local Bay, Ridge bars and restaurants account on Us food drive that ran from November 2nd to November 11, and we also made a contribution to that.\nYou know we can still all eat out, but bars and restaurants are going to be limited now to 10 p.m and outdoor dining areas you may have noticed, are permitted now to have heat outside and different types of heating guidelines have been sent to the board, and you know we see many businesses on the avenue who are changing the looks of their restaurants, so we do want to support them in and moving forward.\nThe New York City Department of transportation and buildings announced the extension of the outdoor dining areas.\nThe agency now has over 600 volunteers providing services that range from orchestrating a full renovation of the Fort Hamilton Senior Center to small local cleanup, events, so they're involved in so much in the community during the Pandemic Bay Ridge.\nCares with added Covid-19 relief funds is again addressing needs during an emergency extending services beyond Bay Ridge to all communities served by our local elected officials.\nWe did know both Bay Ridge Parkway and Fourth Avenue.\nWell, I think that I don't know if the convent would tie into it, because I think that the present developer doesn't want."
        }
    }
}