{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "title": "Police and Public Safety Committee Meeting",
            "publishDate": "2020-12-16",
            "shortDescription": "",
            "lengthSeconds": "0:11:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "stale"
        },
        "properties": {
            "videoURL": "-Ez-wtiKSOg",
            "fillerWordCount": {
                "uh": 16,
                "um": 22
            },
            "readTimeFullTranscript": "7 min read",
            "readTimeSummary": "2 min read",
            "wordCountFullTranscript": {
                "owner": 8,
                "music": 6,
                "stipulations": 6,
                "menu": 5,
                "business": 4,
                "premises": 4,
                "food": 4,
                "attorney": 3,
                "beer": 3,
                "restaurant": 3
            },
            "wordCountSummary": {
                "owner": 6,
                "stipulations": 4,
                "menu": 2,
                "floor": 2,
                "plans": 2,
                "establishment": 2,
                "premises": 2,
                "music": 2,
                "level": 2,
                "draft": 1
            },
            "fullTranscript": "Hello, hi Gus, oh hi, hello. How are you I'm not an attorney? I'm the attorney's Rep So John asked me to appear on his behalf and assist Lewis Louis I usually handle the community Board meetings, hello, Justine. How are you hello? How are you very good so we are live now on YouTube and madam chair. We have a quorum that if you're ready that I am ready to begin okay, so I am going to you want me to share my screen. Should I begin with that? Do you want to call it to order? Maybe you like, because you know I can't look at you and this because I lose my place. Okay, you decide what how you would like to do that? Okay, does everyone see my live? The share screen? Okay, great? Yes, okay, all right! So today, on December 15th we have a new application for wine, beer and cider for Luis Gyro Corp doing business as Louise Gyros. It is located at 7720, third Avenue, the owner Louis. Forgive me licoresos, yeah, actually very well very good. The owner Louis was he present is present, and he also has one of his attorney. Representatives Mr, Gus, Haleakas, President. Okay, was that a bad that was a bad well, it's better than most. How? Actually? It's helped? Yes, you're still helping me out. Yes, okay, so let it show Halcyous. Thank you. This applicant is in the process of applying for a letter of no objection which in probability will be granted. As this premise was already a restaurant. It was Zeke's a few years ago and more recently, it was known as fatty daddies furnace restaurant photos were not available at this time. The questionnaire was complete. We do have a draft of the menu sent in to the Community Board Office earlier today, premise photos and floor plans for both indoor and outdoor seating areas were provided and the owner intends to maintain outdoor dining in the rear yard. There will only be background music. There is no adverse history associated with this owner, as this owner has had several other establishments owned in this community, known as spartan, Souvlaki, One and spartan Souvlaki 2, so Joe. If you want to just browse through that, so the committee can look at the floor plans and the menu that would be great, so you just roll back one, so the rear yard will have room for five. Is that five tables and you're gonna promise us you're not going to hook up televisions you're not going to have an outdoor grill you're, not going to have speakers and dancing and live music out there right, 1,000, okay, none of that will happen. None of that will occur. Yeah I should rephrase myself, okay all right, because the indoor premises is really pretty small. If I remember that correctly, it's tiny we're looking at about maybe 10:15 sheets of post. You know indoors right, especially with what's going on right now, with this whole craziness in the world. You know it's probably cut down even more than that. So right, it's a very small. It's a small, it's probably the size of like what it would be a pizzeria. That's the kind of you know, storefront that it is and with the proposed business I'm trying to bring out it's more of a takeout type of place anyway. Fast food gyros, much like Zeke's, was exactly and if I can keep that same principle of not even having a waitress service and doing more of the order ordering at the counter and bringing it to you. That would be even better. In my opinion, right: okay, Josephine, you want to roll up I think you really have the menu now. This is a draft correct, so yeah I'll hold you to this, but just the you know, in order to have the license, I think that they request a menu to see what kind of food you have. The menu will be finalized pretty soon and we should have hard copies within a week or I believe yeah. Within a week we created it I believe it was yesterday. Today we created it with the suppliers on the point-of-sale system. So very soon the hard copies are coming. Okay, all right joe! You want to yeah anything else that you see is basically you know my battery don't go away. Oh, this zoom is ah this virtual world that we're in okay, I unplugged it to use my printer, where I'm sitting it's like. Okay, we're good. Okay, so what happens Louis is that it most times we. The wording for our meeting is that we say that the committee's decision is to deny an application unless the owner agrees to following stipulations so, and they are basically pretty routine for this type of establishment. Okay, other kinds of establishments have pages and pages okay, but most restaurants such as this have the usual eight to ten stipulations. So before I read what I have, which are the you know, it's a formula that I use. Are there any questions from the committee regarding this establishment? Honestly, no, like I, said I was holding on Louie hold on we're waiting for questions from the committee hold on. Oh I'm committing I apologize just helping out okay, anybody from the committee of any questions regarding okay, Louie. You want to just tell us anything. You can. No I was just like I said my parents owned and operated a successful business for 25 years kind of got to the age of where they just wanted to get out and I want to continue the legacy of the gyro business and like having a nice glass of wine or beer or a nice greek beer imported from Greece, with your gyro kind of accents, the food a little bit to kind of reminisce like you're in Greece, so that's kind of what this meeting I guess an application is for and as for the guidelines, I will abide by it's, not a sports bar, so there will be I, have a TV up inside just for the news and to keep people occupied I guess maybe waiting for food keep up with what's going on in the world, but as for a TV in the backyard loud music. That's completely out of the question: it's not even a thought. Okay, all right! So I'm going to read what the usual stipulations are for an establishment like this. Okay, so I will say that the committee will deny this application unless the owner agrees to the following stipulations: that the premises will operate as a restaurant, that there will be no sale or consumption of alcohol on the premises until appropriate authorization is issued by the SLA that the hours of operation, as you had in the application will be Sunday through Thursday 11 a.m, to 11 P.M and Friday, and Saturday 11 A.M to 12 a.m. Is that that's correct, right? Okay? Yes, the doors and windows are to remain closed in coordination with any amplified music that there will only be background recorded music and the sound level will remain below the level permitted by the New York City Noise code. There will be no music on the outside of the premises that the licensee shall not use any promoter or have promoted events. There will be no smoking permitted, and the applicant agrees that, should it change its method of operation, it will give and meet with the community board in the committee at least 45 days in advance of any such change. Those are the stipulations. Are you? Okay with that? Yeah? Okay? So you know when Josephine's ready, she'll call you in to sign this. You know she just takes it directly from what I've said, which is now also you know recorded, and we will also discuss this at our general meeting on December 21st. You know to bring it in front of the Final Board Right Josephine. Yes, that's correct. Okay, so as the owner has agreed to the above stipulations, committee can I have a motion to accept this recommendation motion to accept hey sandy I, second, okay, next, second, okay, all in favor guys could raise your hands raise ahead. Yay, okay, great okay, it's unanimous I do have a question: Louie. Are you going to be doing deliveries? Yes, okay, well, I need I. Think you need to circle whether you're going to be using a bicycle or not. Okay, like I said, as of now, the weather I'm most likely going to be strictly cars. I have about three four delivery: drivers and cars. If, like I said by any chance, there is a bicycle that does go out: I will immediately notify you guys or if I have one right. Just do us one favor in case your bicycler goes on to those motorized vehicles, I honestly, hate them myself, I, wouldn't that they follow the rules of the road. That's all I pray, okay, they're good! You go! Okay! Yes, so there's nothing else! Josephine! That's it! The other item on the agenda requested an adjournment to next month. So only one item this month. That's pretty good excellent! So we're done. We will see you all on Monday at the board meeting. Okay, thank you! All right, stay safe in the blizzard everyone stay safe, everyone! Okay! Thank you.",
            "summary": "We do have a draft of the menu sent in to the Community Board Office earlier today, premise, photos and floor plans for both indoor and outdoor seating areas were provided and the owner intends to maintain outdoor dining in the rear.\nThere is no adverse history associated with this owner, as this owner has had several other establishments owned in this community, known as spartan, Souvlaki, One and spartan Souvlaki 2, so Joe. You want to just browse through that, so the committee can look at the floor plans and the menu that would be great, So you just roll back one, so the rear yard will have room for five.\nThe wording for our meeting is that we say that the committee's decision is to deny an application unless the owner agrees to following stipulations so, and they are basically pretty routine for this type of establishment.\nSo I'm, going to read what the usual stipulations are for an establishment like this.\nOkay, So I will say that the committee will deny this application unless the owner agrees to the following stipulations: that the premises will operate as a restaurant, that there will be no sale or consumption of alcohol on the premises until appropriate authorization is issued by the SLA that the hours of operation, as you had in the application, will be Sunday through Thursday 11 a.m, to 11 P.M and Friday, and Saturday 11 A.M to 12 a.m. Yes, The doors and windows are to remain closed in coordination with any amplified music that there will only be background recorded music and the sound level will remain below the level permitted by the New York City Noise code.\nOkay, So as the owner has agreed to the above stipulations, committee, Can I have a motion to accept this recommendation."
        }
    }
}