{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCjXB7nX8bL2U2sje8d212Yw",
            "title": "August 2020 Executive Committee Meeting",
            "publishDate": "2020-08-31",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 202,
            "um": 501
        },
        "wordCountFullTranscript": {
            "people": 52,
            "meeting": 50,
            "community": 48,
            "board": 46,
            "budget": 34,
            "committee": 34,
            "year": 33,
            "lot": 31,
            "school": 30,
            "things": 28
        },
        "wordCountSummary": {
            "people": 15,
            "community": 11,
            "committee": 11,
            "meeting": 8,
            "board": 7,
            "school": 7,
            "office": 6,
            "issues": 6,
            "budget": 5,
            "things": 5
        },
        "fullTranscript": "Hold on, let me go back. Okay done. Okay up, there say https to dots, slash, bit.ly, slash, 3 d, w e l v when I hit that I go into if zoom app is installed, tap, launch, meeting open this page and zoom and say open, so I should hit open. Okay, I hit open, hey doctor, we see you, okay, you see me yeah. Okay, all right! You see me too hold on. Let me get on video. I mean get on done speaking jesus I don't want to. I don't want to do that. I want it like it always is done. Your video is stopped. Your microphone is huh. I don't see it and I can't get to go mute okay hold on I'm trying to go, so I can mute myself to hear other people done speaking. It says done speaking. Your microphone is unmuted. Your video is stopped, oh god yeah, but it's not up here and I'm tapping the screen and all the other time. On the two meetings I was on just now. I didn't have no trouble. Oh okay, I'm going back into the calendar I'm going back to actually, but I want to go on mute until it's time. For me to speak from hello. Is this for the community board meeting? This? Is the executive board meeting of community board 10? Yes, okay! Thank you! Kindergarten, hello, hi, greetings good evening, everybody good evening, hello! So good evening, everyone good evening looks like we have a pretty good amount of people wait one more minute and then we can start, and here you are yeah okay good evening my name is cicely harris and welcome to the august 26th a meeting of the cb10 executive board. I am the chair of community board 10.. I like to call the meeting to order. It is now 6 34 p.m. So, if you all were able to look at your emails that you received from juanita she's put on attached to that email, the september 2020 calendar. So if you all could take a look at that and let juanita or shatik no, whether or not you will be able to keep those meetings. That would be great, as you can tell on there, we'll be back in full session after starting in september, so our first full general board meeting will be via zoom, so we are going to continue to stay virtual, but that will be our first general board meeting of the 2020 2021 community board season, okay and shatik. If you can sometime, maybe throughout the meeting just share the calendar. I don't know if you can on your screen, but just in case people can't see it. If you can share that at some point, that would be great. Okay, all right we're going to start with my report, so I have continued to stay busy and I'm so glad to see that so many people are making it to the meetings and that the board as a whole has stayed active. I always have to repeat the same thing, but it is- and it does still remain true- that when we, when I do talk to other community board chairs and go to the borough board meetings- and I think it's important to tell you all, especially as the leaders of this board just you know how pleased you know I am to be serving with you, but also just how we stand out. You know with the other boards- and you know, of course, they're doing things that are great for their boards and their communities, but you know we are doing the same and sometimes, if not more so I'm just so excited the work that we've done over this summer, especially in the midst of a pandemic. So again, thank you for all of your hard work, so we did have another bro board meeting, one of the main things that came out of that and in a major presentation- and you know I've been able to talk to our education chair deborah yates, about this. She also shares her concerns. I probably will hear from her today during her report, but we had the superintendent marisol rosales on and they gave a presentation and it was pretty. It was worrisome the amount of uncertainty of what's going to happen with the school year. Manhattan bro president gail brewer was right, along with all the chairs and the community with equal concern, so I think going forward. I mean the presentation as much as I feel that they could they answered questions they had to leave the meeting early. So we didn't get to answer or ask all that we wanted Manhattan bro president gail brewer shared our concerns, and so I've talked to athena about getting together another meeting with marisol and she agreed to do it. So I think that's going to happen, and I it's going to happen sooner than later, especially with the quote. Unquote start of school approaching so with that was a very important conversation that we had at vero board and it was evident. A lot of concern was shared around Manhattan, so we also continued the protect your block program. We've been doing that ever since the beginning of the summer. So we are one of the official sponsors of the protect your brock program and the good neighbor policy. So since we last talked play, streets or open streets started happening, maybe about two saturdays ago and there I think the last one will be this saturday. It might re-renew for a couple saturdays in september, but the play streets are 1 15 between adam clayton powell and frederick douglas boulevard, 151st and 152nd at mccoon's place and 127th between adam clayton powell and frederick douglas boulevard. So at those play streets, several organizations are sponsoring activities for young people, so there's been double dutch competitions, step competitions because some of the divine nine and greek organizations have taken part. I believe fcbc has played a great part in this and is sponsoring one of the play streets along with senator brian benjamin's office and street corner resources. So and a lot of hosts of other organizations, including larry blackman, has been one of the sponsors as well. So if you are able to come out and help out with any social distancing efforts on those streets or with those young people, you're encouraged to do so, especially this saturday from 12 to six and when any of those locations. So please get out and do that. Finally, I've talked to- and I brought this up last time- that a lot of the chairs or all of the chairs in Manhattan we do get together, occasionally and talk, and so we've been talking about what we all can do as united boards in Manhattan to one come together address a lot of concerns that are going on social injustice. How do we fit the criminal justice system? Economics, small businesses? All these things are our conversations that we're talking about so this past week we were talking about again implicit bias and rolling that out for the community boards, so implicit bias, training that should be done by the borough president. I believe she's agreed to do it for the boards, but then we might have to have. We were he'll, be able to maybe have a session with our community. It's not as impactful when you have such a large group, but we want it just to start that conversation. So you know it's important, especially at a time like this to look inside and and explore our own biases and how those manifest. So we want to be able to do that, but secondly, there is an ongoing conversation about the next step and what that might be plus for 30 bucks for boards to come together so I'll, be on a call tomorrow to discuss that and then I will hopefully, in september, be able to come back to the exec board with a proposal that all the boards will be involved in a project coming up soon. So I hope to be able to talk to you about that in september. I believe. That's all I have for now we'll move on to joshua clinton with the treasures report hi good evening. My name is joshua clennan, I'm the charger of community board 10.. The chair asked me to do a recap from the previous fiscal year. So I'll start off with that, we'll basic, just like basic breakdown of our budget from last year and going into our new budget for this year and some of the things that we we've all spent money on so far. So when I took over as treasurer in february, we had a operating budget of 23, 000 385 and a city council budget of 33 914 dollars that was shortly before the pandemic set loose. So we came together and decided that since we weren't able to have the events that we that we had anticipated on having throughout the summer, we would use our remaining budget to basically purchase things in advance for the upcoming fiscal year. Under the you know, knowing that we might not have the same budget, because we actually ended up expending our entire budget for the previous year, but we are able to get some additional funds allocated to our budget after we let a staff member go. If you all recall that so some of the things that we spent money on during this pandemic was a live streaming camera to basically assist our office in live streaming, events etc and having and making sure that our meetings can be you know, distributed across social media. We also purchase an external hard drive to help the staff work remotely. So that way they can store documents that they may need on the external hard drive and still be able to access them remotely from home, an air purifier for the office for safety, when the staff does return to the office to work and then also when they. If constituents return to the office instead of us, so that you know, we make sure that we have some sort of ventilation in there. We also purchased some link switch switches, wireless routers to basically make sure that the stack was equipped with better high-speed internet service so that they can, you know, perform their work in a more efficient manner. We also purchased 250 face masks, 250 poly scout bags, 250 book bags, replacement filters, polo, shirts and hoodie shirts. A lot of these were we purchased with the intention of giving away, in terms of a back to school, fair that where the education committee is working on. So a lot of those book bags and masks will be a part of that event. So please I'm sure our education committee chair will share more on that. So, at the end of it all, we ended up spending that entire 23 000 budget less three thousand dollars. We ran out of ideas pretty much. We weren't able to use the city council's budget because pretty much it's only so it was only available for leasing for events or for technology upgrades. So we weren't really able to utilize that budget. The way that we would have liked to so going into our new fiscal year, which began July, as you can all imagine, due to the city's financial constraints, we took a massive cut in terms of our budget. We do not have the city council budget that we usually would have at 42 dollars that has been wiped out. We also don't have the same operating budget that we typically would have of around forty thousand dollars. So this year, our operating budget is twenty thousand one hundred dollars. In addition to that, we have a five thousand dollar budget from the council, which is allocated solely for land use, preservation advocacy. Then we also have an additional one thousand dollar budget, which is set aside for urban planning or tech assistance. So, due to these financial constraints, as you, if you can recall from the previous meeting, I presented a budget. Basically, a budget request form for committee chairs and board members to complete in case they need to. You know, need money for an event or some sort of advocacy or technical or professional expertise that they need to procure, so that way that we can better track our spending and make sure that the limited funds that we do have available is distributed evenly across all the committees. In addition to that, we do have a personnel budget which is been allocated as of this year, 225 000. So, unlike other boards who may be having issues where they have to lay off staff, we are actually in a unique position where we have funds available to hire additional staff to support our two staff members that are currently in place. So we'll be looking to do that. I'm sure the personal chair will have an update about that soon, I'm working with shatek and also stephanie palmer around that issue in terms of our expenses for this current year. So far, we've we procured constant contact to do our email blast that was 546 dollars. Aside from that, I'm not aware of any other expenses that we made in this new budget is that I correct you are there was no more expenses right, okay and then addition to that we have our typical operating expenses, our lease payments- and you know wi-fi phone service for the office and also the rent is paid up through august right and that lease payment is a thousand dollars. So does anybody have any questions about the budget last year this year or the budget request form tingling or numbness in your lips? Tell your doctor if you have a parasitic infection and don't change yourself, your asthma treatments, including steroids, without talking to your big now or forever hold your feet. Okay. So if that's all I'll, let you keep going into the district manager report. Thank you all. Thanks, joshua, let's let me say really quickly. You know, I'm excited that you did this report and that's why I really wanted you to do this report because I think it's important for the board members to hear the difference of amount of money we had last year and what we have this year. So we must be very intentional about the things that we do a lot of the things we're going to be doing remotely. So you know that's going to cut down on the cost, but you know it's important for us to even reevaluate our partnerships that we have with different agencies so that we can, if we do decide to do something that we'll be able to maximize that potential and not spend a lot of money on those things because joshua, I think committee chairs are used to having the 1500 per committee, but that will be something that will have to change that this year. Is that correct, okay, yeah? So that's definitely correct seriously. Thanks for making those points, the fifteen hundred dollars that was normally allocated to each committee is just not going to be possible this year, so we're definitely encouraging committees to plan in advance and to get your request in as early as possible, because there may not be enough funds to go around for everybody to do the events that we normally would like to throughout the year. So definitely careful planning in advance is going to be essential. It's really going to be on a first come first serve, but we're also going to be very cognizant that we're not we're not allowing one or two or three committees to eat up the entire budget. So you also want to be very efficient in your planning and making sure that you know you're getting the best deal, you're very you're, being very, I would say, very vigilant and how you spend the money and plan them and plan the event. Getting sponsors for your event will be very key if you want to really have something big this year, and you know any other aid partnering with agencies and trying to you know, utilize and leverage their resources to assist would definitely be a key aspect. Thank you. Shatik. Oh karen has a question karen, yes hi everybody. I just think that we should have a system in place whereby we can check with other stairs before the budget is before their budget. Budgeted amount is taken away and that there'd be some collaboration between committees as if their budgets are going to be affected. So karen yeah that's a great idea, so I think it's important for the committees to collaborate. I think we've tried to do that in the past, but you know with the fact that we were not given that much money, but we were not giving the same amount of money. I think it's important, for we have to collaborate. Josh. Do you have anything to add to that yeah? I definitely think collaboration will be great. So that way, you know we have a lot of committees that sort of intersect with each other like land use and housing and landmarks and preservation. So I definitely think collaboration would be a good way to limit expenses for everybody and to make sure that all the committees are being active and getting a piece of on the budget this year. So I think that's a great idea and should definitely be encouraged. Thank you. Shatik, hey everyone, jatik mitchell, here, district manager, community board 10.. I just want to follow up on. You know the budget talk everybody was talking about because we're I'm still working remotely and we're not in the office. I know that our budget has been constrained up to this point, but on the on the other side is because we're not actually in the office every day, there's going to be less spending, I'm in the office. You know we used to keep the office supplied. You know with napkins and tissues food items even buying, like simple things like far as water, for our meetings- and you know just normal stuff supplies and paper. You know just for our office, so a lot of that money as long as we're still out of the office will not be be spent. So that's a good thing. We're not you know we're just spending, basically on our monthly bills that we have. You know our internet, our copying machine lease and things like that. At this point we haven't had a plan to move back into the office because we're still waiting on dcas to let us know on when it's feasible. I spoke with gail brewer yesterday and latino more that their whole staff is still I'm working remotely. So generally, we follow the lead of what the umbro president, you know, but the book president office advises us and they haven't. As far as I know, all of the community boards are still working remote. So once we go back to the office, I definitely will you know, put it out to social media to our e-blast. So you know everyone to know that we're back in the office, so I just want to just give a quick update on some of the things that you know. I've been doing in the communities you know in last month. So earlier this month I met with the staff of the children's aid society. They just opened up their headquarters on 124th street. The address is 117th west 124, west 124th street and their headquarters takes up four floors. It's on the third fourth fifth and sixth floor, and they have all type of programs there, mostly for their administration, they're, employing 230 employees at that site. They said that they have moved 417 jobs because they were all at different locations at one point and they've also hired 17 new staff, and they also have an office. That's opened up 135th street, it's actually right across the street from the 30. I'm second present, so you know I met with them. They discussed some of the issues on one of the issues that they said that they had concern concerns about the nonprofits that were serving the harlem community and with the current economic state, and what's going on with Covid-19, they were just wondering how you know: they're good, because they've been around for a long time, but then there's other nonprofits that doesn't you know the legacy that they do and they were just wondering how would be able to survive this covert because those non-profits you know I've been as a collective they've, been version of the community in our district. They spoke about the uptick and intakes that they had and foster care, which was a big issue. Also. They spoke about the concerns on prevalence of domestic violence. I mean children are with families and I know that's something. That's come up and our committees were on public safety, but I just wanted to you know: let everyone know that their headquarters has moved to 124th street and children's aid. Society has been, you know, a trusted partner in the past and they'll continue to be in the future. Just a quick update on the power outages from khan edison. Earlier on this month. We had bad terrible. You know thunderstorms according to khan edison, that was the second largest storm-related outage in the company's history. I'm only behind on hurricane sandy, roughly they said a hundred thousand customers in new york city were affected. Luckily, I only got one constituent complaint in our district from not having I'm a power outage. When I checked with con edison, they said that our district was pretty much good. They didn't see any on big issues in our district and I definitely wasn't receiving any calls. So I assumed that everyone was a good other than that. I saw a lot of down foliage and trees in the parks. Like st nicholas. I know there was big trees and saint nicholas that fell on the playground. There were also big trees that fell in jackie robinson park. Since then, they've been cut down, and I've heard that, though the tree scraps have been turned into mulch. So hopefully, you know with the parks department they'll better, be able to get the equipment back in shape, for the kids also took a tour at esplanade gardens as part promised, because their representation, mr jack leopard, and also mj, I believe, she's, the association president. They invited us after they came to our transportation meeting because they had a concern about the city bike placement on at esplanade gardens and the main objection to the bikes being at this location is that they were concerned that emergency vehicles, including ems, fdny and NYPD, also accessorized, and would have issues coming up onto the sidewalk in case of emergency. So we went out there we took pictures. I gave someone, you know my feedback. We also wanted to know you know if you don't put the racks here. Where would you want them to be put and they said that they want them across the street? They also said around the corner. We took all of those pictures and we I emailed them to the department of transportation. They said they would look into it and give back to us I'm interesting enough people from esplanade gardens. They weren't well the people I spoke with. They said that they would not be opposed to if the bike racks were actually on the street, which was something which was a first. You know hearing it from community members because, most of the time we're always complaining about lack of parking. So I was surprised that they said that they would rather have it on the street as opposed to their sidewalk. Next. One of the growing concerns that we've had was that sanitation in our area we've been getting a lot of complaints that you know it's been dirty garbage isn't being collected and for those who don't know in June the city cut 106 million dollars from the sanitation department's budget. I mean it reduced the pickup for little bastics litter baskets by I'm 60 percent. So in an effort to come back that you've had community members such as joe, linda ruth cogan, she represents the doris brooks park association. Also barbara askins from the 125th street bid. I'm also know a fella randolph park, gregory baggett, you know our community members have come out with initiatives to help clean up harlem and everyone's been chipping in and doing their part, because if you know we don't have the budget we're not just going to sit around and the job not get done. So I just want to thank everybody. Who's been out there. I know, I think I think gregory and a fella randolph does this every tuesday morning or something like that, but just want to thank everybody in the community for coming together. You know to help keep harlem clean another issue that as well a long issue that you know has been going on since I've been on the board. The bus stops in front of psa six. We've had many meetings with them, they've come to the district service cabinet and they promised to move the NYPD promised to take their cars out of the bus, stop and stop blocking the fire hydrants and it just got to a fever pitch. You know over these last two years that a news reporter asked the mayor during a Covid-19 19 briefing, hey, you know, what's going on with these cars and harlem and on that same day the mayor reached out to NYPD and also reached out to the mta and the very next day after that, you know miraculously the cars will move so just want to thank the community members. Also for speaking up about that, because as much as we've spoken, it was like we were leaving it up to the police, the kind of police themselves and they weren't doing the job. But once the mayor's office got involved and it became this big thing bigger than harlem, I guess because it was on new york, one news: everyone reacted and the good news is now that the NYPD vehicles are no longer blocking the bus stops. So I urge anyone if you see a car there, just please report it. We want to make sure that we stay on top of it so that it doesn't get back to the way it was previously. And lastly, I just wanna mention that yesterday, myself joshua clinton from the board deneen brown blackman from cb10 other community members. We met with gail brewer's office, athena moore at 130, 130th, street and malcolm x, boulevard, and the purpose was we were reaching out to all of the small businesses. We were giving out, PPE masks hand sanitizers and we work. We walk from 130th street all the way down. 116Th street, you know going door-to-door speaking with the small businesses and it was good to see on the borough president out there, and you know just the business owners were able to tell her firsthand some of the troubles and issues that they were experiencing. Everything from department of building, liens and summons that people received to you know they weren't able to get a loan or they were able to get a loan or compliance issues with social distance. And so it was good that she was able to take that tour. And I just want to thank everybody who came out and it was. You know it was very informative for me to walk the neighborhood and speak to the people, so that about does it for my report. Unless anyone has any other questions. Okay, thank you, cecily! You can go. Thank you. Thank you for that report. Karen, you have a question. Yes, I just wanted to ask what is the status of post office boxes in 2v10 and also what is the status of our polling sites? So I'm not exactly sure. I know that I had talked to athena about that and we were going to have a bigger conversation. Do you have any information off hand? No, I hadn't received anything, no notice about that. There's also one other thing I forgot to mention. I just wanted to say it. So while we were on 124th street and linux avenue, obviously gail brewer, she got a chance to see firsthand all of the crowds that are mass on that corner, 124th 325th street, and she said that you know she would recommend that we actually set up a meeting with son of with some of the facilities on the treatment facilities. I know that we've done it before, but it was mostly around preventing mount sinai from you know from bringing their facility to 124th street banana they're already there. I think that we have to engage them and have another meeting, because we've been getting so much complaints from the constituents that live on the block, and you also have the school on the corner and there's like oh, they seem it's an open drug market, a lot of drug use and there's a it's a lot going on linux, boulevard and 125th street, so something that we gonna have to look into with our public safety committee as well and then have that meeting with them, as well as the 28th president. I'd just like to ask: can we look into? Can we get the information on the status of post office boxes in our area? Is there any? Is there any specific question that you have? Are we missing any they're saying have any boxes been removed? Yes, oh yeah or sorting machines, okay, yeah! I definitely can get you that information miss ori, that's no problem! Okay. Can we check to find out what our polling site statuses our whole sites being moved, or can we get make sure that information is asked the thing yes I'll get I'll get all of that information. Thank you. Thank you. Shatik all right are there any other questions? Okay, yes williams, and I want to ask about children, a society which is the address to it on 124th and 135th. I know he said the one on 135th is the cross from the 32nd precinct, but do they have an address to the building on each one of them from 124.? My son attended children's society when he was in third grade and they was in the school that he was in up in the Bronx. I didn't know they had came to Manhattan yeah. So it's actually not the program, it's the administrative offices, so the ministry is it the office from 22nd street and park avenue? Yes, so that's okay, 17 west 124th street, so it's not a place where they, where the kids go and engage and have activities. This is strictly administrative buildings. Oh okay, all right! That's what I wanted to know, because you know my son been in that program, he's still and be involved, he's 26, but he still be with them. Sometimes you know they have different programs, but that's what I just wanted to know was it for you know, programs or was it just the office building? Thank you yeah, but they have everybody. You know all collectively there. So it's like a one-stop shop now, okay, once again this at 117 west 124th street, and if you need any contact information, I'll put my email in it to chat, and you can email me and I'll get you whatever information that you need. Okay, thank you. No problem can, do you have a question. I still see your hand up. Oh no, I don't! Okay, I don't thank you. Okay, so we're gonna go ahead and move to attendance in quorum, so kevin. Could you do that? Please yep so don't mind everyone I'll call everyone's names and if you could verbally announce your presence, that would be greatly appreciated. We'll start at the top of the list, with sister harris here, marquis harrison. President, charles powell, president, here kevin bitterman, here, stephanie palmer here, janine brown, bachmann, janine, okay, moving on to lisa downing lisa downing, I'm moving on to dr hazel dukes here. Thank you. Sorry did you skip me? Oh josh you're not on this list, but I'm going to get you joshua klein, I'm here. I'm glad to hear that going back. Let's see here, deborah gilliard president. Thank you, george herrera george harrell. Moving on to karen and ori president charles johnston, president and chanel washington. Chanel. Are you with us today she's excused? Okay, thank you. Joshua mclennan wasn't on the list, but I've added him as present. Did I miss anyone else or anyone who is representing one of the chairs that is currently absent from one of the committees hi karen dixon vice chair land uses present hi karen. Thank you. Anyone else with that said. We appear to have a quorum chair. Thank you. Thank you, kevin okay, we're going to go ahead and move to our standing committee and task force. Reports I don't know was- is deborah on yeah. Oh sorry, deborah yates, okay, yes, both deborahs are here awesome and hopefully both divers will give a report. I know that the senior task force is not on here, but they had a great meeting. So if I'll give you a second to prepare, never gilliard, but I do want you to say a few words about it right. I will thank you so we're going to first move with deborah yates our chair of education, using libraries good evening. Everyone we had our monthly committee meeting last night. We had a great discussion regarding back to school. We had the chairs of cec-3 and cec-5, who gave us some insight on what's going on with parents and their concerns in our community. Our own marquis harrison who our first vice chair, gave us some really good information, because he is, he teaches in our schools here in harlem, as well as being an active member of the united federation of teachers, union and so out of that meeting came that we would lend our voices to the voices that are out there already around letters to the mayor and the governor regarding the status or lack thereof of preparedness for our students to go back to school. So I did marquis sent me some initiatives that the union is pushing forward and I put together a draft of a letter to him and, as we discussed last night and was recommended by charles powell, this will be a working document. Cis lee. Thank you so much for sending me the two letters from our borough president, which I think will be very helpful in us finishing our letter that we're going to add there is a meeting tomorrow night face is having a meeting around school openings. I just put the link in the chat so that, if anyone wants to register to hear the latest on, what's going on in school, openings with you know, outdoor learning and all of that you can find that on that meeting tomorrow night. Secondly, around the back to school event at the end of the board year, I did work with shatik metro, because there was a lot of discussion around there not being as much money. This four years there were was last slash I wish to take so that we ordered book bags and enough materials for 200 to give to 200 students. So we are in the middle of planning an event so that we will give these 200 book bags out. I have reached hope, I'm trying to arrange it, so they won't cost us anything since it would be grab and go. I have spoken to an organization about paying for folding tables and they seem to be willing, as long as they can put their name on the flyer. Aisha seku is going to partner with us and she has book bags she's going to. Let me know how many she has I reached out to nikola evans hendrix who's, the president of harlem park, the park, which, of course is a conglomerate of businesses here in harlem, and she has told me that she has reached. I asked her to re if she had any businesses that would be interested in participating, and she has responded that she does have businesses that are very interested in participating, so we're in the process of sort of working that out as well so we're hoping to have. I would love to give out sort of like 500 book bags, but we'll see we're going to give out as many as we're going to give out I've. Also gotten there will be I've got 500 thermometers donated that will be given out as well as two laptops to be raffled off. So it's going to be a grab and go event. You know social distances. I also talked to shatek about getting. I know he spoke that that isaiah from the mayor's office has access to mass. So I did ask him to try to get 500 masks, or so we can give those out as well. So those are sort of that's sort of the quick down and dirty report from the education committee. Thank you deborah. What was the date of the grab and go event again? Oh, there is no date. It's going to happen within the next couple of weeks. I just have to solidify it with my committee, yeah stephanie. You know who you are. Thank you deborah. I see a hand karen, you have a question. Yes, hi deborah I'd just like to ask. I heard that the DOE is relying on parents to take their children's temperatures before they come into school. Has that been discussed because there are facilities that are taking the temperatures on site as opposed to relying on the parents? What we're saying is that all of that should have been in the school are agreeing with the uft and marquis. If you want to you, can chime in that there should be a nurse in each school that can handle these kinds of things when the school year opens marquis yeah, I'm sorry, I didn't miss karen's question. That's why her question was she had heard that parents are being asked to take their own children's temperature before they come to school? I think they're being asked to take their temperature as a precaution, as in don't send students who have who might be sick. That has nothing to do with necessary the in-house procedures that will still take place, it's more about, like don't, send sick children to school. So I think they're asking parents to take initiatives and making sure that your child, if they have a high temperature they shouldn't be sent to school from, but they still will have temperatures taken. I think their goals, at least that's the goal right thanks marquis. Does that answer your question? Karen, yes and I had another question: what will be the procedure for the isolation room? I'll, be the person? Oh sorry go on marcy, so those are all things. It's everything is a work in progress. So, like the procedures are that, if a student is, I guess, identified as someone who might be sick or so on and so forth, there's supposed to be a room: that's there where they're supposed to be individual, an individual in the building which could be an administrator and or most likely administrator, because no uft member would probably be the one and then the school nurse is going to be disper, dispatched to that room. Where I'm told that the school nurse will suit up and some you know, extra ppp equip you know and have all the appropriate things to take the temperature and make an evaluation, yeah and evaluate the student. And if the student is sick, they will I mean they will contact the parents, obviously and so on and so forth, but they will be staying in that location. At that point to, then, though, I think is determining what happens with then they're going to begin contact tracing for who did that student interact with if they you know, if they're deemed to possibly have been exposed, you know they could be sick with a stomachache, not necessarily it could be anything. But at that point then they're gonna start the contact tracing students are not gonna be moving around and the built are not supposed to be moving around in school buildings which make it extremely hard. You know for high school students who have individualized programs right, they'll be contained to a room. So thank you. Thank you. Yes, thanks marquise are there any other questions? Okay, we're going to move on to health with dr hazel dukes reporting on nursing homes. Can you hear me now? Yes, ma'am? Okay, thank you very much shatek and I have had several conversations because we did not get an immediate response back from the harlem nursing home and finally, we did receive a call. Shatek received a call from keith wright who works for a firm that represents harlem nursing home yesterday. He did reach out to me to tell me that the nursing home wanted advisory board to consist of more than 10 no more than 10 people, and I asked why did they limit it to 10? He didn't have an answer and I said to him. Our proposal would show that we need more than 10 people, because we wanted community input that have been a the deltas have been working there for years and we wanted the community board to have the majority of the members because we wanted to be the watchdog. He then called me back and said: well, you know they really wanted 10, but if I was for the 12, they would look at it and they had people that they wanted. On the senior vp of 11.99 the senior director of the kennedy center, mrs wilma brown, he said kendall reed, who is a community person, lived at river bend and himself was on there. So I said to him to give me that in writing and when we have our meeting on september the third week in september, we would get back to them. With our recommendations. Yesterday I went to meet to do the walk with the borough president, dr smith, and I was at 120th street, which was the first email that we received from that. And of course, we looked at the sanitation at how dirty the streets was, and then I don't know whether dr smith is on or not, but for the program that they're doing the three women at mount morris park that is doing fresh vegetables and for their community. I think that we do have to get back and I've spoken to bob or asking the streets are filthy, while we have outdoor dining, even at 120th street, that area with the sewer smell, because the drainage have not been cleaned. Those are health hazard. So when we meet back in september for our first meeting, those issues will be on our agenda and how we can continue to assist in our community of being a part of seeing that we're that these areas are clean and especially with the drainage system. Last night we had a minor storm here and we had sewers running over on fifth avenue because they have not been cleaning because the garbage there. So we will be back to you in the executive committee for september and have our proposal ready to present at the executive committee and then on to the german board on holland nursing home. Thank you, dr dukes. Are there any questions for the health committee or dr dukes? Okay, thank you. We're going to move on to housing with the chair of housing, charles powell, who's also the second vice chair of the board talking about requests for support from linux court hdfc, oh hi, good evening everyone, so I can see from the screen that there are a number of shareholders from linux course hdfc. I want to point out, as I also see that you know latoya henry is on the call. I have been communicating with latoya and emphasized to her that this is our executive committee meeting tonight, so we will not be a kind of like recap of what we shoutique mitchell and I had an opportunity to address when we met with your task force. So I just wanted to emphasize that my objective today, when I put this item on the agenda, was to respond to something that had actually reconfirming had been communicated to our community board back in december of 2019 and that had to do with some concern by this hdfc as to some mandated changes to their certificate of incorporation. It's my understanding. That is not something that we need to discuss this evening since the board, I believe, has taken a position on it, and so what miss henry has indicated is there's a desire. You know for our board one. I wanted to make sure that they met the representatives of the hdfc, so I certainly will take the opportunity to introduce miss henry, but that there would be some willingness on behalf of our board. Just be of you know, partnership and assistance to this hdfc, which I'm committed to recommending from the housing committee and also from the full board. So I don't think we need to go into the details about what that support would be. As dr dukes just indicated, we are resuming housing committee back in you know in september. I certainly want to make sure that this is on the agenda for the housing committee in september and we will continue to address whatever concerns or issues that this particular hdfc may have and certainly would be prepared to fulfill a commitment I made in that meeting with the task force and that is to assist in outreach to you know, elected officials. So I'm just going to fatigue if you can just unmute miss henry so to see if she has anything to say very briefly- and you know because I know that this is a tight agenda for today. So you know it's a pleasure to introduce the you know the person who is in charge of the board of directors of that significant hdfc, I think others. You know people like vern ballard and you know- and I know I have two friends on here from that hdfc. You know who have told me not to introduce them so latoya, you have anything to say well first. I just want to thank you and thank all the members of the executive committee for giving us an opportunity to really share the challenge that we are we're facing and putting us on your agenda. I am a member of a task force that was created to address the certificate of incorporation, changes that were proposed and then adopted by by HPD. We do have a member of our board here and we do have other shareholders who are on that task force. I think it's something. That's not just about lennox court hdfc, it's something that will affect all hdfcs. To be honest, and I look forward to being on the you know as being on that agenda in september. It's really important because the rights of hdfcs as corporations are being impacted by certain clauses within that certificate of incorporation, so from the non-propaganda clause to the the non-shareholder majorities on board for infractions. So I thank you again for the opportunity to to have us join the call and to and to be on the agenda. So thank you, latoya. I do want to point out something latoya indicated. As the board knows, it's significant for us to have partnerships with other community boards. I want to acknowledge that community board 9 April tyler, has been very proactive in addressing this issue. I agree with miss henry that it is a broader issue than just linux court and that's why we have to take it up, but as we do with our executive, you know committee, we don't try to have you know, committee meetings in our executive committee meetings, so I'm thankful that the members of the and shareholders of the linux court hcfc can appreciate that we will be very intentional. You know- and I don't see donna gill on this call. You know the vice chair of housing and donna and veron. You know this and gregory. You know this used to be with danny tyson and we had a hdfc subcommittee and it's something that I believe that we really should chair harris should reconsider. You know bringing back because it is quite significant times. Hdfcs are kind of left out of you know the conversations and left out of the discussions, and they are you know with you know without question. One of the most significant you know group of residents within our community because they're homeowners and we have been promoting home ownership and really you know real permanency, and so I'm going to commit latoya and vern, and you know and others you know to really reprise that subcommittee, you know- and maybe we can start with some of you, because we can certainly utilize outside people, as we've done. Gregory baggett will always be in the conversation for anything regarding hdfc's and we welcome you know those thoughts. So I just want to thank all of you for you know coming out tonight and madam chair, that's really our report. Thank you, charles. Are there any questions I see karen? Do you have a question? Yes, I'd like to know if the housing committee can address the j-51 tax abatement and what other buildings are affected by that, in addition to lennox terrorists, I you know karen. I would. I would ask that I'm not. You know completely understanding. You know the you know the question, but at the same time you know, as I stated earlier limited report this evening and welcome you know we'll I'll. Look at that question, but certainly welcome the opportunity for us to address that in our housing committee meeting in september to clarify what karen is talking about. There was a lawsuit against lennox terrorist by by residents and former residents of lenox terrace, because lennox service was basically destabilizing regulated apartments. The courts found that, because lennox terrorists had been receiving j-51 tax abatements, they were not legally allowed to destabilize those apartments. So residents who formerly live there is supposed to be receiving compensation and current residents who had their rents increased, are going to be see receiving, like you know, hundreds of dollars in reductions in their rent, and it's like people were talking about when this came out- that it's very likely that a lot of this is a situation for a lot of buildings, because pretty much every building that undergoes capital improvements in the city ends up applying for j-51 abatement and a lot of them. You know they receive these abatements, but they don't do anything in terms of making sure that they're not destabilizing these departments, because there's two ways that you can disable our department luxury decontrol, which is raising the cost of the rent above two thousand dollars and there's also the vacant CD control, which is, if you just evict the tenant, then you can destabilize the apartment and make it mark it right. So that court decision saying that, if you're receiving j51 subsidies you cannot use either luxury or vacancy decontrol is really huge and needs to be investigated thoroughly. So josh, I understood the question. Maybe I misstated it. I just didn't unders in a context in which that was being addressed with respect to what we were talking about in terms of hcfcs, and there was an article published to all board members regarding that decision on that lawsuit and karen now that I better understand it, we'll definitely make sure that we put that on the you know, agenda for further discussion. As joshua said regarding our september meeting just a point of clarification, the folks in the class they will not be their rent. Will their rent will be not going down because that has already happened a couple years ago for that for that class, what they will be doing is getting a receiving compensation for the period of time when the apartment they were. There was deregulated and they paid rent for that. So some people are getting like twenty five hundred dollars. Some people might get five thousand. I know one person who got like ten thousand dollars, but it's not a lowering of rent. That was already done well. Thank you. I just would like to know what other buildings in our developments in cb10 are affected, and I think that same situation came up with devoid park a few years ago. All of the buildings in linux terrace were not affected by this, because all of the buildings didn't come out of j51. At the same time, there were actually two buildings: 25 west and 45 west, who were in j51 at the time that they, when they would d state when at the time they started doing the destabilization after the big you know, lawsuit with the stuyvesant town after that decision, so some of them came out of some of them came out of j51 after, like I think, 2186, 4470 and 10, I think they came out in 2010, but the those who came out of j51 before the action happened are the ones that are affected. Thank you, dassania, josh, and karen and cam. We can follow up on that to find out what other buildings might be affected in our area. Okay, are there any thanks? Are there any other questions for charles and housing? I would just like to add that we'll be talking about the matter in the land use committee as well. Thank you, lisa, okay, speaking of land use you're up next, do you have anything you want to add up for this meeting? I know karen is on also no we're gearing up for the fall. We had a good meeting. I think a couple days ago with HPD and we have a couple of land use items on the docket for september and probably October that we'll be voting on so I'll. Just ask my committee and guests to sharpen their skills and look forward to the upcoming projects that we'll be voting on, because europe's are starting certification. This month and they'll be going start starting to go before land use committees in the fall. That's it I think, keeping it light. Thank you, lisa. Okay, we're gonna, go ahead and move on to oh, I see a hand here, gregory gergie ragged. Do you have a question yeah? I have a comment. I just wanted to alert the land use committee and the ec in general. I don't know if you've read the article where the mayor has said that that the that the europe applications will be directed at communities that are greatly affected by Covid-19, and so I'm anticipating a lot of rapid development beyond, what's already going on in the district as a justification for creating jobs and other things of that nature, so community planning and thinking about how to find enforceable community benefits will be very important in this sort of coast. Prove it covered period. That's a good point and thank you for mentioning and charles you and I need to reconnect with city college to help us with thinking about the type of community planning that you and I discussed, and I think in our last meeting we talked about resources. I believe it was josh who mentioned that there would be resources available for that type of planning right now, there's pretty much a bottleneck at HPD just trying to get some of these projects out the gate. But you are correct gregory. We can anticipate a lot of development, continued development in harlem, particularly around supportive and affordable housing. That being said, one of the goals of the land use committee for the fall is to really have people come to the table, experts from HPD, hdc and other agencies to really educate and inform us on the development process. I'm very passionate about the community board, really understanding the development process and the benefits that they bring like jobs for our community and to really raise the profile of development in our area. Thank you. Thank you, lisa and gregory. Thank you for your comment. We're going to go ahead and move on to parks and recreation which is chaired by karen orry, hello, everyone. I just wanted to have a couple of things I just wanted to. Let everyone know that today I represented at the unveiling of the women's suffrage monument which was unveiled on literary walk today it was a beautiful ceremony and it was aired on good morning America and the today show. So I believe we have the link for that. If anyone is interested in seeing it, but we did support that project with two resolutions, so it was very fascinating to see it come to fruition. We also met with seneca village at our last meeting in august and they're, discussing the making of the exhibit as permanent and they're going to come back to us, hopefully in the september, to explain what their findings are. For that we there's still an opportunity to accept to submit opinions on the brownfield repurposing at 280, west 155th street, and also for the vision 2020 plan. We are still able to submit recommendations for that project as well. Colonel young park playground is expected to move forward for the renovation of the ball field, to upgrade it to a multi-purpose ball field, allowing youth in our area to have more options in terms of sports, so that has been about five or six years now or since that project has been in the works. So we're very happy about that moving along, and we should expect parks to to come in and explain that project to us at our next meeting and we'll also be. Our committee will also be working on a survey for those suggestions and recommendation submissions to the brownfield repurposing and the 2020 harlem river waterfall. So and we have made a lot of progress with the exonerated five project, there was a walkthrough that was done coordinated by terry wisdom and I believe chanel was on that walk, stephanie, palmer, terry wisdom, as I said, organized it and, mr salam, so they went or did a walk through to look at possible sites for any monument or commemoration that would go into the park in honor of the exonerated five. We are currently working on a statement of projects and goals to be submitted to the mayor's office and central park, conservancy and new york city parks. So we're hoping to get that done. We have had input from sarah burns on that and she is committed to using her move documentary, the central part 5 as an educational component to the commemoration so moving right along with that on september 3rd, I have I'm scheduled to present to see the 11 for a letter of support or resolution in support of the project in central park, and we've been talking with the other surrounding boards as well. So that's where we are with the exonerated five project. Last month, at the executive committee meeting we talked about the clemson university urban resiliency graduate program, so we had some questions we did discuss. We had a presentation from professor where the galvin were them and she explained what exactly they would be offering to us and in terms of recommendations for our area during this pandemic. So they often just set up a community-based design guideline for deploying techniques within the neighborhood to address the the pandemic situation and they offered to study three specific parts to to work on. They are not asking for any funding, but they are asking for social capital of all participants, and I did ask for elaboration on the term social capital, and I was told that it's just getting just the information that would be needed from the participants so that they would be able to contact people and people would be able to put with attend meetings that were being held. I also checked with adele bartlett about that language. She didn't see who was the general counsel at the president's office and she said she saw. She thought that the document they sent over to us was fine. She didn't have any issue with it. So I'd like to ask the committee to vote on going forward with this project. Gregory baggett would be one of the parts which is hl, randolph square, and then we would select two others so just like we had, we didn't have quorum at our last meeting, but the consensus was to move this forward to the ec, and I believe that is the end of my report. Karen, can you just restate the name of the university again? Was it clemens university? Clemson? Sorry, yes in south carolina and if we do go agree to go along with this state would assign graduate students as early as this month. So this would be a project that the graduate students would work on and it's again, it's tactical urbanism and were the graduate students in like land use urban planning. What was the program they're in urban resiliency and they would be dealing with our with our parks. Thank you. You're welcome, okay. So karen thank you for that report. Thank you for all your work on the exonerated 5 project. I see terry on here. Thank you for all of your work and starting those walks that were really important, chanel washington, the whole committee. I know: when do you have an upcoming meeting? Is it just going to be the next parks meeting for the exonerated five project, or is it there a separate meeting for that would be a separate meeting as it stands right now. I just have to make sure I have to look at the agenda and what we have, what we have availability on september's agenda. Okay, so karen you do karen did, as part of her report put forth a item to be voted on by the executive committee. Oh I see terry, did you have a comment really quickly? Yes, I actually had a question because I just wasn't. I thank you so much and the exonerated five situation we're moving along. We did two walks. There was also a exhibit in the central park zoo and I went to that and it's also a women's exhibit on stem and they it's a very interesting one as well, but I had a question I didn't exactly understand, though I was in the meeting what the the school from north carolina was actually going to do or execute, so I just had that to get better understanding before we do the home. So thank you. Thank you, terry, so yeah. That was my next thing, so she put that forward to be voted on. I think karen. So could you explain maybe a little bit better what the intent of the program is and then what are they going to do with that information? Are they doing a dissertation? Is it a project and how will that come back to again help parliament help our community? Okay, in terms of the reporting, any public academic publication would be done by dr wortham galvin, the professor of the program, and she says that she would do it at a free, perhaps present the information at a conference to convey best practices and or she would do a paper which would be a case study example, and she would only do it after the project is completed and if we feel comfortable with her enjoying it- and she would have talked with us about it. So that's the in terms of publication. What they would be doing is assessing our area and probably doing cigarettes where they would engage the community and discussions about what they see. Problems are in the area and then they would begin to talk about how to address those problems. For instance, if we have issues with social gathering, I'm sorry social, distancing, people not wearing protective masks and that sort of thing how we could address that issue through signage or just a low-tech mechanisms for dealing with these issues during the pandemic. I hope I answered your question. Yes also. Let me see, I think, there's something in the chat, but so with this as well. I know this school clemson. This is the clemson we're talking about pretty big school. Why did specifically when I was in the meeting? I can't remember what she said, but why specifically did they want to study central harlem, as opposed to anywhere in south or north carolina or somewhere closer? Some of those are other urban areas. Well, I attended a the congress for new urbanism, which was a workshop at a I'm, not a workshop. It was a symposium over four days and that program talks about they do presentations on best practices across the country around the world in terms of urban issues. So, as a result of my attending that works, that conference, rather, I was introduced to dr fordham galvin and I thought her work was very interesting and I thought we could benefit from it here in our community, okay and before I open it up to other people, just one last question. So if we were to agree to this, is there a contract that we would sign? What is our responsibility in it? And then is it like? What is the agreement? Well, I forwarded to you the synopsis that doctor fordham galvin sent to me, and that would be as far as I know the extent of it. You know just that agreement and, as I said, I asked adele bartlett to take a look at it. She said she didn't see any issues. Okay, all right, so I see some other questions, stephanie palmer, gregory, bragging and then terry stephanie. Can you unmute yourself hold on okay? There you go karen. Is it possible for us to get something? In writing? I heard you mentioned that there was a synopsis because we get something that basically lists the goals and objectives in terms of what our role and responsibility would be and what their role of responsibility would be and also a timeline. Is that possible? Yes, I think basically, we have all of that. We do not have a timeline, so I can ask before to include a timeline in this statement. I would love to see. I'm sorry. I would really like to see something like that before being able to vote on it. Can you make the letter available for on screen, because otherwise we would have to wait a month? Well, wait a minute how long that project who's that who said that I'm starting here so karen we wouldn't have to wait a month if you want to publish it now I mean you know. Our first meeting is next month, not next month next week september next wednesday. So if you wanted to give people a chance- and we can circulate this to the entire board and then we can just do it at the general body meeting next month next week next week, next wednesday. Okay, so would you like for me to ask the professor if you would like to come back and present? Oh the next board meeting, so we have to see: let's circulate this around. Let's shati. Can you circulate this to the board now or on the entire board tonight, or either first thing tomorrow morning and then ask them for any kind of feedback, because I don't how long her presentation wasn't that long? It was maybe five minutes in your meeting. It wasn't very too long. No, it was. It was extensive, it wasn't five minutes, it was maybe like 20 30 minutes. Oh okay, yeah, that's a little too long. I think that's too long. So what we can do is I could ask her to shorten it. You know: has this letter and they're able to either even develop questions in advance? You can send them to me and I can forward them to her. If you have other questions, but you know no one has. I think people need to take a look at this letter. First, I people do need to take a look at the letter, so there's definitely on readiness now, so we will go ahead and put that in a packet, because I think you sent me the nacto streets for pandemic recovery and response the overarching document. So I read that and the letter, then they can get the letter from dr galvin worthengalvin and then let's circulate that for the entire board tomorrow and then have a discussion, and if there is still on readiness at the board meeting, we it'll have to go back to committee, but let's do due diligence and get out the information now to the board, so they can formulate questions. I'm sending out the letter from clemson. Yes, all right. Do you have the natto streets for pandemic response and recovery document as well? Karen you sent that one to me. I believe so, but I can send it again. I said I probably did because I sent it to sicily. Well, I it's right in front of me now I haven't pulled up so I'll, send it to shatik right now, so, okay I'll, send that over to you and you can supply the board with that. Okay- and I just wanted to say that the former commissioner, I believe transportation margaret or is it margaret forgione- is working with nafta, which is a national program and kevin asked me was the meeting recorded? Yes, it was. It was the our august 12th meeting yeah. It was last this month this month, yeah, okay, so we'll circulate that and we'll just table that to next week, gregory or terry. Did you have anything to say before we moved on well, I did want to just simply support first of all thank karen for bringing this important resource to the community and to the community board to consider- and I just wanted to just give you maybe some context about how these resources will benefit parks in our community. As you know, we have severe budget cuts. There are no seasonal employees in the parks department, this fiscal year and the entire visioning agency. The vision and visioning department is now closed. So there are no planning entities available to green spaces in the city and most of the city's resources, particularly in harlem, are being diverted to the historic parks, so the smaller triangles squares and the green spaces are basically neglected. This resource will bring increased capital to a group like ours, where we don't have to rely on volunteer help solely volunteer hope to do the work that we are doing, and so this is urgently needed if we can get five graduate students with various levels of expertise and planning in technology, in design to donate their time and resources to help us put together the kind of plan that the agency needs in order to move our capital projects forward. This is just something that we desperately need. Thank you gregory. I think you made it very. You explained that a lot more clearly than I did. Thank you for that. Thank you, gregory and did terry. Did you want to wrap this conversation up right now? Yeah! Yes, thank you gregory, because that clarifies it a little more because I guess because they're in the carolinas- and you know I guess they would come here and probably since it's national, they travel around the country and do studies, but I just feel that in this environment and in our community, I'm always concerned like as people are coming, what is what are they going to report? You know and not that people can't come and learn, but you know to really gain insight because the way I understood it was that not so much that they would be helping and cleaning and organizing. But you know questioning people and turning out some paperwork and some of what I heard and I have to read everything, but I just don't want our community to be like guinea pigs for anybody, and I just use that in quotes that may sound harsh. But in this time of all the disparities that are going on racial economic, you know people coming in that you know are going to learn on our community, and you know I heard some language where the people were saying. Oh, you know we were able to relate to the community. You know which is really saying these are people that are removed. So I to me personally, I would like to really read understand there are you know and, like you said, if they're gonna help to clear and clean and plan and organize, but I'm you know just think that there are many people who are in tune and in touch, and maybe the resources are not there but who are in tune and in touch with our community to get some comprehensive thing going, but I would have to read it and the way you explained it, but I'm just concerned in terms of what reports are going to go, whether out about us with people who may not have the sensitivities and understanding. So that's just a concern for me and as community board, we have to be to watch people to protect ourselves and our community because we're not apart from our community. We are the community and we have a lot of intelligent people in our community that are capable well terry. I just like to clear up some misunderstandings that you just yeah and that's why I'm speaking I needed yes and I just want to say they're not coming to clean up. They are urban designers, they're, studying to be urban designers, so they will develop urban design plans. As gregory explained, they do not travel here. They will become working with us remotely by a zoom or some other remote program, so they will not be coming here and they are doing this work, while their students in their term in their school term, so their school term is just at the beginning now. So that's why if we get them engaged now, we could benefit from what they have to offer, but no, they do not come out and clean the streets and not hands-on. In that respect, they will not be traveling here. They will be working with us remotely so remotely they will be looking assessing interviewing people and developing a project. That's what I'm trying to do? Hey everybody! Can we can we move on with the agenda until they send out the more complete information right, sorry to read up on it, and then you know from that we can. We can ask more appointed questions. Well, I just like to just just finish my point, and that is that you know that they won't be coming here. Physically they'll just be remote, and I had another point, but I went out of my head, so you know people would like them to move on. That's fine! Thank you karen! Thank you, terry. These are ollie really. These are all really good questions and that's why it's important for us to get those documents out. So I did send that to shatek he'll send those on to you all and we will have he'll give you time to read that and review it before we make any decisions, but thank you karen and gregory, and the team. Okay, we're gonna, move. Okay, we're gonna, move on to transportation, so really quickly. We did have a meeting. I think satieg addressed a lot of the things that went on in transportation. Again the open streets are going on. They will with the open dining that does in October. We did hear from a couple of restaurants about that and how it's going for them. So we tied in transportation with echo dev and a couple of those restaurants did come to echo dev as well, so you know they said it is going well for them, but they are suffering right now. A lot of businesses are suffering and you know teetering on the edge of not being here soon. So we want to support while we can and keep that in mind about our small businesses and what's going on with open streets, also public safety very quickly, I was able to step in for charles johnson. We did address some of the issues that are going on 124th street, so we will circle back, and that means bringing in our health committee and dr dukes and starting those conversations that we had before about how to clean those streets and dealing with those facilities that are there. We've talked about wraparound services, we talked about what are the next steps? So it's that time again to reiterate these conversations and figure out how we can all work together in conjunction with NYPD homeless services, to really make a difference. So that was the conversation there. We also talked about the uptick in gun, violence and what we as a community can do- and we just talked about some of the factors around that and how do we address that? You know without a complete plan, because it seems like you're just addressing the you know the manifestation of it, but not the cause and the symptoms and then you're reducing the symptoms, but not the real cause. So we talked about that in public safety, so I'll be sure to follow up with charles and we will bring the 124th street and the harlem coalition back to talk about the issues there at the next public safety meeting to be joined by the 2-8 and the 382 at that time. Moving on we're going to move to senior task force for a quick recap of their wonderful meeting. Yes, sir. Thank you cecily. So our meeting was august 19th when we had a guest speaker about president gail, brewer and gail has always been a defender and a champion for senior issues. So they were budget cuts from the city council for discretionary funds for the senior service initiatives, and there was also a 12 decrease in program cuts. So gail, along with the other board presidents, came together in a virtual press conference to condemn the cuts, so the senior centers has been closed since mid-march, and the department of aging is working with the centers to create a new normal for our future. So most of them have online programs. Art fitness sewing quilting. They even have a single senior programs, which is good, so we are going to work with the bell president to provide additional tablets for seniors. So we have a lot of work to do with the tremendous cut city and state all across the board, and we have to make sure that our most precious population, our seniors, are not neglected and they have a voice in this city. So that's my report and I also spoke to miss nixon. I speak to her weekly she's doing fine. Her birthday is next month september, 9th and she's going to be a hundred years old. So that's my report. Thank you deborah. You did inform us about that, so we wanted to get out. I think we're going to be able to get a card out to miss nixon yeah, so she's always supported us and showed up no matter what two meetings two journal board meetings, everything so yeah. We definitely want to support her. You know and show her some love yeah. So we'll get that out to her. I believe there was a question in the chat from lisa about the residents complaining about small businesses, slash restaurants, playing music and the noise. What are we doing to achieve a balance between the residents and the restaurants in this area? So we are trying. I think we when I talked to chanel about what she's doing. I know we had talked about this very briefly, but we wanted to look at city complaints to see if there were any and she's doing that and looking to see what restaurants have complaints or violations. When she looked it there wasn't there weren't there weren't any. So I don't know, if that's to say, if people are just not complaining up here or don't know how to report it or you know what the deal is, but there's not a lot of complaints up here, although you just look around and you walk through the streets you're like wow, it's pretty loud over here, so I see that I see it, but right now, there's right now, there's no official, three one complaints shattered. Have you seen or heard any official 311 complaints? I missed. I missed the thing you said before that we're talking about the open streets, open restaurants and the loud music. There are some neighborhoods in Manhattan that are really experiencing issues with complaints, but for our area, have you heard a lot of complaints from constituents about the loud music and noise? Here I haven't heard any issues about the complaints, but I had issues from the small business owners because they were actually getting pop-up inspections and I reached out to the department of health because they're trying to do it the best way they can and inspectors have come by from fdny department of health as well as DOT to make sure that their barriers are up and also that they're maintaining social distance, and so the small business owners have been having a tough. You know tough time. You know to get things up and running, so they just don't. You know they want to be in compliance. They want to make sure they're doing the right thing, but they're just trying to work with the agencies to get it right. So that's the only issues that I've had from them so far. Okay, I know that a lot of the businesses have had to kind of redo their open patio structures, one because they were just one too many people kind of congregating there and it was unsafe structures. So a couple of them had to redo those, but I haven't heard any real noise complaints. Okay, are there any questions at all at this time about that or the senior task force report? This is this is terry wisdom. I don't know about the noise complaints, but I know that there have been complaints about them. Having gathering too many people, no social distancing, no mass, like you know, I think that there's been more complaints about that than the noise because of just the general safety of the community, because those people that want to gather and be like that can go and infect other people. So I think to me that was a major concern in some of the complaints that I came across. You know in specific areas where there were just too many people gathering and since harlem is leading in the whole state in the 62 counties for death and infection. I think we have to be extra stringent here, because it's about life and death. So it's my opinion. Thank you, terry. Thank you for that, and you are right. We do have to be very certain and very vigilant. Let me see, I think that is it echo dev chanel was not here. However, there was one restaurant ruby's vintage that came for renewal and that will go to general board just for a vote there. I don't think there was anything else for echo dev all right. Are there any questions about that? No hi, this is annette williams. Can I say something the fish and chip place called the lighthouse on 1, 31st and 1 32nd and 8th avenue. They don't practice social distance. The line people be so close together on the line and they'd be so crowded inside the place. You know when I walk past here to go to the supermarket and they're, not practicing social distance. They don't have half of them, don't have math on, and I mean this pandemic is not a joke. This corona virus is not a joke, it's a deadly thing and I feel that someone needs to go over on that side. I don't know if y'all work on that side with community board, but they really need to be informed. How to do social distances, be the part and that that particular fish restaurant is actually in our district, I'm from I'm familiar with it. I would say to you if you do see that the contact on 311 and make the complaint, because department of health does come out, issue citations and summons to the establishment for now every day, not one day, it's right every day, and if and you see it, if it happened every day, you should be making a 3-1 call every day. Okay, all right. Okay, they play music all night where my father live at he's a senior he's 90 years old. You know, and it's like ridiculous, they playing music from the afternoon for the evening and late evening time. You know you can't even sleep so and then he has dementia. So you know the noise is like bothering him. Thank you. Miss williams, and you should definitely call 311 if you do see something though, but thank you for telling us. Thank you. Thank you. Kevin did you have a comment just for the notes? Cecilia shetty. Could you repeat the name of the restaurant? That's up for sla, the lighthouse, oh ruby, sorry yeah! That was the I'm sorry guys! Thank you. Yeah ruby's vintage is up for an sla license. Yes, renewal, not new renewal. Thank you. Okay, all right we're going to move on to old business. Is there any old business hearing them we're gonna move to new business? Is there any new business? I do have one thing: we will be participating in harlem holiday lights this year, so we're just waiting to hear what that might look like, not sure, but we will be participating this year. So I know that's gonna. I have something to I just wanted to say. We should end this in this new year, this new fiscal year. We should try to get a head start on our district needs statement and our request for the city's next budget. It's and it's, I know it's boring and we don't really want to do it, but we should review our requests from last year. I went through most of them and a lot of them were turned down just because they weren't applicable. So we should really take a good look at that and see how we can rephrase- or you know, really change his request so that we can get that you know have an actual chance of getting these items funded, especially in the next fiscal year, where it's going to be really a dog fight in terms of fighting for fun, and so we really want to get a head start on that. Okay, josh! So thank you so much for taking that due diligence and going ahead and reading ahead on those things. So I'm going to put you in charge of doing that this year. So thank you. Thank you for volunteering. For that love it and shauti. So we're going to work with josh shattuck me. I don't know if kevin's free to do it this year, but and charles powell was a team before but josh. Thank you for taking the lead on that and josh can be the representative from the education committee thanks josh everybody's, throwing it on your back brother, another like dumb, okay, great project, great projects. We gonna work this out. Thank you. Karen did you have a quick question? Yes, can that information be made available to the chairs which, which things were approved which were not approved. You have the report right, aaron that karen talking yes yeah, I can't hear but like the for the report to the can send the chairs. The only thing is the report is so it's like hundreds of pages it's hard to share via email. What we, what shatique would have to do was send everybody the link, and then we can tell you what pages is actually all related to cb10, because it's like a thousand page document, so you can't really send it via email. You can't do a data search because we've done this in the past years in the past and then I always get the district needs statement done. So I always have that information, and you know we had. It was specific to- I don't know planning's website and then and then you can go through it from their website. Yeah karen yeah. I've done it before. That's the way to do it, because I mean why should we have to go through a thousand listings? It's pretty fast. You just kind of do a find in a search yeah. We can show you what pages to start from so like we tell you start from page 552 and you just click the page number you want to go to and then you can just scroll down from there. Okay. But how was it done in the past because we didn't have to do all of that? It was made available to us we didn't have to as chairs we had. You know the information was just. It was concise. We didn't have to do that and is there someone who can I mean last year we didn't have to go through that shitty we had. The information was made available to it. Yeah I sent out a link with our district name. It's still. It's still like a few of a lot of people, but yeah. I don't recall a link. I can check my records, but I don't. I didn't have to go through a link karen we'll work with you to get it so you'll get it we'll figure it out: okay, good any and I'm spencer kevin yeah. I just I can't remember if you mentioned it at the top. I think there was an email about committee assignments that went out. I did not mention it, but it did go out, so everyone be sure to check your email check your spam. Let me know if you have any questions or concerns about I've heard from a bunch of you all already so again. Thank you for all for checking that and making sure that you're on at least two committees and when you look at the september calendar, that's where the committee meetings fall so just make sure you can't attend those right now, we'll virtual probably be virtual to the end of the year, not sure when we're coming back to pert to in-person meetings, but just make sure that you can attend those because attendance is really important. So karen did you have a question about the community? Oh no, okay! I just see your hand up all right, but thank you. Okay, thanks kevin for reminding me, but if you do have any questions for me about that feel free to email me about those committee assignments: okay, any other announcements. Okay, I will entertain emotion. Oh sorry, I have I have an announcement. I know that I think the date is september 20th, but I know we have our african-american day parade. That's coming up. That is going to be virtual, so I think whatever we can do to support it, I'll be helping them with some promotions, and I think they already have some things up on their site, so they're looking forward to it and obviously harlem league virtual, was great. I wanted to find out since we have talked about it in terms of what's happening with restaurants, and you know in our area with noise or social distancing, is it possible for the community board to reach out, because I thought I heard shatik or somebody talk about going and talking to them or having meetings because number one if they are really doing stuff, you got to do 3-1-1 and then they'll get the message. But you know just in the spirit of community they're in our community, we should be able to talk. Yes, they are going to get random pop-ups, because that's what the city does the liquor authorities and all of them that's what they do. But I think it would be good if we had some position paper or just talking to people so that they're, adhering and knowing about being safe and then also, I don't know if this falls under parks, but I mean at 145th and and lennox avenue where they have that free thing. For the wrecker I mean they had like 500 people out there. Nobody had mask on no social distancing and that's a park in an organization that does that, and I just thought like wow. This is crazy. You know, so I don't know who controls that, but it's beyond the restaurants, because it's different parks and different activities that people are having. So I don't know if there's a some kind of letter or walkthrough or whatever we could do to talk to people, because if they really are doing stuff, they are going to get hit and they could potentially lose their liquor license, which I don't think or get some huge fines which I don't think they want. So that, and you know, we don't want that to happen to them either and then. Lastly, I know that I think that you're writing a letter to the board of ed people or something based on positions, but I didn't even know if there could be an overall position, because I was on the zoom that they had with congressman espionage and mark levine and al taylor was on it and some people from the board of ed and the districts, and everyone is just saying that they don't really see that the school should open and there was a doctor on there and this as a health. So I don't know if that's an overall position of all the committees as these letters go out, and that was just it. Thank you. Thank you. Terry. I mean we're going to work with. I know deborah is working with her contacts, cc5 and cdc3 to write the letter, but she's also going to circulate it with the board and our committees marquis. I don't know if you have anything else on that for now, yeah deborah's gonna work with we're working with I mean the statement will be a representation of the board, so you know with the chairs. You know, because we're all collaborating on this. I think it's very simple and I think at some point we were talking about deborah had mentioned, like the she has the checklist. That was it's not necessarily like our. I don't want anyone to think it was talking points of the uft. It is just a very clear health. It was a health guided list from the north, well general, in the CDC of a list of clear things that should be in every school and things that need to be checked off before we believe that we actually go back and currently the DOE just doesn't have the money to really provide all those services they're. Just now going with walkthroughs, you know and they're we're finding out. So many schools are not even equipped with basic things, so it just doesn't seem feasible at this point. Okay, deborah, are you dude? Did you have anything? No, I didn't have anything to add. I just want you to know. I am still here, I'm listening and you know marquis is correct. I did send him a draft. We're gonna work, I'm gonna, I don't know if you sent him those two letters from gail brewer, if not I'll forward them to him right now, I'm getting a presentable draft marquis and I work on getting a presentable draft to the exact board so that we can make sure that when the letter goes out, it's in one voice from the board. Okay, I'm sending him to. I thought I copied him, but let me just check but I'll, send it I'm not sure. Okay I'll, do it now. Okay- and you know just one last thing, according to what you're saying terry to answer your question about the large events, so one of the things that we've been trying to do is be proactive. If we can find out about the events, we usually try to tell the mayor's office or the world presence office, not that they can really maybe do so many things to stop the event but to provide PPE for the event. So we've been trying to find organizers. If we hear something about something coming up a large event, we try to hook up an elected official who can kind of sponsor the PPE for that. So thank you for bringing our attention to that, but it helps if we can hear about them before they happen, but thank you for that. I just want to reiterate it. I just want to reiterate once again that there is that face meeting tomorrow that will be discussing school reopenings I did read. I just put the link in the chat again. If you want to register, they will be talking about all things regarding the upcoming school year, so you might get some maybe have some additional questions, but you also may get some questions answered. Thank you. Thank you all right. So at this time I think that was our last questions at this time. I will entertain a motion to adjourn. It's been moved and properly seconded that we adjourn all in favor aye opposed hearing. Now we are adjourned at 8 28 p.m. So, thank you so much and we'll see you next wednesday at 6. 00 p.m. Good night, right here, right here, night, good night,.",
        "summary": "We're going to start with my report, so I have continued to stay busy, And I'm, so glad to see that so many people are making it to the meetings and that the board as a whole has stayed active.\nManhattan bro president gail brewer was right, along with all the chairs and the community, with equal, concern, so I think going forward.\nIf you are able to come out and help out with any social distancing efforts on those streets or with those young people, you're encouraged to do so, especially this saturday, from 12 to six and when any of those locations.\nWe came together and decided that since we weren't able to have the events that we that we had anticipated on having throughout the summer, we would use our remaining budget to basically purchase things in advance for the upcoming fiscal year.\nYou all recall that so some of the things that we spent money on during this pandemic was a live streaming camera to basically assist our office in live streaming, events etc and having and making sure that our meetings can be you know, distributed across social media.\nSo that way they can store documents that they may need on the external hard drive and still be able to access them remotely from home, an air purifier for the office for safety, when the staff does return to the office to work and If constituents return to the office instead of us, so that you know, we make sure that we have some sort of ventilation in there.\nBasically, a budget request form for committee chairs and board members to complete in case they need to.\nAside from that, I'm, not aware of any other expenses that we made in this new budget You know wi-fi phone service for the office and also the rent is paid up through august right and that lease payment is a thousand dollars.\nYou, know, I'm excited that you did this report That's why I really wanted you to do this report, because I think it's important for the board members to hear the difference of amount of money we had last year and what we have this year.\nYou know that's going to cut down on the cost, but You know it's important for us to even reevaluate our partnerships that we have with different agencies so that we can, if we do decide to do something that we'll be able to maximize that potential and not spend a lot of money on those things, because joshua, I think committee chairs are used to having the 1500 per committee.\nYou know we have a lot of committees that sort of intersect with each other like land use and housing and landmarks and preservation.\nYou know the budget talk I'm still working remotely and we're not in the office.\nSecond present, so They discussed some of the issues on one of the issues that they said that they had concern concerns about the nonprofits that were serving the harlem community and with the current economic state, and what's going on with Covid-19, they were just wondering how you know: they're good, because they've been around for a long time, but then there's other nonprofits that doesn't you know the legacy that they do They were just wondering how would be able to survive this covert because those non-profits you know I've, been as a collective they've, been version of the community in our district.\nThat's come up and our committees were on public safety, but I just wanted to you know , let everyone know that their headquarters has moved to 124th street and children's aid.\nYou know our community members have come out with initiatives to help clean up harlem and everyone's been chipping in and doing their part, because if you know we don't have the budget, we're not just going to sit around and the job not get done.\nI, know, I, think I, think gregory and a fella randolph does this every tuesday morning or something like that, but just want to thank everybody in the community for coming together.\n116Th street, you know going door-to-door speaking with the small businesses and it was good to see on the borough president out, there, And, you know just the business owners were able to tell her firsthand some of the troubles and issues that they were experiencing.\nEverything from department of building, liens and summons that people received to you know they weren't able to get a loan or they were able to get a loan or compliance issues with social distance.\nShe got a chance to see firsthand all of the crowds that are mass on that corner, 124th 325th street, and she said that you know she would recommend that we actually set up a meeting with son of with some of the facilities on the treatment.\nOh, they seem it's an open drug market, a lot of drug use Street, So, something that we gonna have to look into with our public safety committee as well, and then have that meeting with them, as well as the 28th president.\nIt's like a one-stop shop, now, okay, Once again this at 117, west 124th street, and if you need any contact, information, I'll put my email in it to chat, and you can email me We're going to go ahead and move to our standing committee and task force.\nThank, you so much for sending me the two letters from our borough president, which I think will be very helpful in us finishing our letter that we're going to add there is a meeting tomorrow night face is having a meeting around school.\nIf anyone wants to register to hear the latest on, what's going on in school, openings with you know, outdoor learning, and all of that, you can find that on that meeting tomorrow, night.\nSecondly, around the back to school event at the end of the board, year, I did work with shatik metro, because there was a lot of discussion around there, not being as much money.\nIf you want to you, can chime in that there should be a nurse in each school that can handle these kinds of things when the school year opens marquis Why her question was she had heard that parents are being asked to take their own children's temperature before they come to school?\nYou know for high school students who have individualized programs Okay, we're going to move on to health with dr hazel dukes reporting on nursing, homes.\nWe looked at the sanitation at how dirty the streets, was, and then I, don't know whether dr smith is on or not, but for the program that they're doing the three women at mount morris park, that is doing fresh vegetables and for their community.\nTalking about requests for support from linux court hdfc, I have been communicating with latoya and emphasized to her that this is our executive committee meeting tonight.\nI certainly want to make sure that this is on the agenda for the housing committee in september We will continue to address whatever concerns or issues that this particular hdfc may have and certainly would be prepared to fulfill a commitment I made in that meeting with the task force and that is to assist in outreach to you, know, elected officials.\nYou know people like vern ballard I just want to thank you and thank all the members of the executive committee for giving us an opportunity to really share the challenge that we are we're facing and putting us on your agenda.\nYou know we'll Look at that question, but certainly welcome the opportunity for us to address that in our housing committee meeting in september to clarify what karen is talking.\nTheir rent will be not going down because that has already happened a couple years ago for that, for that class, So, some people are getting like twenty five hundred dollars.\nI just would like to know what other buildings in our developments in cb10 are affected, and I think that same situation came up with devoid park a few years, ago.\nI. Don't know if you've read the article where the mayor has said that that the that the europe applications will be directed at communities that are greatly affected by Covid-19, and so I'm, anticipating a lot of rapid development beyond, what's already going on in the district as a justification for creating jobs and other things of that nature.\nSo I'd like to ask the committee to vote on going forward with this project.\nIf you wanted to give people a chance- Can, you circulate this to the board now or on the entire board, tonight, or either first thing tomorrow morning Has this letter and they're able to either even develop questions in advance?\nProbably, since it's national, they travel around the country and do studies, but I just feel that in this environment and in our community, I'm always concerned like as people are coming, what is what are they going to report?\nYou know questioning people and turning out some paperwork and some of what I heard And I have to read: everything, But I, just don't want our community to be like guinea pigs for anybody, and I just use that in quotes that may sound harsh.\nSo I to me, personally, I would like to really read understand there are you know, And, like you said, if they're gonna help to clear and clean and plan and organize, but I'm, you know just think that there are many people who are in tune and in touch, and maybe the resources are not there, but who are in tune and in touch with our community to get some comprehensive thing going, but I would have to read it and the way you explained it, but I'm just concerned in terms of what reports are going to go, whether out about us with people who may not have the sensitivities and understanding.\nWe did address some of the issues that are going on 124th street, so we will circle back, and that means bringing in our health committee and dr dukes and starting those conversations that we had before about how to clean those streets and dealing with those facilities that are there.\nIf people are just not complaining up here or don't know how to report, it I missed the thing you said before that we're talking about the open, streets, open restaurants and the loud music.\nHaving gathering too many people, no social distancing, no mass, like you, know, I, think that there's been more complaints about that than the noise because of just the general safety of the community, because those people that want to gather and be like that can go and infect other people.\nI, don't know if y'all work on that side with community board, but they really need to be informed.\nThey are going to get random pop-ups, because that's what the city does the liquor authorities and all of them But I, think it would be good if we had some position paper or just talking to people so that they're, adhering and knowing about being safe But I mean at 145th and and lennox avenue, where they have that free thing.\nI know deborah, is working with her contacts, cc5 and cdc3 to write the letter, but she's also going to circulate it with the board and our committees."
    }
}