{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCIlZuhawe3QWwxbglYpZMmg",
            "title": "MCB4 October 2020 Waterfront",
            "publishDate": "2020-10-14",
            "shortDescription": "Thursday,\\nOctober 8, 2020\\n6:30p.m.\\n\\nAGENDA\\n \\n1. Presentation/Vote: Hudson River Park Trust to present on Chelsea Waterside Park Phase 2 \\n \\n2. Discussion/Vote: Balsley Park: Need of Attention and Maintenance \\n \\n3. Committee Discussion/Vote: Statement of District Needs and Budget Requests for Fiscal Year 2022 \\n\\n4. Old/New BusinessThursday,\\nOctober 8, 2020\\n6:30p.m.\\n\\nAGENDA\\n \\n1. Presentation/Vote: Hudson River Park Trust to present on Chelsea Waterside Park Phase 2 \\n \\n2. Discussion/Vote: Balsley Park: Need of Attention and Maintenance \\n \\n3. Committee Discussion/Vote: Statement of District Needs and Budget Requests for Fiscal Year 2022 \\n\\n4. Old/New Business",
            "lengthSeconds": "2:12:44"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "-LbL_JblWKA",
            "fillerWordCount": {
                "uh": 211,
                "um": 418
            },
            "readTimeFullTranscript": "77 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "park": 126,
                "pigeons": 31,
                "tree": 30,
                "dog": 29,
                "design": 23,
                "bit": 21,
                "maintenance": 21,
                "space": 21,
                "trees": 19,
                "field": 19
            },
            "wordCountSummary": {
                "park": 32,
                "granite": 6,
                "trees": 5,
                "dog": 5,
                "street": 5,
                "walls": 5,
                "water": 4,
                "play": 4,
                "picnic": 4,
                "entrance": 4
            },
            "fullTranscript": "For the time I had to spend on it today, but will never see me in a pair of crocs sorry about that Jim. If everybody could rename themself to have their name be there, you can toggle your mouse over your picture and click the three dots and then click rename or you can click the participants button toggle it over your. Actually, you would not know who you are because you're not named yet so best to do it over your picture. We're going to give this one more minute and then get started. Marty you're here, powers back. We had a power outage, it happens, upstate, which is where I am. It's been out for 24 hours and it just came back. You need solar panels. Welcome back from the stone age. You know solar panel. I do we do need solar panels and that the issue with solar panels all over the place. There are issues there are trees around here. So it's not a full days of a day of sun and you got to figure out what you're going to do with the trees when you're when you're at Penn South. You want solar panels on the roofs, but you got to figure out what you do with standby power because we're not connected to the grid. So it it's a wonderful and important thing and there should be a hell of a lot more of it. But it's not always easy. I'm going to use that environmental discussion at the segway to officially call our community board 4's waterfront parks and Environment Committee meeting to order. As everybody knows, I think we've all been this before we are holding our meetings virtually in part and thanks to the governor's executive order, allowing for public meetings to take place this way in light of the Covid-19 pandemic. Here we are on zoom as usual, we'll be taking items that are on the agenda in the order they're presented this evening, there'll be a presentation on the topic. Questions will be questions and comments can come from the committee. We will then go to attendees the public for any questions or comments that they may have, and if the committee feels necessary there could be a letter and a motion and discussion on that to move things forward. Janine will be running the show tonight and I believe first on our agenda is updates around the Chelsea waterside park renovation, who is steering Kevin who's kicking us off on that we have our friends at the river park and their design team on this Aab or Abb. I'm sorry it was. I was a little unfocused there. Madeline is trying to get into the zoom and she's having trouble. Is she on the attendees, so maybe janine in the background, if you could, I do not know, send a link directly to her. I do not know, but I will start with this anyway and she can jump in when she can jump in so pleased to be back with the community board. We have the entire design team. Again. I think we last saw you in July. We had a pretty positive meeting, but we did have some comments and we said we'd be back to show you. You know our response to the to the comments and our progress on the design. I think you'll be happy with it. So with that, I think I'm just going to turn it over to Terry Berger from Abb she'll lead the landscape discussion and I think John from Cdr will be doing the architecture component for the comfort station and I'll jump in. If, if I feel like, there's a need to so Jerry, take it away. Okay, thank you. So I just need to say next and you'll advance the slides is that how we're doing it? Yes, thanks: okay, so okay! Next, please, okay, so good to be with you all again, just to catch you up on where we are in the process. You all can hear me fine, correct, okay, great, thank you! So, as Kevin said, we last met with you in July. Since that time we have been refining and doing some design development on the design, incorporating comments that we received from you, as well as comments that additional comments that we received from the trust. So here we are again at the community meeting and then following this meeting, we will take any additional comments and we're going to begin our construction document development. Next, please, okay, so just as a refresher of where we left off on July 9th. If you go to the this, was an outline of the most salient and critical comments that we received from you. So just quickly to touch on them was to use to more strategically use plantings to help discourage park users from creating desire lines and cut through paths on the central grain. The community requested additional bike parking. I believe we had shown some along 24th street, but you had asked for additional parking. You did not feel that the harvest table or the family style, long tables that we were showing in proposing for the picnic area worked and asked for us to reconsider that. You also asked that we had shown some tiered seating in the dog runs, and I think last time we had shown sort of three tiers for one of them and you felt that was too high. So you asked us to lower that, so you also asked us to so. We had proposed removing one of the trees that was located in an area of the expanded dog run, and we were doing that to accommodate the water play for the dogs in a more centralized location, and you asked us to reconsider that and take a look at preserving that tree. You also asked us to see if we could provide additional, photovoltaics and or other green energy solutions incorporated into particularly into the comfort station, but I believe it was just a general comment and asked us to take a look at no touch type of fixtures in the comfort station, as well as site locks into the restrooms. Also ask for us to consider what it would mean to the design to take into account our current situation, where social distancing is so important and then also asked us. Oh, I already mentioned the touchless appliances right next, please. So this was the plan that we presented in July and really what we're showing is, if you can see the red sort of circles and ellipses. Those are the areas that we had to really focus on in terms of incorporating your comments and looking at redesign and refinement next, so that included, the dog runs the picnic area, the entrance, the comfort station, some of the plantings and the synthetic turf field. I do not think we talked about that too much. I do not think you had any significant comments about that, but the trust did have a few comments for us, so we've really further refined that and developed that part of the design as well. Next and now this is we're going to get into the refined and updated plan next. Okay. So this is the overall plan you can see. I think the most significant difference that you see on the overall plan is really the entrance and we have enlargements for the various specific areas. So I think it'll be a bit easier to see as we get into the project. Just give you a second to take that in okay, next, okay, this really outlines this is a diagram of the circulation. You can see. We have that primary sort of curving path that gets us through the park and to the West side highway for those that are traversed want to traverse and get over to the riverfront portion of the park. You also see that we're maintaining circulation along the sidewalks, maintaining the circulation from 24th street into the park along the basketball area, the basketball courts- and you can also then see that we have the stills have the three entrances into the dog run. One of the big differences which we'll touch on a little bit later is that if you look at the comfort station, you see now that, as before, we're creating this new gateway into the into the sports field area, and although we had accessible access from to the sports field from the existing entrance, which is the entrance, that's a bit farther west, we have been able to add accessible access to the field from the new gateway or from the comfort station area next. So this is a 3d aerial that kind of gives you the overall lay of the land. You can see the entrance area from 11th. You start to start to see really what the spatial layout is here and how we've developed it. You get to see some of the thinking in terms of how we're going to be utilizing new trees, tree canopy to start to create and emphasize spaces I'd just like to chime in one of the things that we here at the trust really liked about this design is that we've really cut back on the hardscape in this in this design. So it's really more of a botanic experience, calming lush green experience, it's a park within itself and not just the past, which was really the a really a major goal in this project. But I also just like to point out: madeline did make it on zoom, so she's here too, okay, sorry, Terry! That's fine! No great! Go to the please! So, just to talk a little bit about lighting, we are continuing with the standard. That's throughout the park, which is the Riverside luminaire. We will be retrofitting all of the existing lights with led luminaires instead of the existing high pressure sodium. Likewise, with the sports field lights, those are to be retrofitted, with leds as well. We are adding some other accent, type lighting throughout the park, including Festoon lighting at the picnic area, and we are integrating various led Strip lighting in certain specific accent, areas which you'll see in the next plan. Please, so you start to get a sense of what the light distribution will be in the park you can see. There are some accent lights that are happening in the picnic area, we're using those led strips in the seat, walls that are around the picnic area as well as at the entrance, as well as the Festoon lighting in the picnic area in the dog run again, there's accent lighting in there we will be introducing some other lighting there to make sure that the light levels are appropriate for the dog run. We do know- and I think we mentioned this- the last time we talked to you- that we took existing light levels. So we know what we're working with as a base, and we know that has not been sufficient. So we will be bringing up the light levels so that they are more appropriate for the for the use, and then I think, when John talks about the comfort station, he can talk a little bit more about this, but obviously there'll be some Exterior lighting that happens in the comfort station to make sure that that's appropriately illuminated next. So this is just an overall plan indicating what the planting strategy was for us. We obviously were looking to preserve as many of the healthy existing mature trees as we could both within the park, as well as the street trees. Looking to bolster what buffer there was along. The west side highway in particular, looking to accentuate some of the landforms that we're creating and some of the existing landforms, particularly around the edges of the central lawn. So, on the east end of the lawn really looking to strategically use those plantings to help deter people from using these. The cut create the cut- through paths to provide seasonal, year- round seasonal interest and to really provide more ornamental plantings, particularly on the east entrance. Just keeping with that theme of having a really lush entrance into the park. The idea was to have low ornamental plantings to really kind of draw you into the park and then once you're in there you're kind of like in a room in itself and Terry spent a lot of time on them. Okay. Next, so this is our tree. Planting palette, we've selected trees based on the particulars of the site, the urban condition, the required aspect of the site, what we're trying to do in specific locations to provide a variety of seasonal interest. So just as an example, I can. I do not want to spend a lot of time on them, but I think it's worth noting that so just as an example, the the tree in the lower left hand corner commonly known as the golden rain tree, although that is not a native tree, it is an adapted tree and a lot of times. We try to stick with natives, but in this case this was a pretty important choice for us, because we felt that it was a really appropriate tree for providing buffer along the West side highway. This goes in an area that is sort of central in the park. Where there's going to be a seating area. You'll see it again. When the plans come up, it provides flowering interest in the spring and then in the fall you may have seen it provides these little papery seed enclosures, which are a really lovely like fall interest, and then they also have the added benefit of you know a light, breeze kind of creates this sort of fluttering and noise sort of aspect to them. So, in addition, there's a number of flowering, understory trees that we're looking to utilize throughout the park for interest and then also to give that second layer that second layer under some of the more mature trees. So we want to get them sort of in the vicinity of those larger, mature trees which we're trying to preserve the other tree. Maybe to make note of is the Gleditsia up in the left hand corner that's a tree that we've selected to use in the picnic area, and that is primarily because it's got a light, open, airy sort of head right canopy. That is not going to be really too oppressive in terms of like a heavy canopy, but it will provide a good amount of shade and filtered shade. So anyway, we thought those were. Those were good choices for that. So next, please and then a whole variety of of shrubs and ornamental grasses, again selected specifically for the site selected for seasonal interest in color, as well as for habitat, we will be including some evergreens. One of the things that I think is not on here, which we probably also will be including, is there's some existing taxes, Spicada Rapandans on the site, so we will probably be utilizing that again and maybe some other evergreens we wanted. We do want to make sure that we have a good structure of evergreens as well for the winter, but many of the deciduous plants that we have selected also have very interesting aspects to them for winter interest. Next again, these are. These are some of the perennials that we would be using next, and then this gives you a sense of the variety of the seasonal interest from January through December. There's going to always be something going on, that's the goal, and then obviously also the plant selections are. You know, we're all we've also considered maintenance. Regimens right, we're Hudson river park has traditionally done a great job with maintenance. However, you know all of these kinds of parks and open spaces. It's always a challenge with maintenance. So we really like to focus on not just with plants but all of the material selections we make to make sure that we're looking for low maintenance, that low plants and materials that require low maintenance, but are really getting the job done, that we need them to do next, so segwaying into other materials, as we talked about before, one of the primary goals of the project was to see what materials existed on site. The site has a lot of granite, which continues to be in very good condition and is certainly reusable for pavements and other things throughout. This identifies pavements that are existing, that we're looking to utilize to remove salvage, clean and reinstall in new locations next, so this starts to show you what we're looking at in terms of a paving pattern. This is an enlargement of the entrance, so we've got the item number one. At the top. There is the existing granite block papers, which we're looking to salvage, which are a light gray color thermal finish. There are some large slabs of pink granite throughout and we're looking to salvage those and cut those down into smaller sizes. Consistent with the rectangular blocks, and then we know we do not have quite enough material to satisfy all of the paving areas. So we would be supplementing augmenting these existing materials with new granite. So we're looking to introduce a darker color for that variety and where you can kind of see it in the rendering and the plan rendering. What we're looking to do is to utilize the lighter gray pavers as the center of the pathways through, and that the edges are a combination, kind of like a pixelated matrix at the edges of the new dark pavers and some of the light gray papers, as well as accents of the pink, which is the bottom image, starts to express how we're looking to use like these new pink papers or these repurposed pink papers as accents in the paving pattern. One of the nice things about doing this kind of random pattern also is that it is one of the easier kinds of paving patterns for someone to maintain, because there is not this finite precision to banding or other patterns. It lends itself to you know if a maintenance worker has to come in at some point and replace the paper fairly easy to do. It does not have to be that exact gray right there or that exact black right there. Next, okay, so just to touch on some of the features of the main entry. One of as I mentioned earlier, one of the comments was about bike racks. We have incorporated bike racks at the entry, so just left of the entry there. If you see number one, we also will be including signage at the entry and as you go into the entry as Kevin said, we're looking to do a very lush planting there we're introducing new flowering trees at the entrance, as well as really layered understory plantings below those trees. Once you enter in the pathway, your sight lines go straight, acrosss the park and you kind of start to get a hint of the tree grove at the picnic area and then in your mid ground you'll, also see the berm the planted berm, which is number five, six we're looking to use granite curbing throughout the park and then just to the left of the main entrance. You can see the space that we've allocated for the future vendor kiosk and then that number seven is indicating space allocated for a little bit of back of house for the vendor, as well as an area where you can continue a space for the community composting that it's currently happening and number four is. This: is the aligned seating along the Pathway Hey Terry? Can you can you tell the community board what the width is of the entrance there? The width is, I'm going to say it's a roughly 20 feet. Okay, taylor might be able to be a little bit more precise, it's about 12 at skinniest, okay, so I just mentioned that, because that's one thing that's different than before. We thought it was a little too wide open before and so now it's down to 12 feet, so it's 12 right at the narrowest taylor. But what opens up closer to 20? Yes, probably okay, next and so here's the conceptualization of what that space will look like in reality, the curves defining the entry edges there will be. You know, raised a bit we're looking at doing low fencing on top of those on top of those curves to help protect the planting. That's within them and as I was saying, you can look. If you look through into the Mid the Mid mid- ground there, you can start to see the plantings that are layered sort of behind on that berm adjacent to the picnic area. Okay, next and then this is the palette of furnishings over on the left, are loose tables and chairs that we envision being associated with the integrated custom bench which is adjacent to the vendor, kiosk those we could see being maintained and monitored by the vendor. The standard H Hrpt Bike rack, which is a ribbon rack, which has been used on other projects. The trash receptacle also used on other projects at Hrp, as I mentioned earlier, granite, curbs and then in the lower left are the existing benches, while the wood is not in great condition. On these benches, the supports and framework for the benches are all stainless steel and all still in really good shape, so we're looking at repurposing those with new wood. You know slight modification to the design of the benches by using different lengths and different spacing on the the wood slats next, just just so. The Community board knows that the movable furniture is. We definitely intend to do furniture very similar to this, but the specific model we're still working through with their maintenance people making sure, like the specific model, is totally maintainable and what we want to use so movable furniture where you see it, but maybe not necessarily that particular model just want to be sure. Okay and then this highlights the custom bench seating that we're proposing utilizing stainless steel for the supports and the arm rests. What this bench really starts to do is to create you know a variety of options for seating. We all know we like to go to parks and there's nothing better than having a variety of options for where to sit in the park, how to sit, how to utilize the space. So this bench provides a variety of those kinds of options so on the left side of the bench, you've got a more typical arm rest and then, as you, progress around the bench towards the west, the arm starts to become more of a small table, a place where you can have your lunch, a place where you can put your laptop. So you can do some work in the park. There are also spaced Sorry Mosquito attack over here. They are also spaced at a distance that would deter someone from laying on them, which is you know, an important way to help monitor usage in the park next, so the picnic area directly opposite the playground you've seen this before the layout has not really changed too much. The size has not changed too much. We've really just refined some of the details of it we're still looking to do sort of a threshold of granite, paving as you enter the space. The ground plane would be a stabilized gravel. The nice thing about that is, it's very gardenesque feeling it it's stabilized, though, with an organic material that helps it to be a little more cohesive and not like loose gravel, which can be kind of messy. But then again, this organic binder actually allows it to be permeable, so any water, any rain water coming through here is going to get straight down, which is a real benefit to the tree. Grove that's proposed. In addition, there's the festoon lighting, which we think is a really nice feature, include, and then it's enclosed by these stone walls, we're looking to utilize, reclaimed, stone from the existing park and then seating and then, in response to the community's comments about the harvest tables, we've looked at doing more integrated tables and chairs and you'll see. If you go to the you can start to see what those tables are like they're, very similar to what is the existing tables and chairs that are currently in the park. There is planting surrounding on the outside the stone walls and then the one thing I neglected to mention when we were at the at the plan is that we are making some minor modifications to the play area directly opposite, particularly to the entrance to accommodate stroller parking, and we are also planning to change that fence. At the same time, it is currently a channeling fence and we're looking at doing a more ornamental wire grid fence there. But in this image you start to see what the what the Festoon lighting would look like and how the space would feel just one quick thing that the trees are far along in this image, so the furniture that we're going to propose- and this is a recommendation from the Community board last time- is to provide some umbrellas for the furniture too. So, as the canopy develops, we can get some shade, so we will be doing that. It's just not shown in this rendering right next. So you get to see here are all of the materials which I've already mentioned. What we're, anticipating things like the stacked stone wall? To start to look like you can see what the stabilized gravel looks like it's actually a material, that's used elsewhere in the park, so you're probably already familiar with it or in Hudson River park overall, not in the existing park. Next, okay, the dog runs, so I do not think that the overall shape or size is any different than what we had shown you last time. We obviously have done quite a bit more development on it in order to maintain that existing tree, which previously we have proposed to be removed. If you see where number one is that dark round circle that you see in the middle of that tiered seating, that's where that tree lives, and so in the small dog run there. We are proposing to do the tiered seating around that dog run to help around sorry around that tree to help protect the tree and to provide. You know that elevated seating that we talked about previously, which gives you a really nice vantage over the entire dog, run in order to accommodate that we had to shift around some of where we were locating the granite walls, and so we have done that so that tiered seating now backs up against granite walls, which will be those repurposed granite walls. We also, I think otherwise, it's generally the same, if you see number four, the lower right of the small dog run. That's now the new location for the water play for this. For the small dog run area, we've added benches as well single six foot long freestanding benches, and I think otherwise, that's sort of this. Everything else is pretty similar in terms of those the small dog run. Most noticeable, obviously, is the graphic that we're that we're, showing on both the small and the DOT and the large dog run we're looking at utilizing the hrpt collars to create this really bold graphic on the asphalt paving. So this would all be color coat, sealed, which is a great surface. It's done elsewhere on other dog runs at Hudson River park. The entrance pavements, the Sally port type entrances, we still have the three entrances, those will be granite and then looking at the large dog run again number one. You see we still have the tiered seating. We've lowered that to the two tiers. There is still one larger mound, rather than multiple mounds, as exists. Now in the dog run, and then you can see number four is the new location of the water play area in the large dog run and again we're utilizing that stone wall as a backdrop to that to one help protect from water spray from moving out onto the sidewalk there, and it also gives us the benefit of being able to kind of stack up some of the granite blocks to utilize for other water features in that area. I may have missed something, so somebody else feel free to jump in there's a lot going on here. We are also providing storage cabinets. If you look up on the West side, just adjacent to where number six is number six, which is the Sally port entrance that comes in from the park, we have a couple cabinets there, we're looking to do stainless steel cabinets similar to what we've done on another project, one to house the water management system for the for the water play, as well as a storage cabinet from for maintenance equipment. Next, and then this just helps to show you what the clearances are between the some of the vertical elements. I think our narrowest clearance is the four foot nine there on the sort of the middle western edge there between that existing tree guard sorry existing tree and the new guard that we're putting around that existing tree and the proposed tiered seating. So these clearances are much greater than what exists now. I think in some places right now between the mounds and the other elements. I think if you have three feet, that's a lot in some spots and the visibility is greatly improved in this design. Also, I think you can see that the Mount heights are labeled there too. So you'll be able to get a full picture of what's going on in the park from one location, okay. Next, this diagram shows you what we're contemplating for the fences and perimeter conditions and the separating fences in between and walls kind of, doing, a combination of both on the West side. We are maintaining that existing concrete wall. We will be repairing it and painting it. You know, look really new and fresh, adding fencing to it to a height, that's appropriate. We will make sure we have six feet from the upper level of the tiered seating in that location. Actually, for most of that, sorry, for most of that stretch, we won't have fencing there and you'll see that, because we still have the the canopy and the vertical wood trellis that you'll see in a minute, we've got low curbs with six with a six foot, high overall height included fence, and then you can see we've outlined where we're reusing the salvaged granite walls. The one thing that I think is a change is that we're looking to use a lower fence in the on the northern edge, since this is a smaller dog run. We feel comfortable that we can utilize a four foot high fence there and we do not need a six foot high fence. So certainly, if you have thoughts about that, we're interested to hear to hear them. We are looking to do a more decorative steel fence along the 11Th avenue side. But then all of the other fencing at the perimeters and the separation between will be a more open wire grid type fence which you'll see in a second next and then this outlines some of the other amenities and furnishings where trash receptacles are being located where hose reels are being located, various seating types and the tree protection next, and then this gives you a general flavor for what the space is going to look like. There also will be over on the left. You can start to see that we're looking to do a some signage within the dog run. This is actually a donor type sign where donors get recognized through this we're signage, a fun sign that our the pentagram, who did our signage program, came up with right and then just the so the Community board knows the colors are this looks super saturated and plan renderings. The colors are a little faded it's somewhere in between it's tough, to get this the colors to render right in these zoom meanings, but anyways. Those are the colors, but maybe not so intense, okay. Next and then these are the materials and furnishings. So again, I've already talked about some of these, but you start to get a sense of what those are going to be next and then this is a bit more detail on this. On those custom tiered seats, the bench seat on the top is in the large dog run, backs up against the existing concrete wall. We're looking at using a perforated metal, stainless steel actually for the riser portions of the seat, and then the the tread part or the seat part will be, will be wood and then behind. That is that screen with the bit of a canopy, which is a combination of wood and stainless and then on the lower is the small dog run. That's the are going around the existing tree and it will incorporate a tree grate around the opening. Obviously, it's a pretty big tree, but we're going to make sure that there's no safety issues there and also that their the tree grate will allow the trust to be able to open that opening up as the tree grows. But we do not want to obviously have it open now, so that garbage gets in or it's it's a dangerous situation for dogs. The other thing we're doing is that there will be removable panels or hinged panels in the larger areas of the seating, and that will just that's just to accommodate access to bullet to below for cleaning. It's also potentially a place where some storage can happen if additional storage is needed, and likewise both of these will be elevated above the ground by about an inch to allow for drainage and also to allow for washing out underneath next hey Terry. I just want to give you a time caution because we're 45 minutes into our slot here. So, okay, let's move along so these are. These are the elements that you've seen before for the dog run. I think maybe the only difference is a decorative fence along 11th Avenue. It's going to be something analogous to this next and then the turf field. You've seen this. I think the big changes are. We are adding striping for youth size fields, so we have the overall size field, which is a 180 by 110 field and then going in the north south direction. We're striping for two youth fields, we've also in the practice area, we'll be putting permanent markers at like a 15-foot grid just to help with practice and drills. That would be done. There'll be new bleachers we're looking at new containers that will be branded with Hrpt. I think that's it. We did. The one thing I guess to mention is at this: at the comfort station, which John is going to talk about in more detail, talk Sorry Terry, not to cut you off. Sorry. What that we should probably unless there's more specific detail or significant change to the field, let's jump right to comfort station, because that's definitely, and that is that we are providing an accessible ramp now to get you from the from through the gateway of the conference station down to the field, whereas before the Al, the accessible route was via the existing entrance, which is closer to numbers three and four next, and next just one quick thing on the field. Just so you know we're providing a misting station, a location, exactly to be determined, but these fields do tend to get a little warm. So just like city parks is doing in their bigger synthetic turf fields, it'll be a little misting station, so you can cool down. That's a, I think, a pretty significant improvement, okay, comfort station, all right, John, you're, muted, John, oh good evening, everyone I'm well caffeinated, so I will try to speed up my slides a little bit just the first slide is just showing the location of the comfort station, which is nestled between existing tree lines, existing paths and existing fences for the playing field. It's anchored in a central position to most of the other programs or all the other programs in the park, and our strategy was to pull apart the men's women and women's room to create a kind of area to secure the playing field, but also to create clear sight lines from the rest of the park for exit and entrance. Please we took recommendations to kind of simplify the palette and some of the moves so here you'll see that we kind of made the palette choices a little bit more line with the rest of the park, and you can see here also kind of clear Portal to the playing fields. Next and again, here you'll see a direct connection. There will be a rolling security grille that will run on the back side of the solar panels that will be on. You know mechanically operated next, one so quickly to point out number one is the men's room. Sorry women's room. Two is the men's room, I'm going to jump to the bleacher area, which is number eight. I can't it's. The bleach area is next to number seven and there's now an ADA ramp, which is a v shape that connects the level of the comfort stations, which is above the 100-year floodplain down to the playing fields. Next, oh sorry, if you could stay on this for a second, the blue area is exploration, we're doing in trying to reuse a good quality of the existing granite stone to cut it and reconfigure it to create interesting patterns that are really durable for the park. We're still developing that we're working with the fabricator to push that forward. Next, the blue areas here are a layered metal, gradient or Grille, which can create shadow and depth, but also are very durable. Next, here's just some the grillage in context. We think the security grille can be the same material as those areas. Those areas could be maybe used for plantings as well. The slide on the right would be what the backer panel would look like next, so another recommendation was to add some solar panels, we've more than doubled them from 8 to 19.. We also really working with the really big existing trees, which limit the amount of sun exposure, so the areas that are not covered in panels are either shaded or act as a buffer between the playing field, the errant soccer balls and the panels themselves. So the green roof we think also is a very good direction, as well as the panels. You know, because it reduces energy costs, it reduces the storm. Runoff lasts twice as long as traditional roofs and on and on it goes so next one here you can just see in context all the elements and we did get a recommendation to look at using site locks in the New York climate is not recommended by our mechanical engineer. To use exterior sight locks to make sense in interior spaces also would increase the footprint of 15 to 20 percent of each men's and women room, I should say which would bite into the playing field even more than it is now. Let's see we talked about adding the ramp next, that's it so one other thing to mention is: we will have down lighting which we'll try to integrate into the solar panel structure. So it's more about the lighting than it is about the fixed string and and that's it he skimmed over, but it is kind of impressive that most we can basically power the lighting in the park, not the recreational lighting, but the lighting in the park through the solar panels. So that's, I think, that's pretty great. That is pretty great and for ending on that. Thank you very much for this gene. If we could oh next steps, I guess yeah. Let's hear that or do we let's go to committee comments? Do you think if we can stop sharing the screen, so we can see everybody if that's okay, I'm going to! I have one comment and then I will go to the committee, whom I hope will be brief. This was an update presentation based on our comments back from July. This is not a rewrite. This is hopefully simply a job. Well done. Let's get to work on putting in the ground. My one comment is the east side of Chelsea waterside park. Right now has a fabulous row of limelight hydrangeas and I hope you will put limelight hydrangeas back into the planting palette. That's totally vain and selfish, but they're really striking there and then. My only other question was how many bike racks. Are there going to be, or that's not based a part of this design? The bike racks will be there. I do not. I do not have the actual account, maybe Taylor. I think it's 12. there's right now. We've accommodated four at the entrance and you can get four to five bikes in each of them. Okay, thank you. Thanks everybody, I'm going to go to the well, we will have. We will have beautiful plantings. Thank you. I'm going to go to the committee. If everybody could, please use the raise hand, function Alan you're up first, thank you, Jeffrey I'll, try to make this brief, beautiful presentation, beautiful design, probably one of the best presentations I've seen as a presentation in a long time. A couple questions I I'm confronted about the the picnic area in that we do not have any tables. I know this was discussed back then, but they're, all four or six seat tables chairs. What happens when folks want to come in and have a birthday party family parties? Obviously do they need to move these together, or can we get some large tables in there? That's one of my questions. I have one question on the on the dog run, so let me put that does the hose reach to the other side to the West side? Okay, that's it for the dog run, but the picnic tables I think, should be prior to the whole park being redesigned with the children's park. There were picnic tables there, and people did have large parties there. So that's something I think that should be looked at again. We're looking at the furniture allen and we'll take that into consideration. Okay is there. I know we talked about the entranceway, the main area, the walkway. Is there a large open space for events? Hopefully we have events sometime soon because it does not seem to. It just seems to be the same, at least to the West side, but we talked about having a an open space for events. We have a fairly large lawn panel. We traded a lot of asphalt, a lot of pavement for free green. There is an area that a small gathering could gather, but it's not intended to be a an event space per se. Okay, I know that the friends would run events there. It would be. I do not know, also the picnic area, the furniture's movable, so you know if we really wanted to do something we could do something there too right. That's correct. The picnic area would be the area that would be cleared out. Okay, all right, I love the benches. I love the seating there with the with the armrests with the tables here very good idea, a good touch, I'm done nice beautiful. Thank you very much, really great design and very prompt great responses from you guys did a great terrific job. Thank you. Thanks, Alan Blake, thanks Jeffrey and Echoing Alan's sentiment about the great presentation. Just the two quick things you know: one is around the trash bins. You know, that's not really an error that we address, but you know. I would hope that the design is something that would discourage overflow and you know, discourage the people putting in household trash in those bins and also have a place for recycling. You know as an element of the trash and recycling Bin design, and the second point was just you know. I think it would be a it's a great longer term idea to have a vendor. You know in that space that you a portion for that. You know particularly a local business vendor, and you know I would just want to make sure that there's ways for them to be visible. You know from the street it looked like there might be a tree or something that would prevent people from the street from seeing them, and so you know we just want to make sure that if there is a vendor there in the future that there's you know ways for them to attract customers from outside of the park area. Thank you. I will just say that trash is in our wheelhouse and there will be trash recycling and compost bins there and, and we actually do an audit constantly on what trash is being put into our bins. So we have a pretty sophisticated trash program, and certainly it will be here in Chelsea waterside and we're going to keep an eye on making sure that the ornamental plantings do make the concession visible. Thank you thanks. Blake Leslie, this is just really a big. Thank you. I mean you guys hit it out of the park. That was the most thoughtful, and that was the one of the best presentations. The only thing I would say or ask for is if Terry could present for every parks project, because that was awesome. So thank you, and especially guys thank you for putting in more of those solar panels that and that it's going to light up most of the park awesome. Thank you so much leslie to marty. I was going to say something I was going to say something very much the same leslie. Thank you for saying that. Thank you so much for this presentation, but more important than that is thank you for listening to us at the last presentation, the solar panels, the mature tree, to name two you incorporated into this design and I'm delighted. Thank you very much and David yeah great presentation. I really appreciate the way there will be more green space. I walked around the park today and noticed that there were some areas of green that just felt like leftover tokens. So this is a huge improvement and I know this seems petty in comparison to everything else, but to return to the site locks in the bathroom. I think the amount of space that you would lose to the park by creating the sight locks would be negligible. I can't imagine that the HVAC has to maintain comfort zone temperatures inside. That does not seem like a priority for a space that people are only in for minutes. People do not like to touch the door hardware to get into, and out of those people in wheelchairs do not appreciate having to push a door open. People do not feel secure inside when there's a door that shuts behind them the way you've got the men's room set up right now when the door swings open people outside will be able to see men at urinals. I know you can fix this. It's not that big, a challenge I mean, I guess I'll, go back on that David to say. I think this is the final design presentation. So is this? Are you looking for a to really have sight locks be a part of this design because of a door factor? Well, we asked for it before and, as I said, it does not seem like that big a challenge. I know it can be solved and right now we're at sort of schematic design in terms of that building. I do not see why it can't be introduced as things go forward. I guess if you can hear me, my response is: if we're looking for sustainability and we're trying to maximize solar energy to have open sight, locks exiting entrances, is kind of counter to that so you're, actually just throwing hot or cool air out and we're going to look at doing sensor, driven doors, Touchless, fixtures and fittings. But I really in this day and age, not would not have exterior sight locks in a climate like New, York yeah, and it does take up more space. I mean we did it's not that we did not look at it and we looked at it and again, not comfortable with it. Well, I guess that's our answer sure, because it's not it's not a crazy idea. If we could do it, we would true. Okay, any other members of the committee scarlett as an honorary member is very excited about the dog run as well. So I am going to go to the public anybody from the public questions or a specific comment. Yes, let's bring zeizel over please gene. If we can hazel, are you there, let's see says, can you unmute there we go well? Yes, thank you very much for the wonderful presentation to Terry and her colleagues and John, what's happening in the corner of 24th and the West side highway, that kind of unused space at the tip of the sports field. Most of it was captured for this to expand the synthetic turf field, but the granite I mean Terry. You can answer this. If you had it looked like you were muted, so I jumped in but go ahead. Thank you jerry. You want to take it all right, yeah, that's! Okay! The granite that faces the West side highway is going to be maintained. It needs some minor repair which we're going to include in this project, but we will be lowering so right now that overlook area is several feet higher than the field elevation, so we are going to be creating a basically a low wall on the interior of that existing stone wall that is adjacent to the highway in order to lower it down to the field elevation. So there won't be that gray, differential anymore and that area will become a contiguous part of the synthetic turf area and be dedicated to a practice kind of warm- up drill area. Oh great, thank you so much, and I also wanted to just ask quickly about the width of the path the walkways the pathways, so they do vary a bit, but they are in the neighborhood of 12 feet. There are some taylor correct me if I'm wrong, but there are some paths that are a little bit less than 12 feet, for example, the path that leads into the dog run, I believe that's at eight feet, but predominantly they're about 12 feet, not larger than 12 feet. Thank you plenty of room for people to walk by each other. Thanks. Thank you. Let gabriella have you had your hand up and I think you've been brought over for a question. Yes, I'm just going to give you some feedback from a five- year- old, since there is not another one that I can see on the talk. My daughter was concerned about the integrated seating and what it means to have chairs that are at a preset distance from the tables for kids. That's a bit too large of a gap for them to comfortably use the chairs next to the tables when they're, integrated and also since the chairs appear to be made of metal mesh. You know she said. Oh, I could I could kneel on them, but it would hurt, it would hurt my knees. So that's one thing since kids are not often considered in such plans. The other thing is we had. We had liked the idea of the larger tables. I know that was removed between July and now. The reason why those again are really good for kids is for those outdoor birthday parties which can't be held at full person tables. That's all those are great. Thank you. Okay, thank you, Beatrice and I think Madeline Kevin. Sorry, you furniture is sort of still being finalized in terms of it. Yes, we're still looking at furniture. Okay, great comments, then thank you. Thank you any other final thoughts. I this is just what a victory. This is for comfort stations to be coming to Chelsea, Waterside Park. I love that sorry, the fabulous design gwen. Yes, I'm sorry. I do not know how to raise my hand in this anyway. I just wondered: why is the women's comfort station smaller than the men's? I think it's within 10 square feet might be. The layout makes it look smaller, but it's not a smaller space. Okay, I think there's a mechanical room, that's part of it and of the men's room and that's why it seems different to you exactly. Are we going to name the comfort station after Bob, our former member? I mean he literally appropriated he was talking about what was underground there for that station and I'm not kidding I you know, I'm just throwing it out there. I think that we could take that up a little bit further down the line, but for tonight does the committee feel strongly one way or another if we need to memorialize anything in a letter the group has been outstanding and incorporating our feedback. I mean I'm not sure we have anything too technical or specific to add this round. I would say: usually our chair has a lot to say, but I guess he can't anymore. That is that's true, actually he'll be a voting president not eligible on this. So thank you to the trust. Thank you, Terry. Thank you, John. You know to what my colleagues said for an outstanding presentation. Please, let's just get this done. I look forward to more details on timeline and construction documents. The next time around. Thank you. Thank you thanks everybody. Thank you absolutely with that. I want to move briskly to item two on our agenda. A place called Balsley park on the southeast corner of 57th Street and Ninth Avenue Anita pointed out that it is not a park. It is a pop, privately owned public spaces. These are a nature of public space, acrosss the city of New York as a part of our zoning code, think Plaza's on park, Avenue, think, sixth and a half avenue in Midtown, between sixth and seventh, fifth and sixth, and this corner of Ninth Avenue. It's been closed for quite some time. This is how it's made its way under the agenda sort of been an eyesore at a time when public space is desperately needed right now, a lot of folks have been working on this issue. The speaker's office, Jessie and janine have been involved with this Carl. I believe you're here we're going to hear from was Ronnie Eldridge brought over jeanine okay, great folks at the Sheffield Ronnie. I believe you're here. If you want to share some initial information updates or what have you about that spot? I know that the building manager might have been coming from Ronnie the I do not know you're there, yeah hi, I'm sorry. I did not know how to unmute it. We've got you now and in picture well we're not making a presentation, but it was a wonderful presentation and the park is beautiful. I do not know if everybody understands the history of the park and trying to put it together. Today I was thinking how often I've interrelated with the park. Anyway. The park was a bonus. I mean the parkway was made because the builder of this building, I think it was a man named Hyman, Shapiro, agreed to do the park and then the plaza in front of the sheffield in return for the added walls that was in 1977, we can't find the original plan and we can't find with a city planning commission. They can't find it either. His plan was to take the park with the gran, the land. That's the park, connect it through the Parc Vendome to the plaza in front of the Sheffield. That's what he wanted to make it a continuous park, but that fell apart and it did not work so I've. It was, I think it was designed or redesigned in 19.. I have- and I happened to be at that time- the director of community and government affairs at wnet and that plan- although I came, I think, before or after that plan was based around an amphitheater- that wnet was going to use either to show things or to have discussions and that fell apart. So then the park just began to fall in disrepair and by this time I was a member of the City Council and the count- and that was in my district, so Adam and I had many discussions. The green market moved in. That was good. I suggested that we get some of the kiosks where people are so it was empty and we wanted to fill it up. So we got kiosks, I think from. I do not know where from Fifth Avenue or something and sold books and then the next step was other book. Sellers brought their own tables and joined it and it really became a terrible mess. So I can't accommodate so Adam, then they hired Tom Busley and he did this whole thing and it went through the City, Planning Commission and you and the Community Board and it was finished and you were talking about naming a park. He called me and excuse me asked me: what should what name did? I suggest and I took an hour or two to answer and by that time he had said it's too long. You took too much time. I do not know if anybody knew Adam rose, but he was very impatient or he is. You took too much time, I'm naming it after the architect, so it became Vosley Park and I all excuse me condominium boards are like all other boards. Some people say one thing: other people disagree, so it's always kind of been a struggle to get everybody on the board to support really keeping that park. Well, so we went through a phase when the park was not financed as well, but when then Tom Balsley, we hired Tom Balsley to come back and read and bring it back to the original designer close to it. And that's when we started, I think, with the with the community board, we went to the city Planning Commission. It went through a whole, almost land use thing where and then we were able to get the application to reactivate the kiosk and we've really, I think, reasonably continued this and when we when Bosley came in with a second part that was through well, Eric was the main thing, but so was whatever you know our speaker, but he was not the speaker than he was our local city council member anyway, we tried to maintain it. Some of the chairs of the community boards in between have been more generous than others, and so it's been a struggle and I've been its advocate. Now it seems from the very beginning. So my mother also lived in the Sheffield before it became a condominium, and so I saw what it looked like in different phases until it got straightened out. So that's my presentation about that. I mean, if you wanna, we are we closed the park for the bat pen pandemic. Also, the Parc Vendome started their facade repair and they were working they're working on the 56th street side, so they have extended a shed, and I do not know if it's a whole building or what onto the park and that's closed the play area which always which has been in disrepair. It's just never worked, it's not really a play area, it's boring the kids from the high school down the block come and hang out there. I do not know who else hangs out there and we closed the park. We can't we can't control the pigeons. We can't control the neighbors, whoever they are, who feed the pigeons. I went there today and the park. The part of the berm that you see from 57th street was lovely, but the part that you saw from 50 from 9Th Avenue had I counted 50 pigeons because that's where all the breedcrumbs were or whatever they were sent to them, it's very hard to keep it cleaned. It's just impossible. Our building sends somebody over there four times a day we open it. We go and clean it. We clean it again and then we close and that's that our our Kiosk operator wants to come back. I am just questioning what the fu, what we should be doing in the immediate future as long as the Park Van Dome is continuing to do all of its facade things. I do not think it's particularly safe to keep the lower half of the park open. Excuse me, so we're going to suggest that we are bringing it back. I mean we do not want to. We do not want to really open the whole park and since we suspect that people want the parko open or some people do, we would like to propose a compromise where we open the kiosk and the seating area for the kiosk and that we keep it somehow closed at the other end. In the meantime, last week or two weeks ago with the wind, I guess it was last week one of the old trees fell and it could have been a disaster had it been open. So you want me to tell you what we're doing now or do you want to ask questions? I guess, if there's more, to share in terms of what you're doing to get the park open. That would be useful to know. Excuse me, we have re we've power washed and we sorry no. I am so. You have not had the floor in a while Ronnie like this. That may be why all right we've, we now have been getting it ready and ever actually everyone since you've invited us to come. We've heard that people want the park open, so we have power, wash scraped and painted all the spanish red walls which a lot of us think are very ugly, but that was the color that was approved. So we've stuck with it the pavement and walkways they were all so clean. We assigned a contract, we we've engaged an architect, Mark Morris. He went through to see. I skipped a step when the park was closed and when the shed was being put up and the and the Parc Vendome was starting to do its facade. Where there a building inspector came, and he cited us for violations, it's a very unspecific violation. We could not really tell what it was so Mark Morris came down, walked the park. We pinpointed different areas that we thought needed repairs and that's now what we're engaged in doing we've. We have a contract, we're going to start with repairing those things that we saw. We've fixed the gates. That was a big help that we fixed the parts that were distorted, so people could get in and we fixed other parts that needed some scraping and repainting, but we did not repaint the whole thing. The whole question of gates and the whole surroundings is up for discussion for next year. We've got the scope of work so we're starting that with what we call the trip hazards. We've received a quote actually from one vendor and we're waiting for two others. It'll cost us 53,000, the Bartlett trees guys are coming to assess all the trees they're, removing the big tree that fell on Saturday, there's an apple tree that we think needs to be taken out also, and he eventually, as soon as we can we've signed a contract to have the trees pruned. I do not know what else we anyway. So that's we will replant, you know and will replace the trees. There's no doubt about that. So that's about where we are now I the biggest problem we have are the pigeons and I do not know who goes in there at night. We do have a periodic. I do not know how off you know, regular our security guy walks down the police have been contacted by the security firm. We have and they are they're very sensitive to the park and they come around, but it's very hard. You know it is a. I wish we could have it as a co- op a park and that we could have parkvendome people on 56th street. Other people who use it can, you know, be part of it because I'm our board is dependent on my basically pushing it and it's quite a job. Next year we are allocating around two hundred thousand dollars, we're going to redo part in more detail the pathways and that just clean everything and do and the gates, but that's where we are now. This is a considerable quirk that the park, the building's responsible for, does not abut the actual property itself correct right. It's not adjacent the Sheffield. The whole Parc Vendome is in between the park and the sheffield. So it's very you know it's very hard. I want to go to the committee for some questions. Anita has been very helpful. We started off with. Can we bring Anita over? Also sure? Sorry? Thank you. Okay, we started off. There was great hostility because Anita was she was watching on behalf of everybody and we met and she's the one who really started the fact that the park needed repair so eric and the office was so helpful to us, because I mean Anita you're right you're, my friend now right, I've always been your friend Ronnie. Anyway, we try to work very carefully, and now we have the same managing agent that the Parc Vendome has and that we have so hopefully that's going to also help make things easier, I'm going to go to blake for a question yeah. Thank you for the work on this ronnie. You know I live on that block as well. So I was passing by this and you know I would agree with the sentiment that you know I think, there's some need of painting and I think also replanting, the grass, because it's really patchy and I think it makes that berm a little less usable when it's I'm sorry. I think that is not our plan for next year. I'm just going to make you a little louder, but you know what the trouble with the grasses, not only the pigeons, but there are people who take their dogs on the grass. When I looked online for the history of the park- and I and I pulled up, I think a site that Tom balls- I do not remember which site it was when it was first done. There were pictures of all of people. You know sitting on the grass and enjoying the grass that can't happen anymore. I'm sorry blake! I did not mean to interrupt you, oh no. That makes a lot of sense now and the two other things you know. I think the gate is also a design. That really looks you know rather jail. I wonder if there's another design that might be a little more friendly, looking yeah and you know I would totally agree that the pigeons you know, I think, are the biggest issue with this park, and you know I'm wondering if, when the park is monitored, if you know that person could spray down the sidewalk, even if just you know, remove the bread crumbs or you know whatever is on the ground, even if it's four times a day, you know that might discourage continuing that pigeon problem. I should have told you that we have two representatives, although I think that Liam Birmingham, who is the building manager, had to leave, but we have the managing the manager, the building manager, also in the audience, and so we they're listening to this- and we will sort of think- is Liam still on. Are they connected at all? No all right, but liam we'll I'll talk to Liam about it. I think that the men do wash it down when they come, but I'm not sure thank you. You're welcome, brad you're on Mute Mr pascarella. There you go yes. When the park Van Dome is working on their facade, in many cases the neighbors work out a deal, and it has to do financially saying well we're going to shut down a piece of your property you're, going to give me 50,000 or 60,000, because now you shut down a whole park has was there any agreements made, and they also understand you know, because Parc Vendome right next to it, they get the finger, pointed them a lot, and this is definitely a sheffield issue. You know I do not want to go back to my history there, but I'm just wondering curious about that, and also to get back to bank parking London. Could it be possibly that they want to participate in a in a budget that can be added as an assessment to their property, to add to the maintenance of this property, or you know what is that relationship now? I think our treasurer had talked about that a little bit and we would love that they're, not they're, not contributing to the cost of it. We have worked out an arrangement, but it's not monet, it does. It does not include money because we have the scaffolding where the Sheffield was the first one to do the facade stuff and our scaffolding went slightly, I think affected Anita did it affect the parking lot went into our garden area and they were very helpful and very generous, so we're certainly not into I do not want them to pay us for their part of it. We just have been, I think, we've been pretty understanding. We've always worked out a relationship about the scaffolding and stuff. So I that that's you know it's something, that's what happens in New York, because the City Council and I'm afraid I was on it and that local law 11 was passed. It's a nightmare. Can I answer a question one of Brad's questions? Does anyone hear me yeah? Yes, we can okay. The reason why the Parc Vendome does not contribute to Balsley park is that we gave up our far so that rose, could build higher and Adam rose could build higher or who was it shapiro? He was not that I think well just to clarify you did not give it up. You sold yes, and that was before the Parc Vendome was converted, so we now have. We do not have any more air rights and I guess the way we feel is that okay, let's work something out with the Sheffield, but why should we have to pay for a park that took away our air rights? We could certainly use those air rights. What would you do with the air rights? There's things we could do on the roof? There's things that we could booths are so beautiful. The roof is well, the roofs are so beautiful. I look over there, but they can't be built out and they were not there's a lot we could do but right now we can't do anything with our rules. All I'm strictly saying is right. We're trying to be neighborly. That was a deal done almost 45 years ago, and now everybody wants to use that corner and it also is an asset to Parc Vendome and the Sheffield have a very active park and all I'm saying is: maybe the winds have changed inside the Parc Vendome, I'm not letting Sheffield off the hall just saying. Maybe it's a possibility, I'm not talking about 300,000 a year or anything like that, but maybe a deal where they help with their maintenance group wash it down. I mean a bit more, not thinking Retro but actually looking into the future. It's all I'm trying to bring up. I do not want to bring you know. I understand what you're saying, but I just think at this point and it's been a problem for years. Maybe it's something to look at a little differently than something was taken away. It's a great idea! Brad! I love it, but I mean we do go on sorry. I was just going to we advocated, for you know, partnerships like this all the time, public, private partnership. You know, I think it's notable to recognize that it would be a beneficial asset to everybody along that area, not just the Sheffield but also the Parc Vendome. I want to keep going just in the interest of time, Chris yeah. No, I was actually going to bring up all the things that Brad said, because it seems like an issue of financing the maintenance. I hear complaints about pigeons and blake had brought up a possibility of more frequent cleaning schedule daily in order to make the park habitable or usable or more appealing for use, but that's it so yeah Brett blake, you guys hit it on the head for me. Thank you. Thanks Chris Sally, hello, Ronnie, please yep Anita. Maybe we could work out a deal where the Parc Vendome maintenance people would take one power washing during the day or something like that we could share some of that do not know. I really do not know. I do not want you to make a commitment or anything it's just yeah and I can not make a commitment right. So I I'm just one of nine board members, but what I do see is that the problem with the pigeons is that the gate is closed and if the gate were opened, if the park were opened again, then the people would not be tossing in seed. It's become a pigeon zoo. People are just standing outside by the gates and throwing their food in I walked by today. People are just throwing in their garbage. I mean if they're coming four times a day, they should be hosing four times a day, that's a way of discouraging the pigeons or getting security to come to discard to chase away the people who are feeding the pigeons. So maybe that's. We should discuss it more with our building managers and the boards right, because now what is happening is that there are people standing on the sidewalk feeding the pigeons from the sidewalk. So now it becomes a challenge just to go up or down 9th avenue, because you have pigeons on the sidewalk and on the other, on the other side of the sidewalk, we have a lot of stuff for homeless people. So it is not. I agree with you, but I just wanted to say when the park was open, people braised were brazen and just fed the pigeons. I mean I went up to a guy one time and I said really do not feed the pigeons because it really makes it. He said you know, go blank yourself, but so it kind of disturbs me from doing it. Yeah sally yeah, it's kind of sad to listen to all this and I'm just really weighing in on Brad and Chris, because this is very much a human behavior problem and it's nothing. That's not fixable. If people would just do the right thing, it is not legal in New York to feed the pigeons, and you know feeding the pigeons and what was the other problem and the dogs pooping. You know on the grass it's just unacceptable, behavior in a community and there seems to be it's kind of like, and I do not really know how you fix it, but it's kind of like the Graffiti problem. I do not know if more cleaning will help it, but you know Graffiti goes on a building and you immediately wipe it off it's a way of controlling it because they keep putting it up and you keep wiping it off. If you keep cleaning up the poop and the and you stop the people from feeding. Eventually, it will become clean, but it's an enforcement issue. I mean you have a community of people that are that are making it uninhabitable. So I'm just thought you know it's very sad. It is it's almost like people who should be wearing masks and are not wearing masks. I mean it's just not the concern for the general community and I do not know what you do for people like that, so yeah well just constant cleaning. I do not know. I wish I had an answer for you, but I think it's just very sad when the people are making it bad thanks, sally two things I'm going to go to Leslie before I go to Chris, because Leslie has not spoken yet, but I think the key for Us big picture is understanding when this is going to reopen whether it's segmented or as a whole and then from an update standpoint. You know this was not meant to be an open meeting for the Parc Vendomer in Sheffield to have a conversation. I think you guys are capable of doing that, but it was a huge factor of community education for us to understand the struggles behind the space why it exists. You know all of what you guys laid out so with that I'm going to go to Leslie and then to carl from the speaker's office. Who's been involved with this as well Leslie. So I live on 55th street for the past almost 17 years, so I go by this all the time and by the way fun note. I sat next to Al Pacino in this park, so it is very dear to me when you live there, but I think the problem here and Jeffrey you might know this as well- is that it's essentially a public park, because it's on right on 9th avenue on 57th street, but it's but it's maintained privately and the people who maintain it privately are not even really adjacent to it. As Ms Eldridge said they're down the block a bit so what's happening is that you know homeless are going in there or not. Now, because it's locked up or the maintenance is not as good as maybe you would see a regular city park because they just do not have the staff or the money or the constant attendance, and I think that's a problem like I do not know between which building how that's going to be rectified, but unfortunately the Ma. I think the maintenance is not to the level of a regular park that we see every day. So a lot of these things, the pigeons the homeless, the there's now there's some drug use are the dog like she said the dog Poop is falling. You know through the cracks yeah, so I carl might be able to shed some light on how maybe that can be rectified through a you know when it's that private public kind of thing Carl, I think, can I add one more thing. We investigated putting a cameras around, but then the question came who's going to respond to all of it. If there's somebody, you know feeding who's going to respond to them and the Kiosk operator was a little helpful, but it more helpful for cleaning his area rather than the rest of the park anyway, car or whatever. I do not need to vote so I ronnie sort of proposed a half open option and I'm just curious about how the park the committee would feel about that, and also I'm. If that were to be something that would move forward on. How would how would we delineate you know? Half as open half is not. Is that, like a you know, caution tape is stretched acrosss the park or you know how would how would that be en enforced? I guess we have not really discussed that and I we're planning to talk to the architect and also with liam who is our building manager and to come up with a proposal. I do not know if it's possible. It may not be possible and run another question because you know from our office's involvement earlier. You know the pandemic started. You know I, you know. I had spoken a lot to Frank Carrucci, who I think at that time, and he told me that you know they were the these violations. I guess like violations is like tripping hazards. I think it was what it was and I'm just curious, you know are those substantial enough. Where are those and how long would that seems like a big job to start it is it's an expensive job. I think I gave you a figure, but I do not see it here. It's going to cost us. We had the architect look and pick out what parts he thought we have. We've got three bids out. One is responded, it was 53,000 and we're going to do that. I mean we're committed to doing that. We have to do that and are those in what part of the park are. Those in. I think, they're spread out we're going to also next year we're going to have to do all new sidewalks outside you know we're going to have to re. You know: do that Carl. Was there anything else? Leslie, I see your hand, do not worry. Was there anything else? No, I guess I just want to be weary of like if we're going to. If there is not a compromise of doing half the park, you know be kind of. You know the park's been closed because there's been concrete violations, but those are in the park that we're going to you know open. You know just I'm just yeah for those carl. Why do not you? Why do not you kind of contact both of us? I mean I'm perfectly, I'm the person now who's back working on the park, so we should pull it together and discuss it and when they we get the bids back, and I know exactly what, where the tripping hazards are, we should you should come and we can show you and Anita will be there too so happy to do that. Okay, Leslie and then I'm going to go to Chris and Brad Miss Eldridge. Just one question- and you mentioned that you were talking with your board about this since it's such a huge cost to maintain and it's really not adjacent to your property. Has there been any talk of the Sheffield? Not I mean yeah the Sheffield, not wanting it anymore or not. You know wanting ownership of this park any longer, at least among some of your share of your members. We've offered it back to the Parks Department and the fact that we would pay for the maintenance, but so far they have not approved it, but that I think, would be a very good solution. I wonder if well, it's has. There ever been a transfer of responsibility and ownership as a as a pop to a city agency right. We know that those relationships do exist. The other way around where the city is the owner and the private entity is the manager, but I do not. I do not. I can't think of another example. We've seen this happen in the reverse, so well, we'll see huh, yeah, Chris and then Brad yep. Thank you again. This is a quick question to miss Eldridge. I know that you had mentioned that there was a lot of use by students there from the local high schools. Would you entertain any partnership with environmental studies? I was an environmental studies student. I used that park after school. In the fall and spring- and I loved it there when it was available when it was not crowded, but I know that like when you give kids ownership of something they have a tendency of taking pride in its maintenance and its look in the future. Would there be any outreach from the Sheffield to miss Najmi, the principle of environmental studies for a shared maintenance program? I agree with you totally Chris. I think that's a very good idea. I mean we've. Also. I've also talked to some of the people who live on 56th street, one who was a gardener. I mean he did a garden behind one of the buildings. There are two of the buildings and I can't remember his name, but I can find it and he wanted to do some. You know some gardening there I mean it should be open to people to do that. The problem is, I guess, you know who's going to supervise it, but we could work that out. I've always wanted to include some neighboring groups into the park yeah. I just feel like with only 40 of the student body at that high school now attending, and we do not know what next year is going to look like. There's missed opportunities for national Honor Society volunteer moments, and that can be one of them. One of the intro classes that they used to do at environmental studies was urban environment and all the students all freshmen had to get their pruning license, which was really fun. I still actually have mine in a box in storage and then the second one as it relates to just habit like just use of park. Is there any appetite for signs noting like the banning of the feeding of birds or dogs on lawn much like bryant Park has for like their grass area, saying hey. This is not for your dogs or anything of that effect. Well, I think we've tried it, but we have not done okay, no professional things, but I'd love to talk to you about the program Chris. So I do not know if you want my email address, I think they have a community board, but I'll give it to you now. If you want to write it down with you, okay, yes, thank you so much Miss Eldridge. I appreciate it. I'm going to go to Brad and then I do Wanna Wrap up this item brad! Yes, this is for the the council member. Do we actually know the obligation of the Sheffield dollar- wise? What I mean can they be fined? Can we go after them legally, because it's not sitting and it's not being taken care of in a proper way if this was done, let's say nuts and yards with related right and they left one of those parks going bad, but we know where to go. This has been an ongoing problem for years. This is not just ronnie to solve it. Now, it's not on her shoulder, I'm just trying to understand what their obligation is and they're not living up to it, and then that's, I think, there's a lot of ways to handle it. Could there be just a board for the park with the? Is there a local bid that can contribute? I think the idea of the high school students helps, but I think just pointing the finger now. It's we're not getting anywhere, it's the same thing and we do not even know when it's going to be open. Half open, I'm just curious to our elected officials. How this is being handled to send DOB there to say, got some cracked sidewalks. That's not really solving the problem when it before the closure. It was not great, but it was certainly fine except again with the pigeons and the dogs. But if you complain I mean the Community Board was part of the process with the City Planning Commission, approving of the New York Ronnie. I'm just trying to understand what monetary obligation is from the Sheffield. Is it half a million dollars a year? I think we can say: maintenance is not it a million. There's nothing trying to understand what the obligation is and what years are they putting in the money? And what years are they not? That's all? Well, I can have the treasurer, explain it to you, but there is no specific responsibility, except that we have to maintain the park in accordance with a plan that you participated in years a couple of years ago, approving what it looked like, and that's I remember being on the board. I remember it coming acrosss being brought back to its former glory. I remember that yes, so I think the city could find us if we were not doing up to standards. I think we'd get fi I find, or I had the staff today try to look through the original, offering plan when Swig first bought it acquired it to find out what the obligation was in the offering plan for the condominium, but it's very complicated and it's not a user- friendly report. So you have to go through the hole and to find any references I mean Ronnie. All I'm trying to say is: if you go in front of the Sheffield or in that park, your park right before your building is clean. It's maintained, it has a maintenance schedule and it just does not seem the park is part of that and I would love for Parc Vendome and their staff to help you I'm not, but I just think the obligation needs to be stepped up. Yeah, that's, but I think that points out what the ridiculous part of the whole original deal. I mean we have doorman in front of so that they can maintain order in the plaza part in front of the building, but we can't have the doorman you know down at the park. It's the fact that it's not contiguous contributes to the difficulty of it. But I, the continuous thing to me, though, is you're talking it's on the same block. It's right there, it's right down! It's that argument to me is weak. Everybody can walk down the park there. I just think there's more to it and I also did not hear Jeffrey. When is the park actually going to be open halfway in a month as soon as we repair the the problems that are that we've identified all right and you're waiting on bids, and for that work to happen right, but Jeffrey, the public is asking and we can't say well they're, waiting on bids. We have to say the kids are doing two weeks. Our bids are doing a week, the park's going to make a decision in a week. You know we can't say to the public, they do not know. We do not know we're just going to win no brad. I agree with you entirely. This is one of the problems with pops, quite frankly, acrosss the entire city. I do not know how the public forces the hand of the managing entity and the ownership. Well, I think we do. We have elected officials, and I remember Gail Brewer used to come down on the shuffle pretty hard during construction and she moved mountains to get things done, so I'm not buying the fact that we do not have an answer for it. So Mary that's needs to park. Okay, I the I have two suggestions here: there's an open dialogue between the Parc Vendomeme and the Sheffield, which is great. Let's keep. Let's encourage that to keep going the speaker's office has been involved. I know the board CB4 board staff has been roped in on certain stuff like that as well. I think a lot of ideas were proposed tonight that those respective boards can consider in terms of a statement, a letter that CB4 can make. Is it a broad question about pops to our elected officials? Is it a specific ask, as it relates specifically to this location and, if so, what and to who any committee members with a thought on that and if we do not take action, that's fine too, because we can ask Sheffield and Parc Vendome for updates in due time. But if there's desire to take an action, I'm open to suggestion marty, I do not have a desire to take an action, but you are raising a whole lot of questions about pops that I do not know much about. So I think this is one of very few pops in community district, four, actually they're super common in community board, five, six and one so Midtown East. You know the east side and lower Manhattan we're big zoning. Trade- offs did not Jeffrey. Can I just south visit? Let me finish my thought and then and then yeah it's yours. Thank you did not. We visit another pop at one point and you Jeffrey are raising whole lots of information that we need to have about pops before I think we can write a letter. That's sensible! Okay, thanks Marty Anita yeah, there was a. You can speak to Jd about it because there was a hearing in land use four years ago about trying to compel the Sheffield to fulfill their obligations, he's actually on this committee. So I'm going to have to shame him for not being here to opine on it this evening. That's good to know, he's pretty familiar with it, but what I wanted to say is right. Now there is a problem with the pigeons, the pigeons. I was trying to express they're now on the sidewalk. What do we get? What can we do about those pigeons? The only way to solve the pigeon problem is by opening the park. Yet can we you know, may I just defend us because we have tried to maintain the park. The parks were closed with a pandemic. That was like months, you know, and what can we do about the pigeon? I need to let's not have a back and forth one at a time. Please running go ahead. Well, it was quote mandated to get closed, so we did not go in to maintain it also because the Parc Vendome started their construction and they that really made us close off the playground, part and part of it, and I do not know if you want people sitting in the park when you've got scaffolding not too far away from you. So it's been a very complicated procedure trying to reopen it, but we have long term plan big renovations. I mean we're going to spend more than two hundred thousand dollars just to spruce up put some new plant and stuff like that. So I mean I do not think that I did not mean to give the impression that we're not interested. We always have had it. It's just not been the top priority at different times with different boards, but we fully intend to bring it up to code, which means you know, answering the violations and keeping it as well as we can, and we will continue to talk with Anita and with the parkvendome and we'll figure it out, but she's raising a more important question, which is really. I do not know if you have pigeons in other parts of your district. But what are we supposed to do about pigeons? It's not enough really to say. Well, you got enough people in the park. That'll, you know clear it out. That's it does not happen. Carl is that do you know if that's health department, much like they regulate rats or not regulate but attempt to? Is this a health department, question yeah? That's what I was trying to think, possibly I'm sure that they might have some sort of on it. But you know the fact is: if there's going to be people that are going to be throwing breedcrumbs out, it's going to be hard to keep pigeons away. I mean you know, that's a big, a big part of this too, and you know maybe we could get some. We could get some hawks to reside at the corner of 57th and 9th sorry. I had to lighten up the moment there, so I do actually think this is a prudent thing to understand if pigeons, which, if they're considered a vermin, is that health department in this case and how they manage those types of things Anita. I see your hand yeah, and I want to wrap this up, to explain the shed so the shed cuts into about a third of the children's playground, but the children's playground I mean it has. It was supposed to be renovated. Four years ago the Sheffield had promised they were going to renovate the children's playground. So now, here it is it's underneath the seats there's mildew they can't. We can't get the mildew. The flooring has holes in it. So it's really not it's not for children can't use that playground. What I would suggest is just put a lock on the children's playground and maybe put fencing in around the children's playground so that no one could hop into the children's playground, because that's one of the favorite places for the students to go to Ben Owens School anyway or for the homeless, to sit or for the drug dealers to sit, but I do think if the park at this point, if the park were open there, the pigeons would go to the south side of the park right now. They tend to be by that sort of you know by the grass. People are just standing and throwing in at a part where normally the pigeons or in the past, the pigeons were not in that part of the park. Now the pigeons are everywhere. It's crazy. I mean it's. Thank you call it pigeon park. Yes, so I know that the health department will consider any egregious piling of pigeon remains feces as an actual health concern. It's it's. What's the word, not it's just a breathing problem. I know that there have been instances that I've read New York posts in daily news in the past, where, like air, shafts and stuff like that, have been covered in it and it's actually caused health conditions. So I know the Department of Health actually does respond to this. Thank you. You know there where I feel between a rock and a hard place. We wanted education on the matter. The Sheffield is responsible and has commitments to the community to you know, maintain and open this park. It sounds like at the same time they have work to do so. The park can safely open. We would be up in arms anywhere else if there was a danger in a public park or a sidewalk, and we needed that to be repaired accordingly. So what I do not know is what kind of a commitment we can get from the Sheffield to expedite, ensure that these repairs move forward and that there will be a safe plan to reopen as soon as is possible. We will be glad to make that promise to. I mean that declaration to you. We are moving as fast as we can we're. In the last we we're going to award this contract they're going to do the repairs, we'll open the park. I mean it'll be fine but yeah. It's then. The question in the meantime is what can be done about sort of aesthetic maintenance of pigeons and trash collection and all that kind of stuff. Now free, it's histoplasmosis is maybe what the word you're looking for with the pigeons. It could be. Yes, oh I can offer to. You know, speak to the health department tomorrow and you know perhaps we can go visit the park with the Health department person to kind of look at conditions. That sounds like a great idea, and let me just explain about the plans for next year. We have our fiscal year ends in December, so we are. We do not have the money right now to do some of this stuff, so we will we're planning to do it in the beginning of the year. Put the money in for next year's budget. Do you have to wait until January to do that? 50? To do the sidewalk repairs as well, or can that be done? I walk repairs, yes, but the Dave, the trip dangers and the those things inside the park. No we're doing that. So, no matter the trip hazards will not be completed until at least 20 middle of no because we've never been cited for the sidewalk. We're just saying that we need to do it. Okay, so the trip hazards which is what's preventing them, hopefully they'll, be done within the next three weeks. Excellent, so that's fantastic news that that's a much quicker time frame than I would have expected. No we're really! Okay, we're really working on it. So how are folks feeling right now, I'm not sure where we could send a letter. I think it's important that we're having this conversation, because as much as it's privately owned, it is a public entity. Is there a sentiment right now to do something or will we put some put some left give some leverage to Carl talk to the health department, get a tour going and we can see what happens from there and Jeffrey. I just want to say if there's anything Assembly member Rosenthal's office can do to help. I know before I was with the office. It was something that we were involved in so we'd be happy to help continue the conversation with everyone thanks emily appreciate that, maybe you know, let's you know we can have an initial conversation with the health department tomorrow. If the board would like, I think you know, maybe we could arrange for a visit there, that you know the stakeholders can meet everybody. We were all planned for the visit. You know the other yesterday I guess yeah. That was me yeah, but I also wanted to have our committee discussion on this matter too. Yeah marty, I what I'm hearing it sounds like folks involved with the park, are going to move forward. I do not think there's anything that our committee could do except to ask for a short report back in two months. I think that's reasonable does Ronnie Anita. Does that sound reasonable to you guys? That's great yeah, I mean yeah. Maybe somebody can come up with a pigeon remediation solution. I said a hawk, so we need a resident hell's kitchen oil. That's a great idea, a couple of them Jeffrey. While we're on this. The playground area is not a playground. I mean when it was fixed. It needs new pay. It needs new coverage because it has a playground covering on it, but we've thought often about changing the use of it. But if we change the use of it, we have to come back. I do not know if we have to go back to the city planning department or we have to we'll definitely be coming back to you, but I do not think that's going to happen until for a while. Okay, we would certainly welcome that being a part of that discussion. Right, let's go okay, I'm going to move this. Yes, an owl too sally, I'm fine with either I'm going to move on from this topic. Thank you all for being here, Ronnie Anita, for your representing your buildings. We like good public spaces, so appreciate having the conversation, and we appreciate your interest. Absolutely I'm going to make the next item pretty quick in part, because I aired before this meeting and marty and I did not close the loop on the budget priorities. As you guys all know, the community board's responsible for developing our statement of district means each committee is charged with determining what our priorities will be. Those each committee's priorities then get sent to the budget task force. They get shaken up in a big jar and then we pull out a number. No, that's not how it works at all, but our job is to prioritize Glenn. Our job is to prioritize the our district needs for the waterfront parks and environment. We have an existing list. As the committee we've always worked from an existing list to re, establish our wins that we've had from past years. Re- prioritize that list, if need be and come up with new asks. What I'm going to say this evening is transportation. Committee did a survey that worked really well, I think where they sent around a survey of our existing asks and committee members were asked to prioritize them, and then you were asked to add any new items to that list. You'll recall that we do this for capital and expense. Most of our asks for parks are capital, though things like staffing, our expense, and we always ask for staffing. So that is a quick rundown of the thought that for this process that I should have had more for you prepared this evening, but that does not prevent us from moving the topic forward. Do folks feel generally comfortable with that Alan. I think we also need to include some issues affected affecting us through the from Covid-19. Take that into account, as opposed to exactly what the that's, what so we would not want to remove anything. This is a big topic of discussion at the budget task force was in the age of the pandemic. How do we present priorities, given the state of the city's finances, the state of our district, and how is that looked at through the lens, and it was agreed that we would never. We would not want to remove anything from our existing asks, just because it's a pandemic and the bank account is low but to double down on those and then to see what we've learned through what we've lived and see what needs to come of that now. So you know folks are going to have a right to prioritize accordingly, and I think I think all of us take Covid-19 into consideration right now when we're making our decisions so Alan the whole. There would be a section to add things based on New. I would caution that if it's a new item, the board would have had to have taken a position on it. So we can't just say you know: Balsley park needs a million dollars. The board has not taken a position on that at this point, yet so process wise. Possibly we could do that in the narrative, in the summary, do something as inhabited in terms of what we might want or might what we hope to see as opposed to specific items, as you mentioned, that have not come before the committee. Yet, yes, I think so. The struggle is on the other side. This is a report that we have a very technical way of reporting to the Department of city planning, how our priorities get put into the system, and so each committee can't necessarily have a narrative. We can have a paragraph in the budget task force letter which would be up to the second vice chair. No, you do not have to you. Have the summary before the priorities do not know. We have that section here that we express you know what our concerns are. Maybe something in there we can throw in yeah absolutely marty. I saw your hand as well. No, I did not. I do not think I raised my hand, but I think we need to resend out that list and ask members to look at that list from previous years, so that we can, I mean, I know what some of the I mean was it in the dropbox yeah. There was a whole budget folder in the dropbox yeah, so we're going to keep that folder there. No it's ask me, because I have not looked at it and I doubt I'm unique in this. Ask the committee members to take a look at that part of the folder in you might want to send out a a specific location to us for it and to look at it and come back maybe next month with a sense of what the priorities are. I do not know what the time frame is. We have we have a time factor so hence the circulation of the survey to consider our pre- existing priorities and how our pre- existing asks and then have each member prioritize those and it works out in the survey. How that's done I mean if anybody has new stuff to add that can be considered by when, frankly, by the time I turn around the survey, I think budget task force meets Leslie, I'm kind of looking at you or Alan the 22nd, I believe yeah. So we, the committee, needs to turn this around in the next two weeks. So it's a pretty straightforward survey, I'm happy to get it together and get it out to everybody if everybody feels comfortable with that, so I feel comfortable with it, and I appreciate you doing the work to get the survey out and what this conversation is saying to all the committee members is that when you receive notice from Jeffrey to go to wherever the survey is look at it in the next couple of days and send it back as fast as you can yep Brad. Is that a hand? Yes, I just want to comment on the thought of the budget. This is like saying to your family. We're broke, let's go buy a new car and I do not care where the money comes from. In my opinion, we have to help the city and we should say to the city our priority because we understand what's going on is we want a clean park and we want some maintenance right. I do not know this philosophy of doubling down. I just I'm not really understanding it because it to me it's very unrealistic and not very helpful to our community. I do not. The consensus from the budget task force was that we recognize that priorities will shift significantly given the state of the fi, the city's finances and the state of the city. We should not expect committees to willingly remove things from their budget ask list, and so the whole list should be out there and it's up to each committee to prioritize it accordingly and brad. I think you're 100 right that we're going to see some shifting in priorities of keep it clean, keep it open and the rest is sort of frosting from what we can get right now. Doubling down was not the right term at all, so I apologize for that, but we also the budget task force felt strongly. I did not want to lose sight of all those lower tier asks, just because the money's not there does not mean it should not be sort of in the mix. Actually, I think Jesse said to keep it on right just for next year, just to make sure it's in their vision, so that will get circulated. Thank you, everybody for that katie Jean. Can we bring katie over for what I hope is very quick on new business and then, if anybody else has any new or old business, we're going to take that, but Katie had messaged wanting to bring something up today, katie hi, I mean you kind of touched on it just now with talking about cleanliness of the city, we all know sanitation had huge cuts. It's really bad. If you've walked on 10th avenue, every corner can is constantly overflowing. There's trash in the street. It's going to go in the storm sewers going to go in the river. The sanitation has had to halt their e- waste pickups their safe disposal, events until next summer, so there's a lot of things that are really we're losing. As far from the environmental side of this, I think sanitation often gets forgotten they're a huge, essential service, especially during the pandemic, there's more residential trash and there are less sanitation workers now and we do have this month, potentially losing more sanitation workers. So I know that's should be like a super huge priority. That's all I really wanted to say. I appreciate that entirely katie, we're down to. I think one pick up a day. Six days a week on the liver cans, it used to be as much as three pickups a day on some of those litter cans. So we are very much aware of it and I did hear we are supposed to be getting three additional basket trucks in this CB4 area, so that should help, but I still have not noticed any significant change on 10Th Avenue. I think 10Th Avenue is always forgotten. It has no supplemental cleaning. There's no bids, there's nothing there that helps mitigate the situation where Ninth Avenue has ace. That is there five days a week to help clean and empty the cans. That's a city, Council funding, Initiative! Okay. I think I can speak for everybody and say we agree wholeheartedly and recognize that sanitation is a very important part of our budget considerations. Great, thank you. Anybody else on new old business Jeffrey one question about the Sheffield: is there a bid over there? No nothing huh, no, nothing, because it should. That would be a great idea to fold it into a bid. That's a really good idea, but there is nothing district. They might be willing to help a little bit too far away. No, I do not know where we could run a ferry there. Any other Google is everybody. Thank you for tonight. This is a great meeting and also no formal letters, just this survey to get out. So thank you. There's no other business motion to Adjourn. Thank you, Jeffrey good job. Thanks marty thanks everybody thanks Jeffrey Bye everybody.",
            "summary": "I'm, going to use that environmental discussion at the segway to officially call our community board 4's waterfront parks and Environment Committee meeting to order.\nAs everybody, knows, I, think we've all been this before we are holding our meetings virtually in part and thanks to the governor's executive order, allowing for public meetings to take place.\nWe had proposed removing one of the trees that was located in an area of the expanded dog run, and we were doing that to accommodate the water play for the dogs in a more centralized location, and you asked us to reconsider that and take a look at preserving that.\nThose are the areas that we had to really focus on in terms of incorporating your comments and looking at redesign and refinement next, so that included, the dog runs the picnic area, the entrance, the comfort station, some of the plantings and the synthetic turf field.\nYou, also see that we're maintaining circulation along the sidewalks, maintaining the circulation from 24th street into the park along the basketball, area, The, basketball, You can also then see that we have the stills have the three entrances into the dog run.\nYou get to see some of the thinking in terms of how we're going to be utilizing new trees, tree canopy to start to create and emphasize spaces I'd just like to chime in one of the things that we here at the trust really liked about this design.\nWe, obviously were looking to preserve as many of the healthy existing mature trees as we could, both within the park, as well as the street trees.\nThe idea was to have low ornamental plantings to really kind of draw you into the park and then once you're in there you're kind of like in a room in itself and Terry spent a lot of time on them.\nWhen the plans come up, it provides flowering interest in the spring and then in the fall you may have seen it provides these little papery seed enclosures, which are a really lovely like fall interest, Then they also have the added benefit of you know a light, breeze kind of creates this sort of fluttering and noise sort of aspect to them.\nTo make note of is the Gleditsia up in the left hand corner that's a tree that we've selected to use in the picnic area, and that is primarily because it's got a light, open, airy sort of head right.\nYou know all of these kinds of parks and open spaces.\nYour sight lines go straight, acrosss the park And, you kind of start to get a hint of the tree grove at the picnic area , We're looking to use granite curbing throughout the park and then just to the left of the main entrance.\nYou know, raised a bit we're looking at doing low fencing on top of those on top of those curves to help protect the planting.\nWe definitely intend to do furniture very similar to this, but the specific model we're still working through with their maintenance people making sure, like the specific model, is totally maintainable and what we want to use so movable furniture where you see it, but And, then this highlights the custom bench seating that we're proposing utilizing stainless steel for the supports and the arm What this bench really starts to do is to create you know a variety of options for seating.\nThey are also spaced at a distance that would deter someone from laying on them, which is you, know, an important way to help monitor usage in the park next, so the picnic area directly opposite the playground you've seen this before the layout has not really changed too much.\n, we're looking to utilize, reclaimed, stone from the existing park and then seating and then.\nIf you go to the you can start to see what those tables are like they're, very similar to what is the existing tables and chairs that are currently in the park.\nThere is planting surrounding on the outside the stone walls, and then the one thing I neglected to mention when we were at the at the plan is that we are making some minor modifications to the play area directly, opposite, particularly to the entrance to accommodate stroller parking, and we are also planning to change that fence.\nYou start to see what the what the Festoon lighting would look like and how the space would feel just one quick thing that the trees are far along in this image.\nYou know that elevated seating that we talked about previously, which gives you a really nice vantage over the entire dog, run in order to accommodate that we had to shift around some of where we were locating the granite walls, and so we have done that so that tiered seating now backs up against granite walls, which will be those repurposed granite, walls.\nNumber four is the new location of the water play area in the large dog run And again we're utilizing that stone wall as a backdrop to that to one help protect from water spray from moving out onto the sidewalk there, and it also gives us the benefit of being able to kind of stack up some of the granite blocks to utilize for other water features in that area.\nI may have missed something, so somebody else feel free to jump You look up on the West side, just adjacent to where number six is number six, which is the Sally port entrance that comes in from the park.\nIf you could stay on this for a second, the blue area is exploration, we're doing in trying to reuse a good quality of the existing granite stone to cut it and reconfigure it to create interesting patterns that are really durable for the park.\nI would hope that the design is something that would discourage overflow You know, discourage the people putting in household trash in those bins and also have a place for recycling.\nIt looked like there might be a tree or something that would prevent people from the street from seeing them, And. So you know we just want to make sure that if there is a vendor there in the future that there's you know ways for them to attract customers from outside of the park.\nThank you for putting in more of those solar panels that and that it's going to light up most of the park.\nI think the amount of space that you would lose to the park by creating the sight locks would be negligible.\nI. Guess, if you can hear me, my response is: If we're looking for sustainability and we're trying to maximize solar energy to have open sight, locks, exiting entrances, is kind of counter to that Actually, just throwing hot or cool air out, But I, really in this day and age, not would not have exterior sight locks in a climate like New, York It does take up more space.\nThese are a nature of public space, acrosss, the city of New York as a part of our zoning code, think Plaza's on park, Avenue, think, sixth and a half avenue in Midtown, between sixth and seventh, fifth and sixth, and this corner of Ninth Avenue.\nI do not know if everybody understands the history of the park and trying to put it together.\nI mean the parkway was made because the builder of this building, I think it was a man named Hyman, Shapiro, agreed to do the park and then the plaza in front of the sheffield in return for the added walls that was in 1977, we can't find the original plan and we can't find with a city planning.\nI think, reasonably continued this and when we when Bosley came in with a second part that was through well, Eric was the main thing, but so was whatever you know our speaker, but he was not the speaker than he was our local city council member anyway , Some of the chairs of the community boards in between have been more generous than others, and so it's been a struggle My mother also lived in the Sheffield before it became a condominium, and so I saw what it looked like in different phases until it got straightened.\nAlso, the Parc Vendome started their facade repair and they were working they're working on the 56th street side, so they have extended a shed, and I do not know if it's a whole building or What onto the park And that's closed the play area which always which has been in disrepair.\nWe do not want to really open the whole park and since we suspect that people want the parko open or some people do, we would like to propose a compromise where we open the kiosk and the seating area for the kiosk and that we keep it somehow closed at the other.\nWe've heard that people want the park open.\nAnd she's, the one who really started the fact that the park needed repair so eric and The office was so helpful to us, because I mean Anita you're We try to work very carefully, and now we have the same managing agent that the Parc Vendome has and that we have so hopefully that's going to also help make things easier.\nI'm just going to make you a little louder, but you know what the trouble with the grasses, not only the pigeons, but there are people who take their dogs on the grass.\nYou know I do not want to go back to my history there, but I'm just wondering curious about that, and also to get back to bank parking London.\nIt does not include money, because we have the scaffolding where the Sheffield was the first one to do the facade stuff and our scaffolding went slightly, I, think Affected Anita did it affect the parking lot went into our garden area You know it's something, that's what happens in New York, because the City, Council and I'm afraid I was on it and that local law 11 was passed.\nYou, know, I think it's notable to recognize that it would be a beneficial asset to everybody along that area, not just the Sheffield, but also the Parc Vendome.\nWe could work out a deal where the Parc Vendome maintenance people would take one power washing during the day or something like that.\nWe should discuss it more with our building managers and the boards right, because now what is happening is that there are people standing on the sidewalk feeding the pigeons from the sidewalk.\nJust wanted to say when the park was open, people braised were brazen and just fed.\nYou might know this as well- is that it's essentially a public park, because it's on right on 9th avenue on 57th street, but It's, but it's maintained privately and the people who maintain it privately are not even really adjacent to it.\nNow, because it's locked up or the maintenance is not as good as maybe you would see a regular city park because they just do not have the staff or the money or the constant, attendance, and I think that's a problem.\nSo I carl might be able to shed some light on how maybe that can be rectified through a you know: It's that private public kind of thing, Carl, I think, can I add one more thing.\nThere is not a compromise of doing half the park, you know be kind, of.\nI'm, the person now who's back working on the park, so we should pull it together and discuss it, and when they we get the bids back, and I know exactly what, where the tripping hazards are, we should you should come and we can show you and Anita will be there too, so happy to do.\nYou mentioned that you were talking with your board about this, since it's such a huge cost to maintain You know wanting ownership of this park any longer, at least among some of your share of your members.\nWe've, offered it back to the Parks Department and the fact that we would pay for the maintenance, but so far they have not approved it, but that I think, would be a very good.\nI just feel like with only 40 of the student body at that high school now attending, and we do not know what next year is going to look.\nIt's the same thing and we do not even know when it's going to be open.\nWell, I can have the treasurer, explain it to you, but there is no specific responsibility, except that we have to maintain the park in accordance with a plan that you participated in years, a couple of years, ago, approving what it looked like, and that's I, remember being on the board.\nWhen is the park actually going to be open halfway in a month as soon as we repair the the problems that are that we've identified all right, And you're, waiting on bids, and for that work to happen right, but Jeffrey, the public is asking, and we can't say well.\nThe only way to solve the pigeon problem is by opening the park.\nIt was quote mandated to get closed, so we did not go in to maintain it also because the Parc Vendome started their construction and they that really made us close off the playground, part and part of it, and I do not know if you want people sitting in the park when you've got scaffolding not too far away from you.\nKnow, maintain and open this park.\nThe park with the Health department person to kind of look at conditions.\nI do not know if we have to go back to the city planning department or we have to we'll definitely be coming back to you, but I do not think that's going to happen until for a while.\nIf anybody has new stuff to add that can be considered by when, frankly, by the time I turn around the survey, I think budget task force meets Leslie, I'm kind of looking at you or Alan the 22nd The committee, needs to turn this around in the next two weeks.\nI think you're 100 right that we're going to see some shifting in priorities of keep it clean, keep it open and the rest is sort of frosting from what we can get right."
        }
    }
}