{
    "YoutubeMetadata": {
        "author": "MCB5",
        "channelId": "https://www.youtube.com/channel/UCEXyH78eAd9JcCWmmI8GLzg",
        "title": "July 13th",
        "publishDate": "2020-07-20",
        "shortDescription": "Agenda:\\nReview of the Empire Station Complex Draft Scope of Work, aka Penn Station area redevelopment.\\n\\nSee more information about the project here:\\nhttps://esd.ny.gov/empire-station-complex"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB5",
        "normalizedName": "Manhattan Community Board 5",
        "twitterName": "Community Board Five",
        "youtubeChannelName": "Manhattan Community Board Five",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
        "twitterHandle": "@ManhattanCB5",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "You good evening, everyone it's 6 p.m. we're gonna, give our committee members a little more time to join in and hopefully we're going to be able to start promptly. You hi Leila, I assume you were told that I'll be standing in for Luke, helping manage the what I've been are for this and EJ. Can you hear me? Yes, I can okay great EJ you there? Yes, can you hear me I can Thanks I have a question. It looks like in the chat I'm, seeing that one of the attendees is a member of the public that is blind using a talking computer, so I assume if they want to ask a question during that portion of the meeting. I, don't know if it's possible to raise a hand. Could we just ask them to indicate in the chat if they have a question and we can call on them that way: hey Joseph, while they're doing that you might want to take a look at the list of attendees. It looks like a lot of committee. Members are stuck as attendees and should be upgraded to panelists. Okay, sure. Maybe they can help you if you're a committee, member and you're an attendee need to be upgraded to be a panelist. Please click raise hand. Maybe that'll help you all right we're going to be able to get started good evening. Everyone. My name is Leila Lopes echo and the chair of the land use Housing and zoning committee of Manhattan Community Board, fine I am joined by EJ Calif, our skin, who is the chair of the transportation and Environment Committee of cd5, a few words about what is in front of us tonight and how the meeting is going to run. So. First of all, thank you so much to all the members panelists and attendees who are joining us tonight, we're going to be discussing the draft scope of work related to the ohio station, complex project that was published by the governor of the state of New York on July 1st of 2020. As you know, the governor is proposing a big line. Land-Use action so I'm actually gonna. Ask you not to share any screen at this time. Okay, we week, I'm gonna, ask our moderator Joseph. Can you actually remove the screen? Sharing, please sure I will do that right now. The stories that you're muted, can you hear me now Leila, okay, I would like before I continue. Further I would like to get back to our assumed page with attendees. Okay, great, thank you, okay, so no screen sharing for the moment. Thank you. We are reviewing the draft scope of work for the redevelopment of the plantation area that was introduced by the governor. At the beginning of the month. There will be a hearing held by the Empire State Development Corporation, which is the entity you know from the state of New York that has jurisdiction over this development and there's going to be a hearing on the scoping of this proposal on July 20th, so community board 5 needs to establish and develop a position on. You know what we believe the scope should be, whether it is appropriate or it should be revised, and this is the purpose of the meeting tonight. So few words about what exactly that means. The scoping phase is not a matter of Nursing or rejecting the proposal. It is really in the preliminary phase, a matter of determining what should be within the scope. What is within the parameters that we want, you know discussed and reviewed and analyzed during the other reading process, so I'm gonna ask all members and attendees to actually refrain from commenting globally on. You know position on this proposal. I'm sure we have some feelings, but now it's not the time to. Actually you know spell out those feelings of those concerns. Really we're gonna stick to discussing the scope of this proposal as members of both committees. What we are going to do tonight is, you know, come up with a set of recommendations. They will be in the form of a resolution because we need them to be actionable so that we can present them to this hearing on the yoga xx, and so we will take a vote you to actually stay until the end of this meeting, so that we can take a vote and this will become our official or official position on the scope of work. So, as the members of the community, you have received an email earlier this morning that spells out you know, sort of buckets. You know areas that we're going to be your discussing so that we don't get too scattered in reviewing this document. So the way we're going to operate is that you know there is no presentation. The entity that you know sponsor agency is not going to give us a presentation tonight. We will have this opportunity. They will come to us to give a video a full presentation at a later time, but I'm gonna make the assumption that you have all read the scoping document. It was circulated multiple times and hopefully you have some thoughts on what should be revised included, or you know amended in this document. I'm going to lead the sort of you know. Structural process of the meeting EJ is going to read the yoga discussion on transportation and transit centric issues and towards the end, AJ and I. Will you know, join forces to bring all of that into a concise and comprehensive set of recommendations so for good housekeeping just to make sure everybody understands Joseph? Who is with us tonight as our moderator, so Luke is actually away and it's not able to be with us, so Joseph has kindly agreed to join us. The process is very similar to the Windrun other committee meetings and as well as the full board meeting. Please raise your hands unmute your mute yourselves at all times and me when you are recognized to speak, you can use the raise hand button that Joseph would be able to tell you where to find it. I'm not sure I have the same of you as so, as you have on your computers and wait to be recognized before you speak, we will slice off via the conversation in questions and comments, but mostly you know we're gonna make comments, because you know we don't have a an applicant in the road to actually answer any other specific questions, and so, with all of that said, I think that it's fair, given you know the transit centric nature of this proposal to pass it on to EJ who is going to lead the conversation on transportation and transit, EJ. I'm. Sorry, just an interrupt, it looks like we have a raised hand from Clayton I, don't know it's just pointing that out. Yeah I just wanted to ask procedurally, if you could briefly explain to all of us and to members of the public who are interested if this is circumventing Euler. What it is that the process, what the formal mechanism is for this scope, you know what the nature is of the hearing on the 20th yeah, so should I make the assumption that everybody is familiar with the Euler process. Let's make this assumption, we can revisit that assumption if need be, but in essence, given that it is a state-sponsored land-use action, it is actually circumventing the Euler process for the Euler process. There would be a number of very specific set of you know: elected officials, and you know elected bodies that would review the other proposal, including the community board. The board president, the City Planning Commission, as well as the City Council in the city, would have final say with their vote on endorsing and supporting the project in that particular case, given that it is a state-sponsored project, it is very different. The final approval lies in the hands, so it is a key B P ACB, which is a board that is appointed by the governor. So it's basically you know that this board, that is appointed by the governor, that will have final say on approving the proposal by the governor there's going to be a number of hearings, but obviously the city, elected officials and agencies will not have the role that they would have in Euler. In particular, there is actually no formal referral period to the community board, we'll have a chance to weigh in, but it's not formal and codified, the way it is for Euler and obviously there will be no vote by the City Council. So those are the major differences now in terms of what's in front of us tonight, it is actually very similar whether it is for you lurk or this process. The scoping session is pretty much the same. You basically, you know you read what it is that this project is going to do to the environment, and you determine if you believe that it encompasses all the areas that this project is getting going to have an impact on. To give you a sort of analogy. Just imagine that you know it is a small project. It is a road from a small village to a larger town and the road is going to go through a forest, and the question would be you know what is going to be the impact to the forest, to the trees, to the animals to the water, to you know is that going to have any visual impact. This is a much bigger magnitude, and but the questions that we have to ask ourselves are the same. What is this project gonna have as an impact on our environment, and you know the questions. Basically, you know rise from you know, obviously transit and transportation, but you know also, as I have spelled, that in the email this morning you know socio-economic conditions, population, displacement, business, displacement, urban design, historic resources. You know all those things, so basically those are the questions tonight that we need to address and we need to figure out how we want to structure that to tell the sponsoring body what we want in the scope. Does that address? Yes, it's very helpful things. Thank you so, each if you, if you want to maybe start the conversation on the impacts to transit and infrastructure on this particular project, and then we can open up to members as a committee for questions and comments absolutely and before I guess the before I get started into some of the details. I'll just say that. Obviously we only received the scoping document ten days ago, so we're working we're working, of course, off of a limited time, so that we can put together our testimony as a board over the next seven days after this conversation to get it written up for submission next Monday. The other thing that I will resize is exactly what Lela said. This discussion tonight is about determining the parameters of the scope. The discussion tonight is not going to be what we think perfect train station looks like or what all of its capabilities should be or how we think this project should be executed, but the parameters for how that will be assessed and how its effects will be assessed. So specifics of what we'll be talking about tonight is the geographic area of the study area. The if you look at the scoping document that I provided the link for in the chat you'll see that there are 23 tasks already defined in that document, which are just general broad topics in terms of what they will look at during the environmental impact study process, which would be the next step. So what we want to make sure we're covering tonight is whether or not the parameters are appropriate or that they will study everything that it would be appropriate to study. So I wanted to give that framing before I, actually dig into some of the some of the maps and topics that would be related to actual transit needs. Just to recap what most know so far. Penn Station is the largest transit hub in the Western Hemisphere, when there's not a pandemic going on, it deals with 650,000 commuters a day. 3 train services serve the station in independent concourses, New, Jersey, Transit and Amtrak, and the Long Island Railroad Penn Station used to be a very big grand train station on par with Grand Central before Madison Square Garden was built on top of the site, literally on top of the tracks, as it is today in 1960 and then in the mid sixties. So obviously a lot of its a lot of the capabilities. This redevelopment is intended to pay for what is called the Penn complex master plan. Now the master plan has several elements that we that have been discussed and advocated for several years in which the governor has talked about in various presentations. But the master plan that this larger neighborhood redevelopment is intended to pay for is not is not set yet. So in a sense, we don't know exactly what this is getting us or what will be developed and what the new features and capacities of Penn Station are intended to be. So we should make sure that this scoping document is studying broadly enough to keep those options as open as possible. The positioning of Madison Square Garden, where it is right now directly over the tracks that serve Amtrak and Long Island Railroad, New, Jersey Transit impacts the capabilities of what can be done to continue to increase and improve the capacity. The transit capacity of Penn Station. One of the element, one of the probable elements of the master plan, is intended to be this extension called Penn, south and I'll refer probably frequently to the map that you see on the page 3 of the scoping document that outlines the project area in a red dotted line. What you see on the block south of Penn Station there, which the map calls site 2, is where this new pens out expansion would take place. The governor's intention is to seize that block via eminent domain, raise it, extend the train station and new tracks underground throughout that block, as we assess this we're also comparing to previous version of this proposal that the governor provided in January you'll see on this map that there are other sites, including the site, one and site three to the east and west of that site to block those were not included in the earlier presentation. But it Sene clear is that those being in scope would probably very much be required from a practical standpoint for any new tracks to be installed on that site to block there would need to be runway on either side for the simple practical usage of those tracks as new transit capacity for the station. So we suspect that's very much why site 1 and site 3 are included here and why there are new additions on top of what the governor outlined. Maybe six months ago, the current location of Madison Square Garden, sitting on top of the current tracks, severely limits any capacity expansion that could be done with those with those existing tracks. New tracks will probably be wider, bigger new grade much better than what then n tracks were that were built in 1910 like we have now. But, however, whatever gets added through Penn South, the current tracks would not be able to be upgraded significantly as long as Madison Square Garden sits directly. On top of them. There were additional pylons and support structure that come right down through the train station cropping up the arena, that's literally on top of it. Some estimates suggest that, even if you did a dramatic refurbishment of the existing tracks around those pylons, you could still potentially only add 15% or so capacity. It would be very much infeasible to redo the tracks in a way that widens the tracks for four different grades of newer train vehicles to widen the platform's to make them safer than the very narrow platforms that you kind of weave your way through when you're in when you're down in the tracks of Penn Station now and to enable what has been called for many advocacy groups for many years, which would be through running very quickly in a nutshell, through trains coming in from Jersey like New, Jersey Transit, come all the way into Penn Station and then have to stop and leave back the direction that they came and because New Jersey trains only come only come in from New Jersey and then go back that way and very often they're, coming in full of people and they're leaving empty, because in rush hour hours, people are headed all in one direction, etc. Similarly, Long Island, Railroad trains come in from Long, Island, load or unload, and then leave back in the same direction through running would enable much higher capacity and much better efficiency by say allowing those train systems to work together. So that one train comes in from one side: unloads its New Jersey passengers, loads up with Long Island passengers and then continues on in the same direction. That's a dramatic simplification, but that's the kind of improvement that, by being able to actually reconfigure the tracks, would dramatically improve the transit capacity of the station. So the context of what the scope makes possible for the garden is going to be very important in terms of considering the capacity and future improvement that is open to not just the aesthetics of being inside Penn Station, but also actually continuing to increase the capacity of Penn Station, which of course, I said 650,000 commuters a day. It's already supporting three times the capacity that it was even built for in the 60s. So with that in mind, I draw your attention to what the map calls site. Six there have been in. You know various news outlets over the years. Many different speculations about what kind of redevelopment Penn Station could see in the future again, and we don't know yet what the master plan will call for. But we want to make sure that the scope that we end up with as part of this scoping document and then the environmental impact study leaves as many options open as possible. One proposal that came up I think very recently in a Gothamist article and via some other advocates, was whether or not these two blocks just to the north and east of Madison Square Garden. What on here is called site? Six, seven and site a could be redeveloped as a not just redeveloped here, as is being proposed for new towers or new office space, or whatever is kind of vaguely alluded to in this document so far, but also for a potential new location for the garden that is leaving as many of those options open as possible is one reason why it's somewhat not suspicious, but detrimental for that whole block. That's considered site six on this map to not to be included, and it was in fact outlined fully by the governor's last presentation in January. So it would seem that there's a very strong argument for saying that a bare minimum, it's kind of stupid to only include half of a block in your environmental assessment, since the other half of the block is going to be inextricably connected to whatever the effects of redevelopment are going to be that full block was included. The last time the governor talked about this in January. So it's already part of that conversation and that a lot of the proposed improvements that Penn Station would truly benefit from not just aesthetically and having a train station. You know with a ceiling higher than 80 going forward, but to actually improve its transit capacity and in future development, creating capacity to move the garden somewhere down the road. It's the political will and the financing appears for it would be a very important part of the scoping document. So I think there's a very strong argument for that entire block to be included, as it was in the in the presentation back in January just real quickly in the realm of local transit. We know that they've created the bus lay on 14th Street they're talking about another one on Fifth Avenue. Next up for do T's attentions are probably Street other crosstown streets like 42nd Street, like 23rd Street, like 34th Street. We should make the argument that 34th Street should be assessed as part. You know it's right there it's going to be affected by the development here it should. It should be part of this discussion as well. Obviously, some of the project area- abuts 34th Street, contains half of 34th Street. There could be an argument that the redevelopment on the actual Macy's block and going across 34th Street could be part of the part of the discussion as well, so that in sorry to go on for a little bit, but that, in a nutshell, are kind of all the interconnected implications of why this why some of these project areas seem to be defined the way they are on this map and why I think there's a very strong argument that extending the project area to contain the rest of that block that contains site six is probably something we want to push for very strongly, because it was part of the conversation already and because it's not doing so I think severely limits our understanding of what can be done and severely limits the possibilities of the types of transit improvements that are going to be possible and with that underscoring of some of the issues. I know it's dense and complex. But those are really very critical. So we're gonna stay on the topic of transit and transportation, and let's open up the floor to our members of the committee, for you know what we're gonna. Actually mix questions and comments, given that we don't have a presenter, it would be a little artificial. So please use the raise hand, button and go ahead and shrink your comments or questions. Do we have any questions or comments by members of the committee's on this particular topic? Okay, let's go with Mike, really Mike go ahead! Hello. Can you hear me? Yes, we can hear you all right. We include the subway stations on 8th, Avenue, 7th Avenue and 6th Avenue in the transit I. Don't know that would be considered part of the Penn complex master plan or not, but there should be something from the MTA about how they want to improve those stations included in the in the plan, yeah I J. What are your thoughts on that? Do you think, yeah and I believe that they are included in the scope significantly already, if you go to, if you go to page 14 of the scope you can see, and they do seem to conflate Penn new Penn, Station entrances and relocated subway stairs. Certainly, the geographic areas of all the subway entrances seem to be inside of the project area and there are various proposed new Penn Station entrances, as well as relocated, subway entrances. The plan itself. You know how many I'm, what the actual configuration of these entrances ends up. Looking like you know, is part of the part of the master plan that we have not. We have not seen yet, but certainly I, totally agree that the implications on the subway should be part of the scope and if we, if we suspect that this is that this map and these sites as identified, are not inclusive of that then Mike. We certainly should propose improvements. The master plan does not at this point, seem to be creating any new subway lines or subway capacity or and to affect local subway transit in any sort of specific way, but certainly the entrances and the capacity should be part of that discussion. Okay, just to be on the safe side, we will add it as a recommendation so that you know we clearly tell the sponsor entity of this project that you know the it should be assessed in the environmental review process. Mike go ahead. Do you have other comments? Sharon, yeah and the pedestrian part of the transit is a different aspect. Okay, Clayton. You have comments. Go ahead. Yes, so you tell me how this is relevant. I the whole thing of scope can be so baffling because you have to be. We have to be so careful to make sure things are included, because if it's not, we are screwed after the fact. My number one red flag is about Madison Square Garden, as you both have alluded to community board. Five in I think it was February of 20:13 past the unanimous resolution to recommend not granting a permit in perpetuity for the garden to operate in response to that city council agreed with us and they got a 10-year permit. Can you help me understand just because the block is in scope? What further might we have to do to explicitly call for the consideration of relocating Madison Square Garden to meaningfully improve Penn Station? That's my main question yeah. So I think this is so significant, so important that we gave it its own bucket, but you know it I think it's fair to jump on to it. So currently, although it falls within the parameter, you know that the perimeter of the district that is being proposed for the year the land whose action it is actually not part of the action, the same way as EJ, explained the transit below grade transportation. Improvements are not part of this project. So if it is not part of the project, then it cannot be part of the scope right and if it's not part of the scope, it's looking to be evaluated and if it's not evaluated, then it cannot be commented on and it cannot be acted on. So it is absolutely essential and crucial as you're underscoring it Clayton that we do ask that it is included in the scope and that becomes a part of the proposal. So I think it's. You know it is very critical and especially that when I'm going to be doing this every ten years, you know this is our shot. We have one and that's it, so we need to make sure that it is within scope. We need to push very hard that it does happen. You know that it becomes part of the consideration and that you know, hopefully it will be acted upon- were not going to redesign this whole area anytime soon. So it is very critical to make it part of the proposal, part of the scope and that it is are evaluated. Perhaps maybe- and you can tell me what appropriate Leila one of the final tasks is to assess alternatives. Task 21 is labeled alternatives and there are some. There are several standard environmental impact alternatives that it lays out specifically saying that no action alternative needs to be evaluated. A no unmitigated, significant adverse impacts, alternative, a reduced density, alternative I, wonder how specific we can get in asking in saying that alternatives should be included as well yeah. So because this project is so big, it is basically it would create 20 million square feet of additional rights. I repeat: 20 million- it's like unheard of you know, is especially for such a small area, small perimeter. So because of that, then we have the ability to demand that other alternatives be evaluated, and this is where we have. You know a good opportunity to make the case so I think that you know whether we say that you know it should be an alternative, or it should be added in this particular proposal. As a revised proposal, honestly I would leave it up to the Empire State Development Corporation to decide which route them. What they want to take I would prefer that it is partly that it is not an alternative, but that it is the proposal. You know that the proposal sponsored by the ESD is a proposal that calls for the relocation of the garden that it is found that it is thought that he not just an alternative, because typically alternatives are studied their environmental impact study, but that doesn't mean that we're gonna go with the alternative more likely than not, especially in this political context. We're gonna go with what is in front of us, so we want to make sure that what is in front of us is something that we like enough. You know the goal once again is not to you know, scream and yell and say that we don't like it, but it's really to make it better so that we can like it. You know the ideal scenario is that in the end we work closely with you know the different stakeholders, so that the proposal you know gains cv5 support, that's readable, and this is something hopefully that you know we can start to shape now. So I think we absolutely need to call for alternatives, but the you know areas where we really want these changes to be included. I think we would ask for them to just be simply deemed in scope, that's helpful and for what it's worth I agree, 100% with making a strong statement for it just being fully in scope. Clayton did that address your question comment. Yes, thank you. Okay, John rebar, thanks Leila, so I had a couple of notes that I thought I'd like to bring to everyone's attention. So one of them is about the station flow. So it says in the document that additional public transportation improvements under consideration include creating a below grade, east-west corridor between the 3rd Street 34th Street, Penn Station in one to three lines and the 34th Street Herald Square subway stations, and it doesn't make any suggestion that this would include the creation of a free transfer opportunity between those two stations and I. Think that is something that we should raise, because I think that just having you know an underground long hallway that doesn't provide the opportunity to transfer between those two stations without having to swipe in a second time is just something that I think we should raise, because it's not clear the document and then additionally, in terms of station entrances, I'm sure that a DA accessibility will inevitably be a large part of this scoping document. But in the end, I could only count one new elevator that is going to be built at in this entire project. In terms of you know, subway station accessibility at the 1 2 3 stop for the 4 34th Street, Penn Station, and you know just because you know niente is already very slowly, adding more ad a accessible station access throughout the system. I just think that this project should also do more than what could be. What I would describe is like the minimum requirements in terms of improving station access, because it seems like there's only going to be perhaps one additional ad entrance created. Ok, I, definitely something that we can add in the scope of the proposal, any other comments or questions we're going to try to really stick to transit and transportation. Before we move on to the other areas, members of the committee, especially the Transportation Committee, do we have any comments from members of T&E who wish to make some comments? Okay, seeing none. Let's move on to so one area that I think is important for us to consider is actually funding. So, if you, if you look closely at you know the way the proposal is structured, the wall really of this redevelopment is to actually provide I mean. One of the goals is to actually provide funding through this observing mechanism. That would then you know, unlock capital that currently doesn't exist to actually do those transit upgrades that part of the of the master plan once again, just to make it very clear and reiterate what EJ said previously, the master plan is not what is in front of us okay, so we don't know what the master plan is going to be. All we know is that there is a big land use proposal and observing where the governor purchases lands in these areas through eminent domain or negotiation, and then observes these areas, meaning that he basically creates additional allowed density, and he sells this density and through the proceed of this sale, this will finance and fund the below grade improvements. So you know some have actually made the analogy that it's using. Basically, you know our air arrives, and you know our air and development potential is an ATM. Where you know you don't have the cash, so okay create additional density. We sell this density and that you know, creates funding. So there is a case to be made given who the stakeholders are, and in this process that you know maybe alternate sources of funding should actually be considered and that could dramatically change the scope of this proposal. If all of a sudden, you know we were to find eight billion dollars, which is you know what this project has been slated to generate and what we're told a massive plan will cost. Then you know if we were to find eight billion dollars. There would be no need for this particular development. Maybe there's a case to be made for an observing I, don't know, but certainly you know this particular project is really being put in place to raise those funds. So, as EJ described the you know, the stakeholders are New, Jersey Transit's, so it's the state. It's the neighbor, it's New Jersey the Long Island Railroad. This is MTA. This is New, York, State and then Amtrak is federal and Amtrak happens to be the owner of the train station. Okay, so you know complicated for complicated reasons of ownership. Amtrak federal agency or federal entity is actually the owner of the train station. So I think there's a case to be made that you know and given the prominence of the station, that is, you know a regional hub and given the prominence of the region has national implications. There's a case to be made that you know this project should be funded with federal money. Once again. If it were to be funded with federal money, then they would donate for this particular development. So I would like to have us consider you know, adding the funding as in part of the scope and that the scope should basically be revised, because more federal money should be poured into improving Penn Station rather than you know, creating density that would basically be negatively impacting community about five. You know with additional traffic and shadows, and you know, impact force by additional density while it would not really benefit us directly. So you know I think the scope should be revised to include that language, but I would love to hear your thoughts on that and, if you guys don't share any thoughts, I will assume you agree. Okay, no thoughts. Anybody wants to add onto to this topic of funding. Okay, seeing none Oh, Chris yeah Chris go ahead yeah. This is a question and not necessarily a concrete suggestion, I'm a little confused about that is. Regarding funding that we can actually say, because my funding question clip, as you alluded to, or not actually about this scoping document itself, but about the master plan. More generally, is it possible for us to have to look at alternate ways of raising revenue, particularly through taxes, to have that be incorporated in the scoping plan or because that touches on some remastering rather than and the sound quality is not excellent, but I think I gathered the gist of your question, so we can certainly do that. Basically, in order for a project that is state-run to basically be considered, the state- or you know like the public entity- needs to demonstrate the need for this particular project. So if we can say well actually the reason why you're doing this land-use development is to generate funding, but actually you can get your funding elsewhere, whether it is two taxes or through you know, federal funding, or you know two other mechanisms, then the need cannot be demonstrated in the longer- and this is part of you know this would be determined through. You know the scoping process, so at that stage we're not really in a position to say where the money should come from. I personally believe that you know given who the stakeholders are there's a strong case to be made that it should be federal, but certainly you know, other forms of funding could totally come into play, but right now and once again, we're not really commenting on the marriage. We'll have an opportunity to do that, but what I would like to include is to say you actually have a challenge and the burden is upon you to prove that you need to do this project that it is necessary and we believe that you can get money elsewhere and that we community board five should not be hit with the full burden of generating the revenue so that you can do these upgrades that you know I, think everybody agrees that you know. Penn Station needs to be modernized and improved. I mean there's a great need. Nobody, you know object to that, but the way it's being done is problematic and the source of funding can be replaced, and you know so. Basically, this is what you know. This comment would do at the scoping phase. Does that your question? Yeah I think I'm, sorry, but I didn't get it for the yeah. No worries, I, think that you know what everybody I mean. You know. Completing the whole process is pretty. You know deep and intense, so yeah I know totally Vickie our board chair go ahead. Leah I just have a question just for clarification on process. Whatever we make is like the change in funding that you are suggesting. Do we have to give a long explanation holder? Do we just request it? You gave a lot of good reasons why we would like that. Do we in or is it just a request for alternate funding? I think we need to be as specific as we can so that our comments are not lost in you know the thickness and density of you know all the comments that the agency is going to receive. You know, obviously we're not going to be the only ones commenting, so we want to give as much of an argument as to why you know. Once again, we need to explain why we believe that funding is part of the scope, and you know it was part of the school because the because it's a public project the entity needs to demonstrate the need. You know it's not like. Well, you know when individual wants to, you know, develop their land, and you know it's a private development and here because it's public, they need to demonstrate that you know this is the need that this is the only way to achieve this goal and that there's no alternate solutions. That would be less impactful. So if you can make the case that well actually, if the you know I, don't you know if the president were to you know see this project favorably. You know, like the master plan for redevelopment of Penn Station and we're to you know generous me, decide that there's going to be a eight billion funding line in the next federal budget, then the need for this particular land-use action would disappear. Now there could be another rationale. You know I, think that I think density to this particular area is, you know, pretty sensible, but this particular project would no longer be relevant. Okay because they also, in addition to talking about the redevelopment, the reason for it being fundraising. They, the proposal, talks about the need from office space and the need for better buildings and a more you know, a better environment around Penn Station. So it's a combination on their part I mean the main reason is the money, but they also bring in a lot of other what they think would be viable reason for the redevelopment absolutely I mean they mean those as benefits that we should look forward to. The reality, though, is that you know the governor is not in the business of redeveloping blocks of New York City. There has to be a broader purpose for the governor to you know, use eminent domain, I mean if the. If the state is the owner and for right of you know particular sites, you know they may have jurisdiction. I think that's! You know it's totally fair, but in this process this land belongs to private owners. Who are you know, residents and stakeholders of the city of New York in the city of New York has their way of doing business, I mean if the Department of City Planning believes that there should be resumed. It could be. You know, City, driven. The reason why it is state driven is because of the you know, the state regional implications of the transit upgrades and the reason this proposal is being you know, put forth in front of us is because of the need for funding, because there is no funding from the state of New Jersey, there's no snow funding from the state of New York and there's no funding from the federal government. That would be sufficient to basically go ahead with the master plan. That's the rationale for this particular proposal. Okay, thanks I, see that max mark good Matt go ahead. So sounds like it's Vicky's kind of question. It was. How do we I think? How do we sort of very succinctly talk about what the issue is, and is it accurate that it's the it the cost? The cv5 is really into this or FA are that is the size of these buildings, and could we ask that? Could we put something in there that talked about just any indication from any other agency outside of or if it is inclusive of the city? That says there is a need for this. Otherwise it's it seems like they're kind of goal. Number two is the only reason they're doing it, which is on page 12. That just says it's getting developed to fund this specific, just a fun. It's a fun pen station, so I guess so. My question is there something that we could point to that says there is not a need or there's a need for development up to X amount. If I or that's not 33, they should do well. We can get into the you know details of how much if they are as far as how much revenue that would bring the reality is that we have not been really provided with this information. We don't know what is going to be the funding mechanism. Are they going to sell these fa ours? Is it gonna be a bidding? War? Is there gonna be a RFP to purchase these FA our is there I mean who's gonna, be the agency representing this density. We don't know we don't have the answers to these questions. So at the moment we know this document and you know they're working with city agencies, whether it's the Department of City Planning, the OT. You know probably other agencies, if it's possible, but these agencies are not on record one way or another saying you know whether they support or have you know, caution about the proposal. We don't really know so. I think that it's you know it's fair to say there should be other forms of funding and therefore the need for this proposal would be you know putting in question and therefore the scope she should be altered. Does that make sense yeah. Thank you for covering that okay, wait! Clayton. You have another comment and then I think we should move on because we have much more to cover, but Clayton go ahead. Well, when it comes to funding one other thing that I'm wondering if we can work this into our recommendations, is the cannibalization of incentivizing commercial space from East Midtown. We spent years and years helping and participating in the advocacy for the East Midtown rezoning, not to mention Hudson Yards and the city has spent many years, justifying those efforts and identifying Hudson, Yards and East Midtown as the two most critical areas in need of incentivizing commercial, real estate development. So, given that, how does that affect what we can advocate for? If the argument now is we're gonna use this completely different area to raise funding for these much-needed blah? How is it impacted? How would that demand be impacted by what we have spent years, claiming our priority was, which is East Midtown and Hudson Yards, especially given now that we expect, with kovat, for the demand in general to plummet, citywide yeah, how? What language can we use to meaningfully include that in a recommendation? So this is that is actually a pretty big bucket of your urban design, historic resources and socio-economic impact. So in reality is it is a social economic impact, social economic impact. You know the most obvious is, for example, you know direct residential displacement, which actually will happen and is going to be studied and more likely than not will not rise to the level of significance and I will explain that in a moment. But then there is the you know the business displacement the number of businesses are going to close because the buildings are gonna, be sold and demolished. You know some local stores and office space is going to disappear, but further than that as you're saying it is basically going to create a you know, influx of commercial real estate in close proximity to others, you know so mean orchestrate some in import for, and it is perfectly valid to wonder if it's legitimate and certainly it should be evaluated so I think it's totally fair to actually ask that this becomes part of the scope. So unless someone has further questions about the funding, I think we can move on to the next bucket, which is going to mediate urban design, historic resources and socio-economic impact. Maybe we can stay with the socio-economic impact, I think Clayton. Your point is very well taken. I think it's important that we include you know impact like role impact to do the commercial real estate market. We don't want a cannibalization effect. Are there any other areas of displacement and business and residential impact that you believe should be included in the scope? So some community board members have their hand raised, but I just want to say to members of the public, because I have seen a couple: people raise their hand. We will have a section of the meeting where you can speak if you're, calling and there'll be a way for you to raise your hand, but for now we're only having community members community forum members participate thanks. Sorry, Leila, Thank, You Josette. For this reminder, yeah we will open up the floor to two members of the year of the public and those I see that Dave Achilles has his hand up Dave go ahead, yeah I'm, not sure this is the proper place to bring this up. But whenever we've seen these huge developments, we've been concerned about hospitals and places for the homeless and around transportation hubs like Madison I like the garden and the Long Island Railroad and Penn Station, there's always a homeless situation and I, don't know if this is a proper place to insert something about our concern with this massive huge development of office space there's some concerned be made for the city in general in terms of homelessness, yeah, I, think I. Think it's a very good point and currently I didn't see any language. Addressing this specific issue of homelessness and in hospital needs and I think that it is very important that it is assessed in the environmental impact statement. I see that Jordan Goldman has his hand up Jordan. Thank you. I wasn't sure where to bring this up again, but I thought this bucket is probably the most appropriate. So what extent should we consider coordinating with community board for when it comes to these issues? We're of course cv5? We have our own concerns for our own community board, but it's a shared space and my concern is given the number of stakeholders. If cb4 says something slightly different from cv5, will that cancel out? It's just a more of a process. Question not the specific yeah, no I, think it's a very good point. So the broad office and the board leadership is. It has actually reached out to see before I think that you know the contact and communication with them has been a little bit slower. Given you don't know whole set of circumstances, you know it's the summer or the mimic, but we Somy intend to work very closely with them right now. You know, given that we're providing only 20 days to put together something we felt that you know really important to organize this meeting and you know get a set of recommendations, but our goal. Our intention is really to work very closely with them. Similarly, to the way we worked with other community boards in the process of Eastman I think that you know there's strength in numbers and you know they probably share a number of our concerns, and you know they are technically less impacted because what's happening is really in our district, but actually their board has been like a member of their board has been appointed to the CAC, which is the Community Action Council that the ESD has appointed as part of the review process of this of this proposal. So they are involved- and you know the governor wants that and we won that too, and we want to work closely with them. You know some. You will certainly in a draft of you know this recommendation that we're gonna put together tonight and you know going forward. Hopefully we'll have a little bit more time to you, know better organized yeah, absolutely I figured thank you yeah. Thank you. Bj. You have a question. Go ahead, nextly! Look. We should all the information. I'm sharing I have a couple but multi-pronged comment: question one: is it only commercial? That's gonna go up council office space or is there any opportunity? Are they looking at affordable housing as well or mixed-use? Okay. So currently there is, it is not part of the proposal. Actually, if you look at the numbers, the incremental difference between the no action and the action would actually bring the number of additional residential units to basically zero, so they're planning to develop zero residential units. That being said, the my understanding- and you know the many unanswered question at this point, but my understanding is that the zoning, the underlying zoning of the area, would be commercial and therefore, in a commercial district, a residential development is as of right, so it could be a possibility that one of those sites would become resident and as such, it could be market rate or affordable, and, as such, the impact of these residential developments are entirely excluded from this environmental study, meaning that you know if a building were to be residential. You know, let's say a large residential building gets built. There would be no environmental impact study on the effect on local schools. You know possibly creating overcrowding, the access to park and open space. All of that is inside a excluded. So this is something that we may want to ask them that they consider adding. You know the possibility of a scenario where some of these Lots would become residential, but as of now it is not part of the proposal and then I just want to tack on into the transit transportation piece. Where about you know: I'd like you to go to any other countries like Paris, Korea, Japan, the side. Edges are multi languages, and only in the u.s. can Penn Station, and we don't see that we only see one language English. So at some point to be able to say, you know make those signage is available, especially if you want to make the city recovers from you know: Koba 19 and more tourists coming but related to that. Well, it could. This would be more on the proposal itself and not really in the scope of what we believe should be assessed to determine. You know the environmental impacts of the development, but I think it's definitely something that you should be advocated for I, agree right and then I don't know if it's within the scope. But one of the comments is like if they're making this commercial, you know you saw the success of Columbus Circle subway station, where they have an underground all those shops. So this could be an opportunity if they're expanding that corridor, an area to really offer to both minorities and WBS people for those opportunities right to open up businesses and I'm tacking on to what David said earlier, there's so many homeless as it is even outside now, 13 14 17, a in that open space, there's so many homeless, people there so I think again, there's going to be an incredible amount of you know displacement as well. As you know, people that are going to be weather business, suspend both homeless, that's going to displace. So it is a concern as well. Thank you, yeah, absolutely so, making recommendations on specific uses. It's not part of your scope, but definitely the impact on displacement to the homeless population should be studied. That should be added in recommendation for the scope. I see that Chris Hanna go ahead. Yes, so I have a two questions: I'll start with the first, which is actually related to the homeless issue. They call out typically the Antonio Oliveri 12 in center. That's one of on one of the blocks that was made into penthouse, and this is my first time giving comments on a scoping document. So I'm not sure the language they have is just sort of typical language, but it's rather fun committal. When it comes to whether they will recommend some sort of strategies for mitigating that walk, I'm wondering if there's anything, we can do to ask for a more firm commitment that they will actually propose some solution, because I mean if the plan goes through with getting demolished. So it seems like it's a concrete thing that will need to be addressed and I am concerned that they would find an excuse not to propose a mitigation strategy. That's like the special yeah. It's actually. The whole process is the environmental impact statement is a little bit of a dance and a little bit of a you know. Artificial exercise where basically criteria are set, and then, if you are below the threshold, we recognize that there's a negative impact, but it does not require education. If you're above the threshold, we recognizes the negative impact it has to be mitigated, but at times there are negative impacts. That cannot be mitigated and the project still goes through. So you know right now we are at the beginning. We need to make sure that all these issues are in scope and something to keep in mind is that we can ask, for you know specific. You know issues to be added to the scope. For example, you know we want to add Madison Square Garden. It should be within the scope, but we can also say we don't like the criteria that you're using. We believe that your formula is inadequate and we believe that artificially deciding that moving less than 200 residents is below the threshold and therefore it doesn't have to be mitigated. We believe that you know moving, you know relocating any residence is a problem, and this is where your threshold is so we can certainly also you know, make recommendations on adjusting the threshold. So I think that you know, in the case of you, know the homeless, population and some of these social services that are very important. We can say that you know, even though they don't, you know they fall under the threshold. They should be mitigated and a solution should be, should be found for these institutions. Great I would be very supportive of including something like that, and that actually leads directly into my next comment, which was about the direct residential with displacement, so that was one of the places where it did not meet their thresholds for consideration, because they're not creating more than 200 units. I think that we should ask them to still include the and most mitigation plans for indirect residential displacement, I believe the direct residential displacement. The figures will also blow their thresholds for what would necessitate a review and they are voluntarily choosing to include that in the review anyway. I think that we should ask them to extend that to the indirect presidential as possible. Yeah I will heartedly agree. I think that the residential placement assessment is quite interesting, because buildings of residential buildings in this particular area is very specific. You don't have luxury there for many papers. Some of them are when stabilized. So the displacement is not just you know. Oh well, you know we're demolishing a couple buildings that you know. Hopefully these people can, you know, go and live another block in the vicinity. The makeup of this you know, residential stretch of Manhattan, is very specific and really cannot be replaced, or you know, found anywhere else. So I think it's. You know, for those reasons very important to our to add language. To that totally, do you have any other comments on that topic? Chris other comments on this topic: socio-economic impacts, okay, seeing none yeah Jordan go ahead and I'm actually just I saw I was reading the comments. It looks like July yeah as a member wants the comments, but can raise her hand for bringing that to my attention. July is actually not a member of either. Is she among the attendees Joseph? Yes, okay, all right, given that she's, a member of our board, we're gonna, bring her in among the panelists and if any of you board members of City five wish to speak. Just let Joseph know so that he can bring you into the panelists room, so they July go ahead. You're recognized thank you for recognizing me Leila and thanks Jordan for catching that so I have two comments. One is based upon and I'm not sure if this is the appropriate stage to bring that up, but certainly we could. If the committee members agree, we could request for CB, 5 and CB for residents businesses to receive priority consideration in building this project. It's a very big project. There's gonna be a lot of jobs created in the 16 or so years. In the estimation time, so that's my comment. Number one comment. Number two is. It is true that the area has relatively few residential buildings, but I happen to live in one I am NOT 29th Street between 7th and 8th values, so Penn Station, South, Side -, is one block away from me. I am considering moving knowing that there will be construction in the next 15 16 years, pencils, development d, what used to be the mitchell-lama building, which turned into a very successful co-op, which ranges between 8th and 9th avenues and 28th Street and 23rd Street? That's the that's. The development with a number of buildings, probably I'm, not sure exactly number of units, but no less than five eight hundred units. How is the project going to make sure that the demolition will be done in a safe manner, not only to call not only to not cause health concerns for the passengers traveling through Penn Station, but also the resident who households that will reside in the area in the next 15 years? That is a very prolonged exposure, yeah. So definitely the health considerations are, you know, considerations that can that should actually be part of the review process. I am not sure how far around the development sites the review process I'm. Sorry, the review process is going to go. So definitely this is something that we should make a recommendation so that you know it's not just impact those blocks that are being redeveloped, but also the you know the neighboring properties. So definitely this is within scope. Thank you. Other questions, comments by members of our committees. Okay, so seeing done we're gonna keep moving upon to the sort of like bulk of what is in front of us, which is the urban design. So to you know to try to put things in context. You know, as you can see, on the map, you know the proposed area for redevelopment is actually fairly small. You know it's a total of you know like five o'clock six blocks, you know, depending on how you count, you know, half blocks to half blocks, make a whole block. I don't know, but it you know it's much smaller than say: Hudson, Yards or eise Midtown. It's really, you know very concise little area. This area is going to receive the permission to build density, to build fer that has never been seen before in Manhattan. Some of these buildings will have a 33 F. They are so what is fer stands for floor area ratio and it is basically the of square feet at the ground level, multiplied by the ratio that has been determined. So in that case you take basically the base land and you multiply it by 33, but of course you don't have to build a monolith that could be 33 stories and covering the entire. You know plate of your land. Typically, you know, as you know, buildings tend to have these recesses and let's say you know, for the sake of the argument that would cover only half of your land. Then you would have a 66 story tower, but if you get creative you would have a 80 story tower or a hundred story tower. It is evaluated at with that type of density. These buildings would be a thousand foot tall, probably 1500, and probably even more. This density has a potential for creating the tallest building in the northern hemisphere, in the Western Hemisphere and probably in the entire world. So and this area is already pretty densely built. You know it's not like this, no other tall building in the vicinity. So the question is: how do you make it work? How can you fit such a huge density in an area that is already pretty dusty built and what impact is that going to have on your surroundings? So one of my big concerns is actually impact that would have on your prices. Okay, you know it's one block away and you know shielding the view corridor on to what some consider to be the most important or most significant landmark in the world is really problematic. So right now the environmental. The scope document suggests that there's going to be a review of visual resources, but I think it's really important that we spell it out and that going further. You know it's only just make sure you don't block the views of the Empire State Building. It's really, you know comprehensive design on. You know how you make it work, how you fit that's that type of density into the area. So my recommendation in db2 had specific language to you know the view corridors onto the Empire, State Building, but actually mats did some research for us on other significant landmarks that are considered. If you currently, you know visual resources, so I think you know we should look into those, but I would love to hear other people's thoughts on the urban design and the impact that that's gonna have and I see that Dave Achilles has his hand up Dave go ahead, yeah for the incredible amount of GSF on this project. The public space seems like next to nothing the public amenities, a it's just amazing. So if there was something that these buildings can do, instead of sheer office space to become offering more to the public other than the obvious transportation of but other than that, because it seemed to be much in the way of public amenities as it stands now, yeah very true I mean they were proposing one tiny, little Plaza green area between two very large buildings and the existing 33rd Street closure would remain. They count that as a open space, but it already exists. So it's not an added benefit. Other thoughts on the density. Clayton go ahead. I have a question about the park land that would be, in essence, a shadow by these developments. In this case, we're really talking about most nearby Harold and Greeley Square. Actually, but I do wonder if, beyond that, 33 SAR I mean would this hit the other parks in our district I know that shadow. You know the language is there already that the trigger a shadow study and they look into mitigations or whatever, but the language seems very obtuse to me and I'm really unclear about what would be required. Were they to determined that a shadow would fall on the district, which is obvious? You know it says we would then investigate mitigation, it's like well. That is not a commitment. What does that mean? So one thing that I would want to ask is: how can we try to nail down with more specificity which of our open public spaces, some of which are new york city park? Land would be cast into shadow and what is the midok? What is the mitigation, if any that we believe would be commensurate with that impact yeah? You know I think it ties to making a threshold recommendation where you know it's not only necessary that the shadows study, but that thresholds for mitigation, be you know, meaningful and that this mitigation also be meaningful, because right now the mitigation that has been offered on other developments is actually just saying. Well, so it's you know, I think we need to say that if indeed there's gonna be shadows on open space, it has to be mitigated in a significant way, which is basically be massing, the building so that it doesn't cause so much shadows well and actually Leila to that end, is there a way that we can, as we have in the past, in a normal Euler process, call for shadow impact studies for Bryant Park for Madison Square Park for anywhere that we think that this degree of FA are might actually impact. It's clear that the pedestrian, plazas and Harold and Greeley Square will be impacted by this, but I'm curious also about the other parts in our districts. Is that something we can get and just go? Yes absolutely so it should actually be. You know part of like the standard review, for you know the development of that size. They should basically do a shadow study and tell us exactly where these shadows are gonna hit, so it should already be in scope. It I think there's no harm and you know reiterating that we have this expectation and I think it's fair. Also to add language on. You know what litigation it should look like and what we believe the threshold should be. We also have our intern from Renee Kinsella I'm, just letting you know. Yes, let's bring reneik and so on. Okay, she went down the list. Let me I'm your one sec. Okay Renee. Can you speak? Yes, hi Thank, You Leila, just a question with this density? Will these will the builders buildings be allowed to sell any of the air rights? We don't know. We don't know how this part of the funding mechanism is gonna work. We know that you know, there's gonna be additional if they are and that this additional city is going to fund, but how you go from one to the other. We don't know. Can that can some sort of mechanism to ensure that the air rights don't land in other parts of the city, a part of the scoping process I didn't think of that? Oh my god. Oh my god. Yes, we should. We should certainly mention that we have every expectation that you know these. This new added density can only be built on those sites. Very good point, very good point, because yeah very good point yeah. Absolutely thank you for bringing this to our attention. It could be absolutely terrible loophole. Otherwise, do you have any other comments or questions Renee? No! Thank you. Okay. Thank you. So much Chris go ahead. The Midtown rezoning says that buildings were allowed to exceed the FAO if they undertook improvements to subway and surface-level subway improvements. Do we know if that part of those the package, and even if we don't know, would it be possible for us to request the consideration of what it would look like? If keeping all other elements in place, they were not able to see that they are specifically for surface levels. Improvements like subway station entrances that they would presumably already be building in their commercial buildings yeah. So work is a little bit different. Basically, in an East Midtown, you can increase the density of your development by using a base density which is 15 on which you can add added density. Through various mechanisms. You can purchase a rights from historic properties, including st. Patrick's, Cathedral, Grand, Central, Terminal, the central synagogue or st. Bartholomew, and you can also get transit upgrades and there. So, basically, you can build this, an added density up to a 30 Fe or you cannot go above 30 if they are ever it's not permitted. But in order to accomplish that density you need, you know, to either buy the rights which you know they're already existing and it's you know an outlet for these air rights to be used somewhere else or to do some transit upgrades which have been listed and identified, and you know basically, if you can make the case that you're gonna do you know, platform enlargement and adding your an escalator and building a staircase and launching a staircase or you know something substantial, either on-site or off-site. Then there is a determination that needs to be made that yeah, okay, you know it is worth a you know to if they are or three-fer, and this is how you build your added density. So it's not really a you know you get. You know 100,000 square feet of additional development rights and you pay that much in exchange it is you know you provide these upgrades that the city has identified as being necessary and then you get the permission to build more density and you also have to contribute to a fund that serves the public. Well, so, with the fund, basically pulls all these resources. From all these developments and this money is used for ad grade development, such as you know, closing a street beautifying or creating a better sidewalk or you know other types of projects in the particular case that is in front of us, it is different. It is the state taking away property, knocking down buildings, generating and absorbing selling these air rights and with the money. Once again, you remember that the goal is to generate cash. The goal is not to you know: okay, we give you the you know you developer, the prerogative of you know doing that upgrade and in exchange you have the permission to build a little more. This is a very clear you know, sort of transactional proposal where you know the governor takes over, knocks down everything. That's there develops this added density, sells it and with the cash does whatever it is, that you know will be called for in the in the master plan. So how exactly that transaction is going to happen personally I, don't know I'm, hoping that you know. Eventually, when that face comes, you know they are the sponsors of the project, we'll be able to explain that to us and let it for make sense. But right now you know this. The only thing we understand that it is going to be entirely transactional. Does that address your question Chris? Yes, it certainly does and I appreciate the background on the East Midtown rezoning since I wasn't aboard come on and feel a little concerned. I do understand that it's mostly a revenue generator, but in sort of the secondary and tertiary goals of the project, are to make the ground improvements and increase the nearby subway stations right. I could imagine there being some sort of deal basically where they do have an incentive to make. You know to expand a subway entrance, so exactly and sort of the heart of my of why bring that up is because I've seen many buildings where the commercial office buildings, where the subway entrances integrated into say the lobby of a building and I personally find it inappropriate that that's treated as again to the public from the developer inside the site. Please keep that out of the picture if possible, but I understand that a little further down the road yeah I mean those types of agreements are very much built into the you know the city zoning code. You know there are lots of you know special districts where you know. If you do this, then you can get. You know how you're building and it is seen as a gift to the public here, because it's they led it. It's a little different I see lots of hands raised Julius your hand up go ahead. This is a follow up. Today's the keyless question about the lack of open space, the East Midtown rezoning they were able to generate new maps. I believe was wondering if that's possible too many buildings of a certain size to provide public open space. Yeah I think that you know it is so many something when the time comes to really. You know discuss the substance that we should be asking for I think we can ask in the scope that you know the open space study and then the threshold be lowered. I mean that the evidence is so freely in saying that I think that's. You know there should be adequate open space provided so we may want to add language as it footage I see that BJ has her hand up EJ go ahead, actually like it I met. You asked earlier. Two question is what is given the economic crisis and the economic impact to New York City? Is this project still on track and then the second part of my comments last question is you know, as many of us know, during concerts and sports Kings met around Madison Square Garden, the traffic is just absolutely horrible, and especially during when you're trying to get an uber or and then a lot of one-way streets right so I think and I. Don't know why this fits in, but it's around you know traffic flow, that's going to be impacted both because of the construction time and then what will happen because of the more buildings and more population people coming today yeah. So you know typically any land whose project will have you know a traffic study. This is standard, and you know within the scope of the review of a project we can so many flag it as being an issue from what we understand. It is possible that the number of these streets will become pedestrian and therefore the case for studying the killer traffic would be moot, but you know this is something that we may want to flag in the yard. In the scoping document. Sorry and I see that I think they still on track with the economic impact. Very much so, as you could tell you know, the governor reads the scope ten days ago, thirteen days ago, so yeah I think the philosophy is to basically consider that you know it's anybody's guess what will be the current condition of the city in 16 years. This is a long term project. You know they don't anticipate that it would see any you know substantial completion before I think they quote: 20 38, so you know it's not gonna reach. You know sort of like substantial level of completion over for 18 years and therefore it's anybody's guess what the city would look like in 18 years and they're, making the assumption that you know the commercial market will be solid. Dave Achilles you ever sort of follow up on what EJ had to say in terms of the socio-economic impact of Madison Square Garden, that for the last 50 years, has been home to all of New York City's sports teams, as well as its chief entertainment arena that whether there's going to be an alternative in the proposal or whatever happens to the garden. Certainly this is going to affect us somehow and I'm learning. If that's available to talk about in the scope, yeah I think it's fair, although you know I, think no one is really recommending that the garden be you know, abandoned and eliminated altogether. I think it's just a question of you know: finding it a more suitable location so that it rameneh, you know a vibrant arena. You know both for sports and cultural events, but you know: Sony I, think it's fair to say that the impact of relocating the garden should be looked into and make sure that you know there's no negative impact on that front. I think it's fair, any other questions or comments on these aspects. So we are in urban design and social media packs, whele I'm. Sorry, it looks like Todd Shapiro had a question: yes, okay, one second Todd! Let me unmute you, okay, you're, unmuted, yeah Todd go ahead, you're recognized, Todd, sorry I'm clicking the unmute button, but one second, you yeah I! Think we can get you now. Yeah thanks. Okay, I joined a little late, but can you just explain for me I'm just observing this, the relationship between the expansion of transit capacity at this site and its potential expansion or limitation by the scope of the project that were commenting on you know we is the is the governor and this plan painting himself into a corner. I thought I heard you say that that's not currently in the scope, we're just commenting on the space on the size of it and how it's going to impact. In terms of you know, the mix of you know the overall type of project, but I mean the things that I read about. It seems like a placement of Madison Square Garden, where it is if this project may hate a city, the state in the whole region, into a corner. If they go ahead and do this and they don't have the ability to add enough additional capacity right, that would be like a terrible, missed opportunity. Is that something that we're? Not it's not in the scope yeah, so EJ actually discussed that at the beginning of the meeting he do you want to. You know, bring Todd up to speed on where we stand on the transit upgrades and the fact that we're only looking at this scope document and that the master plan has not yet been put forth with a scoping document. Yeah, that's right, Todd. What we talked about is that, while the while the master plan for Penn Station and what improvements they want to make in terms of increasing capacity which could be track reconfigurations, it could be track widening. It could be the introduction of through running. All of that would affect capacity. Their ability to do those expansions to existing tracks is severely limited by the garden right now. So what we discussed it in the context of this scoping discussion, we want to make sure that the scope is wide enough to keep all options on the table, most specifically creating possibilities for moving Madison Square Garden. The way that community board five fact in 2013 and that liyan MSG's current permit exten year permit expires in 2023 will theoretically be back in discussion. So we talked about adjusting the making an argument that the project area should encompass various blocks that have been cited as potential redevelopment areas for Madison Square Garden, and we also discussed specifically saying that moving the garden should be noted within the scoping document to be explicitly in scope of what is being evaluated great. So that's something that certainly I would want to understand my Odin this or the other thing which I think I heard. One of the other committee members make is that you know, got our government in dealing with these kind of a notoriously backward-looking and how they interpret these things and I was just looking at the plan, and you know it's basically, a series of huge office buildings, hotels and commercial space surrounding Penn Station and Madison Square Garden. It's like if there's a new paradigm in place where the number of people are going to be working in commercial office. Buildings is going to, let's say dramatically, shift because people are not going to I mean that's a that's in the papers and that's like a whole new paradigm. Is that something that we should comment on very strongly because I think you know what's driving. This is the idea that we must do these transit improvements and that we have to build these huge commercial office buildings to fund it but like if the demand for commercial office, space and cities are all over. The all over the country in the world goes down by 1/3, then we're barking up the wrong tree. So maybe it's maybe we as a community board to make sure that is not over what so right. Now we're really commenting on the scope of the proposal and only on this. What is in front of us? So we totally agree with you and we agree with those kinds, but there would be an opportunity to actually comment on the substance of the proposal itself in the process and the different phases and in the review of a big line, land transaction like this one. The first step is to really comment on the scope, so that we can make sure that what is evaluated is exactly what we feel is important and significant and that we have an opportunity to shape that when the time comes to actually discuss the matter. And so all these comments are very valid, but they will come for the next round of with you when we will have a draft environmental impact statement. That will basically tell us what the findings are. You know what is the environmental impact of this big land-use action and will have an opportunity to comment and hopefully to shape what that will look like. Thank you. My questions, Thank You, Todd and I, see that zach has his hand up that. Go ahead thanks, Leila and please cut me off if foam. This isn't necessarily appropriate for the topic of discussion, but I think this pertains to both funding and socio, not socio economic impact. Does it make sense to essentially comment on kind of a value capture concept? That's kind of pops up in urban planning, so you know with an example being that owners of residential and commercial property that benefit from publicly funded infrastructure like some ways, a benefit from a rise in their property values, and should such pay higher property taxes because that benefit. This is a very good. This is something that say for no one who will actually discuss the proposal itself, but right now, once again we're only discussing what should be deemed in scope and what should be evaluated in the oh sorry about that? No problem but hold on to that thought because you know we'll have to actually review the proposal itself and weigh in on it. Pretty soon do you have another I think you had another part to your question or comment so exact? Was it okay, great your hand is up go ahead, so this is sort of a combination of what Zach said and what Todd said and I think this might not be something that we can address at this stage, but is it possible to make in a consideration here only when it comes to the revenue that would be generated by the project, a consideration of his impact on the office market? Would it be possible to ask for them to play out a situation in which office or commercial real estate? The man drops precipitously on the off-chance, which I might not be back small to tan? That sort of failure of those office buildings would negatively impact their ability to generate revenue, or is that just like the other considerations, not a topic of discussion for the club? You know the thing that if we phrase it this way it's a very valid point, because we want to evaluate if there is no longer a market for commercial, real estate and hotel real estate, because they're also proposing a large hotel which could you know suddenly see a you know, a big recession. So if those markets disappear, then what would be the alternate scenario to raise those funds. So, as you know, to go back to Rene's comment when they allow for this density to be shifted elsewhere, I mean right now we sort of like took it for granted that you know this added density will be used on the site, but you know: is it something if all of a sudden? The proposal is that you know this density can shift it elsewhere. Then the environmental review is different, because then you know you're not looking at the shadows from these particular buildings, you're looking at shadows from buildings, you don't even know where they're going to be, and so that needs to be. You know, blown into scope and same thing in terms of use. You know if all of a sudden the use becomes residential. You know to go to BJ's comment. Then, all of a sudden you need to reevaluate. You know the impact on schools, the impact on hospitals, and you know, health care services at open space because all of a sudden, you know if there were to be a large residential building. The proposed open space would not be adequate. I mean there's been there's no part in this area. Where would all these children go? You know? So definitely, if you frame it this way, then it becomes. You know very appropriate to comment on that at the scoping period. Absolutely okay, moving on do. We have any further comments, things that have not yet been said on these topics. Okay, I see none, so one more area that, on this bucket, that I think is important to discuss, is actually the impact to our historic resources. So my understanding is that there are no landmark buildings in the area, meaning like landmark under the Landmarks Preservation Commission of New York law, but nonetheless there are a number of very historic and very significant buildings. We had a interesting conversation this morning with the New York landmarks Conservancy, and they actually have commissioned a survey of all the historic resources that they are currently you know pulling and working on and we're hoping that they're going to be able to share that with us and that will greatly inform you know the type of recommendation that we can make, but certainly we want to make sure that, in the way the historic resources are assessed is not simply to come back to us and say well, yeah, there's no landmark elates and therefore the impact that basically, they really need to look at. You know this is historic significance of the buildings with whether they are on you know any LPC designation list or National Register. It is very important that we pay close attention and they frame the other criteria and the threshold in a way that doesn't let this all. This talk of historic buildings go to the dumpster with without any or any concern. So my recommendation would be to add language that you know the historic resources are properly evaluated. Based on you know, hopefully we can work with the other. Preservation works to basically flag. Specifically, you know those historic resources. Are there any comments or questions or thoughts on the topic of historic resources in the area? Yep Clayton, there's the state care about the LPC, even if the LPC were to work with us on identifying specific sites. What have we seen in history about when a process like this goes on its state-run regarding city resources? Like this good question, it would I mean it puts only set a precedence, I, don't know if it's a good precedent or a bad precedent, depending on you know how that would go. You know, I, think that if you know I think in the end anything and everything is possible. You know we've seen you know interesting things being done like you know, it's something that I'm not a fan of, but it's called facade ring where you basically, you know you slice off, you've only keep the facade and you knock down and everything else and you incorporate the facade into a larger development personally, not a fan, but you know it is something that can be done and can be seen as being a mitigation stuff. So you know, although you know the likelihood that we'll be able to save every single historic building is probably unlikely, I think it's really important to flag it as an issue and to make sure that you know the criteria to determine what is a historic building is not simply well. You know it's not all LPC's list, so you know bring the wrecking ball. Any other comments concerns on the topic of historic resources, no okay, moving on and okay, so we did talk about reasonable alternatives. I think that EJ got into quite a bit of detail on what that could mean. I think that we really need to demand that they are the reasonable alternative scenarios that are evaluated for all the reasons that we stated. So you know that should be a part of our request. If that's okay, we can move on unless anybody has specific questions. Concerns on this topic, I think we talked about it already just want to make sure that we're kind of like following the process, yeah Chris, go ahead. Sorry I know I'm talking a lot, and this might actually come up in the public comment section, but would we be proposing that they look at a situation in which the transit expansion happens on the other side of the Hudson in New Jersey? Or are we sort of setting out that possibility, but I haven't been not included for the answers neither of the above yeah. You know, I think we want to be both specific and vague. At the same time, we basically want to know if we can accomplish what the master plan wants to accomplish, which you know. Once again, we don't know what the master plan is without doing that massive redevelopment that it's gonna have. You know negative impacts, relocation of residents and businesses. It's like we want to know. I mean there has to be probably has to be a better way of doing it, and we want to know what that is and what the benefits would be and what the cost would be. Then we want to be specific by saying you know we want you to make the case that you know we want you to evaluate what would happen if you actually get your funding elsewhere. My position is that on the Madison Square Garden, we should not make in an alternative. We should ask that it is in the original proposal, but if they're reluctant to go that far, we should then ask that it becomes an alternative proposal. So you know I think we want to be both. You know they get it and open in general. You know show us what you have show us, what you can do you know as a better proposal and also specifically show us what would happen if you take X, Y, Z steps and so asking them to consider the development agency in New Jersey and said. That would be an example of being too specific success, something that they would be addressing when they look at the whole universe of alternatives. See that again, I'm not sure I understand what you mean. I'm, not sure, I, understand what I'm saying either but I know. There's talk about the actual project itself, having an alternative where development happens in New Jersey, instead of happening in midtown, Manhattan I know that that's a separate conversation, but would it be too specific about to ask that they consider a situation in which the fundamental assumptions of this project was before us right now, which are that and station would continue to be the hub of regional commerce of regional transit rather, where that assumption sort of goes away because the development is in fact having is happening in New Jersey. So is it too specific about to ask that they consider that situation, because we anticipate that they? We just have that on their minds already or is that something that we should call out specifically as an option? I think it's very specific in a way that you know involves a third party that you know is not in the room. You know if the community in New Jersey were in the room and saying you know what we would really like to have this development, and you should actually advocate for that. I would be more favorable, but you know that they're not in the room, I hate it when another community, you know, makes recommendations on what should happen in the city. Five, it was like oh yeah put in sleep, it's like well wait, so I think that we can make a recommendation that alternates of you know alternative scenarios be evaluated for development elsewhere, without necessarily being specific on where that could happen. I think that that's fairly well, so we also want to make sure that they don't come up with. You know they'd or unrealistic alternative scenarios that, in the end, just you know, fit the bill. As you know, kay we did what you asked us to do, but actually you know it was so unrealistic that it really has no merit. You know how that is going to impact them form. This proposal does that make sense. Okay, all right. So moving on the last aspect that I think is important. That we talked about is the notion of public benefits. I know that it's kind of a loaded expression, but you know for lack of a better term. You know I'm, not referring to the direct public benefit of a you know, upgrade to our transit system. Sorry, but more in the sense of you know what Hudson Yards was able to negotiate with the construction of the shed, and you know other developments that basically included a component. That was a benefit to the community, and you know we can think whatever we want of the shed, but at least there wasn't it sound and I think it is fair to start to consider. You know if there is something that community board 5 and committee board for thing and in that instance, it's super important that we work with other boards. You know would consider to be an important development that would be beneficial, so I, don't know. If it's a school, do we need a hospital? Do we need a library? Do we need a you know some sort of like sports infrastructure that our children can use and in currently kids who live in lower Manhattan? Have you know pretty much know where that is you know, sort of affordable or cd-rom to actually they're sports? You know, should it be something that is a you know: culture, centric, education, centric and I'm, not suggesting that we have the. You know the brilliant idea right now that I think we should start thinking about it and in the scoping we should basically say that such part of the development should be included and should be evaluated for environmental impacts yeah. We might even want to get very specific Layla asked number five currently specifically says based on preliminary thresholds. The proposed project is not expected to trigger detailed analyses of schools, libraries, any facilities. You know we may want to call specifically for those up. We assess as part of the scoping so that they're, not intentional yeah so totally, but that goes to BJ's comment on. You know what happens if these developments become residential. So we need to call on them to evaluate that. But on top of that do we want to say you know: okay, you're, going to generate twenty million square feet of development. Out of all of that, please carve out X amount, and this is gonna be for us. This is basically you know the price that you pay to us for the sacrifice that you're asking us to make because, quite frankly and I know we're not supposed to comment on. You know the project itself, but it is very sacrificial to community board five. You know it's like we're. Basically asked to you know: pay the price have residents, locate, suffer construction for fifteen eighteen. Twenty years, businesses relocated, added density, more shadows, more bulk, more pedestrian traffic to our district for the greater good of the region. I get it and the greater good of the region is, very importantly, very critical, but we're basically asked to pick up the tab, so I think it's looking fair to say: okay, you know it's, we get it, but out of that, something really specific to our needs need to come out of this development, and you know maybe we're gonna say well. You know what we can't think of anything. You know it's a we don't want it or you know we're gonna, say well, actually who'd like school, because their schools are overcrowded or like a hospital, because when there's a pandemic, actually our hospital system, collapses and 20 hospitals have been closed in the past 20 years. And it's about time that you know we shift this trend. You know I'm just throwing ideas, for you know food for thought. You know I, don't have a particularly strong position, but you know I think that this is something that we may want to know. Bring up in the scoping period and I see that Clayton has his kind of Clayton go ahead. So one thing that I loved guild, I, loved Gale Brewer to the moon and beyond, but one thing specifically that I love her for is over the course of the two years of the East Midtown rezoning steering committee process. She really led the charge in where can we get a new Park and there were Geographic limitations to that ambition? So the fact that is not happening is no fault of hers, we're at no fault of the DCP or anybody else. There were extremely limited options for how that might actually come to pass, and most of them were slivers anyway, but just to your point, Leila about dreaming, big and getting stuff in scope, the amount of FA are that we're talking about and what we are seeing on these renderings of these buildings that could go in these sites in this area is ridiculous. It's outrageous and I. Why don't we say that site six should be a park. Why shouldn't site six be open space? Why not, at the very least, can we have it be in scope? Do we consider the public benefit that not only our district, but the entire city is sacrificing, as you say, for funding for whatever might happen at Penn Station or might not? Can one of these sites not be dedicated to people to breathe and have space, and perhaps even to recreate and I? Think that your point about we've been talking a lot lately about youth, recreation and I? Think that it's just more and more and more important and it's kind of a dream to think that in our district we would be talking about new open space, but perhaps this might be the last time that this is an appropriate context for that conversation. So whatever we can do to introduce language in the scoping session to accommodate just that investigation I would be extremely in supportive BJ. They license. You said to dream, bigger and think out of the box. I think two things that came to my mind is one: is you know when you go to thymes play around here, you either there's actually a good tourist center and I think you know I think 34th Street, where we are. You know Madison Square Garden and it would impress the building and in the vicinity it's well we're thinking about having some sort of a tourist office or for tourists who come in I. Think a lot of people get lost. You know their point of reference is their price, their building and Macy's. But there's tons of you know what worthwhile areas around there, including the Koreatown, as well as the Flatiron District, the genious plan, I, think often when people come out from Penn Station, particularly people are lost unless it's the taxi, dispatcher and there's no one guiding them so some sort of like a tourist. You know when you go to other countries where there's a lot of tourists. They have these like stand-alone boots or articles where there is someone who's there directing you know the multi-language by the way when pamphlets guiding people it's to help them. The other thing is right. Now you know: I live on 37th Street I'm, not gonna eat that mean we don't have a direct way to get to the airport, so LaGuardia its Kennedy Airport. To think you know to even you are Karen cord. So why not right now on 30 busts, there's these like golden shuttles or these buses that take you two to the body airport, but again, one that this is going to be a commercial area and become a hub attracting so many people vote for sports and entertainment and really revitalizing this area more around eight. The ninth Avenue it'd, be great to think about having some sort of availability of transportation to offer direct ways to get to the podium right into Kennedy. Important to Newark Airport, without having to take it over is what the long a transit entrance yeah. So it looks like that. Particular you know. Project is actually other big vision, project of the governor. You know we have been obviously less involved because it's not in our district, but it looks like the governor actually said, has time to redevelop, LaGuardia and do this train system that is going to get into Jamaica and will not be a direct connection. So you will have to transfer at Jamaica, and this is the governor's wish we may want to add some language. You know to the effect that you know that this yet again a lost opportunity, but it looked like that was the path that was chosen on that. But you know. Certainly this is you know this is more transit driven, so you know maybe EJ. You have some thoughts on that yeah. You know I. Think I think there were a lot. There are a lot of proposals for more systemic improvements. There. There's again we don't know. What's going to be in the master plan, it seems incredibly likely that it contains a connection to the Gateway tunnels, which everyone you know knows are critical and need to be built and will eventually increase capacity across the Hudson. The idea of a of a single seat, ride from the train stations to any particular airport has been a you know, a dream of transit advocates for a very long time. It would itself need massive. You know political backing by the governor. He seems we've gone in right now with the idea of an air train transfer way out in Queens to get you to LaGuardia the same way you transfer to an air train to get to JFK for what it's worth. George hi Calais, a member of the Transportation Committee, has also talked about the proposal for a tunnel connection between Penn Station and Grand Central. All of these things are more broader systemic transit improvement improvements that I think are probably outside even the scope of what will eventually be the Penn Station master plan, but I think to our part. We should be talking about. You know what can okay? How can we make sure that this that this development area is scoped such that, as many of those things remain possibilities down the road as possible, certainly moving the garden and enabling at least as many of the tracks as possible to be reconfigured and widened, and eventually tied into other transit tunnels like gateway or a connector, or a single seat out to Long Island? That makes the probability of those things much greater, which I think we can. You know we should emphasize when we when we argue for making sure that moving the garden is in scope and widening the tracks and widening the platforms that I think is within the realm of what we should be arguing for right now, and we can talk about all those possibilities as part of the argument for it in this document, without necessarily buying our own hands. By calling for you know, one specific new transit improvement we want to, we want to retain the universe of all of them and to you know to what Clayton was saying earlier, I, you know I think. Perhaps we absolutely could you know or should call for a call for a new park or call for new public space I. Don't think we want to tie our hands by saying that one specific site should be used for it. You know we should. We should be creating the maximum universe of possibilities for all of these improvements going forward. Yeah Thank, You EJ I see that Aaron has his hand up Aaron go ahead, hi everyone, so just a sort of second Clayton's comment. I definitely think that's a great idea about park. Space I also think a couple other things and to EJ's comment. You know not to be too specific about where they should happen, but I think when we talk about some capacity for community space, you know how about a you know: museum area dedicated to the history of the original Penn Station. Some sort of you know tie-in to yes, Historical Society of New York right some area dedicated to education and community space. You know having a meeting place for community board five to have some sort of auditorium space or some area that can be used for that I. Think that's a great! You know working compromise that we have some flexible space for the city. Slash community board specifically, could be a great way for you know: community five to get more swing space to host events. You know: we've had such gracious partners that allow us you know into their areas, but you know we struggle to get a space where we could have a town hall type setting. So maybe a space like that has real value of some kind, but I do like the idea of having some historic connection to the history of Penn Station as well. As you know, maybe transit infrastructure in some way and I think there is a way to maybe do that in a very you know, conducive space in the overall design, yeah and I think that you know that nothing prevents us from. You know, dreaming big and asking for both a park, which a thing is that there's a very strong case to be made, as well as the community space I think we can have both. You know it's sort of like open recreational area and a enclosed. You know built area to serve the needs of our district and of our neighbors district. You know, I, think that we need to make every possible effort to retain families in Manhattan. They are fleeing in a way that is absolutely troublesome and worrying and their thing, because they are concerned about the education of their children and providing resources for children. Whether it is you know, purely educational, you know in sort of more academic sense or recreational, or you know, sports oriented is, would be a tremendous benefit and would really help sustain and the you know the steady presence of a residential component, and hopefully even its growth I, see that BJ has her hand up go ahead, enjoy. Thank you again, Aaron. Thank you for bringing the community aspect. I want to tack onto what Aaron said, and you know the nonprofit sector plays a huge role in the vitality and health of our New York City, and you know, the nonprofit sector is a great partner to have, and one of things is to maybe work on some sort of, like public benefit, to offer incentives to nonprofits to open up their offices. You know real estate is been so cost prohibitive for a lot of nonprofits to open up in Midtown, well. Downtown Wall Street is in a great job where there has been a couple of buildings where a lot of nonprofits moved out of there because of incense. That's what it was offering right, so I think it'd be great. If we could look at some, how inviting the nonprofit sectors are taken and be in this again, because it's such a central location with ease of access and transportation and again the many resources that they could offer to the communal. So again, just saying that you know non poppy should have some sort of space in there to or one of their offices or some surface ilet's help the community we're very good point. Okay, I see that Sam has his hand up and then I really want to open up the floor to our members of the other public and attendees, who have been very patient, Sam, go ahead and then I'll open up to members of the public again I just wanted to reiterate. I think what everybody else has been saying, but I want to remind everyone of the importance that not only do we need to think big, but we will need to hold firm I. Think one of the things that we forget in scenarios like this is that whatever we're getting is a marginal cost compared to the profit of those who are seeing the real benefit from this and I. Think we have to remember that we are not the prime users of Penn Station. The people in our neighborhood are not the commuters necessarily who are going to and from and getting the best benefit of this. So I just want people to keep in mind that this is going to make a group of people a lot of money and in return we may get some upgrades to Penn Station, but I personally feel very strongly, given the history of the way that politicians tend to bow down before the developers we're the only hope of making sure that we do see a benefit and we do think big and we really dig in our heels and make it very clear that the cd5 needs to profit in the same way that the commuters do the users of Penn Station do and also the developers do because we've been left out many times in this process. That's it yeah, very good point. Okay, agree: I want to open up to members of the public. So if you are in attendance but you're, not a board member, you can use your raise hand, button to speak and then once you recognize, Joseph would allow you to join the conversation and we will start with Christine birthday, Christine you're recognized. Can you hear me now yeah? We can hear you Christine. Thank you, terrific meeting and comments. That's very impressive, so I'm, the co-chair of Transportation Committee from Sydney for and I want to share with you some of the draft comments we have started together. We will have a meeting on Wednesday and you are all invited to participate if you want to. If you want to hear our comments, you know from two things. Firstly, from the construction stand on construction impacts. The drop-in center for homeless, which is in cv5, is very, is a very important resource to see before and cv5, and we are very concerned of indeed it coming back, but also during the construction. They need to provide the resource and the facilities somewhere because it is being used intensively by the whole neighborhood, including sue before so I think this is something we need to put in there, and the second thing is that there is a bus terminal on a parking lot, which is on one of the site, one a long distance bus and, as you all know, we have a lot of trouble with those stations, the long distance and when they move that during the construction first of all after the construction, I presume they would go to the new terminal at the bus terminal, but during the construction and when there is not yet a new facility with the bus terminal, they're going to need a location for that, and you know we are not excited to see it coming our way. So I just want to say this is a construction issue. Many of the points you made about the contract that these construction is going to undermine retail I mean first time the state where retail is and the fact that they have never been able to relay market all the retail space in the station. If they add all these retail spaces and they had the Vornado and they add all this retail on the streets, how are they going to ever rent that and how much of the rest of the retail in the neighborhoods going to cannibalize so I'm concerned about that and the cannibalization of the other? You know real estate projects all around, as well as normal projects, very excited about your thoughts about Madison Square Garden. We have talked a lot about Oh residential building. We I think we would like a lot that building, which is at the corner of the site, which is in Sydney for to me residential building, because it is going to be on the block which is essentially residential and so for neighborhood character. Another reason we think that this building would be it would be a good location for making it a residential building and certainly not a hotel I mean we have 10,000 hotel rooms which have been created between 34 and 40 seconds between 8:00 and 9:00, and last ten years, I mean how many more other rooms do. We need right. So that's for our thoughts and we have a lot of comments about pedestrians and what they are studying for the surface transportation. There is no concept of where the bicycle parking. Where is that, where the bike share station? How do we you know? Where do we put if we put those things on the sidewalk? We don't have the space on the sidewalk for the pedestrians, so I think there's a whole infrastructure of bicycle, which need to be thought through, not just the bike lanes, but everything around that and essentially providing maybe a bike Depot. You know when the bike share companies have in some places by Depot, where they accumulate them, and then you can go and swap them. I think one of those places where they wanted to put a parking would be perfect to put a huge bike Depot. So the bike share company can read a provision all the bike share stations, so I, don't think anybody is still thinking in terms of you know, we need to do a study of the bike of the bike, infrastructure and I. Think it's very important because it's if you're going to increase the capacity by 40 percent. So that's an important thing and as far as we have had a lot of discussion in our board about deliveries and garbage, and the fact that we want the buildings to really provide loading docks for those two functions so that they are not, you know blocking the traffic and they are not blocking the pedestrians so making sure that the whole garbage in every building and for every retail store is going to be inside the buildings and making sure that for the deliveries they have, they have loading docks and they don't need people. You know double-talking, especially because there are so many deliveries now, so that whole delivery concept need to be rethought and since they are going to put so much concentration in such a small space and it's going to conflict with the you know, the commuters, which are going to be intense I, think we need to be very prescriptive about the way the parking lane and the sidewalk perform. For example, we want to see probably a lot of trees. You know because it's nice, but if you put a lot of trees, you have to remove that from the capacity available for pedestrians and also all these you know anti-terrorism boards which are taking you know capacity from everyone. So what we have around the Madison Square Garden is just horrible. You have to man navigate around those world arts and you have the space necessary. So we're going to speak a lot to all those things and I encourage you to also raise it, because it's a lot when you start to have that such tall buildings, it's a lot of conflict, yeah, they're, very good point and I think we all totally agree that you know the ad grade redevelopment I think this is probably the area that holds most promise in this proposal. You know if we get it right, we can improve things, but it has to be properly studied now, and you know make sure that the scope is you know correctly defined, including you know, all that you said about. You know: bike use, bike, infrastructure being you know fully developed so that it works and some that maybe we want to consider that you know the scope of area be broader, then strictly the development zone, because you know pedestrians in essence, you know they move. The other thing is that the taxi, the taxi queues are big deal I mean you know. You know that on seventh Avenue on that on eighth Avenue, it's really a mess yeah. We are very much in favor of shared streets, but I've always hope that 33rd proportion of 33rd Street could be used for taxis, so I'm just putting that out. I mean I'm very much in favor of shared Street, but there are a lot of competing demand. Just in that yeah I think those points are very valid. We very much look forward to working with you and we can meet support for, and thank you for sharing your information about your upcoming meeting and encourage all the members of CB 5 to actually join and attend. I assume that we can find the information hung on the website of c4. Yes, it wouldn't send it to you I think we send it to district manager Wally, but we will make sure it does go there. Great perfect, really appreciate it. Thank you. Yeah Thank, You, Christine I just want a second from a from a pure transportation committee. Perspective. I want a second a lot of what Christine said and certainly smart thinking. You know something that perhaps we should, we should stress. Even more Leila is, whereas this scoping seems to call out certain sidewalks for widening, and you know certain limited areas for creating more pedestrian space or say city bike space. Perhaps we want to say that the scope should really as transformative ly as possible, think about ways to actually increase in a holistic way, the pedestrian flow of the area. There are these development sites that are presented to us like site for and site 5, which are, you know, very short buildings right now that we're probably targeted because of the dramatic increase in floor space that they could get from a larger building. But there's tremendous choke points and pedestrians just like on the street during rush hour when you're talking about 8th, Avenue and 7th Avenue on those specific stretches- and we may want to say that shouldn't just be transformed into a sheer you know, it should be as it should be assessed from the perspective of how can those pedestrian thoroughfares be improved as well from a more holistic viewpoint by thinking about the whole. The whole yeah I think that asking for a extended boundaries on those aspects makes sense, because you know the pedestrian mass starts way before you know it starts I mean 28th, Street and 29, and you know the stretch of 7th Avenue. Everyone, 28 and 29 is very congested, and so is you know to stretch north of 34th. So I think if you make sense to recommend that these areas are included in the scope. I see that sorry Leyla I just want to chime in real quick. We have a few people calling in so I just want to. Let you know that if you would, if you're calling in from a phone- and you would like to speak, you can press star 9 on your keypad and that'll, raise your hand and then for those of you that are not calling and if you can't find the raise your hand button. If you go to the bottom of your screen and click on participants, it'll bring up a button that says raise hand. So, if you'd like to speak, you can raise your gun. That way. I see that someone named CN has their hand up so cm. You are recognized and as soon as you're permitted you can go ahead and speak and if you can, if you can state your name, that would be great and you are recognized I'm. Sorry. Can you hear me? Yes, Oh, wonderful, so there are some audio. Sorry! Oh sorry, yes cm! Okay! Yes! So in the city there are some audio pedestrian signals which let blind people, but you impaired people know what street they're about to cross and if it's safe for them to cross and around the Penn Station, there are a few pedestrian signals on 8th Avenue between 31st and 32nd, Street and I believe on 34th, near outside of Macy's, and one on 7th I'm wondering if, when this development starts and if construction results in those pedestrian signals being removed, will they be reinstalled. Also I'm wondering with this construction may be resulting in the streets being dug up. Maybe this is a great opportunity for the Department of Transportation who install these signals to install more of them, because they can be very costly at times to install, because sometimes you know there needs to be permits to dig up the street, and you know so. I was wondering about that and maybe the developers could install some of these signals because there's not nearly enough audio pedestrian signals in the city. Also I was wondering regarding if the streets would be pedestrianised and are closed off to traffic I'm wondering if maybe there could be a way to look into some sort of tactile guide just very quickly I'll tell you. I was able to experience a tactile type of guide. Any questions. Yes, I apologize if there's some sort of way of tactile in a path to help people who are blind or vision-impaired in the pedestrian sort of plaza areas. If there was one to be made, because it's very difficult for someone who's, blind or vision impaired to navigate in those crowded areas, yeah. Thank you so much so definitely we can make a recommendation that the you know the accessibility be sorry evaluated so that you know it takes into consideration all these aspects that you that you have just raised. You know so that at the time that we get the opportunity to comment on the proposal itself, we can make those recommendations and advocate for those. You know in a way that who would not be told that you know it is not within the scope. So those are very reports that we can. We can add in our scoping recommendations from members of the public. I see that Betty Macintosh has her henna and that you are recognized. Yes, you hear me now. Yes, we can okay. Thank you. I'm co-chair of the Chelsea Land Use Committee of Community Board for I. First want to say great. You guys are so thoughtful of Thoreau and I'm we're very impressed so you're making our life much better. Yeah I wanted to call out a few things that we've discovered in reading the draft scope. There's a table on page 15 that at first I didn't notice it, but in the footnotes, there's an alternative for site 4, which is 630 dwelling units. So you just need to know that and echoing what Christine talked about site one being for residential buildings, any residential buildings were very adamant that there be a percent of affordable housing community board. Four is really keen on providing affordable housing. You may have noticed that there are 400 parking spaces that are a total in that table and one might ask if that makes sense, because this is such a major transit hub does 400 parking spaces make sense and the applicant hasn't decided if those are to be for the public or just private. Yet so that's another issue to think about and looking at the sites and walked it this morning that there a couple of parking lots that are open to the public now, so they would be demolished, and so that's something to think about the idea of the park open space. Yes, we have a deficit park open space in community district 4. That would be wonderful in terms of community benefits. We did a study a year two ago about health facilities and we have a deficit of health facilities, so that may be something you want to focus on and I think the open space analysis definitely needs to take into consideration new dwelling units, both the actual number, that's in the chart on page 15, 630 plus whatever alternate alternative ideas, we have say in one or two sites, so I think that you covered and you covered many great topics, so I'll stop there for now, and we hope that you can also see our discussion next when this coming Wednesday night. Thank you. Thank you. So much for bringing this alternate possible development in the notes had escaped me. So that's interesting, because if indeed they are considering a alternate proposal with residential development, then they do need to study. You know impact on schools and other community facilities so meet. So many in our scoping comments. Certainly you know the health facilities I think there's a big deficit of those in CD 5 as well, so I think we would definitely support you know looking into that and yeah, you know. As we said, we really look forward to working. We see before you know we're in this together. There's definitely a strengthened in number. Two I also mean it. The meeting urgent could see five members to the same any other members of the public have any questions or comments to this scoping document. Okay, so seeing none I'm coming back to the panelists and I, see that July has her hand up July go ahead. Inking Leila, I just want to add many people had many excellent points and I'm so grateful that I participated tonight in his rating and two more points that I would like to add. One in terms of public benefits, certainly open space community facility meeting space school study for school seats, but I'm wondering if, in addition, we want to do a concept of revenue sharing with the future owners of these building buildings, the draft slope halls for approximately 20 million square feet of new space buildings. If we took one cent from one square foot of their future, any revenue that would be two hundred thousand dollars per year for the community to use whether that's providing computers for schools, homeless, services for the homeless population. The community, of course, will have to set up a proper process and procedures will have a say according to our perhaps annual budget priorities. So that's one thought, and perhaps it should be a percentage rather than a dollar cent amount, because the revenues will increase over the years. Thought number two I went on the tour to Hudson Yards. This was back in 2017, we're under construction and related with the main entity and somebody from related explained when they were designing the whole Hudson Yards development. They thought whenever you needed to fix something at a pipe, a wire in the city. You need to dig up the street and that inevitably created a traffic congestion, so they made the street services accessible without having you know, digging up the surface of the streets, so I think that's something. We should very reasonably ask for this project to include I'm, not sure. That's the stage to request that, but certainly that will minimize the traffic and pedestrian congestion. I actually did not know that those types of feet surfacing existed, that's really interesting. Definitely this is something that we can recommend. I, don't know that it is with the scoping period that we should be doing that, but you know hold on to that thought so that you know, when time comes to, you know, make recommendations on the project itself nature. To advocate for that, the comment that you made on you know like sort of like levying attacks on those additional fer that are going to I. Think it's very interesting once again. I don't know that it is necessary within the scope period. I think that you know it's. It would be in a way sort of like similar to go to the governing fund that was created as part of in Smithtown, and then you know would have to determine you know who gets those funds who administers those funds and how do we get spend allocated to what kind of project and who would have authority and how that is? That is being done, but you know it is something that exists in its Midtown. It also exists in beyond the theater sub-district, where you know there's a contribution that is made to a fund and then those funds are being used for video, the theater operators. So you know definitely something to keep in mind once again. I don't know that it is part of the scoping, because really you know right now we're you know, defining the perimeter of what we believe is correct to assess, but you know hold on to that thought so that when the time comes to make those recommendations on you know the merits of the you know project itself we can. We can get back to that and you know once again: I want to say to everyone. We should think big, and we should consider that you know we're entitled to more than one possible benefit because we get apart, that we have to give up everything else. So you know we need to keep that in mind and you know, keep thinking keep being creative so that you know once again. The goal is at some point to be able to say well yeah. Actually we like this project and we can support it. That's the goal. The goal is not to say that we don't like it. The goal is really to you know, find ways to shape it involved, and you know work with the yoga, the different parties so that it becomes a project that 75- and you know our colleagues are seems for considered to be a good project that we can support. Are there any other comments or questions before we go to wrapping up this very long meeting, Leila I'm, not sure I, don't remember anyone mentioning Macy's and any proposed development on the block to the north, but should we discuss perhaps that being potentially part of the expanded scope, and so you know what once again, I don't I don't feel super comfortable making recommendations when you know for a particular party, when the party is not in the room, we have not heard that Macy's wants to be included in this development. In my opinion, it would make sense if they are going to redevelop their site, that you know it would be done in a comprehensive fashion rather than you know, a more piecemeal, almost like spot zoning type of approach. So you know, maybe this is something that we want to raise. As you know, we want to make sure that the environmental study is done in a comprehensive way. That also includes other projects that may be happening simultaneously, but I, don't know that you necessarily want to say that you know this is what we feel is appropriate, given that you know, Macy's has not expressed that and it's not in the room to say whether you know they think it's a good idea or not. Does that absolutely makes sense? Maybe perhaps we would frame it specifically by saying that we do think it makes sense to also consider at the same time blocks across 34th Street, so that the whole of the connectedness and transit capacity of 34th Street is part of the considerate and adjacent blocks as part of the consideration as well. Yeah I think that makes sense, and so me the data being used should include you know the your potential redevelopment of Macy's I think it's. It makes sense. Clayton go ahead. Well, just on this point. It makes me realize that I, if there's a way to call him to scope the gimble, the historic Gimbels underpass, connecting these points underground in these blocks. If that is something that we would want to, you know, require being restored and reopened to the public as part of any future transit improvements. Yeah absolutely. We should add that to your recommendation, yeah. Okay, so are there any other thoughts, considerations that the both committees field should be added to our recommendation: Chris I'm, not sure if this is appropriate for the community benefits section or the public benefit section, but if it's not already our plan I would like to add something about duble sortable housing, I understand that might fall into the section that addresses residential displacement, so I'm not sure where the piece is, but I think that we should be trying to get some look at the possibility of given the effect this will have on it. Yeah totally I think that you know, with we've heard from C before that. You know it is a concern of theirs. I. Think that you know, CD 5 is on record saying that you know we're probably the district that has the least affordable housing, which is really a shame, and you know this development is a great opportunity, and this is something that definitely should be or should be considered, both MC b4 and we support or our neighbors on their advocacy, but also in CD, 5, totally I. Think it's totally fair and therefore you know the whole residential component should be evaluated and part of the scope yeah. Okay, any other thoughts comments. Okay, so seeing none another question for your consideration: are there any objections to any of the comments that were made and that? Basically, if there's no objection, all the comments that we made tonight will be incorporated into a lengthy resolution that will serve as the basis for preparing our testimony for the hearing on July 20th? Are there any? You know areas of concern that we have underlined that you have strong objection to okay, so seeing none I think that we're ready to wrap up this meeting. So we need a motion and I think the motion could be something as simple. As you know, I moved to approve all the recommendations that were made previously during the course of the meeting. This meeting is recorded, so you know it will serve as our minute, and you know the resolution will basically be you know, sort of like written in version of those minutes. I cannot make the motion because I'm the chair and you check it out, make the motion. This is the chair. So we need someone to make a motion. Clayton I'm, looking at you, go ahead happy to make a motion to approve this resolution, given all the topics over the prior two hours and 51 minutes, all of which are on the public record a second in order to do this, the proper way we're going to take this to a vote. So in vote. Yes, in favor of the motion I'm going to take the vote for our land use, starting with Dave Michaelis. Yes, Julie, yes, Erin Mike, yes, Erin say yes, I, don't know just in case you missed it. Erin said yes, I got that Tristan! Yes, EJ! You get you get to vote on the land use portion, I'm, sorry, John, rebar, yes, Clayton, yes, Rachel, yes, Ryan I, don't think Ryan is with us. Did I miss anyone from the Land Use Committee. No I got everybody and myself a me. Yes, okay, so the motion is unanimous on land use and each a. If you want to take your vote on teenie, you will now duty any Bay whore. Yes, Clark, yes, is Dale still with us. No Goldman! Yes, Hartman, yes levy! Yes, Lucic! Yes, Paulson, yes ray bar! Yes, is Noah still with us. No astern, no BJ, yes, Finkel! Not here web I'm gonna develop resin, not in tile, based upon the what we talked about earlier DJ yep. Thank you. We do not have Weiland you're gonna have high callus, no Hugo, no maximun. No and I am a yes. So it's unanimous with one president not entitled all right, fantastic, EJ and I will be in touch to start drafting the resolution, so you know check your emails. You may have a little writing assignment and on that note we will adjourn the meeting. Thank you so much for your participation and keep thinking about it because it's gonna keep us busy, for you know the next year or two. Thank you so much guys meeting adjourned. Thank you. Everybody, okay. Tonight, goodbye! Thank you.",
        "summary": "6 pm we're gonna, give our committee members a little more time to join in Leila I assume you were told that I'll be standing in for Luke, helping manage the what I've been are for this and EJ It looks like in the chat I'm, seeing that one of the attendees is a member of the public that is blind using a talking computer, so I assume if they want to ask a question during that portion of the meeting.\nThank you so much to all the members panelists and attendees who are joining us tonight, we're going to be discussing the draft scope of work related to the ohio station, complex project that was published by the governor of the state of New York on July, 1st of 2020 You know the governor is proposing a big line.\nWe are reviewing the draft scope of work for the redevelopment of the plantation area that was introduced by the governor There will be a hearing held by the Empire State Development Corporation, which is the entity you know from the state of New York that has jurisdiction over this development and there's going to be a hearing on the scoping of this proposal on July 20th, so community board 5 needs to establish and develop a position on.\nThey will be in the form of a resolution because we need them to be actionable so that we can present them to this hearing on the yoga xx, and so we will take a vote you to actually stay until the end of this meeting, so that we can take a vote and this will become our official or official position on the scope of work As the members of the community, you have received an email earlier this morning that spells out you know, sort of buckets.\nThe process is very similar to the Windrun other committee meetings and as well as the full board meeting I'm, not sure I have the same of you as so, as you have on your computers and wait to be recognized before you speak, we will slice off via the conversation in questions and comments, but mostly you know we're gonna make comments, because you know we don't have a an applicant in the road to actually answer any other specific questions, and so, with all of that said, I think that it's fair, given you know the transit centric nature of this proposal to pass it on to EJ who is going to lead the conversation on transportation and transit.\nYou know rise from you know obviously transit and transportation, but you know also, as I have spelled, that in the email this morning you know socio-economic conditions, population, displacement, business, displacement, urban design, historic resources , Thank you so each if you, if you want to maybe start the conversation on the impacts to transit and infrastructure on this particular project, and then we can open up to members as a committee for questions and comments absolutely and before I guess the before I get started into some of the details.\nSimilarly Long, Island, Railroad trains come in from Long, Island, load or unload, and then leave back in the same direction through running would enable much higher capacity and much better efficiency by say, allowing those train systems to work together, That's a dramatic simplification, but that's the kind of improvement that, by being able to actually reconfigure the tracks, would dramatically improve the transit capacity of the station So. The context of what the scope makes possible for the garden is going to be very important in terms of considering the capacity and future improvement that is open to not just the aesthetics of being inside Penn Station, but also actually continuing to increase the capacity of Penn Station, which of course, I said 650,000 commuters a day It's already supporting three times the capacity that it was even built for in the 60s With that in mind, I draw your attention to what the map calls site We want to make sure that the scope that we end up with as part of this scoping document and then the environmental impact study leaves as many options open as possible.\n, Six, seven and site a could be redeveloped as a not just redeveloped here, as is being proposed for new towers or new office space, or whatever is kind of vaguely alluded to in this document so far, but also for a potential new location for the garden that is leaving as many of those options open as possible is one reason why it's somewhat not suspicious, but detrimental for that whole block That's considered site six on this map to not to be included, and it was in fact outlined fully by the governor's last presentation in January It would seem that there's a very strong argument for saying that a bare minimum, it's kind of stupid to only include half of a block in your environmental assessment, since the other half of the block is going to be inextricably connected to whatever the effects of redevelopment are going to be that full block was included The last time the governor talked about this in January It's already part of that conversation and that a lot of the proposed improvements that Penn Station would truly benefit from not just aesthetically and having a train station.\nYou know with a ceiling higher than 80 going forward, but to actually improve its transit capacity and, in future development, creating capacity to move the garden somewhere down the road The political will and the financing appears for it would be a very important part of the scoping document.\nWe have not seen yet, but certainly I totally agree that the implications on the subway should be part of the scope and if we, if we suspect that this is that this map and these sites as identified, are not inclusive of that then Mike The master plan does not at this point, seem to be creating any new subway lines or subway capacity or and to affect local subway transit in any sort of specific way.\nWe have to be so careful to make sure things are included, because if it's not, we are screwed after the fact My number one red flag is about Madison Square Garden, as you both have alluded to community board I think it was February of 20:13 past the unanimous resolution to recommend not granting a permit in perpetuity for the garden to operate in response to that city council agreed with us and they got a 10-year permit You help me understand just because the block is in scope?\n, So I think this is so significant, so important that we gave it its own bucket, but you know it Currently, although it falls within the parameter, you know that the perimeter of the district that is being proposed for the year the land, whose action it is actually not part of the action, the same way as EJ, explained the transit below grade transportation.\nThe ideal scenario is that in the end, we work closely with you know the different stakeholders, so that the proposal you know gains cv5 support, that's readable, and this is something hopefully that you know we can start to shape now It says in the document that additional public transportation improvements under consideration include creating a below grade, east-west corridor between the 3rd Street 34th Street, Penn Station in one to three lines and the 34th Street Herald Square subway stations, and it doesn't make any suggestion that this would include the creation of a free transfer opportunity between those two stations and That is something that we should raise because I think that, just having you know an underground long hallway that doesn't provide the opportunity to transfer between those two stations without having to swipe in a second time is just something that I think we should raise, because it's not clear the document and then additionally, in terms of station entrances, I'm sure that a DA accessibility will inevitably be a large part of this scoping document.\nI, just think that this project should also do more than what could be What I would describe is like the minimum requirements in terms of improving station access, because it seems like there's only going to be perhaps one additional ad entrance created, Ok I, definitely something that we can add in the scope of the proposal, any other comments or questions we're going to try to really stick to transit and transportation.\nAll we know is that there is a big land use proposal and observing where the governor purchases lands in these areas through eminent domain or negotiation, and then observes these areas, meaning that he basically creates additional allowed density, and he sells this density and through the proceed of this sale, this will finance and fund the below grade improvements, We, sell this density and that you know creates funding So. There is a case to be made given who the stakeholders are, and in this process that you know maybe alternate sources of funding should actually be considered and that could dramatically change the scope of this proposal.\nWe'll have an opportunity to do that, but what I would like to include is to say you actually have a challenge and the burden is upon you to prove that you need to do this project that it is necessary and we believe that you can get money elsewhere and that we community board five should not be hit with the full burden of generating the revenue so that you can do these upgrades that you know I think everybody agrees that you know Nobody.\nAround Penn Station I mean the main reason is the money, but they also bring in a lot of other what they think would be viable reason for the redevelopment Reality, though, is that you know the governor is not in the business of redeveloping blocks of New York City There has to be a broader purpose for the governor to you know, use eminent domain, I mean if the If, the state is the owner and for right of you know particular sites.\nYou know some local stores and office space is going to disappear, but you know influx of commercial real estate in close proximity to others Unless someone has further questions about the funding, I think we can move on to the next bucket, which is going to mediate urban design, historic resources and socio-economic impact.\nIf you look at the numbers, the incremental difference between the no action and the action would actually bring the number of additional residential units to basically zero, so they're planning to develop zero residential units- my understanding is that the zoning, the underlying zoning of the area, would be commercial and therefore, in a commercial district, a residential development is as of right, so it could be a possibility that one of those sites would become resident and as such, it could be market rate or affordable, and, as such, the impact of these residential developments are entirely excluded from this environmental study, meaning that you know if a building were to be residential, You know, let's say a large residential building gets built.\nYou know possibly creating overcrowding, the access to park and open space This is something that we may want to ask them that they consider adding You, know the possibility of a scenario where some of these Lots would become residential, but as of now it is not part of the proposal and then I just want to tack on into the transit transportation piece One of the comments is like: if they're making this commercial, you know you saw the success of Columbus Circle subway station, where they have an underground all those shops This could be an opportunity if they're expanding that corridor, an area to really offer to both minorities and WBS people for those opportunities right to open up businesses, there's so many homeless, as it is even outside now, 13 14 17, a in that open space , there's so many homeless people there As, you know people that are going to be weather business, suspend both homeless, that's going to displace It is a concern as well It's, not part of your scope, but definitely the impact on displacement to the homeless population should be studied.\nThe scope document suggests that there's going to be a review of visual resources, but I think it's really important that we spell it out and that going further You know it's only just make sure you don't block the views of the Empire State Building It's, really you know comprehensive design on , how you fit that's that type of density into the area My recommendation in db2 had specific language to you know the view corridors onto the Empire, State Building, but actually mats did some research for us on other significant landmarks that are considered If. You currently, you know visual resources, so I think you know we should look into those, but I would love to hear other people's thoughts on the urban design and the impact that that's gonna have yeah for the incredible amount of GSF on this project.\nThe public space seems like next to nothing the public amenities, a it's just amazing If there was something that these buildings can do, instead of sheer office space to become offering more to the public other than the obvious transportation of but other than that, because it seemed to be much in the way of public amenities as it stands now, I mean they were proposing one tiny, little Plaza green area between two very large buildings and the existing 33rd Street closure They count that as a open space, but it already exists, I have a question about the park land that would be in essence, a shadow by these developments Were they to determined that a shadow would fall on the district, which is obvious?\nDave Achilles you ever sort of follow up on what EJ had to say in terms of the socio-economic impact of Madison Square Garden, that for the last 50 years, has been home to all of New York City's sports teams, as well as its chief entertainment arena, that whether there's going to be an alternative in the proposal or whatever happens to the garden I, think it's fair, although you know I, think no one is really recommending that the garden be you know, abandoned and eliminated altogether.\nWe want to make sure that the scope is wide enough to keep all options on the table, most specifically creating possibilities for moving Madison Square Garden The way that community board five fact in 2013 and that liyan MSG's current permit exten year permit expires in 2023 will theoretically be back in discussion.\nAnd you know it's basically, a series of huge office buildings, hotels and commercial space surrounding Penn Station and Madison Square Garden It's, like if there's a new paradigm in place where the number of people are going to be working in commercial office.\nBuildings is going to let's say dramatically shift because people are not going to Is that something that we should comment on very strongly because I think you know what's driving This is the idea that we must do these transit improvements and that we have to build these huge commercial office buildings to fund it but like if the demand for commercial office, space and cities are all over The all over the country in the world goes down by 1/3, then we're barking up the wrong tree Maybe it's maybe we as a community board to make sure that is not over.\nYou know the thing that if we phrase it this way, it's a very valid point, because we want to evaluate if there is no longer a market for commercial, real estate and hotel real estate, because they're also proposing a large hotel which could you know suddenly see a you know, a big recession I mean right now we sort of like took it for granted that you know this added density will be used on the site, but You know if all of a sudden the use becomes residential, You know the impact on schools, the impact on hospitals- and you know, health care services at open space.\nWe had a interesting conversation this morning with the New York landmarks Conservancy, and they actually have commissioned a survey of all the historic resources that they are currently you know pulling and working on, there's no landmark elates and therefore the impact that basically, they really need to look at It is very important that we pay close attention and they frame the other criteria and the threshold in a way that doesn't let this all This talk of historic buildings go to the dumpster with without any or any concern Are there any comments or questions or thoughts on the topic of historic resources in the area?\nI know I'm talking a lot, and this might actually come up in the public comment section, but would we be proposing that they look at a situation in which the transit expansion happens on the other side of the Hudson in New, Jersey?\nWe may want to add some language It seems incredibly likely that it contains a connection to the Gateway tunnels, which everyone you know knows are critical and need to be built and will eventually increase capacity across the Hudson You know political backing by the governor He seems we've gone in right now, with the idea of an air train transfer way out in Queens to get you to LaGuardia the same way you transfer to an air train to get to JFK for what it's worth Can we make sure that this that this development area is scoped such that, as many of those things remain possibilities down the road as possible, certainly moving the garden and enabling at least as many of the tracks as possible to be reconfigured and widened, and eventually tied into other transit tunnels like gateway or a connector, or a single seat out to Long Island?"
    }
}