{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 September 2020 Arts",
            "publishDate": "2020-09-15",
            "shortDescription": "Agenda:\\n\\n\\n1.Presentation: DOE to present and discuss Outdoor Learning Initiatives\\n\\n\\n2. Committee Update: Student Teacher Virtual Learning Initiative\\n\\n\\n3. Committee Discussion: Statement of District Needs and Budget Requests\\nfor Fiscal Year 2022\\n\\n\\n4. Old/New Business",
            "lengthSeconds": "2:15:11"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "0-Mbt-K031o",
            "fillerWordCount": {
                "uh": 227,
                "um": 472
            },
            "readTimeFullTranscript": "84 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "schools": 120,
                "school": 90,
                "learning": 45,
                "street": 42,
                "streets": 38,
                "space": 38,
                "budget": 36,
                "teachers": 31,
                "students": 29,
                "terms": 27
            },
            "wordCountSummary": {
                "schools": 29,
                "school": 22,
                "space": 11,
                "streets": 11,
                "learning": 10,
                "parks": 10,
                "street": 9,
                "terms": 9,
                "teachers": 8,
                "conversation": 6
            },
            "fullTranscript": "Co- chair of the arts, Culture Education Street Life Committee, along with my co-, chair, Kate Tulson. We welcome you to the post, the Post Summer edition of Board meetings, Monthly board meetings, it's good to see everybody hope everybody as well we're wishing that everybody as well just a couple of things, technical things. Of course we're operating now under the governor's edict virtual meetings, and this will be live streamed and also, if you miss anything, you can review this on youtube. We've got some nice presentations got some good information coming down the road today. So just a little technical updates in case folks or folks in the audience are not aware. We'd like everybody to keep muted, except for the presenters and the speakers. The presenters will present and the committee will have an opportunity to question their comments and please use the participants icon on the bottom to raise your hand and you'll be called on in the order that you appear on the participant screen after that. We'll turn it over to the attendees the audience see if there's any questions and comments and then we'll circle back to ourselves kind of put things back together again see if there's any actions that we want to take on this particular or any particular presentation that's being made. I just want to tell everybody that Carl Wilson, our community liaison, is here and Matt. Green, Deputy, district manager and district leader is here to give us a an update on education financing, so I think that's it Mr chambers, I see is here also so with that. I will turn this over to my co- chair kid who will start the precinct the the meeting up. Thank you welcome everybody. So I will be brief because I love to get into the agenda. We are lucky to have Mr chambers here from the New York City DOE. He is going to talk to us about school reopening. Specifically, we have asked some questions around outdoor learning, but we'll turn it over to him to give us a quick presentation on how going back to school on the 21st is going and then, as Alan said, committee members will have a chance to ask questions and we'll open up to the public to ask questions as well so jump in there. One second before Steven starts absolutely so just to clarify what Alan was saying. There's two ways for the public to ask questions here: there's the there's the blue hand right the virtual. Maybe it's not blue on your screen, but there's the virtual hand under the participants section that you just tap and it'll raise the hand for us to see you or you can do a Q&A at the bottom of your screen. If you have a question that you know, either kid or Alan can read off and Stephen can read as well. So there's just two ways of doing that and if, by chance you are calling in by phone, I do not see any phone numbers, but if it is at some point, if someone has to call on my phone star nine is the blue is the equivalent of blue hand on the phone and star six is mute. Thank you awesome good evening. Everyone and thank you for the invitation tonight to just share a little bit about where we are specifically with outdoor learning. As we prepare for schools to reopen on the 21st. I will, unless there are like specific questions, I'll just give a general overview I'll share. Some numbers share some of our like high level policy, and then we can open the floor for questions. I'm guessing. That's the! I think, that's the flow, so I'm going to try to stick within that, so we are in about week. Four. If I look to my right, that's where my calendar is we're in week, four of what we're calling the rollout for outdoor learning. So, as many folks probably know, we had a an announcement from the mayor and the chancellor on the, I believe it was the 20 for every day is the same to me these days, but I believe it was the 24th of August and we had a deadline for submissions, an initial deadline on that Friday, the 28th with that rollout in week one we had over 900 applications from all schools in this in the city. So that's traditional pubs, charter, schools, non- pubs and even some Learning Bridges. So after school programs 900 around 980 submissions- and I say- submissions, not schools, because some schools submitted more than one request either for parks, streets or just indicating that they would use their existing school yard, and so that is all from week one and we responded to all of those applications by no September. Excuse me September 4th, which is a week beyond a week past that and in those responses there were categories of responses and I'll just share what those categories were. If you're, if you have touch points with principals and or if you're a parent, you might have heard what some of those touch points are, one of them was yes, you are approved for your parks, request and parks will follow up with you with action, with the actual permit that they will be administering to you in your school another one. Another response was yes, you are approved for your street request and then streets would follow up with you there. Then there was a big one that we just kind of called the DOE approvals or the schoolyard approvals is a more appropriate term where we sent to schools, saying yes, you're approved for the schoolyard that you indicated in the survey that you already have and that you did not make any additional requests for a park or street so go ahead, and you know start planning to use your space for outdoor learning. And then there was a category for those who had an existing schoolyard based on how they indicated that in the survey and did apply for a park or street request, but did not get that request met for a park or a street. So the language was more of. You are approved for your outdoor school yard and you could potentially receive further approval for a parks or a street request. The reason why there was a somewhat of a pending category is because our goal in launching this initiative was to prioritize two school lists, just to kind of be more, not kind of, but to be more pointed in our equity lens of how we tried to support schools. So there was a list of 280 schools that the DOE had that basically indicated that these schools did not have a pre- existing school yard, and so we wanted to make sure that those schools were prioritized in our review process. And then there was a list of schools that fell within 27 neighborhoods, most impacted by Covid-19 Covid-19, and so between those two lists. Those were what we called our priority list and those were the schools that we basically tried to meet the needs for first and then gave parks and Street some India Sorry Department of transportation, NYPD time to review the remaining schools, and so in week two we we were able to send out more approvals for those schools that had initially been pending, and then there was a list of schools, a category of responses. That was basically we have real. We have acknowledged that you do not have existing school yards and you did not receive your request for a park or a street and in that list initial initially in week, one there were 28 schools in that list, and so it's been my job to basically give those schools a call ask if they have any additional recommendations that they would like to submit for review either a street or a park so that we can try to accommodate. We are still working through that list down to about 12 schools on that list. Right now and parks and department of Transportation NYPD City hall, Fire Department. Excuse me, those are the main. Those are the main agencies that are working with me to make sure we get through that list as well and all the rest of the list. Just to give you an overall snapshot of where we are today. As of about six o'clock today, just ran some more numbers. We have 1093 applications over the past three weeks, and that includes the data that I just pulled today and of those 1093 submissions. 370 were approved to use their school yard and only their school yard, because that is the request that they made 241. Schools are currently in the category of schools that requested either a park or a street and said that they have a pre- existing school yard. 321 schools have been approved for parks for use of a park. 153 schools have been approved for use of a street and, as I mentioned earlier, 12 schools are still on our list of no school yard and still we're still trying to find space for them to utilize for outdoor learning. So those are just some high level numbers and a general overview of where we are one of the things that is in the works that I know a lot of questions have been asked around, are tints and how to use tents, or are schools allowed to use tents, we're actually working on a sub policy now, where tent guidance will be provided? But I will say overall that the Department of Transportation and NYPD are cautious about sharing or not sharing, but sending out any guidance. That says a blanket guidance that says yes to tents, because there are so many stipulations with using streets for the schools that are approved, and so I know D.O.T sent out guidance today actually or they will be sending them out today to all the schools approved for streets. That offers more specific guidance on that, just to name a couple criteria for streets. There has to be a 15 foot, emergency lane open at all times for a street, and then a street can not be closed if it's more than one lane both ways. So a one- way street is fine. A two- direction street is fine as long as it's one lane and there's also we're kind of following the play streets model. If you're familiar with that, where schools can close, they will be closing the street and parking will still remain on that street. So schools will have to staff the street on both sides of the street where the barricades are, but then also someone needs to be within the street. Allowing excuse me allowing people who might need to leave their parking spot to leave their parking spot, but cars can not come back in during the school day, so it's only to leave during the school day, and I think that's that that's kind of that is where we are right now. I'm sure there will be a lot of other questions that I can share more information, hopefully around, but I'll stop there for now. It's a super helpful high level overview, I'm guessing that we will have a lot of questions, but one of the things that we've talked about and I'll. Let Josephine is one of our board members who you've been in touch with speak to us in more detail, but one of the things that we've been talking a lot about is safety and how these spaces will be supervised. Josephine. Do you want to say a little bit about what you put into the letter that you wrote yeah sure? Well, we have two schools so far that have applied one school is basically using their roof and the other one had applied for two spaces, one a park and then also using their yard. I think they've since sort of nixed the park. I do not know if that was denied or they've just the schools decided not to use it. However, we do still have questions, even if it's in the yard, you know what are there any? Is there anything that you can recommend in terms of helping keeping students and stuff you know just generally safe yeah? No, that's! I know it's a hard question. You know I do not mean to put you on the spot, but I you know a lot of people been asking, and you know we do not know. Is it? Is it the school safety officer's responsibility? Is someone going to be out there? How do you guys sort of envision this happening? Yeah? Our initial guidance is for principals to continue to staff instruction any way that they typically would so a school safety officer, yes, staff, just general staff. So if you have a teacher, teacher's aide or anyone, any adult that can assist with just securing the space is something that we're encouraging schools to do, there's a lot of autonomy that we're also leaving with principals. So it's really hard for me to answer that question because I know every school is different and has different needs and so we're trying to answer those questions case by case, and I know that we also have a general we're, also thinking about and working on, general guidance for safety, especially as it relates to areas that are at risk for crime, and so that conversation is being had- and I also saw speaking to responding to inquiries on an individual basis. I saw a question in the chat about who do we reach out to, and there is an email address, a formal email address from the does outdoor learning at schools.nyc.gov, where questions can be answered myself, and I we have a half of another person who are not half of another person, but his time is split that are working on managing inquiries, calculating data daily having daily interagency conversations with city, Hall, Fdny, SAPO, sanitation, NYPD parks and recs every day every morning. So it's a collaborative effort in terms of not only how we are creating and offering this physical space, but how we're offering guidance around safety and just helping principals use their space wisely and with hopefully, some pointed guidance. I know that's, probably not the best answer, and it's not really a very pointed answer, but I think the easy, not the easiest, but the best thing for me to say right now is that we're still working on that answer, because I'm I myself am not satisfied with that answer. So we're still working on that. Well, that in itself is good to hear. I mean it's nice to know that there is a plan in the works and that you know I know that these issues are being thought of, but it's just nice to hear somebody. You know talk about them. My only other question to you. I know that this is all new. I do not know how much research has been done in other areas of the country or the world where people are doing this schools are doing this, but how long do you imagine that schools will be able to use these outdoor spaces? I mean? Are they allowed to use them as long as the weather is holding up? Is there a certain temperature where it's no longer going to be feasible? Yes, so we have been pulling on international data. There are other countries that are currently doing this, and then there is the times article that I'm sure a lot of folks in this in this group have read about the pandemic that took place in the early 1900s and how outdoor learning was utilized during that time, and so we're definitely leaning on those examples and just having conversations with community groups. Parent groups, folks, who have been doing outdoor learning before this, was a necessity for all and gleaning some best practices there in terms of timeline and how long we see this operating right now, just to give you some concrete response, park permits and street permits are being dated for an expiration of November 30th of 2020 in terms of the first phase of outdoor learning, and that is just in response to how we predict weather starting to shift drastically and obviously with Covid-19 still rampant and still moving throughout the city. We do not know how Covid-19 is going to impact our school year, and so the plan right now is to basically do this until November 30th restart this program again in the spring when the weather starts to improve, and then we're also, as I mentioned earlier, when we talk about looking at other examples of outdoor learning, thinking about temperature weather thinking about outdoor heaters. That can possibly be implemented for certain. Excuse me for a certain model for certain outdoor learning models. I'm actually in conversation with the Department of City planning. As an aside just to start thinking through some design models for principals and schools that just do not have the time or the capacity to think about design for streets, schoolyards and so we're trying to get some mock- ups created now to kind of assist as like a resource and supplement, we've been we've been in conversation about ways that we can even offer some type of curriculum guidance. This is all just these are. This is how we're thinking. None of this is concrete policy. The last two pieces that I just mentioned, and in terms of temperature, we're still using the general like the DOE, has a temperature threshold for students to be able to go outside. Typically, it's been used for recess and for for field trips, and so that is still being applied. I can't think of the temperature off the top of my head right now. I want to say it's, I'm not even going to guess, but I can't think of it, and I will say that it's connected to the guidance that was already in place for the school year. So whatever that temperature was, it still remains for outdoor learning again. Principals and parents are or have the power and authority, obviously to decide how they want to move forward as temperatures change. If they want to ask students to put on more clothes, if parents feel comfortable with that, there's still some autonomy there, but there's on the district level, there's still a threshold where we we do not encourage students to be outside. Thank you, yeah. Thanks for that Stephen I'm going to go to hands in the order that I see them. Josephine, you're good, no additional follow- ups. So it's going to be David Warren first hi. Thank you for coming. I really appreciate it quick questions, I'm to be honest with you, I'm not that knowledgeable about this. I should have more knowledge. I did not really do my homework, but I've been to events where they have these temporary tops. So I'm thinking in the schoolyard or in the streets. You know the weather looks bad in terms of rain. You put these tops up. You can take them down in 20 minutes or more. You know also you're, considering heat lamp and things like that if the weather gets chilly or whatever, and the other thing is on a personal level, I object to them putting free car storage over the needs of students for outdoor outdoor learning. I think that you know the cars get rid of them, while they're doing that, I can understand emergency vehicles coming down the street, so I mean I do not know what we can do about that, but that's just something I feel very strongly about that. You know: someone's storage is not as important as a child learning, so I maybe you can answer my questions about the top or the heat lamps sure is the top. Are you referring to as a somewhat of a tent top? Is that what is that? What the structure is yeah it'd, be. Like a top, I mean I work for fire department. We have a ceremonial unit that has these things that it's the top is that the sides. Usually there are some where the sides can be enclosed, but I think that would defeat the purpose right, there's a top and it's open air. Okay. So sure, that's why I said a top, not even a tent. I mean it's just a top where it would cover you, and I have these wire lack of better word wire things where you know where it stays stable. If there's a strong wind or something yep. I see- and I understand what you're saying and actually, when we say tents, that's actually the structure that we're talking about it's a it's a top with four either bars on the side and no no side, no actual, like flat sides to the tent, because that right in your, as you just stated, to defeat the purpose and there's actually specific guidance in our original policies. That says yes, if you do use tents, do not use these types of tents that are enclosed again, I'm not going to speak too much on the tent piece in general, because there is actually like policy being developed right now for that- and I do not want to contradict anything- that's in the works even in the school yards, I'm not separate from the streets. What about school dogs yeah it's going to be tent guidance for all spaces. There is going to be more, there is going to be more flexibility for school leaders to use their tents in school yards and parks over streets, but the policy will cover all outdoor spaces in terms of the heaters. That is something that schools have the ability to purchase if they have the capacity. I know we are also working on, and I actually just got off of a call about this, how to utilize ptas and how to use ptas as a fundraising mechanism, but also ways to equitably distribute funds and resources from ptas. Our initial conversations were, if you are a PTA and you raise enough money for a tent, we strongly encourage you to do the same for another school, we're not naming what school. That is, but just saying, if you raise money for one tent, please raise enough for two so that we can distribute some of those resources to schools that might have a greater need, but both PTA and tent policy is literally in the pipeline right now we were trying to get it past through cabinet last week, but I think it should be up tomorrow. So hopefully we get that out as soon as possible, so principals have more guidance on how they can use their ptas and what to do around this tent conversation. Thank you very much. Yep you're welcome the next hand is Alan and then katie you're on deck. Thank you Steve. Thank you very much quick question. Can principals reach out to their local precincts themselves if they want to have some sort of presence around the area, or does that have to go through your office if they want to? Can you say the last piece of your statement out to their local precincts? If they have a work, they some of the schools, have a working relationship with their local NYPD precincts already. So do they need to go through your office if they want to request some sort of police presence, or you know for them to come by on occasion just to keep an eye on things depending on where they're located or does that have to go through your office? That's a good question. As of right now, we are trying to encourage all schools to come through the DOE in terms of any individualized supports, so we're essentially like brokering these conversations between all agencies, and this is at the request of the agencies, especially some of some of like parks and Rec's department of Transportation. What was happening is schools were reaching out to agencies individually and trying to request streets or parks without a real streamlined process, and it was for lack of a better phrase- chaos in some in some of the agencies and trying to trying to meet the needs of schools and want to make sure that they're, not you know offering a school one street that another school had already requested through another process. So now the general language is please. If you have a request, if you have a specific request, please do so through the outdoor learning survey, which is found on the does infohub. But it's also, if you're a principal it comes out through, what's called the p digest and some of the blogs that we send out weekly but Alan. I think more specifically to your question about NYPD and precinct presence. We have not really discussed without like if they have an if they have a relationship with their local precinct. I do not know if we would, you know, say no to a school, but just in general I would encourage all requests to come through just this very, like streamlined process, so that we do not overwhelm our partner agencies and then also we kind of know what schools needs are. So if we hear that there are, there is a need for a certain area that they might need additional security in terms of police presence. That's in addition to NYPD being necessary. There that's also a red flag for me around what is happening in that neighborhood in general, and how might we want to better support the school so that they might not even need an additional officer officer there? So it's just really helpful for me to just know what the needs are. Gotcha all right. Thank you. Yep you're, welcome all right, katie and then we're going to Sarah great. Thank you and thank you for this presentation and I have to say I'm delighted to hear about the work this PTA policy you're coming out with, because, as somebody who was the PTA president for many years at two different schools, I know that ptas, who do a lot of fundraising and have access to funds, often work with sort of fellow schools that do not have access to funds that you know, I think that's a great policy of sharing and if you can get an attempt and trying to get a tent, for you know a nearby school. I guess but related to that, though, in the development of this PTA policy has the DOE been working with cpac or the PTA president's councils or any other parent leaders in the development of this yeah. The call that I was just on was with a parent leader group that I, the name is escaping me. My co is leading the PTA intent side, so he has more of the more immediate details there, but the ant. The quick answer is yes, we are working with PTA, Eta presidents and leaders, I'm. I can't give like exact names of the organizations, because I just I do not have them right now and I do not want to give the wrong information, but I know that he is working on that Jermaine Robinson is working with me on that. So yes, that that's happening, and actually one of the things that came up in the conversation earlier today was a concern around not wanting ptas to start to think of other schools as charity and needing that support in that way, but more so yeah, exactly considering all schools are part of our overall community all students, all schools are part of our overall community and ecosystem. So just trying to like be intentional about that language and how we, if there is going to be a distribution in that way doing so in a way that does not, it does not feel like we're putting certain schools and categories of privilege and not right. Yes, I have to say there is a quite a history of parent leaders being elected by their schools to represent the parents and then not being so involved when things are being the parent leaders not being engaged by the DOE about parent issues. I'm delighted to hear that they are being involved, and I just encourage you to make sure with your partner that continues with lots of parents. I just have two other quick questions. You'd mentioned that the this program is due to go through about November, 30th and then we'll restart in the spring, or at least that's sort of the thought will schools have to reapply to be included in the spring. That's a good question. We have not talked about that yet, and I actually my thinking around that just this is this is steven speaking and just kind of thinking. In the moment, I do not think that they will or that they should have to reapply unless there's a significant change in maybe the landscape. If there's a construction project, that's supposed to take place in the spring, that was not there in the fall, then. Obviously some of those more specific instances would have to be talked through in the next phase, but I think just for the sanity of all of us involved. I would love it if schools did not have to reapply for the same spaces that they already had and if and if for as much as we can as a city and all the agencies involved. If we can try to protect those spaces as we come back to the spring so that schools do not have to have as many one- off conversations. That will be my that would be on my wish list, and that will be my push for how we move this forward. Okay and then just my very last question, we've heard mention of noise concerns for students who are you know, participating in outdoor learning and we've heard mention of the possibility of maybe the DOE reaching out or I do not know who would reach out to sort of emergency services to talk about, maybe sirens not being used, except when truly there's an emergency. You know what I mean that seems like, and I'm just wondering is that one of the partner issues that you're going to be working on or is that being left to somebody else, I'm thinking that will probably fall under Sapos, which is like the permit office, the safety permit. I can't think of their what the acronym actually stands for, but I know it has to do with safety and permits I'm thinking that might be something that they would that they would have some insight on. I do not know, though, that's something that especially the sirens piece and winning how to do that. I have not thought about. We have been talking about how, if we're asking stu schools to come and do like band or music out in the streets. What does that mean for residents that are working from home or and or just living life? How do we still hold space for students and teachers to you know, exercise teaching and learning, but then also be respectful for residents that are living in the same spaces, so that kind of falls in the bucket of an individual case right now, but I think that conversation is going to have to resurface as we get closer to the school year, because I do foresee that as being something that we need to be more intentional about, so I'm going to actually take a note on that. Come back to so, thank you for thank you for highlighting that all right. Thank you. That was it for me. We're going to commit things over to the public in just a moment. It looks like your raised hand went down. Did you still have a question, or did your question get answered? My question got answered thanks kit, perfect. So, just as a friendly reminder, if you are joining us as a member of the public, you can raise your hand by clicking on participants which is off at the bottom of your screen and then on the right bar. There should be a raise hand option. If anyone would like to ask a question that way, I see one hand up from Chris. We will acknowledge you in a moment. There were a couple of questions that came through in the Q&A, so I'm just going to try to rattle through these Stephen. I think you actually hit on a lot of them. So if I say something, that's wrong, please cut me off and correct me, so the first one was around. I do not know the acronym DYCD programs and then permits for after school programs. I think you said that basically folks can apply whether they are a DOE school or a independent school or an after school program. Could you hit on the guidance for dui CD programs yeah? That would be if that falls under after school or weekend, especially for parks. That will be a special permit process. So that's not a part of the outdoor learning initiative and they would just need to reach out to parks directly and parks is already aware that we actually had a submission for that over the weekend for a school and they have a special events permit process for that. So, if those do happen to come, my way, I'm able to filter those out and just send them directly to parks and parks will reach out directly to the school and they can follow the school or the agency and they can follow up with them. On the on the street side, I think that looks more like reaching out to the department of transportation for a play streets permit which, if a school- and this is like- also good information for this conversation, if a school already had a play streets, they should still apply for the outdoor learning survey and the Department of Transportation will basically grandfather that school or agency into the play street that they already had. But it's still helpful for us to know what schools are using their pre- existing play street just so we just so. We know right and so that one came from an anonymous attendee and there are two questions from the same individual apologize if I'm mispronouncing any part of your name, but it looks like Janine Keeley First question was for schools that are using the sidewalks and streets for extra space during arrive on dismissal. Can they continue to use these public spaces during the cold weather months and then the second question was: does the DOE have any guidance on how schools can mark the streets and sidewalks I.E, chalk, stickers, etc? Okay, thank you for that question on the on the sidewalk piece. Yes, schools can still use sidewalks after the weather is not the best. However, the use should probably be restricted to entry and dismissal and not for actual outdoor learning, but they do still have access to the to those sidewalks in the same way that they would during a traditional school year on the street side. If you are approved for a street, NYPD is actually the agency that will be offering barricades, and so they will be reaching out to the school directly. We're all on everything. Every agency connected to streets is on one email chain, so when I send out like the data for the day or when we have conversations about certain needs that all happens within that one chain so Nypd's on it, fdny is on it. Department of Transportation is on its city halls on it, and so that is the way that we'll be marking streets. There should not be a school that has to just use something like chalk and if they do, I would love to know about that, so that we can make sure they do not have to do that. I know that was just an example that the questioner just probably threw in there, but I really want to make sure that school that those streets are as protected as possible and we've actually had some specific guidance around certain street requests that they used a certain type of barricade. So NYPD will say. Yes, we approve this if you're going to use like the Jersey bar barricades versus like a plastic barricade or a cone and another piece to the to the marking is staff. So, in addition to having a barricade, what's also really critical for protection and safety is have making sure there's staff at the barricade for as long as the barricade is there, so I think a barricade can do one piece of a safety. It can protect students and staff at one level, but there has to be a person there to ensure that you know cars. Pedestrians know this street is being used as a classroom and, as you would in a school people can't just walk in and out of a classroom without some acknowledgement so that safety precaution should still be there. Thank you for that. It looks like we have two more questions that have been submitted and then there are two hands that we can call on from the public. This next question comes from Mar Fitzgerald for schools that have not heard back on their outdoor learning proposals, who should they contact? Who is the person DOE or the DOT, and a thank you in there yep. Thank you for the question too. That is definitely something that should go to the if they if they have not received a response. The first part of that for me is to ask the school when they apply, because our our commitment is to respond to schools within seven days of submission and the way we're doing so. If you applied Friday, you may not have heard back from us yet because we're still working through the schools that apply before you, but we do also want to make sure that you are not being kind of like if we overlooked you for any reason, you would reach out using the outdoor learning email address and I can actually type that into the chat if it's helpful for people just to have. But I think that is that's the best step, if you, if you're, if you have a question about anything, just send it to the outdoor learning at Schools.Nyc.Gov and also know that you should at least give a week between the time you apply to hear something. Back next question is from Patricia Larea. I apologize if I got that last name wrong. Will the DOE provide parking passes for teachers that are willing to drive and park on the street near school yeah? That was actually one of the reasons why cars are still allowed to be on streets because, as we were, having conversations about this, our initial, our initial policy and proposal- was to have no cars on the streets. And then there was the conversation of oh well. That's probably going to turn some teachers off from even showing up to school, because that will then kind of force teachers to take public transportation when they may not want to do that, or they may not feel safe to do that. And so then the conversation came about that. We should make sure that there is street space for parking so that teachers can park on the street, and so as of now, teachers are going to be able to park on the street. We're not sure if they're going to need even need a permit right now, because if the streets already closed off under the department of Transportation and NYPD, they would essentially be kind of protected during the school hours to park there. Thank you for that, sir. So the last comment that made its way into the Q&A is from a member of the public who has their hand raised so Jesse. Are we able to recognize Chris, Lebron and then Janine Keeley? To ask a quick question? I would actually give the floor to janine before, because I have a number of questions, but that's okay, thanks for answering all my questions, but I realized so some schools I have are just doing it for arrival and dismissal and they're just looking for guidance because they do not want to put anything permanently on the sidewalk and get in trouble. I mean some of it's just you know, marking like every store or place. We go into a lot of places, have stickers, can they legally put those on the sidewalk or are they going to have to use chalk? To note where parents stand and then a number of places, schools that applied more than a week ago have not heard back yet, and I guess it's just so hard to like tell them to. I know it sounds like you're, the only you're, the guy who is reading outdoor learning at Schools.Nyc.Gov. So I guess that gives me a little bit more comfort, but you know I always hate, say: oh email, this black hole for this. Should we also and then I'm sorry to load you up? I should let the other guy go. First for schools that do have permission sounds like I chair the schools in a community for community board too. It sounds like we should directly put them in touch with each of their individual precincts, so they can arrange for barricades and so forth. Yes, so on the barricade piece, NYPD should be reaching out to those schools directly because they NYPD has the list of schools that are approved for streets. So let's say a school reached out to NYPD and they're, not already approved for a street they're not going to get access to a barricade until that approval is matched, but if the school has been approved and they have not heard anything from their local precinct, then in that case I would encourage or not encourage, but I would say it's okay for a school to reach out to their precinct and say you know, hey. We have not received ours. Yet we have our approval here. It is. When can we get it? I think that's fine yeah and of the 241 schools that have not yet been approved, I'm assuming not all of those have submitted applications in under a week. The 241 schools that have not been approved, yeah they've requested a park or street, but they have oh. I see I see and what was the follow- up to that I mean I mean that I'm assuming some of these places put in requests longer than a week ago, oh yeah. So if you, if you're a school that applied for a street in a park and did not get it, and you also indicated that you have an outdoor yard, you should have received a response from the outdoor learning, email, myself and Jermaine, basically saying you're approved to use your outdoor yard right now. That is that's all you're approved for you may or may not receive further approval for your park or your street. That's not a promise that approval is coming, but you are approved for your existing school yard because, as I mentioned earlier like there are schools that do not even have schoolyards that we're still trying to accommodate and streets are limited parks are limited, and so we're just trying to make sure that the schools that have the various the very like dire need are the ones that were getting to. But all schools should have received some type of response by now and if they have not, I heard you mentioned that a number of schools had not. I would love to hear from them. I want to make sure that they're getting the the touch points that we've been sending out and I obviously mistakes can happen. So if someone was overlooked, I acknowledge that as well and I'll make sure they have a response. I just want to know the schools that have not heard anything got it. No, that makes sense I mean, because some schools have tiny yards that are also on the roof that do not help with ingress and egress and even with half capacity they're still too small yeah. That's probably what's happening yeah, and I acknowledge that as well, and I wish that I could help broker some more space for schools and we are still trying to do that. I will say that Parks and Rec's department of Transportation have been working around the clock and really just trying to offer as much space as they possibly can without disrupting too much the general flow of the city. So that is very much at the top of our minds, and I heard your question about stickers on sidewalks for entry and dismissal. So I wrote that question down, because I do not have a response for that now, but that does make me think janine of another piece of our puzzle that I did not mention. We do have an internal working group in the DOE, so in addition to the interagency group that we have with city Hall and all the other city agencies, there's also an internal working group that pulls on folks from all parts of the division of the deal, all divisions of the DOE and within that interagent enter working group. We do have the first deputy Chancellor's office, a representative from that office and she is working on entry and dismissal specifically, so I'm actually taking a note on that to send to her so that she can either get some clarity there and we can just roll that into how we how we talk about outdoor learning or, if there's a need for a separate policy which I do not think there will be. We can do that, but short answer, I'm going to get an answer for you on that. Okay, thank you. You're! Welcome! Thanks for the questions janine, looking at the clock and wanting respect for both of Mr chambers time and the folks on the agenda who are coming next would love to wrap this piece up in the next couple of minutes and so Chris you're going to get the last name thanks. I appreciate that appreciate it Mr chambers, so my name is Chris Lebron, I'm a member of Manhattan Community board. Four. I live in health's Kitchen, public school student and a can of a boatload of retirees from the public school system. How many schools have applied for open street in Hell's kitchen and Chelsea question one? Oh, I do not have a specific background noise if you would not mind muting yourself, yeah, I'm moving away and I'm muting Sir. Okay, I got you so I do not. I do not have the specific numbers for every neighborhood right now. That is something that I can filter for in the database that we do have, but I just do not have those numbers readily available. If that's something that you want, I can't yeah absolutely because Hell's kitchen Chelsea are historic districts. We have narrow sidewalks. Our schools are located in through streets rather than avenues, and so we would like to make sure the kids at Park West Graphic, Arts environmental, Studies, Bayard, Rustin, beacon, Ps11, 51:17, school of performing arts. All these kids lab they all have access to the streets safely and their parents choose to send them on bicycles, but they have access to safe streets. Okay, so, and then number two is I've. Heard of a number of principals being able to have been granted work from home? Has the board of Ed figured out a system by which to identify leaders within schools? So if those leaders can collectively call out or flag problems within the community or within the student body or within their own peer ship to the BOE to rectify any overarching deeds? To finish up the first question, I will get if you can drop or send me your email address, I'd better share with you, the numbers for health kitchen in Chelsea, and also encourage you to reach out to any principals that you know in that area and just encourage them to apply. This is an opt- in program. So, if a principal recognizes a need for streets, then my hope is that they will be applying for those streets same for parents, that they would be pushing their principles to do the same and then on the second piece. I can't really speak to that. That's just not my that's not! That is not the information I came to share and I do not mean that no problem, absolutely not, but it goes. It goes into play into the first question, which is: if leadership is missing physically in a building and these large high schools that I had mentioned do not have parents associations, then what is the mechanism by which for those schools to receive the resources that they need? I mean it's a great question I and I I'm going to take a note on that just to share with my colleagues, but I personally, I do not have that answer right now and I think it's a valuable question. Lastly, third question: I apologize last question please. So if a school has a spike in numbers within the teacher's population or the student's population, does the BOE have a plan of action to notify block associations and local small businesses that a school is being shut down and going over to 100 online learning because of a rise in numbers yeah? I hate to do this to you again Chris, but I also do not have that information. That's just not within the outdoor learning scope, but I will say we do have. We have just started this week, a situation room which is this. It's a basically a 24-hour room that is staffed by representatives from all parts of the division, all parts of the DOE every division, including deputy chancellors, the deputy chancellor, that I work closely with Karen Goldmark is actually on tonight in the situation, room which is basically where principals can call in for if there's a Covid-19 spike. If there are Covid-19 questions, if there is anything urgent related to safety and Covid-19, the situation, room can offer specific guidance for that Stephen. Thank you so much. Thank you to the co- chairs. Thank you, Jesse. Thank you, Chris for your questions, all right, real quickly, Stephen any of the information that you said that you would follow up with you feel free to send it to the district office and we can forward it on oh great, that will that will work, make it easier for you. Yes, thank you for that. Let me actually put that note in my notes. While Stephen is typing, just want to quickly wrap this piece up here. If there are thoughts on letters that we might want to write or next steps, we can address those after our friends from the speaker's office have had a chance to talk budget but want to be respectful of Steven's time and let him go and want to move on to Matt and Carl Stephen before we lose. You just want to say behalf of myself as a former teacher former principal really appreciate everything that you and everyone at Ue is doing during this really challenging time. Imagine a speak for many of us on this call and on the board, and we say we know that your job is very hard and that you are doing everything that you humanly can and it's profoundly appreciated. Thank you so much kit. I really appreciate that, and I acknowledge that there's a lot of hard work happening on in this group as well. So let's keep the conversation going. I really appreciate the invitation tonight and, if there's anything more, we can we can be doing for this outdoor learning piece. Please do not hesitate to reach out. Thank you thanks. Y' all have a good night. Alan. Do you want to take back over? Thank you kid that was that was that was very informative, mystique that man, thank you all for coming with some good questions for him. So Matt we're going to put you on next, please just briefly so for some of the newer, the new members of our committee, what we, what we've normally been doing every year for the last couple of years is, we would send out letters to principals each one would take a couple of four or five principles send out letters requesting what they would need. Sometimes it's technology, sometimes it's expensive. Sometimes it's construction. We get these requests back and they and that would go into the statement of district needs and our budget requests this year is going to be a little bit different and we're lucky to have Jessica here. Who is a chair of the budget task force, so maybe, at the end, she'll give us a quick brief overview of how the process is working and what CB4 is going to do. Maybe what kind of time frame it is so we will have a handle as to as to what's going on and in the past. What's happened is the speaker's office? Does their own outreach, and sometimes you know the principals are asking us and they're asking the speaker's office the same thing, so it's getting confusing. So we asked Matt to come in tonight to give us a breakdown, an update into what they're doing and, and this way we can have a better idea of how to feed into it. So matt, it's all yours, great thanks, Alan hi. Everyone thanks for the invitation for having me this evening, so yeah I mean. I think this is a great conversation to have, because you know we definitely want to use the input from the board when it comes to making decisions around the budget, especially you know, as it relates to our schools. So I'll tell you a little bit just for you know a brief background. Every council member has roughly five million dollars of capital discretionary funds that they are able to give out. So those funds can go to. You know our public libraries. Our parks, public housing streets and our schools, and so we have five million dollars and every year we work with city agencies and residents to identify needs, and then we try to address those needs with this capital funding. We also do, as many of you know, participatory budgeting, so we started that back in 2015 was our first year, so we set aside a million dollars of that five million and over the course of really it's a year- long process. But we start in the fall. We start gathering ideas at neighborhood assemblies about res how residents would like to see a million dollars spent and then those ideas are developed into proposals that residents can then vote on in a public public vote. That's held every spring. Unfortunately, due to Covid-19 participatory budgeting was cancelled citywide, so we were not able to finish the and complete the process, but we did start it and we did start gathering ideas last fall so, but that be so that's just a little background in terms of the the capital discretionary funding that we that we do have we just wrapped up fiscal year, 2021 at the end of June and so out of the five million dollars just about 2.9 million went to our local schools, ranging from technology upgrade to playground, equipment to bathroom repairs, to cafeteria upgrades to new HVAC systems, so those items are publicly available on the City Council website. So if you go, if you just do a search for NYC, City, Council and then there's a budget section and you can pull up the capital items that were adopted in this past budget in July, so I think it's great to have the discussion now. So we can continue to think about how do we get the? How do we do our outreach to the schools? Because I know you all have your you know you do your outreach to your schools. We also start contacting our schools a little later, usually in December. We start doing our initial outreach to principals and we request from them their top three priority items that they would like to see funded. Obviously, we would like to fund all of them they're all important, but we do begin that usually in December, and we have then until about March to really start making designations, but that really goes right up until the budget, which is you know the end of June, but by that time in March we usually have a good understanding of you know where we are with the schools and what their priorities are. So that's sort of how we do it from our school. We do lots of site visits at the schools. We have lots of conversations with the PTA, the school principals parent coordinators, but we're really focused on the capital side of things, not so much on the expense when it comes to the school budget. You know the expense side is a little different with the schools we do have. We do support our schools with after- school programming, but the capital funds is where we are most helpful to a lot of our local schools. Okay, thank you, man, so, and looking over the spreadsheet that you sent us and comparing it to what we had requested and some of the other budget requests that we made. We had the one sheet that was a priority. It looks like some of our schools did get some funding for various things: yeah the HVAC system. You had Ps33 with their kitchen requirements, it looks like was it was funded. So I have just a couple of questions: the two libraries that we have Mullenburg and Columbus, which has been going on for quite a while. Now it seems the mullenburg was funded, the other, the other library was not funded. There's a question about the roof. Someone's roofing. The project keeps changing all the time, just update on those two. If you can, if you have yeah, so I think the last time we spoke with the Ddc and the New York public libraries, I think work is expected to start at Muhlenberg later this fall. You know there are a lot of capital improvements to that project. There was a boiler that was going to be replaced. There were some renovations to here. Actually we were actually in this past. So what I sent to the board actually just included the school projects, but the Muhlenberg library there's an elevator replacement, which we fully funded in this past fiscal year. There's also the HVAC system that's now fully funded and the sidewalk in vault was also fully funded in this past fiscal year. So now that you know, I think we are squared away and that project is fully funded so that hopefully will begin this fall. You know also, you know everything had been suspended in terms of construction because of Covid-19, including school projects, so the timeline was delayed, but the last we heard that it was going to resume sometime. This fall. Thank you. It will sorry just sorry ella just and it will result last we heard in a full library closure. So just you know I you know I should double check on the timeline of that and make and see. If that will work, if the closure will be a full closure or a partial closure, as they did with Jefferson Market Library. Thank you also. I do not know if it was last year. You've your office, funded for counselors in some of the different schools came out of your discretionary funds. Is that continuing are all the schools going to have counselors? And you know in our district? Are you all going to have counselors and nurses in the schools? Yeah I mean every school because of Covid-19 is required to have a nurse in their school. Now I mean as of February, when we last spoke about this with our policy folks, yeah everything was going to be re, I mean. If there are specific you know, I would have to check on specific funding items, but I know that, for instance, ps 111, you know, was a school where there was a request for a social worker. They do have a school psychologist and a social worker and a guidance counselor, and they also have a specialist that does a substance abuse for families. As far as I know. Yes, all of those all of those have been those continue to be funded and I'm happy to get back to the board and confirm that okay cool. Looking at my list, I do not see any hands raised on this. I do not know. If there's anybody on the attendees side, I can't see any questions. Any questions for Matt Katie has her hand up. Okay, hey thanks for this presentation. It's super helpful. I have two quick questions. First, I know you were talking about the capital budget, but I'm just wondering which budget do the counselors and things come out of. Is I assume that's? Not the capital budget of yours is it? What budget is social workers and guidance, counselors yeah that so get capital budget? You can think of as sort of yeah the brick and mortar items, things that can be built. The expense funding is more sort of like payroll expenses, so it would not come out of capital, it would be expense, even the discretionary expense. Money, though, does not necessarily fund social workers at our schools. I mean that's a separate pot of money that I would have to get you know I could I could find out. You know if you would like to know sort of the source of that. That's fine. I think you know there's a lot of different sources of funds, including capital money from Manhattan borough, President Gill, Brewer's office. You know that's another part of this that I forgot to mention. We also you know meet with their office during the budget season and we re we review our list of our responses that we've gotten from each of our schools. You know gail covers the Manhattan, the borough of Manhattan, so she has a lot more to cover, but we do want to make sure that we're doing as much as we can to support the school requests here in council District 3., so we do meet with them, but yeah. As far as the expense thing I can I could find out. I do not know, because I'm not really involved in that part of the budget publicly helpful to know so if you could send it over to Jesse or something when you have a chance, that'd be awesome and then my second question I mean look. We all recognize that there are tremendous stresses and limits now on funding for all sorts of things and an incredible need in our city, but as even in connection with our previous speaker from the DOE. You know, schools are desperate for ways to have space to teach their students and of course you know if schools happen to be fortunate enough to have rooftop access. You know that's awesome, but I was involved with one school where you know we wanted to see what could be done about rooftop access and it is so expensive and all the regulations and everything about all the stuff that has to be done. So I guess I'm just wondering: have you been involved with any recent requests and not sort of about gardens on the rooftop or something, but specifically about creating more usable space within school buildings? You know on their roofs and do you envision any money being available in the capital budget this year to help schools with that, or is it just too expensive and you do not think that's going to happen. So it's a really good question because I do think you know we have to change our thinking a little bit and we do not know what the schools will come up with too. In terms of you know the space that they find is underutilized and maybe they'll start school and say: look we have a classroom where we have some space if it's a rooftop or something else that we could sort of retrofit to make usable for teaching. So I think we will learn a lot as we get through the next few months together and we start to have the conversation with our schools but you're right. You know every time we have been approached about doing a green roof or it is very expensive because it once you start allowing students up there, it does trigger a lot of ADA requirements. You need to have fire egress and accessibility to the roof for all students. So that does become a very expensive. You know multi- million dollar project, but we have we've had conversations with schools about this. We would love to do something. I think it's going to take a mix of both private and public dollars to figure this out and do something, but I think yeah. You know. I think that conversation we're going to have with our schools this year about you know in how do we respond to this pandemic and how do we sort of look at our school space, whether it's indoor or outdoor, in a really safe way? So we have not yet, but we will- and I would I am all ears to folks on this committee and in the community for ideas. It's part of the reason why we do participatory budgeting and I'm not really sure, what's going to happen this year, because it's still sort of undetermined how we would how we would do something like that, because so much of it requires us coming together and brainstorming ideas, but one of the real things that we get out of that is community ideas. And how do we do this? So definitely, if you all have ideas and want to continue that conversation with us, we would be happy to do that. Great thanks. Thank you. Matt Chris, Lebron, hey Matt, how's it going hey Chris. What's going on recently, went over to environmental studies where the teachers were doing their training outdoors because of a problem with ventilation. I was wondering I think it's just fraud for the committee as well as you has anything been cited to fix the ventilation problem at that high school. This is environmental studies correct. So you know that particular issue is not something that I'm fully aware of. So I would like to maybe follow up either with you or someone at the school to talk further about that. To learn more I'll connect you with their? U of T chapter leader tomorrow. We do not have to talk about it in depth. Thank you. That's all! Thank you so much. Thank you. Thank you Chris. I do not see any more questions you have. You have Jessica and you have josephine with their hands up no okay, oh too Jessica. Thank you Alan and thank you Jesse and Matt for joining us. I was wondering if you could just speak in apologies if you've already reflected on this, but as we look to make budget requests for the year ahead. To what degree do you think capital dollars are likely to be available as compared to on capital dollars and recognizing just the overwhelming tasks that we have as a city facing us? You know the everything that everything that's been raised here, I think, are absolutely you know, okay to your comments about the expense I mean these are these are things we have to grapple with, I'm just sort of trying to understand what is feasible in this next budget cycle. Obviously, we can't fully read the tea leaves, but it is a very difficult economic picture ahead and I just know typically capital adults. You know sometimes capital dollars are easier or harder to come by and wondering if you could just riff on that a little bit and give us a sense of what you think we could expect in the coming year. Well, I do not want to make any predictions, because I just I just do not know. I do know that you know in this past budget cycle we faced a nine billion dollar deficit and it looks like next year is not going to be much better and it could be worse. Hopefully not, and so you know the way that we are planning I mean, so I do not have any information other than you know. We are assuming at this point that we will still have you know from our end. You know at least the five million discretionary dollars of capital funding to give to our schools. That has been pretty consistent over the last several years, and I just do not know. I mean I'm not really a part of the conversation either about what that, if that will change or not you know, we will continue to do our process of you know outreach to our schools and we will continue to you know, go forward assuming we will have. You know the five million dollars reinstated for the next fiscal year, but so much is changing so fast. I just hate to make any type of prediction about what that, where we will be, you know, come next year sure and any thoughts on the capital versus expense side, and it's been even tighter. Yeah, it's you know, expense. You know Covid-19 aside for a minute, I think you know the expense funding that we get. The only reason why capital is sometimes easier is just because we know exactly it usually goes to city property, so there's no sort of vetting of an organization that may be a non- profit that is requesting city capital dollars so because that generally has to happen with organizations who are applying for expense funding it it's harder to there's just more eligibility like organizations just have to go through a much right: smart company, scrutinized in terms of the vetting process, so that eligibility is much harder. I, the one of the changes from last year, just going back to the capital side for a minute was that to be there are eligibility requirements for capital funding as well, and one of that is, it has to be a minimum of fifty thousand dollars. That was a change fiscal year 19 the minimum was 35,000 to be capital eligible so and these rules are set by the New York City Office of Management and budget. So they are, you know, issued by that by the agency and it's a 50,000 minimum. So that was one of the changes that came through this year shelf life of five years as well, and one of the things that has come up with schools that we often do not know about. But we've started to ask this question: is you know, is the school located in on city property or do they have a lease, because some schools are operating under a lease of five years, and so they would not be capital eligible, so we have run into that, and so, if you all are having conversations you know it is a good question to ask, because the ones they can still receive technology. But when it comes to any type of you know renovation or upgrade to a room. You know the city wants to invest in long- term projects. So the lease question is something that has come up as well. Great. Thank you, Josephine hi Matt, one area where we could definitely use your help is trying to figure out how to how to I guess, guidelines for ptas to share funds if they choose to, because right now in the chancellor's regulations, there really are no guidelines, and I think it only says that you can share them under some sort of like extraordinary circumstances which we are under right now. So, typically we're not you know, schools are not encouraged to share PTA funds. You can't just like one pat PTA can't just write a check and donate it to another PTA. We have never been encouraged to do that now with the tents, it's something a little bit different. I think that they're loosening guidelines a little bit, but you know just for other things like supplies whatever it is, as you know that there are some schools in our district that can raise well over a million dollars a year. While there are other schools that can raise, you know less than 50,000 a year, so it would be really helpful from your office to help us get some sort of guidelines from the Chancellor's office. On how we can how we can better share funds, I've asked for this before and have not had any luck. So that's why I'm asking for your help yeah absolutely happy to follow up on that. I think that's a great idea that did come up a little bit when we were talking about the pebt cards that were being administered to families who did not need the 400, and you know what was it 420,450 on the on their pebt card and how could they share those funds with other families in need, and the PTA question came up and so yeah happy to follow up on that. I do not know too much about that so, but I will see what we can find out. I think that that's great to to think that way and see what we can, what we can do right. Thank you, Jesse. Are there any more questions? No from there's no hands raised nothing in the Q&A, okay, so Matt before we go sort of follow up on Josephine's request for some help on something I do not know if this goes under your auspices, but broadband service to students in temporary housing is that anything that you can look into or do you have funds for that? Can we target any particulars locations that really need help in terms of bringing internet service into these facilities, or should we look? No I'd be asked. For that I mean I'm not bad. To put you on the spot. You're going to you know is that something that comes under your hospices. I mean you know, because our office does constituent services and we do work with families in temporary and transitional housing. This is something that has that. We've worked on, not to say that you know we have the funding to then get the Wi- fi there, but to at least you know, escalate the issue to the powers that be to help. So this came up. You know, with technology being distributed to families who were in temporary housing, so they could continue to do remote learning through the through the spring school year. So we do. We did have conversations with the department of education about that. If there are, you know, we understand that you know, but yeah we can help. We should have probably a follow- up conversation about what families have been reaching out to you about assistance and how we can do how we can work together to help them cool. Okay. Thank you, man, David Pink, is you have a question for Matt, hey Matt, how you doing Buddy, hey, David Nice, to see you yeah, it's good to see you my friend, listen! You know. One of our budget requests was for a consultation with Indiespace.Org, which is a to deal with the incredible loss of all of our theater spaces, with no ability to recover until God knows when the funding request was the response from the city was that it needs to. This needs to be studied further. I'm just curious. Are you familiar with that request, and do you have anything that I can relate to indie space to talk about how this vitally important cultural priority needs to be addressed by the city? This is about allowing you know people to keep their spaces that they have not been able to make any money to pay rent on for six months. Probably it's going to run for another. You know another six months, yeah I mean it's a major issue right now, so you know I do not have any specific information about indie space, but I would invite I would be more than happy to have a conversation with them. There are a lot of resources that are out there there's a lot of conversations that are happening among our cultural organizations. There is one that's happening almost every day and with hundreds of cultural organizations throughout the city to talk directly with city agencies about assistance, so I would be happy to connect them to that conversation and yeah- I would be happy to you- know, follow up with them directly, but it is a that would hey matt that'd, be great too. I know the League of independent theaters been is leading a charge about the council. Rent movement for associated nonprofit nonprofits throughout the city, including theaters and they've, been one they've been looking forward to reach out to Corey to have a chat about the bills that are you know in the state legislature right now about this I'd love to be able to set up a call separately just with lit and with indie space. Just to you know, to check in with you and see if we can arrange a meeting or something yeah send me an email David. I do know you know there was a a town hall with a lot of the businesses in council district three last month that I that I attended with a guy who's, been spearheading a lot of the organizing around that yeah. So, okay yeah. So we have a lot of testimony from a lot of independent theaters, which was very helpful, but we'll talk to a guy and say: oh yeah. Let him know yes yep, so we're continuing that conversation thanks Ben all right! Thank you! Mack Alan Chris Lebron would like to ask one follow- up question. He had he had his final question. Come on Chris Miss, one two three hold on hold on. Let me find a bit so before we circle back hold on he's all right: Chris you're, available Chris. Yes, I am thank you so much okay. So I think this plays into David's question and it's overarching for council district. Three. We have a lot of people who work in the arts. There's supplemental income is bars and restaurants. However, we have not been able to open up theaters now. She says we're not opening up theaters until 22. can we start to research, the feasibility of outdoor theater space in Chicago. They are using outdoor parks for social distancing for the support of classic arts, as well as comedy in long island city. There's a privately owned parking lot. That's been supporting comedians like Michael Che, who used to live in a district and then also Brooklyn museum is doing an outdoor movie. Space supporting celebrating Chadwick Boseman is: are there opportunities in Chelsea and Hell's kitchen to do the same, and would there be in a larger conversation, along with the independent theater groups, to have them utilize public space for their theater groups? Can I suggest that the League of independent Theater has been leading with that proposal all summer long to very little success with the with parks, the Department of parks? It's been a really important idea, trying to activate you know the parks and neighborhoods we're actually want to talk with Bob Benefatto about you know, working with bids to be able to maybe to activate some sales space in some of you know their locations, but frankly, we did not get much of okay, sorry guys, but I did not get much of attraction with the Department of parks, so that was something we'd love to work forward. Sweetheart like all right so Chris. Maybe we need. We need to take this up at parks again or I would love to you know Alan, having brought that up push it onto the agenda for next month. Yeah, having brought this up at parks this week, or rather last week, everyone seemed very fine with fitness instructors using public space and selling their resources and without the benefit of the community. We have dewy Clinton park, which is our largest green space in Hell's kitchen being utilized one dimensionally and I just would love an opportunity to have a conversation with parks with our our theater groups, our people who are invested in theater and the arts to just discuss. What's the, what can we get in terms of programming because we do this in central park and we do it in Prospect Park and I think it's nice. So, yes, let me make a suggestion. Why do not you- and I talk about this- we'll put something together and present it to the co- chairs of the Parks Committee to get this on the agenda for the next month? Thank you so much allen and thank you so much David for having spearheaded this. I did want to thank my murloc from State Senator Horman's office for being here and also Luke Wolf from Scott Stringer's office to be here before we circle back to kit and see if we need to do something more formal, with the first presentation on outdoor learning Jessica. Can you just give us a little brief rundown as to what the task force is going to be doing and when it's going to be doing so we have an idea in terms of the time frames and things nothing. You know sure. So the every year committees are asked to reflect on their own priorities, as we've just done here reviewing the list. I want to offer some kind of broad just framing, which we've already really touched on, but is this idea of a very challenging budget cycle that we must expect in the year, if not years ahead, and so, as the budget task force began, to discuss at least informally, we'd really like to recommend that we keep the format as we have in the past of this longer list of priorities, but that we will really focus on as a CB4 a much smaller list of key priorities again recognizing just the very challenging budget environment that we're in so the budget task force will be meeting on. I believe it's next week, September 22nd. I believe, we'll begin to review your alan will be representing this committee as part of those discussions. If we look ahead, we will be using the November full board meeting to vote on the full, the full suite of materials which will include a letter and then, as I mentioned this longer Appendix list, which will be ranked according to the budget task force's review of all the priorities as they do every year. So between now and the next meeting it'll sort of I mean I leave it to Alan and kit how you want to handle the review of the past priorities, but really this is an opportunity to review what you've submitted previously, perhaps re- rank, but also with that identify really the top. I would say top one two, three things that you think are really absolutely essential for strong consideration going forward, and I you know the task force has yet to formally meet. So I can't speak to exactly the criteria that we will be using for what is included in the letter. But some of the comments that have come up and speaking to others have really been about identifying those top few priorities to be the things that impact the greatest number of people. So you know, I really encourage you to think about, perhaps not individual schools, although I do not wanna it's up to this committee, how it decides it wants to handle things, but but you know when we think of our whole district or whole city. These are the kinds of things that recognizing again the very tight environment. We're in that we may want to put the most pressure on in terms of advocating for funding in this next budget cycle. In addition to reviewing the list that you have of past priorities, one of the things we thought would be interesting was to see if there are any, not necessarily Covid-19 specific requests, because this is a budget. That's for right, next year's budget, but things like some of the things that have been discussed today, which Covid-19 revealed. So you know I know, Josephine's talked a lot about access to. You know Wi-, fi and bandwidth that will support full families using you know doing distance learning. Those are things that maybe we did not put in past year's budgets because they did not seem as essential as they are in this moment. I would use that as an example of something that we may want to include on that short list. So again, in addition to reviewing the historic priorities, this seems like an opportunity to put together that short list of things that again are kind of covered related, if not specific, to the virus itself and then. Lastly, I want to acknowledge that we in some initial conversations felt like it would be helpful that we expand the budget task force, expand the number of voices that we hear about the unique needs of our district, and so we've discussed doing a survey specifically to gather more feedback. We have yet to decide the scope of that survey and that will be forthcoming at the budget meeting next week. That could be done in one of two ways. One would be just asking people: what are the needs, as you see them, and or alternatively, sharing some of our top priorities and asking people to rank them, and then I'm sure there are additional approaches that I have not yet thought of yet, and I look forward to discussing on the 22nd, so I hope that covers Jesse is there anything you want to add to that. This is my first first go around at this, so no, I think three, that's pretty specific. So, just for the folks that know our document pretty well, the idea would be that kind of that top one two priorities, Covid-19 related issues or you know the economic impact issues that Jessica mentioned would actually be in the act would be a kind of part of the Appendix or part of the statement of District needs statement at the beginning of the document and the actual priorities that we always do would still remain the same. Just so, people understand whether where that would look it would, it would be. You know, an additional document that we would include into our statement of district needs cool. Well, thank you. Thank you. Thank you. Thank you. Jessica. Let's say you have a question. Sorry, I was trying to unmute myself Matt. This is for you usually, as you know, in these times, a lot of the things that are getting cut are more expense related like service or people. So do you know anything in city hall, whether they're going to I know it's very usually expense and then capital. Do you think any of that is going to bleed through it all because it like, as you see like, we need basket service or people losing jobs, that type of thing- and it always seems like the expenses- are the ones that are really that we need the most in financial straight times I mean I do not have any real insight onto what that is going to look like over the next. You know for the next fiscal year I do know in this past fiscal year budget, though I mean we had major cuts, acrosss the board to a lot of initiatives that we had funded. For example, we had a because you brought up, you know wastebaskets, you know we have funded through different initiatives and the NYC Cleanup initiative took us a substantial cut. It could happen even greater so next year. I do not know. We do not know that. We won't know that for some time, but I would we're expecting that it will get worse before it gets better. Thank you for that. Good News, Sir, Man Kit. Is there any action that we need to take on the outdoor learning presentation, good question that I'm probably going to kick out to the committee to get reactions to in a moment, but just quickly want to circle back to David, Pinkes's question and comments around opportunities for folks in the theater community I saw Michael wiggins either is or was one of our attendees he's from the little island organization. That's building the island in the Hudson and Jesse, either has sent out or will be sending out information about an opportunity for artists to apply to perform there. That will be compensated. I know it's just sort of one opportunity, I'm guessing it's not a huge one, but it feels like everything counts in these times, so just wanted to flag that as something going on in our area. That could be helpful to some folks in the theater community did not know about if they do not already I'll. Just add to that. I do know- and I forwarded this to kit and allen and then also christine and Dale, just because it sort of coincides with transportation. I believe the city is beginning to roll out there. I do not know what they're calling it but they're. You know open streets for performances program, and so I know that they are in the beginning stages of that and that there was a that there's a call, I believe scheduled for you know for D.O.T to start beginning to have that conversations with community groups. So I'll look back into that and get confirmed when that is- and I think it's good to have someone from this committee- maybe and also transportation- be on that call with the city cool. Thank you, Jesse. Okay, take this off newt here back to Allen's question any follow- up that we want to do coming out of the presentation from Dewey Central on the outdoor learning initiative or anything that sparked for anyone. It could be. Thank you for coming letter. It could be yeah. I have something real quick. I mean I'm going to hop on this again. Is the free car storage taking away from the students learning? I think we should definitely if we can somehow send a letter regarding that. Maybe we can cc our transportation committee, but it's outrageous that storage would come over. Students needs all right if I do not mute myself three times in a row, I want a prize. So I'm hearing you correctly you're, hoping that we'll write a letter where one of the things we'll share is. We think that space for students to learn should be prioritized over parking space. Yes, and I would work car storage, not parking space, and also I mean it would be. We should use stronger lines that could outrage. I mean think about it. You're supporting an inominate object over the learning of a human being saw Katie. I think it was a dress kit. I think Steve Mr Chambers addressed that actually and the reason why they were keeping the car parking. There was for the teachers and the staff, so they can drive to and from if they did not feel comfortable on public transport. I do not know if anyone remembered that part that part of it, okay, Katie, I saw your hand go up. Did you want to say something similar? Is there anything you want to add there yeah? I was going to say something similar to Leslie and just say that I know that I'm very familiar, that this is a big issue for teachers and that they want space near the schools, and so I appreciate your issue David. Absolutely. We want. You know space for the students to be prioritized, but I do think that that they're doing it specifically to allow for space for teachers to park nearby and that you know it's not going to they're, not impossible. They can park a block away or they can set aside somewhere where they can park a block away, because what they said was they needed people to monitor it in case the motor cars move. So if the futures are parked there, then they would not have to remove the whole day. They would not have to monitor a parked vehicle. So it's not just the teachers, it's also the neighbors. So I think either we could. If the teachers parked it fine, they can park at a certain end. You have to have the monitor, but he was talking to someone monitoring the cars, so they would not have to do that if they parked there all day. Also, I still think child's learning is more important than the convenience of the teachers. I mean. I do not know where they're coming from I ride. I bike every day to Brooklyn, to where I work. So I mean I leave very little carbon footprint and you know I mean I do not know fortunate David. I know many of the teachers at least at like my kid's school. They were all coming driving in from long island. Actually, so they did need parking spaces and they, I think one of the issues is that the if you try and say we're going to close down certain streets and allow no parking and that's for the schools and then we'll take parking on other streets and make it only available for teachers. You know eight to four or something that is going to make it just crazy local community opposition. So I think, as long as it's only teachers allowed on the school streets. Of course, the teachers are not going to be wanting to go in and out a lot on in their cars. I do think that we want to encourage teacher parking and discourage other people parking on those streets, but not incur the wrath of too many community members. If we're trying to take up basically two streets worth of parking, one for the school and one for the teachers would be my thought. Well, I think we should try to discourage anyone from talking if we have to as a necessary evil to allow the teachers it's in their union contract. I probably that they are guaranteed some parking somewhere, but the big thing was the budget and the resources for having a monitor to monitor those cars. So that's a personal and finances just leave the cars alone, then they put teachers parking at a small segment of the block that the students are on David. I appreciate all that you said this. I think this is a little bit above our pay grade at this point. It involves too much city involvement with you know, with cars people parking not parking. I think what Steve Chambers pointed out was that the monitoring of the streets get closed. Okay. So it's not like you have it's just like the open street concept that you have now. It's only local traffic that can go through so they're, not through streets where cars are going to be coming by with p, where someone is going to have to stop them from going through 21st street Ps11. It's been closed, for I do not know how long, except for some local traffic that comes through. So I think just if you do not have anything else in a letter to go on this subject. Maybe it's something you want to take up a transportation, that's a possibility, but I think for our committee. That's my personal opinion. You know certainly feel free to disagree. It's a little it's a little bit above our pay rate. So that said, I do not hate to cut you off, but I think we'd like to move on to our last topic, and I think that should be an interesting one. Is that okay with you David Allen? Yes, thank you did raise her hand if we could just get her reaction. She might be about to suggest something that could go in a letter. Oh sure, just two quick points on the parking I mean. I think that if we were going to write a letter about the parking we'd certainly have to hear back from more schools on teachers who want to do it, but I do know I have heard about this issue. Yes, teacher would certainly like to drive and maybe what they need is just some sort of you know something to put on their windshield during the height of Covid-19. Essential workers were allowed to have some sort of special permit. So maybe that's easier. You know they do not necessarily have to be parked on the street where that's shut down for learning, but if they have a permit, they could park on. You know basically any other street. So maybe it's something like that. I do not know, but I think that we would certainly have to reach out to schools to see if it's really worth doing a letter on. But the other letter that I did want to discuss was a student's in temporary housing needs a letter in terms of that and reaching out to the shelters. We have at least five shelters in Community Board, four, that are housing families with students, many that attend our schools and making sure that those schools do have adequate Wi- fi, because we keep getting stories that they do not. The DOE says that they do, and then we hear that they do not. So I would like to do some outreach in terms of that and to see you know. Maybe we do a letter to see if we can get some feedback from these shelters to figure out exactly what Wi- fi that they you know that they have access for and also, if the, if the shelters are making any space for them to do any learning, because one of the biggest issues that the kids are having that live in shelters is that they have to do this. Remote learning from their room, while multiple family members are there, and you can imagine how hard it is to concentrate on a call when you have multiple family members in the same room and right now the shells are not. The shelters are not providing sort of a common space or some other space where students can work which makes remote learning nearly impossible, especially for young children. So that's another thing that I'm very concerned about. There is a group of PTA parents who have been trying to raise funds for headsets for students, so at least they'll have that to help with the remote learning, but the space and the Wi- fi are two big issues that I think need to be addressed specifically, since we have a large number of students in temporary housing in our Community Board Jesse. I see your hand. I was going to make a suggestion and I'm guessing you might have a similar or better one, but I was going to say: maybe we bring folks into our next meeting, who can speak to the different dimensions of this in order to write a letter on that topic? Yes, that's for sure, but I was just going to roll in the fact that housing is this week. Housing committee is this week and department of homeless services will be attending and I think what we should do, because Maria is sitting on this call and she's going to be co- chairing. That committee is maybe, if we want to get some specific questions to DHS tomorrow. That will give them time to be able to answer those questions in terms of the shelters with families with children, the temporary shelters with families with children, and so I think we could. You know, speed that up a little bit in terms of because we already had that set up on the way at housing and they're coming to discuss the temporary shelters beyond those ones that you're talking about. But I think that would be it since we'll have them in the room. That's a great idea! Yeah! I do not want to have to wait another month. So that's a great I'll, I'm happy to forward some questions to you tomorrow. Jesse yeah well conclude Maria on that. Yes, Maria, yes and- and then I think, but Kit's point is valid. I think then what we can do is we what we find out from those questions? We can build some idea of what we want to bring to the committee if something more specific from coming from that committee from our committee on that. On that side, that's all I was going to say- and I agree with kit that we should have somebody either Michael, Hickey or Iris Gersten come back in October and just give us a follow- up, so I see hands from Sabrina and then katie, so we'll go there next really quickly. On Josephine's point folks may have seen this there's a really interesting piece in the New York Times. I believe the magazine section if anyone wants to, if you have not seen it brush up on it, really helps us to understand the complexities and the challenges of navigating that system which are only exacerbated by Covid-19. So I think yes Sabrina you're next, can you hear me yeah? So actually that was my comment I listened to in the podcast today and about what you were saying about this article in the New York Times magazine about these kids, who are in sheltered family, which is, is not very compelling and really hard to listen story and again back to josephine point that you have to for giving a case about these kids that do not have a space where to study, and not only because I live with multiple families, but also parents might be working too. So you know, I wonder, I'm just thinking ahead like okay. Well, maybe there's a space for them, but who supervises his kids too? If there is something that the community can work to, have you know somebody who can come and kind of babysit in a way to his kids and yet to really? I really recommend the space in the New York Times. Again, it's really powerful thanks, Sabrina katie you're up yeah. I I'd love to be included on the suggestions josephine that you're thinking about that will go to the housing committee and I'm also on that committee. So I look forward to this discussion on Thursday, but I was just going to mention. I was actually in touch about two months ago with the head of one of the shelters that has families actually not in our district but further north anyway, and she was saying that one of the issues is that all the students, the New York City Public school students in her building. They had the Wi- fi enabled devices. But the problem was that there was only one place in the building that got decent service. And so there was no way that the kids could actually have appropriate social distancing because they all had to be in the same place in order to do their schooling. And so I think there may be sort of a disconnect, because I think a lot of times when the DOE folks hear us talking about they're like no. We know everybody has the devices. But the point is not just the devices the Wi- fi enabled devices, but the point is, but in the buildings is there enough space for the students to actually get the Wi- fi on their devices right? And I think that's one of the things we need to help focus on and the other thing is sort of. I guess to both your point just being and to Sabrina's point the idea that you know it would be great if the students had somewhere to go. That is not in the same room with other people is, could be a good one, but the problem is you still need the social distance thing so having one room where a bunch of kids go gather is not going to do you any good and how is it going to be supervised? So I think that those are things that we do have to help address and frankly I love the idea at least of the headphones. I think that would be appreciated, but but I do think we really have to focus not just on the Wi- fi naval devices, but on making sure that there's enough reach in the buildings. Thank you for that point. I'll. Definitely, you know craft the questions to address that. I you know when we've done some after school tutoring in the shelters, they have allowed separate spaces for kids and but you're right. It's. This is for a lot of kids, it's not just a few, so I do not even know if that can ever be addressed, but at least it's something that we have to talk about and put in writing somewhere. Just to add to what Josephine said Katie, I think he made a lot of important points there and I think it for me confirms it'll, be valuable to have a public conversation about this next month to surface these issues with different parties in the same place, because you know I do not doubt the DOE is doing everything it can to get Wi- fi enabled devices to kids who need them, but we also know that you know the solutions are not working for the families that are on the receiving end of them for a lot of very complex reasons that we should do more to figure out. How do we? How do we support here so just saw Wendy's hand go up, and then I have an idea for a quick letter that we might write but I'll. Let wendy talk perfect. This is quick and maybe something to add to the letter. But to me it is it's unacceptable that we have children with Wi- Fi enabled devices that we supposedly buildings that have Wi- fi and then they're issues of there's just certain rooms that it's not strong enough for these devices to work like a lot of that is basic internet speed, testing and then getting people in to run diagnostic tests and just and fix it and improve that. So I think in terms of maybe it's a question for the meeting on Thursday, or maybe it's something we add to our letter, but just to this conversation about more robust internet offerings that even for places that maybe have been yes, that building is wired and it has Wi- fi. Is there an easy place? People can call and say it's not working for us in these areas and then what's the city's responsibility in helping to facilitate that, because that's it. That's crazy. Totally agree, I do wonder if it's something that more goes with the letter that comes out of hopefully next month's meeting on this topic, what I was going to propose was just a quick thank you to DOE central and specifically the gentleman who came to talk to us today, something that has been a trend in conversations that I've been part of around the DOE is. It is important to establish a relationship with DOE central, that's something that we have talked about. It's something that I've heard principals say it's something that I've heard folks at different levels of the system, voice in a variety of ways, and so would love for us to try to nurture that relationship, because, hopefully this is not the last time they come and answer our questions sounds good Jesse. We need to formally vote on that. I again, I guess, if is it? Is it truly simply a thank you letter with no recommendations or suggestions? I think that could honestly be an if it's okay with you guys an administrative letter yeah it would not require it would not require a full board vote right. Yeah this way it can go out, it can go out. You would get out a lot faster and you probably would not have to explain it so much right. If that's, if it's simply just that, if it's more in terms of recommendations, you know things like that, then I think you do want to make a full board making a full board letter all right. So it sounds like we have an administrative letter that I'm just Chris is asking some questions in the Q&A I want to know. Maybe we can answer those fam. You know honestly we'll take the questions and look into it. I think we want to move this along David if we can copy these questions down and we'll try to get some answers for him, but I do not know okay Chris yeah. If it's in reference to the conversation we'll have a DHS on Thursday, then why do not you follow up with me directly and Maria and we can circle back and we'll make sure that we get questions answered? Okay, virtual learning? Can I just jump in there before Leslie and I apologize Leslie just because we can go back to budget real quickly, just because I want to make sure- and I and I apologize if I missed this when you were describing the budget process this year Alan. But I feel like I just want to make sure we're all on the same page that you guys sort of thought the best route to take this year, specifically with the DOE requests, was to do a sort of rather than try to do. All of this outreach to the principals right now, as we normally do, and it's sort of adopted school and chased them down was to sort of take the information that Matt provided us in terms of what was left unfunded from the principal's requests in terms of capital and expense requests that he sent us and then mesh that, together with what we did last year as well, which was meet with the superintendent and a number of principals and get a sort of broad spec ideas of what they're needing and put that together as being the requests for this year. Yeah is not that accurate, so I think I think so because then what we did last year, which was each of the members, go out and chase down a principal and get them to fill out a form, and I and I think the new way is actually a much more effective model and less sort of tiresome for you for members, but I just wanted to make sure we sort of all collectively had that agreement or conversation about it, and I second that Jesse not going and trying to chase down the principles, not this year. Okay! Well, I just wanted to make sure we just had that. There's a there was a space for folks to be able to express how they felt about that and, if they're, okay with that, and that we would be having a follow- up meeting. I think Kit was working with the superintendent on that to sort of organize that follow- up meeting like we did last year, which I thought was very for you guys, was very helpful in terms of just sort of getting face time with principles so yeah all right. That's all I wanted to say: okay, thank you. I think I think, maybe between now and the next meeting we're going to try to do some informal conversations with the Ed Group and the other group so try to maybe come up with a with a plan to address how we get some more information, but I think I think we need anything. We need to do some more talking rather than just waiting for another formal meeting, so we can try to maybe get some ideas out there and put something together so anyway. Leslie did you want to take this virtual? Give us this virtual tour of this virtual learning. Well said yeah, I guess we'll just do a summary of the letter that passed unanimously at the last board meeting that's great. This was something that kind of were was something in theory over the summer and it snowballed really quickly and actually jessie. I think on the meeting. Maya is still is still here from Brad Hillman's office because she worked on this as well. So I do not know if I'm sure everyone will read the letter, so this was born just really out of necessity of synchronous learning, which was not happening with blended learning in the DOE in the time of Covid-19 right now, quick, summary, blended learning, they had to split the kids in half or sometimes in thirds, and when one section would be in school, the other section would be home and then they would flip and that schedule would change depending on the school. So the principals had no more bodies. So what would happen? Is the teacher who had half her class in live there in the building would teach them while her other half of the class was at home, doing like cold worksheets, maybe their parents or caregivers were helping them anyway. This was going to be another disaster and repeat of what happened in March, so we came up with an idea of just spitballing. Why do not we? What bodies can we get that can fill that hole? So I reached out to pace Columbia Teachers College, Fordham, nyu, Mr SUNY, and I asked what are your student teachers doing with nowhere to go, and they said oh, my gosh, we're so glad you called because we need them to get their accredited hours to graduate on time and we have no places to put them anymore. So what we all came up with and then Josephine jumped in and she was awesome and we kind of worked on a team as a team on this. We then talk to the principals at Ps, 111, Ps51 and Ps33. Those are our title, one schools, so those are the ones that have the probably the most in need student populations, and we just got everyone in a room together and we tried to formulate a plan before we went to DOE that there would be student teachers. We would break down the kids in pods of four or five and have the student teachers go on, live with them for virtual learning the days they were home for blended learning and they would not go over new material just go over whatever the teacher taught them yesterday. They would reinforce if there was any specific problems or issues the kids needed to go over. They would do that, so we presented to DOE. Surprisingly, they loved it and they actually. What was great and josephine, could probably speak to this too. They approved it in one day, literally the next day we got approval and we were. We were shocked because you know once it goes into that DOE black hole, it's never coming out. So anyway, they are now working with these higher education partners that we coupled for them, and I think there are some I think, they're trying to get like there's some fingerprint issues and background check issues, but nothing that they're not going to get passed. So I got to say this: it's really as Josephine said, this is a really big win for public schools and community participation, because this was something that we kind of worked on really hard. We all we all of us got it done, and and now these kids are going to get live, synchronous learning, oh and it's going to be prioritized, I believe the kids who need it most and it's up to the principles who they determine, which kids will need it most, but we're talking like eight nine hundred kids here that are that's going to get this service so anyway, and they they're set to start October 1st. I believe so. That's it josephine. You want to add anything today. I think she just did a great job of laying out. What's there. I can't really add two more just to say that I think a lot of the focus is going to be on reading and so not just reading, but identifying students who need extra support with reading. So the student teachers, along with their mentor teachers, are actually going to be specifically trained on this area, and this is something that the superintendent has been working on all year. Long and they've figured out or sort of are using a method now and so they're currently training the mentor teachers and the student teachers on how to identify kids, who need extra help with the reading, and then those are the kids that will receive this extra help. So it's really great for the kids super good work. Thank you, and we just heard actually SUNY was just telling me last week the other week that some of the upstate districts, upstate New, York districts, have heard about this and they're actually copying it as well. To get for people that's more. Their problem is kids are remote more remote and they have to be at home, so they're going to try and incorporate as well. So it's I'll learn I'm going to hear more about that tomorrow, but I think I think this could be maybe a good little testing pod here in our district and see if they can incorporate it elsewhere. Yeah super okay, all right cool. So before we close up for tonight, I wanted to ask blake to give us if you had a brief update, blake's been working on his the news. Rack problem that we have throughout the city blake did you want to do that yeah for sure I did not want to step in front of Kv if she has her hand up for something about virtual learning yeah, it was just really quick about virtual learning, one I just think Leslie and Josephine. It's so awesome that this got done and well done, Yay for both of you and I'm just wondering. Is there any like data gathering possibility here like? Will we ever in some way find out like how many students were served? How many of them might be? You know, students who live in shelters or- and you know, will we ever see like a aggregate like and the projection as the test scores went up by this much I'm just wondering if there's any way that we'll be able to see like, was this successful or is it so broken apart? Like teachers, college is doing one thing and somebody else is doing another thing and I'm just wondering sort of if there's a way to see the success of it. That's a great question and I think that we should do a letter to ask. Maybe I do not know you know kid if that if you recommend doing a letter asking for that specific data, but I certainly would like to know about it and since the mentor teachers are going to be working directly with the student teachers and the principals, there should not be an issue with tracking where these kids are like. The schools know who all the shelter kids are they get a list every year, and so it's very clear. You know where the child is, and so I'm sure you know this is not going to be just limited to students in temporary housing. It's just really it's based on their academic level. So, but I do not see that there being any issue with being able to pull that data, but it is something that we have to ask for, and I think we should ask earlier rather than later so then they would know that. That's something that we're looking for yeah. I think it's a really great question katie and potentially something for us to discuss further when the education group gets together, let's table for now josephine, if you know, or if you are able to find out what program they're actually using. I can speak probably with more accuracy to like how hard or how straightforward it would be for achievement data to be shared with us, given how complex things are right now, and the fact that state tests did not happen last year might not happen this year. A lot of the typical ways that we would talk about academic success may be hard to pull off, but that does not mean that we can't measure impact in some way. That won't be a unreasonable ask on district 2 schools that are participating. So let's definitely circle back to this. Any other comments. Questions, oh okay, yeah for sure, thanks for the time for a quick news, rack update, so you know before the pandemic. We had started work on this with department of transportation, where we had spoken to them about the current news. Rec violations and the kind of you know enforcement of those violations, and we actually found that they do not get a lot of user reports through 311 and they had been looking at some potential changes to the regulations around user acts which are actually pretty detailed. You know everything from distance from curb the distance from you know: fire hydrant and curb cuts, and so you know at the time we had decided that a productive approach would be to actually go around the neighborhood and file 311 reports on used rack violations, of which there are many. Secondly, to ask the district office to reach out to the publishers with reports of these newsrook violations. You know just to see if they might help us to remediate them and then third see if there are any consistent themes that could be edited in the regulations. You know one example is right now, it's very difficult for D.O.T to enforce non- usage of the boxes. Since you know, publishers would often say that the they were just being refilled and you know DOT just inspected them at the wrong time and there were no publications in them, and so you know with this kind of three- Prong approach, I was hoping to kind of restart on the on this project now that it's safer to be outside by starting these 311 reports- and you know looking around and taking pictures of these news racks that are in violation. So I did go out and you know documented about 10 of the violations last week and want to continue to you know, look around the neighborhood. A lot of the boxes are on the on the avenues: 8Th Avenue and 9Th Avenue in Hell's kitchen. Just to get you know more quantitative sense of the issue as well, as you know, have this kind of data for DOT, as well as the provide feedback to the to the publishers to help us remediate it. So you know, I think, we'll be talking more about this with the street life group and if anyone else would be interested in helping to you know, look around at boxes and help file. 311 reports yeah feel free to reach out it's a lot of fun. Thank you bud. Good work sounds like you need some volunteers. Anybody want to comment on this or ask blake anything or no, it's been a good meeting very good meeting. I want to apologize for throwing those dates out on these info informal chats that we want to have hopefully, as many of you who can participate in it, won't take too long. We just want to get a sense from you guys from the groups in terms of you know. Where do we want to go? What do we want to do that kind of thing? Throw some ideas around and you know try to try to make some changes. Try to make some things happen in the city. Anybody have any new business that they want to up there. You go new business, one new business item and one quick explanation just want to acknowledge that we had originally said we were going to talk about Ssos this month as sort of the second part of a conversation we began. We chatted and thought that, since that initiative has a very unclear timeline that could be multiple years. It was not as pressing that we continue that conversation now as the things that we talked about tonight, all of which felt time sensitive, so we're not planning to never go back to that, but we did not go back to it tonight and then something else that Alan- and I have talked about- we've also had conversations with several folks on the committee about is in different ways: the school facilities situation. I asked a question to the comptroller's office at full board about funding we've. All you know noticed and had conversations about progress or lack thereof, of projects that had started before the pandemic and their status is unclear, although some seem to have resumed and then there's tons of chatter about our HVAC systems, where they're going to need to be do kids have enough places to wash their hands. Are all the windows going to open the way that they need to, and so we were hoping we might invite SCA to our meeting next month, and if we do that we'd love to get questions from the group that we can maybe tee up for them, and so not thinking that we would write a letter or anything tonight more wanting to float that as something that has been talked about in large and small groups that we want to bring some folks in to share information with us on. Thank you again. Is there a motion to adjourn or motion to Adjourn? Thank you. Thank you all see you in the next couple of weeks. Hopefully thank you Alan. Thank you. Thank you. Everybody bye guys. You.",
            "summary": "Specifically, we have asked some questions around outdoor learning, but we'll turn it over to him to give us a quick presentation on how going back to school on the 21st is going and then, as Alan said, committee members will have a chance to ask questions and we'll open up to the public to ask questions as well.\nThere was a big one that we just kind of called the DOE approvals or the schoolyard approvals is a more appropriate term where we sent to schools, saying yes, you're approved for the schoolyard that you indicated in the survey that you already have and that you did not make any additional requests for a park or street.\nThose were what we called our priority list and those were the schools that we basically tried to meet the needs for first and then gave parks and Street some India Sorry Department of transportation, NYPD time to review the remaining schools, and We have acknowledged that you do not have existing school yards You did not receive your request for a park or a street, and in that list initial initially in week, one, there were 28 schools in that list, And. So it's been my job to basically give those schools a call ask if they have any additional recommendations that they would like to submit for review either a street or a park so that we can try to accommodate.\n153 schools have been approved for use of a street and, as I mentioned, earlier, 12 schools are still on our list of no school yard and still we're still trying to find space for them to utilize for outdoor learning.\nA lot of questions have been asked, around, are tints and how to use tents, or are schools allowed to use tents, we're actually working on a sub policy now, where tent guidance will be provided?\nThink Let Josephine is one of our board members who you've been in touch with speak to us in more detail, but one of the things that we've been talking a lot about is safety and how these spaces will be supervised.\nAnd I know that we also have a general we're, also thinking about and working on, general guidance for safety, especially as it relates to areas that are at risk for crime, and so that conversation is being had-.\nWe have a half of another person who are not half of another person, but his time is split that are working on managing inquiries, calculating data daily having daily interagency conversations with city, Hall, Fdny, SAPO, sanitation, NYPD parks and recs every day, every morning.\nA lot of folks in this in this group have read about the pandemic that took place in the early 1900s and how outdoor learning was utilized during that time, and so we're definitely leaning on those examples and just having conversations with community groups.\nParent groups, folks, who have been doing outdoor learning before this, was a necessity for all and gleaning some best practices there in terms of timeline and how long we see this operating right, now, just to give you some concrete response, park permits and street permits are being dated for an expiration of November 30th of 2020 in terms of the first phase of outdoor learning, and that is just in response to how we predict weather, starting to shift drastically and obviously with Covid-19 still rampant and still moving throughout.\nWe do not know how Covid-19 is going to impact our school year, and so the plan right now is to basically do this until November 30th Restart This program again in the spring when the weather starts to improve, And then we're also, as I mentioned earlier, when we talk about looking at other examples of outdoor learning, thinking about temperature weather thinking about outdoor heaters.\nAgain, I'm not going to speak too much on the tent piece in general, because there is actually like policy being developed right now for that- Even in the school yards, I'm not separate from the streets.\nThere is going to be more flexibility for school leaders to use their tents in school yards and parks over streets, but the policy will cover all outdoor spaces in terms of the heaters.\nDo they need to go through your office if they want to request some sort of police presence, or you know for them to come by on occasion just to keep an eye on things depending on where they're located or does that have to go through your office?\nWe are trying to encourage all schools to come through the DOE in terms of any individualized supports, so we're essentially like brokering these conversations between all agencies, and this is at the request of the agencies, especially some of some of like parks and Rec's department of Transportation.\nIs schools were reaching out to agencies individually and trying to request streets or parks without a real, streamlined process, and it was for lack of a better phrase- chaos in some in some of the agencies and trying to trying to meet the needs of schools and want to make sure that they're, not you know offering a school one street that another school had already requested through another process.\nThis PTA policy you're coming out, with, because, as somebody who was the PTA president for many years at two different schools, I, know that ptas, who do a lot of fundraising and have access to funds, often work with sort of fellow schools that do not have access to funds that you know.\nSo yes, that that's happening, and actually one of the things that came up in the conversation earlier today was a concern around not wanting ptas to start to think of other schools as charity and needing that support in that way, Exactly considering, all schools are part of our overall community All students.\nJust wondering is that one of the partner issues that you're going to be working on or is that being left to somebody else, I'm thinking that will probably fall under Sapos, which is like the permit office, the safety permit.\nDo we still hold space for students and teachers to you, know, exercise, teaching and learning, but then also be respectful for residents that are living in the same spaces, so that kind of falls in the bucket of an individual case right now, but I think that conversation is going to have to resurface as we get closer to the school year, because I do foresee We're going to commit things over to the public in just a moment.\nSo, that's not a part of the outdoor learning initiative and they would just need to reach out to parks directly and parks is already aware that we actually had a submission for that over the weekend for a school They have a special events permit process for that.\nIt's still helpful for us to know what schools are using their pre- existing play street And so that one came from an anonymous attendee and there are two questions from the same individual apologize if I'm mispronouncing any part of your name, but it looks like Janine Keeley First question was for schools that are using the sidewalks and streets for extra space during arrive on dismissal.\nThey continue to use these public spaces during the cold weather months and then the second question was: Does the DOE have any guidance on how schools can mark the streets and sidewalks I.E, chalk, stickers, etc?\nThe use should probably be restricted to entry and dismissal and not for actual outdoor learning, but they do still have access to the to those sidewalks in the same way that they would, during a traditional school year on the street, side.\nSo when I send out like the data for the day or when we have conversations about certain needs that all happens within that one chain, Department of Transportation is on its city halls on it, and so that is the way that we'll be marking streets.\nI know that was just an example that the questioner just probably threw in there, but I really want to make sure that school that those streets are as protected as possible and we've actually had some specific guidance around certain street requests that they used a certain type of barricade.\nYou may not have heard back from us yet because we're still working through the schools that apply before you, but we do also want to make sure that you are not being kind of like if we overlooked you for any reason, you would reach out using the outdoor learning email address.\nThen there was the conversation of That's, probably going to turn some teachers off from even showing up to school, because that will then kind of force teachers to take public transportation when they may not want to do that, or they may not feel safe to do that.\nWe're, not sure if they're going to need even need a permit right now, because if the streets already closed off under the department of Transportation and NYPD, they would essentially be kind of protected during the school hours to park.\nThanks for the questions, janine, looking at the clock and wanting respect for both of Mr chambers, time and The. Folks on the agenda who are coming next would love to wrap this piece up in the next couple of minutes and so Chris you're going to get the last name, thanks.\nAnd they're, asking the speaker's office the same thing , so I think this is a great conversation to have, because you know we definitely want to use the input from the board when it comes to making decisions around the budget, especially you know, as it relates to our schools.\nOur, parks, public housing streets and our schools, and so we have five million dollars, and every year we work with city agencies and residents to identify needs, and then we try to address those needs with this capital.\nWe did start gathering ideas last fall so, but That be So that's just a little background in terms of the the capital discretionary funding that we that we do have we just wrapped up fiscal year, 2021 at the end of June and so out of the five million dollars Just about 2.9 million went to our local schools, ranging from technology upgrade to playground, equipment, to bathroom repairs, to cafeteria upgrades to new HVAC systems.\nWe would like to fund all of them they're all important, but we do begin that usually in December, and we have then until about March to really start making designations, but that really goes right up until the budget, which is you know the end of June.\nWe have lots of conversations with the PTA, the school principals parent coordinators, but we're really focused on the capital side of things, not so much on the expense.\nYou know everything had been suspended in terms of construction because of Covid-19, including school projects, so the timeline was delayed, but the last we heard that it was going to resume sometime.\nAlso, you know meet with their office during the budget season Gail covers the Manhattan, the borough of Manhattan, so she has a lot more to cover, but we do want to make sure that we're doing as much as we can to support the school requests here in council, District 3.\nI do not know, because I'm not really involved in that part of the budget, publicly helpful to know My second question We all recognize that there are tremendous stresses and limits now on funding for all sorts of things and an incredible need in our city, but as even in connection with our previous speaker from the DOE.\nWhere you know we wanted to see what could be done about rooftop access, So, I, guess, I'm, just wondering: Have you been involved with any recent requests and not sort of about gardens on the rooftop or something, but specifically about creating more usable space within school buildings?\nYou know on their roofs, and do you envision any money being available in the capital budget this year to help schools with that, or is it just too expensive?\nIn terms of you know the space that they find is underutilized, And, maybe they'll start school and say: look.\nThink that conversation we're going to have with our schools this year about you know How do we respond to this pandemic and how do we sort of look at our school space, whether it's indoor or outdoor, in a really safe way?\nWhat's going to happen this year, because it's still sort of undetermined how we would how we would do something like that, because so much of it requires us coming together and brainstorming ideas, but one of the real things that we get out of that is community ideas.\nThank you, Josephine, hi Matt, one area where we could definitely use your help is trying to figure out how to how to I guess, guidelines for ptas to share funds if they choose to, because right now in the chancellor's regulations, there really are no guidelines, and I think it only says that you can share them under some sort of like extraordinary circumstances which we are under right, now.\nI think that they're loosening guidelines a little bit, but you know just for other things like supplies, whatever it is, as you know that there are some schools in our district that can raise well over a million dollars, a year.\nHow could they share those funds with other families in need, and the PTA question came up and So Matt before we go sort of follow up on Josephine's request for some help on something I do not know if this goes under your auspices, but broadband service to students in temporary housing is that anything that you can look into?\nIt's been a really important idea, trying to activate you know the parks and neighborhoods we're actually want to talk with Bob Benefatto about you, know, working with bids to be able to maybe to activate some sales space in some of Sorry guys, but I did not get much of attraction with the Department of parks, so that was something we'd love to work.\nAny action that we need to take on the outdoor learning, presentation, good question that I'm probably going to kick out to the committee to get reactions to in a moment, but just quickly want to circle back to David, Pinkes's question and comments around opportunities for folks in the theater community, He's from the little island, organization.\nI know it's just sort of one opportunity, I'm guessing it's not a huge one, but it feels like everything counts in these times, so just wanted to flag that as something going on in our area.\nI was going to say something similar to Leslie and just say that I know that I'm very familiar, that this is a big issue for teachers and that they want space near the schools, and so I appreciate your issue.\nYou know space for the students to be prioritized, but I do think that that they're doing it specifically to allow for space for teachers to park nearby and that you know it's not going to They can park a block away or they can set aside somewhere where they can park a block away, because what they said was they needed people to monitor it in case the motor cars move.\nI know many of the teachers, at least at like my kid's school.\nThink one of the issues is that the if you try and say we're going to close down certain streets and allow no parking and that's for the schools And then we'll take parking on other streets and make it only available for teachers.\nJust two quick points on the parking I think that if we were going to write a letter about the parking, we'd certainly have to hear back from more schools on teachers who want to do it, but I do know.\nI do not know, but I think that we would certainly have to reach out to schools to see if it's really worth doing a letter.\nThere is a group of PTA parents who have been trying to raise funds for headsets for students, so at least they'll have that to help with the remote learning, but the space and the Wi- fi are two big issues that I think need to be addressed.\nIf it's more in terms of recommendations, you know things like that, then I think you do want to make a full board, making a full board letter all right.\nThink Kit was working with the superintendent on that to sort of organize that follow- up meeting like we did last year, which I thought was very for you, guys, was very helpful in terms of just sort of getting face time with principles."
        }
    }
}