{
    "YoutubeMetadata": {
        "author": "MCB3",
        "channelId": "https://www.youtube.com/channel/UCgVg6dmZHCxze_ay0bolPew",
        "title": "CB 3 Manhattan - Executive Committee meeting",
        "publishDate": "2020-03-27",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB3",
        "normalizedName": "Manhattan Community Board 3",
        "twitterName": "Community Board 3",
        "youtubeChannelName": "Manhattan Community Board 3 NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
        "twitterHandle": "@CB3Man",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Or you know the being grounded forever or so hi. So I don't hear you guys there, though so I'm it looks like I'm. Just gonna have to grow my hair long because okay, I'm going to go to the barber again yeah mark wisely did his last moment - that was mark, like I'm being grounded for life. I'm. Talking to my sister about that today. How are you doing I feel like I've been grounded for life. She said it's just 12 to 18 months, you're, so dramatic [Laughter]. Well, we have made the kitchen usable. Then you know cooking twice a day. I Alicia can hear us this damn Chinese virus I can't believe he's doing that man, it's trying to fucking start a war, and it's just so stupid. It's like if there's one country that we are gonna need the help of you know they can make these fucking masks. You know they have a lot of people with platelets that maybe we need you know. Maybe here yeah. Can you guys hear me do okay here we go stepping into I, don't know I and raising works in these meetings. Oh. So Clint is going to be in charge of the hand raising for responses and stuff like that, no there's a chat component. Where someone you know you can stick up to the side anyway, get some feedback. That feedback makes it unusable. Hey the feedback is terrible: okay, where's Susan, is she c3m yeah, yes, okay and sounds mi sees you know who it sounds. Am I see was that honest making this beer, a private viewer, a member of the public sounds I see it might be a member of the public. Okay sure we don't have quorum, but we could start you okay good evening. Everyone and thank you for logging in tonight on our executive meeting community for three. Can everyone hear me thumbs up hands raised or if you give me okay, great, thank you. So we're gonna call meeting to order first way. I need an approval for the previous month's minutes. Someone like to make a motion to approve the minutes from that harassments meeting a motion to approve Thank, You Megan a second and me any opposed any abstentions. Okay, thank you. So, first on our agenda, we going to talk. Okay, yeah, so clintus want to explain how we're going to do this tonight. Okay, so I'll give you a little brief tutorial on zoom here tonight. You'll see everyone is currently muted. I think for these larger meetings, that's probably gonna work best, at least to start with that we mute everyone. If you go to at the bottom of your screen, you should see some options. There's invite manage participants share, screen chat. If you click on the manage participant, screen or option you should get at the bottom. You should get a feature that actually that allows you to raise your hand. Does everyone see that so I think for you don't see that David? If you open the manage participants, just a screen pop up on the right hand, side, yes, and at the very bottom of that, do you see the raise your hand option now, No, let's search yeah, so it does. If you open it the whole way. I do does now everyone see raised hand at the bottom so for now, I just hadn't, muted, everyone you may hear a little bit of, but until we look through the basic instructions. Okay, so it is if it's in the middle of your screen, that's fine too I can't be here. Do you hear me? I can't be yep you're out how to do this screen in the bottom left of your screen. There should be a video with a red line through it, see you okay, now you're okay, so one quick question who is sounds NYC must be someone from the public. Davey says he gives a feedback yeah, we can mute yeah. So we got everyone set up: okay, so I've, muted, everyone that should have hopefully eliminated the feedback. Is that correct? Okay? So the other option at the bottom of the screen, there's managed participants. That's work gives you the option to raise your hand. If you would like to say something raise your hand, I will call it I'll mention to Alicia and we'll call on you I guess in order for now, there's also a chat option which some of you have already picked up on and you're using. That is something that ever if everyone wants to keep that open in the right hand, side we can kind of see messages that they, you know as we go through the meeting as well, and then we can unmute you. If you want to raise your hand, there is another function at the bottom. At the far right of your options, it says: reactions, there's a plus there's a thumbs up in a clap. Sometimes that might be helpful if we're just asking for. If everyone agrees, maybe just use a thumbs up, we don't have to get a audio feedback and then I think that's probably a good general. Does anyone have any questions whatever you called it? The one word asked to be recognized. Raise your hand. Yeah I, don't see that on my screen, okay, see mute, stop video invite chair, screen, reactions, Oh, maybe more participants. Oh okay, I see it now. Okay, so I'm gonna, mute everyone again and Alicia is gonna. Take over and begin the meeting. Okay, let me unmute you good. Okay, thank you, everyone for your patience as we are learning this as we go along. So the first thing up on the first item on the agenda tonight is a resolution for immediate support for New York City, small businesses impacted by the corona virus and so you've gotten an email from the office. In my correct, did everyone read the email from Susan with the resolution? Your nod, your heads, I, see you okay! Thank you. Do you want to share this great half on the screen, the resolution yeah? Okay? We could do that that'd be great okay. So if there's any members of the public that have not well, you haven't gotten a chance to read. This only went out to the executive officers of the community board, so I will read it and you can read along as well okay, so, whereas New York City is facing health emergency, unlike anything seen in over a century, whereas measures to slow and stop the spread of CoV I D - 19, while essential and justified have caused significant economic hardships, whereas required aid and support programs for countless small merchants and their employees will be substantial, whereas all levels of government must work collaboratively to provide needed. Economic relief in the immediate near and long terms, therefore be it resolved. Community board 3 recommends the following actions: to provide immediate relief for all restaurants, hotels and small levels, commercial establishments, suspension of all fines and associated payments for a period of six months, automatic non free renewal of all city and state operating permits and business field filings for a period of six month. Suspension of state sales tax filing for a period of three months, suspension of commercial rent taxes for a period of three months. Immediate expansion of no interest loan programs provided by the city I think we need to correct that. Provided by the city and an increase of the loan amount of one $150,000 further, be it resolved the community board three requests: the city's Department of Finance analyzed appropriate property tax relief measures for a period of one year. That will allow small merchants to reduce rent and operating costs, while also allowing small property owners to sustain lies, their buildings income streams further, be it resolved community board. Three requests: the State Department of Financial Services ensure that businesses, interruptions related to a public health emergency be quite be considered a covered event for insurance purposes further, be it resolved community board. Three request: funding for economic and Community Development organizations be strengthened and maintained to assure support services for small merchants and continuation of community-based efforts that will provide for a sustained recovery. Okay. So now we can make amendments I, believe the floor is open to make an amendment releasing for at least raise your hand, okay, lady and Lee, so also okay, I just wanted to so I just wanted to make some small amendment, and that is a memo. Just came out from Cory Johnson increasing the request from City Council for the loans to be expanded to 250,000, though I think, if that's what it lasts before, we should be asking for the same. If we could just change that 150 to 250. Why did not let him me okay got it. Thank you. Making Lisa had her hand up -, okay, go ahead. Lisa I thought it was clapping. I thought it was great. Oh okay, okay Michelle actually raised her hand as well all right, thanks, yeah I said I actually had a question, not an amendment yet, but is there a specific reason why it's only street-level businesses I know it includes hotels and other businesses, but there I feel like there are a lot of other like nail salons or like hair stylists that aren't necessarily street level. Will that impact anything with that language Megan? Do you have any input on that? Michelle asked the question: okay, Megan! What's your response, I can't hear you hold on Meghan she's, actually, myself, okay, yeah, so one of the one other quick thing. If you yourself I, can't undo you, then? Oh okay, sorry, okay, I'm, Friday, I'm gonna! Try to be on top of it. You keep everyone, you did it, but if you go in and view yourself I can't then I'm you you'll have to do it yourself, okay, yeah I'm, happy to change that street-level commercial establishment. Maybe it could be humane, recommend the following to provide immediately for all restaurants, hotels and other may be, and all other commercial establishment establishments affected by the kovat 19 crisis. What do you guys think of that? Yeah? Okay, let me just find it. I'm sorry therefore be resolved. 83 recommends the following actions about restaurants, hotels and we're going to say nail salons and barbershops. No I was saying instead of just saying. Instead of all street-level commercial establishments, just put all commercial establishments affected by the köppen 19 crisis, if that's acceptable to everybody, okay, who's, Paris, David, I think you might have to unmute yourself, okay, fucking sure, which way it was this is it's pretty gets pretty wide open this way. Are these really forget the term for businesses that serve the public as opposed to like my business shut down or we affected? We certainly don't have any sort of public facing component sort of like no retail component. Is it? Is it retail or is it public services? What's the word public accommodations or something like that at least I think you might want to help us out with this term? No anyway, just my two cents, I. Don't sorry we say in my work: okay, is anyone taking minutes, but it's not as Eric as the one is. So you know you guys got to get this together here, I don't know, but someone has to send in minutes tomorrow morning. Is that correct, Michelle, so Michelle? What I need tomorrow morning just to make it a little easier? Is the changes in the resolution you couldn't send the other stuff in a little later, but if we could just have this resolution first thing that would be helpful. You Megan, did you erase your hand? Did you have something else to add yeah? Can you guys hear me yeah David? Was it public services that you were thinking of? Is that the word like? Is it all commercial read all it would make sense to me. Maybe one of the other people with their hand up has a has an idea right now, so everyone, let's give this a shot and see if it's chaos just that way, we can actually have a discussion with not having to keep up with ruse on you to do so. I'm going to hug you everyone right now. What sounds good? Can you hear me? Yes, okay, I agree. All commercial establishments affected by the virus can we put in? Is this our resolution or we do we get this resolution from somewhere else where we would have like the Liberty to amend it? We got it from Tim Laughlin, but we do have the liberty to amend it because they're, not the same categories of things, right, I, agree about the all commercial establishments affected by the Covid-19 19 virus agreed with Michelle, because I we do have below-ground businesses and second-story businesses that are small businesses. Restaurants, just two seems to be one category of eating and drinking establishments, all of which seem to be affected and hotels seem to include, and we could we could parse them out or deal with all of them together, but they who the independence, the small, independent hotels, but also the independent of the hotels that are supported by big conglomerates right. So that's like a vast categories of businesses, and maybe we should be saying, convert all commercial establishments affected by the co19 virus, which include eating and drinking establishments, hotels and other service businesses, so that we're more inclusive yeah I mean our like cuz I. Don't want to exclude the other businesses. I do want to include I, see that the burden right now has been on the survey, the one serving patrons right, but that's gonna, expand. It's gonna become more and more businesses and yes may in Chinatown I'm commonly just referred to as small businesses, because it is the smaller businesses that are the most vulnerable. Well, this is another question: are you excluding I, but the small is not there. There's, no people don't try to define like how small is small right, I mean I, don't know if you want to exclude New York City relief for larger businesses. Well, can we just maybe talk about our community district yeah? We don't have to speak for the entire city of New York right, but we've got big hotel chains in our district, but they are well. What do we think? Is it important? What are we trying to do here? I mean that all businesses, or is it the smaller independently owned ones? I mean yeah focus is obviously in the small, independent businesses. So couldn't we focus our resolution on that I'm sure others will have. You know other resolutions for those businesses. Sure I do think that yeah smartos the language. Let's go back to the language, that's on the resolution so right now the language reads that therefore the first therefore be it resolved community or three recommends the following actions: to provide relief for all restaurants, hotels and old commercial establishment affected by the cove in nineteen biros. So we need to change that language right. So what are we changing that language to this is may I'm suggesting to change all commercial establishment to small businesses so take that out altogether? Is that what you're suggesting me, restaurant and hotels, with just the word hospitality? Does everyone agree to that? I? Don't see the need to do that, but what does that accomplish? That doesn't either keep it small, it's more weight. Let's try to speak one at a time. Okay, go ahead. Lisa finish outdoor Hospitality is a little amorphous for me. I think restaurants, hotels and other small commercial establishments affected by the coronavirus would do it and I do not think we should limit it to Community Board three I. Think one thing we've learned here is that we're all in this together we can't just take one small neighborhood, because the virus spreads and I think Alex had something to say Jack and they're, helping each other okay. So let's go Alex, Jack and Trevor. Okay, Alex go it. It's fine I, just wasn't sure why we were separating out restaurants and hotels from other eating and drinking businesses, all of which are affected right. Okay, though I mean you hear, is not bars or clubs or music venues or you know, which I guess not eating, but they're drinking. Okay, all the damage, you know, Jackie raise your hand. Jackie are you there hands not raised? It was lowered, it Trevor. You raised your hand, okay, and this is more for Clinton hangover running. This call one of the ways that we were able to keep the space bar but I and that allowed open sort of people talking over each other. Although aren't really experiencing right now on this option, it is so right now, I am muted everyone, if you're still muted, you have yourself muted. So also is that in you're in the we're getting feedback, that's the other problem here in the office we're on three different headsets. Usually, if we're in a group, we should probably be around one machine at once. The acre, that's something will rectify going forward right well, I. Do reason why I was working the spacebar option or another option? Is it's a small step to speak as opposed to clicking that? But if it doesn't work in fine I would just stay with this I'm for the person that has the music playing in the background, and we can hear it can you please lower it? Thank you. So yeah I was just going to say that when we were talking about the public accommodations, that's the term for any business that serves the public that whose biz op er Asians affects commerce. That could be a general term if we want to use that. I know that there are other businesses that will be affected by this. But if we're concerned about like the mom-and-pop comrade shops, that might be the best term to use okay, Linda, that's okay, I just noted you need to change the word affected to affected I've got it. Thank you, I, don't know if we resolve this, but if we haven't I mean we don't have to enumerate every business, we say small business mention the ones you've mentioned and say smooth some hands. All small businesses impacted by the coronavirus and I think I think I think we're kind of overthinking. That's a little bit agreed Jackie raised her hand again. Do you do you have something to say he has something in the comment box, okay, Jackie asked, he said: I have a comment about the first bullet I wonder if we can ask the city to reactivate the finds forgiveness, amnesty program, that's what that's! What he's asking for I don't know, I believe what he's asking is that the fine should just be forgiven. They shouldn't be required to do basically suspend all fines periods so that people just don't have to be concerned about it. I'd support that I don't know the full ramifications over whole. The virus, under the fear for the first day or four, am I correct indefinitely. That's suspension for forgiveness, so change the word suspension to forgiveness. Is that correct, Jack Jackie? Are you typing something or speaking, because we're not hearing anything you're, saying okay, he's typing is that, okay to change the word suspension to forgiveness Jackie, she says we can have I consider reactivate the five forgiveness amnesty program so adds a suspension of all fonts and the word forgiveness that doesn't make it sense. Where are we putting that? The first bullet point under than therefore clause? David something else that you pasted it into the comments as well. The department finance will only resolve your violations through forgiving vines that end with the amnesty program. If you pay for all your eligible violations that are in judgment on or before, December 20 December, 12, 2016 5, our amnesty, a person or business named on a violation must pay and admit liability for all of their eligible violations. Yourself. Can you hear me it's sad I, don't know where David? Where did you find that rule? Where did you find that rule? He says the name of the program is forgiving fines, the New, York City amnesty program online, so I think you can ignore anything like that. We are in a state of emergency. The governor is doing all these executive orders and we are not going through previous rules and regulations. But, just like you know, the Open Meeting Law has been. What I was trying to point out was that the name of the program is called for giving fines : the NYC amnesty program and I would also want to say that we should say that we should ask them to modify. If there's there should be no admission of liability. Exactly you know we should we ask them to reactivate the forgiving fines, full name of the program and ensure that there is no admission of liability. I, don't know anything about the forgiving fines program, so I'm not really comfortable about putting it in the resolution. I'm happy enough just to keep it with suspending fines or forgiving fines. Instead of suspending fines, but I don't know have enough about this particular program. She's right, let's just put the words forgiving fines, as opposed to you special forgiveness, of all fines and associated payments for a period of six months and then regarding the how we're gonna describe the businesses. I agree with Susan I think we're overthinking this a little bit. Can we just put all small commercial businesses affected by the Copa 19 crisis and, just like Mae said we don't have to actually describe. What's a small business? Yes yeah, yes, so I think it's up at the very first section. The first therefore recommends the following actions: to provide immediate relief for all, and you were saying commercial businesses well yeah, so get it rid of restaurants, hotels, yada, just say for all small commercial businesses affected by the covert 19 crisis, because I mean it could be a right. It could be a place. You know it could be an arcade, it could be I, don't know a yeah, there's no point bringing down, and you want to take out the word small as well. No believe it. Okay I'm, not sure if there are small businesses that aren't commercial and that might be a little redundant but yeah Jackie is with two exclamation points, even though you muted people, if there's passive noise, your microphone state, it looks like whoever has iPhone has a lot of background noise and your mic stays open. Whenever we go silent, we can hear you so right now. I actually unmuted everyone. So if you're muted, you muted yourself at the moment, I can remove everyone if we want, but no I'm saying that, like one stays completely so if people stop talking you'll see it go to that particular person, David I, can't unmute! You do you. Have you? Okay, now you're gonna, you just muted yourself again, David, that's a choice of technology! Okay, are we all ready to vote? Yes? Okay? So who would like to make the motion to restart to approve the resolution? Are you good? Thank you, Lisa, okay, Megan. Second, all agreed. Okay. No, nobody else opposed right. Okay, no extensions! We may I may raise your hand what's up me. Maybe you have something yes, what's going on? Oh no I think it's fine now couldn't have muted. All of us cause right now. I have no control over anyone. Okay, so, okay, at this moment the motion was carried and we approved this resolution now can go before the full board. Okay Susan has a resolution to approve the block party for Harvey Epstein assembly member Harvey Epstein for in this party for May, ninth East, 7th, Street, Avenue, B and C. We have a resolution for that as well. Oh, you don't have the resolution okay. So the resolution is to disapprove Harvey's black party for may 9th on East 7th Street between avenues, B and C, and we just can I. Have a motion to approve. Ask a question: first, why this is being her command? Why is this being heard by the executive? Because can you hear me? Yes, if we don't, we have to have a transportation committee just for this it's emergency times. This is something that is we're definitely going to support. There's nothing to find out about it and you didn't want to have a meeting just for this. It seems under emergency times. It's a proper thing to do so. We didn't know about it in time to put it on the agenda for the transportation committee or worried about this or express your frustration, I think it's I! Really, don't understand it. So it's under these you know things have changed. This is a very simple thing that the Transportation Committee would certainly you know, approve it's a block party, which is something we encourage. Harvey wants to open this new office and have a black party I, don't know if they will still have it under the conditions, but this will give them the option but to have a whole meeting. Just for this, which requires you know under the certain conditions, requires. An awful lot of work does not seem reasonable. That's a very valid response and all I was asking for, was an explanation about why something so Cathedral would be heard by the executive and I do feel. Like probably, we see if I have a little longer discussion about how we're going to handle a lot of things if the situation is transferred drastically that we don't want to have committee meeting well, I think we plan to do that later in this meeting. Probably we should have waited to hear this until we had that discussion is my opinion, so that we would have had some context for hearing it. The floor is open for discussion. If there's no discussion are we approving? Is that how you take a vote? No I need to I would like to have a motion to approve. Well, if it's being discussed, it's already been moved, so that's kind of confusing when it can introduced. It should be moved at that moment. Okay, so I'll go ahead and do it, but I I'm, just kind of, as you know, point of order object to a future of discussing and modifying and then at the very moment of supposedly taking a vote. So once 10 is now, can we hear a motion? It's a okay I would consider this one moved and ready to vote for and in the future we should move before we discuss. Voting I am avoiding the floor is open for voting all in favor any opposed. Okay. Thank you. Everyone motion carried all right, so more chairs report wow. It's really not a whole lot. That I have to say, except for the fact that I'm grateful that you all were able to give online tonight and I'm, hoping that everyone is taking care of themselves and taking care not to panic. All of us are going through different things at different times and know that we're going to get through this as long as we all do our part paying attention to the real news and not fake news and not to get overwhelmed by all of it. I want to encourage all of you to check in on each other and on your neighbors, and there might be some people that are alone at this time and they need all of our support. So if you could just do your part as far as being a good neighbor and member of the community and looking out for one another, I encourage everyone in the public. If you're watching this to, please make sure you check out community board website as they're, going to be updates on meetings and times to login to our meetings as we go, live or and we'd use the zoom tool as much as possible and if there's any other product that you have that will allow you to log into our account to see our meeting online. That would be great and right now, I've asked Clint specifically to help us out. As you see tonight, we're getting his support. I've asked him also to continue to help us out he's going to be the go-to person and I will assign to other people to help him out so that he doesn't get overwhelmed and so just be patient with us. As we go through this new technology thing. It's all new to me. I've never used them before. In fact, I've never really done a live, meaning online before so, and I know that this is all new to the office as well, so I'm, so very grateful to Susan and the staff here, as they've been really like, jumping in and getting support from the city of New York. During this time it is very difficult, as she's had to run out and go to Best Buy and go pick up products and things like that and a lot of stuff is just being done just like boom at the split second, so I thank her and that all being said you know we're gonna have full board this way, and so we look forward to seeing with that all is well. It look like we have Susan, we'll discuss the other meetings that are going to take place during her report. I'll, let her share with you how that's gonna work, okay, so next we have that's it for my report. First Vice Chair report which might goal I, don't know if you're still there Mike, it's Michael, still he's there. Michael I can't do it unless you do it. Flint I'm telling you the system you. This is true. We need ourselves, we cannot say same for me and I can't keep it. Unmuted I know what you're saying that we need to unmute, but we can't if we meet ours. Yes, it seems that two actions are required. It seems that you must die mute us, followed by us on muting ourselves, that's crazy, but we all keep seeing that happen. You can do that after you take that action where you say I, just unmuted, everybody I know I'm telling you. Sometimes people can't amuse themselves. It happens after you unmute us and it's a one-time thing. Unfortunately, you're right, it is a glitch yeah with last week how meetings are going to move forward and streamlining them so that we're not having unnecessary meetings and making people either suffer through unmuting themselves or first before the world ended. I went to a census. Meeting represent us about. What's going on with the census a lot of what I learned there I don't know what's happening now, because a lot of their plans like hosting parties where people can mass text, people about the census and door knocking and standing out on the street I doubt any of that is happening now with the census. But these census is out there. People have started receiving it already, I've already completed mine, hopefully you've all completed yours. We will continue to promote the census on our social media, so that public is aware of it. The last thing I want to say about it's just a couple of things. There are some organizations in art that received grants from the Census to do outreach. Those include goals, university settlement and grant street settlement hanoi street also received a grant and what they did there grant was they actually created a interactive census map, it's NYC, 2020 census map, Hester Street org, and you can basically go in there and drill down to any neighborhood to see. You know how many people filled it out last time and what the goal is for this time. The other thing I want to quickly share is what the goals are certain neighborhoods in our district, so the census completion goal for Alphabet City is 2021 for China to 1865, for the East Village it's 3283 and for the Lower East Side, it's three thousand eight hundred and 99. Those are their targets that they're hoping to meet this year with how many people are completing the census. Does anybody have any questions before I move on to the next topic? This is May, there's also an interactive map. I think that comes from the Census Bureau, that's supposed to be some kind of real-time record of who has already answered the census online, which is a little bit different from Hester Street. So if you're trying to drill down to who hasn't already answered, then you go look at that map. You can send that link to me. That would be great, because that might be something that we can share. Okay, thank you based on is the committee request form in your committee descriptions we, as you probably can see, did not NYCHA or the Chinatown task force on this form, because neither one of them really exists. Currently we don't want people to sign up for something exists so before the other thing that susan may or may not be talking about, is that we don't know yet from the borough president. What this whole covered, 19 thing means for new members coming on in april. We know that halted all interviews, so we're probably not getting new members in April, but we don't know when we're going to be getting new members, but we want to get this committee form ready anyway. So at least you had emailed me privately that you had some suggested evidence. Do you want to go over those? If you don't mind some of them, you explained now. I'm. Are you hearing me? Okay, I wondered why those two subcommittees weren't on there. Maybe we should take them off the website. Is there still up on the website? Yeah I think the plan is once we have. This form completed, it'll, go to updates our website and our website put in the new descriptions up. Things were and I. You know certainly leave this tears, but I had some suggestions. Committees are most familiar with the land use committee of making the explanations a little bit more comprehensive, and so my suggestion was for the Land Use Committee, that it say this committee reviews and provides recommendations on land use and development proposals and accordance with New York City for the requirement, including Euler actions, not Euler projects that proposed zoning I'm taking that out. So we take that out and just Euler actions and then the rest of, and then the committee also plays an important role in affordable housing and tenant protections. Reviewing come up, providing recommendations on applications for certain, affordable housing projects and considering matters related to rent regulations and code enforcement. That's new that wasn't in there that's an important part of what we do and then the rest remains the same. I would have send it to everybody, but it was a blind email that went out so sorry, so I couldn't you know everybody wasn't on it and then on the Liquor Authority. So I don't have the problem. With the suggestions to change. You look project to EULA passions, but the second part I did not get it mister. Can you say again for the second part or sure when at least the committee also plays an important role in affordable housing protections reviewing and provide recommendations on applications for certain affordable housing projects- and this is the new part and considering matters related to rent regulations and code enforcement. What kind of code enforcement we we've been taking strong stands about the building's apartment and they're enforced building and how a building code Lily, also the housing code at times. If you want to try, would just be a little bit more clear about what like in that sentence. I would say then maybe like do be cold code enforcement. I, don't I don't want to restrict it do be, it's also housing code. Okay, that's could be HPD well. Is that what you are implying? It's just a description of the committee. It's not like mm-hmm! You can't talk about something because it's not in this now I mean I. Don't have problem with it. Personally is just that I can remember and we did a lot of them. A building code enforcement in the house I mean you probably you've been around longer than I do so I. Just don't recall. When was the last time we talked about building code enforcement, I mean in a district misstatement. We do have something like that, so I mean I. Personally, I don't have problem with the language. This is me: I thought that the committee descriptions were to be discussed by each committee either or the chair decide, but in you see I thought that the committee descriptions were to be decided by each chair or, and they can decide in consultation with their committee as they wish. But each description is not being decided by the entire executive committee, but each committee knows their own work. Then yeah we some chairs, some chairs did exactly what you said. May they worked with their committees and they developed the new description. Some chairs that did it than just did it themselves and other chairs felt their committee didn't need an update at all. As far as the description was concerned, so you know, after consulting with Susan, she thought it would be a good idea to bring all the descriptions to the executive committee for a discussion before we just started using the new church. Okay, so I, don't think we're not necessarily taking a boat on these we're just sort of discussing them sort of similar to some of the other materials that I've been creating an updating. Okay. So we've always just you know, just brought the final thing to the except we don't vote on and approve it. I had told Michael I, don't I had said that I was going to look through for edits also, but I certainly haven't had time. What I want to suggest is like Lisa. The reason we send it out blind is so that it doesn't go back out to everybody and people start discussing it, because that people are very tempted to do that. If you could always just send your edits to one person and then that could be distributed blindly for everyone to look over or we could combine different edits into one page like we did with the bylaws I think that's probably similar, but anyway we're not going to be using the committee request forms for the following month. So if we, you know, still want to look at them for edits, there's plenty of time and as far as taking committees off the website, we can't get rid of committees without a vote. They're sort of deactivated we've done this before, where you were the committee request, form, is to invite people to join and if you're, not inviting people to join they're, not on because it's already closed or whatever they're, not on the form. But it's I mean we could take them off the website without voting them out. But I don't know how people are going to keep track of what we voted on or haven't voted on. If we take them off the website, yeah I mean I, know I'm. Sorry, Michael I wanted to say, because I know that we have the one of the subcommittee's. Currently we don't have a chair for that subcommittee, and so we because NYCHA and section eight they don't always meet on a regular basis. I've just made a decision that we will meet with the night chest section: a subcommittee as needed, and right now we don't really have anything on an agenda for them, and so that being said, I don't want to take them off the website. Just yet I want to just make sure that you know if anything does come available, they will operate as needed in the meantime. What does everyone think about that? Okay, yeah so moving on then Lisa? Do you want to bring up the other description that you have to do? I, don't know if we're going to say that we're gonna take more time. I just might suggest that SLA committee chair official email, so Alex should get it in the mail in the email and if she wants to consider it, she can, if she doesn't, you can just let me know either way what your decision is to make any updates or I'll try to look tomorrow. Thanks Lisa sure. Thank you. Anybody else have any comments or suggestions about committee descriptions all right, so the other document I have we ever during the social media update was that's when it's related to so other than profusely thanking Clint for helping us out tonight. My report is done great. Thank you. Second vice-chairs report. I have nothing more to report, just my putting my nose in where it's in the previous item. Thank you, Lisa treasurer's report and we're going to leave that with the district managers report, because I don't see Hermon on here at all, he's harming on here, okay, so Susan, okay, first of all, just to tell you Herman walked in the office. He never he didn't know we weren't having a website. We have to communicate through the website. I want to make sure everybody knows about the public officer law that I referred to earlier. You know when the governor declared a state of emergency. It allowed him to make executive order changes which he did into the open meeting law, which is why we're having these online meetings. We do have to have it available to the public, but there are limitations- it's not quite as strong as before, but we're certainly trying to be as transparent and inclusive as always, I think it's going to take a month to kind of figure this stuff out, and it will be better next month and transparent inclusive next month. So I just want to say this has been I know everyone realize it's difficult, but this has been incredibly difficult because I never heard of zoom before this week and yet I was I, had a meeting to find out information and different packages and buy the packages. They have no idea what I was doing. We've got no resources from anywhere actually board. Two and seven we're very helpful to me and Clint's been a lifesaver, but it's been, but it's been really I can't tell you how difficult it is. I'm begging people to please look at the big picture and not get distracted by small things, particularly for the next month. We I'm also trying to think of wait and I would like to ask all the chairs to do this to think about ways to disseminate information without meetings. For example, I spoke to do tea today and they didn't need any resolutions or anything from us, but they have some updates. So I think what I can do, maybe is make like committee folders on the website and put updates or powerpoints in there. So people can see these things without actually going to a meeting they're, not things that they're looking for input in clearly anything may be employed or resolution. We have to have a meeting. I have closed the office. I have a sign outside that says. The office is closed. I, don't want anyone in here for health reasons, it's not necessary to be in here just generally just packages we had a mailbox put on outside, so that people could, if we're not here. If the office is totally closed, they could use the mailbox also for stipulations they can use. The mailbox Deidre is working from home. Jim is working from home, it's probably going to be four days a week, ed and I have been in everyday I'm hoping we can get to a point where we're not in here all day every day, but that's the way it's been so far. As far as the new members, all interviews have been cancelled, I think they, the borough president, is going forward on appointing new members, but I'd like to remind everyone that we haven't had new members and they prefer I, don't know how many years- and you know, they're- certainly dealing with a lot of other stuff right now. So I can't imagine, that's there's any chance at all of that happening. This month, I've been talking to the chairs individually about what's necessary, what's not necessary, trying to get agency. Some of the agencies it's impossible, even though people are working from home, so we are not having an Human, Services or economic development meeting this month, we're not having a transportation committee meeting this month. We are having an SLA. We are having a parks and executive committee and full board I. Think that's all I'm prepared for right now feels like I should have had much more, but it's just because I've been busy where he actually had to go out, make disinfectant and disinfect the office, which I do every time someone comes in so this kind of where we're at right now was just you know. My feeling is to get through the next month and we'll see where we are and we'll certainly be in better shape. As far as knowing what we're doing, we go back to my home for the attendants as the next item on the agenda, so Susan I know that we're all sort of learning this new system and not sure if you mean Alicia and maybe Clint- should have a conversation about the full board meeting on Tuesday. And how are we managing that as far as public session and representatives from electives this month and they're, saying there they're not having a public session? What they are doing is they're telling anybody that has comments to send them to the office by 5 o'clock that day and they will be summarized by the chair instead of public session I have been contacted by one elected official who is willing to either give a report or a PDF. You might want to decide which you prefer, whether you want to ask them to give PDFs. Do you want to ask them to give reports I mean you know. I have been I've been watching CB twos meeting on the other half of my screen. While our meeting is going on, they had Brad autumn and talking for a while, so I mean I, guess it probably couldn't hurt to have the electives themselves or a representative talk if they wanted to. You know it's just. We have to invite everyone to the same meeting so and they have to understand that. That's the way that we're doing one nice thing about online meetings is that whoever controls the mute button can time it very precisely so and say: you're welcome to join the meeting to speak. Yes, okay, I will do that. I'll. Try and get it done tomorrow. Tell us about the time limit. Well, I think I. Think I think we'll run it similar to how we are running this, where you know we'll have people raise hands if they have questions after an elected comments, I'm gonna have to limit that it's gonna be crazy. Yeah I think you're gonna do how many questions they're answering and with 50 people. It's not gonna be possible, since this really is a public meeting with a lot more than 50. You know we'll have public people, you can't do a blanket on whatever a mute we might want to do a small experiment. Yep I'm gonna stop talking now. Thank you! Maybe Clint! Maybe you know the answer to this. I understand that with some versions of zoom it is possible to distinguish between the members and public to participate and vote, and all of that the public. Just listening in so hold on one second I'm gonna stop this echo. This is it. They did mention that on the call earlier yesterday, yeah personally I've, never having had experience with that, we can figure that out we're gonna have a call again tomorrow with them. If they have more information, we can you know in the settings when you start the meeting, you know who's who well I, think part of what it is. It's a higher level paid version of zoom, which I don't think we subscribe to when they mentioned on the call. Yesterday they mentioned it that the other guy from gales office sent over the sign-in information for them to use his account because he's had that feature that maybe something we will need to discuss and we can go with a higher version, but right now, I, don't know if this basic version we have is allows that no I'm sure it just not. If I could they might have the higher level. If I could mention what the plans are, we actually asked the borough president to intervene as far as of us all paying individually and it looks like they're going to buy a borough wide version and a license that we can all use. What we bought was for 1 months, because we knew that we might want to make changes. So after the 1 month, we can either make changes, or we may be transitioning to something the borough president is buying instead yeah. That would be good because I think particularly for the full board meetings not being able to control that it's going to be kind of a mess. Okay. So now we're going to go back to Michael with the attendance in the review trouble, you had your hand up yeah, just any event that we don't get a license. We could all be muted and then someone can just okay. The spacebar idea is tempting if that truly works, so that each of us could be but and now I am pressing. My spacebar you're talking, okay, you hear me now and let me unmute. Let me lift my finger. Okay, if you did not hear me when a moment ago, then that's great that works so somehow, if you could figure out who the fifty members are and do what you've done? Okay, it's back to Lisa, you know! Is there anything to do until we need to talk about how to deal with the attendance during the virtual meetings? Yeah we have I can hear, are Susan you're muting. The reason I put the review on there is because it's coming up the review is through March, so after the full board meeting next week, we should be sending you the attendance for the last six months, okay and then get a report on them. Okay and I'll after I remove you that I'll sit down with my gullible. If you don't mind my go-to, when once you got it just give me a shoot me an email and we can either set up something like this and share our screen and go over it together. Or would you just talk on the phone? Whatever is easier for you great thank you, but to Alicia I, guess to your point about attendance during attendance during this I thought we had discussed already that you know there are. There was at least one or two members who had doctor's notes relevant to needing to be quarantined for missing their meetings, so we developed a special attendance code for that yeah we did, and so we need to share that with the exec. So we so what we proposed is for people to have an excused absence. It's a V right Susan! Am I correct? Yes, it's not an excused absence. It's a virus apps absence just to be clear, so anyone that has a know they have to be quarantined or whatever, and some people that are quarantined clearly like Michael, can be on and some people like you know he told us he was just too sick to be on. So what does everyone think about that? Anyone have any comment or question. We put down a V and then against them. It would not count against them in any way, except for the bylaws do not allow for that. Well, these are times that we have it's an emergent emergency type of you know. This goes they'd have an emergency yeah David. It really is a hit, we're operating and this time right now that we're dealing with this is like we kind of trying to figure out something that will work and be against anyone. You know because some people are having to self quarantine and then some people have been told to not go around anyone, so we need to you know honor, that without penalizing them, yes, yeah and some people won't be able to produce a doctor's note. I mean I, can't even get a doctor's appointment. To be honest with you guys so I mean I, don't know there might come a time. I mean I'm still at work and I'm working with a population that gets to come in and out of a building every day. So might come to a point where I have to sell foreign team. I, don't know all right. So does anyone else have any comment? Okay, all right! Everyone! So now we're going to go over the general policy for April committee meetings and agendas only having necessary items. I think Susan already covered that yeah. So I don't need to revisit that. So now we're going to go onto the social media items Michael last week was a changed version of social media policy. So I won't read the whole thing. It's almost three pages long, but hopefully you have had time to look at it and I'm wondering if there's any suggestions or comments about it see Susan do we need. This is need to be honest, not judged. It does because we would have I'm sorry so, okay, so you didn't understand Susan with all that feedback. We need to vote on this. No I got muted by accident. Somehow, so there doesn't seem to be any comment. So I would like to make a motion to pass this new social media policy. Second, do you want to pull it up? I'm, sorry, there's a motion on the floor and it was seconded need a real motion. What was that? What does that mean motion? You need a motion. That's a little bit more descriptive to say you're, you know amending the social media policy as I. Don't know, I guess I'd want to say is shown in track changes. I, don't know if you want to give any reason or not I mean I would say that update just stayed say to update the policy to read as follows, and then the new policy all in favor aye. Yes, aye sessions, ocean Kerry. Thank you now we'll go Michael. Would you yes I'll do right now? Okay, now we're going to move into our committee reports SLA. There were two meetings that there are a number of votes, but nothing unusual. Thank you transportation. She was not there. Perhaps Michelle might report. If there was something controversial, I mean I know that they talked a lot I'm sure about the Grand Street congestion, but I don't believe there were any motions, I'm, not sure, there's there are no motions on the update about the traffic situation, but we just encourage them to think about the problem holistically and not call it like the Grand Street Clinton Street issue anymore, so that more folks feel like it's something that they should attend and because I think Trevor was the one who pointed this out that we shouldn't you know make. It seem like it's only about that one intersection, but there was nothing to go it on around it and they said they'll be back. You know at some point they didn't give us exactly. Susan. Are you there? Can you repeat what you said? Susan and I'm said a word you were saying: maybe if Alicia takes our headphones off again, okay, I guess we can't all be on at the same time, but I said is the vote. She is on the website. If any, you know so, you could see what was the resolutions where I also sent it to everybody on the exec for a review. So hopefully, if there were any problems, you would have sent it back. Okay, economic development, nothing to report. We were supposed to use this meeting as an outreach meeting and it's just not gonna happen. We're gonna suspend our discussions on this special district. For the time being, it also just makes us rethink putting stricter regulations on small businesses right now. But that's you know in any case, we're just gonna put a pause on it for the time being. Thank you. Health and Human. Services me I have nothing particular to report. We were planning and a panel in May and I can tell you we are not going to have it. Okay me. Thank you, I, don't think it's gonna happen. We didn't meet in March, so I have nothing in particular to report, but for the two bridges presentation that we planned from for March. Of course we have to postpone it and I. Don't know if that's gonna happen in May. Hopefully we that's gonna. That would happen. That's all I have comfortable going so cancel it. We did have one resolution, we're not able to vote on. I know that mean Susan and the office tried to get Parks to give. The presentation at this committee and Susan can update me on parks response, because it did not happen so that it was for the Tompkins Square field house reconstruction. So we will not be able to give comments to parks on that I believe it goes to the design Commission tomorrow, but sometimes things like that happen, I anticipate that we're gonna be meeting not only next month, but every single mode, because there's just so many things going on and we've already got one resolution for next month. How many do with the two bridges for closer was an C plan that we need to vote on, so I anticipate we're going to be busy for all the months throughout this pandemic. Yeah. Well, yeah, Thank, You, Trevor, okay, guys, if that's all in the old business, any new business. Okay, may I have a motion to adjourn the meeting: moved: okay, good, okay, thank you of name, Thank, You, Susan and Clint, and Alicia working, that's out yeah, where you going Clint. Let's do a couple experiments! Maybe you serve us where you go ahead and mute everybody and then your ear and then yeah as if it was like we're gonna, be the whole minute. Okay, so I'm doing that now, I'm gonna mute everyone. Now, okay and I can press the space key and you're hiring me okay, because that we can each elect to go in. But now something changed about this a minute ago. I mean during the meeting. So here is I. Think the one thing that changed the option was off I mean. So the option was on to allow participants to unmute themselves, I clicked it off and clicked it back on, and it seemed like that. Kicked it back in so I, don't know if it was just a glitch, but when we were talking about I started flipping around the settings and when I turned it off and turned it back on, that's when it seemed like people could start doing it again. I know it was just a glitch fine for a small meeting. But now, if it's the full board meeting this means. Does this mean everybody will be able to unmute themselves? Well so, but I can I can turn it back. I can so I can turn it off. So let's try one others. Let's try another test, so I'm gonna mute everyone I'm going to turn off that feature and let's see, if you can talk, oh I am able hold on one second one second, I can speak now, try it now, try it nope. Okay! So now that seemed to work, there's this it mute spacebar seems to be working yeah, so I think for some reason. At the beginning of the meeting that setting was just even though it was turned on it wasn't working when I turned it off and turned it back on. It seemed to jumpstart it. No it's gone, but I was wondering if there's a way, if you could send it where everyone is muted again and then and try to unmute just Alex and me or the first two people I see yeah. So we'll let Alex and me try to use the spacebar and if we're able to then we'll let Michael try to obstruct us I'm getting right now. Is you everyone, okay, I can unmute. Did you get something special for me? No right now, it's still set to allow participants to I'm you so go back to the thing where nobody will be allowed to a mute and then unmute just me and Al. Okay I got the little pop-up. That said that it tried to a mute me and my spacebar is what so, because I am you specifically now? If you mute yourself, you hear me yes, but David. Can you unmute yourself? Okay, so I think what happens if I have the? If the setting is turned off to allow participants to unmute themselves, if I unmute you talk and then eat you again or you meet yourself, you can unmute yourself. My spacebar didn't work once Oh and previously before I turn that setting on so right now it allows the participants, but if I'd, so you write it again, let's try it again and I was able to use the spacebar exactly once I believe after yeah. So right now, I'm gonna mute everyone and you should be able to I'm using yourselves again. Okay, yes, you're talking I can hear you I wasn't locking it you yourself and see if you can unmute yourself, yes, okay, so I'm gonna change that setting. So now you can't unmute yourself, I'm gonna, mute everyone and see so now, no one should be able to unmute themselves it just unmuted yeah, so now you're on I, just I, muted, everyone again. So with that setting off so I think. For some reason it wasn't working at the beginning of the meeting, but now it seems to be working. Yes, how? If I turn it off? No one can unmute themselves unless I am mute them right, but I'm wondering if we can set it up where you unmute a few of us and that we can use this.",
        "summary": "That is something that ever if everyone wants to keep that open in the right hand, side we can kind of see messages that they, you know as we go through the meeting as well The first thing up on the first item on the agenda tonight is a resolution for immediate support for New York City, small businesses impacted by the corona virus and so you've gotten an email from the office My correct did everyone read the email from Susan with the resolution?\n, the resolution If there's any members of the public that have not well, you haven't gotten a chance to read: This only went out to the executive officers of the community board, so I will read it and you can read along as well so, whereas New York City is facing health emergency, unlike anything seen in over a century, whereas measures to slow and stop the spread of CoV I D - 19, while essential and justified have caused significant economic hardships, whereas required aid and support programs for countless small merchants and their employees will be substantial, whereas all levels of government must work collaboratively to provide needed.\nCommunity board 3 recommends the following: actions:: to provide immediate relief for all restaurants, hotels and small levels, commercial establishments, suspension of all fines and associated payments for a period of six months, automatic non free renewal of all city and state operating permits and business field filings for a period of six month.\nThe language reads that therefore the first therefore be it resolved community or three recommends the following: actions:: to provide relief for all restaurants, hotels and old commercial establishment affected by the cove in nineteen biros may I'm, suggesting to change all commercial establishment to small businesses, so take that out, altogether?\nWe are in a state of emergency The governor is doing all these executive orders and we are not going through previous rules and regulations, and I would also want to say that we should say that we should ask them to modify I In the resolution Can, we just put all small commercial businesses affected by the Copa 19 crisis and, just like Mae said, we don't have to actually describe What's a small business?.\nThe first therefore recommends the following actions:: to provide immediate relief for all, and you were saying commercial businesses , so get it rid of restaurants, hotels, yada, just say for all small commercial businesses affected by the covert 19 crisis, because I mean it could be a right, I'm, not sure if there are small businesses that aren't commercial and that might be a little redundant, even though you muted people, if there's passive noise, your microphone state, it looks like whoever has iPhone has a lot of background noise and your mic stays open.\nProbably we see if I have a little longer discussion about how we're going to handle a lot of things if the situation is transferred drastically that we don't want to have committee meeting The floor is open for discussion.\nAny opposed Everyone motion carried all right, so more chairs report I want to encourage all of you to check in on each other and on your neighbors, and there might be some people that are alone at this time and they need all of our support.\nIf you could just do your part as far as being a good neighbor and member of the community and looking out for one another, I encourage everyone in the public If you're watching this to please make sure you check out community board website as they're going to be updates on meetings and times to login to our meetings as we go live As you see tonight we're getting his support and I will assign to other people to help him out so that he doesn't get overwhelmed and so just be patient with us.\nIn fact, I've never really done a live, meaning online before so, and I know that this is all new to the office as well, as they've been really like, jumping in and getting support from the city of New York, a lot of stuff is just being done just like boom at the split second, so I thank her and that all being said you know we're gonna have full board this way, and so we look forward to seeing with that all is well It. we'll discuss the other meetings that are going to take place during her report.\nWe are having a parks and executive committee, and full board now feels like I should have had much more, but it's just because I've been busy where he actually had to go out, make disinfectant and disinfect the office, which I do every time.\nWe go back to my home for the attendants as the next item on the agenda, so Susan I know that we're all sort of learning this new system and not sure if you mean Alicia and maybe Clint-- should have a conversation about the full board meeting on Tuesday How are we managing that as far as public session and representatives from electives this month and they're, saying there they're not having a public session?\nWe need to vote on this So I would like to make a motion to pass this new social media policy That's a little bit more descriptive to say you're, you know amending the social media policy, as I Don't know, say to update the policy to read as follows, and then the new policy all in favor aye Okay, now we're going to move into our committee Thank you transportation, Perhaps Michelle, might report there's."
    }
}