{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 October 2020 Budget Task Force",
            "publishDate": "2020-10-26",
            "shortDescription": "AGENDA\\n1. Discussion/Vote: MCB4’s Statement of District Needs and Budget Request for the 2022 fiscal year.",
            "lengthSeconds": "2:22:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "04tFfJSPXnI",
            "fillerWordCount": {
                "uh": 225,
                "um": 291
            },
            "readTimeFullTranscript": "84 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "line": 39,
                "shelter": 33,
                "list": 31,
                "homelessness": 31,
                "capital": 29,
                "school": 29,
                "park": 28,
                "request": 27,
                "budget": 26,
                "language": 26
            },
            "wordCountSummary": {
                "shelter": 9,
                "family": 9,
                "capital": 6,
                "budget": 6,
                "school": 6,
                "dog": 6,
                "years": 4,
                "sanitation": 4,
                "education": 4,
                "park": 4
            },
            "fullTranscript": "Oh no, I was looking first for an adoption. I mean you know, I'm in the Orphan Street seed business now got it, you need. You need a business to take it off. You can need an adoption agent and then we'll need to figure out. There are many businesses there there's a gallery on the corner on that block. Yeah they're not going to take it. I do not think they would be interested in that coffee shop was so perfect right there all right too high, for I do not know whether they're loading the construction shop right yeah, I know, but unless you go and you talk to them and you tell them- you have to water and all that stuff, they do not feel it's a load. You know right, okay, so question for you guys hi there, so I'm trying to figure out. I think I had homework Jessica and I did not get it to you. So if you can remind what were our tasks sure well, I was just going to wait for our. I do not know if Maria should be joining us and Lol. Are we so my biggest shortcoming that I'm going to rely on delores and janine, and everyone else for is like appropriate meeting protocol? So I assume we have enough people that we can perceive yeah. I think so, how many? How many are how many people are on the test? Yeah we're only missing two, so we're missing two or more great okay. So so we met last month and we laid out a few different tasks that we would each take on to review what those were in particular, it was obviously to review with your for those who are co-, chairs or involved with committees to review the list of past budget requests and re- prioritize. Those to remind everyone, Jessie and the office created a essentially a worksheet online, where you could put in re- prioritize your past requests and add new additional requests. I think at this point we have almost everything we need on that front. The second piece was to review the statement of district needs and I think that's where probably the most we'll give out some ex homework extensions, because we still need to get some feedback on folks. From that I shared the link in the email I sent this afternoon just about an hour ago, if you're not sure which section you were had offered or are most aligned with. I can I'm happy to remind you. I know a few of us have already gone through and started editing that document to remind everyone. This is where we can all kind of simultaneously edit. So it's a 365 link that Jesse shared Christine. I know you've made your edits. Thank you. I've made quite a number, though, still need to finalize that, and anybody else can go back in and dolores I'm going to guess that that's the homework that might still be outstanding and you can use between. Basically, I would say the rest of this week- whatever's left of it to go in just even focus on the section you committed to again we'll take edits more broadly, yes, bert. Oh you! So, oh okay, nothing! You'll! Get it done by Sunday. I just needed to be reminded what the homework was. That's so sorry about that. I needed to be reminded the method of the homework the process before you joined. We were saying how it's so hard to find the link that you know search the email for the term that you're looking for so I'm Hap. I did forward it this afternoon, but I can send it again to folks, with their actual we had noted who was going to do which sections. So if there are any questions, I will send that back out to everyone. So you want us, because I did my section okay, I looked at it. I took notes, but I did not know I had to return it. Yes from the place. If you are able- and I believe all of you are capable- I believe in you that you can make the edits in the document if, for some reason you have a challenge with that, let me know and we can make sure that they get input. I will say there were a number of typos and you know other small things I'm going to try to catch all those, but certainly if you see things that catch your eye and they're, not in your section, given that it is in track changes, you have deliberate, you know feel free to also make those changes and adjustments in the document and to remind everyone. The letter is talking about FY 22, so we want to eliminate any references to previous years, so I will send that back out, hi Maria, so for the bulk of our discussion today. Recognizing that I may want to come back to the the document in a little bit or at the end, is to go through the capital and expense priorities and essentially come up with the list that we are most comfortable with presenting that as Jeffrey. How did you say the you used your hands to bringing all the lists together, the re- prioritizing the? Hopefully, it's less punching bags and more more coalescing around our priorities, more hugging right I did want to share, and hopefully you all saw we can pull up on the screen. So we're all looking at the same priorities, if that's helpful or if you prefer the dialogue face to face. We could do that too, but I did want to just review for those who maybe did not have a chance to look at. We did do this survey, and so you know, as we think, about ranking our priorities and, of course we want to represent for those who are co- chairs you know want to represent the work of your committee and their priorities. I did just want to remind everyone that, in the statement of district needs, we share that our long- term priorities as a district are affordable, housing, neighborhood preservation and traffic and air quality, and so we have. You know you guys more than me, because I've not been at this very long but have I think CB4 has been pretty consistent in sticking with those as our three driving principles of areas of focus, the survey which we did over the last several weeks. It's now closed received many hundreds of clicks. Unfortunately, not everyone completed the survey, but we have almost 300 people who did complete the survey and with that we asked people to first identify the three issues that they believe need expanded funding, and so I just want to offer these as sort of we should stick. I think that our long- standing priorities matter, but that we should also acknowledge what people sort of on the street are saying right now, and the overwhelming number of responses was for health care and human services, followed by education, youth and children, followed by public safety and emergency services. So, as we look to prioritize and take these take all of these various requests on the capital expense that we have, I think we should just try to keep all of these different, both the long- standing, but also the sort of feeling of the moment in mind. As we make these choices alan, you have your hand raised, yeah and then and in regards to our list of priorities. I do not know if you want to discuss it now, maybe at the end, I think we need to make a change on the three priorities. You're saying the three long- standing priorities yeah, I think education has to be in there and if you again, I do not know if we want to discuss it now or maybe later on. Let's get through some of the grunt stuff, maybe yeah, and we can come back to that yeah. However, you want to do that. Yeah, okay, I think I wanna you know certainly we'll hear from others, but I think I think in part, as we kind of see, what's predominant you know or dominant in these capital and and expense priorities. I think we'll see some trends kind of some evident trends and we can look to see how whether or not those are again kind of reflective of the moment or if these are long. If these are the reflection of long- standing challenges and equities or other things that need to shape our long- term priorities. Bert, you wanted to I'm interested in that healthcare as number one priority there that, in terms of the survey were there any specifics, other than just healthcare, sure so well the survey, so it's healthcare and human services. We, the survey then and actually Jenny, can I share my screen for a minute. Is that and I just hit share screen and you should be able to, but let me know if it does not work. Okay. Well, you guys tell me, can you see my screen? Okay, so I just have the we just closed the survey yesterday. So this is just a very preliminary report of all of the information you can see here. 185 respondents of the 258 said healthcare and human services. It's really 185 over the 719, but since then anyone can only click. One thing once this really shows you that over half of the respondents picked this as one issue of importance to them going down, though we have the opportunity to rank like which of the ones you said were important, were the most important and then to fully answer your question. There are about a dozen pages or 10 pages of comments related to this issue and, as I think I shared at the health and human services and housing meeting this week, there are a lot of things as you dig into these comments that reflect you know. Homelessness is in parks, for example, people picked parks, but they talked about homelessness in their comments or they picked city services, but talked about homelessness again. So I think at this point, given that we've just closed the survey, we really need we need. Whoever else cares to work on this. Do a deep dive on these comments. They're literally, you can see here 60 50 pages plus of comments, and our thinking was that we would then take this and kind of bring it back to each committee less that this would necessarily inform any budget request at this time because it is preliminary and these issues maybe have not been heard by committees themselves, but the committees can take them and use this as an opportunity to be less reactive. Sometimes we just wait for issues to kind of show up to us, and here we have 50 pages of comments, kind of we can tease out what those trends are, but far in a way, having read them most recently, a few days ago, where we were, I mean, I think homelessness is the most. I write home and there are 150 homelessness is mentioned 150 times in this document so far and away, I would say that is the most significant issue that at least people are writing about again. I do not want to conflate that with a budget issue christine, you have your hand up yeah. So it seems to me that the top line that you showed is really not totally reflective like healthcare and human service. There will be maybe more answers to that than homelessness. What is homelessness in? Presumably it was in housing, but it's in health care exactly so, I think that's the. I think. That's a good point like how we, in the end, did not define these categories in the questions at the top, and so people made these selections about their own interpretation of what these categories are. So, in fact, the comments I think, are more guiding more of a guiding factor than these yeah and these big categories. But again I would say that, like at least for my preliminary reading- and you know I'm mindful that we're like we've just closed the survey and we're having this budget conversation- and we probably should have had more time between them but far and away the biggest issues are homelessness, followed by, I would say, sanitation, there's a lot of talk in here about dirty streets, Waste, basket, pickup and then, of course, education and just the general children. What are we doing? What's our plan? Kids are not in school kind of narrative right, okay, I'm going to just stop sharing for a second ever yeah. It's just though they're talking people are talking about homelessness, sanitation underlying all of this, the subtext and talking about hospitals and is the pandemic yeah sure and the economic effects of the pandemic and the economic effects reverberating through the city budget. That's what we're hearing here! That's what we're hearing! That's what I'm hearing that we're hearing, but we have not. I agree with you a hundred percent, but we have not even felt the budget, the true reverberations of the budget, I'm aware of that. Yes and I get nervous about adopting sort of the top three that are that have sort of been laid out in a reactive manner. In this way, I'm not saying that's what we might do or that we're being reactive, but I think that this survey was a first in a really significant, fantastic way but Jessica, as you pointed out, we did find early out the fault in the fact that we did not define the umbrellas. We have the umbrella category, but we do not have the bullets of what falls under the umbrella, so sure yeah. No, I think we should be looking. I wanted to share the survey the top line because it was part of this sort of it came out of this group that we said we would do a survey. I think that the most actionable piece from having now completed the survey will be to bring that back to committee chairs and to say, okay, what are we seeing here? What are the trends regardless of what those topics, what the headline topics are? What is the work? That's really been revealed here and then what is the committee? That's best suited to work on that, and I still think that you know we are in state of Kobe and postcode right recovery and I think those new priorities are very much in line with the Covid-19 environment. So I do not think there is anything wrong with saying you know in this environment. These are the priorities and we want. You know we want, for the time being, very, be very focused on that and then go from there, because the message is really, as Bert says, is to the administration is: do not you dare cut funding to education? Do not you dare cut funding to homelessness and do not you dare cut funding to sanitation? I mean, if I summarize, in a very big way. This is what people are saying right, and so I think it's important that we reflect that in the context of we are in a special time. This is not business as usual and therefore we could have say these are our long. This has been our long- term priorities, but right now, this these other priorities right and I think the question christine is just where do we do that, because we have a statement of district needs? Certainly it can go in there. I do not know that it should go in the letter that we send on the budget and the statement of district needs as a special kovi. You know yeah caveat at the beginning, saying look. This is not business as usual. Here sure that's right, you know. In two years we may decide. Okay, we are out of this. Where are we now so right? I'm going to do dolores and then Alan will go to you. So exactly what christine is saying is what we should be doing. We should be creating a carve out for what is happening in the moment, because the ongoing budget is also responding to the crisis. I think that should be in the letter that should be at the beginning of the statement of district needs, saying in this unprecedented time. These have been the major concerns that are impacting our community in real time, and we need to ensure that the budget protects some of has some protections put in to ensure that we do not worsen these problems, and then I think that the main categories Alan. I actually think that it may not be a good idea to re- prioritize our long- standing district concerns because they're going to exist. I do think that we highlight clearly education has been a spotlight because we have not been able to figure it out. That could be the Covid-19 response, and I think that also it does need to be more informed, as throughout this year we get more input which we will from our partners that are in education, and your committee is very strong in terms of getting that input. I think that if we re positioned all of the priorities that we've had historically, I think it makes it very difficult for us to still advocate for some of these items that are on the list that we want to make sure that stay on there once there's actual revenue left in the budget. I look at it a little bit differently. Given the financial situation, everything has been happening with the pandemic. Certain things are still happening, transportation is still working. Bike lanes are still being built. There's extensions. You know there are things that are being affected, however, they're still being done. Housing is a problem. Homelessness is a problem. Education, kids are not in school devices are not, you know, they're, not learning. So when we talk about our district needs, what are the long- term's effect on all of these items that we have as priorities because sanitation, so the garbage does not get picked up on a corner for a couple of days and people throw this stuff out there as funds come back in sanitation will straighten itself out when you have kids out of school when you do not prioritize or somehow keep kids in schools or make their learning abilities to overcome the deficiencies of not being in school. This is a long- term effect. That's going to affect our city, where we're so with kids, educational, wise and social wise. So it's not just that. You know the garbage is not getting picked up and we have to keep that in there. I think I I'm saying what I'm saying is you have to prioritize the need going forward on what is going to continue to maintain our city and that's the youth of our city and they have to and that it's a priority. I think that has to be highlighted in some way, not just as a letter of some kind. It needs to be a priority in terms of what we feel going forward is going to be the needs of our community. Thank you Alan. So I'm going to I'm going to let Leslie and then I know lol. You you've raised your hand here, so I'm going to do Leslie and lol, but what I do want to say is: I think, when we dig into the actual like this list there is, there is quite a bit on here. I mean my every task force every committee excuse me, has put in their top five. Let's have this conversation rooted in. How are we prioritizing these pieces? I think these kind of more meta framings and where they go, we can figure. I want to believe we can figure that out still so, let's I think we should save our save our fight so to speak, for these priorities, leslie and then we'll go to Lol. I just want to say amen to what Alan said. Thank you, Alan, and I also do want to say just as a bigger thing. I know. Covid-19 aside, I think as a philosophy. The survey was interesting because it gives us a little bit of a window on what people out there think, regardless of obviously Covid-19 was a big factor in their answering, but I think sometimes, when we get together in Cb meetings in committee meetings in full meetings, it's a little bit it's a little insular and I think, like we have our ideas of what's important to each of us and our specific, I guess rallying cries, but I think sometimes out there. What our residents think are important to them might be a little different, and I think this gives us a little bit of a window and Christina's right. It's obviously you know covent tainted, but I do think for what it's worth there should be some sort of balance of listening to what the residents think and what our own. I guess issues are when we go into a committee yeah, I think that's fair, well, yeah. I first of all I want to apologize for being late. I agree with what I heard Alan say, because a lot of this is going to depend upon November 3rd, because you know it's clear that what Speaker Pelosi wants to do in terms of providing money to cities and states depending upon what happens, November 3rd, that will either become part of the federal budget or it won't, and if that money is coming in, like Alan said easy problems like the trash getting picked up because they cut back, sanitation will get fixed, and I think the education piece is a harder thing. So I think part of our challenge here is that, what's going to happen after January 20th may change where we're going on all of this, and I think we should be looking at the things that are not the easy fixes that you're just throwing money at a problem won't solve something. That's going to be more in- depth that, where there's more something more systemic that has to take place to fix it other than just throwing money at a problem. Okay, as if we did not have enough concerns about this election, let's I think we should turn to this. I do not know if folks have a preference or past experience, maybe Jeffrey you can share like with starting with capital or expense. Does it matter. I always like, starting with capital. Actually expense tends to be a bit easier. Okay, so, let's dive into capital. Do people ha? I can pull up the list that Janie or Jenny can pull up the list that was sent around earlier to look at them side by side or we can look at each other. I do not. Whatever do people have a preference? Do they have it in front of them? Pulling up the list would be nice only. So we could see what you guys are the wording and everything you're referencing, but that's just my okay, no problem, sorry Maria before we do that, I was just going to ask. I have up the capital budget priorities top five. That's what I should have up right now: yeah, exactly okay! Janine! Do you mind pulling it up or do you want me to? I can pull it up? It's a document that I sent you earlier today, yeah exactly okay, one. Second, I want to also acknowledge, of course I was grateful for janine, for stepping in Jesse has had individual conversations with every one of you, I imagine, and your committees, so we're going to do our best here to parse this out, and dolores has also agreed to help me and be resident expert, but we'll do our best. It would be good if you could join in shrink it so that we can see the first. You know all the number ones in one place there you go that oh yeah go a little more yeah go a little more. There we go there. We go okay, so I do not know if this format was done in the past, because this I did not do this with you all. Last year I was not on the budget task force, but what's been done here is all every committee. What makes up this top five list is every committee ranked their priorities based on a combination of past past listings things that made that on the list last year, combined with new topics and then ranked those and what we have here is the one the number one priority: acrosss all six committees, and so the thinking was that the top 25 or 30 are probably our most important to get right. Obviously, we hope all of them get funded, all of them being our favorite children, but that we should start with really looking at this list, so so the first one is easy. You have a duplicate on five and six. I know good catch. So, let's, let's get rid of one, so right, you'll notice, here, HHHS and Chelsea Hell's kitchen land use, those are the same five and six and the columns are the same. How who is going to make notes so that? Because, if we say remove this, add that etcetera, we probably need to see it on the screen right. So junior. You want me to thank you. Well, I'm taking notes on hard copy, but if christine, what you're asking is that janine like delete things in real time? Is that what you're hoping yeah I can do that yeah? Then you can delete. If we change your number or an order, then you know: do we so let's delete six, because my understanding without playing favorites here, my understanding is that typically land use does not have budget requests, but that does not care. We do not care, okay, transit back like snow, okay and then, and then I want to acknowledge that of these. Of these remaining five two are housing related two one is transportation, one is snow and one is school. I wanna just clarify that. I thought into the titles that's to invest in the sanitation truck to have snow removal in the bike lanes. Yeah, that was great, maybe Jeffrey can explain or because I'm on the Parks Committee also with Jeffrey- and I do not remember that was even that was definitely not the first that we voted on for the very first priority. I do not even think that was in the top leslie it was. It was the survey that I sent around and everybody had to rank them, and I too, like you right now. Unsurprising was surprised to see this as a top rank, but it was. This came up. I think this first came into our budget discussions christine. Maybe you know better than I do four or five years ago, but it came last year and then you know it was. I do not know. I think I think the trance and Wp here I mean. Can we look at number two? I think it came up in asian Street like what have we done. House Kitchen Park was just funded, for is that House Kitchen Park, something that is Hell's Kitchen park, but that was that 400 thousand dollars did not does not get you a park renovation yeah, but so I I'm not going to. Can we can we can we adopt a protocol where we mark the one where we agree and leave the one that we do not agree open? Well, can you? What about? We all say hey. I personally like upgrade school. I, like the elevators, and I like the you- know the HPD thing right, so I would say I like those three, the other two. I would leave it open for the time being subject to moving it around. That would be my so let me just clarify you're saying like essentially here we have the ability, for this whole green area, to be one two, three four and five but you're saying like what are we prepared to lock into our top five and mark those and then everything else that we're not prepared to lock into top five move leave blank for now, yeah you're, saying yeah. I think that's a helpful way to start moving forward. Are there any objections to that great okay? So so, who I mean I also have opinions but who who's comfortable committing? Who wants to share a straw man for what's staying in Christina was your suggestion. Do you want to, I was saying, upgrade school from ACES right, replace the limiters and other affordable housing requests, which was adequate capital for HPD at the Harborview terrace? I think those three in my mind are strong number ones right and the others. I would leave open to discussion. Okay, so janine, let's just put a one and a one and a one for now or even one two three, I do not know if we are comfortable going. Are we comfortable and the other one you can? You can call that? I do not know the other ones. You can put a number like a and a so we remember that they were in number one, but they are not selected. Yet you know okay. Well, I mean we have column b, so we'll know that they were in one but sure no, but we could have one and then a right, something like that. Okay, anything I want to have you're putting it on that side. Okay, cool! Let's see, anyone have any concerns with this as our locking in education, upgrading the school, the elevators and HPD harbour view. Okay, no great! I'm going to encourage that. We go to our next next grouping then, and we should come back to those that we determined were AIDS for this purpose. Okay, you guys giggling over there are you laughing about your side, chat right, she's giddy, because education got number one? No, I snuck in that Snow Bike Lane that day. Yes, he wants to be done by 8:30, so I'm going to take us back and be focused okay, at least at least a quarter of nine. Can we go down low yeah? The language that we had last year was additional holsters for snow removal, specifically for the bike lanes right. So let me just say publicly: I put it in the chat. I shrunk some of the descriptions when I was working on the project and I did not re- expand the proper language when I sent it through. So I apologize for that. In this case, I put it in the chat on what the full use of it was meant to be. It does not mean that we're getting bike lanes in the snow right it has to do with the vehicles sounds like a song. Was the truck meditation remove snow from the bike lanes? You can save that for the musical. Let's believe that, then we spend two hours last year on the same section: transportation was not it a transportation back then or no, it was on the park. I do not want to get into this number two. Please look. It was on Asus, it was on stream. Maybe it should not be a priority at all line. 9 is duplicates, so that's good. I like that. Can you remove that yeah? So our Chelsea land use folks had a robust discussion untold and great that they wanted to affirm other priorities. So we have maria. Are you okay, you're on mute but you're, trying yeah? I was just struggling trying to fix this to make it look right: okay, the zoom okay, so we have again housing. We have our toe pound. We have another education request, specifically something I know Leslie's worked on, but so there are questions she should speak about it. Can I can I raise a question on this one yep? Okay, I just want to read. I know if you, if you got this from Kate these licenses, as far as I can understand, are renewable licenses. You know it's not a one- shot deal so actually what we're asking? Probably this should be in the expense in operation, because you have to do this every year. Also, the fact that this tcr Wp classroom library- we should not specify I'm reading this from kid on classroom libraries. We should not specifically advocate for a product, especially tcrwp, its lead creator, Lucy Culkins has finally in parenthesis acknowledged. Their approach does not match what research science tells us about. How kids learn to read. Blah goes on to leave a actually I'm going to I'm going to have you stop for a second, because I think we need. Most importantly, we need to remove this from capital and need to move it to an expense, literally just copy and paste it into, because I think the priority still exists. We may need to change the wording and when we need to change the wording right, we can talk about how to make that more appropriate in a more appropriate ask cool. I have a question the first line item, which is eight adequate, Sunday multiple. I thought we had that last year and it was already coming through, so it felt like it was more continuing support. Is that accurate or not christine has just happened for the past three years, if I'm not mistaken, and then it gets bumped back up so well. I spoke to Joe about it. He did not mention that this day, because it has not been committed right that he did not mention that. There's been some funding for that. Okay, so what I'll recommend is we keep it, as is if we can work I'll make a note to follow up with, we can follow up with Jesse or whomever to make sure that that's not true, but I think we should act as if it is let it have its place in the list where that may be, and then we can always bump everything up one. If we need to hey Jessica, can I go back to the education that we just put at expense yeah, so I do not know the need actually was classroom. Libraries, actually physical books like they need they do not have the physical books to fill their libraries. So, although the digital subscription is expense, they do not have libraries in their schools or at least adequate ones. Now that was their major ask at least district two's major ask. So is that a capital a one- time? Would you? What do you mean by library, an actual physical school library? Well, that's a big difference from what is described here. Yeah. Well, I think we do have on number three for ACES is additional books for students to practice at home and lending libraries is that is that what you're referring to yeah, I guess it was split up. Okay, I guess there was. I I'm just reading off what district 2 sent me as far as the superintendent's their priorities, so we did have that as a capital, but it's going to be now in the yellow section, like the next section. I think we should like. Can we move that up? Then? I guess to the second capital: ask right from uh- huh, I'm okay with that is everyone, okay with that, I'm just what Leslie's saying is that on currently what is line 10, it's essentially that was their second priority. We're saying it's not actually your second capital priority it's going to go, move into the expense side. Can we replace their third priority as now their second priority, so something that will be further down on line 15 can not be bumped up to this section, like our second capital, ask yeah, I think that's logical, okay, great, so now we're deciding between basically we're deciding for the next. We have. We have two spots in the top five if to frame it that way, we can choose between affordable housing, the tow pound Hell's kitchen park, or this book number line, 15 books for libraries. So what's going on with Hk Park? Sorry, yes, so that's Hell's, Kitchen Park renovation, a request for a renovation of the full park, not just sort of piecemeal. That came out of committee. Can you remind me Jeffrey where it is Hell's Kitchen Park is 10th Avenue between 47 and 48 on the east side of the avenue? Yes, okay! Well, I think number four should be sorry. The ask for HPD wait a minute, but when we can select all of those right I mean I would. I would not select Hk Park because it seems that they have been a lot of upgrades over the past year. I think when they recently got this 450,000 a few months a month or two ago. I think even the residents, including myself, were surprised and they're like we just renovated that a few years ago- and I know you mean like an even bigger renovation, but I think even residents were like wow- that's a windfall yeah. I guess I think it's astounding that we're upset there's money being given to renovate a park, no because I'm hugely in favor of money being given to renovate parks, and so I think this fits into the picture of improving a small park in Hell's kitchen, which is a park-, starved, neighborhood, sorry to Interrupt, but the park is actually in very good shape and I do think we do need to think about that. Health and human services is impacting this community and to Allen's point that's going to be long- term effects. Dolores I'm not arguing whether or not the park should be number four. I'm arguing with the fact what seems to be a desire to remove the renovation of Hell's kitchen park from our budget request. No, my suggestion was my suggestion was that we nailed down the first three and we leave the Hk park as a floating decision yeah. I do not know. I do not think Hk Park should be number three or number four. That was with all my in the follow. As the process we discussed is, we can say, line eight nine and not ten, yet because we do not have a ten yet, but you know eight and nine are definitely locked in those positions. I think we're on the same page that we just were thinking. We should move it lower. Jeffrey is not that. What are you also yeah? I think so. I guess I just envisioned like some of these things, shifting out of their color categories. Also, like I agree, angry, I'm not sure, yellow is going to move into blue. If you will, you know what I mean yes right, especially because people have already prioritized one two and three. So the idea that something that's on five will become a one seems unlikely because the committee themselves put them lower exactly so. I think we could go ahead again, just for starting to move things into their place. I'm not locking this in. I think we can actually go ahead and say what are the things we want to move up to four and five. I do not think we should do that yet maybe we should just lock in the things which are in there and then, when we have the things which are not locked, then we can have. Then we can have two discussion. One is do we change the order and then do we replug some of the things which we are left out? Okay, so we are committing to well. Can I just suggest something Jessica to me? It makes more sense and it saves us time if we instead do what you were suggesting, which is we move something up to four and five. If we're trying to get off at 8:30, I mean okay, let me just Bert seem like he's concerned, so I have a concern about the toe pound. If we're moving, why do we want to move the toe pound out of there? Who said we do, but it's in toe pound number four and was talking about putting something else in four or five? No, I'm confused! I'm confused, I'm very confused. I thought I thought what we were doing is for each color. You know the Sec number position we agreed to what should be in position one and then in position, two to two etc and then once we have that, then we can look at whether the order is good. Okay, so I think christine you have a lot of experience, I'm going to say: let's do your way to piggyback on what Maria's saying, let's see if we can kind of there's, we got a little caught on a few things that we all agreed on. So we do not need to spend so much time arguing with ourselves on things that we agree with. So, let's like try to move more quickly and locking things in where there is clear agreement. So with that, I think I'm hearing that we should put twos next to HHHS to HPD NYPD, and for now this ACES line is coming out, but if we could drop down to line 15, we can consider if we want to keep that in group. Two. Are we okay with that? I think, given some of our initial comments anyway, about the importance of education, it seemed like there was a lot of nodding. It would seem that feels like line 15. We can go ahead and keep in group. Two. Are you? Okay with that classroom? Libraries? Okay, I just I just wanna, you know, Leslie, just Wanna get your opinion on this. What kid mentioned, schools are no longer using mass libraries they're, basically going into the classrooms now, so they want to fund books for individual classrooms and that's up to teachers. I guess to see what kind of books a mix of books, but it's not like used to be these big old- fashioned libraries, the big desks and you have all these shelves and books. So from what kid has mentioned. Schools have gotten away from that, and this is more, as this says, classroom libraries in the future, which is good okay. So I do want to just sorry janine the line where you just put move to group two that actually needs to go down to where it says bump up to second capital. Ask because we're not we're not moving that trans, I'm sorry so which one is it? So it's not that one! We remove that text and then, where it says bump up to second capital, ask we want to put a two, a two there: okay, great okay and then going back up to lines. If you can line 11., I think we should put using our same format. We should put a b because we used a is that right christine that follows your nomenclature. Okay, so now in tier three, we have another downsizing, a shelter, ADA compliance for pedestrian ramps, a ferry service and we're going to remove. Well, we have not removed, we've moved up number two and then Jeffrey, just because you use some kind of opaque language that, maybe not everybody knows. Do you want to say anything about the packard truck two factors, one on the packer truck, it's the purchase of a new packer truck for sanitation garage four. The caveat on this is that we did not yet get confirmation that this was funded. Jesse thinks it was, but Steve did not get back to us today on whether or not it indeed has been funded and then just on the Clinton hell's kitchen land use the fairy things should not have been in their nchrklu right, yeah, it's a transportation fans or what wpe it's always lived. I think in Jessie were here. He shared with me briefly that they were taking a very expansive view of the needs of the district and not just looking at their specific committee yeah. I do not think I do not think it came up. I think that might have just been in the wrong place. I do not think it came up at our meeting. Oh yeah, so Jeffrey's right where it's been all along, so we should just be changing the committee name, not the yeah, not that it does not belong there. Yeah correct in land use got it my apologies, okay, so we janine. Can we make that note in column a where it says c: H, K l? I defer to you guys what is that is that W, a wpe or transportation. It should be transportation and then christine is that does that? Would that become your fourth priority? Yes, okay, so we need to move that to a different section. Can I ask the people from HHS, I'm just curious. It says downsize the shelter at 25Th Street, just why that particular one, I'm just curious, there's a few of them. What do you mean? There's a few you can take that. What do you mean there's a few that shelter had about? I remember correctly about 300 beds. There 324.! Oh I'm sorry, you know what I'm thinking. That's a permanent shelter right, yes or no! Yes, I'm sorry! I'm confusing contemporaries my fault, my bad okay. So janine are you moving. Are you moving line 14 to the next section? We seem to have lost janine, no she's back yeah. She is great sorry about that. I'm not sure what happened. Let me be sure. Those looking very handsome so yeah you were going to move line 14 from priorities, three to priorities. Four journey yeah cuts. I'm sorry! I missed that last portion because I got kicked off, which one in my mind I mean is that take line 14, cut line, 14 and paste it insert it into category four or do we just make? Is it better to just make a note yeah all right, so I put a four in it: oh yeah, four right: okay, cool okay, so we have downsize pedestrian, ADA, yeah and school library, and then are we concerned on how this reads how the language in these boxes reads or is? I am comfortable going back with anybody, who's interested in editing, specific texts afterwards later afterwards. Obviously I can't just say packer truck sorry about that. I was not talking truck. I was talking to you know when he ACES things. I'm not touching your stuff, you do whatever you want. I'm going to put out a straw. Man here, it seems like HHHS would go up. We've already put the libraries up. Personally, I think it's obvious sorry Jessica. Can I just ask a question on the that HHHS BRC Maria? I just I thought that had really become much better and are we going to it's an optics question, there's a whole lot of dealing with optics in the neighborhood right now of everything that's going on in the 30s. I thought that shelter has gotten to really be not the issue that it was when it first opened five or six gosh, six or seven years ago. Okay, I would, I would agree with Jeffrey on this because I think has not the community come out in support of this. They did not want to downsize and they did not want something or whether something like much better is my understanding, the community like approach to the facility, and I'm not saying it should not be on our list, but at the same time, maybe we should think about that and whether or not this has is has outlived the Ask has outlived the desire of the community yeah. That's actually a good point. I know it has gotten better. My understanding is, there are less bets there currently because of Covid-19, but my assumption is, it would increase. You know when there's a vaccine available, so I guess I need to think about that one, a little bit more and talk it over with some folks. I think the most important thing here, though, is going to be establishing a new family, a permanent family, shelter in the district, because we do not have any the family shelters we do have are all actually temporary, so you can always change the wording if you've yeah, you can always scratch. Oh, but wait. We have not. I do not think we have had a letter, a resolution to ask for what do you mean interesting? What I mean is that we have not seen a letter from HHS asking for such a discussion on the family, shelter right. Well, it's been here on the asks for some time. If we look at the language, it says downsize a single men's shelter and establish and add new family shelter. So is it? Do we know? Are we just a stat? Are we just requesting the establishment of a new family shelter the way I was reading that at the time you know a long time ago that people walk up yeah convert? Oh, I see what you're saying actually family shelter instead of single men's shelter. I think that was my understanding. So maybe we should change this language and say: convert the BRC shelter to a single family shelter. So let me ask you questions. I have a question. Excuse me, I'm sorry, I'm sorry. I have a question christine though so even or anyone who can answer the way, it's noted now swapping downsizing the BRC for a new family shelter, that's something that it did not need a resolution for. No, there were many resolution at the time years ago years ago there were no true downsize, the BRC and switching it to a children's shelter. I see what you're saying I see what you're saying: okay, downsizing does not mean converting nobody's asking votes, it does not say, eliminate the BRC and have a family shelter in place of it right. It just says: make the BRC smaller and, at the same time create a family shelter. You know we've gone back and forth so without you know, being critical of all of the re like it's been through the wash so many times and everybody edits. So I would suggest that we go back to the original letters and try to understand what we were saying and make sure we have something on this and do what's reflective of the actual need right now and the moment I do recognize. That means we're not going to be able to like put the final icing on this cake tonight, but I think I think we should know what we meant here and let's go back to the tape. Hey guys, it's Jessica, Dean, Hey, Jesse, hey, sorry, a little late! Are you sure you wanna you can be with it may have just sounded like we were not, but we are I can give. I can give it's perfect timing, though I can give a little insight into the least the BRC language. Oh good, please! Well, then you're going to get a great guy if Jesse's on good drugs. Do we want to trust him? I wish I was. I wish I was they. Oh, that's not good. Nowadays they do not give you they do not. They do not knock you out and send you out of the hospital like happy anymore. You know, I hope, you're. Okay, let's do that's the old days, so the BRC thing is actually the result. That's a result of basically two long- standing requests getting combined into one, if you remember years and years ago, right so ever since BRC started, we have been on record for saying we think it's too many beds. It's too many beds right. So therefore it's always it became a budget request when BRC started and it can continue to be and then separately from that there was the right before a couple years before I came on, they actually shut down a a a shelter with a family shelter with children in our area, the family, the I forget what it was called, but it's in the it's in the past documents, and so at some point. Maybe two years ago, maybe a year ago, there was this idea from the task force to say: okay, well, wait a second! Why do not we just combine them, so we do not have to constantly argue about which one goes above, which and whether and I'll be honest with you. The idea about BRC being less beds became. You know a little bit less of a reality. You know, as the years went on, and so it was about combining the two saying remove. You know we still think Brc's should be reduced, but we do want to have a family shelter return to our to our area, and so that's the that's the reasoning for that. So it looks to me that we should have two entries in this day and age right and one of them should be establish a new family, children, shelter and then the downsized BRC would move way down in the priorities yeah that makes like yeah. I think that makes sense, or do we downsize entirely. I mean I do not my personal I was going to I was. I was just going to say I personally prefer it that it'd stay, but what were you going to suggest? Jesse yeah, I mean I do not know what the constituency behind that is anymore. You know I mean I do not. I think we, you know we Jessica meets Jessica and then Barbara Davis before her have been meeting at the BRC cab every month. You know I mean you know we successfully advocated for funding to get the rooftop open, so we got a place to do stuff. So you know I do not know really the you know it's I got ta say it's the reality of the agency. Responding to that and saying yeah we'll reduce the beds when we've done all this other work I can. I do not see it but being a reality. It's a political thing. I could understand it, but I just do not know if it's really that there's a constituency behind it anymore yeah. I was just going to add that from the meetings it's not on the table as a discussion point right. It's about how do we work through this situation, not about a drastic redesign or cutting of services, and certainly in light of what's going on in other parts of the district? Now it seems like the issues honestly are in different ballparks. They are so I like Christine's suggestion then about the new family, shelter probably being separate, then from downsizing the BRC and then let me just tag on to that. Would you keep that as this? What is a third request for your committee? Yes, the family, shelter part, yes, yeah, okay, so I guess we're. If janine you can make that note here, maybe even in column g like not in that very column, but next to line 12 or in line 12, that this is going to be about establishing a new family shelter. And then I guess the question for all of us is that what we are moving up like? Are we committing to moving that into the you know, that's staying in our request for the third category and are we comfortable doing that with ADA accessibility, yeah, okay? So three goes in row, 12 and in row: 13.? If you can scroll down the pack, your track put a c, I think we're saying see: yeah, okay and now, let's move to the next group. Let's see C is like a placeholder: oh got it. Okay fill up for grabs. Okay, so here we have funding for schools around secure. I want to note for security cameras. We have again a ferry service which had been notified exactly yeah keep going 14 just yeah line yeah. We can just delete that or, however, you want to yeah great okay. So this is the ferry service. Then we have harborview, and this is continuing to report. Do not we have a new category which is called Cs. Why is it in that list right? I think that, because those are our hots- oh no, that's the slaughterhouse site. Never I'm sorry! Harvard Harborview was you know, 19 Jesse, 19. yeah. I think that was then HHS. I have to look so this. I do not remember where you should be continuing support which is outside. I do not know. So, let's go ahead and just mark if you can janine in line 19, let's just put Cs in caps, so we'll know to move that over and then harbor View Terrace. We did not. We discuss Harborview Terrestrial. I think there did, but it was for an RFP, the RFP, for the private, the private development. This is for the oh got. It got it which reminds me Jesse yeah. Are you still here I'm here: did you get an opportunity to speak with the tenants Association at the different aha developments? I did. I spoke with each of them and I think Jessica. I do not think I got to send it to everybody else, because I just got most of them today, but I sent them to Jessica, so Harvard New Paris did have some additions to their existing, but their existing list still remains so I mean the way we did. It was basically put it all into one bucket. You know all of the requests, so we can add into those add into that list of she had a couple other issues that off the top of my head. I can't I actually. I have the list here: it's roof, it's Roof, Boiler, elevator, Lighting and re- tiling, but I mean the priority is like we do not think it's a priority or it's not it. I do not. I do not think it meaningfully. Personally, I do not think it meaningfully changes the nature of the request. No, I mean it's just basically the same they do not. They did not eliminate anything that we have here. No, they acrosss the board. They did not eliminate anything they had the they add they added stuff to they added additional things. It's just roof repair, upgrade boiler new building entrance stores for both buildings and upgraded lighting for the public hallways okay, yeah. Okay, so I think we can Jeffrey. Is there anything you want to say about the Chelsea park truck or no just that was definitely been discussed of recent and in past as well. So it's the track in the park on Ninth Avenue priority. It's a safety hazard yeah already. Okay. So when we look to say what are the things that will definitely move up and move into place, is there anything from this list that we are not comfortable moving up? This may be another way to say it is the fairy I mean is the ferry a priority compared to well. We need to compare it to other things which are beyond behind it once we have that right, you know what I'm saying just for saying below it. We should maybe look at it in that sense. That's why what we were doing here is keeping them in number four, and then we can. We sort everything and look. What's there right. I do not know okay, so it sounds like ACES I mean personally, I mean we're not doing a lot of sorting within, but school cameras feel less important than I do not know. I guess we're at this category where it's like all a little bit more superficial. I think we need a second, a second pass to change the orders. You know, okay, so then, why do not we review? Oh sorry, Jesse were going to say something say: have we gone through category priority five already I apologize no, not yet we need to do that. Okay, so why do not? We do you Wanna just jump down there, because we are kind of in this less critical zone and we can look at them together I mean, do you want to drop down, so we have roadway maintenance, wait line. 22 is continuing support. Okay, so let's put a big cs there. Thank you. Then we have camera upgrades at the Fulton houses and the roof repair for Columbus, Avenue branch library and Penn South Basketball court janine. Can you take out the 400,000 out of that please out of the roof, repair right and just say and just say, repair needed for repair because it's been combined with an elevator repair project? So now I can't really. We can't really. I can't just decipher between the two. So actually I think I guess maybe you want to include the elevator repair. Just an elevator move repair, an elevator yeah. Okay. Now we should look at reordering things right if we have kept all of those. So, let's go back to the top. Is that the way to do that? I think that's the right thing to do. Okay, you pick it out which, out of each category one two and three four and five, how to order them? Okay, so I wanna remind folks that, are I mean it's a committee, but our long- standing our task force, but our long- standing priority is housing and that might be a way to lead off. We have two requests here yeah, but we said we said that we were in a coffeed area, so this year, maybe we should have different priorities right. Okay, so is our top priority education remotely the these all feel so minuscule to me in the age of Covid-19, every single one on this list actually sort of falls flat in what I think is a neat. The need for a grander ask here: there's nothing about new services needed, it's all about existing improvements to facilities. We already have. This does not ask for new, affordable housing. Necessarily, it asks for subsidies and direct improvements to buildings that already exist, all of which are extremely important. But as the survey pointed out, as I think, we've all realized, what new is online and now- and maybe it's our process- there's nothing well. Can I jump in real, quick jeffrey, so one thing with this top list is, I think at least the ACES is actually directly related to Covid-19, which is the remote learning and the funding for remote learning, and so I will say that I do think we have to remember, though, when we originally came up with this. The way we wanted to do it was that we would still we were still asking. We did still feel like we should keep to our yeah. I think I just needed to say that and then I'm happy to shut up and let's prioritize it when Jeffrey goes. Oh, no, I agree with you Jeffrey and somewhat. I agree with you because I think the committees naturally did that themselves and I mean I think Leslie can confirm that with from ACES that, rather than feeling oh, we should have this separate list of Covid-19 stuff. That would put in some other document that they felt it was a priority to make the Covid-19 stuff to be the number one priority within our actual budget requests, and I think maybe a few of the other committees did something similar. So I do think we can. You know we you guys as a task force, can decide. Well, you know with the survey with some of the other committees doing that already. I mean, I know that you know clue sort of did that as well, and so it might not seem like it, but they did not relate. They did not completely connect it to Covid-19, but they did say that it was some of the stuff that they prioritized was sort of, because a result of the Covid-19 programs that were results of Covid-19, and so I think you guys can decide whether you want to stick with the original idea, which was to keep with our the fundamental or regular priorities and then have a separate Covid-19 list or integrate it and try to say you know what this year is going to be different. The first few priorities are going to be really connected. What about? We use the major guidelines. The major message from the Covid-19, which is essentially we agreed, was pretty much education, sanitation and homelessness, and we start to prioritize those things first and then we see where everything else falls. Then we can follow our traditional guideline, which is you know, housing and then transportation, and then everything else, and so maybe that's the way. We take all those things in front of us and that's what we, where we elevate, those items which are more Covid-19 related by putting them in the front, but this is this: is a capital we're looking at the capital right now yeah. I think that the impact of the Covid-19 and the pandemic is more prominent in the expense budget. Yes, Budget yep I mean the capital budget is the long term. The expense budget is immediate right in the face. Okay, some of these items- yes, like the remote learning, can be related to Covid-19, and some of this is really long term. I mean the remote learning you can say: well, maybe that's the way the future will be anyway, and so then it is long term, but some of these other items here I just look at the it's transportation, stuff and the housing stuff that's now and next year and 10 years from now yeah. So the Covid-19 is well, let's get to the expense, because that's where really in terms of programs in terms of personnel in terms of services, that's immediate! That's the Covid-19 stuff in my mind, something in my mind. I was just going to share that. To me the thing that's most immediate, for me out of these out of this green section, would be the remote learning devices and the RFP for Harborview. I was going to say the same thing. If you look, if you look at one and three, those talk about urgency and even Jeffrey a little bit of your meeting. The moment like these are potentially big things. It's not it is. It is learning devices but could even be sort of broadened if we wanted it to be a little bit more significant and it's in its reach and meeting the moment, and I think one in three are very timely and urgent and also it will be long term because now they're moving into these, you know remote learning in some respect as well in a broader sense, not just Covid-19, but they're training for some sort of remote learning. So, yes, definitely and going along what Bert said Bert when you look at expenses, you'll see ACES, one of the top ones is tech support for the devices okay, which is like what you were saying: let's go ahead and ng I'm going to put it in there and you guys can push back, but I think in G line three a row: three, let's put a one: sorry where it's actually row: three, not that's row: five, let's put a one in row, five, let's put a two, and I would actually recommend that we then go to the next section and see if there are any other seriously pressing. Topics in this category are folks. Okay, with that mm- hmm yeah, can I just ask: does anyone know remind me an RFP was put out for harborview correct yes, but there were problems with it or something, but I, if I remember the RFP did not work they would they withdrew it Helen, Rosenthal screwed. It up. Sorry was that out loud in a recorded meeting. Okay, let's look at the record. Does row six, I'm sorry, I'm at eight sorry, it's so small! I could not see it. I mean eight provide adequate capital. Subsidy, like is this a significant. Is this? Is this number three worthy? Yes, looking at two, you know I wish we would move up the BRC stuff. I mean the homeless family, the families- oh I'm yes, mature. Earlier than that I mean that would be. I think that should be in the one two three four priority, so Maria agree. I agree, would feel comfortable about replacing establishing a new family shelter with this mplp and Sarah. I am pretty sure, but I should just well. I think that it does come with one of my emails appropriate yeah, true, especially since they moved the Skyline family, shelter out right, Maria, yes, oh yes, they did so, let's make g12 number three where it says about a sorry, not G, F. Sorry, oh you already did it apologies and is there anything else up here that feels like a relevant number four like urgent? Well, I thought the practice when we changed that did not we, oh no forget about that. This is I'm confused, okay and actually sorry janine. I was also confused. It should be in g oops. Sorry that view threw me off. We need to somehow note that the family shelter is our is our number three. It's number three. You said right if you, if you do not mind I'd like to make ADA compliant number four okay, because they have been dragging, I mean you know. This has been here for a long time and it's really important. Okay. So, actually, though jeanine can we put it in column g, because I think that's what we're doing above we're putting like the new rankings. So maybe move those comments to age, and so we do not lose them and yeah and then put three and then is everyone, okay, with ADA being four for now. Yes, I agree with christine great okay. Then we have, I do think, like the kids at the, we need books from our libraries. Okay, so that's our five yeah. I think we need to scroll up to make sure we did not miss anything as a progressive. I think you want to go back to back to number one before you start going you're going to go back to these lists and then have to reorder everything. Okay. So, for example, right like do you replace elevators number, two Zack before after library books in my, in my opinion, that's those are big. Going back to what Bert said. These are big long projects that cost a lot of money that are the you know number. You know it's boilers, roofs and elevators, which always are the big capital projects. They have a five- year plan they're in there somewhere. Nycha is going to come back and say we agree with this. But it's you know it's. You know not funded right now or something so are we putting that up or not? I would say it's I think, if, in terms of proximity to what's going on right now, I would think it was after libraries right, yeah, okay, is there anything else in here like we? Have this Trans request number one Trans request is that feels like it's also after a library? No, that can go really low. I mean you know, okay, the clue, one for elevators under g right. That should be, I think, five right or there's six. I think it's it. I think we might be on six okay. So now you can put the the trends. Okay, so we'll put number row six, make it seven exactly seven there yeah, okay, I think that needs to be. We need to. Let's see here, sorry, I spoke too soon like now. Do we want to bring in affordable this preservation, loan and Sarah program like is that is that a seven yeah? Eight yeah excuse me eight yeah, I would say eight on that and then the next. The next Trans item is nine. Okay. I have to put the Wpe request in there of the bike lane stuff. That was so that's 10.. That came back. I think that's 10., okay, I do not number the help student practice reading did we move that? Oh, that went too expense? Okay, yes, okay! Lastly, what's your concern? No that's! Okay! I mean, I think everyone knows my concern about that. Okay, let's sorry, where did we leave off at ten or eleven? We have a nine okay. Now we have Hk. Park is up there, but is Hk Park. Can I put a wrench in this Hk part? I was talking to Jeffrey on Chat and I Wanna see what he thinks. So, since we put out the survey to our committee and since Hk Park has been at least fun funded, partially funded, something new has come up, it was, I do not know Jesse. I think you were at ACES. It was the dog park needed something that came out with the wp. It was the Wp the request to resurface, the Dewitt Clinton dog park and, just in the vein of Jessica saying the having the public be some sort of participant in this, they did come to us with a 500 person petition about resurfacing that dog Park, and I think, if you're talking about you know sometimes with parks. We look I'm not saying Jeffrey, we look for things, you know what I mean, I'm not but like to see what, like I'm not going to argue. We can swap this out run request, that's fine! That came just so. The task force notes that came up in our most recent bpe meeting, and so it was not a part of the mix in terms of what the committee considered. So it was put in as a new request and it did not rank in our top five. But the committee did write a letter opining on the request, so it's totally appropriate and the board adopted the letter as well to have it be in this mix. For sure, oh good, I was not sure I was going to defer to you on the appropriateness. I guess, then the question is assuming we can make the swap. Is this a number 10 or 11 wherever we are or is something still further below more important? Can we look at what's below again yeah? Can I have a question? Does Hk park mean what does Hk park Mean? Exactly sorry, you missed the chat and my shrinking of language before Hell's Kitchen Park renovation, okay, so it's not it's not! Okay! It's not the DEP site park and it's not the dog run right got it. Okay, no right! The dog runs the whit, Clinton fyi, okay. So what we have? We were just asking to scroll down a mindful time. We have this expanding. I mean the school ex construction authorities is a higher level than the Dom park. Yeah the dog park should be down. I was just saying it should be down. I'm not saying should be up, I'm just saying instead of the House Kitchen Park, okay, so let's go ahead and make 11. it should be up there yeah. I do not think we can do all of it today. We need a second meaning. We may need a second meeting. Sorry, can you scroll down okay, so we have we're looking at 11th, 12th and 13th place. Here we have the security cameras, a ferry service, and these upgrades to harborview, I would say, obviously I'm going to play arbor view follow- up review, okay, we're going to consider those there. Okay! So let's make that line 18:11. I think it is one column over if you do not mind, sorry, janine great and then up two, we said that's twelve and then down so right. We said school cameras and then ferry correct, okay, so and twelve above the ferry or not yes, yeah, okay, so the school cameras is 12 and then the ferries, the ferry, actually line 21.. Well, let's just skip we're confusing janine yeah. Sorry. What do we want? What do we want? The school cameras to be so that's number 12., okay and then the ferries we're leaving blank for now yeah, let's go back and find what was it jeffrey? You just said that should go above that the Eighth Avenue Bike, Lane, Line, 21, okay, so remember well, can I can I push something? A little back on that just because it seems bizarre if we're going to do harborview up for the RFP, then we do harborview for their for their pairs. We also have. We also have elliot Chelsea repairs and full openers. I think to be honest with you. I think, if we're going to do harder view, repairs as number 11, I think we need to do elliot, Chelsea and fulton as number 12 and 13. yeah. They all should be together. So I think those must be further down. So let's make hardware view 11 and then yeah that one's right, sorry, that's correct and then scroll down further and let's find the it's row, 23:12 yeah, and was there another one jesse you were referring to yeah, there's Elliott, oh interesting, okay, but your recommendation would be that we had it right. I would add that as number 13., so if you just want to put go below yeah and put in number 13 and just put in elliot Chelsea capital repairs as number 13 that'll surprise you can you verify it's not at the beginning I was I could have so that was the elevators for everybody. The issue right so clue did elevators for Elliot Chelsea, but then there's a separate see. This is the this is the thing I was trying to say at Chelsea's, Gland news, then there's a there is a separate list of stuff that elliot Chelsea. Ta has said: they've also included elevators. So what well, I think, we'll do is just combine the two and make it the combined number 13, if that's okay with everybody which actually then moves it up to 12., but we'll deal with that later was the I think the elevators. Can we go take a look at that language. It may have said in Chelsea developments, not in necessarily elliot Chelsea. No, I do not. Where is it what's separate, broken elevator elevators, it does not say, does not say well, it says disrepair in Chelsea public housing, public development, which is both of them right. That's everything, Chelsea elliott, so I think we should just say in all public housing in our neighborhood in our district. But then, if we have the broken interview for your Chelsea six, why is everybody else in 13? No we're going to? I that's what I was saying. I think we need to. We need to everything will shift accordingly, so I think we can do this offline. No, I think what he's saying is that change the request and make it for everybody in our neighborhood and then agree everybody's in six? Okay, so you leave it as sick. You see everything all elevators acrosss, all the libraries acrosss all nature development right, okay, so we're removing 11:12 and 13.. No, I think you're keeping it that's something I would keep it 11:12 and 13 as being the individual capital repairs from each in from each right. Oh, I see, except for these lobbies and lighting differently in the elevator you're, not changing anything. Just changing the language of number of number five or whatever, yes, okay, good, yes, okay, were you putting the cameras? Well, actually we should like that's 12:13, 11, 12 and 13 are the cameras? No, you mean the school camera the school camera. Can we actually start back with row eight, because we have, I think row. Eight is also not indicated. Oh wait like I want to just go from the top. Are there any we've missed like? Where does Hell's Kitchen Park Fit in? Is that still below all of this? May I ask a question yeah, I think we're placing that not representing. Can you ask a question that jeanine sort by row g, and so we see where we are great, okay, sure good idea. Christine has many titles, but I have always referred to her as a spreadsheet queen and so do not start the top you're going to mess it up. Stop you have to start at rows. Free, yeah, yeah and cut take to g to g and down yeah, no sort by column. It does not have a header last one, no data, headers and column g. You have to remember headers, yeah, sort by column, g right and then remove this level. No, that's it! That's fine! Okay! Oh okay! I mean you're right. Okay, that's the way! It's good! Oh beautiful excellent! So what did I tell you? Several housing transportation, ADA compliance books, elevators we have this number seven is number seven, the right number, seven yeah! That should go further down. No, I thought we had said that seven, that's what we wanted! Okay! Well! Bert wants this station. Okay! Go ahead! I think Jeffrey! No! I thought I thought something else that she wanted. That christine said was going to go above it right or I thought the ADA stuff was about it is about. It is right. Leave it the way it is: okay, housing, tow pound, cycling! Oh no! No! We lost that noteworthy. I need to janine. Let me put the language that you can copy for it. So that way we can stop it. Okay, I'm putting in the chat, janine, okay, and you can just replace that there you go increase, funding. Okay, then Roof, repair right! This is for wait which one this is for. The bike lane winning yeah all right so replace. What's there now with this, you can put it in D I'll put it in column d. Oh, no, I'm sorry Jeffrey! I hate to say we did this. What we have this has been funded yeah, all right great. I love removing things, but every time we ask the question they say Hallelujah, but wait a minute jesse we're sure we got the Jeffrey you're, not getting two well, we need more than one, but we'll start with one. No, I want to know the brand and I want a picture of it. Every time I ask nobody wants to tell me it's called the Jeffrey Christine right. That's the picture of it right. This is our Suv. I mean, I think that that's huge guys would have struggled. We could. Does everybody bring my camera? Oh my gosh, that's amazing! The picture of it in the garage. Wait that literally, could you send it over? I want you to send it. Okay, let's use guys it's getting late. It seems like we have it: let's remove it, just one yeah, let's send it over just send it over. We have a lot removing that line, but I do not want to I do not. That does not mean we get one less wpe ask. It means one of my lesser that did not make the top five shift up. I'm sorry, I have to defend my committee. We got the dog park. Remember Jeff we're going to put the dog party: that's fine, but then we have others as well. If Hk Park is going to get yeah okay, I think that after the tow pound moving up housing feels right. Let's go below that. If we can go to line 16, we have now security cameras, the resurfacing of the bike lane the ferry service. I think Jeffrey wait, oh my god we're sort of I'm sorry. I do not see any of the arts like expenses or is that more expenses? Expensive, gotcha, okay? So anybody making a strong a strong pitch for for any of these to be number 14. Otherwise, now we're missing 10, because the bike lane was 10. so we're everything I think number one. So we're talking about thirty. The bike lane should be 14 for sure, Eighth Avenue yeah. It's really dangerous. Okay, so bike lane becomes thirteen Eighth Avenue bike time, yeah, okay, 13 and then do we want to. Is there anything here, then you want the you want the security cameras for the school right great. Let's make that right. What about sorry, this one's kind of was kind of? Oh, it's continuing support, never mind, and then the fairy is 15 and the library. What about the library, where's, the library, libraries library is an ongoing story. Yeah, the library is 16, I mean just so janine. The one you're on now is 15 yeah. This one is 15 and the libraries that's 16., and then we have a hell's Kitchen Park and a packer truck, and I do not know which we're going to replace the hell's Kitchen Park ask with the resurfacing of the do it Clinton dog run. We did not do that yet right. Okay, so is that 17 yeah correct and your track is eighteen. Jesse is now in order. I'm waiting. Oh then, can I say that it's funding to existing trees for tree guards and tree improvements. That's 18. They responded to us that they would not do it. No, they do not do that to existing trees yeah. They said no. Okay, let's keep these in order, the Wpe original order. So let's make that 19 and the one below at 20. yeah Jeffrey. Can I ask what else we had right now? Jeffy? Oh, go ahead! Ooh! You want the rank right, Maria. What else was left? No? I was just going to ask you what were they fixing? I do not remember at Hk Park what needed to be fixed. I remember before Covid-19 they were renovation of the park. The complete renovation, correct, Jeffrey Lemisch has something: is the running track more important than the dog run at this point in time as more people are outside trying to exercise? I know the dogs have to exercise also, but I'm fine with switching those allen, yeah yep. So no it's really I went by there today. It's really a shambles, no argument. It's dangerous! So just reiterate the change so that janine can make it. 19 becomes 17 and vice versa. Okay, but then we should put the dog run Cl like a packer that you know like. We should then put the dog on up front then up higher. I agree with Jeffrey and Alan, but I'm saying then we should put the dog one up higher than what, though, because it's 19 now is it? Is it before the packer truck or after right? Now it's currently so do you want to make that 18 and the packer track 19? Yes, I do not think it makes a difference. Probably four wpe requests tucked right in right at the bottom of our rank yep in a row when outside space, I know capitals long term. Yes, I see the battle. I agree with Jeffrey and the visual there. Are you taking some kind of offense me, but I just want to be. I want to be emotionless, I want to be practical and say you know. I think we can look to make some swaps, but what about, for example, the ferry having one of those move up in place of where the ferry is? I'm fine with that? Christine? That's fine with me, but do not put the dog the dog in front of the fairy. I agree I mean this is where to me the issue of your motivation. It's the reason that a full park renovation comes into play. I'm also going to play territorial here and Chelsea's got a lot on this list in terms of parks and does not. Can I just ask Jimmy? Can I see from the top again just really quick all right thanks and also, I think, Jesse made a good point if you do not know, if he's still here yeah, if you could keep going or maybe heat someone else about, you know the big ass first, the things that can be done like if we ask for a dog park renovation that can be a win that can be done. You know when we're asking for something: that's 20 million dollars. You know just as far as the big and the doable asks, but also remember that this list ultimately gets shared with their individual departments and yeah and right that way, and so I think- and they also know what's possible. So I think this is as much optics as it is about what is actually going to get done. That's a great point yeah this door. The dog park is not a doorpark renovation. It's just a fixing of the resurfacing a dog park. Renovation is going to involve plumbing it's going to involve water. It's a whole big thing: it's not. What we're trying to do is just get the surface redone, so people feel safe about it. Right I mean well, I want to go. I want to go back. Maria made the suggestion about possibly switching the dog ground with the ferry there seemed like there was some traction on that like I would vote yes, the dog Lover. I did not suggest the dog, I love it. Maria good idea. Sorry, a wpe request, that's at the bottom for Jeffrey to choose with the ferry request and it seems like there was traction around that. So are we a go on like Jeffrey? Can you isolate which one you want to do that with how about the hell's Kitchen Park? I mean I'd much rather put Hell's kitchen park there and then put the dog run below the ferry and look Leslie we're going to we're going to fight on this, but 400 thousand dollars does not get you a new park. I know Jeffrey, I have a. I have a seven-, year- old. I go there all the time with her all the time it we let we the people I used to go. I do not think she's fighting against you on that. So can we make the change? No, I'm saying that I love House Kitchen Park. I go there all the time I was just there. Yesterday we were gardening, it's just that I just do not think it needs to be renovated right now. In fact, we were saying how it just got renovated. A few years ago, like I would like, since I, since the the what is it called the fairy is in trance, I would be ready to trade it for the track. The Chelsea park track where people are going to turn their ankles. So, okay, give up, go ahead, give Chelsea more parks. They've got Clinton park on twitter. It's just like Christina, I'm not arguing with you on this. You know I like the idea of the Penn South Basketball court. I mean people from the both from the projects, go there and play basketball, but still Chelsea. I would rather do oh it's true. I would prefer if people are going to turn their ankles, I mean at least it's a safety issue. Okay, because we are, I thank you for making the concession Jeffrey we're going to switch ferry and Chelsea track. Yes, okay, so 17 becomes 15.. That's right! That's what we're fighting about one position exactly! We will send this back to everyone for a final review to catch things like what we just caught, which is you know, an optics issue that sometimes you can't see when you're so up close and I'm going to suggest that we now move as quickly as possible through the expense budget or get as far as we can in the time we have do. Not you think we should have another meeting. I mean this is like this is a lot of work. Expense is even more complicated. Well, so are you proposing that we not even start with expense right now and move everything to another meeting which you guys have to present something to exact right? But actually, let's try again. We can try, we can let's, okay. Obviously it's not work. Let's have enough that we can solidify an order of priorities if not actual priorities, so that we can. You guys, present really bold here, okay! Well, we now know what we're approach we're taking, which is. We do five at a time and we say: what's got ta stay up at the top, so here we have DOB code enforcement, dangerous intersections, broken elevators staff for homeless families and after school. I think it's after school enrichment and then litter basket. Pickup. I need to get back on my language factory. That's okay, litter basket! So using our past language something's wrong, something's wrong with this ace is number one. No ACES is number one is not that ACES number one was the staffing for the remote to the digital tech support or whatever, and we need to bring over the one from that was capital. Oh that's right. We have to bring that over or did that not that was that put in capital and that should have been expense. Yeah. There was something which was a digital subscription that was for the licenses. That was the licenses library, digital libraries, yep. That's actually becomes there. I do not know in Leslie I'll defer to Leslie but and Alan, obviously that they that has to be factored into ACES. This whole thing, but ACES number one expense was definitely was the was this tech support right yeah it was the licenses and then the tech support. Sorry for a second. Can you do a control find for tech, support or just the word tech and let's see if it's somewhere else in this list yeah? So it's number two it's right here, right there yeah! Okay, so are we agreeing that was supposed to be number one? Should I switch it up Alan? I think the licenses were number one right, so I think the tech support was number one and the licenses were numbered. We were number two okay. I mean same difference since the licenses were just put in the wrong category: okay, right. Okay, so let's make that a one and re- sort, it yeah wait, you can just cut and paste. You got ta, stop what you're doing and bring me the spelling. Oh sorry, I'm sorry I have my daughter and she's making slime. She has to go to bed and my husband's. I apologize okay. Well, while that's happening, I wanna. Maybe we can say it seems based on our earlier conversations that including additional funding for the homeless families would we would agree to keep that in the top priority and providing students or whatever the ACES ask. The education ask remains priority. Our elevators, the increased gapping level for trained and skilled mechanics to serve public housing is that okay, it's skilled, elevator helpers and mechanics. It should be helpers, help ers and mechanics. Okay is that are we committing not to be in the top category for expense, or we want to hold off on that? The only thing, the only thing I do not feel I mean, maybe expand code enforcement. I know that this is critical, for you know limiting homelessness, but I would I would maybe move that one below the group number one I mean personally, I would move everything. I would only keep the HHHS and ACES request for number one. Personally, okay, I Wanna see what two has the you know. I keep playing number three get your best kid litter back. Okay, I can be on board with litter basket, yeah again, because the language is not there. I just want to confirm with Wp we're talking about service right, we're paying we're talking about staffing for a little pickup right, yeah. Okay, that's the same thing to make that a priority too. So you know we talked about in the capital having new elevators, but you do not have if you do not have skilled staff, I'm not saying it's not important. I just think that there may be. You know other issues related to homelessness or education that are going to come before and I do not want to give up all of our top slots. That's my feeling Maria! I do not have my own list up, but I the one that says three there. I thought that was a housing request. It's not, I guess, for code enforcement, the top one. If you scroll, left chimney, that's acrosss the board. It was it's been. It was: it's been a Chelsea. It's been a Clinton hell's kitchen, it's one! It's been Chelsea, it's about the special districts, so it's about finding hiring two dedicated inspectors, specifically for the special district enforcement. So I think it's a long. It's a multi- committee request, but I also agree that in the during this time, if we're going to prioritize Covid-19 related, you know top issues. It might not be the number one. No it's three, let's scroll down to the next set. Okay, hey guys this dolores sorry, I had not been able to chime in you guys have been doing great enough job, but I disagree Jesse about moving it down because as we get into where there's a harassment on the rise and landlords are trying to find ways to monetize their buildings when they're losing tenants to push old tenants out. I think it's really important to advocate for anything that helps keep affordable housing, affordable, which is maintaining the affordable stock that we already have. So I'm a little bit worried about moving. I think I think then I think we need to reword it, because what I think we want to talk about, then the the Dobs tenant advocacy department. We know it was run by who's. Actually, I do not know if anybody everybody knows this is run by Sarah, Desmond now and so who's. Oh yeah, that's right! So who's! You know for HCC executive director, Former Board, member of Community, Board 4, former housing co- chair, so I think we want to use change the language. So if that's what people want? That's fine! I just think we want to make it clear what we're saying then, because I think this is a little bit different than special district stuff is a little bit a little more nuanced than 10 antenna protection intended. You know, tenant harassment, stuff, I think you're right. The focus I mean the end result is to what you just spoke to. If there are other folks on the on the task force that do not have a problem with maintaining that I'm happy to rework the language so that it falls into tenet protection and it is very much in keeping with what a lot of people are fearing right now. I think it's more important. I would have a tenant protection and emphasize that in terms of cooking I agree we should change the language. If that's the desired impact, I still would ask if we could just hold it. I'm curious to see what's in the group, two of other key services, and it may be that it's in the top five, I'm not saying it can't be. I just if we've been following this path of what is absolutely must be and holding everything else. It's not clear to me. That's an absolute must be gotcha. Okay, let's go again! Okay! So number two list: two thank you we have on in line 11. We have the text say homeless, receive risks. We service them yeah. I think you know it's a it's a crime. I just. I think we need to change that language right. That's an important well, I do not know what other word to use it's about, helping them break the cycle of being yeah. No, I understand what you mean. I just decreased re- entering homelessness. The word is bizarre. It is it connotes a negative sentiment. I agree, so we can work on that language. I think this one should move up. As a matter of fact, I think this one should move up in number one section: okay, so just to review what so, because not everyone, I think, has it right in front of them. We have alternative use of empty buildings, offices and theaters, expand homelessness, Prevention, expand code enforcement conduct, traffic and parking studies, increase residential recycling and libraries. So I think what we've heard at a minimum is that Expand, Homelessness, Prevention and the digital libraries are. They should go up yeah, so we could not put twos on those. I guess has been what we've been doing. Can I say one thing: I'm sorry on the on the moving up of the homeless, one is the problem, and dolores and Maria can probably explain. Is the problem, the budget or is the problem? The management- and I know, obviously you say well you throw more money at it and it and it you know it helps the management problem, but right now we're in a problem of not budget. In fact, the money is going back and forth and all around here with these homeless shelters and these hotels, it's more the problem of management and I'm just afraid, we're saying you know: okay here expand the funding and that's going to sell so Leslie. I do not think that our budget request is saying this resolves it, but I think that you we need to continue to advocate for funds to homeless issues. The whole idea and concept around people saying defund, the police is really about reallocating resources and if we can put as much resource to preventing homelessness, which includes the protections etc, and all of that, I think that we do a lot more to get people off the streets than to increase enforcement and things like that of police and things like that. I'm sorry, I see what Leslie is saying, which is. Maybe we want to change the language there to say you know, increase the management technique. You know the management. This ask is not about that this. If and I'm good Maria, I mean it's expand, ged completion programs and job readiness and training. So this is not about. This is not about the management of the homeless, shelter yeah. I think I think we're talking about social support, yeah, leaving the shelters, leaving the homeless hotels, maintaining their independence. Can I make a bridge these two things? I think what we're trying to say is that what we have completely realized now with this, certainly with the temporary authors, what we're used to is a shelter coming in and providing services that we can really understand and wrap our brains around what we are having now is these shelters coming in no longer having the facilities or the capabilities to run these run. These have these services and provide them adequately right, and so what I think we're trying to say, is in light of what's going on right now. Programs such as what is listed here need to be funded better to be expanded and better funded with the new situation. We're in it's not so much the management of the shelters themselves, because they're, just literally just beds and beds and rooms and people provide maybe some social work. You know case management on site, but we're these guys tell me if I'm wrong. Maria is a lot of time. These folks are going off- site to other places. They have other programs they're involved in and that's what we're talking about funding yeah, I would say yeah. I would not say that yeah that way later, we'll word it that late way later to explain the connection to the current crisis that we're all in okay. Thank you. This is not what it says: Jesse we're talking about knife line, 11 right yeah. I know that's what I'm trying to say, though yeah this is about not in the shelter. This is after the shelter. No, it's both. No! It's both so I think this was pre covered and then the one thing is in order to decrease homelessness, recidivism or re- entering homelessness. Having these services in place, which you can see, they're really about long- term success when you're talking about job training, education and when people when families move out of shelter, usually they have no support system in place and that's the idea of having you know case management. Three months after exiting shelter I mean and to Jesse's point no. I just instead of prevention support services, not prevention. I think we can change the language that this is important and needs to be in category. I think for sure that line should move up. Okay in the interest of time, I'm wondering if we can get through the next section and then re and then reprioritize, so we will essentially have our top five for sure locked in before exec. I think Jesse, if you're. Okay, with that, I think that would be at least fine notable progress. So if we can scroll down right so, let's put B's actually sorry janine can we put B's and everything that still is blank? Unless anyone objects and then and then now, let's do threes and then let's re-, rank the whole this whole one, two three section and we'll call it okay, the one caveat to that is, I just want to make remind people that we have made expanding homeless outreach programs and we put it into Cs because in the years previous to Kyovid, there's been so much funding put towards that and they have doubled up on their staff, and things like that, so I just want to remind people that that's still down at the very bottom, and I know that homelessness is obviously a major concern. So I do not know if we just wanted to shift that out and move that to the top, and I do not mean to complicate things Jessica. I just yeah thank you for raising it. I think I mean I would to the extent that it's not in other, that ask, is not in other requests here. I personally would feel that we should make move it out of Cs and into five it's not on the page. I would move up. I would select line 21 the mechanical room line 20 and line 17. we already have so this is there's been multiple times when multiple committees have opined on the same subject. Wpe also took up litter, basket collection and had it as item one under expense, yeah and it's been maintained in that way, yeah. So this can be deleted. Sorry line 20 can be deleted. Great, it's our it's! The it's okay! First ask yeah! Okay! So sorry reiterate, we just we said 17 should get a three and, I would say, 20 yep and then everything else can be behind that. Okay, so let's put C's in the remaining and if we can sort just this section. Is everyone? Okay with that? Let's try to get this in line, noting that we're also going to be adding continuing support for homelessness as an actual number. So we have to add that you move down. What is what is after that? Oh yes, wait! I'm sorry! Why are oh jeez, yeah Maria? I was just going to say we're picking the street sweepers over supporting restaurants and business owners. I think we're saying we definitely should move it up, because everybody was concerned about sanitation right. I'm not saying that the next thing is out, I'm just suggesting that those are definitely the sanitation most people are concerned with is not so much street garbage yeah it was picking up. Annotation is one the basket the best yes and then residential agreed yeah. So forget about this complaining of this garbage in the street. Okay, so are we leaving row 20 as we're moving it from three to c? Yes, okay, but then I think what Maria is saying is that we should take. That's a three. No. I agree. I agree with that right. Okay, now, let's do let's sort it now. Okay, sorted and we are talking about changing some of the language are not we yeah, okay, yeah. While we're doing this guys, I'm sorry. While I was inflicting corporal punishment on my child, you should not be telling saying that sorry is this recorded? Yes, yep whatever it's on YouTube, you have no idea. What's going on right here, that's okay! I missed it. I'm sorry! I know the ACES thing was: the digital subscription was moved to expenses. Was that put up there, I'm guessing it was I apologize if I'm not going to we're going to review everything top down now. So if you do not catch it, we made a mistake, but it should be here. Thank you. So I think there's this question: can we actually add a line janine we're really putting it right here but of at a row. Rather, I do not care where, but somewhere in the ones. I guess that we can decide how we want to prioritize for continuing support Outreach. I think we can just say reason, homelessness, outreach and then I'll leave it to you guys where you want. To put that, I think we should put this one number one yeah. I think so too. That can be just so. Let's in column, h put one minute: wait a minute: Jesus slow down! Okay, yes, so yeah we're going to put a one there! Yeah is two: is it another homelessness issue? Is it the tech support for families and students? I would pick I would pick tech support for students and families. No really, I should probably be picking the other homelessness issue, but I feel like the tech support is needed now. Okay, let's put that as a straw. Man too, is three homelessness, that the placement support for homeless families yeah what about the litter basket, and then I would put leather baskets yeah and I want to say something about the litter basket, because we had language that we eliminated down below about eight million dollars for overtime, etc. I think there are two things about the litter baskets one. We want them. We want restoration of what was cut plus we want more than what was originally there yeah. Well, our request was originally was to baseline the eight million that the council has to do every year. That was really the request, so I think we were saying we're going back to pre- coveted cuts right or pre. You know this curve cycle cuts, you know and that it gets baselined. I think that's what the language but did not. We want more than what we were getting. No, we were, we were asked. We had got more, we had gotten more than what we were getting and that that's the eight million and then we were paid in overtime and we wanted to be based on Jesse. You are going to put all this text in reason and all that stuff, of course, christine right and then we're going to put it in number three yeah. We will make sure it's cleaned up: okay, yeah, no column, three does not have the right number right. Column h does not have the right number for what no, it should be three for the leader and the other homelessness is four. No, the other homelessness is playing three. I said three. You said that christine, but I do not think there was agreement. Yes, somebody said yes, okay, yes, now that's a lot of yeses. So, let's we can come back to it. If we want to do it, let's move ahead and then come back. So is number five. Is five homelessness or is five digital library, digital libraries? Homelessness? Did you have three homelessness? It's kind of digital libraries, digital libraries, okay and take out tcrwp yeah, we'll clean that up. Look folks homelessness versus digital libraries yeah, but there are three: it's a lot the digi. The homelessness is at least if they do not. If they do not, if they do not get digital libraries, they could they wind up homeless. So at least you know, okay, let's make it so prevention. It's a it's! A major prevention of homelessness, a possible homelessness, okay, education remember! This is only going to two different ages. Yeah, exactly go ahead, so let's go homelessness. Digital libraries! Let's continue homelessness in line seven. Six, let's make, I think home, delivered meals, seven yeah! Can you scroll down a little bit? Oh wait! This is the last one, so this would be eight yeah, okay, anything in the lines that follow. If janine you want to scroll down. That feels like it is absolutely a nine and a ten. What was the matter? Restaurant, the 31 intersection to somewhere like this one yeah 12., make it the next one I'll make it nine yeah. Okay, I also want to advocate for line 14 yeah I also want to advocate, for the line is around. It was for recycling it's to put recycling on par with regular trash pickup, it's a little bit further down in here, but we should consider the environment and and the Wpe request in I have a question about that amen to the recycling. So you want to have recycling every pickup time. No, it's I think, there's only one right now the request is going to be for a thursday, so twice Thursday and then line 17. I'd like to put it next after that in number 12., because it's going to happen can 13 be number 11. Can 13 be number? Oh yeah. I agree with that. Yeah, okay, so that's 11. everything shifts down and then 11, because 12 and 12:13 and then lines six fifty yeah. What about 15 right what's on 15 is about decreased usage of commercial space. I do not know that this is very tangible. I can't see it was a that was some clue. We wanted a study of yeah. Okay, I do not know yeah. Alternatively, creative views is going to be. You know, put homeless people in there. Can you just check janine that we did not miss anything above nine, that's gone. Reinforcement where does is that the next one that's 14 yeah. I think we're good with that right. We're closer. We have code enforcement on 16 maria. What were you saying about the after school programs? You wanted that put it up there? Oh, I was just agreeing with Jessica that it should be up a little higher yeah when she had selected it which one okay, let's, since we've we're almost in the home stretch, can we janine? Can you resort one like we did earlier? One, let's see it in order and make sure we're comfortable she's resorting I have a question after school? Are there after- school services, I'm just asking that question. I know when you know a hybrid or a remote. Are there after school grow ups? Now I think a lot of it is. I think it's removed, I'm sorry so there's after school, but it's remote, yeah, there's some that are live there. It's someone's life, some is life. That's all I wanted to know is still our after school. It's this thing, distancing, okay, so to go through this. We have homelessness outreach. We have tech support for families, placement leader, litter, followed by digital devices. Excuse me followed by ged programs and social workers, meals, followed by economic relief for outdoor dining intersections after school after school. I do not know, I wonder if after school should be further up, because it's the kids, I mean right, it's the kids who are Mo, who can't afford alternative programs who are going to be moving and that's going to happen right now. I agree with you, but the only thing I say is going back to what you put it out in capital. This will get distributed to agency, and the list will remind me of that when people, when I push back again tomorrow, well it'll be a top talking point for you, so jeffy you're asking for you're asking for two days: recycling, not just one correct, and do we do anything with the organics that did not make it, but you know bird I'd be happy to have it on here. We could put it after what the what we're up to 16. I think next, in line for Wpe request: okay, well, looking: let's look at what's left here then below we have permitting alternative use of empty space. Better math future needs forget about the decrease. I think line. 19 should be the next one. I agree great 16:16.. What about someone asked about the arts? What about cultural organizations here it is like 21. Do we want to make that 17? It's important! That is just it's not relevant in the time yeah! No, it's nothing! This was the study. I thought we got that too yeah. We did get this great. So, let's take it off. Yeah see ya. I wanted to continue support. Okay. There is an issue in terms of cultural facilities in the pandemic, but we do not have anything about that here, but that's a real issue. It's a considerable issue. It's about you know rehearsal space or this or that not just facilities. They do not need rehearsal. Space yeah also are not the sport in general. If you know the collapsing what the issue is, I mean, why do not we? Why do not we change our section where we are talking about the restaurants? Go up a little bit yeah here we see no where's above them yeah it's right. It's row, nine. What row nine yeah should we should we include in this is support for restaurants and artistic. You know that's going to go to a different agency, then totally different agency. This is specifically about creating programs for the support of the heaters bubbles. Yeah. No, I know yeah it's not this, but maybe we create a new line that nobody did Jeffrey, that I agree. It's sort of it's under the federal, it's the federal title of the bill, but the save our stages, effort right, like figuring out how we can incorporate asks we've made in the past to our culturals, because it's but it's not just it's not just stage venues. It's also museums, music, exactly designers, costume designers. Can someone take charge of just putting together the language and then yeah, and we should talk about jobs in the arts. You know yeah, that's! The idea is to support jobs in the art in the art space, the industry is devastating. Yeah. Yep, you should have something here about that. Absolutely okay. So, given that given the time- and we made a lot more progress, we should have worked under a tighter deadline on the first round since we flew so far so fast with this one. I think unless people have immediate reactions to what's left here, we can kind of put together but assign some further values. Based on the knowledge of these past conversations, we have to clean these up in terms of the edits that were suggested as well as just general typos and as we're saying also, if you have other suggestions for language, whether it's who will take on this cultural piece, ACES we'll take it on great, although it is also what's the number, can we create a number a row for it, though, if it does not exist yeah it should be below the restaurant. So let's have it be number nine good. That's sorry is that right, yeah, it's number nine now would be number nine and everything else moves down. Great good. Okay, then, can I add something it looks like a time, but I thought I saw something for 16 years: their senior meals, their meals. We put that as number seven, and there was something also about that. I'm sorry what about how many more expense items are there? I think they're like yeah at the bottom. This goes up to what 40 or 41 or something yeah. I mean we have more there's more than that's on this list. This is just the top five from each, so we were just focusing on the first 30 and then the worked out. There was something about seeing it somewhere else, but it was. It was about helping seniors to age in place, yeah, that's why that's what pandering this case management, one yeah! I saw that that's what I was referring to sorry. I do not have a suggestion right now where it should go. So I think we should. I mean Jesse. I I'm, I do not know if you think we need another meeting and if a round exec or like, if this is enough to present to exactly after before after we could re- huddle or huddle again to finalize, but I also think that we could probably get pretty close and share this and then maybe just do a quick call where people share any specific feedback yeah. I know you have plenty enough to final for to present to exec, because I think you have you have the top. You know the top 30 capital and you right now you're close to the top 20 expense. If we, I guess the question is two things I mean listen. Your task force is made up of mostly exec members, so so they'll be the ones that will be you know talking about and deciding on it. The other quick thing I just wanted to touch on that. I know I came late on to the meeting. Was this the any edits to the statement of district needs? Has that been? We discussed that at the top and everyone agreed well. I agree that I would send out again an email with people's suggestion, with assignments to remind people which sections they had agreed to review, and I asked that we have all those edits asap so that we could have that document. Revised. For example, yeah that'd be helpful yeah. No, so I think I think we can between now and Monday, we'll have to work hard to try to clean up what we have. I think the question is whether this group right now feels that what we have listed under at least up to now with whatever's remaining is enough. Where we can go ahead and just do it direct, you know: do the exp do the expense like we'll do the k like we'll do the capital, which is that everything past 30? Will you know clean up and make sure it makes sense, but it'll just sort of all be what it was sort of last year? I think I think what would be helpful is that if you can send us a draft of the order or the new order and then if anybody catches, something that we totally forget forgot, you know we can see. That's fine. I just I guess my question was as long as I can. Definitely we can definitely do that. I guess we'll do we'll do that and we'll send that, and so I think what we'll do is you know it we'll do our best to get it to you, Mon by Monday, and then, if we feel like we need another meeting to you know hash out someone some other priorities, then you'll. Let the group will let us know, but I think you have enough to get execs approval. Yeah did you have half of exec here exactly okay? Thank you. I hope this was challenging. You are a committee. You need to vote to recommend. Can I ask quick questions so if I, after I look at the draft that you send, if I want to suggest a place for the other program for expanding services for seniors, can I do that or I can't do that later? You can do that at exactly. Okay, thank you move to recommend the formed list for adoption. Second, third, I'm in favor, yes, great any opposed anyone. Abstaining enjoy the debate. Janine, please keep your fingers. Thank you very much. Is your daughter? Okay, thank you. Thank you! He's, okay by the way, she's, okay, I love her eyes. I love her, get some rest bye, everybody, everyone, no matter, Kathy! Thank you.",
            "summary": "Those to remind everyone, Jessie and the office created a essentially a worksheet online, where you could put in Second piece was to review the statement of district needs, Whatever's left of it to go in just even focus on the section you committed to again The letter is talking about FY 22, so we want to eliminate any references to previous years, so I will send that back.\nUnfortunately, not everyone completed the survey, but we have almost 300 people who did complete the survey and with that we asked people to first identify the three issues that they believe need: expanded, funding , I think that our long- standing priorities matter, but that we should also acknowledge what people sort of on the street are saying right.\nAs we look to prioritize and take these take all of these various requests on the capital expense that we have, I think we should just try to keep all of these different.\nYou can see here 60 50 pages plus of comments, and our thinking was that we would then take this and kind of bring it back to each committee less that this would necessarily inform any budget request at this time because it is preliminary and these issues maybe have not been heard by committees themselves, but the committees can take them and use this as an opportunity to be less reactive.\nI do not want to conflate that with a budget issue christine, you have your hand up It seems to me that the top line that you showed is really not totally reflective like healthcare and human service.\nKids are not in school kind of narrative, Right, okay, I'm, going to just stop sharing for a second Ever People are talking about homelessness, sanitation, underlying all of this, the subtext and talking about hospitals and is the pandemic Yeah sure and the economic effects of the pandemic and the economic effects reverberating through the city.\nThis is what people are saying, right, and so I think it's important that we reflect that in the context of we are in a special time.\nThese have been the major concerns that are impacting our community in real time, and we need to ensure that the budget protects some of has some protections put in to ensure that we do not worsen these problems, and then I think that the main categories Alan.\nI, actually think that it may not be a good idea to re- prioritize our long- standing district concerns because they're going to exist.\nThat could be the Covid-19, response, and I think that also it does need to be more informed, as throughout this year we get more input which we will from our partners that are in education, and your committee is very strong in terms of getting that input.\nWhen we talk about our district needs, what are the long- term's effect on all of these items that we have as priorities because sanitation, so the garbage does not get picked up on a corner for a couple of days and people throw this stuff out there as funds come back in sanitation will straighten itself out when you have kids out of school when you do not prioritize or somehow keep kids in schools or make their learning abilities to overcome the deficiencies of not being in school.\nI agree with what I heard Alan say, because a lot of this is going to depend upon November 3rd, because you know it's clear that what Speaker Pelosi wants to do in terms of providing money to cities and states depending upon what happens, November 3rd, that will either become part of the federal budget or it won't, If that money is coming, in, like Alan, said easy problems like the trash getting picked up because they cut back, sanitation will get fixed, and I.\nThree four and five, I was saying, upgrade school from ACES right, replace the limiters and other affordable housing requests, which was adequate capital for HPD at the Harborview terrace?\nThink we do have on number three for ACES is additional books for students to practice at home and lending libraries I'm just reading off what district 2 sent me as far as the superintendent's their priorities?\nWe're, saying it's not actually your second capital priority It's going to go, move into the expense side.\nThe ask for HPD, wait a minute, but when we can select all of those right, And I know you mean like an even bigger renovation, but I think even residents were like wow- There's money.\nSchools have gotten away from that, and this is more, as this says, classroom libraries in the future, which is good Janine, the line where you just put move to group two that actually needs to go down to where it says bump up to second capital.\nSecond, capital, ask: we want to put a two, a two there: okay, great Okay, so now in tier three, we have another downsizing, a shelter, ADA compliance for pedestrian ramps, a ferry service.\nJesse thinks it was, but Steve did not get back to us today on whether or not it indeed has been funded and then just on the Clinton hell's kitchen land use the fairy things should not have been in their nchrklu right,, it's a transportation fans or what wpe?\nThere are less bets there currently because of Covid-19, but You know when there's a vaccine available, so I guess I need to think about that one, a little bit more and talk it over with some folks.\nI. Think the most important thing here, though, is going to be establishing a new family, a permanent family, shelter in the district, because we do not have any the family shelters we do have I do not think we have had a letter, a resolution to ask, for what do you mean interesting?\nWhat I mean is that we have not seen a letter from HHS asking for such a discussion on the family, We look at the language, it says, downsize a single men's shelter and establish and add new family shelter.\nOkay, downsizing does not mean converting nobody's asking votes, it does not say, eliminate the BRC and have a family shelter in place of it.\nGetting combined into one, if you remember years and years, ago, right so ever since BRC started, we have been on record for saying we think it's too many beds.\nYou know we still think Brc's should be reduced, but we do want to have a family shelter return to our to our area, and so that's the So. It looks to me that we should have two entries in this day and age right and one of them should be establish a new family, children, shelter and then the downsized BRC would move way down in the priorities.\nYou can make that note, here, maybe even in column g like not in that very column, but next to line 12 or in line 12, that this is going to be about establishing a new family, shelter.\nOkay, so it sounds like ACES I mean personally, I mean we're not doing a lot of sorting within, but school cameras feel less important than I.\nOkay, so is our top priority education remotely the these all feel so minuscule to me in the age of Covid-19, every single one on this list actually sort of falls flat in what I think is a neat.\nSo one thing with this top list: is, I think at least the ACES is actually directly related to Covid-19, which is the remote learning and the funding for remote learning, And I mean I.\nThey did not completely connect it to Covid-19, but they did say that it was some of the stuff that they prioritized was sort of, because a result of the Covid-19 programs that were results of Covid-19, and so I think you guys can decide whether you want to stick with the original idea, which was to keep with our the fundamental or regular priorities and then have a separate Covid-19 list or integrate it and try to say you know what this year is going to be different.\nYou said right if you, if you do not mind, I'd like to make ADA compliant number four okay, because they have been dragging, I mean you.\nI mean you know, okay, the clue, one for elevators under g right.\nI mean, I think everyone knows my concern about that.\nJust in the vein of Jessica, saying the having the public be some sort of participant in this, they did come to us with a 500 person petition about resurfacing that dog, Park, and I think.\nDoes Hk park mean what does Hk park You missed the chat and my shrinking of language before Hell's Kitchen, Park, renovation, okay, It's, not the DEP site park, The dog run right.\nRight., Chelsea, elliott, So I, think we should just say in all public housing in our neighborhood in our district.\nRemember Jeff, we're going to put the dog party: Okay, I think that after the tow pound moving up housing feels right.\nDo not know which we're going to replace The hell's Kitchen Park ask with the resurfacing of the do it.\nI'm saying then we should put the dog one up higher than what, though, because it's 19 now Probably four wpe requests tucked right in right at the bottom of our rank, In a row when outside space, I know capitals, long, term.\nIf you could keep going or maybe heat someone else about, you know the big ass first, the things that can be done like if we ask for a dog park renovation that can be a win that can be done.\nI mean I'd much rather put Hell's kitchen park there and then put the dog run below the ferry and look Leslie we're going to But 400 thousand dollars does not get you a new park.\nWe will send this back to everyone for a final review to catch things like what we just caught, which is you know, an optics issue that sometimes you can't see when you're so up close And I'm going to suggest that we now move as quickly as possible through the expense budget or get as far as we can in the time we have do.\nYou know other issues related to homelessness or education that are going to come before and I do not want to give up all of our top slots.\nIt's, a multi- committee request, but I also agree that in the during this time, if we're going to prioritize Covid-19 related, you know top issues.\nDo not think that our budget request is saying this resolves it, but I think that you we need to continue to advocate for funds to homeless, issues.\nLong- term success, When you're talking about job training, education and when people when families move out of shelter, usually they have no support system in place and that's the idea of having you know case management.\nI just want to make remind people that we have made expanding homeless outreach programs We put it into Cs because in the years previous to Kyovid, there's been so much funding put towards that and they have doubled up on their staff, and Things like that.\nNo really, I should probably be picking the other homelessness issue, but I feel like the tech support is needed.\nI. Do not know, I wonder if after school should be further up, because it's the kids, I agree with you, but the only thing I say is going back to what you put it out in capital."
        }
    }
}