{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCfBY8CR8hKrHEAtEU5U0vcQ",
            "title": "Identifying Funding for Minority- and Women-owned Businesses - A CB7 BCI Webinar 2020-07-22",
            "publishDate": "2020-07-24",
            "shortDescription": "",
            "lengthSeconds": "1:01:52"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "0Pvy0pcourc",
            "fillerWordCount": {
                "uh": 78,
                "um": 146
            },
            "readTimeFullTranscript": "39 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "business": 65,
                "loan": 29,
                "credit": 26,
                "bank": 25,
                "businesses": 24,
                "cash": 24,
                "terms": 20,
                "information": 16,
                "banks": 14,
                "financing": 14
            },
            "wordCountSummary": {
                "business": 15,
                "access": 7,
                "bank": 7,
                "capital": 5,
                "loan": 5,
                "services": 4,
                "institution": 3,
                "director": 3,
                "financing": 3,
                "funds": 3
            },
            "fullTranscript": "Yeah and where's the recording it's recording, okay, we're recording, but we're not broedcasting youtube, because it's it won't. Let me in I'll keep trying you guys go ahead. Okay, Linda I'll mute yourself. Linda just give us one more minute for Robert. Let me just because he's joining us, so I did not. I do not see it here. That's weird see what we can do here. Okay mark, why do not you make me a co- host? Just okay, and let me just let him know- mark okay, well, hi there, everybody and thank you for joining us, we're just waiting for one more of our panelists to join us, but let me give you a basic rundown of this. The idea here, as you know, is that a lot of a lot of minority- owned and women- owned businesses did not get the funding. They'd anticipated was not these. It had a lot to do with their relationships with their banks with lenders. Also the ways of doing business, which are you know, changed a lot over the years, and so one of our committee members, Bci business and consumer issues. Committee members, Madeleine Innocent, came up with an idea that we reach out directly to minority- owned and women- owned businesses that can really give granular information on what to do and resources on how to help businesses. Small businesses get access to funding. Now I should introduce myself I'm Linda Alexander. I am co- chair of Community, Board, 7's business and consumer issues. Committee and I'm here with my co-. Chair is Christian Cordova and we are here with our community board: seven Chair Mark Diller and several members of business consumer issues Committee. So let me give you a brief idea of a brief rundown of the people of our of our of our panelists, because they are amazing, so we're going to be hearing from and we're waiting for him to join us. Robert, L Ritette he's a partner, davidoff, Hutcher and Citron Llp, and he chairs he co- chairs the firm's bankruptcy practice group. During a career spanning more than 45 years, he has represented such noteworthy clients as John Delorean, New, Rock, Harley, Davidson, Angelo and Maxie's La Marina and Brother Jimmy's, David, Hutcher and Citron Llp is one of New York's, most respected mid- sized commercial law and government relations firms with offices in New, York, City, Albany, Washington, Dc and White plains. We're going to be hearing from Madeleine D marquez who's, the senior vice president of Ponce Bank and chief external Affairs officer, Ms Marquez oversees the cra component of the bank, as well as SBA initiatives, cdfi initiatives, community development, programming, non- profit initiatives and all community affairs events. Homespun founded in 1960 has 13 branches in New, York and New Jersey. It is a minority deposit institution and Mdi and a certified community development, financial institution of cdfi and we're going to hear from Sherry Lane executive, director of capital access and center operations for New York, City, Small, Business, Services, spds and Ms Lane oversees the city's network of business solutions, centers and industry business service providers which provide free services to entrepreneurs and business owners in all boroughs. These free services include business courses, legal assistance and help that help navigating and selling to government and financing assistance. She also oversees Sbs's capital access program, which includes managing multiple funds that aim to reduce the financing barriers for underserved business owners and rounding out. Our panel will be Patricia daley, deputy chief of Diversity Office of Comptroller Scott Mcstream, Ms Dalek focuses on Controller Mwbe University, which is a runs, a series of workshops specifically designed to increase access to contracting opportunities for mwbes. She also advises the comptroller on policy recommendations that change how New York City does business with women and people of color through reports such as making the grade so previously, Ms Dalek served as the advisor of diversity policy at the Office of New, York, City Comptroller and the assistant director of policy at the coalition for asian, american children and families, and so without further ado, we're going to start with Ms Marquez, Madeleine, Marquez and she'll still help us with that, and I will be right back madeline. Can you unmute yourself and talk about some of the initiatives that we have well good afternoon? Thank you Linda. Thank you. Mark and thank you madeline for the opportunity to be here with you today, as Linda stated, ponce bank is has been, was established in 1960 and was celebrating our 60th anniversary this year. We've served on the bank communities since our inception, and we will continue to do so because it is part of our mission, our vision and our core values. With that said, I'm hoping to cover a powerpoint presentation that we've created for companies, whether they're, a startup or an existing entity as to what you need to do to obtain financing and how to package your the loan request, I'm trying to take a 20-minute presentation and shrink it into and zoom it into a five- minute presentation for you all with that said just real very quickly. There's two types of loans, they're secured and unsecured and, as the words will stay, the secure ones you have to provide some kind of collateral for it and the unsecured ones are just what they say: they're, unsecured, nothing covering them at all. We're used to having other either a short short- term loan or long- term loan and based on our repayment ability most businesses would need on longer- term loans. We also know and we're very familiar about what a revolving credit is, and mostly that is the cards that we carry with us, that many entrepreneurs use to finance their companies as well believe it or not. So those are the basic types besides a personal loan, besides a fixed asset loan and letters of credit, so that in itself is the realm of what banks offer in a nutshell, as it relates to loans and of course, I forgot to mention the real estate loans that could be covered by SBA programs. I want to go into what lenders go about looking for when you submit a request, they want to know how you handle your credit in the past. They want to know how you've repaid your credit in the past and the types of credits that you have. Okay, so that's something to look at when you're. Looking at your own credit reports, they want to know how much that you've carried how you can afford to repay that debt and the ability and intent to repay. So if you have any blemishes on your credit reports, I advise you to please try to clean those up as you go along in terms of trying to obtain credit, and then I think, most importantly, is what kind of cash flow do you have to repay back. So I'm covering a generic holistic approach of how to go about packaging. Your request, I think it's key that you be prepared and that you understand what exactly you're going going to use the funds for whatever you do not tell a banker. Oh just give me whatever you can, because that tends to shut down a banker and it implies that you're not ready to even be considered believe it or not. That's a that's an automatic declination, so you need to be prepared and understand what is going to cost you if you're going to acquire equipment or working capital delegate and identify what that working capital will be used for. Do you have equity to contribute? Someone you got ta have skill in the game as they say for a bank to feel comfortable in providing you with a loan. Do you have any collateral? Are you ready to go to a bank, because there are many other lenders that are not financial institutions that can also afford you the ability to get capital? That's not a bank, so you have to do your homework in terms of the type of lender and the type of loan that you're also looking for alternative financing mechanisms are all over the city of New York, and I believe my other colleagues will cover that. So I will just keep on going as fast as I can. Are you planning to shop around which banks are you going to, and you got to remember that believe it or not. Although banks are competitors, we talk to each other and we and so you're going to have to tell the same story to the same to the banks you go to, because we do communicate with each other if you're shopping around. Remember that be careful with what you say and be and know that bankers will talk to each other in terms of being prepared. You got ta do your homework and I have a little example of how you can go about doing that when I first started doing this presentation years ago, it was the age of binders and files. Now is the age of flash drives. So let's use that as the example it's a place where you can keep all of your documents for creating this package so that you'll be prepared at all times. So with that said, let's talk about a little a little bit about the history of the company. You have to include that, if you're a startup, then you have to identify what makes you different within that industry. If you're an existing company, then your history has to be what I say: dump: okay management. We tend not to talk about ourselves as managers of these companies and let me tell you, that's the most important part, because the business is nothing without you, as the manager so highlight all of your qualities. All of your good management skills that basically get introduced into the company and are a reflection of the company. Do you have as a business any special issues like specific to an industry license and certificates? What are they? You have to at least have a copy of those and either copy to this flashlight or dump it into this binder. As we go along we're going to be creating, you got to start with your finances and Robert we'll get into that, but you basically need to understand the use of funds to sources and uses. We look for a resume believe it or not, and the traditional resume and many business owners they've been in their business 10:20 years. They do not have a resume well make one up, because your ability and what you do in your company is important to us as bankers, and also we need resumes of key people that are helping. You manage your company, there's a nice format on the Sba.Gov website. It's called the SBA forum 912, which can help you do that in terms of owners. Robert I'll get into this you've got to know and complete a personal financial statement. You've got to understand what your personal tax returns are include your personal history in terms of financing requests understand what it is that you're asking for. Are you asking to buy equipment? What exactly is that, in terms of your business, if you're in business for more than three years, then of course we're going to need the 3ds financials we're also going to need your corporate tax returns that Robert can get into later. We're going to need to understand, based on your projections where it is, you want to go with this financing, okay and you have to start with the balance sheet the income statement and adjust all of that accordingly, to what it is that you're requesting do you have any existing debt and if you do then highlight what that is and identify what it was used for. Basically, many companies have affiliates, but those are mature. Companies startups are not going to have any affiliates and mid- size companies may so, if you have an affiliate, do a quick little blurb about what that affiliate is, and at least identify to corporate tax returns, what kind of size of an affiliation? It is. There's a couple of entities that you need to familiarize yourself with. We use the durian breastfeed report as a credit report on that entity. So I advise you to go to Www.Dmb.Com and in there provide the information on your company. Let me give you an example: if you go to a bank and you're, not in the dmv system, well the bank's going to request a report and they're going to come back and investigate you and inquire that so from a company perspective and a business perspective, I rather provide them with the information. I want the Mb to have so that everybody else has the same thing and also it will now slow down your package because you're already in the system. The other thing that you need to be aware, of course, is the actual three entities that are going to provide credit information on the personal and or owner of that entity. So that's the transunion of the world Equifax and the experience- and please know what your credit score are know also that you're entitled to one free credit report from each of these entities on a yearly and annual basis. So that's something that should be promoted to our small entrepreneurs, whether they be minority owned or regularly owned, and I think another little kept secret is that we from a banker's perspective. We compare your businesses to what's called risk. Management, Association, Rma and many of our entrepreneurs are not aware of that. So, if you're going to provide us with financials and or protections, that's the only place we go to compare what you have and are you in sync. So I would recommend that you also familiarize yourself with that. Compare your business history to the industry, familiarize yourself with the competition in your industry and know that banks and SBA will use the Rma report to insert in their underwriting mechanism. There are many, there are many other. There are many programs that you qualify for as an entrepreneur. Sba has the most lenient ones in terms of startups in terms of mid- sized companies, and it's also known as the SBA 7A program. I also know that for the last three or four months I've initiated on the Bonsai bank, the ppp program, which is for payroll, and if you any of you, are interested in that we are open at this point in time and accepting applications, but that is only to complete payroll, not for working capital. I believe that SBA also had an Aidl loan that you can qualify for under the disaster mechanism that the government designated us for and that you can use for working capital, and then you have the regular 7a programs that can be used for anything and everything I am going to basically leave it there in terms of the lending capacity. I, if you take into account everything I basically stated you need to have in this flash drive on this binder. That, in essence, will constitute your business plan and or your proposal to a banker. All of that information they're going to want to know regardless, if you're going for a fifteen twenty thousand dollar loan, it's small in scale versus millions of dollars. The same type of information, regardless of loan size is required, but with an in- depth attitude, if you're going to have a larger loan, I'm going to leave it at that and tell you that, basically, with that flash drive and that binder, you can be prepared at any point in time to provide your package to a banker that may be interested, learn what we call your elevator pitch, learn to talk about your company in one to two minutes and highlight that keep it current updated when needed and copy when needed, and I will end with that at this point in time- and I think I was under my six minutes. Thank you. Thank you. I know we're going to hear from Robert in a moment, but every if you have questions, please put them in the chat area and we will be reading them and if you want to come on camera to discuss them, that's fine! So, at the end of the presentations we will, we will read your question to your questions, to you know for the individual, panelists and so I'd like to introduce Mr Robert, and he will tell you legal standpoint of this and thank you so much madeline. That was amazing. Thank you. I did not think I could do it. I assume everything is thank you thank you Lyndon and madeline all right good afternoon. My name is Robert Rotten, I'm a partner with davidoff, Hutcher and citron firm in the city, who is very active in the city itself and those things that move around it, I'm educated in the south, okay, but I moved to New York more than 40 years ago and I'm an experienced bankruptcy lawyer who especially, is right. Restructuring small to mid- cap businesses and Linda asked me to talk to you about how you avoid me and that's, okay by me, I'm happy to figure out a way to avoid having that having to address the problems right. There are many challenges that are facing with small businesses and, as I mean, particularly with startups, with regard to startups, the first issue you need to cover is you need a former corporation. A lot of people forget they started their own businesses out of the back of their car or in a small shop. You want to avoid personal liability if you do not form a corporation or a limited liability corporation or one of those protected environments, you can lead to personal liability for things you did not intend and if you're going to have a partner make sure you have a shareholders agreement, you may never look at it again until there's a problem between you and your partner, so you can confidently look at both right, but in getting into a small business. Most of the small businesses that I have seen over the years are under capitalized have limited funding all right, and you have to understand that the success rate for most businesses is on them less than 50 percent. They will succeed for any lengthy period of time. Okay, but the main reason that you can succeed in the business is using learning to use management tools and it starts with having the necessary accounting information at your fingertips and making sure that your accountant understands how to produce these invite these items for you, one of them, is the monthly statement believe it or not. I can't tell you how many core companies I've seen over the years that forgot how to balance their checkbooks and do the basic minority minor skills like okay, balancing those checkbooks making sure that their credit cards gets reimbursed and negotiating the rates of the credit card processing companies. Okay, issuing to yourself, let alone to the bank, a regular quarterly financial statement, so that you know exactly what you're doing right and then, when it comes to dealing with bankers. Okay, all right the idea of having your own personal projections and cash flows, something that well. Why would I do that? If I'm not applying for a loan? Actually, you do it so that you get an understanding of how your cash works during the course of a business right here, if you're in a cash business like a grocery store. You know your cash in cash out and your cash flow is exactly will match up neatly. But if you're selling goods on credit or all right then buying goods on credit, then they do not match up and that's why you have to use a cash flow to figure out all right. If you're going to have the money necessary to pay the bill for the goods you bought or that you have sold, for example, most people sell on net 30 terms and most people. They think that well, net 30 means in 30 days or less I'll collect, but in reality it's more like 45 to 50 days between time of invoicing in times of collection. So you really have to be cognizant of what your cycle time is in terms of billing and collection. So you need in order to be able to understand that you have to get an aged accounts. Receivable done it's a new skill set. Okay depends on what you're doing and how you're collecting that and that directly reflects in terms of your cash flows. So when you go to the bank, okay, the bank returns to you and says: well what do you need the money for okay and then? How are you going to repay me properly? Constructed projections will tell them that you're going to use the property, the money that you're borrowing right to make a successful business which will produce an income and the cash flow will tell you how what income you will have available at the moments that necessary to be able to service the obligations of the from the bank or the lending institution and putting those two ideas together. They seem like this should be one item but they're. Really: two: okay, oh and there's one thing that frequently falls by the wayside right. I recommend highly that you use a tax service. It's easy to borrow from the government, but there's a 25 penalty taxed on that. So make sure you pay your payroll taxes on an orderly basis and the best way and most efficient way to do that is by using a payroll service, they're, cheap, okay and in the scale of things they will serve. You more hard act than they'll. Do anything else so use a payroll service use a responsible account and if an account does not understand the difference between projection cash flow, then I strongly urge you to see another account because there's a distinction between the two you may have. In addition to it, you have to have reserved for maintaining your equipment and besides acquiring new one, and if you succeed, you succeed and you start to develop a cash reserve. The idea is to hold on to it. Do not spend it all right. I can't tell you how many times I've seen a successful small businessman all right decide that he was going to be the big butter and eggman next and go out and buy himself a fancy new car or incur fancy new offices without reflecting upon what he is going to do in terms of cash flow with the necessary requirements. So you have to plan to maintain your assets, reserve for expansion and understand the difference between fixed and variable expenses, because fixed expenses are what you you're going to have to spend in your cash flow and the variables the ones that invent your business has even expansion or reduction. You can afford to float okay or to quote Muhammad Ali Float like a butterfly and sting like a bee okay. So you need to understand what you need and what your needs are, but still maintain the flexibility. Okay to afford your business right. Banking madeline has already covered most of the banking issues there. I have found that mostly smaller banks are more responsive to the smaller businesses, but each bank is out to loan money. They make a profit loaning money all right, but they suffer a loss if they loan money and they do not get repaid. So their first focus is how much do you want to borrow okay and what's your ability to repay it and they're not going to lend you the money to build a fancy premises or to divert the funds they want you to use the funds to expand your business in a logical manner and they want to make sure, through the use of cash flows, that you have the ability to repay the loan in an orderly manner. They want to make a profit. They do not want to charge you default rates. They want you to come back, expand your business and keep going. Clients are actually customers are actually hard to find successful ones, even harder. So to be a successful banker, you have to understand your client base in terms of how to make sure that they succeed in their businesses, and that has to be tied in with your cash flow, all right, so loan payment for the source of funds. How are you using it? Loan repayment becomes extraordinary important. The government under the new programs provided the ppp because of Covid-19 prepared the ppp loans and the SBA loans. Call it the idle loans, okay, they're there for use and the programs have been expanded and I believe others will talk about it more in a few minutes, there's one problem: I have with borrowing money today there are some of these merchant credit associations they're, basically mc. They call, I call them mcas, they are legalized shylocking, and you must make sure that your client, your friends, your friends and family, stay away from the Mca's the moment you bind yourself into an mca you're, looking at a 30 or more right interest rate and it's legal. What you're doing is you're selling your future receivables, your future cash flow for an immediate cash bank, it's not in the clients or the customer's best interest, so that Linda have. I exceeded my time target right now. So thank you. Thank you, Robert Richette and thank you very much and now we're going to hear from Sherry Lane, executive, director of capital access and center operations for New, York, City, small business services, SBS, who will explain some of the available opportunities and how to get different types of access to these great well. First of all, thank you all so much for having me it's fantastic to hear from the other panelists and to have the opportunity to share with all of you some of the resources that SBS has to offer. So I'm going to try and focus in here. I know we're limited in time and want to make sure we have time for questions at the end. So what I wanted to cover is just a few of the many areas of free support that SBS offers and how to find that support. I know right now, we're often all of us hearing. You know, there's this option for help and this option for help, and then the question is well. How do I actually find it? So I'm going to try and connect those dots and I'll put my info in the chat at the end as well. So if folks have follow- up, questions feel free to reach out so the few areas I wanted to focus on one general reopening assistance, particularly for businesses that were forced to shut down temporarily two business education and that's both for folks that are interested in starting up a new venture or have an existing venture and want to kind of get a refresh on some of the nuts and bolts of running a business and then three financing assistance. So we've talked a lot. Madeline mentioned a lot about lending, but it's a very overwhelming topic, so I wanna share a little bit about how Sps can help navigate that process so quickly, with the reopening assistance. Just wanted to make sure everyone's aware. We have regular information posted on the website. It's just nyc.gov business. We have webinars constantly coming out with the various phases we know. Regulations are changing very quickly. It's a lot to digest so we're trying to synthesize that as much as possible, so in terms of access check out our website and then also we have a hotline, it's 888 SBS for NYC, so I will I'll post these things in the chat once I'm finished speaking as well, so that's reopening for business education again, I want to want to point to the website for anything that I did not cover. But, as I mentioned, we have both webinars that are interactive. That usually are in person, but right now we've brought them to a virtual space, but they are interactive. They're ran by our network of business solution, centers acrosss, the city, and they cover topics from building a business plan like Madeline was talking about. That is a detailed process, and sometimes you do not know where to start. So we have some free courses on that. We have courses on marketing. We have courses on financing so feel free to check those out they're all completely free and those are the interactive courses. We also have a suite of online courses that are always online through a partnership with a digital learning platform called Coursera and again those courses are available to help you either start up a new business. Think about you know, what's your idea, how to get it on paper? What are what's the market that I want to serve feel free to check those out as well, there's also courses in that platform geared more towards operating businesses to help you sustain your business or grow your business, so the website for that is Nyc.Gov business courses, so I'll put that in the chat as well, and I wanted to start with talking a little bit about the business education piece, because I know we're talking mostly about financing here, but I want to just emphasize that hand in hand with any either application for a loan or taking on a loan, particularly now, in these uncertain times it's critical to have that harness on your budget on your operations. Everything is changing like crazy right now. I do not have to tell you all that you know so how, in parallel to figuring out what are my financing options, you're, also consciously thinking, how can I cut my cost down? How can I think of new ways to bring in revenue? These are really hard questions. It's not a simple thing that you can only learn in a class, but the classes can help kind of get those juices flowing and be thinking about. You know what are other ways I can be adapting my existing business operations or, if I'm thinking to start a business. How do I prepare myself to be flexible, so I can survive in this time with lots of variables. So that's why I wanted to kind of focus on the on the business education resources. First, that being said with my remaining few minutes, I want to talk a little bit about the financing assistance that we offer so acrosss the city. We have business solution, centers that are staffed with finance account managers that offer free one- on-, one assistance to go through a lot of the binder that madeline was talking about, and the purpose of this is that's a lot of work, sometimes when you're starting to apply for a loan, especially for the first time. You might not know what, where to find my p l, what what's a cash flow statement. You know what are all these finances that I have to get together for the lenders. How do I tell my story in a way? That's compelling, so we provide that service for free both in terms of helping you put that package together, but also to try and navigate the space of a broad variety of lenders in the city so again to Madeline's point. Every lender kind of has a different sweet spot. If you will it's kind of a gray complicated world. So what we try and do is make that clearer and more accessible. So whether it's a lender offers a certain product that we know might be a good fit. We can help make that connection. Sometimes it might come down to the credit score or the credit profile of a client. Some lenders are more strict than others, so we try and help navigate that process and help our clients understand what they might be eligible for and then in certain situations it might not be the best time to take on a loan. It might be the best time to focus more on what are my operations. How can I kind of tighten up my costs? Think of new revenue opportunities as well, so we try and help hand hold through that process and again in terms of access, there's also a form online. It's Nyc.Gov financing assistance, I'll put all these in the chat after, but that will allow you to fill out a simple form online. Give the information on a basic level about your business, about what kind of financing you're looking for, and it will help us connect you with someone that can walk you through one- on- one or attend a small group session on what your options are. So we'll tell we'll in those sessions. We would talk about SBA products about products that the city offers. The city offers a few products as well, and we have relationships with lenders, acrosss the city, to help, try and find that perfect mix. So that's, I think, in a nutshell, some of the services we offer and how to find them I'll drop them in the chat and then happy to answer questions. Thank you so much sherry- and this has been we've had so much interesting and important information. That's being shared and rounding out. Our panel is Patty daley from the Office of New York City, comptroller, Scott, M stringer, so Patty tell us about Mwbe University to start with yeah. Thank you. Thanks Linda and Mark Christian Madeline from cd7 and shout out to Mike Stinson from our office, our Manhattan borough director who connected me with you all. As Linda mentioned, my name is Patty Dalek, I'm the deputy chief diversity officer within the New York City Comptroller's office. If you do not know the Comptroller Controller Scott Stringer is the chief financial officer for the city of New, York he's the chief auditor chief accountant and the fiduciary to the city's pension funds, and our team's focus is to ensure that the city uses its financial power from contracts to investments really to level the playing field for women and people of color. So I'm going to start off with a survey that we did of mwbes on their challenges and experiences during Covid-19 in applying for aid and applying for city contracts. We've seen nationwide that businesses owned by women and people of color are closing as a result of Covid-19. I'm sure Robert is very busy these days, and so we wanted to take a look at Mwbe, specifically in New York, and this will give you some context on why it's important to reach out to people like Sherry and Madeline, for support on financing and for city contracts. So I'm going to share my screen, so we can go through some of the findings. It says hostess. I may need to help you do that. Give me one. Second, no problem: okay, try it now all right! Yes, all right. Can everyone see my screen? Okay great? So we did this survey we reached about a 500 Mwb East throughout New York City for Ucb7 you're. Obviously in Manhattan, so 32 of our respondents were in Manhattan. We saw a breakdown in terms of minority group that matches the breakdown of Mwbs acrosss, the city. So more than half were women. We saw about 34 were african- American 19 were asian-. American and 18 were hispanic- american. We saw a few emerging and local mwbes emerging and local business owners in there as well, and we saw that about. Half of respondents were in the professional services. Our first question was: are mwbes able to access Covid-19 related contracts with the city, we saw that 65 percent of respondents that shared information about their services said that they were ready and able to do business with the city. They did offer a service or a good that could help the city with relief efforts or recovery, but we only saw that about 62 were actually able to submit a proposal or or try to compete for a contract and only 10 were able to receive a contract. So we saw that big disconnect between people who said they were able to offer and people that received contracts and I'll share. The link to these survey results afterwards. Our next question was really around: did mwbes in New York City receive relief, so did they get contracts and did they get relief from the private sector? Overwhelmingly, we saw that the answer was no madeline was on some of our webinars from April through beginning of July. We saw about 1600, mwbes and shared all of the private sector, resources that we could find, but we still only saw five percent of the mwbes in our survey actually got dollars from either corporations that were doing that were donating dollars or to not from nonprofits. When we look at the federal dollars, the Eigl and the ppp that that everyone has mentioned on the call. So far we saw really a mixed bag. About 26 of nwbes did not receive the e- I- D- l, but we did see about 33 percent receive 50,000 or more, and then we saw a mixed bag of like the smaller dollar amounts, and the same thing happens with the ppp about: five percent did not did not receive the ppp, and then we saw that the larger the dollar amount the more received those dollars. So it's again it was a mixed bag about 45 percent of mwbes that we surveyed received 50 grand or more. When we look at why people did not apply and what barriers they faced in accessing federal city and private sector relief, we saw that 25 percent of Mwbs did not even apply for federal or city funding. They saw either restrictive application criteria or they were restricted in the use of funds. They did not want to be subject to that debt or the high interest rates. Some folks did not even know about it before it was closed or the money was gone before they had even applied when we look at those that did apply but did not receive funding. Madeline mentioned this earlier. Credit score was a big factor. Other application criteria were other factors as well. For example, there were some funds that required you to have a business size of two or more so solopreneurs were left out. Others were still waiting for approval at the time that they responded to the survey and then others were rejected and were not told why they were ineligible, could not reach a human to tell them why they were ineligible and then again we saw that funds were exhausted before their applications were processed. The city did, for a very brief time, have funding available for businesses. We saw that only 40 of the businesses that we surveyed were able to put in an application for the city, business continuity, loan of the 40, only six were approved, and when it came to the employee retention grant, we saw only 48 mwbes, applying and of that 15 were approved. So, given all of this right, given a mixed bag, mixed results in terms of relief funding, very little access to contracts, we see that the long- term viability of mwbes is in question. 30 of Mwbe said that they would only be able to operate for a month or less given their current cash on hand. When we look at the six months outlook, 85 percent of Mwbs said that they do not have the cash on hand to go more than six months. This is huge. We also know that it's because of this huge dip in revenue, we saw that eighty percent of mwbes lost revenue a median of about thirty eight thousand dollars between those months of March and may, while we were in really the thick of the pandemic here in New York City, and so we asked what are the, what were the toughest things to pay for, given that you have lost all this revenue? What's been the most challenging expenses and we heard payroll and rent- and this is all because thirty five percent of mvbs have not been able to operate during Copa 19.. We did see that about 65 percent were able to operate either as essential businesses or as non- essential but online. So what did Mwbe's ask for what do they want from the city of New York in order to have long- term sustainability right over and over? We saw that they asked for more access to contracts, which is everything that we've heard from mwbes, at least for. As long as I've been in this position, we also saw okay. If I can't do business with the city, can I have some flexible grant and loan dollars for reopening? Can I have help with cleaning supplies with PPE, with testing assistance with marketing, as Sherry mentioned that the universe to navigate loans, grants contracts is really challenging? It's a great cloud, so they're asked they ask for that. One- on- one support to help navigate and then, at the end of the day, people are just asking to get back to work. So this is what we found in our survey. Linda had mentioned: Controller Mwbe University. This is an a series of workshops that we put together to increase access to contracts for mwbes. Our next one is on August 6th, and that is around how to do business with our office. So the comptroller does about millions of dollars of contracts with professional services, firms for standard services, catering everything so I'll drop the link in the chat. If you see that something you offer actually matches with something with within our office, you'll be able to sign up for our event, we'll you'll talk one- on-, one with with the folks who actually do those purchases, and that's all I have thank you. Thank you, Fatty and I'll probably be I'll, probably be there. So that'll be a lot of fun. So once again, I want to thank our panelists. You were amazing, Christian, I'm you're, taking it over with the chat and correct. Thank you yes. Well, we have a so far only one question on the chat, so what we have is what's the interest rate of borrowing from a bank, and why is a bank better than finding investors? I would not say a bank is greater than finding investors. It's just a different format of finance in your company. Investors are normally used when you're starting up and you're looking for hard capital, and you go to a bank when you want additional working capital and that you have some years under you. I do not think many banks that I know of are doing pure startups, but there are a lot of alternative lenders that are doing startups. The first one that comes to mind, for instance, which also got additional monies this year from the cvfi is true fund. True furnace one is located in New, York, City and Startups Accion New York is also the startups, but at a smaller scale. So when I stated earlier that you need to understand where you're going for financing, I meant it because many banks are not they're going to decline. You based on lack of history, and it's not that we want to decline. You we have what's called regulators that manage the banking industry and tell us what we can and can not do, and that's the way of life, that's life. So again, investors are not better than banks are not better than investors. It's just exactly what you need to understand what it is that you need and go for what is appropriately going to suit your company. How do you spell through Fun, P-, R-, U-, S-, U-, N- d got it yes and then innocent yeah. I wanted to make more of a comment and a broad question. As only a couple of my board members know I was self- employed. I was not an entrepreneur. My business was on 106Th street in Columbus, Avenue new vanity beauty salon. Before I left school. I always wanted to open my own business, never thought about a bank, I'm just giving you a scenario of what type of people are out there that are needing help, but I went to my father and I presented him, I'm the only and first person in my family that has been self- employed and I'm pretty proud of that. I wish he was still here, but neither here nor there, but I went to him and he funded me. I did well between seven and eight years and my employees were people in the neighborhood who wanted a little cash wanted something to do. They ran and they got my supplies and that's how I kept people in the neighborhood employed. However, my business collapsed when my mother passed away my grandmother passed away. All my support system passed away, so this still not thinking about a bank or getting any extra funds. To reinvent my business, I lost a lot of my clientele. Finally, I went to work at New School University for 10 years, but there are people out there like me, never think about banks, and that this is what my concern is because if there were people like me, as far as their self-, sufficient and funding their own business, but this webinar here is so informative. I wish you knew you guys 25 years ago, but how do you reach those people like me who went to family members, friends whatever to support their business? Like Robert was saying cash in cash out? That was my business, but if it was in existence with the Corona virus, I live in niger. They would be evicting me right now, because I would have no funds thank God for my family, but where are those people you all spoke about? It a little bit, but where are those people who never put in their mind that banks are available? Different financial institutions are available and they're just timid and going out there and finding what helped can support their businesses? What can you say about that? Well, let me let me give a crack at that. I think what you're doing right now is one of the ways we need to continue day in and day out, providing webinars and providing this information to all the Mwbe University. What the small business development centers do not do. I mean that is what we need to do. It's unfortunate. I do want to also state that for any of you that know of sole proprietors, independent contractors, they all qualify for the ppp program to survive during these times and we need to get that word out as well. I think the irony of small entrepreneurs not utilizing banks to the to the extent they can is that they're still opening up bank accounts to maintain their funds and operating their businesses, yet are limited to the access to capital from within those same banks. So we understand that. That's. Why we're an mdi and we try to not only work with all the small business development centers, the Sbdc and the Controller's office to just promote and get the word out. I think education is key to how our entrepreneurs survive. Thank you. Thank you. So we have another question from the chat from Melanie Westok, which may have been answered already. It says what advice do you have for sole proprietors? I am a one person photography business. I have not worked since March. It feels like I'm starting over after 20 years in business. He qualifies that individual qualifies for the ppp right now. So, if I were you that's what I would do Sir and you have 24 weeks to utilize the capital in hours to pay yourself, because you are a sole proprietor. I would advise you. We visit our website at www.postbank.com and apply with the documentation that we're requesting it will take you at least two and a half it'll cover at least two and a half months of your own salary. That's why I mean that is open right now, it's going to close down as per SBA by August 8th, but you could still you have you still have time. There was another comment that said ppp before you leave that all right remember: it's! A the ppp loan is a grant coverage month of your average monthly payroll for 2019 plus a factor including rent and insurance or approximately 25, because of that it's a grant. So it's a two- step process. You apply for the loan and then you apply for the grant that covers the loan. To the extent the grant does not cover the loan in full. The interest rate is right: two percent one percent, one percent- so right it is foolish not to go immediately and make the application, but you got ta, follow up all right to ask for the grant portion of it by December, 31. yeah. The forgiveness of what Robert is alluding to is the actual forgiveness side of that loan. Only after you have expended the funds, can you ask for the forgiveness portion of it, but look at it. This way you are applying for two and a half months of your own salary, so that's definitely going to be spent, so the forgivable amount will be the same amount of the loan. It's a win- win and you only you're running out of time. So please apply right away, yeah and can I just add quickly Robert. I think that's a great point that it can be forgivable, but you have to go through the loan forgiveness application order for it to be forgivable. Otherwise, that's you know an additional monthly payment. So that's another thing that the business solutions centers can help you with again to Madeline's point. You have to spend the money first on the eligible purposes, but afterwards definitely go through that forgiveness application and it makes the loan forgiven, which effectively turns it into a grant all right. I think what I want to add as a relationship, forgive the forgiveness side of the house of the ppp right. Now as we speak in legislation, they are evaluating, what's called a p4, that's the fourth stage of this program and within that they are evaluating nationally. What whether or not they're going to forgive no questions asked any loans up to 150,000, I'm recommending any of our elected officials that are on this call to please consider promoting them, because most of the entities that we helped finance were loans under 75,000 and anything under 150,000 will help this entrepreneur out and the forgiveness application. When it first came out, it was monstrous. So then they came out with the easy one which still is going to need, Robert and or Sherry's help to complete right, so we're looking forward to the P4 materializing itself, hopefully soon within August or so, but from a bank's perspective. We can not wait for that to pass okay. So there were two comments from shadow and Reserve I'd like you to comment on, if appropriate. He says ppp does not help a sole proprietor that is not making enough money to take a salary, and also ppp also does not help anyone that is showing a schedule c loss on the schedule, c loss that is correct on a sole proprietor. Your salary is your salary, and as long as you provide the documentation, it should so. I do not know where they're getting that information from Christian. Thank you, okay. I do not see anybody else asking a question so Alinda. I think we've almost met our time again. I want to thank our panelists for your time. I want to thank everybody who joined us doc. Kleimena has I actually thought this was a seminar was going on a little longer, I'm so grateful for everybody, and it's I really all this information is so chock full of just important stuff. I in my personal life, I I'm a commercial real estate broker and I represent tenants and landlords, so I'm often in a position of advocating for a tenant and helping them prepare, and also I'm sometimes on the landlord side, where we're reviewing these documents to evaluate a tenant. So a couple of things, first of all, I'll just try to fire them off, because I know we're pressed for time something that madeline said. I just had a question about that. Banks speak to each other, so I know just from my own personal credit history that when somebody when you apply for credit, if you have too many inquiries, the first that counts against you unless it's your a self inquiry or you're, taking advantage of the free credit report that each credit agency offers each year. So my question is, I guess, what's a question to comment. I always advise my clients that to be careful with whom you are applying and really go with your first choice. First, because your second choice, your you may have a ding, but what I did not know- and maybe madeline can explain what is allowed for one bank to another to speak to each other. I thought that was fairly confidential other than credit reporting. It is dog, but when many entrepreneurs submit their same package to different bankers, okay, that's issue number one and when one banker has turned them down, they'll continue to go to different bankers and what I say in terms of relationship that bankers have with each other, they'll call and say: why did you decline this one or do you know about this deal? Another thing is that if I can not do that loan and I know of a bank that can do it, then I will refer it out and that's what I meant by talk to each other now. Let me also quickly answer your credit question. There is what we call a hard pull and a soft pole. A soft pool will only allow the banker to just check out. What's on your credit, it will not be registered with the credit bureaus a heartful will. So you have the right to ask whoever you're submitting your package to and control that you have to manage expectations unless they're going to give you a firm offer. They should not do a hard pull if they're just evaluating and seeing whether or not they can't do it. They are allowed to do a softball. Thank you and my follow- up is just simply that what I do to advise some of minority- owned businesses and women businesses sometimes their first language, is not english, and that does not mean in any way that they are not a viable business and entrepreneur. So, but sometimes they may be perceived that way, because they are not able to articulate themselves in writing or in person. So I'm so grateful for what Sherry said about being able to put together these documents before they get to the decision makers, because some you do not get a second chance to make a first impression so, and the last thing is that sometimes I advise startups, I always say startups- are not a dirty word. Starbucks was one store once so, especially now that landlords have a lot of vacancies. I hope it creates more opportunity for minority and women- owned businesses and startups, because the language can't be quite as picky. Quite frankly, so you know it's just really important. I think, to also have advisors admit, perhaps someone who is already a few steps down the road where, if you want to open a nail salon or a beauty salon or whatever it be bring in a partner, because that automatically ups, the ante and, of course that ties into what Robert said about your partnership agreements and everything else. But anyway, I just, I think, it's terrific what's being discussed here and we need so much more of it. Thank you, oh okay. So thank you. We have we've. We are we're right at we're a minute late. But once again I want to thank our panelists and if you have any questions for them, you can contact me. You can contact Christian and we will get the information over to them asap or you have the information for SBS and the Office of Comptroller and Funds Bank and Madeleine Marquez. So once again, thank you very much: Robert L Ritek Partner, Davidoff Hutcher and Citron Llp Madeleine, B, Marquez senior vice president and chief of external affairs officer for Ponce Bank, Sherry, Lane, executive, director of capital access and Center operations, New York, City, small business services, SBS and Patty Daley Patricia Daley, Deputy, chief of Diversity Office of Comptroller Scott M, singer have a wonderful afternoon folks and thank you again, bye- bye. Thank you too bye- bye. Thank you. Everybody have a good afternoon.",
            "summary": "It is a minority deposit institution and Mdi, and a certified community development, financial institution of cdfi And we're going to hear from Sherry Lane executive, director of capital access and center operations for New York, City, Small, Business, Services, spds and Ms Lane Oversees, the city's network of business solutions, centers and industry business service providers, which provide free services to entrepreneurs and business owners in all boroughs.\nThese free services include business, courses, legal assistance and help that help navigating and selling to government and financing.\nShe also oversees Sbs's capital access program, which includes managing multiple funds that aim to reduce the financing barriers for underserved business owners and rounding out.\nShe, also advises the comptroller on policy recommendations that change how New York City does business with women and people of color through reports such as making the grade so previously, Ms Dalek served as the advisor of diversity policy at the Office of New, York, City Comptroller and the assistant director of policy at the coalition for asian, american children and families, and so without further ado, we're going to start with Ms Marquez, Madeleine, Marquez and she'll still help us with that, and I will be right.\nThe other thing that you need to be aware, of course, is the actual three entities that are going to provide credit information on the personal and or owner of that entity.\nI also know that, for the last three or four months, I've initiated on the Bonsai bank, the ppp program, which is for payroll, and if you any of you, are interested in that we are open at this point in time and accepting applications, but that is only to complete payroll, not for working capital.\nAttitude, if you're going to have a larger loan, I'm going to leave it at that and tell you that, basically, with that flash drive and that binder, you can be prepared at any point in time to provide your package to a banker that may be interested, learn what we call your elevator pitch, learn to talk about your company in one to two minutes and highlight that keep it current updated when needed and copy when needed, and I will end with that.\nBut the main reason that you can succeed in the business is using learning to use management tools, and it starts with having the necessary accounting information at your fingertips and making sure that your accountant understands how to produce these invite these items for you, one of them Okay, issuing to yourself, let alone to the bank, a regular, quarterly financial statement, so that you know exactly what you're doing right, Okay, all right.\nWhen you go to the bank, okay, the bank returns to you and says: Well, what do you need the money for okay , Constructed projections will tell them that you're going to use the property, the money that you're borrowing right to make a successful business which will produce an income and the cash flow will tell you how what income you will have available at the moments that necessary to be able to service the obligations of the from the bank or the lending institution and putting those two ideas.\nThank, you, Robert Richette, and thank you very much and now we're going to hear from Sherry Lane, executive, director of capital access and center operations for New, York, City, small business, services, SBS, who will explain some of the available opportunities and how to get different types of access to these great well.\nSo in terms of access check out our website, it's 888 SBS for NYC, so I will I'll post these things in the chat once I'm finished speaking as well, so that's reopening for business education, again That usually are in person, but right now we've brought them to a virtual space, but they are interactive.\nTo start with talking a little bit about the business education piece, because I know we're talking mostly about financing here, but I want to just emphasize that hand in hand with any either application for a loan or taking on a loan, particularly now.\nSo we provide that service for free both in terms of helping you put that package together, but also to try and navigate the space of a broad variety of lenders in the city so again to Madeline's point.\nThink of new revenue opportunities as well , so we try and help hand hold through that process and again in terms of access, there's also a form online.\nYou do not know the Comptroller Controller Scott Stringer is the chief financial officer for the city of New, York He's, the chief auditor chief accountant and the fiduciary to the city's pension funds, and our team's focus is to ensure that the city uses its financial power from contracts to investments really to level the playing field for women and people of color.\nSure Robert is very busy these days, and so we wanted to take a look at Mwbe, specifically in New York, and this will give you some context on why it's important to reach out to people like Sherry and Madeline, for support on financing and for city contracts.\nWe saw that 65 percent of respondents that shared information about their services said that they were ready and able to do business with the city.\nThe city did, for a very brief time, have funding available for businesses.\nWe saw that only 40 of the businesses that we surveyed were able to put in an application for the city, business continuity, loan of the 40.\nWhat did Mwbe's ask for what do they want from the city of New York?\nI always wanted to open my own business, never thought about a bank, I'm, just giving you a scenario of what type of people are out there that are needing help, but I went to my father and I presented him, I'm.\nFinally, I went to work at New, School University for 10 years, but there are people out there like me, never think about banks, and that this is what my concern is because if there were people like me, as far as their self, sufficient and funding their own business, but this webinar here is so informative.\nI think the irony of small entrepreneurs not utilizing banks to the to the extent they can is that they're still opening up bank accounts to maintain their funds and operating their businesses, yet are limited to the access to capital from within those same banks.\nAnother thing is that if I can not do that loan So, you have the right to ask whoever you're submitting your package to and control that you have to manage expectations unless they're going to give you a firm, offer."
        }
    }
}