{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "title": "Full Board 4/2020",
            "publishDate": "2020-05-05",
            "shortDescription": "Monthly meeting held virtually via Webex due to COVID-19."
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "9/13/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 258,
            "um": 316
        },
        "wordCountFullTranscript": {
            "people": 67,
            "question": 40,
            "office": 38,
            "time": 35,
            "community": 34,
            "lot": 34,
            "folks": 33,
            "board": 31,
            "information": 30,
            "things": 29
        },
        "wordCountSummary": {
            "people": 17,
            "health": 10,
            "community": 10,
            "city": 8,
            "information": 7,
            "office": 7,
            "state": 7,
            "folks": 7,
            "way": 6,
            "services": 6
        },
        "fullTranscript": "Yeah, so it is 7 08 p.m. It is April 30th 2020.. This is the community Bronx community board 11 full board meeting for yeah April 2020. So let me quote the agenda for everybody. I know we want to do a moment of silence. I didn't hear my name joe bayco. I think you call that yes, I called the current agenda, which is uploaded as late as 5 pm right and then chris sent it out again. Thankfully, it's like before right before the meeting harry's gonna write some speakers. Can I race who's using a computer, see the agenda I will zoom in. I hope I can zoom in zoom in here. Okay sure here we see it good. Okay, that's good all right! So is that burning? Yet? Yes, okay, right all right! So let me stop sharing. Can we have who wants to play? Timekeeper sergeant of arms cannot be here tonight. Anybody would like to volunteer to be sergeant of arms. Let me see if everybody's unmuted yeah, I can't do it before stop watching the same phone. Let's have somebody that's using a computer. Dom would be great, but he can't because he's not using computer it'd be easier. Somebody can mute or unmute themselves. I muted everybody right now so joe menta did you did you volunteer? I'm sorry, and did I hear you volunteer? Yes, jeremy I'll volunteer. I don't know how you want to do it in this forum, but I'm happy to do it. Okay, well we're gonna start with a moment of silence so and then you're gonna time keep the guest speakers. We have one gallery session speaker and unless somebody else notified us of about a gallery session speaker which we'll come back to do you have to notify us before the start of the meeting we have one gallery session speaker currently and that an elected official has left the meeting. So maybe we can do a 30 minute moment of silence, joe all right, I'd like to ask everybody if we could please have a 30-second moment of silence for our fallen first responders and those that are dealing with the with the Covid-19 19 pandemic. 30 30 seconds of silence, please: okay! Jeremy! Thank you joe. Thank you. Let me share my screen for the agenda again here: jay lieutenant velbruga. Are you able to mute yourself? Yes, we are. How are you, how are you great? How are you good any updates for us? I know you attended our public safety campaign last week. If you have any updates, we'd love to hear them or if you want to rehash a bit of okay. As of now most of the personnel from the fortnite recent have come back. We still have like, I want to say five six people out who are still experiencing symptoms from Covid-19. Most of the other people are back. I myself have finally gotten back all my ncos. I had a couple of them that were out for a while and they're all back now. So it's great, I'm just gonna go through the crime statistics, real quick for everybody for the 28 day, we're zero for zero for murders, rape, we're we're at one versus two from last year: robberies we're down really big six versus sixteen felony assaults, we're down as well twelve versus twenty three and then, unfortunately, burglaries were up big one. Third 13 versus five grand larcenies were down 15 versus 28 and again the grand larceny of order were up, unfortunately, 15 versus two. Also, in the 28 day period we had a a shooting at 2509 kruger avenue that individual was apprehended that day with the with the firearm still in his possession. So he's he's no longer out on the streets. That was a dispute over a believes to be narcotics and that's over with now. Okay, so anybody any board members have questions that and start, let's start with the computer people and then I'll mute everybody else. This is for the fortnite precinct. Anybody using the computer go ahead. Who is it debbie? Go ahead? Debbie? Yes, the robbery and join theme, the robbery at stillwell avenue. Was there only one perpetrator or two? Because I thought I heard there was two perpetrators and you caught one robbery at stillwell avenue. I don't know if this out in my head, in terms of who was caught and regarding that I'll get you the information we'll get back to you. Thank you. Anybody else using a computer, no I'm muted, for the phone people, jeremy. I have a question for the precinct. Is that yahei who's that this is this is yahay? A few days ago I called 911 approximately 2 30. In the morning there was an individual on a bicycle driving up and down the block looking to get into vehicles. I was watching it as it was happening, so I did call 9-1-1. I was up until about six in the morning. I didn't see any police respond. Is it something that they would respond to or how would that work? An individual go through your question again yeah it was. You saw an individual checking door handles yeah. I just happened to open up my camera and I see him driving going up the block looking at each card just pulling the handles, and then he went back down the block pulling handles again, I called 9-1-1. I gave a really good description. I just wasn't sure if anything came out of it or any break-ins that occurred on or around my area at the time. What location was that where you saw it was near area, matthews, avenue and bronzedale, okay matthew's in bronxdale, I don't think of anything, but that's something we definitely would respond to. Unfortunately, right now with everyone being home when you warranty and everything else, that's something we take very seriously and we would respond to that, especially because a lot of people like to leave their valuables inside the car and sometimes people, unfortunately, their cars unlocked. We definitely get there because there's a lot of times that we can want to prevent something before it turns into something more. Thank you, I'm gonna. Unless there's somebody else from the computer, I'm gonna open up to the phone people, all right yourself, everyone, everybody! Please meet himself [Applause] everybody again. I need you to be prepared to mute yourself. Unfortunately again, unless somebody has a better idea, I don't know a better way, so I'm used to phone people again. This is why the computer is one reason why the computer is better. I know you're tired of me hearing me say that, but it is a spade's display. I mean I'm you to everybody for those of you using a computer, please mute yourself or I'll just start going through and start muting everybody who's using a computer as well right all right again, I'm going to share the agenda again, try to okay, so we have, I believe we have dr salcedo. Excuse me, mr pronunciation. Saucedo from the union. Yes from the union community health center she's, the director of wellness and health promotion there and she's going to talk about health care fears, social determinants of health and behavioral health and questions are for board members. Only questions or comments that you can respond to or by board members only and at fort most. Mr menta, are you prepared to time, dr salcedo? Yes, I am I'll give dr salcedo a 30 minute, courtesy acknowledgement. Thank you very much joe. You have two minutes doctor still say, though, go ahead. Thank you for this opportunity. As I mentioned, as daring mentioned, I am dr vanessa salcedo from union community health center and usually I deal with different initiatives in the clinic and in the community. Now, with this with Covid-19, my main focus is doing Covid-19 response and outreach. So, first of all we're very devastated with what's going on with our patients and the community and we're here to talk to you about any fears that you might have any misinformation. We are proactively reaching to our vulnerable population of trying to set up appointments with them. Getting them engaged as much as we can through social media, our website and through our providers, because it is a lot going on and we know that our patients are suffering either suffering from griefs and deaths from family members and friends, and we are promoting our health behavior services to our community, and we know that our patients and our communities suffering from social determinants of health that we all know that health is just not only about you, know: health care and medicine. We know that health is about food. Health is about shelter. Health is about everything around us, so we are actively promoting. We've come up with resources that you guys have all shared with us available for the community and we're having our doctors talk about these things to our patients, because these are the things that our patients are really talking about, that they don't have participant, has joined the meeting 30 seconds doctor 30 seconds perfect. So we really want to also emphasize the importance that right now, the numbers are of transmission, for covid's are lows: our admissions are low, but we are all very on alert, especially for our vulnerable population. That you know is all the Bronx that we want to make sure that our vulnerable population is really still stays at home. Still as precaution all our essential workers to please take the same precautions to wear masks hand washing, so we're really promoting as much as we can for everyone to stay home to stay safe to protect ourselves and our community, and we really care about all of us in the community. We care about you, so anything we can do to help. Please let us know and we're here for you. Thank you very much doctor. Do any board members have questions for the doctor. Let's start with the computer people. First, obviously, that's easiest. I know sandy might have a question. Hey jeremy. I got a question. Yeah darrell yeah go ahead! All right doctor! I just have one brief question: testing sites is testing readily available for any. You know, Bronx person that can just walk into actual one, and you know- or you still you know you know minimized on some of the testing. You can do on certain individuals that are showing symptoms or whatever happened. Yes, unfortunately, testing has not been expanded as they said, there are more testing sites, as you know, opening up in the city, but the new york city department of health really has limited us in terms of testings for our patients. So that's something that we are experiencing and having difficulties, and I want to pick you back on testing. Probably everybody's, also wondering about antibody testings, which means that you know have you been exposed. Are you protected? Now that's another question that we all have as providers. I've left the meeting. It's not fda, approved the testing, yet we don't we're. We just had a meeting today to find out if the few tests, the different tests that are out there are they covered by insurance. We know that urgent cares are offering this to patients pay out of pocket. So we really want to know how good these tests are they covered before we start promoting it to our community, so we're actively trying to figure all this information out as we speak, and are you getting any word on how fast they will start opening up the test to the public in general? You know to anybody. No! I wish we had that information. We don't, but that's something that we really know. That is important for our communities to test to help mitigate the disease. So one good news that I have for today, so there's a system called Bronx rio, so Bronx rio is sort of a centralized platform that can notify physicians about their patients if they're hospitalized. But now we found out that Bronx real has a special Covid-19 alert. So if you go get testing and you're positive, they can let us know so we could follow up with you and make sure that you're doing okay, because if you're, just if you know you're positive, that doesn't mean that you're, okay, we have to make sure that you know you're a lower risk in visual that you don't have complications. So that's just one piece of the puzzle, so it's a whole effort and we're trying to put those pieces together to really help our community all right. Thank you doctor. Let me unmute sandy younger because I believe let me just make sure she has a question or not sandy. Do you have a question for the doctor? One big question is because everyone else is addressing some of the questions I had. What is the phone number where we can contact the doctor or someone on her staff to find out about testing if we can get testing etc? So our phone number is, and I will make it I could write it in the chat and I will say it 718-220-2020. So that's our phone number and I will also put our our website see and we have a lot of information on Covid-19 and a lot of the information is from the new york city department of health, but we're actively trying to make videos on behavioral health on just tips to be safe, we're trying to do those in english and in spanish. Thank you all right, debbie collick, you had a question debbie. No, I! No! I don't! No! I don't! Oh somebody, I'm sorry, jeremy, honestly, oh al had a question al doctor: are they using any of those experimental drugs like the hybrid or other drugs that are being touted as being helpful in this situation? So I also we have a strong relationship with HR has joined the meeting. We have a lot of relationships with the hospitals, saint barnabas hospitals and mount superior hospital in the Bronx and I know, are using the drugs. The patients- and I know montefiore- has several trials going on to making to figuring out if these drugs are effective. Right now, as you heard, maybe on the news yesterday revamp smear, the antiviral by gilead he's showing it's still everything still in the works, we're trying to figure out if we're trying to figure out participant has left the meeting this these drugs are working and really what's also important is that we want to tell our patients. We know that the hospital emergency numbers are low, so we want to make sure we tell our the community itself that all doctors are still here, we're doing telemedicine telephonic. We do have a rapid, urgent care or extreme emergencies that cannot be do over the phone, so these are still available services. I know everybody's really scared to, but we want to make sure that our community is not suffering from their chronic diseases and worsening their diabetes and hypertension suffering from strokes and heart attacks at home. We really want to make sure that you tell the community about not our services. This is across the board. Doctors in the Bronx and new york city have rapidly tran transformed their practices to online, as you guys have with your meetings to really serve our community. Sorry I had to mute everybody if there's somebody, if there's a boy calling us a cell phone, that has a question: can you maybe dr sausado can hang out now in the fortnite just for a little bit longer text message me: chris call us my phone number. If you don't have it is or text me 646-830-0832-646-830-0832 and I'm gonna go back to the agenda jeremy. I have one last thing I forgot to mention. Also pharmacies: a lot of our patients think they still need to go to the pharmacy to pick up their medication. Now even the pharmacies have evolved they're doing a lot of them are doing deliveries. We have partnerships with pharmacies, even non-profit pharmacies, that if you don't have insurance, we can get you your medications. So our message, our take-home messages, is please stay home to help stop the spread and also protect our medically vulnerable population. So thank you. Okay, it does council member joe, and I join us yep. I'm here, okay, accounts members. Would you like to address the board? Yes, we're going into elected official portions, so go ahead. Councilmember! Thank you, jeremy, not sure. If you all hear me well, but I first want to extend my sincerest condolences to all of those that have lost family members and loved ones during this crisis and pandemic. My prayers are, with all of those that are currently battling, this virus and fighting for their lives. I don't think any of us could have had a worse nightmare, come true from the devastation of loss of life to all of the uncertainties. Our worlds have fallen apart in less than two months time. I just want everyone to know that, although my office is physically closed, we are taking phone calls, we're taking messages, emails, we're working, I'm out there every day, helping and assisting in any which way I can for those of you that don't have my phone number, it's 718, 931, 1721 I'll, put it up on the chat as well as my email to stay in touch with you just wanted to give all of you a quick update and first, I think we should acknowledge, or I should acknowledge, the sacrifices of our first responders health care workers and all of our essential workers that are on the front line. Today, you know they're risking themselves and their families by being out there, and we owe them a gratitude. I don't know how we can say thank you, but when we get through this, we'll have to think of a special way that we can show our appreciation to each and every one of those that won the front line for us. I heard the dr salido we're talking about testing the importance of it. I've been pushing on the city council to have our essential employees tested when we think of the supermarket worker, the cashier, for example, that is out there interacting with people on a daily basis. A single cashier sees up to 40 customers an hour. I've been asking the city to prioritize these essential workers. It could be unknowingly spreading a virus to all of our customers. We have some great supermarkets out there that have taken some extraordinary precautions by putting up glass shields and supplying all of the PPE that is needed to their employees, but I think it would be a priority to have those workers tested so that we know they're safe to be serving us, and it's for the protection of those employees as well. Insurance does cover us, as the doctor said, in most cases, and for those that don't we're trying to work out how we can have them covered we're in the process of negotiating our budget. Now this is no. This is extremely different from previous budgets. We know that we're looking at a economic disaster. Our proposed budget has already been slashed by six billion dollars for new york city. We want to make sure that those adjustments are made where it'll hurt the least amount. We want to make sure that our safety nets are still in place. That education is a priority that our seniors are attended to and everyone else in between so we're discussing where those cuts will be falling in over the next month or so we're continuing our hearings resume they're open to the public. I'd, encourage you to participate and also share any thoughts that you have and actually testify when it comes to our budget hearings. Yesterday, when I shared the small business committee hearing alongside jeremy, did you just interrupt me? I did not. Can you are you on you, ken gellman? If you're not on you, please meet yourself. So yesterday I chaired the small business committee. It was a six hour hearing and I have to tell you that I was quite upset when I found out the limited dollar amount that this administration put into loans and grants to assist our small businesses. The total amount that was allocated was 49 billion dollars. The dollar amount, which 49 million dollars. I apologize for over 200 000 businesses. That is nothing for our budget. That's a rounding error when it comes to meeting the needs of our small businesses that doesn't even scratch the surface as a dollar amount. But what was more upsetting to add insult to injury is when I found out that only one percent of those loans made it to the borough of the Bronx, so we're going to be coming together as a delegation to make sure that this administration and the city recognizes the importance and the needs and the assessments that have to be made in the borough of the Bronx. We need that money and we should be treated no differently than any other pearl to find out. 66 of that very limited funding went to Manhattan and only one percent made its way to the Bronx is disgusting, unexcusable and unforgivable, and I know that some of you that are on this chat group with us are small business owners. You should be as upset and irate as I am. If you work for a small business, you should be as irate and upset as I am and make sure that you make your voices heard. I know I will and I'll continue to push for the borough to get what it's entitled to and what it deserves. I don't know if anybody has any questions for me. I know that you have a long agenda, so many people line up to speak. I know that pharah's for my office is on as well, and she has I'm sure some updates to share with you we're doing food giveaways, we're doing limited giveaways of PPE and hand sanitizer the why the need is so wide and so great, but I'm out there and the only thing that I can share with each and every one of you is I'm available. Most of you have my cell phone number, but those of you that don't you'll easy easily get it from jeremy, but my office is fully operational remotely but fully operational. Thank you, jeremy. I want to thank the community board for what you're doing and for the trying times that we all have together we're gonna get out of we're in this together and we're gonna get out of it together. So I'm not sure if anybody has any questions for me. Aidan shkreli had a question hi mark, so I heard that there's some a bill proposed to basically halt all evictions until April of 2021, so until next year. I think that you know anyone who's renting and anyone who is a property owner. Everyone is facing difficulties right, so you can't look at just at the tenants you're. You know like also the landlords are facing problems. Is there a way to get like the things to like reduce the mortgage payments because, obviously, like the landlords still have to pay their mortgages, and even if you don't have to pay right away, pushing it off until later, it doesn't mean that they still have to pay back. You know, edit, you bring up a great point and you know typically when we think of the landlord center relationship, and we want to make sure that our tenants are not forced out into the street, not evicted for non-payment rent due to these unique circumstances that will be on their control, that we should have safety nets in place for them. But remember the bill that we heard yesterday that came out of my committee is also talking about two family homes and three family homes and four family homes. Some very small property owners that rely on those rents to pay their mortgages and somebody's rent is somebody else's mortgage. If this was targeted, it's a very large landlords. I would be more willing to understand and work with it, but when the banks everybody's in a moratorium, what you should all be aware is: nobody can be brought to housing court right now and be evicted for the next 90 days in the states stepped in the city. Now there was a proposal made that until April of 2021 you could not be evicted, not that a landlord can't take an action against you, but the marshal would not evict a tank. Now there there's a wide implications that can come about from that. If everybody just stopped paying rent, it could be a disaster for the housing market all together, because it would be a total collapse, but not excluding at least small properties, in particular two three and four family homes, and that bill also covered commercial tenants as well. So we're in the middle of yesterday was the hearing we're evaluating all the testimonies that were made and the upcoming days and weeks we'll be working on a bill to address that. But we want to make sure that our tenants during this crisis are not evicted. I don't want anyone to walk away thinking that if they don't pay their rent, no fault of others, they can't afford to that they'll be homeless. We'll make sure that doesn't happen to you now you had a question mark. This is a statement not a question one of the elected officials, state, federal and city representative bryant's gonna get together and stop this jumping on the Bronx. You know everybody talks about what they're doing is wrong, and yet I don't see a consolidated effort by our elected officials to stop this coronavirus says: hit the Bronx harder than any other borough per capita. We have the lowest education we have should be done. I think someone should call me of all connected officials just figure out what to do now. Thank you. I think we all feel the same way I was born in this Bronx. I was born in this great borough. I live here my family. I was born and raised here. It seems that in good times the Bronx is neglected and then bad times we're neglected. The delegation on the city council for the brother Bronx is coming together to push back, and I know that we're working with our elected officials up in albany also to make sure that we get what we're entitled to we're, not asking for anything more than a fair share. Now I promise you that we're going to continue to be loud, we're going to work collectively, you have to do it as a social group. You can't do it individually, you're working with the city natalia's working with the state, the idea's working with the state acacia is working for the federal I need you to get together in a room, come up with a plan on what you're gonna do, how you're gonna attack this situation and get it done. I've been hearing this I've lived in this for over 76 years, and I've heard it every year since I was able to listen, it's still going on keep dumping on the Bronx and nothing changes. Guys say the same things over and over again we're going to do this and nothing changed. Everything stays the same. Two weeks ago we did. We had a delegation meeting with our electeds in washington as a city council, and we broke up our agenda based on your needs and the assessments of the borough we're coming together and it's you're right, city, state and federal must work together. No one branch of government can get us through this. It's impossible and we're going to be relying heavily on the federal government because they're the ones who have the bigger checkbook to help get us through this mess, but that doesn't mean that the city council, alongside of albany, shouldn't, be focusing on prioritizing on our needs. Yes, hi good evening. My question goes back to, of course, two and three family homes and landlords again. Is there any relief or postponement with the quarterly taxes that are upon us? So I was just because badass is mostly made up in two and three family homes, so I was just wondering if there was any relief on that front berna that I put together a change.org petition asking for the suspension of real estate taxes, water and sewer charges that are coming up also in July their quarterly as well and for our small businesses, sales, tax and income tax. You know to help give everyone the opportunity to kind of figure out this new world that we're going to be in to assess what we can do and that would have given us the cash flexibility thus far. There is no movement on any of that. I'm not saying that the fight is over the city and the state are claiming that they need those funds to make sure that every all of the other safety nets are in place from police to sanitation, to hospitals and healthcare workers. We get it, but there must be some type of delaying payment, certainly waiving of all penalties. I want you all to know that if you don't pay your real estate taxes, it's 18 interest, compounded, if you don't pay your water and sewer it's 18 interest, compounded, that money adds up quickly, you'll be out of your home and technically it's a default of your mortgage. So we're trying to figure all this out now at the city council, working with our colleagues in albany on how to come up with a creative way to make sure that especially our small property owners. Yes yeah, I just want to interrupt just a quick interruption and there's so many resources for tenants and, as we know, for small property owners like I have attended also and just one tenant. Some people have one or two and there's no relief for landlords and there's no representation. So I think the Bronx needs to balance that out, because it's just not all about tenants and there are some good landlords in air just like myself and other ones. So I think that's another thing representation. Why is that needs to balance out in the Bronx? Thank you, bernie that point well taken. Darrell had a question darrell good evening councilman. I just want to ask one question that was in regards to: I noticed, there's a lot of extreme price gouging and then two this may sound funny, but lack of light. So I can't find a can of light so for anything by the way it does. It's not funny I've I received so many phone calls, especially for moms with large families and have young children that can't find lysol. I was able to help them through some of the large wholesalers that sell commercial products so dorell. If you contact me and I'll put up my information for you to get it both my email and my phone number, I will do my best to help you with locating some lysol, and this goes for all of you as well, and the price goes up. Yeah you'll bring that to my attention. We have a division dedicated to that specifically to go after. Like so don't mean to cut you, but like a gas station was charging dollars for a non-name brand lysol. Can that was insane. You get that in touch with me and we'll make sure that we get the appropriate agency. The enforcement is there it's real and those are hefty fines that come with it and it's per violation, so maybe pharah. While I'm talking, you can post our information up there, including the office number and our email address perfect. You put it in the chat. Thank you. Thank you. Councilman. Thank you. I just sent her up real quick yeah go ahead. Alti yeah the gentleman who had they saw the extreme price gouging. Could you just reach out to myself for detective sturdivant because I'd like to know where that is because, if that's in the confines of the 49 myself and my ncos will go over there and have a conversation with them? Definitely it's not just one place, there's so many places like it will take a day. If I outline all the places I've seen do it, you know you know what is if you guys come across something please let us know, because I definitely want to take a look at that, because it's not right for everybody and we will definitely look into this. Okay. Thank you. Just here we're aware lt I got two locations. I will email you at some point. I really appreciate that and thank you for interrupting. I just want to tell I want to share a story with you about the men and women in blue out four nine priests that were so fortunate. Today I was doing a food giveaway at pelham housing in the NYCHA off of williamsburg and waring, and someone had made a complaint that there were people not adhering to the social distancing. I can tell you that they came out there and they stood there till the lines ceased and god bless you I mean you guys are awesome. We were out there no more than an hour before you guys came up and wanted to make sure that we were complying. So thank you for that. What you're doing and putting yourselves in harm's way we're grateful to you. I thought I would share that with you all. Thank you. Thank you. I'm joy good evening councilman thank you for taking the time to be on here with us. Well, first and foremost again, I just want to thank you for what you're doing. I do see you out there on the streets, and I appreciate everything that you're doing for us. I'm just let everybody on the call know, I'm praying for you guys your families to everyone to stay safe. Just with that being said, and as you know, I don't have to you know just re, you know regurgitate the issues, but we know everybody's in a different situation and you know there's some people out there that are having a very difficult time coping and you spoke a little bit a while ago about you know. You know people's bills and things of that nature. You know, wasn't that long ago, that you know our country, bailed out the banks, bailed out the auto industry. You know all these bailouts were going on and you know we footed the bill right. Taxpayer footed the bill, and I need to know this and agree with this, but I just would like to get you know your final point. I honestly feel that you know utilities and all you know everything that we have out there, even the banks they have to give people breaks. Today I mean we're literally locked in our homes and if we go out we're not allowed to be out, we can't go to our jobs, can't provide for our families. I mean it's locked down, you know it's like being in a social estate, it's very scary, you know, and if people are starting to think that you know that way. You know people do things under. You know when they're under pressure, and sometimes they do things that they wouldn't do. So how can we you know the longer? This goes on the more I just see. You know more difficult for people you financially and then also you know for the police for crying. He said birds are up, so you know, I don't see it getting better unless this stuff gets better job. I don't think anyone has an answer that could that would be honest at this moment. We're trying to these are some challenges that we never fathom and this crisis. Actually you pay with your life. So there is a responsibility to everyone to make sure that we do whatever we can to stop the spread, and that was the original intent to slow it down. So we don't overwhelm the health care systems. We see the devastation out there. I don't think there's anybody here that doesn't know someone that has passed or know of someone. That's recently passed, that's our first priority! Now it's you know trying to rebuild some life of normal that you normal whatever it may be, the sooner we get there the better off. We are. There's talk now. Finally, of opening up slowly by industry by area I get a bit upset. You know when we say we're gonna, close down parks, you know open, you know we're gonna, close down roadways and make them walkable paths like why just not open up a park you enforce it so there's quite a bit going on the city council now is also looking at opening up some of the larger parks understating that social distancing and making sure that we do testing and to make certain that if we see the numbers increase on the spread that we automatically start phasing and shutting down again, so it's going to be it's new. There's! No history, there's nothing here that we can point to show us the paths that we, so it's going to be test and go. You know measure twice cut once very conservatively. We don't want to see this thing explode and come back again. We want to I'm hopeful that come September. Our schools are open. No one can answer that question we're hopeful that they will be, but could you imagine that in September, if our schools are closed for what period of time and what that means to all about families out there and the quality of education that our children are getting, I mean we've got real issues here. 100 right and absolutely health and safety are first and foremost, but the next thing right, obviously, is our income and how we keep the economy going and how we keep our families and how we keep our kids even in school right. So what keeps coming knocking on our door, the bills they're, not stopping con ed's, not stop. I don't think it's fair. I think it. You know, then, give people free electricity for three months give people free water for three months like why hit people when they're down the city should you know, should really step in and help people during these times, and here's there's a couple of way through our utilities and our necessities that they could help us. I shared with you that our budget is going is looking at a six billion dollar deficit. That's a tremendous number, but by no means are we broke. It's still going to be an 80 plus billion dollar budget. It's tremendous cuts are going to be made and we have to be more mindful of how we spend money and I've been pushing us in good times that we needed reserves and we shouldn't be spending money like we're drunk and sailors. We should be accountable to the taxpayers for their money, we're stewards of taxpayer dollars and every dollar should be spent. Just like you spend your money, you make sure that you can afford it and every dollar you make. You stretch it as far as you can so. Thank you. I appreciate it. Thank you. Thank you. For the time, thank you, somebody had a question chris. I think you somebody had a question something we have to move along. Oh yeah, we had. I had one more question. Chris had something from somebody I forget who chris mark hi good evening councilman. The question is this: basically, you answer it, but I just wanted to know already. They were allocated 49 billion dollars for the state, how much the Bronx gonna get out of that first and second, the city was always in surplus, and you just mentioned these 80 billion in surplus. Why should we get cuts and I'm going to emphasize the part, like mr mantos say why can't addison? That is turning to be a conglom conglomerate? They don't give any cuts to the people, including even dp. I mean you look at the price of the dp. You look the price of connect, it's ridiculous. Meanwhile, everybody's looking for everybody, something I agree with you. We've been squeezing our homeowners, whether it be through real estate, taxes, water and sewer, or through utilities. We've been squeezing our renters through utility charges and we've been spending that money, and maybe this is an eye opener, an opportunity for local and state and federal government to hit a reset button and re-evaluate what we've been doing. We've been overspending, we haven't been putting that money or spending as wisely as we should, and we go back to the basics. It's going to require city, state and federal to come together to assess the needs and make sure that we don't cut services that are important, but also make sure that we spend every dollar as if it was our own money and that's how we should be looking at this budget. So with 80, it's going to be in the high 80s you're, looking at possibly an 86-89 billion dollar budget. That's a lot of money and we that's almost 10 000 for every man, woman and child that lives in new york city, big budget. But yet it never seems to be enough. Unless there's anything else, we should move on. I'm here praying for everyone and fighting for you. So please don't hesitate to reach out to me on any issue that you may have. I see that pharaoh listed my office number and my email address for you as well as her own. We've got a lot of work to do. I see my colleague is on with natalia fernandez the assembly, women we're going to be working together to make sure that we do the most we can, and this is our priority so whether it be protecting you or being a voice for you, it will also include bringing home the bacon and I'm relying on natalya to work with me to make sure that this district gets all of the funding that it deserves. God bless you and thank you so much stay healthy and safe, and please don't leave the house without protective personal equipment. It's for your benefit and for those that you interact with. If you have to leave just be mindful, you can risk but endanger yourself, but don't endanger others. Thank you. The fortnite precinct is leaving. Thank you jay. Thank you lieutenant and then, as senator rivera still here. Yes, I am. I just turned off my just dropped my mic and camera, but I'm turning it on now. There you go good evening, everyone good evening, all right, so I'm just going to run through a couple of things I'll be open. Any questions you might want to ask. Well, just like councilmember said you were all in my thoughts, I'm looking forward to the moment when we will be able to be in the same with each other. Please stay safe and please stay healthy and my condolences for anyone that you know for anyone that has lost someone. If and folks are sick at home. I hope they get better very soon. So a couple of quick things on the state budget. There was a budget that we voted on a couple of weeks ago. It seems like it was 27 years ago, but it was only a couple of weeks ago. It was a budget that I was very disappointed in. It was the toughest budget that we've had so far and there was a budget that I vote no on in a couple of a couple of bills, in particular around the notion that in this moment, when we are all being asked to sacrifice- and you have all talked about in the last 15 20 minutes when we are all being asked to sacrifice- there are some folks who are not being asked to sacrifice, and I find that not only distasteful but unfair and unjust, but just not rational. At this moment and the budget that the governor insisted we passed did not have a single added tax for billionaires or millionaires and, lastly, check they're, not the ones that are getting laid off. They're, not the ones that are losing their small businesses, they're, not the ones that are losing their homes and they were let go without anything. So no new taxes on billionaires or millionaires, but the governor did cut medicaid during that budget, and I could not in good conscience vote for that. And so I voted no on it. We can have a longer conversation about it if you'd like, but I you know, but it's it was something that I couldn't vote for on issues of just generally speaking on cover 19. We, as the council member, said, our officers think we are still open. We are, I know, caitlyn is on the call, and caitlyn is not only on the call right now, but she is on call, as is the rest of my staff. We still work every day on issues of providing access to food. If there are issues with landlords, if there are issues with unemployment, we try to be as helpful as we can so please get in contact with us. I know that we had a conversation, a long conversation about small businesses and unemployment on employment, I'd like to say that there is a webinar that we are doing on may 5th on may 5th, from 5 to 6, 30 there'll be a webinar that you can watch on. Facebook live or you can be part of it on zoom. You can get all the information from caitlyn, but this is going to be so that we can we're going to have different folks talk about some of the issues that are facing, people that are employed right now and some of the solutions that are being proposed, as well as some assistance, and hopefully the state will get its act together. We all know we have all heard about the fact that there just was no way that they could handle as much new influx as they've got of people that are unemployed, so we're working with the state to kind of get them to do it more quickly, but we're gonna have that on may 5th, which weirdly enough is next week just this time, I'm not sure how for the rest of you, it flows, but for me time just flows. Weirdly I'll, remind everyone as well that, since you are stuck at home, make sure that you fill out your census. If you have not yet that is incredibly important. We have, it is how we get federal funding. It is how we make sure that everyone gets counted. So please fill out your census. You can do it online. It took me 10 minutes a few weeks ago. You can do the same thing. You should know that on issues around the state, some of the work that I've been doing has been to work on what some of the some of the state guidance that has been issued related to health care facilities. There's one in particular that we just got a win on just a couple of days ago, and that is, there was a whole issue about reimbursements on mental health services to community health, centers and reimbursements that they were not getting from the state they required. The state did not change some guidance until very recently. It required patients to actually come into the community health center to get telehealth services for mental health services, and it was kind of like you're putting people at risk. We want to make sure that we provide the service, so we have to get that fixed and we got it fixed and we are also working to expand testing capability. We talked about that as well. In this call, there is a for the moment there. Most of these sites are driving only and we want to make sure that we can provide some for folks who do not have access to a car and so are working to expand testing capacity. But it is true that without the federal government's capabilities, we're kind of in a we're kind of in a bind if they do not use their power to expand testing capacity in a very big way. We're not only going to be you know, kind of in the dark about who actually has it and who does not. But I gotta be honest with you, and this is from talking to many people that know far more about this than I do. If we do not have broad-based testing any reopening that we do whatever we call, it is not really going to prove possible if we can't do contact tracing, which means testing individuals testing very widely, not just people who have symptoms, not just people who are potentially hospitalized, but everyone hopefully, and then figure out who they have been in contact with, which is what places like taiwan and south korea did. If we don't do that, reopening is not going to prove possible because, what's going to happen, is that likely there will be a period of a lull and then we'll have another spike in cases. So we got to make sure that we do it right and so on testing we want to expand testing capacity and in places like the Bronx, we definitely to make sure that we do that before we before we come back. Can we ask questions now? I guess I guess I'm done. I guess you can ask questions now. I'm sorry, I'm sorry! I just mr jonah, you know likes to talk and yeah I was I was. I only had one more point, but go ahead, no go ahead. No god actually go ahead. Man go ahead, any updates on bail reform. This is a question from a board member yeah. Well, there was there was some bill reform that was passed. There was some bail reform that was passed in the in the budget. It is one of the things that- and we had this conversation in person before I know that there's many members in the there's many folks in the in the community board that disagree with me on this, and I you know I will respectfully continue the stance that I had when I spoke in front of you. I believe that bail was a way to criminalize poverty and that we needed to change it, because if you were wealthy, you could get you could, regardless of what you were arrested for, you could go out. So there were obviously a lot of folks who disagreed with that, and there was some reform to the reform that was proposed and was pushed forward in the budget. What I can tell you is that there that was approved, I did not vote for it, but it was approved in the budget, so there have been some changes that have occurred, although it is not, I mean. The concern that I have right now is that, if there's a place that actually has the highest rates of infection actually are happening in jails and prisons across the state and across the country, but certainly in the state, and particularly for places that are people who are in pre-trial detention, which means people who have been arrested but have not been convicted of anything which are the folks that are most the overwhelming majority of people that are Rikers. For example, they are they're sitting in petri dishes, they will have they're more likely to be infected, and I have a problem with that. So I can tell you, as far as just as a as a quick response, that there were some reforms to the reform that were done in the budget and they are in effect, but they're. You know but they're not, but I'm not necessarily. I was not necessarily in agreement with them when they passed, I'm not necessarily in agreement with them. Now. Okay and then we had a question from aideed shkreli. She wants me to read it out. Existing tests are not accurate. I'm assuming that antibody tests will be inaccurate as well. Therefore, how safe can we really feel when the tests do become widely available? Well, there's always there's always new tests that are being developed, and the fact is that there are a lot of tests that have been developed in other parts of the world that we could actually borrow from that I mean they need to be inexpensive and they need to actually produce quick results and there's a lot of places where that has been achieved already. As I spoke about south korea and taiwan in particular, I think those are the best examples. South korea, for example, is a is a country of about 50 million people. They had the same on the same date as the first case in the u.s. The first case in the u.s was reported on exactly the same day as the first case in south korea. South korea has less than 300 deaths less than three zero, and we are, I mean I don't. I haven't seen the numbers today, but I know that we were just in new york. We were like maybe what a 20 000 already. I mean it's something ridiculous, so the tests that there are tests that have been developed in other parts of the world that we should be able to borrow yeah, I'm just looking at new york right now and new york had almost 24 000 days, almost 24 000.. So there are places there are tests that we can borrow and you are correct. We need to have accurate tests and tests that produce results quickly, but we also need to be to think broader than that, because this is what happened, for example, in south korea and taiwan and I'll be quick about this. They established when they realized how serious it was going to be. They got private companies to develop tests rapidly. This happened back in february, then they established fever clinics, which was places that you could go in and if you had a fever, you were tested immediately. You had a fever, you were tested immediately. If you were found to be positive, you were told, tell your family to bring some clothes because you're going to spend your day the next two weeks here away from your family. Now they all did that all the way back in february and right now, they're slowly but surely they've been reopening and they haven't seen any explosions in cases. That's the type of aggressive action that we have to take. We can't mess around with this stuff. So yes, if we have the right type of test, but there are already available in other places in the world, we should borrow some from them and mass produce them here in the states. Okay, so just a reminder that if the principal elected is in the meeting like the center here council member joe and I and I believe, there's family member fernandez is here we're not going to hear from the reps. We do not have time to hear from the wraps. Unfortunately, so darrell had a question for senator rivera. I believe yeah. It was just. It was just in regards to the state, probably at some point, maybe looking into mandating tests for major corporations. I noticed very sensitive, you know, but I don't know something I think we should look into. If someone sets it positively trying to come back to work, maybe you should be mandated to take a test before you go back well part of that. We need to be smart about that because we need to. We need to we're. Actually we actually talking about that today and my staff, because we're looking at paid sick leave and the ways that we can actually change. It excuse me to address that type of situation, because if you are positive you, but you are if you're positive, but you're asymptomatic. You feel good enough to go to work and you think you have to go back to work, because if not you're going to be able you're not going to be able to provide for your family, then what kind of situation does that put you in so expanding paid sick leave to certain situations in which you might be asymptomatic but and can and feel that you can work but are still able to be. You know to get it to other people. We want to make sure that we, yes, that we, like. I said when you when you take someone and you quarantine them. Even away from their family for 14 days, they're able to keep spreading in family units was the way that it spread. The quick china actually spread quickly through not through big social events like concerts or anything like that, but in family units. That's the that's my the question, I'm saying is because it's from major corporations, I work for a major corporation and I feel sometimes they don't want to even make this type of decision, for whatever reason be, profit gonna be whatever, but you know in a situation like that, you know it's best, that your employees are healthy before they even come back to work. You know I've seen so many situations where you know people's you know are asymptomatic or whatever have you and they come back to work too soon. Past the 14 days. First and foremost, some people don't get over it in two weeks. Some people get over it up to eight to ten weeks. In most cases, so you know not true accurate, but we want to make sure that if people are that they can give it to somebody else, we want to make sure that they're kept in a place where they don't give it to other folks, and I know that dr salzero is there so eight to ten weeks. I do not believe that that's accurate. Is that correct if you are really sick- and I see you that can be the case, but in general we're trying to look at the data. It looks two weeks you know. What's really going to be great is when we do have a great antibody test and we'll be able to see why there's two antibodies, igg igm ig m, is that you no longer have an active infection. Igg means you have antibodies that mean hopefully you're protective. So once we start getting these tests that senator rivera is talking about, we will be able to make these decisions and will help, but we don't have that yet. So this is all really hard for us, we're all working through this, but hopefully we'll figure out all this testing and antibody testing soon brian. You had a question for the center another one or I'm sorry, one good evening, senator rivera. The question is with regards to seniors: is there any remote? You know, tablets with internet for some of the seniors that might need it? Is that being considered at all, because a lot of them are disconnected some don't have internet the libraries aren't open. So I was just wondering if that's being considered at all for the seniors it. To be honest, not something that I have necessarily considered you're saying for the purposes of connecting them to just for those folks who don't have the ability to connect to the outside world, so they can connect, but for resource I mean you know, there's so much information out there right now with resources- and you know some of them might not might need it. I was just wondering if that was be. You know some, don't you know, don't have smartphones, you know, so those are the ones that really might need it. They might not have cable at home or whatever. I was just wondering if there's might be some sort of resource for that. Not that I know of I think that, but it's, but you know what I do know that the senior centers in my district have tried to really keep in contact with the folks who they serve on a regular basis to make sure that they can provide food if necessary that they can provide some other services, so I'll, actually I'll actually check in with them. Because I'll be honest with you, I hadn't thought about it. I had thought about, for example, the tablets that we're getting to the children in schools right to make sure that, particularly for those folks who do not have computers at home, so there's a way for them to do long, distance learning, but I had not necessarily considered it for seniors. That's a good idea, I'll, actually I'll, actually touch base with the senior centers to see how they've gone about doing this, and you know sometimes there's ways that we can get. Maybe private companies to donate certain things so they can get to so they can get to seniors. I had I hadn't thought about that. I will. I will look into it. I will also check in with the senior center that we have here in van ness and basically see how they're doing and trying to get some sort of recap and some feedback for them. Also thanks a lot. Thank you melanie. You had a question, yes hi. This is for the senator yes hi. How are you so? I just I just have two points and I know we still have dr salcedo with us on the line. The first thing I wanted to just bring up because we were talking about antibody testing- is that I work for two of the major healthcare corporations here in in new york, so we started to do antibody testing in a couple of sites across the city. I don't know how familiar you are with that and that's being run by the new york state department of health, the lab wadsworth center. So I took the test myself yesterday and you have to be basically an employee of h, plus h, which I am, and you have to be invited also to take the test, because it's part of research. So it's not. I know a lot of people are concerned that they want this test to be available, and I just want to put it out there that we're working on it. A lot of researches is being conducted, and just like you mentioned before, we are actively taking information, of course from other countries overseas, but because we don't know the the immunity of the people that may have already contracted Covid-19 and if you can get reinfected or not. This is something that we are just still conducting as part of research before we have it open and available to the public and then the second thing I wanted to also ask you if you knew a little bit more about this, like fmla that's happening, so there are people and who are essential. Workers who may have contracted Covid-19 have positive are allowed to go home but are being asked to return to work, even if they are asymptomatic and may still have Covid-19, because they are needed because they are essential. Now these are doctors, nurses, police officers and we're at a time where we are getting help from the army. You know I work in. I go to the hospital every single day I work long shifts long hours and where we have nurses that will come in and they'll run out and they'll say I am in the emergency room. This is not an emergency room. This is a war zone, I'm leaving. So we have this high turnaround time because we may have people who are essential healthcare workers who are working with Covid-19 to treat the patients and we need to be able to allow people to be home if they have Covid-19 not continue to spread it while trying to save lives of other people that also have code. But it's just like a like a revolving door of Covid-19 that I find very concerning because I'm in the heat of it all every day right, but I agree with you what's your, but what is the? What is the question? So do you have any information or any updates as to giving people a longer leave to be able to be home if you actually have covert instead of asking people? Well, you may have Covid-19, but you don't have symptoms come to work. We need you not just people that need to, of course, make money and take care of their families, but also people that are essential, they're front line workers still being asked to come in. Well. Can I add something I have a friend of mine, who's, actually a nurse and she had Covid-19 and actually came into close contact with her, but anyway, the hospital where she works at I'm. Not naming names basically had her go back to the hospital within a week of her testing positive and she tested positive a day after she started showing symptoms. So I totally agree anything you know I you know. I think that there's a shortage of healthcare workers and so and you guys, are overworked, but I think that you know it's kind of spreading it too. I I'm sure she probably I was still spreading it to others. So I would tell you that what I would like what I would like to do is that you know caitlyn who's on that was on the call like get us some of the information on some, because this is it's likely. I know that this was happening, I'm unsure, if it is still happening and if it is still happening. I would like to actually have a conversation offline about it for with you, because one of the things that I'm trying to do- and this is something that I offer to everyone- particularly those folks who are familiar- who are working in the healthcare field or nursing homes, home health, aides, etc. When they're, one of the things that I have been focused on in my capacity as the chair of the health committee, working along with my colleague in this in the assembly who's chair of the health committee, when there's protect, when there's certain guidance that happens from the state that is not being followed or needs to be changed, so it needs to be changed to more accurately. You know help the situation along. We want to understand what it is. That's currently happening, who are the folks that are following the rules who are not? Who is not following the rules? Who is following the rules, but the rules are wrong and need to be changed. Those are the things that, if you have something like that, so we should please be in contact through caitlyn with my office, so that you can tell us exactly about the situation. Give us as much detail as possible because we always have. I have a constant conversation with the department of health, both in the city of new york, as well as the state and when there are certain things that we can change regarding guidance, so that we can make sure that we can fix things that maybe decisions were made under duress in certain moments where they were over capacity. I want to make sure to fix it, because you are correct. I don't disagree with anything that you said and if we can try to fix it, we will okay. Thank you very much. So hazel had a question. I'm gonna unmute her go ahead, hazel hi good evening good evening. My question is you know that there's a lot of people that are out of work right now and we do have a moratorium on eviction cases, but my clients are really concerned because they don't know what's going to happen once the moratorium is lifted and everything kind of gets back to flowing yeah. How? Where are they supposed to go to get assistance for arrears? Now we have been telling them to pay their rent or pay whatever portion of the rent they can, because you know it's very difficult for them. You know with food and other bills, but is there something in place for them or assistance for them to go to to catch up to these arrears? This is this is a serious concern and one that I know that I deal with. I have 60 about 67 000 units of rent, stabilized apartments in my district and most of them are or poor working class. Folks that you know could that could barely make ends meet before the crisis. So this is one of the reasons why I believe that we need to go back to legislating as soon as possible because we need to be thoughtful. I heard about some of the conversation that happened before related to small landlords like bernadette, right, small landlords that might be in their home or might just own like one building or two. We need to be thoughtful about how we balance this out, but I believe that we need to cancel rent and I believe that we need to be smart about how we do it. So we do not put undue pressure on landlords that are good landlords either. But the reality is that if you have somebody today who can't pay their rent because they haven't been working for the last month or at this point two months and they're- and we did put a 90 19 day moratorium in place. But there's actually one of my colleagues in Manhattan who got a call from a landlord in his district and the landlord asked his office. This is a real call and he said like hey. I just want to make sure what the things that we should be setting up for, but as soon as the 90 days are over, I can completely evict somebody because they haven't paid the rent for three months like these are conversations already. So I want to make sure that we get back to legislating so that we can have a thoughtful conversation with the governor and with the assembly about how to do something about canceling, rent and doing it in a way that helps tenants who currently do not have the ability and no or will they have the ability in three months to pay for their for their three months, because if they can't pay today, they're not gonna be able to pay three months in a month and a half, because that's ultimately with the 90 days, is going to be up in about 45 days. So the so you are correct. It is something that is deeply concerning to me, because I have so many tenants in my district there's so many tenants across the entire state that are worried about. So I am, I am on it. I'm working on my colleagues and hopefully we'll be able to go back to albany soon, even if virtually so that we can pass legislation to address it. That's you know, that's really great, I'm so happy that you guys are on top of it, but we also have you also have to do something: that's not going to hurt the smaller landlords, because you know landlords are still paying property taxes and they're still paying for water and electricity and other things. So if you completely cut off the rent, you're cutting off their money supply, I agree, which is why, as I said earlier, and an attempt and council member joe- and I like hit the mark on this- we have to do this in a way so that we the burden. I cannot ask a landlord who has the burden of paying for these taxes that you mentioned. I can't say to them now: you're going to have to pay it, even though you're going to get no income or no revenue from your tenants like we have to be balanced out so, but because they're not getting revenue, because the tenants have no revenue. I can't ask them particularly small business owners, because you know landlords are small business owners right. I can't ask a small business owner pay for this, even though I know you got no revenue, I don't care like we have to be thoughtful about it, so I agree with you, but if we do, but if we don't, if we don't act aggressively the impact that that's going to have on the entire on the entire endeavor, I mean we're having issues with homelessness right now imagine in six months, if we do not, if we do not proactively deal with the fact that people are not going to be able to pay their rent because they haven't had income for two months, how are we going to be? What kind of impact is that going to have on the homeless homelessness crisis? Six months from now, we can't ignore that right, correct! Oh, thank you so much. I really appreciate your answer and everything that you're doing for us. Thank you. Thank you man. So senator any final points. I know I interrupted you before you had a final one. Just this is the fine. This is the final one just so you know there are no more questions. My chairman said no more questions, so I'm going to speak for the next 20 minutes. No, I'm messing with you with joe okay. So this is the very quick point that I'll make at the end. I you know I I'm not originally from new york. Most of you folks know I'm originally from puerto rico. I was born and raised down there. I came to new york in 98, moved up to the Bronx in 2000, but the reason I fell in love with the Bronx is because of the resiliency of the people here, particularly folks that have lived here for their entire lives as where's his brother. But, as you were saying, as I was saying being said earlier, there is there's something I fell in love with in this borough and that's the resiliency of the folks here. So this is a very tough moment, but I believe we can get through it together, and I would argue that what we have to pay attention to is that we cannot possibly go back to normal quote-unquote normal what we had before there's so many ways in which has been demonstrated. There's so many parts of our of the way the system worked, which is just unjust and unfair. We have to address those issues we have to and we can't ignore them. We can't go back to the old normal. We have to have a new normal and I would argue, one of the things that we need to do is pass the new york health act, which is to create a single-payer system in the state of new york to guarantee universal access to care to every single person who's in new york. We could have a longer conversation about that, but the last point I wanted to make was that we'll get through this together because we're resilient bastards, the Bronx is a brazilian group of folk, but let's make sure that as we get through it, we at the other end do not go back to the way things were because then this is gonna happen again. We can't allow that, thank you for being with us. Thank you for allowing me to be with you I'll remain for a little bit longer, but I know caitlin is going to be here for the rest of the way. Thank you senator assembly, member fernandez. Are you still there? Sorry I took so long, that's, okay! I enjoy watching you and listening. So it's okay good evening, everyone, I hope we're doing well. I missed you all and it's been. It feels like three months since the last virtual call that we had so time is moving slow but really fast, it's weird, but me and my office. We are still functioning we're still. You know here around available able to be contacted. The office phone line is connected to staff. So I encourage anyone. Please share it. Any concern ask request whatever that we're getting we're really trying to address it immediately and right away, and I could say it's been busier, like the phones and emails and everything are buzzing, but that makes me happy because at least the community knows that you know help can be sought here and mainly we're seeing issues of food insecurity and unemployment. That's really the top two. So I have been trying to get as many resources I have been to the area I did partner up with alex nelai and albanian and american albanian american open hands association to get food when we get it from a donor in hunts point so efforts, but obviously still more is needed. I am getting a shipment of hand sanitizers so about a hundred gallon bottles that I'm going to try to map out to give out to right now essential businesses, whatever is open senior centers, to make sure that they have at least some sign of sanitation in their entrance, but also I want to be able to share it with community association. So if you know or can utilize the bottle of sanitate sanitizer, please let me know hopefully I'll get that in the next week or two much like to what the senator said, we are trying to fight on the state to try to save us. You know we signed a letter, the assembly with carl to our congressional federal representatives, urging that they push for monetary assistance, federal assistance, because we really do need that. I do agree with the governor that there should have been a revenue taxed on our ultra wealthy, at least for this time, and maybe like the next year too or something, but I really think all efforts need to be made, including that tax and what we can get from our federal representatives. I applaud as councilman jonah on his put for his push for trying to save our small businesses. That really is a big problem right now and in a lot of them not being able to apply or be eligible for the grants that have come out with the stimulus packages. So you know it's just something we should all be village into a village. What's the word pay attention to it because we all can help our small businesses. If you can support you know, please order online or delivery or something- and I guess last update 2500 williams, bridge road still in communication. There is a part of I guess I mean investigation as well, so a.g investigators did do a. I guess, a contact with the buyers and seller and did get a narrative of how that transaction went down. I'm preparing a statement with them, so we can, like you, know, properly, share what it was, but at the moment they say that they found no fraudulent action. There is a factor that councilman joe and I brought up when we had a conversation about a transfer tax. So now I'm in communication with the state department of finance to see if they can find any trace of that- and you know we'll have a final say, but right now it is still pending right to good news. In my communication with the attorney general's office, I requested to do a teletown hall with her, so we're going to get that in the works, and hopefully you know with enough participants. We can get many of our concerns addressed, but with her and by her regarding price gouging as well and anything else, the attorney general can be helpful on. So once that information is secured and made available, I will absolutely share and I hope everyone can tune in. I plan also a few town halls coming up: one with the department of education and really just trying to get the dates down, because as much as I'm invited on these little zooms trying to set up my own sometimes could be time consuming, but thankful to say that you know me and the staff are doing well we're happy to hear from everyone. So please keep in touch. Let us know, oh and regarding the canceling rent to hazel's question and point, I did introduce a bill to address that specific problem about hurting the small landlords that rely on the rent to pay these utility bills. So I have a bill. That's introduced and the language is being worked out a little bit and I hope that we can, you know, consider it if and when we start session again remotely or not, but that bill would also call for a freeze on utility utilities like water and sewer and gas, and all that, in addition to those, I can't pay rent so just trying to tweak out some language to make sure it's. You know directly helpful to those that need the assistance and not just you, know everybody, but I'm hopeful that yeah we can get back there and at least have a discussion for what really needs to be done because, yes, rent is due tomorrow and for those that can pay it. Please help out your landlord, but if you can't understandable and if you know you need help advocating for that, I'd be happy to do so as to why you need to be protected from your landlord if they are like the ones that the senator mentioned that are trying to this time. So it's really all I got but again, I'm here for you and any questions, I'm happy to take all right anyway. Any board members have questions. I haven't seen any chats any text messages lately. So unless there's something we should move on, thank you assembly, member, no problem guys stay safe, be well. I will get back to mr lieutenant because he called in. Let me go to the agenda real quick, mr bob press are you here. I gotta figure out which one is okay. I gotta figure out which one is tom lecania before I can call on him: go ahead: bob okay, councilman john! I'm going to be trying to be very brief because councilman john, I said much of what I was going to say about the executive budget. So let me just go in that councilman king has been out in his district doing what he has to bring food to where it is needed. On monday, councilman, king and Brooklyn borough, president eric adams gave out 1500 face masks in co-op city on tuesday at the workman circle, multi-care center councilman king senator bailey, and miss leyla capers, the star of the lion king held a celebration for our essential workers, the police, fire, sanitation, health care and postal workers. Lastly, I want to thank my assembly woman for the update on 2500 williamsbridge road, and I hope that the board stays on top of 1400 blondel avenue if there are any updates on that jeremy. That's it. If anybody wants to contact me, please go through jeremy yeah. So the update that I received from the city, I think today was that they're still on track for opening up the homeless shelter. I didn't get a chance to share that with the board. Yet I let's see who else is on the agenda. Any questions for mr press, no marielle de la cruz, I still gotta figure out which one is tom lecania, so just bear with me. Marielle. Are you still there you still around? I am. Can you all hear me awesome? Like jeremy said this is marielle de la cruz and I'm having a hard time with my damn computer with the new york city comptroller's office. I just wanted to share a few quick things. One we've been working from home. Like I mentioned in the previous meeting, we had a town hall along with senator biasy that had over. I think it was 400 people in the tendon. So thank you so much for folks that made it out. There are also a few of you all that I will be contacting that submitted questions. I just haven't gotten to some things. As of yet I'm really interested in hearing about folks concerns about the or not concerns of requests about the expansion of ps 108.. I know I had been in communications with folks in cec 11 a long time ago about another school, but I just want to make sure that people continue to communicate with me on those things, one of the things that we have done just an fyi for the small business owners and community board 11 is that we've been having webinars about different resources that exist private and public when for small businesses, both loans and grants. So if folks need that information jeremy, I will put that in the chat, and I know that you have shared it shared it with different individuals. Also, too, people have been sending me cases of folks that have issues receiving food or any kind of issues like that. We also have a constituent services arm and we're doing as best as we can to connect people. We have a resource guide from all over the city that new yorkers could use during Covid-19. So again, I will include that link jeremy with you, and I know you shared that as well the small business link and also, I would like to say thank you, jeremy anytime. I've called him. He has responded very quickly with a lot of information and a lot of the different elected officials that were on or may still be on. Their staff has been incredibly helpful to me and I know to their constituents a lot of folks have been working, 24, 7 and because you can't see them, that's not necessarily always assumed. So thank you so much. Lastly, what I want to say is that the controller has released a lot of statements and letters regarding the way can move a little differently, so we've asked for there to be a better look at senior housing and how it's been disinfected or not at all, especially the 202. Also too acs for protections for child care. Letters about non-profits- and I know nonprofits- have called us with concerns about their contracts, so we are putting those out there as quickly as possible, and there is also so much work that we have been doing about. Releasing demographic data as well to ensure that we identify and continue to identify systematic inequalities, better protect front-line workers, so there's so much else that we've done and I'm not taking too much more of your time. But thank you so much for having me here today. Thank you for all of your work. I will also include my cell phone number that everybody should have, but the more that I know about what's going on in your community, the better, I am able to assist you, so these meetings should not be the first time I hear of things and I am home and would love to speak to some of you all. So, thank you. So much have a beautiful night. Yes, hi marielle! This is bernadette. I just wanted. I just wanted to give a a quick update. I just want to give a quick update. I had a I had a one-on-one meeting with cheryl smith this week about some of the issues and, of course, ps108 came up, and she's assured me that they are. You know that the superintendent, along with everyone else and I'm sure she will get they- will get the information out to the respective elected officials, but that there will be an information, update, there's a lot of information and it needs to get flushed through and become transparent and she rallied all of them off, because she knows them like the back of her hand and probably the end of may or the beginning of June. There will be an information update, so I just wanted to put it out there, because I know there are a lot of people within the community and parents etc that are looking forward to that update. Thank you. Please share with me any meetings that you guys think I should be a part of. I try to know a lot of things, but I don't know everything, because I cover a lot of the Bronx, so feel free to include me in anything or send it to me. Okay, thank you. Thank you, thomas the candy of our president's office good evening. Everyone, first of all, thank you all for participating this evening on this call. I also want to share the book president's thoughts and prayers for those board members who are presently suffering from the chronovirus and any family members who have been affected by it. I have sent out the latest borough president newsletter to all of you. I sent it to the board and asked them to share it with the community, as well borrow president has been out in the community similar to what everybody else has been doing in terms of food masks. Sanitizer today, the burke president received the donation from the automobile dealers in the Bronx of 50 000 masks, which will be distributed throughout the borough to essential employees, nursing homes, senior buildings, NYCHA developments. As all of the other offices. Our office is open. Working from home. Our constituent services office is taking complaints and working with city agencies on any complaints that come up. You all have my email address. Please feel free to contact me if you have any questions or need any assistance. Thank you, jeremy. Okay, thank you tom. Let's see, I forget who's here, christina catherine from the Bronx district attorney's office. Can you meet yourself? Everyone hear me hello. Everyone, I hope everyone is doing well condolences to those of you who have lost a loved one, a family member or friend the da's office were working remotely at the time, the entire office. So, while we are closed physically, everyone is working remotely. The all court appearances and trials have been held virtually in conjunction with pd. We are handling the more violent cases that fall under felony charges and any instances that have a victim any crimes that may have a victim attached to it, because, as excuse me, I'm sorry because there's a senator gustavo mentioned that there is a high increase in those who are incarcerated becoming contaminated with the virus infected with the virus. The da's offices have sent letters to the mayor just addressing that issue. Also on another note, yesterday was denim day, so those of you who wore denim in lieu of like sexual assault. Thank you for that, and it's just a heightened awareness. I've also sent some documents to jeremy, which can be shared with the board members and the constituents of community board 11. We have a dv a dv resource guide. Our crime, victim assistance unit is still up and running, and so, if you look on the guide, you can get information on how people can seek resources, be it be it therapy or whatever. They may need. Also we're asking that people just keep your ears and eyes open for any incidents of child abuse that may be going on because of the lower contact with mandated reporters, we're not sure what is being done or if it's happening, if there has been an increase, a decrease so just be vigilant about child abuse and that's pretty much it from the dean's office. If you have any questions, I put, I posted my number and I'm excuse me. I posted my email in the chat. Please just send all questions that you may have to that email address so that I can get you your response in a timely manner. Thank you, okay. Somebody had a question. Excuse me! No, okay! So, let's move on to the aoc's office. That's me troops, hi folks. Yes, I am okay, hi folks, good evening, as mentioned, my name is destiny cruz, I'm a representative and case worker for congresswoman costco cortez. I'm happy to join all you folks and again just want to thank cb 11's leadership for setting up a virtual meeting. Just a few quick updates. As folks know, we did pass the cares act which provides immediate cash relief, so adults will receive most adults will receive up to twelve hundred dollars in a direct deposit from the irs. If you have an adjusted gross income of 75, 000 or less and ensuring that you also filed in 2018 or 2019, let's see if you have a child who is under the age of 16, you are also eligible to receive an additional 500 per child. You can check the status of your stimulate of your stimulus check, I'm going to send those links in the chat in a moment, but there is a link where you can check the status of your check. You can update to ensure that your direct deposit is updated with the irs. So now you can receive that. That being said- and this is at the state level, but the cares act also ensures that an additional 600 per week for up to four months are given to folks who have applied for unemployment and that their unemployment was due to Covid-19 19.. I will also share a link where you can apply for unemployment. I also want to thank council member joan I for mentioning the disadvantages that our small businesses are facing at this time with the legislation that has been coming from the federal government. That being said, and it's very much the reason why the congresswoman has recently voted. No. In fact, she was the only congress member to vote no most recent legislation because it did not have enough money to go to our small businesses. So I just wanted to share that with you all. Additionally, if you are on social security or you receive a social security income or supplemental security income, you will not have to file a tax return in order to receive your tax assistance recipients with excuse me, recipients will receive cash assistance as a direct deposit or by paper check, just as they normally would receive their benefits. That being said, this week, the irs began issuing paper checks to individuals. This can take up to 20 weeks to ensure that everyone gets it, but they did begin that this week. Now on a more local level, a lot of folks I mean in the beginning of the call we were talking about usps, but just over the last few weeks. I know that particularly cb11 has had a lot of issues with their postal services, so I just want to give a quick update on that, particularly at the allerton and esplanade post offices. It is our understanding that the allerton and espinal post offices are retail. Only locations and services, such as po boxes in allerton, are available at the parent station of williams bridge. So these temporary, we will see some temporary closures from those two post offices, and that is due to the Bronx poster master, not having enough staff to open these buildings, resources and staff are shifted daily and our office has voiced the community's concerns and hope that the allerton and in hopes that the allerton and esplanade post offices will be permanently open soon. I just want to thank assemblymember fernandez's staff, who did flag that those two offices to those two post offices to our office- let's see- oh sorry, I don't mean to take too much time, jeremy, but also for just cd11. I heard back today from our congressional liaison in terms of holding the holding your mail, that is official, they will be holding it just please. Let me know at the end of this meeting how long you want it to be held. I will let them know and they will contact the Bronx postmaster on your behalf to ensure that all of the cb11 mail is being held. That being said just very quickly, we do have a newsletter with kovid19 updates, and we also just want to continue to remind people that the census is still happening. I'm going to drop the link where you can self-report and add yourself to the census. I'm also going to leave my phone number just like everyone else. Our office is still working, you can call our office leave a voicemail and someone will get back to you before the end of the day. That being said, those are all of my updates. Unless there are any questions, great, thank you. Destiny, sandy younger, had a question. I had a question or a point of information. I know it and I want to thank everything that has been said and done, but there have been days that people in the 104 69 area code or zip code have not gotten their mail for two days at a time, then you'll get one piece of mail, then another two days. This is unacceptable and I mean yes, I know that there's a shortage of staff, but just today, no mail in this area and what is being done to address that right, and so it's in moments like these, where we hear from the community that we can reach out to our congressional liaison and find out exactly about that zip code. Do you know which post office serves that zip code? Exactly? Is it I'm not mistaken? The mail comes from gun hill road, that is the post office, that the mail is delivered from gotcha, okay. So again, I'm happy to so. I'm gonna put down my phone number, so you can call me directly and message me directly, so I can ask me: you'll have to give it to me because I'm on the phone, no yeah, no problems, then so jeremy. You can share my contact information. We can just we'll be keeping a calendar of the days that there have been no deliveries and it's not one day a week. It's several okay yeah! I don't talk to anyone else in the 104 69 zip code or gets mail from gun hill road. Does anyone else have a problem with the mail delivery? I guess I don't know. Okay! Thank you, hello. Can you hear me? Yes? Okay? Yes, I'm also having problem with the mail, and I know my mail comes from parchester, I'm in 104.62, and I have gotten mail of things that I had already paid like a good month ago and then I'm just getting the stuff in the mail, the statement in the mail a month later for weeks after I was told that things were mailed weeks. I couldn't do my taxes yeah. I understand yeah, I'm getting stuck I'm getting stuff for six weeks later than it should have been right. Thank god they will throw it away right, and that is absolutely unacceptable, and I just also want to give the context that we fully recognize that this is a Bronx, a bronx-based issue yeah, it's part of our district, we're not seeing this come up and work very closely with our congressional liaison and the Bronx postmaster to ensure that everyone's getting their mail and that we're flagging everything that you folks are seeing on the ground. So again, I really do appreciate it and we'll have jeremy. Please just share my contact information with everyone to ensure that they can contact me directly. Charles has a question. Let me unmute her because she called in from what I can tell charles maybe come back right. I couldn't tell you, no I'm sorry. I had to unmute myself, okay, thank you, I'm having a problem with some of my neighbors who are on ssi and they're. They haven't gotten a check because they're having problems with getting their information from their w-2 forms from 2018-2019, because they're underneath adult protective services and they're not getting those they're, not getting their information or their paperwork so that they can file so they're having a problem with that with that issue with the prior, so I just want to go if they are receiving ssi benefits, they do not have to file a tax credit, so that is an update that the irs has created, saying that it has their benefits. They will miss a benefit. They will receive that the same way that they receive your ssi benefits. So, for example, if it's on the second wednesday of the month by check or through direct deposit, that is the time way that they will receive that you do not have to find additional forms. Okay! Well, if they don't have direct deposit, because they don't have direct deposit with with the adult protective services they get some. I don't know what kind of problem that he's having, but I'll have to get your information later from jeremy and then I'll be able to get through to him, and then we can at least assist him with that matter. You know moving forward. Yes, please definitely, please feel free to contact me directly and I'm happy to communicate with your neighbors, but again for everyone's awareness. If you are receiving a benefit, especially social security, va benefits as well. It's railroad retirement benefits. Those three benefits. You will automatically receive the twelve hundred dollars. You do not have to take any additional steps and that money will come the same way that those benefits come to you, okay, so, okay! Thank you! Absolutely darrell! You had a question yeah real briefly. I noticed that the congresswoman is working on student loan forgiveness. Is this going to be a possibility? How likely would this happen? Yeah I mean it depends on not just the congresswoman but on the house passing that legislation or that resolution and the senate passing it to right. So it's not just contingent on the congresswoman. What she can do is advocate and ensure that you know we're letting people in dc know how important it is and how it could really benefit all of us. So, as you mentioned, she is fighting for it. I can't give you any probability just because it really does depend on the senate and the house voting on it. Thank you. Thank you. I think that's the last question for you. Thank you very much. Destiny is mariette joyce still here from senator biaggi's office yeah, I'm here, hi jeremy good evening, everyone, it's marianne joyce from state senator alessandra biaggi's office, I'm substituting in for emily vasquez. I put some of this information in the chat. I can put it in again if folks didn't see it, along with my contact information, senator rivera covered the budget pieces and all what's going on in albany, so I'll just go straight to the district office, we're all working remotely, as everyone else seems to be we're all we all remain accessible by email and by telephone. The telephone number is the same as it always has been. 718-822-2049 we've set up a directory on the telephone. So if you you're looking for a particular person, if you call the main number just follow the prompts in the directory and it'll ring through to their extension in their remote location, we're fielding a very high volume of calls and emails asking for assistance in a range of areas. I'd say the major percentage, the largest percentage is folks, are having trouble getting through their unemployment insurance applications through the department of labor. So we've been fielding a lot of calls and emails about that. Bringing those issues to the attention of the governor's office and the state is slowly working their way through the backlog working out the kinks in the system. If folks have issues with unemployment, assistance feel free to contact our office and we can try to troubleshoot them. For you we're getting calls about PPE access to food, probably the same kind of calls that every other elected's office is getting and we're trying to connect people up with the resources they need. The senator has been doing virtual town halls on different top different topics around the district. As the controller's office mentioned, she did one with scott stringer she's done one for small businesses, one about rent issues. I don't think we have one coming up next week, but the ones she's done in the past. I believe they're all available for streaming on the facebook page and we are putting out a nightly email newsletter with updates from the city and state as they come in and also cover a bit of westchester county. We are trying to put as many resources in that newsletter as we can to connect people with whatever the issue may be if anyone's interested in receiving the newsletter and is not getting it. Now you can send an email to me at m: joyce mjoice, ny senate DOT, gov I'll, put my email in the chat again and I'm happy to add you to our email list answers if any questions we're going to move on to state senator bailey's office. I believe this is our last elected official. Hopefully last but not least ronald either. Can you meet yourself for now? Hey this? Is your bailey's office hey, so our office has been very busy temporarily. We are working from home, so I provided the email in the chat. If anyone has any constituent concerns earlier senator bailey, along with other elected officials such as andrew cohen, councilman, andrew cohen assembly, member jeffrey dinowitz and others that many others that I can't name off the top of my head. You can watch the replay of the virtual town hall on senator bailey's page on facebook. Also senator bailey has been active in the community at this time he has been in co-op city delivering meals to many people, many residents especially seniors. We also have a grab-and-go lunch for kids, 18 and under at 1345 east gun hill road. That's at ultimate grill, so many children they they're not in school. Obviously, so they don't have access to school lunch. Many families cannot provide food for their children, but if you know of any families that need to feed their children, they could go to this location. They are open on monday, through friday, from 11 30 a.m to 1 30 p.m. I could provide more details, and yesterday he has also been out with assembly member natalia fernandez serving food in the. Let me make sure which area that is he's been serving food in the parkside house's residence. If you'd like to know any more information about things that senator bailey has been doing in the community, you can provide your email address and I'll add you to the mailing list. Thank you. Okay and I'm sorry. We one last person, terence miller from the public advocates office, hello, everyone. How are you? My name is terence miller, I'm the new Bronx pearl liaison for the federal for the public advocate, and I just have a couple of updates I'll, be really quick. So the public advocate has called for a release of demographic data related to arrests and enforcement actions by the NYPD for violations of social discipline and mass mandates. In a letter to the mayor, the public advocate requested data on the number of summerses, an arrest conducted related to Covid-19 19 mandates by race and zip code. He's also called for a task force to address the racial disparity of cobit 19 impact he's pursuing legislation to create a task force, but the time it will take to enact the law is a time that the communities of color are being devastated by the crisis and the people who are deemed essential but treat it as expensive. Expendable. Just don't have the time and, lastly, he's released a statement calling for vacant hotel rooms to be made available for thousands of homeless, new yorkers who are among the most vulnerable amid forbid 19 pandemic. So if you have any questions for me, please feel free to ask I'll leave my email in the chat. I think that concludes our elected official portion, the meeting, so let me share so moving on chairman's report. Let me let me just put the screen real, quick. If you can see it, so we have a motion to approve the february 2020 football meeting minutes as distributed. I know they were published on the website, but nobody. We know we didn't actually vote on these so actually and there was no commit. I don't think this was made in committee. So did somebody want to make the motion seconded any board member? I made the motion to approve the february 22 minutes. I seconded it motion by all. Second again, I know I have. I don't want to mute everybody, but I'm gonna, I'm gonna we'll come back to we'll come back to board members that are calling in I'll unmute all the board members calling in our attempt to and then out you had. Let me pull up the motion for you. Do you want to maybe talk a little bit about this next one? You read that al motion to request senator alexander hold I'm going to mute. Everybody then on youtube, all right, al you're unmuted. Let me go back to do you need the motion again now closing opposition regarding carnegie hill's proposal. So let me read that restate that for everybody, because I'm not sure you got cut off so the motion to record- I don't see the end of it but yeah. Let me let me just repeat it out, because not everybody could hear it. Your mic kept counting it out. I mean because some people are not seeing the computer screen. So a motion to request state senator alessandra biagi, send the new york state office of addiction services and supports an email or letter of opposition regarding carnegie hill's proposal for 2500 williamsburg road. Anybody wants to keep that second, jeremy or abstentions. Otherwise it's going to be declared unanimous and the next thing on the on my report is: I just mentioned that vinnie precious wife has passed away. I just keep learning video, so if you weren't able to hear that if any prezios bridgette passed away recently, those of you have email should have received the email anything else- al treasurer's report, veronica. I know you emailed me a treasurer's report like right before the meeting. Hey you asked harry if she could send it out. I don't know if you got a chance to send it out anything. You want to state about it. No, if it when you get the treasury support. If anybody has any questions, you can reach out to me directly I'll, be happy to answer any questions. You have okay, so my report, it's around five o'clock tonight. I got my february report on there March. If anybody wants specifically March, I think April is going to be good enough. I don't want to go over the whole thing. It's just too much. I don't want to waste anybody more time for anybody. Let me just key points. Working remotely has clearly been a challenge. This meeting has clearly been a challenge. I have individually spent a lot of time with some board members getting to use these programs, so I spent three hours with one board member last week with their computer issues. It's a it's a lot of time in the beginning, but it's a long-term investment is how I see it. Kings, harbor I've already sent out emails about that. I put more detail: a press release came up with again, as I mentioned, to lt velbruga. There are at least two businesses in our district that have been violated for price gouging and we'll send him those emails because he wants to know einstein hospital. There was, I gotta, mute everybody again. I keep getting feedback. Okay, officially, there's a nice article in the new york times. I highly recommend you read about these struggles. There stats I've been continually posting stats. As some of you know, other information about the kova 19 syria activity permits have been cancelled up until June up until July. First, I don't know what's happening after July or after July 1st. At the moment, mail theft somebody a community resident put in notified me, I think yeah me and alex she sent an email. She sees email about mail theft, she did not call 9-1-1. She didn't realize that she should have called 9-1-1 when she saw it in progress. Any crime in progress is the 9-1-1 call. She saw somebody fishing out of the mailbox that is in my report. It is online budget cuts, so our office's budget is being cut by four thousand dollars this year, close to nine thousand dollars next year. Now the fiscal year starts July. First, that's what I might mean by next year. July 1st. These are the first round of cuts. I wouldn't be surprised if there are more coming and in terms of other agencies, bronze house they've reached out to Bronx house bronzoo, dsny 49th precinct about who is or maybe may not be getting cuts. Dsny they've been doing really good with kova 19. Only one person testing positive and they are, they are already recovered, and the composting program is the only thing that the sny knows of so far with budget cuts they that program is being suspended for I think a year, so I'm gonna. I please, if you have any questions, please speak to me after the meeting, so we you know so this mean doesn't go to 11 o'clock committee reports, I think, is that david levitt is you're the chair of that committee. Yes, so this is a motion to amend the the bylaws of the community board to add a standing committee for ethics and disciplinary reasons. This was a mandate from the borough president's office to all community boards. The committee is already in place. The bylaws committee met on this issue in february and presented this bylaw change to the full community board in february. We did not meet in March, so it's now coming up for a vote. Are there any questions? If there are no questions, then I will ask: is anybody against this, or is anybody abstaining? If nobody is against or abstains from this motion, then it will be listed. As being unanimous concludes my report great- and I guess for purpose I guess because not everybody's able to talk and respond david well, if I think we could probably if anybody asked tells me afternoon. Oh I want to you know, vote against this. I guess we'll just add that to the record right, absolutely: okay, nominating committee hazelmate al pointed out nominating committee. We do have elections still hazel muir has been appointed. Chair. Adh greatly is part of the committee. So it's john scottieri, unless hazel hazel's on mute. I think hazel wanted me to just say whatever needs to be said. Anyway. The positions are up this year, our chair first vice chair and secretary of the board, so in April and may with nominations the for any nomination. So nobody is automatic. The committee can make a recommendation, but I don't think they're prepared to at this point. So if anybody wants to make an make a nomination make a nomination tonight for chair first vice chair or secretary, I think tony vitaliano. What do you want to go ahead? Tony? Can you talk hey? I want to nominate al the of the chat. Okay, so, for that nomination to be valid, it has to be seconded. Does anyone like to second that nomination? I second denomination? Okay, second, by veronica al, do you accept? Yes, I do, okay, any other nominations for chair. If there are no other nominations, we will close the nominations for chair of the board. First, vice chair, any nominations for first vice chair of the board. Anyone I nominate tony vitalian for first vice chair. Okay, can I get a second? Can we get a second, I second, it debbie, mr vitaliano, you accept yes, I do and then that would only any other nominations for first vice chair other nominations. The nominations for first place. Chair are clothes. Sorry, somebody saying something nominations for secretary somebody's trying to talk. I can't understand you nominations for secretary of the board, any animations for secretary third quality nominations for secretary of the board, nominate david levin for secretary nomination by veronica, any second for that nomination. I second it okay, never mind debbie cowlick david. Do you accept? I respectfully decline? It's been my honor to serve as secretary, but I'm not running for another term. I do appreciate the nomination, though any other nominations for secretary. If there are none, you can do this in may. We can do this in may. Okay, no nominations the nominations for secretary are closed. Then we will turn it over to yahayo b for public safety. Yeah. Are you still with us yeah, I'm here? Nothing really to add. I sent the minutes. If you get a chance or maybe they've been published. I have nothing else to add. Thank you. Yes, we did receive them. We have not had time to touch them yet honey old business jeremy. Can you hear me diane? Okay, I'd just like to make two points. One point is in the schools. Well, I'm over here by ps105 in the high school down here they do serve breakfast and lunch at these two schools, any public school clothes. You should have breakfast and lunch. The second point is, I hope you parents are getting involved with the children's remote learning from school, seeing at least what the teachers are sending them to put on the computer, and I have a computer and I have a laptop. You have to have a computer and you have to have a phone, but sometimes your child does not have the equipment, but if you can call 3-1-1 or even through the community boards, you can fill out an application, so your child can receive a notebook ipad. I believe it's an ipad. They have to return it back, though, so that if they don't have equipment to do the remote learning, they will send them a notebook for their learning. So you can embrace that and call 3-1-1 if you do need a notebook. That's all I want to say goodbye, everybody. I miss everybody. Thank you. Thank you, diane, any other old business. I have something andrew siegel. In light of all that's been going on with this Covid-19, I would like to have the idea of having a blood center revisited. They keep saying they want blood donations organizations, but how are we supposed to do that? Most of us, a lot of us do not have cars and we're not going to get on public transportation to go home. I second that I think maybe we should you know. The community board can now write another letter to the borough president and whoever to revisit the idea. Okay, so you made up you're making a motion, andrea suggestion. I don't know how you want to present this. It's really up to you. It's really up to the board. If she's making a motion- I ex I second it, but she doesn't know so. Do you want? Do you want to make a motion debbie, I'm yes I'll make. I make a motion that the borough president revisits having a blood center in the Bronx okay. Andrea. Do you want to second that yeah I seconded or whatever you want to do right? You know any all in favor any against. You still got me muted, no dom go ahead, nothing! I've done now. I mean everything was all over couldn't get through? Okay, so anyone against the blood bank to ask you requesting the bro president's office revisit the issue revisit. What's that drill, perhaps you need to revisit the issue who we do the board president, all right, so any against or abstentions. If not, it's going to be unanimous, it's going to be marking unanimous. Okay, any other new business adjournment make a motion. Second hi again! Thank you everybody. This is obviously fun. Thank everybody, be good, have a great time at home, healthy thanks, jeremy good night folks stay safe. Thank you mark good job, jeremy thanks very much all right. Thank you. Thank you. Everybody, I'm ending the meeting good night good night.",
        "summary": "There's somebody else from the computer, I'm gonna open up to the phone people, all right, yourself, everyone, everybody!, Unless somebody has a better idea, I, don't know a better way, so I'm used to phone people, again.\nGetting them engaged as much as we can through social media, our website and through our providers, because it is a lot going on We know that our patients are suffering either suffering from griefs and deaths from family members and friends, and we are promoting our health behavior services to our community, and we know that our patients and our communities suffering from social determinants of health, that we all know that health is just not only about you, Know: health care and medicine.\nThat, you know is all the Bronx that we want to make sure that our vulnerable population is really still stays at home.\nThere are more testing sites, as you know, opening up in the city, but the new york city department of health really has limited us in terms of testings for our patients.\nWe really want to know how good these tests are they covered before we start promoting it to our community.\nSo we're actively trying to figure all this information out as we speak, and are you getting any word on how fast they will start opening up the test to the public in general?\nI know everybody's really scared to, but we want to make sure that our community is not suffering from their chronic diseases and worsening their diabetes and hypertension suffering from strokes and heart attacks at home.\nAlthough my office is physically closed, we are taking phone calls, we're taking messages, emails , we're working, I'm out there, every day, helping and assisting in any which way I can for those of you that don't have my phone number A quick update and first, I think we should acknowledge, or I should acknowledge, the sacrifices of our first responders health care workers and all of our essential workers that are on the front.\nWe have some great supermarkets out there that have taken some extraordinary precautions by putting up glass shields and supplying all of the PPE that is needed to their employees, but I think it would be a priority to have those workers tested so that we know they're safe to be serving us, and it's for the protection of those employees as well.\nSo we're going to be coming together as a delegation to make sure that this administration and the city recognizes the importance and the needs and the assessments that have to be made in the borough of the Bronx.\nI want to thank the community board for what you're doing and for the trying times that we all have together, and we want to make sure that our tenants are not forced out into the street, not evicted for non-payment rent due to these unique circumstances that will be on their control, that we should have safety nets in place for them.\nI would be more willing to understand and work with it, but when the banks everybody's in a moratorium, what you should all be aware, is, nobody can be brought to housing court right now and be evicted for the next 90 days in the states stepped in the city.\nThe delegation on the city council for the brother, Bronx is coming together to push back, and I know that we're working with our elected officials up in albany also to make sure that we get what we're entitled to.\nI'm, not saying that the fight is over the city and the state are claiming that they need those funds to make sure that every all of the other safety nets are in place from police to sanitation, to hospitals and healthcare.\nWe're trying to figure all this out now at the city, council, working with our colleagues in albany, on how to come up with a creative way to make sure that especially our small property, owners.\nIt's, going to require city, state and federal to come together to assess the needs and make sure that we don't cut services that are important, but also make sure that we spend every dollar as if it was our own money.\nYou can get all the information from caitlyn, but this is going to be so that we can we're going to have different folks talk about some of the issues that are facing, people that are employed right now, and some of the solutions that are being proposed, as well as some assistance, and hopefully the state will get its act.\nWe have all heard about the fact that there just was no way that they could handle as much new influx as they've got of people that are unemployed, so we're working with the state to kind of get them to do it more quickly, but we're gonna have that on may 5th, which weirdly enough is next week.\nThere's, one in particular that we just got a win on just a couple of days ago, and that is, there was a whole issue about reimbursements on mental health services to community health, centers and reimbursements that they were not getting from the state they required.\nIt required patients to actually come into the community health center to get telehealth services for mental health services, and it was kind of like you're putting people at risk.\nMost of these sites are driving only and we want to make sure that we can provide some for folks who do not have access to a car and so are working to expand testing capacity.\nWe had this conversation in person before I know that there's many members in the There's many folks in the in the community board that disagree with me on this, and I.\nBut you know what I do know that the senior centers in my district have tried to really keep in contact with the folks who they serve on a regular basis to make sure that they can provide food if necessary that they can provide some other services, so I had thought about, for example, the tablets that we're getting to the children in schools right to make sure that, particularly for those folks who do not have computers at home.\nThe first thing I wanted to just bring up, because we were talking about antibody testing- Is, that I work for two of the major healthcare corporations here in in new york.\nI know a lot of people are concerned that they want this test to be available, and I just want to put it out there that we're working on it.\nA lot of researches is being conducted, and just like you mentioned before, we are actively taking information, of course, from other countries overseas, but because we don't know the the immunity of the people that may have already contracted Covid-19 and if you can get reinfected or not.\nBefore we have it open and available to the public The second thing I wanted to also ask you.\nWe have this high turnaround time because we may have people who are essential healthcare workers who are working with Covid-19 to treat the patients and we need to be able to allow people to be home Covid-19, not continue to spread it while trying to save lives of other people that also have code.\nIt's just like a like a revolving door of Covid-19 that I find very concerning because I'm in the heat of it all every day, right, but I agree with you So do you have any information or any updates as to giving people a longer leave to be able to be home?\nI would like to actually have a conversation offline about it for with you, because one of the things that I'm trying to do- This is something that I offer to everyone, particularly those folks who are familiar, who are working in the healthcare field or nursing, homes, home health, aides, etc.\nYou know that there's a lot of people that are out of work right now, You know with food and other bills, but is there something in place for them or assistance for them to go to to catch up to these arrears?\nThe reality is that if you have somebody today who can't pay their rent because they haven't been working for the last month or at this point two months and they're- But, there's actually one of my colleagues in Manhattan who got a call from a landlord in his district and the landlord asked his office.\nSo I want to make sure that we get back to legislating so that we can have a thoughtful conversation with the governor and with the assembly about how to do something about canceling, rent and doing it in a way that helps tenants who currently do not have the ability So many tenants across the entire state that are worried.\nI can't ask a small business owner pay for this, I agree with you, but if we do, but if we don't, if we don't act aggressively the impact that that's going to have on the entire on the entire endeavor, I mean we're having issues with homelessness If, we do not, if we do not proactively deal with the fact that people are not going to be able to pay their rent because they haven't had income for two months.\nWe could have a longer conversation about that, but the last point I wanted to make was that we'll get through this together because we're resilient bastards, the Bronx is a brazilian group of folk, but let's make sure that as we get through it, we at the other end do not go back to the way things were because then this is gonna happen.\nWhatever is open senior centers, to make sure that they have at least some sign of sanitation in their entrance, but also I want to be able to share it.\nSo now I'm in communication, with the state department of finance to see if they can find any trace of that- My communication, with the attorney general's office, I, requested to do a teletown hall with her, so we're going to get that in the works.\nPlease help out your landlord, but if you can't understandable and if you know you need help advocating for that, I'd be happy to do so as to why you need to be protected from your landlord if they are like the ones that the senator mentioned that are trying to this time.\nIf anybody wants to contact me, please go through jeremy So. The update that I received from the city, I think today was that they're still on track for opening up the homeless, shelter.\nI had been in communications with folks in cec 11 a long time ago about another school, but I just want to make sure that people continue to communicate with me on those things, One of the things that we have done.\nWhat's going on in your community, the better, I am able to assist you, so these meetings should not be the first time I hear of things.\nThere will be an information update, so I just wanted to put it out there, because I know there are a lot of people within the community and parents etc that are looking forward to that.\nI also want to thank council member joan I for mentioning the disadvantages that our small businesses are facing at this time with the legislation that has been coming from the federal government.\nAnd I want to thank everything that has been said and done, but there have been days that people in the 104 69 area code or zip code have not gotten their mail for two days at a time.\nI know that there's a shortage of staff, but just today, no mail in this area and what is being done to address that right, and so it's in moments like these, where we hear from the community that we can reach out to our congressional liaison and find out exactly about that zip code.\nIt, along with my contact, information, senator rivera covered the budget pieces and all what's going on in albany, so I'll just go straight to the district office , we're all working remotely, as everyone else seems to be we're all.\nYou we're getting calls about PPE access to food, probably the same kind of calls that every other elected's office is getting We're trying to connect people up with the resources they need.\nHappy to add you to our email list answers if any questions we're going to move on to state senator bailey's office.\nIf you'd like to know any more information about things that senator bailey has been doing in the community.\nI, know you emailed me a treasurer's report like right before the meeting.\nI make a motion that the borough president revisits having a blood center in the Bronx Do. You want to second that So anyone against the blood bank to ask you requesting the bro president's office revisit the issue revisit."
    }
}