{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "title": "CB7 Business and Consumer Issues Committee",
            "publishDate": "2020-11-14",
            "shortDescription": "",
            "lengthSeconds": "0:40:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "1czbxh7tgx4",
            "fillerWordCount": {
                "uh": 61,
                "um": 63
            },
            "readTimeFullTranscript": "24 min read",
            "readTimeSummary": "3 min read",
            "wordCountFullTranscript": {
                "restaurant": 20,
                "restaurants": 17,
                "business": 13,
                "liquor": 10,
                "state": 10,
                "transfer": 8,
                "license": 7,
                "money": 7,
                "dining": 7,
                "hours": 6
            },
            "wordCountSummary": {
                "restaurants": 5,
                "state": 4,
                "restaurant": 3,
                "owners": 2,
                "business": 2,
                "o'clock": 2,
                "dining": 2,
                "unemployment": 2,
                "cafe": 1,
                "tables": 1
            },
            "fullTranscript": "Pretty cool I mean I'm as good as can be. Let me put it that way. I know that seems to go around lately. We're live streaming now, just thought. I'd give you a heads up: okay, I promise to keep my language clean, I, don't know now's the time to sauce it up. Oh good idea, thank you. This is going to be a fast meeting they're only three, it should be yeah. It says you I know right. We can fix that. You know well. Last night was only about an hour and a half. Are you responsible for the new lease, not at the Broadway, the Broadway on Broadway, between 86th and 85th, that used to be the sandwich shop because it looks like they're doing work there I saw some permits. Did you talk to me? I'm talking to you spoken to me me? No I, yes, and no! It was a I'll explain it later, but it's going to be another gourmet deli type. I love gourmet, delis yeah. They do too that place. Wasn't really gourmet guys, I'm letting people in Hey. Did you get Barbara I sent a link to her or asked zoomed to here. Let me back that up. Okay, ow, okay, what's your one for a quota? Okay, good evening, everybody good evening? Okay! Oh thanks! Christian! You move everybody up: okay, yeah Barbara's, here, okay, good! So we almost do we have a quorum. No, we need one more for a quota. Five, six one, two, three four five, oh yeah cause mark. We can't include you in the forum: nope I, don't count, it's not 5:30, yet so we're in okay. Oh, it's 5:30. wait! A few more minutes! You know! Let's see if we have one more person join us hello. Does anybody see me Charles Lynn? Well, we yeah. We hear you hear me, but you can't see me. Yes, we don't see you right now, but we hear you looks like you're in the dark there, sir. No I'm not, but look to your left and you'll see the video that little camera. Yes, can you see a cross through it yeah? Now it's now it swaps across okay, I, think, there's a problem with your camera. Yeah, that's! Okay! As long as we can hear you we'll be good great, that's a disadvantage of being over 70. You know: I had the unique experience of having a college student trying to explain to an entire panel 61 sex engineering and septuagenarian lawyers, which is, of course just the audience. You want to be talking to exactly technology, trying to figure out how to break go into breakout rooms on zoom in order to do trial practice granddaughter 11 years old. Teaches me what to do a little embarrassing, yeah. She grew up morning, okay, Charles nice, to see you let's get started, welcome everybody. This is the November Bci meeting. We have three applicants. The first one is 240 Columbus Avenue. Are you here, 240 Columbus Avenue is here Seth Weinberg of Weinberg Zara Malkin Price representing the applicant Jacobo Giustini, is on as well, who is a principal of the company. Where are you Jackabo, okay, yeah, hello, everybody, hello, so go ahead. Tell us about your about Felice. Would you like to give the description sure we pleasure? We are called as hospitality group and we own three major three name brands. One is Bros. One is called Felicia: One is called casa level. It can everybody hear Dracopo I know he's breaking up on my reception he's making up for me. Also perhaps I'll start then, and to the extent sure so, the Felicia that's proposed would be part of Sa. Hospitality group is locally known, primarily for their three principal brands, which is the Saint Ambrose Restaurants, Felice Restaurants, and in Midtown Casa lever. They expect that this would be operated as a Felice property which would render it as a high-end restaurant, with appropriate wine beer and liquor service. Can you hear me better now? Sorry, can you read me better? Yes, could you just spell essay hospitality group? Just the first word, please it's the letters s and the letter a very good. Thank you, I'm taking minutes wow. This is great. Welcome to the neighborhood. Thank you. We are very we're very excited. Actually we don't have any establishment in the Upper West side. So we are very happy and glad to finally join this community. Great, actually, I live in the side. Isn't there a place called Felicia on Broadway near the movie theater or am I making that up? No, it would be a problem, I'm aware of so it. Obviously it's going to be. This is going to be. Is it what did? What is the cuisine? Is it going to be? Felicia is italian, so yeah, so Felicia, so the three brands, the all italian cuisine, Saint Ambrose, is more milanese type of cuisine, so more northern Italian Felice is more Tuscan, so a little bit more rustic at the same time sophisticated it's a menu that goes from pasta to a few main courses and mostly appetizers, like crostoni, with the liver with chicken, liver, Prosciutto, Burrada pulpete, my family. My uncle and I were partner in all these restaurants and we come from Florence. So so we are very attached to the Felicia concept. They remind us home, yeah and I love your restaurants. Thank you very much. Anyone want to comment from the group. I see your hours are pretty they're only until 10:30 p.m. Yeah your application said sidewalk Cafe. Is that because you're planning to apply for one yes, I mean I, know I have an enclosed cafe right now, but I was wondering and hoping to be able to add few tables on 71st street I took measurement. Very quick I need an architect to do a better due diligence, but I. Think I can have few extra table on 71st in front of the beautiful mural I think it would be nice because I think my main entrance would be on Columbus I know: Oxford Tavern was used to have the entrance on 71st, but I would rather, if possible, to use that part of the sidewalk to add few tables. I mean I, don't think going to be many, but few yeah well under the open restaurant right now you can in terms of once we are over the pandemic. We may have to talk about it. Okay, what restaurant was there previously, what Expo tavern and the original victors yeah? Oh whoa, oh okay, great! So when you say there's an enclosed cafe there. It is that really an enclosed cafe, or is that part of the restaurant that just has those windows that open all the way? No, that's an incredible disclosed and that remains so I mean yeah, since when yeah I was planning not to touch it I think it's a good amenity, because I can use it all year round and during the summer open the windows. There's no question: it's a great amenity, but I did not think they were grandfathered I think they are grandfathered. That was one of the issues that we went through when Greg first applied for before Oxbow Tavern, when it was what was about before they're, not grandfathered. Well, it currently is not an issue currently under the current circumstances, yeah, but when the time comes, then we'll have to talk about it. Yeah of course, I believe they can operate as with a temporary right. You know until it's approved, it's still a separate application right now we're here for the Laker license. We understand that. Okay, it's something you should look into, though, so you don't wind up with violations, yeah, understood and appreciated. Okay, anybody has any other questions. Want to take a vote all those in favor one, two, three, four, five six and we miss somebody who did I miss it's one, two, three, four, oh no I got it guys: okay, one two, three, four, five, six, seven great, so the body is seven zero and non-committee members says one zero, great wonderful, you're approved. Thank you appreciate it. Thank you very much. Thank you have a great day bye-bye and you plan to open, by the way, probably by May, depending of the pandemic, for my birthday, good, okay, perfect. We will be there. Hopefully I'm looking forward to it. So now we have 148 West 67Th, Street, Charles, Land Ernie for the applicant, and this means Louis Ski Bar, one of the principals right. We were here just last month, yeah, remember I'm 153 Amsterdam! This is the store next door on 67th street, also owned by the people who own telewater and are proceeding 153rd street. This store has been known for years at Sir, John's, it's a diner and what's going to happen, is that they can continue as a diner for that premises, but totally re-uh renovated to make it into a modern diner, and one of the principals had passed away a couple of months ago, so the current owners decided to with the pandemic and everything they wouldn't be able to continue to operate anyhow, so they got an SBA loan, got financing formed an Llc for tax purposes and decided to renovate, rather than do any transfer of ownership, but, like I say it will be it'll, be open from six in the morning to 12 at night it's an american Diner, not spanish, like most of the Mexican like most of the Loya operations, the american operation and, like I, said it's been there for years at that location and I, said you'll, be up and say six a.m to minute: six a.m, to 12 midnight. Seven, it's days a function as a diner, it's not going to be wild and crazy. I think this is no well crazy. Face is also considered back. We're going to be right. Next door, I, don't believe so well, I suppose some of you may have you know, be familiar with Sir John's they've been around for many years and there's not too many diners in the area. Not a lot left, not a lot of restaurants left either. Unfortunately portfolio. Yes, okay, anybody have questions. If no, we take a boat. Okay, all those in favor. That's one, two, three, four, five, six seven. So the vote is seven zero. Non-Committee members, that's one zero, so you're approved I. Thank you for joining us. Thank you! Okay, Charles and here we are coming to the finish line and thank you all for being here. On Friday night I know, everybody's had really tough weeks, 49 West 64th street. That's me good evening, CB7 on this next Friday evening, Community Board meeting, but thank you for making it fast. I hope this one will be fast as well. I think it will. This is Atlantic Grill. Everybody knows Atlantic Grill before I get into it. Actually, I should introduce my client Alex, just wave your hand, so everybody sees who you are he'll, be the general manager at the restaurant. So Atlantic Grill for years has been owned by Br guest, which is a subsidiary of Landry's. The massive restaurant owning conglomerate that owns all sorts of restaurants throughout the city and the country Landry's, is leaving. They are planning. They were planning on. Turning in the keys and essentially just closing down Atlantic Grill, but a group of owners led by the landlord is coming in to keep Atlantic Grill Alive and to keep it going, and so this is what we call transfer application, meaning that it's a purchase of the business, but nothing is changing about the business other than the top level ownership and Alex coming in as general manager. In other words, the vast majority of the staff is staying exactly the same, the menu is staying, the same. The concept is staying the same. It's still going to be called Atlantic grill. The hours are still an Atlantic grill restaurant hours, which is 10 o'clock every day of the week, except for 11 P.M, Friday and Saturday Alex has a great deal of experience in high-end restaurants. He has a really impressive resume: managing son Ambrose, the one on Madison Avenue. You just saw son Ambrose, a small family, you've been there since 2016. before that he was working with a chef, Daniel Balud at Db, Bistro, very high, end restaurant, and before that he was in the time Warner Center over on Columbus circle at the restaurant that was called a Voce, the Michelin Star restaurant. He was assistant general manager there for a number of years, so he's got a great deal of experience, managing restaurants and with nothing really changing. We hope you've had a good experience with Atlantic Grill so far, because it's not really going to change, went from Steve Anson to Landry's and they managed to keep it going. And now this is wonderful news. This is wonderful news. Wow anyone want to how are you guys faring during the pandemic? How's your fairing, the restaurant, so I have one question please I was I was reading your application and one application says that this was the transfer and the other application says it was a new application. There was some and a letter which I believe you had written, saying that the first thing should be disregarded, so I got confused. Now am I to understand that it's exactly as you described it, it's a new application to the SLA, but it is a transfer in that Landry's was going to get rid of it and instead Alex is taking over Barbara. It's an excellent question. I'm going to answer in two seconds just to answer Christian's question right before you know: how is it doing it's doing not great, just like any other restaurant right now is not great. You know. Landry certainly felt that they wanted to close it down, but the landlord and their group felt that it was an important enough restaurant that should stay in the community and so they've put together. You know they've brought Alex on the team and they want to keep it going Barbara to answer your question, which is one that makes sense. So transfer is actually you know it's not a legal term anytime. A new owner wants to come in and operate a business that has a liquor license. It's a new liquor license application, so we're filing a new liquor license application with the state liquor authority for a brand new entity. The reason folks call it a transfer is because when you have a new liquor license application and the incoming business is buying the assets of the outgoing business, so they're buying from Landry's the tables, the chairs, the intellectual property. Everything like that kitchen equipment, then the liquor authority gives the new entity a temporary liquor license, which you can get within 30 days of applying okay. So it's for designed exactly for this situation, where you could have a seamless and quick transfer of ownership, while you're waiting the many months it takes for the liquor authority to process the permanent liquor license application for the new entity, my office just screwed up and forgot to check the box. That said transfer! That's why we, you know we quit. We fixed it within 24 hours and that's why we told you to ignore the first one right. It's just fantastic I just want the minutes to be accurate. That's the only reason I questioned it thanks a lot. You're welcome. The Landry's basically got rid of most of the except for blue water Grill Ocean grill. They got rid of most of the the our guest, those caminos. Doesn't you know yeah it does so the fact that you know Bubba Gump football team in the golden nugget- casinos, that's right, Doug, but they bought the brand anyway. Listen, I'm so thrilled that you guys are opening up. This is like a whole night of great news guys. What do you think they're all diseases well, I, certainly hope that you guys make it I mean we really need every single restaurant yeah, it's fantastic, that the space will not sit there more about it's a big space. It's very prominently located, and it says a lot about our community that you're going to try to make a go of it, and we hope that we can support that. It's made from the peanut gallery. Thank you mark. Wasn't this the ginger man yeah the old ginger man? Oh, was it huh, yeah, quick question, and this doesn't make a difference in my support of this, but so you're just saying that in this instance the landlord is also part of the equity ownership of the business. That's right. Okay, great all right also want to think about all those in favor says one two, three, four, five, six, seven, no committee members, that's one, so the body is seven zero to one zero you're approved. We thank you for having come and we wish you. The best I, certainly hope. I'm looking forward to visit the restaurant I need that. Thank you very much everyone. By the way, Doug, that's actually something we're seeing a little more of with some landlords, at least who don't want to see their spaces sit vacant they're willing to put a little more skin in the game which, yes, I'm seeing that too all right! Thank you. Everyone have a good evening. Thank you! Anybody has any new business. You know, I have a question for Josh. Yes, I was wondering how you reacted to the 10 o'clock curfew and whether or not you feel that is a further problem for your restaurants and others as well, and what exactly we achieve by having a 10 o'clock curfew. Well, the second question: I can't answer I, don't know what we achieve by having a 10 o'clock curfew. I feel like that. You know it's frustrating for a lot of reasons, one of them being that we just don't. We can't give enough hours to our employees. You know we're losing 14 hours a week, which essentially is two and a half shifts the way we've been scheduling, and so that's a hardship for sure, because you know people are struggling as it is, and so that's very frustrating and of course it's going to cost us. You know business, you know not saying we do the majority of our business between 10 and midnight, but we do business between 10 and midnight, and so and now that the weather is getting colder. You know every dollar that we can get. You know that we need, and so it's just going to be really frustrating. But you know this I personally think that this is a precursor to a shutdown and that you know and I have no basis on nothing except for the fact that I feel like that. If the schools are going to close, it's going to be a domino effect, I feel like and I feel like. This is like. Okay, I'm going to give you this last opportunity like to get as many dollars as you can before we shut you down and we're just like trying to solve I, don't there's no rhyme or reason for it. There's no reasonable explanation. Arbitrary I mean what's the difference between 10 or 11 pm, right, yeah, I myself, don't feel that it accomplishes anything either. Yeah may I ask a question: Josh yeah sure what if the new administration, which we know they can't do much now, but what, if there's a guarantee if everything is shut down, so we could all be better that it's money going to be. Do you all the small businesses and businesses are all the way around? What if that is offered, would you be able to hold out until then well, I mean every business would be different, some would survive and some wouldn't it'd be really hard to say, but this is more of a state thing than a federal thing, because the president really can't shut the entire country down. He can shut down federal agencies right, but he really has no say over any state jurisdiction, so yeah I think that gets like it's a little bit. You know misrepresented that the president has control over what New York state can do or New York, City and so for non-federal agencies, so I just I, don't know, but I just feel like. The restaurant act, though, is I think is on the back end of that yeah. Maybe I mean you know, Andrew might know more about that than I do. But you know I just it's very frustrating because it is going to every look. Every dollar that we don't bring in is a dollar longer. It takes us to get back to, even and then to start making money. So, but I'm just fearful that this is a precursor to the city being shut down again, because the rate is climbing very quickly, and you know today, it's a 2.8, something and I know that they think that again my opinion that shutting something down in two days is going to slow it. But this is not like it's. They say like a ship in the ocean, it just doesn't stop automatically it's a slow stop and so I just feel like I. You know, I want to be as optimistic as possible and a lot of people say I'm a pessimist but I think I'm a realist and I just think that that's the direction we're going I you know, I can tell you that the the school's closing down at three percent rate- that's that was a deal that was struck between the schools and the unions. So I mean the schools are like at 0.17 percent. So they're right, exactly I know it's like it's crazy yeah, but that's what the city struck the deal with the union so that that's what they're doing there so I thought that will affect the the closing of the businesses. I just don't know what Cuomo was the the rate that which Cuomo will decide to do something, because this I don't know what this 10 o'clock meant. You know the thing is it's not in every area, it's not in every neighborhood and I'm not saying that people in Brooklyn don't come into Manhattan, but it's not happening here. I think one of the biggest things you're going to be dealing with and I was on the Upper East side yesterday. Having lunch is that they have really enclosed I mean like little cabins and that's what they're planning on they. You know lighting heaters and enclosed cabins, and that's this is what I was saying the other day that, with lack of enforcement, comes lack of compliance right, so you're supposed to be there's going to be in four there's going to be enforcement on that the other one is, if you're enclosed more than 50, you have to be treated like indoor dining right. So in the case that indoor dining gets shot by the slight chance that you can keep outdoor dining, those enclosed structures would be shut down too. Sorry, no just saying so, yeah I mean I. Think that's going to you know be a big issue and city just issued a lot of winterizing requirements today. As far as the barriers and everything, so you know I've already built them, that's what kills me they built them, because there was no guidance. There were no criteria. You know what Linda I got ta push back on a little bit, because I feel like there was well there. Wasn't it wasn't specific criteria? It was pretty simple to know that you couldn't build a complete structure. I think that that's a little right. The businesses, who did that in my opinion, needs to take a little bit of responsibility because they did do something that they had to know was not going to be acceptable. It was Andrew, wasn't it didn't? They say 50 really from the beginning of outdoor. You know. Yes, if you yeah so those requirements since the tenting requirements came out. You know, that's always been in place. I mean that's right. The overall arching issue here is that people are desperate and when people are desperate, they'll do anything they possibly can to try to survive and the lack of adequate support is people pushing people into desperation, and then they start seeing another restaurant do it and it's that domino effect or it's that copycat effect where people say oh they're, doing that, I'm going to do that as well. So you know just to add to that. Like I said from my perspective, I have seen zero enforcement. You know we had the them come by maybe a month ago, to check on not a month ago, maybe two three so to check to make sure we had the signs posted for contact tracing how many people were allowed to have inside what number you could call if you felt like there was a violation and by the way I've been to a lot of restaurants or walked by that. Don't even have these signs posted and you know there was that thing that Linda you sent us that you know those people didn't have it I call boo on them, because everybody's known about this they should be doing. This is really something that the businesses need to take responsibility for that this has been over a month. We've been open for indoor and, if you're not doing it, you're just not doing it right, because it's not important to you, that's my opinion, and so, but there's a lot of place not doing it. Like I said this, it seems to me the lack of enforcement is why you get these issues, because the city is. Do you feel that those gas heaters inside enclosures are dangerous in terms of having too many fumes? And that's right? There would be no gas heaters inside of enclosures. That's very supposed to be. People know that yeah again and there's very in the FDNY has been going on a rampage I mean the fbny is really been going out. Yeah, it's been the ones outdoor in the outdoor seating; they have them a lot of them, but the ones inside. What I'm seeing is that yeah, it's 12 pack, that should only be that should only be electives. Okay, sorry, so you're not dealing with you know the fumes yeah, that's great I could go on fire in a heartbeat. You hear about the suggestion of lowering music, because people have a propensity to speak louder when there's louder, music and then the transference of the virus. Did you hear about this suggestion? No, the discussion of it was a it's voluntary, but asking establishments to lower music. So people don't have to project I. Think that's just the product of people getting drunk, yeah I think that's right and that's the implied the implication of the 10 pm and all these other right rules are concerning alcohol. You know and not having a structured meal when people are just having an unstructured social activity consuming alcohol as you drink more you get louder, you get closer. Your inhibitions come down. You go from one table to the next, because I've heard this. Yes, you know well one thing: I'll just say: oh, go ahead, Linda I would just say you know one thing you know it was the New York Times editorial. That said, keep schools open, close restaurants and there are obviously many issues with being indoors. Issue is to put in perspective. Restaurants have been open indoors in the state of New York outside of New York City at 50 occupancy since June and the infection rate continued to go down. Many of the studies that are being cited, like the big one that tracked mobile phone activity, were conducted between March and May, and those were happening in places around the country. Meanwhile, New York City was shut down. We didn't even have outdoor dining in that time frame. So a lot of, what's being positioned or, what's being said or what's being blamed on restaurants, they still haven't even put forward the contact tracing data on it. So I think we should be somewhat suspect about some of the claims where you see clearly and if you read the Washington Post article that so much of what's happening is coming from social gatherings within people's homes. Social groups are starting to expand, they are more comfortable being indoors and there really is a lack of any enforcement on personal activity outside of commercially regulated spaces other than the governor tweeting knock it off. But then you see Joe Borelli, the councilman from Staten Island, who said basically Fu Cuomo, De Blasio, I'm having a huge Thanksgiving party, and then he doubled down today with a daily news, op-ed saying how he's going to be doing all of this despite all of the rules and requirements. So it's a big problem, I think of personal lack of responsibility where there is absolutely no enforcement at all and I just feel bad, especially if the restaurant owners now people are starting to be. You know, there's a scapegoat on all of this. You know, meanwhile, just to put numbers in perspective. Pre-Pandemic. There are more than 300,000 New Yorkers employed in food and drink places after the shutdown in March that dropped from 325,000 to about 90,000. Since then, with outdoor dining and now 25, indoor dining we've brought back about a 90,000 people or about 100. You know 80,000, so we're still 150,000 people out of work, shutting down indoor dining means at least you'd. Imagine about 90,000 people are going to be back out of work. There is no federal unemployment enhancement, many people, as you know, working in restaurants if they're out of a job they're not even eligible for unemployment. Many of them are low-income workers, immigrants, minorities and a lot of the talk about. Oh, we just need to shut down. The restaurant sometimes puts out the economic and social impact that this is going to have on people's lives, and many of those people's lives are people who are the most vulnerable and I know the city and state: don't have money, but it's really close to criminal. What the federal government is doing. They have not passed the restaurants I mentioned earlier. They are solely focused on these two seats in Georgia, and I've been saying anyone calling for just closing things down without fighting to couple that with getting money to shut things down like they're doing all throughout Europe, like they're doing in Canada like they're doing in all these places is just horrible and I mean I. Don't have the answer necessarily other than the federal government acting Andrew in Europe. They have systems that actually protect the people and give them money and give them health care, and we don't without what he meant exactly. Well that that's my point, and they have just you know, have not done anything and it's really just devastating, and now you know I, you know, anyways I won't get into my political opinions other and other than saying that New York Times editorial has created a lot of problems. In my opinion, a lot of virtue signaling from folks that will continue to earn a paycheck, while other people are completely losing their livelihoods and unable to feed themselves and their families. Listen, I'm sorry to interrupt, but I'm going to have to bail out I've just made Christian the host of this meeting. You guys can continue to talk. This is fascinating. I wish I could stay, but thank you very much. Everybody have a nice weekend have a good weekend. Can you summarize a little bit more about the restaurant act and I mean I assume it's not going to happen until the new administration and then the congressional office, but yeah, and also, if there's any there's been any progress in the business interruption. Lawsuits sure further, there's one yeah so on the restaurants act. It is bipartisan legislation it passed through the House of representatives in the Heroes act, which was passed last month as the giant stimulus, there's 49 senators U.S senators signed on to the bill, so it's bipartisan I mean Lindsey Graham's on it, but it's being held up by Mcconnell and a handful of the conservative republican senators. Part of it is that I think it's part of this much larger stimulus package that the Democrats want because they passed it through the house which they control, where the Republicans don't want. That big of a package, but what the restaurants Act is a bill that would effectively provide restaurants, the difference between their 2019 and projected 2020 receipts for the covered period, which is basically when it was called a state of emergency. You know throughout the year and the money would be able to be used for rent payroll vendor expenses, and it is a straight grant. It's a revitalization fund which is different than the Ppp, the paycheck protection program, which was a loan right that was converted to a grant only if specific conditions were met and one of the problems about those conditions, particularly for restaurants, was that it was tied to hiring back your staff to approximately pre-pandemic levels. The problem is when you're operating a limited capacity or you're shut. You clearly don't need pre-pandemic staffing levels, so they're hiring people back artificially, which was also really challenging, because a lot of people didn't even want to go back to work because at the time they were making more money between state and federal, enhanced unemployment. So you know that that's the bill, and hopefully you know it can get passed. I, just don't see anything happening right now, I mean it's just really trying and the state and the city are broke. You know you see in here the financial situation we're in so and the business interruption, any yeah I mean there's been a couple of there's been a couple of. Oh sorry, there's been a couple of the deputy director there yeah exactly I'm the boss, but she makes all the decisions in the family. There's been a couple of lawsuits, some negative, but a couple recently that were more positive, there's another one that may come out soon. That would be positive and we'll see what happens there as far as the legislation as far as the legislation goes see. This is why it's so important to have in person schooling, but you know the legislation who knows the federal bill requires the federal government to backstop the insurance industry, which is again caught up in all the federal politics. The state bills are there their support, but you know they're stuck, but in committee from the powers that be so I, you know I think the restaurants act yeah. No, a lot of people are very upset about it. I can hear no she's an outrageous sorry about that. Thank you. Okay. Everybody have a good weekend today. Okay, bye, everyone hi, everyone have a great weekend, bye.",
            "summary": "I mean I, know, I, have an enclosed cafe right now, but I was wondering and hoping to be able to add few tables on 71st street I took measurement.\nI mean I, don't think going to be many, but.\nBut a group of owners led by the landlord, is coming in to keep Atlantic Grill Alive and to keep it going, and so this is what we call transfer application, meaning that it's a purchase of the business.\nI'm, going to answer in two seconds just to answer Christian's question right before you know.\nIs it doing it's doing not great, just like any other restaurant right now is not great.\nA new owner wants to come in and operate a business that has a liquor, license.\nIt's, very prominently, located, and it says a lot about our community that you're going to try to make a go of it, and we hope that we can support that.\nYes, I was wondering how you reacted to the 10 o'clock curfew and whether or not you feel that is a further problem for your restaurants and others as well, and what exactly we achieve by having a 10 o'clock.\nI personally think that this is a precursor to a shutdown and that you know.\nI think that gets like it's a little bit.\nYou know misrepresented that the president has control over what New York state can do or New York, City and so for non-federal agencies.\nI, just I, don't know, but I just feel like.\nThe restaurant act, though, is I, think is on the back end of that.\nAnd I know that they think that again my opinion that shutting something down in two days is going to slow, it.\nExactly I know it's like it's crazy.\nIf you're enclosed more than 50, you have to be treated like indoor, dining, right.\nSo to check to make sure we had the signs posted for contact tracing how many people were allowed to have inside what number you could call if you felt like there was a violation and, by the way, I've been to a lot of restaurants or walked by that.\nThat said, keep schools open, close restaurants and there are obviously many issues with being indoors.\nRestaurants have been open indoors in the state of New York outside of New York City at 50 occupancy since June and the infection rate continued to go down.\nAnd I just feel bad, especially if the restaurant owners now people are starting to be.\nWe're still 150,000 people out of work, shutting down indoor dining means.\nThere is no federal unemployment enhancement, many people, as you know, working in restaurants, if they're out of a job they're not even eligible for unemployment.\nAnd I know the city and state: don't have money, but it's really close to criminal.\nI, you know, anyways I won't get into my political opinions other and other than saying that New York Times editorial has created a lot of problems.\nI, just don't see anything happening right, now, I mean it's just really trying and the state and the city are broke.\nYou, know, I think the restaurants act."
        }
    }
}