{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCwx7Y3W30N8aS_tiCy2x-2g",
            "title": "2020.12.02 - CB2 Economic Development & Employment Committee Meeting",
            "publishDate": "2020-12-02",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nEconomic Development \\u0026 Employment (ED\\u0026E) Committee\\nMonday, December 02, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:25 - Roll Call \\u0026 Introductions\\n00:02:22 - Approval: Agenda\\n\\n00:02:48 - Presentation \\u0026 Discussion: Brooklyn Navy Yard Development Corporation (BNYDC)\\n\\n00:26:50 - Chair's Report\\n00:34:04 - Other Business\\n00:38:00 - Community Forum\\n00:40:33 - Approval: November 2020 Committee Minutes\\n00:41:05 - Motion to Adjourn",
            "lengthSeconds": "0:41:32"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "1IOZBDKi1Q8",
            "fillerWordCount": {
                "uh": 104,
                "um": 122
            },
            "readTimeFullTranscript": "24 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "yard": 37,
                "businesses": 18,
                "jobs": 14,
                "job": 13,
                "development": 12,
                "efforts": 10,
                "employment": 9,
                "workforce": 8,
                "opportunities": 8,
                "chat": 7
            },
            "wordCountSummary": {
                "yard": 11,
                "development": 4,
                "businesses": 4,
                "space": 4,
                "efforts": 3,
                "workforce": 3,
                "updates": 2,
                "employment": 2,
                "operator": 2,
                "chat": 2
            },
            "fullTranscript": "Okay, this meeting of the sorry this meeting of economic development and employment Committee of the Brooklyn Heights Board 2, is called to order and is being recorded for public access and archiving in accordance with the New York order meeting law. It is the practice of CB2 to conduct remote meetings with all committee members cameras on. We encourage public attendees to also leave their cameras on, particularly if you are given the floor to speak all attendees. Please keep your microphone muted when you are not speaking to maintain appropriate discussion and voting process. I will make it known when and which topics are open for comment by committee members board members at large and the general public. If you have questions that fall outside the public comment time. Please type your questions in the chat panel and we will address them if relevant to the matter and as time permits may also email the district office at any time. We are committed to providing access for all of our neighbors, regardless of physical ability or limitations. If you require accommodation or assistance for full participation, please contact the district office 72 hours before any public meeting. Okay, the committee secretary, unfortunately is not available, but may I have. Can you do the roll call? No problem? Okay, thank you. Bill Fenoy! Yes, I am here Denise Peterson. We just had her Denise Peterson President, hello, Catherine Gilman is unable to attend Ron Cohen yep, I'm here, Lindsay, Einhorn, Lindsay, no Jessica, crazy, she's, sure she's, beautiful she's here, Clonida Medley, Meisha Morales, here, Latrell Maso, here, Celeste Satan and Catherine Yearwood young hi, Kate, hello, okay, excellent, okay, thank you! Okay! With this okay, we will now go to the meeting agenda. Let's see now well, I needed approval for the agenda. May I have a motion: okay, Yearwood and Second Denise Okay Denise Peterson. Thank you. Okay. Tonight we're having a very short agenda. We're gonna have a presentation today by the Brooklyn Navy Yard Development Corporation Regina Napoleon Lindsey is the executive director of workforce development and she will give us an update on what's going on at the Brooklyn Navy yard Regina. Yes, thank you. Thanks bill, hello. Everyone good evening, I, wanted to just share some of the updates happening on the yard regarding economic development and employment, particularly around the impact that Covid-19 has had on yard-based businesses and our efforts to help businesses weather the storm and our workforce development efforts. So I wanted to share a few updates and I'll start with kind of what we've been up to since Covid-19 has begun and how we've been kind of navigating. So many of you know, or have heard, that the yard has produced quite a bit of PPE, especially during the height of the pandemic, about 10 million pieces of PPE and 26 gallons of I'm sorry, 26,000 gallons of hand sanitizer. This sanitizer has been produced on the yard and I'm going to go over quite a few data points. So if there's any more granular details, anyone has, please feel free to stop me and ask for more detail or clarity and regarding ppp funding. As you know, there was a initial stimulus that went out to help small businesses and the yard was able to secure over 10 million dollars for yard-based businesses that was earmarked for specifically for yard-based businesses, with the average award amount being about a hundred and four thousand dollars for each business and those were via our partnerships with Goldman Sachs via Pursuit Lending and Carver National bank. The impact Covid-19 has had on yard-based businesses. There's only been about a handful of businesses that have left the yard, with the vast majority of those being those that were gearing up for retirement. But we've had quite a bit of like weathering the storm efforts that we've had some of you that may have noticed that there are masks being produced by yard-based businesses being sold in Wegmans I dropped a link for the holiday market, actually I, don't think it length. Let me just send that again, but for our holiday market there's about 33 yard businesses participating. Oh someone dropped it in there. For me, thank you participating in that and all the products are being made on the yard by yard manufacturers, and additionally, we've had a. We did. Our first online art, sale and a fundraiser for it was called small works for big change and that ran from September 1st, through October 31st and featured about 30 artists on the yard and they're raised about 7,000 in direct sales to artists and I. Just wanted to kind of move on into some equity incubator. Is that okay to just keep going, or did anyone just keep rolling all right? So we have an equity incubator. You may have seen some of that in news. We are currently have a rfei or RFP or operator to lease and build out and operate the space on the yard, and the goal of this is just to leave space and to support an operator run incubator to accelerate specifically nwbe entrepreneurs and businesses, and so the link for that is also in the chat called build a future NYC there. So you can take a look at that and due to just a tremendous amount of interest, we've actually extended the deadline to respond to the RFP from this Friday December 4th to January 15th, and I'm going to kind of move into the workforce development space. So since Covid-19 began about March 15th, the yard spent much of its operations administrative operations remotely, including our workforce development efforts, so we've had about 471 hires and that included some of the early hires that we had in Wegmans and 88 of those were Brooklyn residents. 30 were NYCHA residents, 23 were long-term unemployed and about 18 percent were had been previously involved in a justice system. So still very mission focused on our hiring efforts. 79 of those job seekers were specifically connected to jobs, producing PPE on the yard, and that was from March through July and in total, just to kind of aggregate. Our Covid-19 numbers about 176 out of those 471 came during that period from March through July, with a little over half 51 being permanent jobs additionally, just kind of since then we start our fiscal year in July. So our efforts since July to now I wanted to share a little bit of what we've been up to there. We've had about 89 hires since July, and our projected numbers, probably through the end of the year, would be about 216, so not quite as high as they've been previously, but still pretty strong during a pandemic. 83 percent of those so far are full-time jobs, there's an average wage of about 17 a little shy of 17 about sixteen eighty. Ninety three percent of those are Brooklyn residents with about sixty percent being from our hyper local catchment area, and twenty two percent are NYCHA residents as far 29 are long-term unemployed and about 11 have been previously in job involved in the justice system and I also just wanted to share some quick points on some of the new initiatives we're trying out. So we started some workforce development training. We have two training programs that launch that will focus specifically on upskilling and advancing incumbent workers on the yard. We started with incumbent workers for two reasons: one. We think this is a great way to incentivize employers, to upskill, their current workforce and create on-ramps to higher paying higher skilled jobs, and also it leaves some room if you will for entry-level opportunities. So we can create room for those who have not yet received upskilling to have an entry-level opportunity on the yard. Those consist of two management training cohorts that lost for launch for junior and senior managers, we're in our third week of training, and we have participants from about nine companies, and we also launched a cnc training in January that will have about eight participants so that we can observe social distancing and then we also started an internship to employment pilot program and it's going to pilot in early 21 and we have 40 recent CUNY graduates and internships and they will continue into potential employment opportunities with a six-month monthly wage subsidy by the yard and we're working with CUNY to scale the internship to employment to a citywide model that will be run by CUNY Central. Additionally, we have about 25 college students that will be in credit based internships, beginning in the spring, well, the spring semester. So beginning in January- and some of you may be familiar with the Brooklyn steam center, it's the career and technical school high school that operates on the yard and they are currently operating in a full hybrid model from October, November and now fully remote, but still offering work-based learning opportunities remotely with yard-based employers. I just wanted to share some of those, and if anyone wants any more granular details, please let me know: okay Regina is that it is that your full report- yes, I'm sorry, yes, that's it I did I felt like I was giving a lot of data, so I wanted to just slow down and see if there was anything that you wanted to ask any questions about, but happy to share more. If you look, I got to be honest with you Regina. This report was a lot better than I thought. I assumed that there would be a job I assumed there would be job office. I didn't expect you to be hiring I didn't expect you to be hiring so many people throughout the area, especially within the catchment area. Yeah. Okay, did you what was the yeah? We've worked really hard to. Oh I'm, sorry, it's a delay. I apologize go ahead, no problem. What was did you have run into any problems as far as hiring employment interviewing things along those lines? Yes, we did have to figure out the remote style of being able to screen candidates for employers. We, like you, have discovered issues with some technology versus others, and so we figured out kind of the right ways. We are currently offering our information sessions still offering it weekly we're doing it remote and for those that don't have access to smartphones tablets, computers, we are doing phone screenings to make sure that folks can still get enrolled. We were beginning to do on-site screenings as well for those that really needed it, but with rising Covid-19 numbers. We now stopped that as of last week, so that we're back in a full remote system, but it's worked well. So far, we've had a little over 400 people still enroll, so our numbers have still been pretty good, not as high as they were. Some people are probably still adjusting to. You know technology and not being able to just walk in, but pretty good, but still being able to connect to our kind of candidate pool. We also launched a newsletter that goes out bi-weekly to kind of help. Keep folks engaged with what's happening on the yard, with new opportunities, so they can directly apply to open roles. Okay, that's very good. Yeah I was wondering how people were connect, actually communicating with you if in fact, they didn't have access to the internet or a computer. Okay, so I was wondering how you were handling that and it seems like you were doing very well, but now that in-person interviewing is not going to concur. How do you think you continue to reach out to those individuals? Well, frankly, we honestly just started doing on-site training. We only had maybe two days of it, so it really wasn't an adjustment since March we've been 100 remote. With the exception of a couple days, we've had a couple of mass hiring efforts and when the weather was warmer, we did that outside, so that we can allow for social distancing, use picnic tables so that it was six feet. Apart with our- and you know, our staff sitting on one end and candidates on the other and more than willing to do that again would probably be using one of our vacant spaces so that we can observe social distancing as well. We haven't had the need, though, since most of our hiring efforts have not been masked, so we've been able to do one-on-one screenings either. These you know virtually I didn't want to plug any particular software over, but virtually or over the phone, and then be able to allow candidates to go on a yard to interview directly with employers. Now the permanent job placements that you mentioned, what are the? Where are they involved? Where are they located in what specific fields? I'm sorry, you cut out a little bit. Did you ask what fields the jobs are? Yes, exactly for the permanent jobs cross sectors, we've seen a rise as you can expect in traditional manufacturing. So a lot of cnc work, which is made, which was part of the you know, inspiration for starting our own kind of training for this and we're piloting it with incumbent workers, with the hopes that we can offer it to community as well. We've seen production sowing go with an increase, we've seen a lot of increase in digital marketing and sales, so across a range of sectors. Okay, thank you. I'd like to remind everyone that, if you do have cameras, please turn them on. Thank you. If you have the ability to do that. Okay, any other questions from any committee members I just wanted to say thank you to Regina and that the report was well stated and I'm glad to hear all the particulars and to know that you know there are some things that are still functioning well amidst the place where we are now with the pandemic and everything so I appreciate your being able to come on to share that information with the committee, because we love getting updates and we love good information that the community truly benefits from, and so I can't appreciate. I can really appreciate it. So thank you so much for that. My pleasure I'll also put a link to our information session in the chat as well. Thank you. So much I see that quite a few links have been dropped. So thank you for that. I'll put a link in there if it's not there already, but thank you guys for having me no problem. Thank you. Also. You mentioned the newsletter. How exactly are you Disre distributing your newsletter, the bi-weekly newsletter? Oh thanks so once candidates enroll and they participate in an information session, they're automatically signed up for our newsletter since they're part of our candidate community, so they receive that via email, bi-weekly. Okay, are you sending that also to the community board? I? Don't think so because it's currently only going to the candidate pool, but I'm happy to add you to the distribution list. If you'd like to be on that I think you guys get the open opportunities, but not the newsletter. But I can add you to that list. Yeah I noticed that, apparently there are 17 current openings for jobs, yeah, it might be I will I see that someone listed 13. so I, don't know the exact number just yet, but I want to keep in mind that those are the roles that we are maybe more proactively recruiting for. There's always a few others that we, if we have already in our candidate, pool the first people we reach out to are those who applied. So, for instance, if we have a driver opportunity- and we know that we have you- know 50 drivers in our candidate pool- we don't necessarily advertise that to have more people enroll. We want to make sure we prioritize those folks who opted in so that they get first priority, and it's only when we think we've exhausted. Our businesses may want to see additional candidates with a certain skill set that we'll start to put those out. So we always encourage people to enroll so that they can learn about the opportunities first and we'll have an opportunity to be able to source them directly from our database. Okay- and you mentioned also the build a future- the RFP, that's what January 15 deadline. Can you give a little more detail about that? Yes, so it that's being run by our development or the responses are going to our development team. But there is an email address inside that link and I'll. Take that out and drop it in the chat as well. There's an email address on the website so to keep the process. Honest I can't answer too many questions about it because it has to be a forum process but we're creating the an acuity incubator because we'd like to be able to have kind of a startup model similar to other incubators that are on the yard and off the yard that will help grow, particularly nwbe businesses, and so we're currently right now looking for someone to operate that on the yard. Okay, thank you. That's the detail. I wanted I appreciate that. Okay, any other questions from any of the committee members or board members. This is patrol I have a question. No. First of all, your presentation was beautiful. Thank you for covering everything. Are the jobs limited only to the Brooklyn Navy yard? Well, yes, and no. We do help support some of the very local businesses. So we've had businesses like in Dumbo, or you know, Fort Greene area reach out and we will support, but we do primarily try to focus on the Brooklyn navy yard, so I would say about 99 of the businesses that we support, hiring efforts for our yard base and that's both just from our own internal capacity and also trying to make sure that the economic opportunity on the yard is what we're focused on connecting to you know the communities outside of it also. Is there a waiting list for the people to apply for you for the outreach for jobs for individuals, not a waiting list? No, but we don't guarantee placement right, because the businesses ultimately still make the hiring decisions. We act as a business intermediary, our team kind of gets to know the business. We have a home court advantage if you will, because we get to kind of get to know them and go in their businesses. So we'll know if there's an office cat or you know if someone is looking for a jack-of-all-trades and that may not be quite listed in the description. So we try to help candidates prepare for those conversations. We can't guarantee them, but we do guarantee that if you're in our candidate data pool you're the first ones we go looking for, we offer resume workshops, writing workshops and we're doing that virtually so. If we feel like a candidate's resume is not really advertising their skills best or leveraging their skills, then we'll help them try to create a new one if they like to opt-in so that we can create a better marketing material, even if you're not going to go for a job on the yard. At least you have a better. You know marketing tool for jobs outside yards, so we do what we can to make sure that every person that we put in front of a business is job ready and every person. Excuse me hello. If there's someone who's, not muted who's, currently talking. Could you please mute yourself? Thank you and I have one more question: do you know about the progress of the individuals when you hire them like to keep track of them and they grow etc? Not quite the same way, a lot of traditional workforce development agencies do because we're not. We don't have like case managers, but we do retention checks. So at milestones we track. We reach out to candidates at three six and twelve months to see how their job is progressing. If they're still on the job, if they're not in the job, have they found other employment? Would they like us if they're not in that job or even if they are? If it's not maybe going as planned, could we you know? Would they like us to still share new opportunities with them? We have kind of acted as an intermediary or a mediator if things are not going well to give people kind of coaching on how to navigate or in some cases speak to businesses, if we feel like there's something, that's been miscommunicated, so not quite traditionally, but we definitely do check, especially at those milestone marks, to see how things are going. Thank you so much and thank you for your great presentation, my pleasure. Thank you. Okay, any other questions for committee members or board members. They just have a quick comment. I really appreciate you giving the percentages on disadvantaged communities that you've been employed. Are there are you kind of at your goal, or are you trying to increase the share of new hires that are, for instance, in public housing or that have been involved in the criminal justice system? Are you have you reached your girl, or are you trying to increase that number? A great question so for our previous fiscal year? Yes, we were at our goal, just to give you an idea for some of the areas where we still have some efforts to be made. We try to get at least 60 percent of our or make sure at least 60 of our job opportunities are going to residents in our local catchment area, we're at 58 right now and our percentage of NYCHA residents that we try to make sure are employed is or our goal is 25 at least we're at 22 right now, but in other areas we've exceeded, as you can imagine, unemployment rates are higher, but particularly long-term unemployed. Our goal is about 15 we're at 29 and previously justice involved. We try to make sure that's at 10 we're at 11 right now so great question. So much and just an idea. We try to make sure 80 are full-time jobs like it's really not our goal: to get people temporary employment and we're at 83 right now, so we do still try to focus on job quality which is like. Does it offer health care? Is it long term not project based Et cetera? So there are some areas where we're still you know kind of chasing the carrot a bit, but other areas where we've been able to kind of double down and make a you know make up for some ground. Okay, thank you for asking that question: Brian, okay, Regina! Thank you very much. It was so good to hear something upbeat in a time when we have so much we're hearing so much bad news in the district to hear someone. That's actually hiring adding numbers. It's good news! Thank you very much for appreciate that Regina I'll probably get in touch a little bit later about some other details, but if you you're more than welcome to stay yeah and listen to the rest of the community meeting well, thank you I! Actually, I can stay on for a few more minutes. I have to drop by seven, but thank you guys both for adding I'm going to add a couple of the links I mentioned in the email address and the chat, and but if there's any other, questions feel free to send me a message. Okay, thank you. Okay, with that we'll move on to the chairpersons report, my chairperson's report is going to be extremely short first off. What I want to do now? Is the committee members I want you all to focus on anything that you are interested in pursuing within the parameters of our committee? I've asked a few committee members already what they're interested in looking into based on. What's going on with okay, the current okay, sorry with the current economic and employment situation right now going on in our district. Currently, right now, we're probably gonna see some things change once the actual virus is starting to. We start having the people starting to get well. We're probably gonna, see things break in March going into June. Okay, now that we have a vaccine so based on that, I'm expecting things to turn around basically starting in June. It would like to be nice. It would be nice if we get ahead of that and actually start looking at possible things that we can do for individuals as they come back into the workforce and the economy in general. So if anyone's interested in anything at all within the district by all means, please let me know so you can start these start actually setting up these presentations beginning in January, okay, and with that also I'd like to offer an opportunity for Denise Peterson to actually give us an update. Also, she sent out a email but Ms Peterson, if you're still on, if you'd like to give us an update on the resource, fair I appreciate that I am still on. Thank you, Mr Fennoy, so I did send a little quick email out today. So for those who had the opportunity to read it tell ya, I'm sorry, I meant to cc on Ccu on that email and I will forward it to you tomorrow. So we are going to begin moving forward on the plans, and so we know that the plan means just that. It's a plan and the plan would have to coincide with what's happening at the time. But we're going to move forward with the planning and we're going to be looking at the first and or second week in June. I did have a conversation with Regina and we agreed that that's probably a great month to target, and we hope that some of the pandemic matters are behind us to some degree that we can at least whole day an employment and resource fair, still looking at. If it it's able to take place indoors, that it would be still under consideration to use the space that was offered, if not Regina brought up a good point and that maybe depending on where we are at the time that it could be something that can take place on and outside. You know nicely laid out to an outside area, since it would be a good temperature for the month of for the month of June, so I'm I need to find out how those who were serving on this small group, the small grant, this, the small planning group that I can you know, maybe link into some platform of sorts, and we can talk through that, as opposed to just on the phone or by email. If anyone want would like to start out with sending me some, maybe new ideas or different ideas, you know we can have discussion. You know about. That would be great too and that's it any questions so just be clear. We want to first start off with a small group within the committee, approximately one or two people, maybe one person else in the board whoever's interested in it. So this is basically limited to people with on the board community Board to board. Is that correct, yeah? Okay, perfect, okay! Now is there any questions in regards to this from any committee members or board members? I know some people worry about who's, this police, I'm sorry I, was wondering if I could be part of the planning committee as possible. I, don't see anything wrong with that, but let me just double check. It should be a should be very. We should be able to have you on board. It's not gonna, be a problem right, I'm sorry and that's fine, but and it would I guess to depend on those who have been on it from day one what their interests are, because, if they're still interested, then it could potentially be too many people on the small group part of it before it gets to the greater committee. So we have to take a account on that to see Jessica I know. Miss Yearwood is working on some other specific project for the community, Board and Latrell, and is consistently interested and so I guess you know whatever that number is for the small group. We will take a look at where that is and we'll be glad to have you. Thank you. Okay, thank you. Miss Peterson! Well, let's get this done as quickly as possible, and the timing would be perfect because, as I mentioned coming in June, we should be coming out of the cove at lockdown and the economy should be starting to pick back up. So the timing would be perfect if we can do it, then, okay, and that will that's my chairperson's report. I, want to keep this brief. I'm looking forward going in January and as far as December is concerned, we're in the holidays right now. So I'd like to believe that everyone's looking forward to the holidays, okay, is there any other business to be discussed any new business that anyone wants to bring up I wanted to it's my show. How are you guys I just wanted to share something at last month's community general meeting I forgot their names, but the ones who are developing the housing component of Atlantic yards made a presentation last month and I asked a question. Excuse me about their hiring and how they're going about it, especially not just construct construction jobs because they're temporary, but with all this development going on there like the permanent jobs, the maintenance and those types of things, and so they basically said that they were I asked if they were working with any local organizations or the Navy yard for local hiring, and they said the ones that are doing the hiring of 32bj. So I was wondering if we could possibly have 32 BJ come and represent to us so that they can answer whether or not as far as what are they doing. Excuse me, as far as the yards and the how end of the jobs for our deal yeah Ms Morales. We did an outreach and that's not something that we're it's not something that can be set up at the moment. It may be something we can do in the future, but at the moment we can't do that. I was going to ask him to present to this meeting, but unfortunately that was not something that could be done, but I did look into it. Okay, thank you. Okay, no problem. Anything else I just want to add to that. In fact, yes, Miss, Morales and I talked about that as well, and so I think that what has happened or stated during that presentation is what happens at a lot of some of these construction sites. The workers that were hired or was hired or could be hired. Sometimes there is some collaboration with the union that they would come through BJ or they would be union. It's a lot of technical stuff there, a union workers that are already in 32 BJ or those workers who get to be employed outside of 32 BJ but then join 32 BJ makes it up here. So it's a quote: 32 BJ project, maybe, and so I- think that we may want to go back to the presenter from last month and say: well, that's not exactly how it works so who can speak to us about it? Is it the Empire State Development corporation? It just seems that somebody needs somebody should be positioned to come and address that part, be it for Pacific park or some other areas where development is going on that entity. That reported last month is connected to we'll look into it. Yeah we can do yeah, okay, any other business to discuss. Okay, we'll go to community forum, Mr Flanoy I think it might have just gotten buried. I just wanted to your attention in the chat box. Yes, statement received. Okay, yes, I saw that yes, I appreciate that okay. Is there anything else as far as community forum does anyone wants to speak? You have two or three minutes to do that. Just if you can enter it in the chat. That'd be perfect. Mr, Mark S has a question mark. You have two minutes, and this is a comment. There's no questions! Oh hey there. Can you guys hear me hello. Just looking around okay, hey yeah I was just wondering I, don't know if this was the right time to ask, but in regards to, like the master plan, I know that was included in the last email from the community board, showcasing like the three properties that are being added to the yard in terms of like office, space and so on. I was wondering if someone had more information on that, like what the timeline is as to when they want to start construction, and if there's you know, gonna be parking and just more public space added to it and if there's anything else that could be added to the Navy yard. I know that there's a space or I guess there's a lot next to like the naval cemetery, where you know there is a small walkway, but I was wondering if there could be like a larger park. Added to that as well. But okay, yes, I, hear mark. As far as that's concerned, we don't have an update as of yet for that when I do have an update, I will let the public know and also let the committee know and we'll make an announcement, but there were no updates to be given for that gotcha. So there it I'm guessing. This was just added to show that, like the Navy yard is still interested in doing it and that you know I, guess they're, okay, I see somebody updated something: okay, yes, just click on the link mark and you'll get your information need. Okay, is there anything else, any other community for any other individuals who want to speak at the community forum? Okay, if not, then we'll just move on with the agenda next I hope everyone got a chance to read the minutes from last month. Are there any corrections to the minutes that we need to add? I'm Ron I can't hear you you're on YouTube, okay, no problem. If there's no correction, then I'm going to assume that we can approve the minutes by consent. Okay, with that we're now at 6:51, I will accept a motion to adjourn okay, that's Ron, Cohen, second Mr Wood. Okay, with that I want to wish everyone a happy, safe, holiday and I will see you in the new year.",
            "summary": "Okay, this meeting of the sorry, this meeting of economic development and employment Committee of the Brooklyn Heights Board 2, is called to order and is being recorded for public access and archiving in accordance with the New York order.\nWe're gonna have a presentation today by the Brooklyn Navy Yard Development Corporation.\nEveryone good evening, I, wanted to just share some of the updates happening on the yard regarding economic development and employment, particularly around the impact that Covid-19 has had on yard-based businesses and our efforts to help businesses weather the storm and our workforce.\nWe are currently have a rfei or RFP or operator to lease and build out and operate the space on the yard, and the goal of this is just to leave space and to support an operator run incubator to accelerate specifically nwbe entrepreneurs and businesses, and so the link for that is also in the chat.\nYou can take a look at that and due to just a tremendous amount of interest, we've actually extended the deadline to respond to the RFP from this Friday December 4th to January, 15th, and I'm, going to kind of move into the workforce development space.\nSo since Covid-19 began about March 15th, The yard spent much of its operations administrative operations remotely, including our workforce development efforts, so we've had about 471 hires and that included some of the early hires that we had in Wegmans and 88 of those were Brooklyn residents.\nThey are currently operating in a full hybrid model from October, November and now fully remote, but still offering work-based learning opportunities remotely with yard-based employers.\nSo, a lot of cnc work, which is made, which was part of the you know, inspiration for starting our own kind of training for this.\nOkay, any other questions from any committee members I just wanted to say thank you to Regina and that the report was well stated and I'm glad to hear all the particulars and to know that you know there are some things that are still functioning well amidst the place where we are now with the pandemic and everything.\nSo I appreciate your being able to come on to share that information with the committee, because we love getting updates and we love good information that the community truly benefits.\nLooking for someone to operate that on the yard, I wanted I appreciate, that.\nWe will support, but we do primarily try to focus on the Brooklyn navy, yard, so I would say about 99 of the businesses that we support, hiring efforts for our yard base and that's both just from our own internal capacity and also trying to make sure that the economic opportunity on the yard is what we're focused on connecting to.\nWe feel like a candidate's resume, is not really advertising their skills best or leveraging their skills, then we'll help them try to create a new one if they like to opt-in so that we can create a better marketing material, Even if you're not going to go for a job on the yard.\nYou know marketing tool for jobs outside yards, So we do what we can to make sure that every person that we put in front of a business is job ready and every person.\nOkay, any other questions for committee members or board.\nOkay, any other questions for committee members or board.\nI have to drop by seven, but thank you guys both for adding I'm going to add a couple of the links I mentioned in the email address and the chat, and but if there's any other, questions feel free to send me a message.\nOkay, Sorry with the current economic and employment situation.\nYou can start these start actually setting up these presentations beginning in January, okay, and with that also I'd like to offer an opportunity for Denise Peterson to actually give us an update.\nWe want to first start off with a small group within the committee, approximately one or two people, Maybe one person else in the board whoever's interested in it.\nThink that we may want to go back to the presenter from last month and say: well, That's not exactly how it works so who can speak to us about it.\nI was wondering if someone had more information on that, like what the timeline is as to when they want to start construction, and if there's you know, gonna be parking and just more public space added to it.\nThis was just added to show that, Like the Navy yard is still interested in doing it and that you know I, guess: they're."
        }
    }
}