{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB5",
            "channelId": "https://www.youtube.com/channel/UCgclKg8oaVlkuCurCxo2hOw",
            "title": "Queens Community Board 5 February 12",
            "publishDate": "2020-02-12",
            "shortDescription": "The regular monthly meeting of Queens Community Board 5\\nFebruary 12, 2020\\n7:30 PM\\nChrist the King High School\\nMiddle Village, NY",
            "lengthSeconds": "1:50:53"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB5",
            "normalizedName": "Queens Community Board 5",
            "twitterName": null,
            "youtubeChannelName": "CB5 Queens",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC51mApBs4KUp4T8avIhyAnw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "1leBekjCSDk",
            "fillerWordCount": {
                "uh": 0,
                "um": 0
            },
            "readTimeFullTranscript": "50 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "years": 25,
                "work": 19,
                "festival": 16,
                "evening": 15,
                "police": 15,
                "table": 14,
                "days": 13,
                "motion": 12,
                "speaker": 11,
                "food": 11
            },
            "wordCountSummary": {
                "festival": 7,
                "state": 6,
                "years": 5,
                "police": 5,
                "food": 4,
                "bail": 4,
                "reform": 4,
                "project": 4,
                "law": 3,
                "controllers": 3
            },
            "fullTranscript": "All board members is supposed to be sitting in the horseshoe. If you're not I'm, going to come out and drag you back in yeah, well, Steve come sit with us. Please thank you, I'm, sorry. So before we get started, I'm sure all of you know that, as of March 1st, you will not have plastic bags to go shopping with. So we have some committee board five fabric bags here. If you need one and I stress that point, one to go shopping with your welcome to see Laura so make sure you have a bag. It's interesting to note that the only plastic bags available in the community after March 1st will be in a Chinese restaurant I'm. Sorry Tony! If you register as a restaurant, okay, so restaurants, that's a shame because I know some stomped have spent a lot of money on takeout boxes. It's a restaurant, but it's a takeout-! Thank you! Okay! So if everybody's got their and everybody can find this seat and then we'll ask you to stand up and the flag is to my right: I pledge allegiance to the flag of the United States of America and to the Republic for which it stands. One nation under God indivisible with liberty and justice for all. Thank you so just a reminder with the bags and the census. If you want a$ 28 an hour job, the census is hot, recruiting, census takers. If you have an organization that could help with census information, I have a couple of forms up here. Anybody could come up and sign in write catch up on my paperwork. The first item of business is the public forum. Do we have a sign- in please while we're doing that, I'll remind everyone that, even though we're meeting tonight today is the official birthday of Abraham Lincoln, the traditional celebration we have, we have something for the members. Okay, so Abraham Lincoln signed the Emancipation. Proclamation ended slavery in this country and he was a Republican we'll get back to public form. So again, no foul language, no personal attacks, no more than three minutes. This first peak speaker under the public forum is Chris Kozlowski. Please, the microphone is in the middle of the floor. Are you here, Chris kozlovsky, no, okay, second speaker, the next speaker is Crystal Wolf Crystal. Are you here doing no more than three minutes? Thank you. Okay, first and foremost, thank you so much for allowing me to speak and share this mission. My name is Crystal Wolf and I'm. The founder and president of a nonprofit called catering for the homeless, whose main mission is to rescue food access from catering companies, schools, restaurants and grocery stores for the homeless and poor we've retrieved about 40,000 meals for the food and secured so far of good food that would have otherwise gone to waste. We've also provided approximately 3,000 food pantry items, 5000 socks, 15,000, Coolidge, clothing items and 30,000 toiletries with the comprehensive on homelessness. I've written on visible neighbors I speak on a weekly basis at public meetings and Arthur talks to advocate for the homeless and educate thousands of people in the community on common misconceptions of homelessness, which keep us divided. I am continuing to work to alleviate the community's concerns so that we can work together to help our less fortunate neighbors catering for the homeless has provided services and education for most 100,000 people throughout Queens in New, York City in the past three years this year, I project that catering for the homeless will serve a hundred to two hundred thousand people in September of 2017 Senator Joseph Addabbo passed a food law that all schools from the pre- k to the university level must donate their food access to organizations like mine who can distribute it to those in need. I've been working to get the schools to give their food access. Since this law was passed, I invite the community to sign my petition to the deal we requesting them to comply with this law and allow schools to give the food access instead of throwing it away with 133 billion pounds of food going to waste each year. My goal is to feed millions of people every year and end hunger by utilizing what we have been wasting for those who have not I'm the author of several books in different genres, and my latest slaver of love will be released on February 14th in the origin of time. The second book in the creation series, a portion of all proceeds, goes toward this mission to end hunger. In addition, I'm the president of the Friends of the Maspeth library, and please find us on social medias under Maspeth library, friends to keep up- to- date with the free events we are offering to the community. Lastly, I was just voted in this month as the co- president for a beautiful nonprofit organization called together. We can. We are working on compiling a directory of nonprofits and Queens for constituents who are looking for services. We want to be the one stop shop for citizens, looking for youth groups, homeless, services and more. We also want to help nonprofits expand their network so that we can all grow together. My nonprofit has a hundred partners in its network so far. We can not do this work alone, but I believe that together we will end hunger and all the problems of our day if we are dedicated to being a part of the solution and each and every one of us can make a difference. Thank you again for your time and for allowing me to speak and share this message. Happy Valentine's, Day, Thank, You Kristal. The next speaker is common Santana, okay, good evening everyone. This is an open letter to Camille Watt lamp is elected official arrow in the mid to end of 1990s I, along with other community members advocated for greater entry, Youth Council in support of funding for after- school programs. Then core peak and progress with g Ry C went on to receive public dollars for junior high school 93 to create a beacon program. Eventually, other school after- school programs were extended to other schools enriched with funding was made by elected officials to Graz in 2001. Several parents approached me with serious concerns and questions about g ry c requesting payments for what they believe to be public programs paid for public funding. I then in 2001 brought the parents concerns to all elected officials and Bob Monaghan director of gry, see that was almost 20 years ago in December 2019 CB, v Portland meeting I provided a copy of New York state controllers and a police order regarding their findings of the UIC D and G Ry C New York State Controller DiNapoli's findings were very disturbing and scathing. The New York state controllers reported 2019 merit concerns back to 2001 and throughout the years. The fact is that it is apparent that for 20 years nothing has been done today to stop these concerns and practices and then some at gry C by the elected officials. After sharing copies of New York state controllers in our Police June 2019, ordered at the December 2019 CB 5, but monthly board meeting I have been slandered as well as my family. I have been informed that board members, as well as others, were ordered by elected officials and others not to associate themselves with me, because I was a troublemaker and more and continue to be worse, yet Mr. Monahan has emailed elected officials slandering and defaming my son, then stating that I was retaliating for the wrongful termination of my son when employed at GL YC in 2017, which, by the way, no final time, she was provided at that time in 2017, either by Jerry wisely to my son, know that Mr. that Mr. Monaghan others have used the slandering of my family and me as a distraction. Let me say it again: it's a distraction to take the focus away from the 2019 ordered by New York State Controller DiNapoli's office, which, by the way, I did not write. Therefore, please consider this open letter. I am requesting respectfully you, sis and assist you know who you want stopping. Thank you. The next speaker is Tony D Piazza good evening to all, and thank you again for considering our annual street vessel just for the benefit, maybe of the new ones. Well, just give you a quick history of the festival we started about 25 years ago. First, three four years, I must admit there was somewhat contentious on the board, but after that, for the next 15 or so years used to be bolded unanimously. The street festival will never created any problems in the community. There were never any crime issues and nothing really nothing negative about it. For the following three four five years because of the construction on Fresh Pond, the Metropolitan, the vessel was cut back last year because the construction had finished, we were able to again obtain the full four days. Five Street five blocks, which we always got. The festival has been important because, thanks to your support, we were able to reopen the Federal Sea only office which provides assistance to the seniors and would like to continue to do that. But it's not only that the festival abilities is very important to the community because of all these the store closings that have been going on. It's a way to promote our community. It's a way to bring the whole community together, but also show that the people outside the community that come to the festival, what Fresh Pond Road has to offer, and certainly in that way, not only help the community to help the Federation but I help the store owners, because last year was a highly successful again with no incidents. We got a letter from the 100 4th precinct, which was sent to the community assistance office, supporting the festival again, stating that there were zero incidents in the last year's festival. So I beg you again to please approve it and let's continue a 25 year old tradition and bring the whole community together and not breaking apart, like some people would like it to happen. Thank you. All. The next speaker is Joe Raynor the same subject. Not here. Ok, that's out next speaker, Vincent Armando good evening. Everyone name is Armando for the record. First of all, for the people that do not know me, I'm a parishioner of Our Lady of miraculous metal and also St. Margaret's. Some of the board members know me: I also volunteer up at Europa Park as it relates to the festival and what it means to the people in the community. It's a gathering place it's for multi cultures and there's something there for everyone. Either it be music for the young. Some stands some food for others, and even some rides for family. That's what the fairs about it's about, bringing the community together. Just recently I was with the Monsignor a lady, miraculous medal, and we have we have a church gathering there and we also do an international food line, and one of the things he said to me and I quote- is bringing people together through activities and festivities only makes a community stronger. So with the utmost respect. I'd like you to consider a tradition of 25 years to continue. Ridgewood is a fantastic neighbor that I grew up in I. Would love to see this to continue? I've been bringing my kids to this feast for all these years, except for the couple years. It was not on I hope to bring my grandkids here, but I also know people from other communities either be mass, but in Glendale attend this feast and they also help their hope. The businesses along so I do not want to take up too much time, but thank you so much and please consider what a great festival that is, for the whole community[ Applause] we'll try to give you the same attention you gave the last speaker. My name is Peggy Okhane and I live off a fresh spawn between wood line and Menahem. Every year we who live east of fresh bond are immune for four days, because we can't go off to the east. The railroad is in the way the people who come to the festival there's no of no applause at the festival, but they feel free to use traffic avenue as a vomitorium and peace walk and garbage them and to park in all our driveways. No other part of this community is expected to accept four- day disruption of the main thoroughfare of the of the community. Now we're talking about the bus routes and it's so important that the bus through both lanes be observed for four days they will be blocked. Who wants to make a delivery, is going to be parking in the traffic lanes and Fresh Pond Road is going to be a madhouse again. Please do not inflict this on us again. Thank you good evening, I'm speaking as a member of the Board of Cures Civics United for railroad environmental solutions. As you know, a couple months ago, one of our fellow board members here, Brian Julie, came to you with an issue we are still advocating for that in New York state legislature. There is a some there's, an assembly bill that we need to get passed and to put solid waste solid, covers on rail cars that carry demolition debris through our neighborhoods, all the way acrosss the state into Ohio, so that they do not emit waste and blow- off and odors the bill passed in the Senate last session. It did not get out of the assembly committee this year, Assemblyman Brian Barnwell has submitted it again, reintroduced it and is working with some of our fellow assembly members, Cathy Nolan and Mike Miller, who are co-, sponsors to get it moving, but we need to get the chair of the committee to act on it and get it out to the floor where we believe it will pass. Joe Addabbo has reintroduced it in the Senate. It has passed the committee. So it's about to go to the floor to probably get passed there. So we'd like to ask that anybody that did not fill out a postcard at the last meeting. If they would be willing to fill one out, we will mail it for you can just give it back to me and we will drop it in an envelope and get them up to Albany ASAP. So please see me if you want a card and I will collect them also throughout the meeting. Thank you. Thank you. John next speaker rich view. Bur good evening, everybody Ritchie, you burp, a member of this great board: hey how's, that bail reform thing working out for everyone under New York's justice reform prosecutors have to hand over all evidence to criminals in 15 days or its gets dismissed, including names addresses in contact in for victims and witnesses. How many cases are going to get thrown out? How's that going to work out for you me personally, I've asked by the police. I did not see nothing. Okay, we rapidly will approach the homicide clearance rate of 12% like they got in Chicago a Senate majority spokesman said the reality. Is these reforms will save taxpayers lots of money, six billion dollar deficit Wow, but I digress? Jonathan Montanaro is dead. He died because a multiple repeat, felony offender was cut loose, there's already many stories there, recidivists horrible actions. After immediate release, senator Addabbo said it was in the budget we had to vote for it. Our electeds claim it's the process. They have to pass the budget where our government shuts down all my, but they own it. In my humble opinion, it's a great bit of plausible deniability almost sounds like a Nuremberg defense. We were just following orders, our electeds of following the orders of the party and the governor. As I recall, they should be accountable to us their constituents. We, the people, but not in a one- party system, welcome to New York, and we wonder why we're probably going to lose a congressional district to the government holds them hostage with the annual budget. This sounds like a quid pro quo, which is actually French for quid pro quo. Back in June of last year, a group of state senators, headed by it Guam and Martinez, both Democrats backed a new bill, giving judges some discretion to pick some of this mess around that time. De Blasio went to Albany and begged for our electeds to fix it bail reform, but it fell upon deaf ears. Can you believe it I'm agreeing with they could have fixed it? That was back in June. Now they say. Oh, we have to fix it. Tell that to the grieving families and victims tell our elected officials here they all voted for it. These are the people you supported, voted for and extol their virtues on social media worked and petitioned for them, told friends and neighbors to go vote. What did you get in return? The jails emptied into our neighborhoods remember to thank them on Election Day. Our electeds do not represent us. They represent the governor and the homeless. Shelter industrial, complex, I can't believe it. Murders are up along with many other crimes. Can you believe that this is all part of a master plan releasing recidivist without bail emptying our jails, thereby supplying the homeless halfway? Houses that are, in reality, jail annexes? Well, just like we're going to have here in Glendale. This is a sure recipe to return to the Dinkins days when we had 2,000 murders a year, Will Rogers said I'm, not telling jokes I'm, just observing government and reporting facts. Thank you all have a good night and all please stay safe. Thank you. Lucky's! Not here, we'll close the public forum. The board members will note that I really screwed up because he was supposed to do the public hearing first. So we'll now do the public hearing on the fiscal year 2021 preliminary budget, the first speaker is Ted Ren's good evening, distinguished members of 2005. This is the testimony in support of a new capital of a new capital project, promote 11 uu in Ridgewood between Wyckoff Avenue and Fresh, Pond, Road and immediate adjacent side streets. Basically, the area that's wholly within the Business Improvement District, dear members of Community board 5 on behalf of district. We thank you for your support for a new capital improvement project from Myrtle Avenue in Ridgewood, which was community board fives number five priority for FY 2011 ooh in Ridgewood, between Wyckoff and palmetto and Fresh Pond Road, was included in a major capital project was 1983 1984. At that time the project was under the New York City's commercial revitalization program and included in two major improvements to the shopping corridor and a new concrete sidewalks with brick pavers. The curbside steel face curving new trees, creation of three pedestrian plazas over the years. Other improvements included historic M polls on Myrtle Avenue, as well as other streets, World's Fair benches, along various curbside locations and in plaza areas, historic marker, Stein's, historic marker signs on the M holds and new planting areas and other improvements over the years. Many of these improvements, particularly the brick pavers embedded in a sidewalk, have seriously deteriorated, causing tripping hazards and unsafe conditions from Destry ins. This has also resulted in a number of lawsuits in many cases, naming the bid, which has resulted in higher insurance premiums for the bid and as well as property owners. While there are a number of very important projects for this board to support, we kindly ask for your continued support for the important improvement project model. Avenue in Ridgewood is a major commercial corridor serving the greater Louisville community and Bushwick and other surrounding communities over the 345, retail and service establishments. The improvements were asking for may include, but not limited to new sidewalks without the brick pavers new curbs and holds on the side streets. Removal of the Belgian blocks from the almost 300 treatments additional benches. Other amenities, since our last project only included a repaved street bed, it might be wise to consider new sewer lines and water mains, because the existing water mains that are there now will probably put in there in the beginning of the century. Thank you very much. Next speaker is Mike watch Shelley all right, I'm Mike Porcelli been a member here for over 25 years, so I guess. Everybody knows me by now. I've been a mechanic since I'm 5 years old. Most of you know that our family business is there in this community 71 years, I now teach automotive technology at CUNY in Bronx, Community College, which is the only automotive program offered by CUNY I'm here tonight, to inform everybody that we're running out of mechanics rapidly and when we run out of mechanics everything's going to stop working, we'll have no cars, no trains, no buses, no way to get around and no lights. No air- conditioning the city school system has now finally woken up and decided that Career and Technical Education, which we used to call vocational education, is an important thing and it should be promoted. February is Career and Technical Education Month around the country. How many people here knew that February was Career and Technical Education month a handful? Okay, we only need a few fingers to count the people that knew it. That is the problem people. Nobody here knew that this was the month that we're supposed to promote Career and Technical Education, while I'm here to remind you of what the do e has failed to. Let you know, okay, you all should be receiving by email. Several articles that I sent over that the board office today, promoting especially automotive education as really a very good career for young people to get into they can get high- paying jobs. Most of my friends that own shops are paying people one two three thousand dollars a week to fix cars and it's a career that somebody can get into with just one or two years of training. Of course they have to do lifelong learning to stay up with modern technology. I tell my students I've been fixing cars for 65 years and I'm still going to school because I'm a very slow learner. It's either that or there's so much new material to learn, I'll, never catch up. So just keep in mind anybody in your family, any friends, relatives young people that need to decide if what kind of career they want to have look into the Technical Trades. The public forum on the budget, mister Kozlowski did show up we'll go back to the public forum, no more than three minutes. Please thank good evening. My name is Chris Kozlovsky I'm, an architect, and the subject of my presentation is the presentation to the public hearing for the landmarks and Preservation Commission of the university. Basically, the owner of the property started work on a scope which are the landmarks damage. However, he had a permit for the steps going down, but not for the main stop so the stupid deteriorated. So he decided to start work and then he got a violation, so it would be a subject, a public hearing. It's a very simple thing: we are not changing number of steps, it just a matter of redoing the surface of the steps and the handrail will be exactly like. It was originally so to be basically needed. A copy of the original Hun training and made of cast iron, so the public hearing that Landmass Preservation Commission decided they start decided that this is subject for the public hearing, because we are changing the finish of the steps of stop steps. Everything where the work started already. It was done very carefully and I think the effects are visible. Also, the sides of the stoop will be very similar and very similar to original ones. So this will be also reproduced exactly the same pattern on both sides of the stoop. Basically, that's it any questions or comments. Yes, I can't see very well from here and if you do not mind, I would like to get closer. So I can comment on that first picture. Thank you. Thank you. Is this the original steps, what it is yes, so is not that front piece. A little dangerous excuse me I'm, just making a comment. That's committee work though, so it's going to say everything I say is committee work, but that's a dangerous piece, especially on the Americans with disability, I'm, just going to say that we'll turn this over to the commit land- use services committee for review. We usually do not get too much involved in a landmark area, but for everyone that does not know a large portion of Ridgewood who was called the landmark receive landmark. Designation and most of this dupes are brown stones and many of the alterations have been changing them by adding granite stainless steel. So we'll turn it over to land. You see if they have any comments. Thank you. Yes, the issue of I'm on the Landmark Committee and the issue of the Landmark Committee commenting on this. It was decided I believe last year. You can correct me if I'm wrong, that we do not have input and it's the line' and the committee made that decision, and it was discussed that we would not be voting on with that we'll get back to business. So we were. We were to have a presentation by Wyckoff, but in lieu of that we'll talk about the concerns of the coronavirus. Okay, the coronavirus really is not a big concern in our area. As of February 11th in New York State and New York City, there were no positive cases. The ones that were checked were 17 negative results in New, York State and five in New York City. There is still two pending in New York State and one in New York City. The real concern is the basic influenza. So if you're showing any symptoms, you should be aware and concerned because Influenza killed a lot of people many years ago. So, if you have the flu like symptoms, you should seek medical care right away, call ahead and tell the doctor or the hospital that you're going to. If you traveled out of the country on a cruise I, went to China avoid contact with others. If you feel that ill stay home, except for seeking medical care avoid and further travel until the illness resolves cover your mouth and nose with a tissue or your sleeve, when you're, coughing or sneezing do not use your hand because you're just spreading it flu wash your hands, often with soap and water. It's the best solution to prevent illness and spreading is washing hands at all times and I. Think someone said you say: happy was sing, happy birthday three times. Is that what is okay? Yes, so we really have no strong fears here in our area, but we're keeping an eye on things. So, if you have signs of flu, take care of it because you could be compromised. Otherwise, thank you. So the next order of business is the chairperson to report, and that's me Vincent our Kure. Let me find my notes. So we met on February 10th to review the applications for the street festivals and a gritty reviewed, and there one two three four five festivals or street fairs, and the first one we discussed was Fresh Pond Road between Woodbine street and many Han, and the proposed dates there's something different on this form that I have than what we reviewed the other night. It's different in what we read. This is the current modified, so we read brood what they filed with the city, but since Sunday we've they so it's Thursday, September 3rd 6:30 p.m. to 10:30 p.m. Friday, September, 4, 6:30, 10:30, Saturday, September, 5, 6:30 to 10:30 and Sunday September, 6th, 6:30 and 10:30. So I just want to address the executive committee that we need to discuss. No ok, so the committee reviewed it and recommends not approving the Fresh Pond Road street festival as presented on the question. I'm sorry I did not make that meeting. Unfortunately, in order to comment on this, I need to know and I understand that there were five presentations for accepted, and only this one rejected and the basis of the rejection, the length of the all the others are one- day. Festivals, understood. There was also the no votes were concerned that not all of the paperwork that the board has asked for has been submitted to the board, as the other events have done, with full expense reports, full accounting for the money, we're just very much given brief numbers, but not any official documents. Those were them. Yes, it is please no until we ask you to, and there was a number of votes against it, because it is a very big impact on a street that is tied up for more than the four- day festival and as it stands, the application to the city, even though we're seeing these the application to the city is what was on ours and it had five days lifted. Okay, so do you think that it would make a difference to the committee if it was four days like it shows here? I, do not think we're supposed to be doing that kind of work here, all right, I'm, just I'm just concerned okay, that was the committee's now. I listened to the public forum. Comments and I understand that there was concerns about traffic. That was the only negative thing I heard during the public forum was the disruption and the issue on traffic. Is that correct? That's your objection would help the situation if we worked with the Sanitation Department and make sure that they gave special attention to traffic during those four days Committee. The committee reported, the committee recommends no, we JA, please John the committee- reported out and that's our recommendation. The board could take a position for against whatever our visit, the committee reported we're not going to Redo committee work at this meeting, we're not going to do committee work at this meeting. We reported okay, you have comment. You want a table in motion. Anyone good table hold on slow down the understanding you could table it any time you want. So if there's a table in motion is doubly much, we had to get the approval in out of time. Specific I. Do not know I do not know the answer to that. We have the table yet September, we have a table in motion seconded okay. Further discussion pass them. This is on the table in motion I'm, not just making a comment. I'm not I, agree with table that this has been a controversial issue since it began it's all over. The newspapers are you that it does go to the ritual for 25 years has been no incidents occurring. In fact, this is the only festival that every year gets denied on the table. Any further discussion, Ritchie on the table, emotion, Mr. Chairman- we are tabling the committee's recommendation. Is that correct? Just the committee's recommendation and other motions regarding this event can be brought up by board members. It's further discussion and it comes back at the next meeting at that point- would be discussed further. Okay, I just want to understand the motion or exactly. Thank you very much any else on the table. Talking about please pay attention to me. I am not in a good mood tonight. Okay, so it's a fresh pot, Road Festival and we have a table in motion. Okay, anything else on it Laura. Would you call the roll I'm sorry hold on yes further discussion? Would you give Laura the microphone? Someone start from the bottom if you would Laura so people are not influenced by my attitude today: okay, Nan Jiang, Marianna, zero! Crystal wolf! Are you here? Yes, if you say yes, your motioning to table correct, and would you sit at the table? Please? Okay! So what is your question crystal the table in motion either for tabling or against it? For my Killeen Von Drake, then Patrick to KZ Barbara, Toscano Oh guy now Papa Megan Toddy? Oh, is not here. Kathy some skis in here Dennis Stephan is near Oh. Dennis is against Connie. Santos is near Carmen Santana, Walter Stein here, Lee Rotenberg, Luis, Rodriguez, Kelvin, Rodriguez's, and here Ted Rennes, yes, Ken, reg, burger, yes, Michael, Porcelli dawn passin, Tino, Michael, Okhane, Margaret, alkane, Eileen, Maloney, Kathy Massey for Edgar's in here, Patricia needed John, Mayer, okay, Mike Rinder, that's Ed, Lu, Tao, Marianne, Latinos, many apples, not you Richie, you burr, Fred, half early Fred, holler, Steve, Fiedler, Demetra, fikowski, yeah, Jerry, Drake, Brian, Dooley, Patricia, Crowley, Walter, Clayton and Tony bonanza and Vincent are Kyary again. Okay, all right, so the motion was tabled. The next item. The next item is the: what audit did I do it in I'm sorry, Glendale, Kiwanis, Myrtle, Avenue festival in Ridgewood, July, 19th, Fresh, Pond, Road to Forest Avenue. The committee recommends for any question or comment: Fresh Pond and Forest Avenue. Okay, you ready for that one more number 90! It's number three on you as those up confused with these a list and two different Richwood, and that we are voting on that's window. Look at the spots at Glendale, Kiwanis committee recommends for any questions or comments. Okay, would you call that roll in okay Vincent are Kure for Tony Benanti Walter Clayton Patty Crowley Brian Julie, Jerry Drake Demetriou for Kowski Steve Fiedler, Fred, Fowler, Okay, Fred HOF early for Richie BRR, Edler, Tao, John, Mayer, Kathy, Massey, Eileen, Maloney, Margaret, okhane, Michael, O'kane, Don, passin, Tino, Mike, Pacelli can read, Burger Ted runs, Calvin Rodriguez will got here: Luis Rodriguez or Lee Rotenberg, Carmen, Santana, Dennis Stefan guy, not that but Barbara to skin I'm, not here Patrick, Jim Casey, my Killeen bad raven, crystal wolf, Marianna, zero and Nan Zhuang, okay 29 for one against Ted. We do not question votes. Ted. Do not questions okay, so that that's passed. Is that correct? Okay? The next item is the Matt Smith Chamber of Commerce Alliance Kiwanis Grand Avenue Festival Sunday June, 28 65Th Street to 72nd Street. The committee recommends for any questions or comments on the matter. If not we'll call the roll again crystal wolf. My Kaleem boundary is in for Patrick turn KZ Barbra- Scott own guy in out papa Dennis Stefan Carmen Santana Lee Rotenberg, yeah, Luis, Rodriguez, yeah, Ted, Rennes, ten red burger, Mike Pacelli, it's on Cosentino or Michael Okhane Yes, Margaret, O'kane, Eileen, Maloney, Kathy Massey for Edgar Mantell, John Mayer for Ed Lu, Tao, nary, a poke Ritchie, you Burt, fred, half early for Fred, holler, Pat Grayson, not here, Steve Fiedler to meet Joe Pitts, Kowski, Jerry, Drake, Brian, Julie, Patricia, Crowley, Walter, Clayton, Tony Benanti, easy count. Okay next item is the Myrtle Avenue Richwood Festival Sunday April 19th Richard, the local development cooperation. The committee is in favor of any question or comment right here. They closed down Myrtle Envy from Wyckoff the fresh bond, but they do not use the two blocks between Fresh Pond west of Fresh Pond. That's a staging area. Okay, all right call that roll! Please not voting once I am on the LDC: hey Tony Benanti Bob Cinelli Walter, Clayton, Patty, Crowley, Brian, Dooley, Jerry Drake. It's a me trophic cascade, yeah, Steve, Fiedler, Oh, Fred, Haller Fred, happily, rich ubirr, Ed, Lu, Tao, John, Mayer, Kathy Massey for Eileen Maloney, margaret O'kane, Michael, O'kane, Don, Passin, T, know Mike for Shelley Kendra, burger Ted runs. That's his salary comes from oh okay, Luis Rodriguez for Lee Rotenberg, Carmen, Santana, Dennis, Stephan, Guyana, Papa, Patrick, Chan KZ, my Killeen bond reason for crystal wolf: Marianna, zero and Nan Zhuang. That's pretty 26 for okay. That the next item is the murder: LabVIEW bid, Myrtle a view, festival, September, 13th, Wyckoff, a happy new Fresh Pond Road sponsored by the Myrtle Avenue Business Improvement District on the discussion. Cathy know it's two different corporations: Business Improvement District is different than the Local Development Corporation. It's a mixture not just a definite, no right. There's a mixture summer. There is some duplicates yes correct any further on the comp question: roll call: okay, Nan, Zhuang, Marianna, zero, crystal wolf, Michael means Andre, then Patrick Chan, KZ guy, now papa Dennis, Stefan, Carmen, Santana, Lee, Rotenberg, Luis, Rodriguez, Ted runs again. Part of his salary comes out of that canned red burger, Mike Pucelli. It's on passin Tino, Michael, O'kane, Margaret, O'kane, eileen, Maloney, Kathy Massey for John Mayer for Edler tau, Marian, Oaks, full rich ubirr, Fred HOF, early or Fred holler, Pat, Grayson, mmm, Steve, Fiedler, well to me: trophic cascade, yeah, Jerry, Drake, Brian, Julie, Patty's, Crowley, Walter Clayton, but and Tony Benante, not sorry, that's right! Vinnie on Kure I'm, not voting. Okay, so looks like okay since I've totally confused everybody with the order of business I'll keep going with the confusion minutes. What do we have with the minutes? Yes, Cathy seconded Walter, all in favor hold on hold on hold on question I'm. Sorry, I tell you, I have a question on the minutes. Under new and old business it says: I asked how many locations of Graffiti that's the exact. That's not exactly what I asked. What I asked was how many in a sense were grieger feed and after they were painted over which I know, which I preface my remarks last month by saying that it probably there is no figure for that. They just keep repeating and they keep hanging over. They do not. He may repeat: ok, yes, we do not keep a record repeats. We keep the record of how many we've cleaned right, I'd like two minutes to reflect that any opposed any abstentions. Thank you. Keep going with the confusion. Liquor wine and beer license. Applications new liquor licenses, eight six, seven holiday cafe two visits as holiday: eight six: seven Cypress Avenue any okay liquor license renewals, one new form: deli Inc: two businesses lost Margaritas bar and restaurant six; seven, twelve Fresh Pond Road, some stomp dish, Inc, six, nine, four: six Myrtle Avenue Wood, six I'm, two LLC doing business as aunt Jinny's 6/5 to Woodward, 290, Wyckoff, LLC, doing business as the bonus room; nine. Ninety one white coughs, 582 Seneca, Mu, LLC, the Seneca 582 Seneca. Have you why new wine and beer licenses, while in Katmandu Inc, 750 I'm sorry did I miss I'm? Sorry I, miss palace of Zulu Inc, 913 Wachovia, while in Katmandu Inc 758 Seneca, no new, no whining and/or beer license renewals where he needs pub doing business as Walters. Sixty eight sixty fifty sixty eight sixty seven Fresh Pond Road will be submitting a classic class change application to the Liquor Authority changing from a tavern wine license to an Opie license, which includes liquor, wine and beer and cider. We are 138 LLC doing business at sweet, Jane's, six, four zero. Two six, eight of you will be submitting any method of operation change application there to the authority. They are looking for four a.m. seven days a week. We advise the Liquor Authority that we're against that: okay building demolition and construction notices in Glendale, eight zero, nine, seven and eight one zero five Cypress Avenue, none in Maspeth middle village. We have eight to five six one drive to convert an existing semi-, detached three- story to family dwelling, with medical office to a three family dwelling with one enclosed parking space and two open parking spaces. Nothing in Ridgewood, yes, correct I have no idea; they do; okay, they still a blind friend. They could still apply for permits and that's probably why they was stopped because they did not have a permit. That's what I would surmise. Thank you. Okay. Now to further confuse you again we'll go on to recognize some people and I here tonight and Laura's doing triple work and Cathy's doing double work and that's our staff for today, I'm, confused and Gary's home. So we're not in good shape tonight. Joe, not Sereno from the borough president's office Joe! Please! We do not want us to get on your bad side. We sense the mood so right, Thank, You, Mr., Chairman, hello, folks, couple of quick messages. You have all information in front of you Queens week of service, the Borough Hall is collecting items for veterans, toothpastes body lotion, body wash hoodies, sweat pants. You can drop them off at Borough Hall or at your Community Board office, and it ends February 17th, community board applications deadline has been extended to March 13th events notice, a property value sessions receive one- on-, one assistance regarding your property taxes and that's February 27th in Bohol 5:00 p.m. then we have a home owners and tenants enrollment event for homeowners. You know start our veterans help the tenants we have screen and other opportunities to hear about it and that's on February 27th. But that's in the morning about 10:00 a.m. and then Black History, Month events, February 26th, 6 p.m. to 8 p.m. at, and we will feed you and I. Thank you, sir I'm. Sorry I forgot this one Black History Month February 26, some of the stats for the past 28 day period. Robberies were up by 14 felony assaults up by 11, burglaries up by 13 Grand Larceny is were up by 5 in grand larceny of the order we're up by 3. These are just the numbers for the past 28 days. Burglaries are taking place mainly in Ridgewood later in the evening of anywhere past, like 7:8 or 8 p.m. at night into the early morning. Hours robberies are taking place in Ridgewood and Maspeth again. The same kind of hours later in the evening into the early hours of the morning, make sure you doors are locked. If you windows lock a lot then do not leave any ladders or anything that could help someone gain entry to a second level and grand larceny. Again, we've talked about this all the time. Lock, your car doors do not leave any valuable property inside your vehicles. I know we've been saying this for the PES over a year. Now people still walked into the priest and say so much idea. If someone got into my car was a lot to know it was not. What did they take my iPad? These are things that could all be prevented. Keep your doors locked, do not leave any valuables in your cars again all things that could be prevented. The telephone stems still going around. It seems like the word is getting out there, though. So thank you folks, you've been telling your neighbors and friends continue that and that's one of the ways to battle them right now also keep in mind with tax season. A lot of that will be happening. Remember it's all via mail, no phones. If they're trying to contact you, they will write letters, not emails not come in person. Also try. If you do not have any place cameras out, you know it's always good to have cameras now, they're, all pretty good, so just pick something off and have it there to help assist with whatever it is. That might be needed. Also, the sense the senses are going to be starting for the year they're, going to start by actually mailing like a code to give you the option to either call and do it over the phone answer, the questions or go online with that code and end up answering those questions if they do not get anything back or reply or any answers. After a certain amount of time, they'll end up sending you the quite the regular questionnaire out in the mail. They still do not get anything back, they will then come and to the house. They will not ask to come in. So if anybody comes up to your house and decides to say, hey, you know, can we come in while we ask you a few questions, do not let them in there will not be asking to come in each one of them will is going to have an iPad in the back of that iPad or tablet. There's going to be a certain logo that you'll be able to see they're going to have an ID with a certain specific lanyard. So, just you know, if you see something that seems fishy or whatever the case is feel free to call, but it stays I'm. Sorry just do not let no one on no one in and to avoid anybody coming in period. Try to answer it over the phone or email or the question here. If you know you answered it, you know nobody's coming at your door, so have a good night, the mobile unit, the precinct. How is it determined that it makes its way around town? So it goes according to crime? Okay. So it moves from time to time since it's been on 80th Street, for it was supposed to move out of 80th Street, and there was a request, because there were some push ins as you're aware in Glendale, so we asked if it could be moved over and when we were told they had a serious problem. Ridgewood we kind of understood, but has it been moved to Ridgewood yet right now, when it does move, it has sustained at that area for a certain period of time number wise six weeks, and then it just moves according to see when the next time officer, Perez I'm from patrol borough, Queens north I, am the 104 priests of Maison. So sometimes you may see me come to certain meetings now and if you guys have any questions, you can just get my information after this any other questions, please. This is not a question. It's just to make people aware that HPD people are coming up to the doors after 4 o'clock, claiming their HPD subcontract and they're. Not. It happened to me and it's happened to other people in Richard as well. If they have what's happening, is that they go on the website, they see that there are violations and they're trying to use that they do not have ID and no they're not being sent out of four o'clock in the afternoon or four o'clock. That's when HPD closes their doors so just to make people aware they're claiming to be HPD, subcontractors and they're. Not thank you. Thank you anything else. Okay, representing congresswoman Ming, is Christian Romero, Thank, You, Mr. Chair good evening. Cb5 I'll be brief. The congresswoman put through some bills this year already I, do not in an interest of time. I won't read them all, but I'll read one that I think is a very interesting and important. It is the locality based Social Security benefits Act. This would make it so that the Social Security benefits for retirement, survivors and disability would adjust the monthly amount based on where they live, in other words, beneficiaries in New, York, higher cost of living higher amount of benefits. So I think this is great. That's it for me tonight have a great night, everybody! Thank you! I'm! Sorry, that's the microphone! Please Christian! A question I just want to know. I keep hearing that President Trump is looking to make cuts regarding Medicare and Social, Security, disability and stuff. Like that, can you update us as to what's going on with that yeah? They are trying to make cuts. You're right on that we're going to stay on top of it with this administration, it's hard to keep track of so many different changes that are happening. I'm, not saying good or bad I'm, not political here, but I will keep you updated as soon as I find out more information. Thank you representing councilmember Reynoso, father Fatima, which deep recurrence the Egyptian or the Christian office. Just a few quick announcements, we're having a Black History Month celebration on February 28th it'll, be at 6 p.m. at Whittle. Hospital I have some fliers if you'd like, and everyone is welcome. So if you want to come to that, please do another announcement. The plastic been plastic bag ban goes into effect on March, 1st I'm sure you've all heard about it, but we'll be having some free giveaway events throughout the district and one in Ridgewood soon so stay on the lookout for that and, lastly, participatory budgeting is going into full swing. We do have some Ridgewood projects on the ballot this year. There's one for like a down payment, slash phase, one Grover Cleveland upgrade on the ballot and a project for PSAT one vote week is going to be the last week of March, so stay on the lookout for that too, and that's it. Thank you representing senator Addabbo is Sarah Feldman hi everyone first off I, want to say Happy Valentine's Day to everyone. That's coming up on Friday we'll get some love back into this room for the rest of the meeting. Hopefully, I brought paper this time, Vinny-, so I'm not reading off my phone, see him picking up on things. I'll make this really quick. Otherwise, my boss is hosting mobile office hours at the Maspeth library on April, 2nd from 5:30 to 7:00 p.m. it's kind of hard to catch time with my boss, while he's up in Albany. So things like this after 5 o'clock is nice for members of the community to go talk to him directly when he's here in the district- Ritchie's point earlier, my boss, let me know just a couple minutes before that the state Senate is working currently on bail reform. I do not know if that's repetitive or not, but there yeah. They are working to further reform. This budget problem that we encountered last year, but you know we had to pass a budget in order to make sure that our senior centers and our schools and our veterans make sure that they got the funding from the state. So it's time now to fix that problem and we're working on it so just wanted to pass that along and just so. Everyone can mark their calendars. We are having our spring recycling event with Assemblyman Mike Miller's office on April 26 Sunday from 10 a.m. to 2 p.m. in the forest park. Van Shell parking lot. Questions comments concerns no, it's called correcting errors, oh my god. No to that No! Okay, thank you, representing Assemblymember. Hevesy is Kevin with Neski good evening. Everyone Kevin was nasty with Assemblyman Hevesi office. Just in case you did not receive a copy in the mail. I have brought some extra copies of our winter newsletter. That came out last month, which just describes some of the laws we had passed last year, as well as what we are building on going into this year and just to summarize two quick things that includes a new law that requires and certain workers be trained to, identify and assist child trauma survivors, as well as a bill that helps survivors of domestic violence, leave dangerous circumstances without having to incur undue financial burdens. So, there's more in here, aside from that, just want to wish everybody a good night and as always a few questions or concerns, you know where to find us Thanks. Thank you representing Assemblymember I good evening everybody. Let's see firm, Brian bar Moe's office, a few quick things. I wanted to announce we're having a DOF workshop, similar to the Queens borough president's office. If you have any questions about your nopp, you want to apply for exemptions. A lot of people do not know that they can save a lot of money on these things, and so, if you know anyone please tell them to come, apply, we've helped a lot of people save thousands of dollars. So we want to keep having people take advantage of the things that they qualify for under the city and state, as I announced last time. I just want to remind everybody, we're doing PB&J making for the needy. We've been lucky to do this for years now and what side and now we're going to start doing in Maspeth, so every second Tuesday of the month at six o'clock and Martin Luther school here in Maspeth, will be doing that. So, if you know anybody that needs to fulfill service hours, please send them our way or if you want to donate PB&J, that'd be great too and lastly, Brian is working on scheduling and that's Pat's Mt meeting I know there's one on the 9th of March which councilman Holden's office has been helping with as well we're trying to get ones all acrosss, our district and Woodside and Asketh. But the MTA has been a bit booked up. There's what they tell us so we'll keep. Trying and I do not know why they scheduled for tonight, but we'll keep trying. But please tell everyone to call our office call. Your other elected officials submit comments online. Go these meetings, it's very important that people show up and make their voices heard on this, because the communities that shout the loudest are the ones that they're going to listen to. So please tell everyone, that's what it feel free to say. If you have any questions. Thank you. Thank you representing Assemblywoman. Nolan is Allison Cummings good evening. Everyone just a quick announcement. First on the bus network redesign, please I know everyone's been trying to get a lot of work, shopping done and get them to get the MTA to go absolutely everywhere. We can get them, but once you've done the work shopping. Send the comments over so that we have them too, so that everyone knows how you felt about it, and we have the record. You know I will take them the assembly, one wants them. So if you, if you think of something afterward to please just send it on to the office. Otherwise we have mobile district office hours scheduled for the Ridgewood library on Thursday March 19th, that's from noon to 2:00 p.m. if you'd, like a flower I can send it over to you and I'm going to leave some with the board. Thank you. Thank you. Representing Assemblymember Miller is Christine Stahl[ Applause] hi good evening I'm Kristine Stoll, representing Assemblyman Mike Miller on behalf of a member. He just wants to wants to say thank you to everyone who donated to his 11th annual Valentines for veterans collection. The proceeds went to St., Alban's veterans, nursing home and then the second announcement, Assemblyman Miller's annual Woman of Distinction event is on Monday March 9th at 7 p.m. at the Richmond Hill block Association and from CD 5 Janine Mahone from the Greater Ridgewood Youth Council is being honored as well as assembly will make happy Nolan. Thank you. Thank you[. Applause] recognized Miriam mitosis here from mess with highschool Mario. Anything for us. Thank you. How's. The team boys team doing Cathy wants to know how the boys team is they've, been reinstated in PL for JV baseball because it's been denied every single year that we've applied. Actually, since we've opened so at some point we brought it up at the one of the education subcommittees, we're looking for support from the subcommittee and the entire community Board City Council City Council we reached out to every single elected official in Queens, so tell that parents who not to vote for that. Okay. Thank you. Thank you like to recognize the press quartets here today: David Russell cool from the Queens Chronicle and Benjamin Fong from the Queens ledger. Thank you for letting people know what we do: Jenny Gomez from Queens College. What are you here for anything special? No, okay, then, with that will close the Shepard's into report. Our district manager, Mr. Jordano, is done here, he's watching at home and writing doing all his work at home. The latest that we could tell you about the homeless, shelter in Glendale is that we've written several analyses to the Commissioner that buildings, the last we saw, was a I'm trying to think of the word. It is let it to revoke the permit. We also advised them that all the permits should be removed because on the local law 160, they failed to file a letter of certification on all the fines. They've received I pointed out to the commissioner. That is total confusion as to what is approved, what is being built and what is permitted at that location, because, while the plan examiner signed off on a residence facility with dormitories, the review for the certificate of occupancy noted that they are not a resident facility, it should be a transient hotel so that stirred up everything that we sent them and no one wishes to speak to us in the city of New York. On this subject: okay and the Coalition for the homeless has filed. The second appeal is that right of course, the article said that one article 78 was denied- obviously not even read by the judge, because the decision makes no sense at all. It does not even address the issues we brought up, so we have filed a notice of appeal on that and the second group going before BSA the letter to revoke is based on the objections that have been filed and we're expecting in another 20 days to be in front of the board of Standard at appeal, and there has been an audit on the property and requested on the property next door where that artistic stitches, so we're hoping that these things start to fall in place, and maybe there's a possibility that we can delay these projects at least get them legal, because they're not and that's all I can tell you at this point question without a contract. Sign I do not understand why they were having a job fair, trying to hire people for a job that does not even exist. Well, anybody could do anything they want in this country. You know that, okay, anything else. If not, let's go to committee reports, Park Services, where are you? The Parks Committee met on Tuesday February 4th to put that recommendation from Parks Committee on the ridgid reservoir for the contract on a two point: three million dollar removal of invasive species in basin, one and three in advocating for the Ridgid reservoir to stay natural. For about say, twenty thirty years, this board is very concerned about heavy equipment being used in basin one and three two: the invasive species have the equipment such as Bobcats, have a very high decimal count, disturbing just about everything: birds, geese, stalks, Turtles and so forth. There is no guarantee that they will return if the heavy equipment is used in the basins. Therefore, we recommend and reinforce that no heavy equipment be used for any reason in a basin one in three for the contract to remove invasive species, this contract states, no heavy equipment, will be used in the basin, but we need to reinforce the board's position on this very important contract like to make a motion for a vote on this place. The motion is the last one. I read, therefore, recommend reinforce that. No heavy equipment be used in any reason in the basin, 1 and 3 for the contract to remove invasive species. This contract states, no heavy equipment, will be used in the basin, but we also need to reinforce the board's position on this very important issue show my ignorance. What is the invasive species you're trying to get rid of their only basin to Phragmites our basin to there's not that many Phragmites and wanted to further the other species are trees like ok? So the motion is that we read, we reiterate what we had previously and it's over here Laurie. You could copy from his report when he gives it to you call the roll please for Walter Clayton Patricia Crowley Brian Dooley Jerry Drake, it Sammy trophic, cascade, Steve, Fiedler, well, Fred, Haller, Fred, HOF, really rich Huber, adlet Ow John Mayer for Kathy Massey, Eileen, Maloney, Peggy, okhane, Michael, okhane, Don, peasanty, no Mike, Bocelli, Ken, red burger, Ted, wrens, Luis, Rodriguez, Lee, Rotenberg, Carmen, Santana, Dennis, Stefan, Cathy, snow guy, no papa Patrick trim, KZ my Killeen bond Raven crystal wolf, Marianna, zero and Nan Zhuang. We just have a few more items. The tune of a valley, track& Turf, is going to start the last week in February the first week in March. That's doing the turf over the track over and three hundred thousand dollars worth of equipment on the north side of the back of the track: juniper Valley North upcoming construction on Myrtle Avenue, the only situation we have with that. We voted for the money and the money was put in by Mr., Holden and Nabarro president and to meet the bid, but we still have some problems with safety and where the cars drive, where the pedestrians walk, there's, no there's no buffer there, just a little curve. So were they going to be talking about that rosemarys playground is open. I went there yesterday very nice-, looking Park, let's see how it goes, but if you want to get an idea of how to build a box, take a look very nice kitty, section. Other section looks very nice. Yeah you plant things over to stop playground. The Parks Department wants to come to the committee between the 17th and 28th and give us the presentation on phase 1, the 1.2 million or 1.3 million. That's left for the original reservoir, we're going to try to have them contract to do the path between 1& 2. That way, all the paths will be done around 1, 2& 3, there seems to be another drainage problem down to Frank. Prince will be Park in that corner. The park is aware of it. All agencies are aware of it and it's being addressed. We will keep on that. We do not want that flooding again, I'm finished. Thank you. Okay and everything should be done. Thank you. Thank you. Do we have a anybody doing the public safety report? Thank you good evening. Everyone I'll try and be as brief as possible. Public Safety Committee met on Wednesday January 22nd at the Community Board Office meeting came to order at 7:35 p.m. only police officer. Salad was present from the 104 just take note that captain was invited and has not been to a meeting. Yet since I've been on the committee, we went over how many police officers are in the precinct. There are 198 uniformed officers comprised the two captains: six lieutenants 18 sergeants, three detectives. The breakdown is a hundred sixty nine police officers, 137 or male 32 were females. You heard the police go over the crime stats, obviously not looking good. They had more up to date. What was went over at the meeting murder was the same. Rape was the same robbery was up by six felony assault up by eight murder, up by eight grand larceny of life, I'm, sorry down by five and Grand Larceny, auto down by one the topic and CEO program was brought up and their response both Michael and Al, and myself had to say that we're not getting responses from the NCOs and our sectors via text or emails or phone calls. Maryann stated that the NCOs in Maspeth are very responsive and we had no information on the Ridgewood. Ncos police officers had suggested that these starting Rhymin the NCO supervisor attend the next public safety meeting. Ted roster concerns also the NCOs build the block. Meanings are not getting out to the public. They need to find a way to be more effective. This will be discussed at the next public safety meeting with charging Rhymin topic of abandoned cars left. The first ended times in the street in the hundred and fourth was discussed police officers and agitated that there are two companies that are doing roto within one hundred and fourth Precinct. She stated if a car is not towed, it can be booted. My experience is I have cars around the neighborhood for over three months without plates at estate plates and we're getting no response from 104Th producing, so that was brought up and I'm still waiting on answers from the captain. Let's see which he who birch stated that, according to councilman Holden, there are numerous towing companies that were associated with the Ms-13 gang, the topic of policing, with the proposed homeless, shelter at seventy eight. Sixteen was discussed. Police officers in had stated that there would be patrols in the area of the proposed homeless shelter. The question was asked how many patrol cars are usually operating on each shift police officers and adds they did that in a number of officers on each patrol varies and patrols decrease after any arrest is made with decreasing just doing quick math on average there's, usually not more than four patrols in 100, the fourth percent. So keep that in mind. Marian Lattanzi Oh stated that one hundred and forty cop was willing to do more D patrols around the shelter site, especially during school dismissal time Dismissal, Times and Liberty Park area England. A police officer tonight stated that in the past month, in the Liberty Park area of Glendale, one hundred and fourth Precinct officers were allowed. Sixty parking, summonses and thirty- eight moving violations was also the concern of mandating the use of bicycle helmets. The concern about the new bail reform was addressed and police officer sanad stated that since the bail reform just went into effect in January 2020, it is too soon to tell if there has been a crime increasing. Since Valerie forum also went over the topic of double and triple parking cars, especially around schools hundred and fourth Precinct said they would try and address it. They understand it's a growing concern and possesses a danger to children acrosss the industry. That's it thank question. I apologize that I was not able to make the public safety committee I'm on the public Safety committee, also in our emails. If anybody did not see the legislation, that's going to come up about legalizing sex work, I also think that would fall under Public Safety and if it goes that route I would think like other countries. Maybe there should be areas of the city. I do not know which communities where there should be, maybe red- light district being a lot of health mandates. That was good, so I reached out the Barnwell on that, and he said that's been in committee for over since last session, and it has not moved so. That's all I know about it. I've heard about it today, just as you did next question not charge in the talking about the abandoned vehicles. Did you I ran into this problem? In my neighborhood, where there can't you tell them the tow company, whatever get the police and they said no, the Sanitation has to put some kind of a sticker on there. There's a conflict between Sanitation police and tow companies. Did you generally speaking, if a car, if the vehicle has no plates on it, sanitation then takes it. If the vehicle has plates on it, then it has to go to roto. The problem is in one hundred and fourth Precinct, there's only two. According to the precinct, there's only two companies that will do rotos and they are at capacity so unless there's capacity at their yard, where at their mercy for when they will do it, we asked what could be done to get more companies on this rotating list and we did not get any real answers. I do not know about sanitation, that's what is they have no plate. Sanitation is citywide there, supposedly going to close down the big toad by the police department. So if there's no place to tell them we're not going to get them toad because I think you need to talk to the elected officials that are approving all these stupid measures. Yes, my neighbor had documented proof that a car was parked on traffic avenue for over a year because she would Google Street and from the year previous, and it was in the exact same position: we've been working with go Holden's office. They did get a thing or two they got. The travel trailer moved the back end, loader a front- end, loader whatever it is, it's still sitting there, but we got the same. Danny got the same reply, there's not enough tow truck companies and there's not enough place to put the cars. Yes Walter. Yes, when you were reporting that this crime is up, five, his crime is up floor. Can you give us the total many papers here, all right, so in 2020? So for the 28-day period, which is from the meeting of January 22nd in century less than 28 days, there was zero murders, one rape, 18, robberies, 21, felony assaults, 17 burglaries, 45, Grand, Larceny and five days, because the police gave them more up to date. Thank you. No problem. Next committee transportation and public transit John. Okay, we met on Tuesday, January 28th in the board office. Much of our early discussion was transportation, public transit, related I'm. Sorry, the El train is still on target to end early we're looking at monthly closures on the El that might affect people that live directly on the El for access between Broadway, junction and Lorimer, but that is for one more weekend, which is I, think the weekend coming up and one more weekend in March and then in April. We should be seeing the end of the service on the L train being slowed during the weekends and overnights, but that also means in April we're going to see the extended service on the M diminish as well. So that's not for me personally, that's not a happy moment, because the M train has been really a wonderful thing. These last almost a year now we're also very much concerned about the M train structure not being painted in the period of time that it was supposed to be painted. We were told last year that they would hopefully get to the northern end just at the part of the system that ends after the Fresh Pond Road station, where it becomes a grade level would be painted all the way down towards Seneca and that they would be moving down by the end of the summer fall time into Brooklyn, and at this point, there's been so much structural steel work that the painting has really only happened under the forest Avenue Station. You see a lot of work currently at the road level, where they're actually shoring up the stanchions to keep the structure up in the air under the Seneca Avenue station. At this time, we'll keep you updated on that when we know more, the other big topic of conversation was, of course, the bus read redesign. We had a session here. We had the first public session here in Ridgewood, hosted by the greater Richard Youth Council at the end of January, we're going to have our next meeting in this space here at the last Tuesday of February, and it's going to start at 6:30 and it will involve the bus redesign people from the MTA presenting and getting our feedback. So please bring people out. We expect and that's why we got this space- is that we could have a larger space to work with them and hopefully do some, maybe some tables where they can do a little bit more planning, work and kind of communication with people on a more intimate basis and hopefully we'll get in the rest of our committee. Work as well, but next month might be for the committee members a slightly longer meeting if we do get to our usual street safety improvements, the other things we just reviewed, the normal capital projects, our biggest advocate in the city, I, would say, and possibly in the state for the Myrtle Avenue improve moral Avenue. The Wyckoff Avenue improvements from the Brooklyn border, all the way to our border. At the eastern end is Vincent our Kure, our chair, who is always keeping this alive. It's we've seen two different sets of plans. We are not seeing anybody at the state or federal level really taking this as an initiative to get it moving, though that is a corridor. That's had a lot of growth and change over the last 20 years, we'd like to really see it addressed as that Street is deteriorating. At the same time, we are seeing some movement on the Grand Street bridge. They are doing surveying. We have not had as many closures on that recently for emergency work, but it is underway for the planning. Hopefully, we will see some future plans come to the office and a better timeline for when it will be replaced, and hopefully it will be replaced with something a little bit more substantial to allow the traffic that's really needed to serve those communities and bus depot and the transit that's happening over there with trucking and everything in the Maspeth district. The last thing, I'd like to say is: if you have recommendations for roadway resurfacing, please write them into the board, get them in, because we want to compile a list in a timely fashion to get that to do T. So we can get on the calendar for the year, like I, said the next meeting, 6:30 Christ, the King cafeteria on Tuesday, February, 25th, I, believe yep. Any questions. Sorry I like to ask Councilmember and also to give us an update report on the next meeting on Wyckoff Avenue reconstruction, because, as John said, we can't get any answers and it's seven or eight years now. It's eight. It says 28 years, since that project was first proposed and the only people that spoke about it and pushed for it was greeting board five Queens and we're very disappointed. I personally am very disappointed in our elected officials in not pushing this Interborough project because it runs from Flushing Avenue to Cooper a view. The full length of Wycoff and I do not know. If you have a drive Wyckoff a view, but from Myrtle Avenue to Cooper. You need a tank to maneuver through the holes in the road, so I'd, like that's my request, did I miss any committees, any other committees to report. Okay, then a motion to adjourn Walter and whoever was yes. Oh yes, Tony thanks for feeding, us[ Applause].",
            "summary": "I've written on visible neighbors I speak on a weekly basis at public meetings and Arthur talks to advocate for the homeless and educate thousands of people in the community on common misconceptions of homelessness, which keep us divided.\nI am continuing to work to alleviate the community's concerns so that we can work together to help our less fortunate neighbors catering for the homeless has provided services and education for most 100,000 people throughout Queens in New, York City.\nThis year, I project that catering for the homeless will serve a hundred to two hundred thousand people in September of 2017 Senator Joseph Addabbo passed a food law that all schools from the pre- k to the university level must donate their food access to organizations like mine who can distribute it to those in need.\nThis law was passed, I invite the community to sign my petition to the deal we requesting them to comply with this law and allow schools to give the food access instead of throwing it away with 133 billion pounds of food going to waste.\nMy goal is to feed millions of people every year and end hunger by utilizing what we have been wasting for those who have not I'm the author of several books in different genres, and my latest slaver of love will be released on February 14th in the origin of time.\nThis is an open letter to Camille Watt lamp is elected official arrow in the mid to end of 1990s I, along with other community members, advocated for greater entry, Youth Council in support of funding for after- school programs.\nI, then in 2001 brought the parents concerns to all elected officials and Bob Monaghan director of gry, see that was almost 20 years ago in December 2019 CB, v Portland meeting I provided a copy of New York state controllers and a police order regarding their findings of the UIC D and G Ry C New York State Controller DiNapoli's findings were very disturbing and scathing.\nThe, New, York state controllers, reported 2019 merit concerns back to 2001 and throughout the years.\nAfter sharing copies of New York state controllers in our Police June 2019, ordered at the December 2019 CB 5, but monthly board meeting I have been slandered as well as my family.\nLet me say it again: It's a distraction to take the focus away from the 2019 ordered by New York State Controller DiNapoli's office, which, by the way, I did not write.\nWhat Fresh, Pond Road has to offer, and certainly in that way, not only help the community to help the Federation We got a letter from the 100 4th precinct, which was sent to the community assistance office, supporting the festival again, stating that there were zero incidents in the last year's festival.\nIt was not on I hope to bring my grandkids here, but I also know people from other communities either be mass, but in Glendale attend this feast I do not want to take up too much time, but thank you so much and please consider what a great festival that is, for the whole community[ Applause] we'll try to give you the same attention.\nThe railroad is in the way the people who come to the festival there's no of no applause at the festival, but they feel free to use traffic avenue as a vomitorium and peace walk and garbage them and to park in all our driveways.\nThis year, Assemblyman Brian Barnwell, has submitted it again, reintroduced it and is working with some of our fellow assembly members, Cathy Nolan and Mike Miller, who are co, But we need to get the chair of the committee to act on it and get it out to the floor where we believe it will.\nHey how's, that bail reform thing working out for everyone under New York's justice reform prosecutors have to hand over all evidence to criminals in 15 days or its gets dismissed, including names addresses in contact in for victims and witnesses.\nProject, promote 11 uu in Ridgewood between Wyckoff Avenue and Fresh, Pond, Road and immediate adjacent side, streets.\nThank you for your support for a new capital improvement project from Myrtle Avenue in Ridgewood, which was community board fives number five priority for FY 2011 ooh in Ridgewood, between Wyckoff and palmetto and Fresh Pond Road, was included in a major capital project was 1983 1984.\nAt that time the project was under the New York City's commercial, revitalization program and included in two major improvements to the shopping corridor and a new concrete sidewalks with brick.\nIn this community 71 years, I now teach automotive technology at CUNY in Bronx, Community College, which is the only automotive program offered by CUNY I'm here tonight, to inform everybody that we're running out of mechanics rapidly and when we run out of mechanics everything's going to stop working, we'll have no cars, no trains, no buses, no way to get around and no lights.\nSeveral articles that I sent over that the board office today, promoting especially automotive education as really a very good career for young people to get into they can get high- paying jobs.\nMost of my friends that own shops are paying people one two three thousand dollars a week to fix cars and it's a career that somebody can get into with just one or two years of training.\nJust keep in mind anybody in your family, any friends, relatives, young people that need to decide if what kind of career they want to have look into the Technical Trades.\nSo the committee reviewed it and recommends not approving the Fresh Pond Road street festival, as presented on the question.\nThe committee recommends for any question or comment: Fresh Pond and Forest Avenue.\nThe next item is the murder: LabVIEW bid, Myrtle, a view, festival, September, 13th, Wyckoff, a happy new Fresh Pond Road sponsored by the Myrtle Avenue Business Improvement District on the discussion.\nThings like this after 5 o'clock is nice for members of the community to go talk to him directly when he's here in the district- Let me know just a couple minutes before that the state Senate is working currently on bail.\nWe want to keep having people take advantage of the things that they qualify for under the city and state, as I announced last time.\nIf you know anybody that needs to fulfill service hours, please send them our way or if you want to donate PB&J, that'd be great too and lastly, Brian is working on scheduling There's one on the 9th of March which councilman Holden's office has been helping with As. Well we're trying to get ones all acrosss, our district and Woodside and Asketh.\nIt does not even address the issues we brought up, so we have filed a notice of appeal on that and the second group going before BSA the letter to revoke is based on the objections that have been filed and we're expecting in another 20 days to be in front of the board of Standard at appeal, and there has been an audit on the property and requested on the property next door where that artistic stitches, so we're hoping that these things start to fall in place, and maybe there's a possibility that we can delay these projects at least get them legal, because they're not and that's all I can tell you at this point question without a contract.\nBut we need to reinforce the board's position on this very important contract like to make a motion for a vote on this place.\nPublic Safety Committee met on Wednesday January 22nd at the Community Board Office meeting came to order at 7:35 p.m. only police, officer.\nThe first ended times in the street in the hundred and fourth was discussed police officers and agitated that there are two companies that are doing roto within one hundred and fourth Precinct.\nPolice officers in had stated that there would be patrols in the area of the proposed homeless.\nA police officer tonight stated that in the past month, in the Liberty Park area of Glendale, one hundred and fourth Precinct officers were allowed.\nThe concern about the new bail reform was addressed and police officer sanad stated that since the bail reform just went into effect in January 2020, it is too soon to tell if there has been a crime.\nMy neighbor had documented proof that a car was parked on traffic avenue for over a year because she would Google Street and from the year previous, and it was in the exact same position: We've been working with go Holden's office.\nJust at the part of the system that ends after the Fresh Pond Road station, where it becomes a grade level, would be painted all the way down towards Seneca and that they would be moving down by the end of the summer fall time into Brooklyn, and at this point, there's been so much structural steel work that the painting has really only happened under the forest.\nWork as well, but next month might be for the committee members a slightly longer meeting if we do get to our usual street safety improvements, the other things we just reviewed, the normal capital projects, our biggest advocate in the city, I, would say, and possibly in the state for the Myrtle Avenue, improve moral Avenue.\nSorry I like to ask Councilmember, and also to give us an update report on the next meeting on Wyckoff Avenue reconstruction, It says 28 years, since that project was first proposed and The. Only people that spoke about it and pushed for it was greeting board."
        }
    }
}