{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Arts \\u0026 Cultural Affairs Subcommittee - Nov 9",
            "publishDate": "2020-11-12",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    Report on DCLA initiatives for Arts organizations\\n3.    Report on A\\u0026CA Survey response and update to A\\u0026CA Resource file\\n4.    Vote to adjourn",
            "lengthSeconds": "1:13:39"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "1tnqJZhWHTE",
            "fillerWordCount": {
                "uh": 106,
                "um": 131
            },
            "readTimeFullTranscript": "42 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "agenda": 41,
                "arts": 41,
                "town": 35,
                "culture": 26,
                "hall": 25,
                "minutes": 23,
                "rate": 17,
                "council": 17,
                "member": 14,
                "chair": 13
            },
            "wordCountSummary": {
                "arts": 20,
                "culture": 16,
                "town": 15,
                "hall": 11,
                "agenda": 7,
                "chair": 5,
                "state": 4,
                "member": 4,
                "minutes": 4,
                "context": 3
            },
            "fullTranscript": "In order to have a speak as a public member, you have to sign up prior to the meeting. Okay, so can I answer that first yeah. So this is not the case at land use. We always hear people that show up and they just raise their hands like we first hear from the committee members and then anybody from the public and raising issue. However, what happened in the past is when Alicia showed up a year ago, and she had some very meaningful remarks about the subcommittee when she actually hibernated the subcommittee because of some procedural issues. All that conversation, what Susan Stette recommended that we do who's our district office manager. Was that those kind of conversations when they're not in the agenda? But you know they occur because they're time sensitive like, for instance, she was hibernating, the entire subcommittee and everybody need to be aware of that they could have been discussing the public part of the of the meeting. You know, let me so. Let me add my two cents here from a procedural perspective, so carolyn what the office told you is correct when it comes to the full board meeting public session at the full board meeting, they have to sign up in advance, okay or committee meetings. It's really up to the chair. As far as what how you want to run your meeting and how you want to structure it from a parts perspective as you've can trevor do sometimes trevor. If there is something that somebody wants to talk about, that's not on the agenda trevor will do it before he starts the official agenda. But just remember you can't really discuss or vote on anything, that's not on the agenda. Somebody can talk about it, but there can't really be an official discussion or a vote from the board because it was not on the agenda right. So olympia you I, am present. Okay, so Olympia can talk about her from the amendments to the resolution if she still wants to. But theoretically the committee can not discuss or vote on them because it was not on tonight's agenda. Yes, and by the way, I want to inform all the committee members about what happened and what I personally did as a follow-up with the borough president because it impacts them too. So that's what I want to discuss and then the friendly amendments- and we present them at exec and I- already sent them ahead of time to the two chairs. So is there a time limit on discussion again, not a discussion? It's representation. You can have two five or no limits depending yeah. That's again, it's up to you. You know, like I, said again just using trevor as an example. Trevor usually limits people to two minutes, but that's because parks is really very crowded and there's a lot of people. So if you want to put a time limit, you can but the minimum is usually two minutes. Okay, all right, fine, but we still also have not officially started the meeting president, it's crystal because I've only seen you Michael, I'm sorry, I'm only seeing you and then olympia when she signed them. So on the screen view options, it might be on Speaker mode at the top. It says to view to view it as well. The other thing is because I'm sharing my screen, everybody is now pushed to the side. Do you want me to stop sharing the screen and then you'll get the full screen back? Oh, okay, fine thanks! I'm not I'm calling in you're calling in okay, yeah I, see you're not going to see me all right. Fine, but, okay, all right great! Currently, because you can see Tariq has his hand up for a while. Now, okay, let's see I just have a- is that you crystal no that's true Greek is asking if the resolution it was in the previous minutes. Yes, thank you not in this minute. No, it's in the minutes from the October meeting. Yes, does that answer your question yeah, but the minutes need to be approved by the committee right. First and foremost, we have to do that: hey, tati, okay, great, thank you! Hey laura before I feel comfortable voting. I'd like to hear what the issue was right. Yes, that's, fine, okay, so Olivia! Do you want to take two minutes to explain what your issue is with the resolution? Great. Do you want to start the recording or the recording is on? The official meeting is on great? Yes, so hi everybody. So for those who have read it, we passed two resolutions at the past subcommittee meeting of arts and culture, but you know, unfortunately, because of the way the calendar has been set for CB3. Unlike most of the other resolutions, every resolution of our subcommittee reaches the full board with one month and a half of delay, because the committee to which we report meets after us now at the at the past. You know art and culture committee. We had announced on our calendar properly everything that we were discussing and nobody actually showed up to discuss the issue. Very few people were there and then, when the resolution was presented, that economic development, there were a few members of the committee and a few members of the public that had some issues with it. However, it became apparent that these members had not read the actual. You know work that was referred to and they raised some concerns, because our resolution unfortunately did not have enough context, so we offered to them to give the missing context, because this is a resolution about a bill, especially drafted by the chair of the arts and culture Committee of the City Council, to address very fair concerns of architectural organizations that are currently banned. It is basically complete battle on them doing anything outdoors. There is no permitting process and they can under any circumstances they can not use any amplified sound, so imagine doing theater or dance or anything without any amplification. That, of course, has a huge impact, both at the organizations and their viability. These are treasured organizations locally. It has a huge impact on the artists that live in the neighborhood and the rest of the city, because they could have been creating some money, while the federal aid has ended and they have not had any enhanced benefits and, of course it has a huge impact on the arts and culture community at large us that we did not have the opportunity of doing these beautiful things out in our district. This summer, so anyway, I was I, think that caroline and I did our best efforts to address the concerns that were fairly raised, but we were met with very inappropriate situations in which I actually had to call a point of order, because obviously this was a and basically what felt to me an inappropriate way, an unfriendly way of not allowing us even to present as friendly amendments the context that was missing. These were people that raised fair concerns around nightlife establishments, but they had nothing to do with what we were discussing anyway. I did send a note to the borough president, explaining how unfortunate it is, the timing of our committee, how improperly a lot of the issues that were raised there were not focusing on the on the content of the legislation that we were endorsing and the issues that the arts and cultural community is facing and how this was actually a disservice to the argent cultural community at large, in our district I personally, do not care about community board politics, but I do care about arts and culture in community board, three districts and so I. I'm very concerned about that, and so that's why I made my greatest effort to create those friendly amendments and to send that note and I already talked with the office of the borough president and I'm hoping for you know a better way to address that in you know both procedurally and you know, content-wise for arts and culture. Sorry I probably talked more than two minutes, but it was a lot to give okay all right. So thank you very much olivia and can I ask a question. What do you mean by context? You mean you mean the reason why we want this. Is that what you mean by context that's different from night life? Yes, some of the people that attending the economic development were raising fair concerns about you know you know, but things that had to do with you know illegal right, I, understand, yeah, I, think it's the main issue with most of the people on the Economic Development Committee had to do with amplified sound and how whether it was or was not regulated, and if so, how? Because when reading the intro amplified sound is not the only issue that he's addressing so the Intro actually is not addressing amplified sound. Caroline, it's executive order that addresses amplified sound I realize that it's the executive order that addresses the amplified sound, but the legislation leak that was provided leads to the summary and the intro for the legislation where it's described. I think people are very much in favor of trying to help arts and culture to be able to have performances on the street, but I do not want to get into a discussion if that's something that we're not allowed to do at the meeting right now that you know, basically that we have to take your presentation as it is, and that the issue will be discussed exactly I think Elisa had raised her hand, yeah I was about to let her know. You've got a hand up by Asia, okay, fine. My thing is I hope we take this up, though, in the future, because it is important. My comment is quick. It just is to sort of reiterate that I do not think anybody is opposed to supporting arts and culture. It was the way that the particular resolution was drafted to only specifically talk about, amplified, sound, which anybody in this community board can tell. You is an issue that crosses many committees, not just economic development. It is SLA, it's all over the place, so having a resolution that focused on that brought a lot of feelings about having amplified sound, which distracted, I think from the central issue of having a program like open streets for arts and culture. So I think there was a little bit of miscommunication about what the actual legislation supported, because it was presented one way, but the legislation focuses on process. I would say not just about that. So I think that there is a way to still get that I. Think the bigger question about this subcommittee and how it works is something that needs to be addressed for sure and can be figured out at another time. Carolyn you've got hands up from Tariq and from Olympia okay, turning into a discussion which it should not be, but right. Yes, no I have nothing further. Is this something that can be added to either December or January's meeting? It? Can be added to the December agenda on the action I suppose that is, we can request that it be added to the December agenda Michael that Michael just a quick clarification. Does that go to execs agenda or does that go to arts and cultures Committee agenda that it will go on your agenda? Okay, it will go on the arts and culture agenda, because I have to request it to be on the agenda for December yeah. Typically tariq again, you know there's a lot of new members, so they're not too familiar with the processes carolyn, but typically for items to get on the committee agenda. It's just the chair has to request that it be put on the agenda, so Carol will do that. It will be on the agenda for the next meeting more most of the time. Exec does not hear agenda items like this that require resolutions unless it's some sort of an emergency situation. Thank you, okay, Olivia, so yeah. So what I wanted to address, especially for tariq and other new members, is because there was a point of order, because this procedurally was not. You know a standard procedure. So normally all these people who had their concerns, they should have attended our meetings, because otherwise, why do we have these meetings in which there was you know properly announced in the October calendar, with all the details of the legislation that was going to be discussed and they could have had you know all these questions around? What does that mean? And how do you write the extra language that makes sure that clarifies even to someone who does not want to go ahead and read the rest of the context? Do not worry, do not worry, I'll give you sorry. He just dropped his past, I'm going to go and put him a plate, but basically so because there is a point of order. Issue I will be attending this. This month's executive committee and I raised it to the border president, and there may be you know earlier resolution, because really there is no substantive disagreement right. There is like they wanted context that this is not for bar, so that could easily be a friendly amendment. If people were you know using the standard process that we used for many years at CB3, so it could, it could happen earlier. It really depends to the Cp3 leadership, like not just the two chairs, but the exec as a whole yeah. So the issue will be discussed at Exact. We know that and I'll be there as well. Ah, yes, as will Anisha and Michael, so at any rate, should we go forward now to the approval of last month's minutes yeah. Is there a motion to approve last month's minutes? I shall move okay tariq? Have you read them? Okay? Would you like to second that amendment her motion I, do not think you need a second I think we just do not need a motion at all carolyn. You can just vote all right, so all those in favor of approving the October minutes. Yes, can you see us or should we say, should we put in the chat? Yes yeah? Should everybody sign into the chat? Well, the board members do not really need to sign in you know, for prosperity and for the recording, I. Think if why do not? We just do a quick roll call, so approval of minutes, Carolyn, Redcliffe, Okay, Tariq Durrell, yes, Tatiana Crystal, I'm sorry, I, do not know your last name but crystal healed. Yes, okay is Andrea on your committee, also, no, but at any rate, if the other people that are in the meeting, if you could please sign in to the chat, it would be most appreciated so that I can add your name to the minutes. For this meeting. Okay, all right I had included in an email to you guys the DCLA initiatives for arts organizations. Have you all reviewed it by any chance? What are you saying that the thing that tcla sent out- yes, yeah? We read it okay, well, are there any comments on it or is it? How would you like just not going to decide of anything? Yet that's what I got from it? Yeah, that's a general understanding. They probably do not know. If they're going to have any money to give out. That's all yeah I think that they were funded, but it's just reduced, but the other thing about it is that, as we all know that the discretionary funds for our district were cut drastically by Corey Johnson I did not know that yes, Carlina was awarded 225,000 for the entire year as compared to 11 million and some odd 100,000 last year. So that was their reason given for yes, because she did not vote for the budget and he punished her yeah. Well, okay, it would not be the first time yep, but it does create a drag for small arts organizations that normally apply for discretionary funds to go through DCLA, which has been a hot and burning issue. So did you get a chance to look at it? Anybody else have comments on it. Okay, so should we go on to the art style? Yes, you sent this in an email. Yes, I did okay, I think what you're referring to is. You just forwarded us the newsletter that the commissioner sends to arts and cultural people or something else, I think that was what I was referring to? Yes, that's what I thought so she sent it a little while ago right, not recently yeah. Thank you, okay. The one comment I can make caroline about it is that I feel what we should put in the agenda is now that you know we have some good news and let's see what Georgia will deliver whatever aid the city will receive. We definitely need like that resolution that the economic development did not kill the one about the working like the employment program right yeah. Could you so I think this is very important, and so we could invite somebody from DCLA in the next months, based on what the relief package looks like to further push them about. What are you doing around this issue because it is going to be a huge issue for artists right? It will be a huge issue, but do I really have an answer if I they won't have an answer, because, with the number of lawsuits that the opposition is leveling out, you know it's going to take a few to get to January. 20Th I think it would be great to have a representative from DCLA come, but perhaps we should wait till January or February to ask them to come. They might have a better idea. I mean it depends what whether we want them to present or whether we want them to hear basically right now. There is a very interesting movement from a lot of progressives in New York state to get the governor to give relief to the city before December, because in December a lot of people actually are going to have zero like right. Now they do not have the enhanced unemployment benefits, but 25 million I think only in New York I was reading earlier today are to have zero income like no benefits at all. So that's why a lot of people are putting more pressure now to the governor to make sure that this comes, and if this comes I think it is our responsibility to ask that they immediately start programs for arts and cultural workers and organizations like fast rapid grants or something like that. I think. It's I think it's a nice idea to invite somebody you know just to for them to know that we exist right and I do know the lady who is the new person who's taking the place of Kathy hughes I, could not I could ask her I do not know if she's the one you want, though I think it has to go through the community board in terms of making that request crystal through the office. But the other thing that's also a possibility is whether or not if we want to request somebody from Senator Serrano's office since he's the head of the state arts and culture committee to possibly come and speak to us about what are the possibilities, because he's been very proactive in terms of trying to help the arts and culture. I do not know. I do not know. His name is Jose Serrano. He is the senator of state senator from the Bronx, but he heads the arts and culture committee. I've heard his name, but okay, so yeah I, think carolyn is that I think it's good for them Carolyn? Is that something you as chair, reach out to his office? Do you need support reaching out to his office I reach out to the district office and tell them that this is what we would like and they reach out to the elected officials? It's my understanding, the process, great okay. So any more comments about DCLA, tati, Andrea, sorry I did not raise my hand. I did not raise my hand. Sorry I can speak at it now. Yeah I mean I think it would be important to follow up. I mean I'm see, I'm also seeing the same as Tariq and all I received was a newsletter. I did not receive a specific report and that to me it seems like there is there's a there's. A conversation with cultural affairs happening on virtual programming. Accessibility happening tomorrow, so I'd be curious to see what the outcomes are. Of that conversation, so I mean yeah. I'd, be interested in putting this on the December agenda. Okay, on the December agenda yeah and seeing if we could have representatives come speak to us about because yeah these just seem. This newsletter seems like some vague proposals. Nothing firm yet so I would be curious to see what's going on. Yep okay else have a comment on the committee. I just think. It's a good idea for them to know we exist and for us to you know, talk to them and they talk to us and nothing is settled. Everything is in flux. That's okay! You know that's what it is, but that does not mean we should not have a relationship with them. No, it does not, but at any rate I will include it in the agenda for December. Okay, all right, so we want to move on to a report on the Ahca survey response an update to the resource file clatty. Would you like to do a report on that sure in terms of the survey I sent it to carolyn again today, but I can share it with all the board members so that everyone, if you would with the committee that would be great yeah, so we can all have access to it, but yeah I mean we only got seven responses from like I think over 100 organizations, so I think maybe it's not the most effective way. Everyone's sort of saying it's very basically, just as a refresher, the survey asked how Covid-19 impacted your organization and what your current support needs are everyone. You know it's nothing, really new detrimental, no idea when indoor live performances will happen again. Support is needed to be allowed to claim parking spots in front of buildings. So there's some I do not know. If you want me to continue going through some points, but I can yeah. Okay, excuse me: what do you mean by claim parking spots? You mean to perform yeah, that's right! That's what how interesting yeah that's, what some great it's bonded! Other organizations are saying they had to cancel or postpone until who knows when our spring live presentations and a major spring tour struggling with doing virtual presentations, no income stream losing ticket income and presentation income. All of our youth dance classes went online in the spring, but we do not anticipate reaching the capacity of this program in the fall. That's from the East village dance project, not successful in securing grant funding had to close all three of our studios. This is including the 55 avenue C studio for dance and healing arts. Yeah very weak was that from go productions or from east village dance, I'm not sure who that was I'm right now, I'm just reading the responses, but five avenue C is not that moving for life movement for life. It's go. Productions has the leads for the building or for the space. It's a dance studio. I do not see. I do not see that organization, as listed I have yeah I. Do not see that one listed, it's broad rock dance company I do not know if that could be it or Chen dance. My progress is on fourth street's arts club, okay, so yeah, I'm not sure. Then yeah East village, dance company used to be at Avenue C and then moved to Henry Street yeah. We should be able to see when we look at like the full survey results but katie. How was the survey sent out email? It was it's a Google form that was yeah I know, so it was just a reserve that we currently have yeah. Okay, let me continue unable to do any of the tours community families whose children study at our school or who attend our shows are unable to participate, artists, unemployment benefits, running out lost income due to cancelled and postponed performances, concerts and events postponed, upcoming gala fundraiser, that was for April 6. So many additional expenses costs occurred as a result of the Covid-19 of Covid-19, her purchase of cleaning supplies, hand, sanitizer hand, soap, etc. Contracting of additional cleaning staff offering paid leave to staff and company dancers again, yeah I think some of this we sent this out a few months ago. So right might not be yeah, but is there anything from arts on site in the surgery because I'd ask them to complete it and send it in seeing that they submitted okay, yeah, I'm not seeing that all right, I think amber just joined us. Maybe so is this data automatically uploaded into the spreadsheet yeah? The spreadsheet is linked to the form, so, once everybody's added as a collaborator, everyone should be able to see both like the responses. Just like you would on a normal Google form and then you would see them in a Google sheet as well. Okay, is it a separate Google sheet, or does it feed into the resource file that we already have? Oh, it's a separate sheet. Yeah there's no way to link it to a current sheet. Yeah all right, I think you've got a hand up by Olympia, okay, Olympia! Thank you so I mean it's. You know it's sad, but not a surprise that we got only seven responses and I think the best way to both hear people's responses, but also maybe give them some relief would be for us to organize a town hall. The way the Harlem Community Board did and a few others where we actually invite the commissioner maybe of the Department of Cultural Affairs and the mayor's office of media and entertainment, and we invite many local organizations to submit questions and our committee. You know, moderates Et, cetera many other community boards have done it and I think it would make a lot of sense for us to do it because I mean to be honest. I do not know. I. Do not I do not think we should be focusing so much on right now, updating that spreadsheet, because we really do not know how many of these organizations will be there like at the end of this tune at the other side of this channel. But we do know that right now, a lot of them are struggling and giving them a town hall. The way other community boards have done I think is the right thing to do so that can be added to the December agenda. Discussion. Jury. Did you have a comment? Yeah I mean I agree with Olympia I think you know, maybe also not I know we spoke about the senator or even us, the City Council person who oversees arts and culture I think maybe that's a great opportunity for our committee to organize that town hall and invite the senator who oversees arts and culture, the city Council member oversees arts and culture the commissioner and have them come and speak and give a presentation to arts and culture organizations I. Think many organizations will take time to come to a town hall and hear from a presentation about what's happening on the state city level and that pertains to them and then from there as committee members, we can share taking notes to help build some context as to what's going on in our in our district with the organizations, and then we can better plan as a committee moving into the new year of how we want to support, but I also think inviting I also think inviting public school principals from the district, because a lot of arts and culture organizations serve those schools and can not moving forward and so that. How does that impact our public schools and our students, which is a collaboration probably with the youth, youth and education committee, so I think the whole community board? As a you know, most committees can take part in this whole town, Hall conversation well that I do not know how that would ride, but you know we can put it forward and see in terms of involving the other committees Anisha. Would you like to comment on that I think when Community board has town halls any board, member can attend I. Think there is arts, and culture is one of those sectors or topics that cuts across so many committees, whether it's I mean, certainly, as you all know, whether you like it or not- economic development, but also you know, parks, Transportation, Health and Human services. I do think that there would be certainly board members and people from each of those committees. That would love to hear you know what elected officials or, frankly, anybody in power is planning to do to like help all of the artists that are artists and cultural institutions that are struggling in our district right. So is this something that we would have to deal with exactly in terms of asking other committee members or other committees if they want to be involved, I mean generally in the past, when we've done town halls, it's been strictly generated out of arts and culture and that we've done presentations and ask we've had representatives from NYCHA, not NYCHA from Knife Niska DCLA, New, York Foundation for the arts, the Manhattan cultural council has been the usual garden variety of panelists that we've had, it seems, like your committee, would still be responsible for sort of putting it all together, but perhaps like asking other committees to attend, or if people have ideas might be perfectly fine. Is this something we have to work through the district office? Yes, it is, it has to be approved by the district office. Okay, I think that they can help coordinate some things. I do not know if they I do not think the district office has any approval over anything. Frankly, I think you would talk to the chair, but I'm sure Susan and Jim, and everybody would help you coordinate schedules and try to find a date and etcetera, etc. I think perhaps there's less logistics, because it does not have to be in a physical space right now, but usually they help with that. Well, considering the fact that it would have to be on zoom and we'd have to get the office to set that up great. Do we just want to get on an email just to help organ? We can't, unfortunately, because of the open meeting law is my understanding. We can't discuss committee business outside of an open meeting which is difficult at times, but that's the way it is so at any rate, it can be discussed at the December meeting as to when we would. You know, suggest that we do a town hall and plan, for it can be on the December agenda. Yeah I mean once you guys it's my understanding, but you can confirm this with Susan that you know you can do some of the planning, as far as you know, sorting out logistics via email. That does not need to all be during a meeting because of open meeting law like you're allowed to plan logistics and send invitations to people, but the overall sort of decision to do it and what it's going to encompass should be done during an open meeting that people can weigh in on right and you've got hands up from Olympia and Tachi, okay, okay, so taji you want to go first and then Olympia yeah, sure no I think I forgot to lower my hand, but no I was just agreeing that I think that this is a good idea to plan this town hall and I. Think that, from my understanding, because I've had this issue before with the open meetings law that if we decide once we do, approve it. If we do decide things like to delegate to board members like tasks that can be done, if it's like decided at the board meeting, that can be done before the next arts and cultural meeting. So if that helps at all, okay olympia, yes, I also wanted to clarify, because I think there is some confusion. The only thing that the office needs to do is invitations to elected officials and things like that right, but in terms of outreach, this is going to be a public meeting. So in terms of outreach, if you want to outreach to principals, as you said, after school programs etc, we are all citizens. This is a public meeting. We can all invite everybody, we know, and we should do that. The other confusion is around. The issue of this needs to be in the agenda. This can already be scheduled, does not need to be in the agenda in what sense today, in the minutes we're going to say that, in response to the items in the agenda, what is happening with the updates that you had from DCLA et cetera and what is happening with the survey as part of the conversation of those items that are in the agenda? What this committee decided is that we do want to host this so from now from unless you get a negative response. Sorry somebody, oh my god, sorry I need to decline. Something and my kids are dying. I think sorry, but basically no they're, not dying. It's just you know like llama, died on Netflix. Okay, sorry, okay, sorry about that. So the other thing that I wanted to address is that basically we are okay. It's the discussion today. Procedurally is okay that it is happening. This is an open public meeting and it had the agenda, so we can actually already say we as a committee. What we are proposing is we want to have a town hall asap, so if it is possible to have it in December or in early January, we can already decide this today in this public meeting. Okay, olympia, just a minute. Okay, my understanding is from the meeting is because it's not on the agenda. We can't vote on it, okay, but it could be if it's tangentially, okay appropriate to what we're talking about. Can you hold on just a minute? You do not! No I am because I'm the chair of the meeting okay go ahead. Thank you, okay, look! My understanding is, it is not on the agenda. We can't vote to do it. Okay, we can put it on the agenda for December and say at that point in time that we want to discuss the organization of a town, Hall Zone Meeting, and to invite the representatives from the city and the state and whoever that we want to attend that meeting. Okay and at that point in time it will be official, but this is what we're discussing and that way we can vote on it and do it and come up with the suggested date for the town, Hall. Okay, my understanding is that now because of what is on this agenda, that we can not do that, okay I can I, have it I have a different understanding: okay, fine! So basically what I recommend to the committee to do, because we may have time sensitivity issues. Is that I recommend that since we discussed it today, it is included in the minutes that this is the desire of this committee and then, if indeed, caroline is right and procedurally, we also need to vote on that in the past. We did not have to vote for this kind of you know. Special meetings like we had special hearings around land use and we did not have to vote about them. The issue arise, so we had a special hearing and we had public officials attended and so I think that this is an option that we do have. So, if caroline is right, we may just need to have also an item in the agenda, but if, if I, my recollection is correct, we may actually just need to make sure it is mentioned today in the minutes. It goes to the minutes that it was discussed and particularly in relationship to the DCLA, and that because I do not think it really fits under the other agenda. Anisha has her hand up, but I just want to interject something here. So I do think that you're talking about doing a town hall, which is not a official community board meeting. So, unlike an official community board meeting where Prop you know, prior notice is supposed to be given, so that members of the public can attend it, and you know there has to be a set agenda and Yada and there's attendance. Taking a town hall is basically for lack of a better term, a special event. So for those reasons it does not necessarily fall under a lot of the same restrictions as it does to plan a meeting, I'm not saying that you're wrong carolyn and that you need to get permission to do it. I still think you need to check with Susan on that yeah having been through this several times before, like how many town halls have I done with arts and culture. Please give me credit for having done something in the past and having gone through this experience. Okay, I am not discrediting anything. I am trying to just relay some information. I appreciate that Michael okay. So I'm going to shut up now, because this is not my meeting, I'm just supposed to facilitate, go ahead. All right, anisha I was just going to say that I think that you both are sort of right in the sense, I, you're, muted, sorry, I, think you from my understanding is that this would go in the minutes as sort of the next steps is to explore how to do a town hall and then Carolyn would work with the office to figure out some of the logistics and in the next meeting there could be some potential dates there. Could you know all of those things that the whole committee could agree on so I think it's sort of a hybrid of what you both have said right so that everybody does have a chance, because I think there is some legwork that has to go in. That's not going to be agreed upon by everybody today, because we do not. You do not know it so considering the fact of the experience that I had with the last town hall and the support that came from the district office than the comments about that. I. Think that you know having had this experience a number of times with the district office that I've had some experience in putting town halls together in the process. The other thing is that the fly for the event has to go out on letterhead from the office. It has to be approved by the office before it can go out. One of the problems that we had that occurred with the last town hall is the draft fire was released and that Evie grieve found out about it the day of the event and was quite upset and posted that online in social media, which caused quite a lot of plaque. So I think I would prefer to include the discussion and the minutes under what we talked about with the results of the survey and how the arts organizations that responded, and that we felt that it was appropriate between that and the last information that we see from DCLA that a town helped be hosted and that it would be listed on the agenda for the December meeting, at which point in time we will pick a date and go for that. Why did evie greevy find out so late? The press releases can only be released by the district office. They can not be released by the committee. We can send. The flyer out to the organizations that are on the resource file is my understanding to your friends whatever, if you want to send them out, but first and foremost, we have to draft a flyer that has to be approved by the office. It has to be posted on letterhead and that it has to be the final approval from the office before it goes out, because that was one of the hot and burning issues last year and the flyer that evie brief posted was the draft fire so at any rate, to avoid any further complications. You know, screens I would prefer to have this discussion in the agenda in the minutes, for this meeting, of which you will all get a copy, okay and that it will be listed as being on the December agenda. So are there anything that has her hand up? Carolyn Olympia has a her hand up. Okay, fine olympia, so I think what Anissa said and I think Tariq and I also were conveying. Is there is an urgency and in terms for us to get a turnout at this moment, we will probably need to start organizing right. So we can procedurally have it also spelled out, as an issue said that we're going to discuss further on this in this in December like the first week of December that or second whatever it is our schedule. However, I think in terms of timing, since this is a special event, if there is a consensus from the leadership, if we can get like, for instance, I know, Serrano is hosting right now everyday hearings around these issues. So if we come after, he has already outlined his agenda, our community lost the wagon, and so I think that timing is of essence- and we can stress this in the minutes and make sure that our you know our chair. Whoever is going to be the chair next month. Can you know away, you know about the special event and the time sensitivity of it, yeah carolyn? Would you would you allow me to offer one other piece of advice, or would you rather just move on? Please Michael feel free to express an opinion. Okay, I from my from my experience with the one town hall that I did some of the burden of what you what you and the committee have to do and what the office has to do was alleviated, because what I did was I went to our city, Council member and said hey. We want to do a town hall where you co-sponsor it with us and as soon as she said. Yes, her office took over a lot of the stuff, including making the flyer and the press release and all that stuff. So I would suggest that, maybe, since there is a city council member who is the committee chair for arts and culture- he's not our city council member, but he's a city council member reach out to his office and see if he wants to co-host this with our committee? What about our City Council representative? Why can't she they can both do it? Last year, I went from like March through June, getting dates from elected officials to attend a town hall and because of the structure, the skip meetings for the community board. The only meeting date that the elected officials could agree on was in September and because there was no arts and culture committee meetings scheduled for August that put the burden of planning for this event in September, which gave us approximately three weeks to get it together. So at any rate, I will reach out to our council member and also to Carolina yeah, because strategically that's a really great idea of his you know it is. She would help us right if she will help us do it yeah and if he would help us he's, got the power right, but just because of the experiences that I had last year with the town hall, that it would be helpful if the district office were on board with that you've got raising his hand. So, yes, Terry did you do a lot of that work? Last year alone, we had worked on it in committee trying to get the dates from the council people, but then we had I think Andrea was the gift of doing us, the flyer she did a great job, but it was also the editing that had to go back and forth between the district office that created part of the yeah. Our committee members allowed to support you as the chair in organizing and kind of talking to City Council offices and things that are you familiar with the council person. I'm happy to reach out I'm a pretty kind person. I can reach out and see if they're available and see what we need to do, but I'm happy to help in any way. You know so that you're not doing that work alone. Yeah no I did not do the work. All by myself. Last year for the town hall, there were other people who pitched in and helped, but the problem was: is the communication between the district office and the committee and the amount of time that we had in which to organize and to present the material and get it out to people in a timely fashion. The other thing that people have to understand is that there was quite a bit of contention over the social media blast from evie grief with the draft of the flyer rather than the final version that was approved by the district office. It takes a few days to get answers back, sometimes so, at any rate, no I and I hear I, hear I, hear your concerns on that and I think that we as a committee, can ensure moving forward right, because what ended up happening is that we were penalized with having our meetings cancelled for several months. Okay, and that I was told by one person that what did it accomplish. We had 99 people at the last town, Hall yeah, okay, so at any rate, I'd rather not repeat that experience and I would like to have a successful town hall that is actually helpful and useful and provide support to the arts. Community I think I think this is an easy sell to the City Council members and anyone that we want, because it is an urgent matter. I mean we're looking at an entire city that is dark on Broadway until may, the heart is clearly just taken off until June right, so I think it is an urgent matter and I think I agree. It is due yeah, so I think necessarily I think we're happy. You know you, as the chair have to kind of delegate tasks to us and let us know what you need as committee as committee members to support you in organizing and getting this work done, but I'm happy that you're going to put on the December agenda and I look forward to your email as to how I can support you. Okay, great can I say something yes crystal: what is it I thought he suggested that it's not just asking her to speak but to take over the meeting. That would be really interesting. The way we had member Niska ran a meeting one of our town halls a few years ago. Yeah and it was very successful, I think because Carlina can overcome some of these bureaucratic problems that we do not have the power to you know, but what if she would lead the meeting in our name? You know what I mean I mean we'd still be important, but she would lead the meeting as our City Council member interested in the arts. Then she will exert her influence on the community Board, namely Susan, and circumvent some of these problems. Well, anyway, it's an idea. It's an idea. So, at any rate, what we have determined in that what will be in the minutes is that we have discussed this and there were numerous suggestions made about how to proceed and that outreach will be made to the council person and to the chair of the arts and culture Committee on City Council, as well as to Senator Jose Serrano in terms of attendance. You know and we'll see what we can get a handout from Olympia, yes, Olivia. Thank you so I wanted to answer to Tariq's question about. You know the council member, whether we have relationships and also to the many people, talked about the urgency issue. So actually I just hosted a rally with Jimmy Van Bramer, the council member who's, chairing the City Council Committee about arts and culture and I work with him on several legislations, so actually, like I, can text him. So this is not the problem. The question is: how do we proceed like who should contact them, etc and because everybody says this is urgent, I think it's going to be very important that once our chair, you caroling, get clarity from the executive that it's okay. Then it's not going to be like last year that they took five months to get back to you because they know this is like this is urgent and so well. I think we could even schedule it for early December. You know, but we will wait. We will need to understand from you know whether we have the green light and then I think among Carlina's office and giving vibramer so I also had a meeting with the terrano's office. So we do know who are the people? We should contact right yeah, we do know the people to contact. The thing is that, as I said, this discussion will be in the minutes. Each of you will get a copy of it as a blind carbon. Okay, whatever submit it to the district office, okay and then perhaps it could be mentioned at exec to see how that goes through, so that they're on board with what we're talking about, and it will be scheduled for the December 9th meeting that we are scheduled to have for arts and culture and at that point, but we may be able to have the town hall before that. That's what we're telling you I do not think so! No do not you think, December no way it's the middle of November. Already it's November, okay and I doubt seriously. Maybe most city agencies like go into like slo-mo in December. That's fine I mean sorry just to restate it clearly I just hosted a rally where I had Senator Bradham on Senator Benjamin, Council, Member, Council member Keith powers, and they all responded to me within four days before we hosted the rally. So it is a different moment in history. We can do that if we decide that we want to do that. Okay, I, think from the previous experiences that I had that we have to have this. We you know I will try to bring it up an exec if I'm allowed to speak that so at any rate, I will go forward with that and I will post to you as to what the results are, but I'm assuming you'll be at exactly as well, so at any rate right now. What I'm telling you is that we are scheduled to have a December meeting, December 9th okay as to whether or not the district office would approve us going forward with the town hall prior to that I do not know. Okay, I can inquire, but you know I from previous experiences. I sort of doubt. It I understand the urgency you know, but it's also dealing with the system that we have in place. So, okay, at any rate, are there any more comments about what needs to be done? No, the second Monday in December is actually the 14th. If we meet on the second Monday of the month, definitively scheduled for December, 9th meetings in December were are still being scheduled, but they will be adjusted because of holidays. So I said it's not going to be a Monday anymore. It's going to be a Wednesday normal, like every other. You know every committee is going to be meeting in a weird time in December because of the holidays. Thank you yeah. It's that always happens in September October and in December. So at any rate right now, the tentative date which will be confirmed as of exec, is December 9th. So at any rate, are there any other comments in regards to this? Also I wanted to Amber. Did you want to introduce yourself hi everyone? My name is Amber sloan I. Am the community developer for arts on site we're a non-profit organization that was founded in 2016 and we're located at 12, St Mark's place I will get I wrote in the notes. I will get that Google doc to you. Asap I just wanted to have our executive director sign off on the language. First, we were closed for about five months during the lockdown and we reopened in August. We're not able to do our hourly studio rental like we normally do so. We lost significant income, but we've been doing residencies now following all covey protocols and companies can be in there anywhere from four to seven days and that's a building you might recognize from yoga to the people was in there for a long time, but they've since closed, so the owner is contemplating selling the building and so we're in a little bit of a battle to try and keep it so yeah. That's the landmark building. Yes, yeah interesting that well. Thank you very much for joining us and were you able to get in your request to be on the December agenda. I know that is due by Wednesday, so I will definitely get that in okay, great, so, look forward to hearing more about your organization in December yeah nice to meet everyone, Olivia hi amber so I had a question: did you mention that there is some issue? Can you tell us exactly if the issue is only the sale of the building or do you have a rent issue? Because there is some action happening right now in the city about art, spaces and rent relief? It's a little bit of both I mean right now, because yoga to the people is not in there. They've lost a lot of their income from them as well, and that we're not able to fully make all of our rent because we're not doing the hourly rental and all of those months of being closed. So it's a little bit of both and I think the owners were possibly interested in selling pre-pandemic. So now it's a question of if he could get the amount he wants and if not, what he's going to do with the building, yeah I think the issue is complicated because it's a landmark and also because of the other issue, that's going on with the Holly Hamilton House and what is it 29 third avenue where the 1830s House was demolished for the new office building, that's going up as of right. So it's just like. Oh, it's very interesting to see what would happen, but yeah so keep us posted and look forward to hearing from you next month and thanks for coming. Yes, thank you. I apologize for being tardy I have a zoom class that I teach until seven, so, okay, great, so is there any other discussion announcements going forward? Yes, daddy, no I just have a question so not to go back to this topic, but understanding the urgency of you know a town hall and hearing you carolyn on. You know some a lot of stuff that has to happen in order for it to even get on a schedule. So let's say we do reach out to the district office and we are approved. Can we like, if that happens, can we have action? Steps Olympia is going to reach out to so-and-so council member. Like could we say that at this meetings to prevent you know to speed this along in any way yeah, because if the district office is that committee members have volunteered to assist by reaching out to elected officials yeah like can we say you know, Olympia has volunteered to do this so that way we do not need another meeting to again. You know I think they all they want to date. Usually, if you invite them, you have to get yelled at they're going to want to date, I mean we could suggest even and just knives again. I think I think, rather than continue to talk in circles about this carolyn should check with the dishes office. Again, I can only speak from my experience with the one town hall that I did from the with the commissioner on consumer protection, but once the council members offices got involved and decided to co-sponsor, everything was done via email like there yeah we opened meetings, it did not need to be like we just did it all. The planning and all the logistics got done great idea, yeah, that's if they were willing to do that. So, at any rate- and you did that as an outreach to the council person without going through the district office, we the need to do the town hall. I believe I first brought up at exec and we talked about it at exact and it was agreed that we can do it as long as I did all the lake work pretty much, and so you dealt with that first reached out to the council person right yeah. So once it was a week that we can do the town hall I reached out to the council person to ask them the co-sponsor right. But after we deal with it at exact, because otherwise it gets to be very sticky. So just so long as we're all on the same page for the fact that there is a procedure and that we have to go through that in order to avoid any complications, I mean I. Think that the gist of it is that we all want to support arts and culture organizations, and we know that they're in dire need of support at this time. Okay and the most functional way to try to do. That is if we use the procedures that we have been told that we have to deal with initially in order to start this process, so I will take it up at, but that is what I can guarantee at this point in time, and I will be happy to post an email after that meeting and let you know what they have decided and voted on. So just so long as we're all on the same page with that and I do appreciate the fact that tariq and olympia and crystal have all volunteered to help and support this project and I know. Last year, Andrea did a great job of helping with the fire. It was beautiful. It was well done so at any rate, I think and I hate something. It was not that you did not follow procedures. You did follow procedures, but you were road blocked and I'm saying that if you get the council person co-sponsoring, you may be able to get rid of the roadblocks because she will get rid of them. Yes as well. Oh all, right! That's wonderful! But thank you! Crystal did you just get here? Who hearing Michael say that he raised it at exec and exec agreed that he could do it and then, after he did the exact, then he contacted the council person? Ah, okay yeah, that's the deal I see! In other words, he got. He went through getting it okay before he contacted yes, because that has been a major contention with the district office, because I got through that last year, because I emailed Brian, Lewis and I caught a lot of flack for that I did not go through the district office because I deal with him all the time at different meetings right. You know and I know him, and you know as well as I know Carlina for a long time from the time she worked at goals, and so it's like I know most of the electives in the neighborhood and have had contact with them, but I have also been called to account by the district office for reaching out to electives without going through the district office. Okay, I got it yeah, okay, so long that we all get this yeah official communication to elected officers, elected officials and government agencies needs to go through the district office, all right, yeah, all right, okay! Well, let's do it all right. Fine it'll be in the minutes. Okay, so at any rate, any other comments before we vote to Adjourn I was just going to say: I did not say it explicitly, but I'm happy to help out in whatever way, I thought that was a given, but yeah, I'm happy to help out in whatever way is needed. I hate that you're great at helping- and you helped me with the town hall last year, so at any rate, I do have a personal thing to share. I'm american, as of today guys I, just took my oath I was like just in time. I gave my ass to religious too, that I'd kind of elected, oh gosh. Well, congratulations! Olympia! Welcome to the club! Thank you! Okay! Is there a motion to adjourn all in favor? Let me do a roll call, since this is how we do attendance. Also. Okay, all right! Sorry crystal again: Carolyn Redcliffe, yes Olympiakazzi, yes, Tatty Giorio, yes, Tariq, Durrell, yes and I! Think that's it! That's all the members of your committee, Right carolyn! That's all that I know of that! Are there right now? Okay, awesome! You guys are officially adjourned. Have a good night good night. Bye. Michael appreciate your doing. This no problem welcome to America olympia. Thank you.",
            "summary": "Let me add my two cents here from a procedural perspective, so carolyn what the office told you is correct when it comes to the full board meeting public session at the full board meeting, they have to sign up in advance, okay or committee meetings.\nYes, and by the way, I want to inform all the committee members about what happened and what I personally did as a follow-up with the borough president, because it impacts them too.\nWe passed two resolutions at the past subcommittee meeting of arts and culture, but you know, unfortunately, because of the way the calendar has been set for CB3.\nThey raised some concerns, because our resolution unfortunately did not have enough context, so we offered to them to give the missing context, because this is a resolution about a bill, especially drafted by the chair of the arts and culture Committee of the City Council, to address very fair concerns of architectural organizations that are currently banned.\nI think people are very much in favor of trying to help arts and culture to be able to have performances on the street, but I do not want to get into a discussion if that's something that we're not allowed to do at the meeting right now that you know, basically that we have to take your presentation as it is, and that the issue will be discussed.\nIt is SLA, it's all over the place, so having a resolution that focused on that brought a lot of feelings about having amplified sound, which distracted, I think from the central issue of having a program like open streets for arts and culture.\nYou know, there's a lot of new members, so they're not too familiar with the processes carolyn, but typically for items to get on the committee agenda.\nThere is a very interesting movement from a lot of progressives in New York state to get the governor to give relief to the city before December, because in December a lot of people actually are going to have zero like right.\nThat's why a lot of people are putting more pressure now to the governor to make sure that this comes, and if this comes I, think it is our responsibility to ask that they immediately start programs for arts and cultural workers and organizations like fast rapid grants or something like that.\nI. Could not I could ask her I do not know if she's the one you want, though I think it has to go through the community board in terms of making that request crystal through the office.\nThe other thing, that's also a possibility is whether or not if we want to request somebody from Senator Serrano's office since he's the head of the state arts and culture committee to possibly come and speak to us about what are the possibilities, because he's been very proactive in terms of trying to help the arts and culture.\nThe Harlem Community Board did and a few others where we actually invite the commissioner, maybe of the Department of Cultural Affairs and the mayor's office of media and entertainment, and we invite many local organizations to submit questions and our committee.\nThink is the right thing to do so that can be added to the December agenda.\nI think you know, maybe also not I, know we spoke about the senator or even us, the City Council person who oversees arts and culture.\nI think maybe that's a great opportunity for our committee to organize that town hall and invite the senator who oversees arts and culture, the city Council member oversees arts and culture.\nI. Think many organizations will take time to come to a town hall and hear from a presentation about what's happening on the state city level and that pertains to them and then from there as committee members, we can share taking notes to help build some context as to what's going on in our in our district with the organizations.\nAnd, then we can better plan as a committee moving into the new year of how we want to support, but I also think inviting.\nI also think inviting public school principals from the district, because a lot of arts and culture organizations serve those schools and can not moving forward and so that.\nThink there is arts, and culture is one of those sectors or topics that cuts across so many committees, whether it's I mean, certainly, as you all know, whether you like it or not- economic development, but also you know, parks, Transportation, Health and Human services.\nI do think that there would be certainly board members and people from each of those committees.\nI do not know if they I do not think the district office has any approval over anything.\nThink that, from my understanding, because I've had this issue before with the open meetings law that if we decide once we do, approve it.\nOkay, we can put it on the agenda for December and say at that point in time that we want to discuss the organization of a town, Hall, Zone Meeting, and to invite the representatives from the city and the state and whoever that we want to attend that meeting.\nSo I do think that you're talking about doing a town hall, which is not a official community board meeting.\nBefore, like how many town halls have I done with arts and culture.\nI. Think you from my understanding is that this would go in the minutes as sort of the next steps is to explore how to do a town hall and then Carolyn would work with the office to figure out some of the logistics and in the next meeting there could be some potential dates.\nI. Think that you know having had this experience a number of times with the district office that I've had some experience in putting town halls together in the process.\nThink I would prefer to include the discussion and the minutes under what we talked about with the results of the survey and how the arts organizations that responded, and that we felt that it was appropriate between that and the last information that we see from DCLA that a town helped be hosted and that it would be listed on the agenda for the December meeting, at which point in time we will pick a date and go for that.\nI would prefer to have this discussion in the agenda in the minutes, for this meeting, of which you will all get a copy, okay and that it will be listed as being on the December, agenda.\nFrom my from my experience with the one town hall that I did some of the burden of what you what you and the committee have to do and what the office has to do was alleviated, because what I did was I went to our city, Council member and said hey.\nSo I would suggest that, maybe, since there is a city council member who is the committee chair for arts and culture.\nLast year, I went from like March through June, getting dates from elected officials to attend a town hall and because of the structure, the skip meetings for the community board.\nIf he would help us, he's, got the power right, but just because of the experiences that I had last year with the town hall, that it would be helpful if the district office were on board with that.\nOur committee members allowed to support you as the chair in organizing and kind of talking to City Council offices and things that are you familiar with the council, person.\nLast year for the town hall, there were other people who pitched in and helped, but the problem was: is the communication between the district office and the committee and the amount of time that we had in which to organize and to present the material and get it out to people in a timely, fashion.\nAnd I think that we as a committee, can ensure moving forward right, because what ended up happening is that we were penalized with having our meetings cancelled for several months.\nAnd I would like to have a successful town hall that is actually helpful and useful and provide support to the arts.\nYou know you, as the chair have to kind of delegate tasks to us, and let us know what you need as committee as committee members to support you in organizing and getting this work done, but I'm happy that you're going to put on the December agenda.\nI mean we'd still be important, but she would lead the meeting as our City Council member interested in the arts.\nWhat we have determined in that what will be in the minutes is that we have discussed this and there were numerous suggestions made about how to proceed and that outreach will be made to the council person and to the chair of the arts and culture Committee on City Council, as well as to Senator Jose Serrano in terms of attendance.\nThrough, so that they're on board with what we're talking about, and it will be scheduled for the December 9th meeting that we are scheduled to have for arts and culture and at that point, but we may be able to have the town hall before that.\nAs to whether or not the district office would approve us going forward with the town hall prior to that.\nEvery committee is going to be meeting in a weird time in December because of the holidays.\nYou know I think they all they want to date.\nThink, that the gist of it is that we all want to support arts and culture organizations, and we know that they're in dire need of support at this time."
        }
    }
}