{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "Manhattan - Landmarks Committee",
            "publishDate": "2020-12-08",
            "shortDescription": "Agenda\\n\\n1.    Approval of previous month's minutes\\n2.    Certificate of Appropriateness: 12 Eldridge Street (The Museum at Eldridge Street) - Installation of 2 areaway gates and 4 anti-climb cages at existing fire escapes\\n3.    Vote to adjourn",
            "lengthSeconds": "1:51:55"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "29X3IvNUJ_8",
            "fillerWordCount": {
                "uh": 91,
                "um": 251
            },
            "readTimeFullTranscript": "44 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "building": 59,
                "security": 39,
                "fire": 38,
                "landmark": 23,
                "pole": 21,
                "gates": 21,
                "elevation": 19,
                "metal": 19,
                "level": 17,
                "poles": 17
            },
            "wordCountSummary": {
                "security": 17,
                "building": 10,
                "fire": 10,
                "landmark": 9,
                "measures": 8,
                "fencing": 8,
                "pole": 8,
                "gates": 8,
                "staff": 7,
                "consultant": 6
            },
            "fullTranscript": "Working fine, okay, so welcome to the December meeting of the CB3 Landmarks Committee somewhere I have a little list. Let's see, I'll share my file here for a minute. You see in it good okay, so if there are I, don't see any and we might have one guest here if you are a guest and not a presenter or a member of the committee, please enter your name and affiliation in the chat room, so we have an attendance record we're good. Our first item is to approve last meetings minutes and after that we're going to discuss tonight's Cfa application, so the application will be presented. The committee will then discuss it, and then members of the public can ask questions and make statements. If you wish to ask a question, raise your hand to do this. Click on participants in the task bar at the bottom of the participant list. You will see an icon to raise your hand. So then we will do our resolution and we have added a new business item to our agenda because of the urgent situation with the middle collegiate church and the Isaac opera house. So, let's stop the share. Go back here so see. There's I! Think three of us here, David I, see you're having trouble with the audio. Aren't you I can't hear you I heard him just a minute ago. Yeah he's he briefly. So our of our let's see if you're not on the committee, please mute yourself, and that means you Debra yeah, so Carolyn and David and Linda. Does anyone object to the approval of the meeting the minutes from October, no okay, they're so approved? Let us move on to our Cfa application and our speaker, I think, is Ms Hunter Birkin correct, close enough. Okay, yeah! Please present pronounce your name for me. I don't want to keep mispronouncing it Misha Hunter Burkett! Thank you, Misha, okay, so you can go ahead and begin explaining to us. Why we're doing what we haven't seen the whole application. We just got it so! Okay, did you receive the email with the attachments? Yes, I have the attack? Okay, if you could just put up the drawings from that package, that would be most helpful on a second while I find it okay and it's the it's labeled t 2009 14 ls8 LPC underscore set one okay. Let me get the list up first and then yeah. Okay, t yes, yeah. If you can find that okay I did find it. I am going to now share it. I seem to maybe have slightly improved. It sharing strains. Let's see there, it is okay, all right! No, but that's! Okay! This is a cover. Memo. I was hoping for the drawings. I can just tell me what I need to find yeah. I'm just gonna. Go back to that! Sorry, oh, does it say 2008? Oh sorry, 20! Can you do this? One 2009 14 Eldridge set one I misspoke, I'm sorry, I, don't see that I see some things named 2018! Oh there, it is I, see it. It's a pdf. Let's stop my share start. My share find that pdf. Okay. Does that do that's it fantastic! Okay! There's that that's it's a beautiful building, so I'll briefly introduce my name is Misha Hunter Burkett. I'm representing Lee Saltzman Architects and we've been retained by the museum at altered street for a number of security upgrades at the museum received a an assessment from the New York City Police department, identifying a number of vulnerabilities, particularly for potential terrorism and the museum hello. The museum then subsequently applied for and received a number of grants at the state level in the federal level to implement these needed security upgrades. They also retained the services of a security consultant that would help them in navigating how best to address the vulnerabilities that NYPD had identified, and the building, of course, is a New York. City landmark it's listed on the state and national registers of historic places, and it's also a national historic landmark and the building was built 1886-87 by harder brothers in the moorish and gothic revival, styles, and so we applied. We made the application to the landmarks commissions you can see in September and with the goal of trying to do as much as possible at the staff level. Looking carefully at landmarks rules and guidelines for health, safety and security, upgrading and almost everything that had been presented to the landmarks Commission applying you know, different measures met with the landmark staff's rules. However, two specific scope items were found to not meet the LPC staff requirements and must come before the LPC commissioners at public hearing and presently the project is scheduled for the January 5th 2021 public hearing and in advance of that, the team we are coming to the community board onto your committee and then I understand that the committee would then present a resolution to the full board and that the resolution from the full board could then be submitted to the landmarks Commission, ideally before the January 5th public hearing, so that the advisory comments of the community board may be known to the commissioners at the time of the hearing. Yep fantastic. So the two scope items that are under your review today include the installation of two security poles that would be five inches in diameter. 12 feet high black and one would be located at the north area way and one would be located at the south area way, so that would be within the bounds of the existing areaway fencing, but as it happens, or sometimes with older buildings. The location of the two security poles excuse me is located outside of the property line. So in addition to applying to the Landmarks Commission for the security polls, we also went to the department of transportation and their revocable consents department and because we were able to prove that the Areaway fencing was in existence before 1940 and I have in the package of documents that were emailed to you. A 1905 drawing elevation drawing of the building D.O.T said that they would not have any comment and wouldn't require a revocable consent to be issued for the two security polls. So that's one part and then the other part is, as happens, oftentimes in urban situations, where buildings are quite close together. In this case, the museum has two fire escapes one at the south area, way, one at the north area way and due to the close concentration of other buildings that have been developed and over time at different heights. There are some opportunities for people to jump onto the fire escape and then potentially get access to the interior of the building, and so one of the recommendations was to of the security consultant was to respond, and so we, our office, working with a structural engineer, devised some anti-climb installations that would be attached in a manner to the fire escapes to restrict or deter on people that might want to climb onto the fire escapes. So this request, as I said, it boils down to two security poles in the front and then four anti-climb measures that the fire escapes very selectively located, so not covering the entirety of the fire escapes, but just at very strategic locations where it's most vulnerable, and that is what is before you today. So if you'd like to advance the slide, I can just walk you through the drawings and then we can put up some photographs. So you can see and then I'm happy to answer any questions. Okay, that's great, may I ask if you've experienced anybody trying to break in already they have, and one of the stained glass windows was damaged. This happened last year and, of course, we immediately applied to the Landmarks Commission for the stabilization, a temporary panel to protect and then engage the services of a stained glass consultant that specializes in stained glass window repair. So it wasn't on the primary facade, but it was on the area way on the south area way and that you know corresponds with the need for the security measures that have been so far identified by NYPD and we hope to be able to get the permits and then implement these upgrades and protect this iconic building so yeah. So just really quickly. Just so, you can locate the building. You can see it on the plan on the upper right hand corner exactly there, so just so that you know where it is on Eldridge Street and if you can advance to the next, can't read that these are department of buildings notes. You don't need to look at that, the next one yeah okay. So this is a basement plan. If you can go to the next one. Okay, so I wish I had a pointer but I. Don't anyway, if you can circle your take your cursor down to the front towards the front gate: okay, a little lower down a little lower yeah a little lower to the right okay. So you see where that gate is I mean this one right swings out exactly yes, exactly and right to the left of that is the proposed location of the pole. So you can see it might be a little bit small, but that's the little there's a little circle. That's indicated there in plan yeah, and this location was identified by the security consultant as the best possible location for this pole and the pole, which would be painted black and metal, and we identified the Vega manufacturer, it's a specific product and it would support a light that would be able to illuminate the facade and a motion sensitive camera, so that location as I said was specifically chosen by the security consultant. And then, if you go to the exact south, so at the top of the drawing, also right next to the areaway fence and the exact same installation is proposed, there would just be these two okay, so all right, and then these poles wouldn't be barriers right there. It meant to illuminate and have a camera correct yep. Then we tried to tuck them as much as possible into the extreme corner. You know to try to not impede any egress points, because obviously these are egress corridors for anyone in the sanctuary that exits through the fire escape and would need to then exit out onto the street. So we can't have a poll that could possibly be an obstruction to anyone as they're seeking to flee the building in a case of any emergency. The other thing to point out on this plan are the locations of the fire escape so at the south area way, which is at the top of the drawing yep exactly so, you can see the fire escape as it goes up and then turns the corner and comes to the north. So there's exactly so. There's two locations on this fire escape where these anti-climb measures are proposed, and you can see that the adjacent conditions on the south there is an existing building with a lower one-story appendage to it. So one could jump from that roof onto the fire escape over the fencing at the property of Eldridge and then jump onto the fire escape and then try to gain access to the building. The South East corner is a vacant or I shouldn't say vacant is undeveloped. It's a parking lot for I think delivery trucks for a type of grocery. So there's yeah there's a variety of different conditions here and then, if you can follow your cursor down going in the northward direction, we'll get to the other fire escape at the north portion of the areaway exactly so here we have a number of conditions. The building immediately to the north is built up and the rear terrace of it's an apartment building and the rear terrace of one of the residential units aligns with the fire escape. So one could easily jump over the parapet, wall of the terrace and then gain access to the fire escape and then, if you wish to try to exit an entry into the building the sanctuary, so these are the locations. I just want to make sure that everyone is clear about the interventions that are proposed and where they are proposed. Does anyone have any questions there? Was the fire escape initially installed to provide egress from the women's balcony? Ah good question I think not because this location is the as location of the main sanctuary. This is the floor of the main sanctuary, so the door. You can see the two points of access to the fire escape. Oh sorry, this fight this it does provide to both sorry so this floor. You can see the door there and then the exactly opposite. On the south side, you can see a door that accesses onto the fire escape. So these are two landings and then we're going to go to the next plan, which is the balcony plan, the women's balcony and that's where the fire escape continues up to the balcony level, and so the women from on that level could then access the fire escape from that higher level and then continue down. So the men would get onto the fire escape historically in this first floor and the women would gain access in the balcony. Thank you. Okay and these are and the doors accessing the fire escapes in all conditions are have stained glass panels and we, you know, as part of a staff level application. Those stained glass panels would have some type of blast. Last proof film applied, but that's not part of the application before the commissioners. Okay, so can you go to the next? Then we'll go through the elevations yeah. This is okay. Here we go so the elevation shows you the two poles that are proposed. So you again from the plan. You can see one exactly at the north, one at the south 12 feet: high five inches diameter metal painted black mounted with a light and a security camera okay. Where are they in relation to the sidewalk? They are not on the sidewalk, so I don't know if you would like to go back to the plan. The first floor, the main floor plan and we'll just show again. So if you could just point yes, the sidewalk is there exactly and then you can see the boundary of the fencing, the Areaway fence, okay and the gates, so that you can gain access to the area ways you can gain access to the steps going down to enter the museum. You can gain access to the steps going up to the sanctuary. Does that help you, sir? Well I, still don't see the location of the poles so I? Guess: oh okay, I love this right, yeah, yes, one at the south and one at the north, sir, and so there's room for access to the area where the pole does not impede any of that access. No, a great care was taken to find a diameter of pole and also to find the location for the poles to be tucked in as closely as possible, so that there would be not be any obstruction. As I said earlier, these areaways are the emergency paths of egress. So if one was fleeing the building in the case of an emergency, we can not have any obstruction to anyone as they are trying to flee the building through the area ways and onto the sidewalk. So it's also the ADA access. Isn't it the north portion? Yes, is the ADA, so, as you can imagine, we had very specific size limitations and dimensional limitations, but we responded to the recommendation of the security consultant that the museum engaged in placing these polls in these two locations, and we identified the manufacturer of the polls and security lighting and camera that would mount onto the pole and again, the goal is to try to find a pool that is going to have a good longevity, a good life to it. It's manufactured and made well that the finish is not going to deteriorate over time that it's going to be. You know a solid installation, but at the same time we wanted it to be something that would not call great attention to itself and try to recede somewhat in the background and yet be functional and utilitarian. You may recall that Trinity Church on Broadway a number of years ago installed something similar with lights and cameras on mounted on poles, and so this is some something similar, but not as many and certainly there's not a need and there's not the space. So hopefully that answers your question. What is the pavement in that area? Ah, at the north portion of the area way where there's the ADA access? We know that there are a number of pavers that are blue stone that would need to be lifted to accommodate the electrical conduit run and then replaced not reinstalled, I should say reinstalled once the electrical conduit feed into the building has been established and then at the south area way. It's a combination of I think there's a number of different things going on I. Think there was concrete, we don't know all of the paving conditions there. It seems it's quite built up, it's not at the grade level. You have to hoist yourself up and they're, not steps, so it's a little bit more difficult to access than the north area way, but the goal is to be as minimally impactful as possible and to return the you know, the blue stone pavers, where they exist, to the condition that they were in prior to the installation. Does that answer your question, sir? Yes, it does. Thank you. So let's look at this one, I'm in the west front, because I think this is a good view of it. So these are our polls. It looks like this. One is allowing more space than this one is in the drawing they p. They appear to be in front of the gate. Am I reading that correctly well, the way that the section is cut, none of the Areaway fencing is shown. So it's to try to the elevation is cut in a manner that does not show any of the Areaway fencing or gates. In order to be clear about the location of the poles, so behind the pole, what are those vertical lines? Ah, behind the pole, there are two proposed gates that would that we found clearly shown on the historic drawing from circa 1905, and the goal is to install new Areaway gates that match the historic elevation drawing and those would be reviewed at the LPC staff level. It's part of a whole package of security upgrades at the museum. So what is before you today are the two security poles and then the anti-climb measures that the fire escapes aren't there existing gates. There is one gate at the south area way: there is not a gate at the north area way. So what would happen to the existing gate is not historic and it is, we don't know the provenance of it. We don't know how it was installed, it's in deteriorated condition, but has no historic merit and the gates that we are proposing under a staff level are trying to recall the historic condition based on the documentation. It's very confusing these events that get broken up into a staff level encryption level, I'm sure they are too I- understand yeah, well I. Try to keep it clear. It's helpful to have an explanation because of the context of what you're doing absolutely and that's why I provided the memo that gives you the full picture and then that way, you understand the context of all of the scope. That's proposed. Would you like to go to the north elevation and then we can do the south elevation and talk about the anti-climb measures, and you can also see the poles in section, and here, sir, you can see the location of the pole and then you can see the plane of the Areaway, fencing and gates- that's just beyond it. So hopefully that helps you to understand the relationship not only in plan but also in this elevation and then moving on to the anti-climb measures. The concept here as I understand it from the structural engineer, old structures, engineering. They do a lot of engineering, consulting work on landmark structures, and so they said that this concept of a an anti-climb mesh, very lightweight metal mesh, that's from Europe, is used at zoos. I guess there are people that try to either climb into a an enclosure for an animal or what have you. So this is to just deter people from climbing, and so they said well, why not try to do that similar? Similarly, here we want to discourage anyone from trying to climb onto the fire escape and, as I said, these anti-climb measures are. You know they're not going to prevent somebody with metal cutters and you know whatever they want to do, but it would certainly be a deterrent for anybody that was trying to gain access onto the fire escape, and so the intention is to do something in an extremely light metal mesh so as not to you know, compromise the visibility of the historic landmark and certainly not to diminish any light coming into the building through the windows beyond, but at the same time create this anti-climb measure. So you can see at this is at the north area way and the, and it turns the corner and goes up on the East elevation. Could you go to the south elevation next and I'll? Just talk about that? One? Okay! Thank you! So here at the south elevation we have the condition of both that adjacent building immediately to the south, as well as the driveway or our parking area for the grocery delivery. And so there are a number of conditions. The areaway fencing is going to be replaced with new fencing as part of a staff level application, but the anti-climate measures at the fire escapes are not something that the staff can do at staff level to approve, and so it must be presented to the commissioners at the public hearing. So that's it and then, if you would like to go to the East rear elevation, I can show you that these are visions of this building, that we don't ordinarily get correct and we'll show you some photos as well. So you can see the anti-climb measures. You know again just being very selective in their placement. We don't need to cover the entirety of the fire escape, but just where there are vulnerable points, yep exactly that's it whatever. That's it yeah, that's the idea, and then let's see here if you'd like to close the drawing unless you'd like to look at the lighting details, why not yeah? These are there's a detail of the pole on the left, lower left. This is the Vega pole and then the light that would be mounted onto it is a special housing and there's a there's. Also, a bracket mount for the camera that would be specified by the security consultant. So that's the package yeah. So what would you like? Next, let's see if I can find it I'd love to show the photos and the drawing the 1905 drawing if you could show those that would be fantastic. Okay, so I see a bunch of images, there's one that's Circa 1905 at the front of the label. Do you see it I think so? Okay images take a little while to open on my computer I understand instead of annoying. When all you want to do is look at it. You don't need to edit it I understand. Do you have a photograph that not necessarily on this building but a photograph that shows the mesh? If you looked at it from some distance what it appears to look like? No, we did not prepare any renderings. We did not prepare any renderings. If you like, I can email you the product data sheet from the manufacturer, so you could see it. We also watched a very humorous video of someone attempting to climb and failing miserably, but I didn't include that. Okay, so this is the circa 1905 image that I wanted you to see. Sorry drawing, and so you can see that there were areaway, fencing, the gate, sorry yeah and unfortunately, the areaway, fencing and gates all feature an x-brace motif, which all of that Areaway fencing was replaced. Subsequently, oh I need to send you the other image hold on. Give me a second, because that just a moment and then you can see the existing areaway, fencing and gate conditions. Sorry about this, so which one do you want yeah, I'm just going to email it to you just give me one. Second, this is fun I, I'm grateful that you were being so accommodating no problem. Let's see here, okay, so this is going to be a link. Hopefully you can open it circa 1887. This is a building with just fascinating history. As I said earlier, the building was designated by the Landmarks Commission in 1980 and then listed on the state of national registers and historic places, and they as a national historic landmark as well, and the museum of course prides itself in its history and there's the image that I just sent. You is one that is as magnified quite largely and as part of their exhibitory. Can you see it yeah, I'm just saving it. Okay. What would you say the size of the openings of mesh is. Oh, that's a good question. Give me a moment and what call is it metal is mesh metal or some metal, it's metal, and what color is that metal? You know, that's a good question. I think it's let's see. I can only do one thing at a time, so let me see if I can find that metal and while the image is coming through, okay I just shared it I hope you can see it. Yeah hang on it's the best. Oh there we go yeah. So there you go, you can see the areaway fencing and then the rail is where the gates yeah and the gates at the south and the north. So those are again just very simple with spikes on top, you know just to be very simple and try to not compete in any way with the very ornamental and decorative ironwork. We just want this to be something that's more of a background piece, very utilitarian and functional. Of course, as I said before, these are paths of emergency egress. So there are panic bars that will be installed on the inside faces of both of these gates. So in the event of emergency that all one would have to do is to push the panic bar and the door would open. The gate would open. The gates certainly are designed with hardware to try to restrict anyone from trying to tamper with the operation of the gates. So the goal is to again just do this in a very simple black finish for these two gates, but I just wanted to show you that so you can see and then Sir I'm just going to look up the specification for the mesh. Just give me a moment. Is it steel mesh? It's stainless steel mesh, but just I'm just going to try to call it up. Just give me a second: it's my computer seems to be going a bit slow today. Join the crowd. I know, okay, all right, I'm in the images file. Let me just get to the drawings file. Okay, anti-climb fence. We go that's missing. Let me just see if I can I'm sorry, I can't seem to find it. Sir I'll just go through a quick email search and just see if I can put my finger on it. Just give me a moment: I'll be right back, so it appears that the artist's original conception, the architect's conception, included lanterns out front hmm, so it did as part of the ironwork that is not proposed here. Certainly, okay I have the it's called Jacob Webnet, I'm just going to send you the document just give me a moment and you can see it. Okay, hopefully you can see it hasn't come around yet, okay, let me know when it does foreign so well, the others came right away. Well, so it goes okay, yeah, I'm sure it will come. Yeah I mean me too yeah, so you know just to discuss it. Let me try one more time. It seems to me that these solutions you're proposing first of all they're essential for security, and you know before I think before you joined us. We were talking about security issues in various landmark buildings and in my case, in the park that I look after and there they seem to be related to this pandemic time and the fact that people are going crazy things that they never used to do. So. It's really a shame. Yes, I resent it please. Let me know if you got it. Okay, so far, not okay, yeah I can say that earlier in our conversation I when I served on the Landmarks Commission staff in the preservation department and one of the special desk assignments that I had for eight years was doing design and regulatory review for religious properties, churches synagogues throughout the city and after 9:11. Obviously there were a number of landmark religious properties that the NYPD did evaluations of in terms of their vulnerability for potential terrorism. So certainly this subject has been on my mind for a number of years, and you know we would like to hope. You know that making very surgical, specific installations and upgrades in a way that tries to meet the needs of the security requirements and then also to be respectful of the landmark site is really what is at least our goal. So this is the product data sheet from the manufacturer. It's a Jacob or Jacob Webnet. So you can see it there's 84 pages, so I don't know if you need to look through all of that, but probably not, but if you would like to look through it, you certainly may and you're welcome to go on to their website where, as I said, they have a quite interesting video of someone attempting to try to climb it and not being successful and I can say if somebody was a climbing, a person that climbs walls at the gym I, you know, I would think that this would be quite interesting. We had our office had worked as the preservation architect for the high bridge rehabilitation which opened in 2015, and this type of very similar type of web mesh metal mesh stainless steel metal mesh was used on high bridge to supplement the historic railing which was not high enough to meet D.O.T requirements. So certainly I'm familiar with this type of metal mesh, but had never seen it in an application like this at fire escapes but landmarks. When they looked at it, they said you know we're really impressed this looks very light. It looks you're trying to allow for the building to still be very legible and read, which was our intention, but to provide a type of deterrent from anyone that might try to climb onto the property and because it is on the side of the building. It's not so you know. If you had to put something like this on the front, it would be really a problem. I agree, yeah Carolyn. This is what we need on ps64 right. It sure is any questions, folks, not public, yet still Committee Mitchell, Carolyn David. You could put it in the chat. If you have a question, no I don't have any further questions. Okay, it's all thought out all right. Let's hear from the public, I'm seeing you without seeing your hand, so go ahead. Debra! You muted! Can you unmute yourself? This is madness, I look at the settings and it says, allow participants to unmute themselves. So put your question in the chat. I would like to have the power to unmute I. Don't know why I don't, but it says the host has to unmute me, but the host does not seem to have this capability. I can try. Nope all I can do is ask you to unmute. Well, she put it in the chat. Okay, she wants to know how much taller the pole is than the Areaway fence. Oh okay, I. Don't have an exact answer to that question, but if we can look back to the drawings and if you could kindly post those again the powerpoint with the drawings, yes, if you could, please do that and then, if we can advance to the north elevation and that shows the relationship of the Areaway, fencing and gates to the proposed poll. I think the you'll see the relationship there. Looking I can close. It I have to find it again. Yeah and Sandra's saying that she's had her hand raised I'll, get you Sandra. This is the thing we don't want remind me what it was called again. Yes, absolutely it was a twenty and you'll see it. Eldridge set one yep I see it. Do you see it? Okay? There you go okay, so if you could advance to the North elevation, so keep going down, Yup North elevation: you could go to there. Okay, so you'll see the. If you can, maybe if you can make it a little bit bigger, is there a way to do that? It looks like you've got a plus sign on the top. Do you see the plus sign on the top? Oh, this guy left yep. If you can make that okay press that a few times, okay and then, if you can drag yeah exactly then we'll scroll down a little bit more and then, if you can scroll to the right and then we can all see or put or somehow drag the draw and there we go okay. So in this drawing you can see the location of the area, way fence and gates right and then you can see the proposed poles, so I think the area wave fence and gates maybe about five feet. They're somewhat tall right. This proposed pole is five inches in diameter and 12 feet high with the goal of being high enough that you don't allow people to try to tamper with the placement of the security camera. You don't want someone trying to unscrew it. The whole purpose here is to be able to assist the museum assist the police if there is a an attack in a building to be able to hopefully document the perpetrators. So we want it to be a little bit tall and that's the goal. The dashed line adjacent to it is the property line. So it's not something else, that's being proposed. It's just that we wanted to graphically show the location of the property line. As I talked about earlier. We found out. You know that in placing this poll, these two polls that they would be beyond the property line and we did apply to the New York City DOT revocable consent department, asking for their determination as to whether or not a revocable consent would be required, and they said no, because you have demonstrated that the area way fencing and gates existed prior to 1940 that they would not need to issue a permit for the proposed polls. However, they are obviously required for permit from the landmarks Commission, but I can have someone scale the off at the office tomorrow, the dimensional difference in height between the top of the existing area way and the top of the pole, so that you would have that dimension. If you would like. Can you hear me now? Yes, oh okay, is there any consideration to not making those poles black? It just seems that they might be quite noticeable at five inches diameter. Two black poles on either side of the facade, I, don't know yeah, there's! Oh there's only one pole on each side and the all of the metal work is all painted black. So the goal was to try to use that same color, so it would be sympathetic with the other metal work. Santa and don't forget I mean there are. There is a building immediately adjacent to this to the north. So you know you're, going to the context of this. Drawing is somewhat misleading in the sense that you were showing this for clarity about the building and proposed modifications, but always remember that this is a very densely built up portion of the lower east side. So you would see this as part of a very lively street pedestrian experience. Okay, so Sandra did you have a question: okay, Sandra! It's not huh, put your hand down. Okay, anybody else have a question discussion. Okay, so what do we think about Linda? She did put her question in the chat. Can you read it to me? I can't see it. Yeah are the cameras going to focus on the entrances or on the gates only as a deterrent, the cameras would focus on I. Actually don't know if the cameras would focus where the security consultant suggests that they'd be focused, I would think on the doors but again I, I'm not privy to where they would be focused. That would be a security decision. We are not the security consultant. Okay Sandra. Can you try to unmute yourself one more time? Guess not. We can't see you either, okay. So, let's committee, let's discuss what we want to do here, given that the building is a New York, City landmark a national historic, landmark, I assume also on the state register of historic places and is a architectural and cultural, architectural and culturally significant aspect of the community as it had been for over a century. It needs all of the security that can be provided within the context of a historic building and that these measures should be endorsed by the community board. I'm good. Can you say that again, I'm putting up where is in, whereas in here I said, whereas this building is not only in New York, City landmark, but also it's a national landmark national, historic, landmark, okay and also a national historic landmark, as well as a architectural and cultural touchstone of the community and has been such for over a hundred years? These security measures I should put this up, so people can see it see if I could share it, then you can see me typing slowly there it is so I had put a couple of things in and I'm putting what you said right here, where the build as the building is not only a New, York, City landmark, but also a national historic landmark, as well as an architectural and cultural touchstone of the community, and then we say. Therefore, maybe we should just say that this something about the security requirement here, something like that, so, okay, Mitchell go resolve. The community supports the proposed installation of these security measures. Okay, that's it! The only other thing I could think of is you might want to add something about the experience of break-ins and therefore the need for these security measures. Yes, building as experienced security violations and damage can I ask that you not put in writing about this. My concern about speaking about how vulnerable the building is bad idea in print I, yeah I, just I'm a little bit nervous about it and I, don't think it's necessary. I think you've made a very strong case, I and yeah I. Think your warehouses are very strong, very good you've been speaking with commissioned staff and were there any concerns they raised that we ought to slip in here. As I said they were very, they were. They questioned the location of the two polls and when we indicated to them this was the direction from the security consultant again to achieve the best location they were. They didn't have any response to that other than okay. We understand that that's the best location and obviously that there would not be any obstruction potential obstruction to the emergency egress. So they were very pleased with that and they were also pleased with the lightness of the metal mesh. Oh, we didn't look at those photos. There were some photos that were taken through the from the street I, don't know if you would like to see them. Why not? Would it be helpful named image this and image that yeah? There are images at the tail end of the first attack, the first email that I sent you with attachments and we could just quickly skim through those. Let's see, let's give this a try see if I've got the right stuff here. I usually would be remiss to interrupt anyone writing a beautifully written resolution. We did a good deep dive into drawings and historic documentation and even the web net, but there were some additional photos. It can't hurt to just quickly see them. Let's start a new share here, see if I can get this I have great faith in your abilities. You've done wonderful, so far done wonderfully there it's hard to be on the spot, I'm learning how to do screen sharing better, it's easy to screw it up. I even went through a tutorial, I'm still not fasting. Yes, at least that can do it no you're doing great. So this one is just a number of one of a group of photos, but you can see in the foreground the parking area for this grocery delivery and there's a warehouse immediately to the right on in the picture and then straight ahead. Obviously, is the museum and you can see the existing fire escape exactly so. You can see also that there is a you know, an opportunity for someone getting on top of that low building immediately next to or low roof immediately next to the museum and then jumping over the area, the fencing and getting on to the fire escape or wherever else they wanted to get into. But that gives you one picture yeah. Well, people interested. If you can press the arrow to the right, there's a little arrow on the right that appears yeah. Let's see if that gives you the other okay. Here we go, there's another shot, I'm giving you a little bit more, not only of the south elevation but a little bit of the east and then keep going, and then this gives you the view of the existing areaway fence at the south and, as I said earlier, it has no architectural or artistic merit. It looks like it was. It doesn't something that came out of a I, don't know. Well, you know, I dare say a home depot or somebody needed an areaway fence, a gate, and that was procured, but it does not rise to any level of doesn't do preservation, no, not something, and then this is the view down the north area way really and those how wide it's very narrow. It varies because there are some vertical buttresses that in some cases it's quite narrow. We have it on the plan. So if you would like, I can certainly walk you through that again in relation to defense that we see yeah. Is there a way to indicate where the poll would be in the corner? So if you can go to yeah, if you can just imagine sorry, can you go back to where you were this one, I'm sorry, Linda yeah go back one more advance or I advance, one more where we just were at the north area way there we go okay. So if you can just imagine you can see in the very immediate foreground the black area, away, fence and gate, can you put your cursor there and then we can. Just everyone can see it yeah and then just imagine that in that corner there, where you see the right angle of the metal that no and tucked in the corner here close to the street or the sidewalk, keep bringing it closer yeah. So no we did not do a rendering or a compute like a computer generated montage. We just you know, have the existing condition photographs but with I think very detailed drawings that illustrate the intention and location of the two poles. The other thing I wanted to point out here. You can see these very large metal light fixtures in the area way and all of those would be removed and we've chosen something much more discrete right, yeah, that's an improvement very much so, and the next door neighbor has a light. Indeed can't hurt have a little more light right now. Okay, any further questions discussion before we finalize this resolution yeah, you said that the south area is elevated. Yes, so will the poles be at the same height, even though the base of the pole on the south platform is already higher? Is it higher is a thing on a slope? The south is higher yeah, the south is higher than the north. So if you go to the drawing you can see on the elevation, I'm sorry, I'm asking you to jump around here. Yeah zoom doesn't make this easy. I'll tell you no it doesn't. It has its own little ways that one was 2009. 14 LPC. Is that one? If you can see that on the pdf, you see it? Yes, so if we can go to the you're doing great okay now, where do we want to go okay? So, let's go to the let's go to the area: let's go to the elevation, the front elevation and that will show the two poles. This looks like the pole on the south side is looks like they're about the same height. So it's in front of the steps. Well, so does that mean it was adjusted that the pole on the south side is shorter. To begin with, to compensate for the difference of the platform heights? Hmm, can you show the drawing Linda, I'm sorry which one I'm trying not to toggle between my work screen and this zoom screen. So I'm trying to just if you could just put those drawings on the screen again, one more time: okay, 2009 14, please LPC set one. That's the one: I had open I mean you're looking at a different page of it right. Well, no I wasn't able to see it, so it wasn't a share screen. Let me put it back well, Susan, do you know the answer to the question? I'm Misha and I. Honestly, don't remember so that's why I was asking to see the drawing. Thank you for being patient with me there. It is not that not the view I wanted, but it might work. Okay, yes, okay, so if we can go so if we can go to the West Front elevation, A200, okay, so this one it's raised, it looks like it's very similar in height. It almost looks like it's in front of the stairs that these are the stairs. There are stairs behind it, but there is a bit of a raise from the sidewalk level that you have to hoist yourself up onto right on at the south side. So you can see if you I, don't know if you can press that little plus sign at the top one more time, and we can just magnify this a little bit and make it easy yeah, maybe one more yeah. Oh we jumped around okay here. This is fine too! That's fine too. This is okay, oh okay, or we can work with this. So if you could just make that yeah very good and then just bring it down a little bit. Okay, let's see what's going to do well yeah and it jumps there. We are yeah, so you can see it's a little bit higher, but and if you had a level or a ruler- and you could put it right across, you would started that the south is a little bit taller than the left than the North pole. South pole is going to be just a little bit taller unless you can cut down the south pole, so they are at the same height. Well we're trying to keep the costs as simple as straightforward as possible and just specify the stock products without too much customization, but I can certainly relay to the museum. If that's something that the community board would like the team to consider. Only because I can't guarantee I can't speak on behalf of the museum, obviously yeah, only because the facade is so symmetrical that maybe the introduction of even something you know. Modern security wise should also be a minor point, but yeah I think so even the gates, you know the gates come out at a different height because of the stairs exactly and again, these are not meant to be the focus of one's attention. When you look at ordinarily stunning building, it's a big building right and hopefully your eyes would really be drawn to the landmark and less so to any of these security upgrades all right. You want to go back to the resolution. Yes, I can find it if it still exists. Okay, is that it? No! In the paragraph talking about the security installation, we didn't mention the polls. Okay, that should be right here. Yes, well, I would take away the reference to the gates, because that's something that the landmark staff are going to be reviewing so I instead would ask that the application to be to install two security polls? Yes, exactly with bloodbytes and security cameras with exactly with lighting and security cameras. Yes, are we satisfied? We are all right. Would someone care to make a motion all in favor I? Thank you very much. Thank you Sandra and David, I'm assuming that you also voted I. Yes, okay! Thank you very much. Thank you! Everyone. Now we really appreciate it evening we're going to talk about marble, collegiate church, Middle collegiate church I added that to the agenda. It's not the marble church. No, it's the middle police, sorry middle collegiate church and also the building which is adjacent, which is also a landmark and where's. My little agenda I think it's Isaac hopper house. Well, this is the. This is a bit of the preservation, the designation report for the Isaac hopper home or the Van Wyck Mead House, whichever we want to call it. That is a it, is a landmark and was damaged in the fire. This is the building that the women recovering from in prison that we're living. So we have two damaged landmarks here, one of which is individual and one of which is a member of the historic district. It seemed to me we should say something it may be, which is which make your pardon, which is what you said: one's individual and one's part of the history one. This Mead house is an individual landmark. The middle collegiate church was not an individual landmark for some unknown reason, but is part of the historic district correct, so it seemed to me I mean we may want to say something pretty brief, because we don't know a lot here, but it seems to me that we should be on record that every possible effort should be made to save these buildings and restore them. Does that seem? That seems the general spirit? Yes, so this is an ad hoc resolution. I haven't written anything, but we can write something bring up a blank document here. Well, given that the church is a major contributor to the it's, the East village, historic district, yes, and that its stone facade has been a has stood constant vigil over this historic area for I. Don't know when was the church built? Okay, we can look that up x, number of years, yeah that are you seeing what I'm typing, because I want don't want to get out of here? No, that's too bad I see the designation report for the hopper home. Let me stop that share, and where is my, how can we start a new share? You're supposed to be able to switch shares, but that doesn't seem to be functioning for me. Okay, how's, that yeah okay, so whereas the middle collegiate church is a major contributor to the East village, historic district and whereas the building represents a long and significant history of comfort and compassion, you say something about the fire: I, don't know what you want to say about the fight, just that it was severely damaged. Well, I, don't know that! Doesn't support our argument for preservation. Well, we have to well maybe I'll say severely, but we need to say that it's been before we say it's worth preserving. We should say what what's wrong right, I, send you a picture from Twitter who wants to send me a picture Carolyn Evie Grieve has incredible pictures. Oh I can probably find that yeah. If you look on Twitter he's got a whole bunch, I'm not going to twitter while we're trying to have his meeting. Sorry I think I can find it in my email. However, all right that would just that's the that's they're like therein lies madness. I would like to say, and whereas the stone facade of the building is still extant or still standing this in the tower the belt, the steeple I, don't know how you would want to describe it. It's the facade, but it's also the tower it looks like the back wall is also standing. It's where you are, I'm not sure how what looking at this is going to do for us, but hey should be there. Where is he there? I'm still on the phone? Hmm I thought I was gonna, find it there. They are I, see they've done it. They've demolished the building on the corner. He says oh really, yeah. That was quick, yeah. Well, that's what you have to be afraid of, so I'm just looking at his posts, the one that has the best image right. This is a little bit. I have to look at it in my email here, I guess, whereas that intersection has lost so many of its historic buildings, yeah well right across the street right, a terrible fire on 2nd Avenue and East 7th street I know it's a doomed corner, you know: well! Is it doomed because of its relationship to Saint Mark's and their vision for second Avenue? That okay? Well there's a little one there? Can you see that so since that photograph was taken, you're saying the corner building has been developed been demolished and this other little building is I. Think it's this one right. Deborah do you know it's kind of hard to see in the photo but you're talking about the one, that's right behind the one that was demolished because it fronts on Second, Avenue, yeah. Now, wasn't that a way that you entered the Parish hall of the church, that section is to the east and you can just see the little steeple at the top sticking over the other building that building still intact. Oh good yeah, the it was just the red brick building on the corner, the other building is okay. You know it's hard to tell from this photo, but it looks pretty yeah, I'm looking at the ones on Twitter that he has that show the demolition oh and there's the date 1892 for the church. Yeah, that's what he says. I actually have a clip of the designation report, but I'm not quite sure where it is. We need it. I can fetch it up. Well, if you want to say, whereas the building has been a major landmark in the community, since its construction in 1892 say that again, whereas the building has been a major component of the community since its construction in 1892. and I can just double check. That fact, before we do this, the stone for that entire building are still standing there, all of their Tiffany Windows were demolished for sure that was so tragic. I mean it's just awful, but maybe the Liberty bell, that's up in the tower is okay. It says it was built from 1891 to 92. 1892 is good enough. In that case, anything else we need to say here. Well, you wanted to say something about the fire I did and then, if you want distracted okay, do you want the architect's name? It was Samuel, Reed I, don't know if we need to put that in okay, whose architect was why not okay yeah, like that Samuel B, Reed R-e-e-d b, is in boy. Yes, v is in boy and then the last name is r e d got it okay. So now we want to say something about the fire, or maybe we can say, despite the fire, the stone, facade and tower of the building are still standing yeah, that's good anything else. We need to say here, or is this enough? Well, you want to say something about the loss of several other buildings at that intersection, as another reason that this, what these two should be maintained should be preserved. Okay lost at this intersection. Well, several historic buildings. Okay, it says the church's congregation. History goes back nearly 400 years. The church's tower also housed New York's Liberty Bell, which rang out for the inauguration and death of every U.S president, as well as for September 11th. Remember the bill was cast in 1729 according to the New York Times, its condition was unclear as of Saturday evening. Right well, I mean as important as the bell. Is it's not that significant, an aspect of maintaining what remains of the building yeah? No, it's just if somebody's going to get up there and rescue that Bell. Okay, therefore be resolved, everybody I want to say not to destroy, not to demolish. To save, let's be positive. What remains the mayor is, referring it to it as an icon of the East village. That's a good phrase. Yeah say that instead of major component I, like that yeah for every effort must be made to save what remains of the building and to restore it for future generations for present and future generations. Okay, that's good! Now we need to get something in about this other building, yeah Catherine Walpe, just tweeted, something when we say something about. We don't know what the condition is of the made house. Do we know anything about that? Deborah Tavis mood you did. Can you hear me? Yes now we can't yeah I heard on the radio that there was significant water in smoke damage and that's why and they had to move the residents out of the building, but that's all I heard so that doesn't sound like it would lead to demolition the front the facade looks good to me. It looked intact, but I don't know. If it's you know compromised in terms of stability, can we incorporate both of these in the same resolution or do we need two different ones? According to Susan, you can only deal with one topic and a resolution. Well, it is one topic in the sense that it was one fire yeah. Could you say in the adjacent building, something like that so to fold it in I? Don't know it's hard, maybe we'll write a separate resolution, what the heck, so, whereas it's got a long name, I wonder how they know it. Ralph and E Van Wyck Mead, the women's prison we've got it all in here, just in the title. Well, would it be of the or now women's Prison Association, I'm just reading from the designation report? Yeah it was named. You know, early on to be after Isaac hopper. It's hopper, not Hooper yeah. Is that Isaac hopper the abolitionist? Yes, oh, not open, but yes, it is. It was named after him after he died because he was very interested in his daughter were very interested in you know women who had been in prison and trying to help them so I. Don't know what year that was that it was named the hopper house, the hopper home, okay, I'm just gonna quote a little bit out of this destination report, all right. What I want to say here? Oh it's, an individual landmark I guess we should say that right, we should say up there. We should see I think we did say it was a contributing building right to the well. But it's not a contributing building. The hopper is not because it's an individual animal I know I'm going back to say yeah. We said that this church is a part of the East village. Okay, whereas wow they heard it twice. They weren't too anxious to do this, so they fought in 2009, I. Think 2009. What happened here? It said they heard it I think it's I think it was one of those 95 backlogged buildings must have been interesting and that finally made it yeah. Well like so many others. Unlike so many others, yes, but we don't. We never give up the Don coyotes of the preservation world and we want to say something about, whereas the public face or the facade of the building is a well-preserved example of the Greek Revival style, I, wonder when it became it said when it became a home for the these. For these women, 1874. building was purchased in 1874 by the women's prison, Association yeah, the Isaac t Hopper home, opened in 1874 and is considered the world's our oldest halfway house for girls and wind women. So I think we should say that, yes, great, was it designated in 2009? Yes, oh because you said 1990. that won't do I was dreaming on. Thank you was purchased in 1844 the women's prison association and is considered the world's oldest halfway house little girls and women released from prison, so they're good guys anything else. We want to say about this see if I said anything more about the architecture here. Some of these reports do go on, don't they they're interesting, but they don't get you to what you need to for a resolution now here it is yeah. Maybe we said enough: do you think yeah? So then we could do the same. We did before therefore, be it resolved. Every effort must be made to save what remains there. It is, although I would say in this case for continued use by the women's prison association. I, don't know if you would want to include anything. The this neighborhood has lost so many greek, reliable buildings in the past 20 years or actually more than that I mean you know it's like Trinity Lori said Lutheran was listed as one of the finest examples of Greek Revival architecture and it was demolished in what the 60s 70s yeah. This is one of four I think George's was demolished. Well, let's see I think we might have said enough about its greek revivalness. I think this is sufficient. We're just expressing a quick community board opinion here, so there aren't that many greek revival, things left. No, that's for sure did you need to say something about the fire damage for the second one. Oh yeah, that's a good idea. Whereas what do you want to say? Can you describe what you think we know about this? Where is the has suffered water you? What did you say water and smoke yeah? Do you want to mention the fact that the residents had to be removed? Temporarily? That's pretty obvious, yeah? Okay! So should we approve these I guess we should do two separate votes. I'm sure it'll be unanimous. Let's have a motion for the middle collegiate church motion for the middle collegiate church, my second all in favor aye. Now, let's have one for the Van Wyck Mead House another. Thank you David. Did it? Okay, get a resolution on this one, a motion to approve? Second, all in favor hi? Okay, guys it was a little amazing here. Thank you, David and thank you. So much was this kosher to have to discuss without it being on our agenda and say that again, was this matter kosher for us to discuss and do a resolution on when it wasn't on our agenda. Absolutely not. However, I'm going to invoke the emergency provisions. Obviously this could not have been put on our agenda because it just happened and if we waited to vote on it for another month, it might be too late. Yeah. It will be very lucky, I, think I'll get away with it. I hope. So I'm sure this is you know something that everybody in the community board would agree with. It'll get unanimous approval all right, so all we need to do now is adjourn. Does anybody object to a journey at this moment? No, so we are adjourned. Thank you. Everybody stay safe and well. I'm kind of an interesting one right, yeah.",
            "summary": "They also retained the services of a security consultant that would help them in navigating how best to address the vulnerabilities that NYPD had identified, and the building, of course, is a New York, City landmark.\nLooking carefully at landmarks rules and guidelines for health, safety and security, upgrading, and almost everything that had been presented to the landmarks Commission applying you know, different measures met with the landmark staff's rules.\n12 feet, high black and one would be located at the north area way and one would be located at the south area way, So that would be within the bounds of the existing areaway fencing, but as it happens, or sometimes with older buildings.\nIn addition to applying to the Landmarks Commission for the security polls, we also went to the department of transportation and their revocable consents department and because we were able to prove that the Areaway fencing was in existence before 1940.\nThis case, The museum has two fire escapes one at the south: area, way, one at the north area way and due to the close concentration of other buildings that have been developed and over time at different heights.\nThere are some opportunities for people to jump onto the fire escape and then potentially get access to the interior of the building, and so one of the recommendations was to of the security consultant was to respond, and.\nIt wasn't on the primary facade, but it was on the area way on the south area way and that you know corresponds with the need for the security measures that have been so far identified by NYPD.\nThis location was identified by the security consultant as the best possible location for this pole and the pole, which would be painted black and metal, and we identified the Vega manufacturer, it's a specific product and it would support a light that would be able to illuminate the facade and a motion sensitive camera, so that location as I said, was specifically chosen by the security consultant.\nAnd then, If you go to the exact south, so at the top of the drawing, also right next to the areaway fence and the exact same installation is proposed, there would just be these two.\nYou know to try to not impede any egress points, because obviously these are egress corridors for anyone in the sanctuary that exits through the fire escape and would need to then exit out onto the street.\nThere's two locations on this fire escape where these anti-climb measures are proposed, and you can see that the adjacent conditions on the south there is an existing building with a lower one-story appendage to it.\nThen you can see the boundary of the fencing, the Areaway fence, okay and the gates, so that you can gain access to the area ways you can gain access to the steps going down to enter the museum.\nOkay, I love this right, yeah, yes, one at the south and one at the north, sir, and.\nYes, is the ADA, so, As you can imagine, We had very specific size limitations and dimensional limitations, but we responded to the recommendation of the security consultant that the museum engaged in placing these polls in these two locations, and we identified the manufacturer of the polls and security lighting and camera that would mount onto the pole and again, The goal is to try to find a pool that is going to have a good longevity, A good life to it.\nYou know a solid installation, but at the same time we wanted it to be something that would not call great attention to itself and try to recede somewhat in the background and yet be functional and utilitarian.\nWe know that there are a number of pavers that are blue stone that would need to be lifted to accommodate the electrical conduit run and then replaced not reinstalled, I should say reinstalled once the electrical conduit feed into the building has been established and then at the south area, way.\nSo, it's a little bit more difficult to access than the north area way, but the goal is to be as minimally impactful as possible and to return the you know, the blue stone pavers, where they exist, to the condition that they were in prior to the installation.\nAh, Behind the pole, There are two proposed gates that would that we found clearly shown on the historic drawing from circa 1905, and the goal is to install new Areaway gates that match the historic elevation drawing and those would be reviewed at the LPC staff.\nWhat is before you today are the two security poles and then the anti-climb measures that the fire escapes.\nWe, don't know how it was installed, it's in deteriorated condition, but has no historic merit and the gates that we are proposing under a staff level are trying to recall the historic condition based on the documentation.\nThen we can do the south elevation and talk about the anti-climb measures, and you can also see the poles in section, and here, sir, You can see the location of the pole and then you can see the plane of the Areaway, fencing and gates.\nSimilarly, Here we want to discourage anyone from trying to climb onto the fire escape and, as I said, These anti-climb measures, are.\nAnd, you know whatever they want to do, but it would certainly be a deterrent for anybody that was trying to gain access onto the fire escape, and so the intention is to do something in an extremely light metal mesh so as not to you know, compromise the visibility of the historic landmark and certainly not to diminish any light coming into the building through the windows beyond, but at the same time create this anti-climb measure.\nFencing is going to be replaced with new fencing as part of a staff level application, but the anti-climate measures at the fire escapes are not something that the staff can do at staff level to approve, and so it must be presented to the commissioners at the public hearing.\nAs I said earlier, The building was designated by the Landmarks Commission in 1980 and then listed on the state of national registers and historic places, and they as a national historic landmark as well, and the museum of course prides itself in its history and there's the image that I just sent.\nI can only do one thing at a time, so let me see if I can find that metal and while the image is coming, through, okay.\nWe, were talking about security issues in various landmark buildings and in my case, in the park that I look after.\nYou know that making very surgical, specific installations and upgrades in a way that tries to meet the needs of the security requirements.\nSo, certainly I'm familiar with this type of metal mesh, but had never seen it in an application like this at fire escapes, but landmarks.\nOkay, She wants to know how much taller the pole is than the Areaway fence.\nThen, If we can advance to the north elevation and that shows the relationship of the Areaway, fencing and gates to the proposed poll.\nThis proposed pole- is five inches in diameter and 12 feet high with the goal of being high enough that you don't allow people to try to tamper with the placement of the security camera.\nYou know that in placing this poll, these two polls that they would be beyond the property line and we did apply to the New York City DOT, revocable consent department, asking for their determination as to whether or not a revocable consent would be required, and they said no, because you have demonstrated that the area way fencing and gates existed prior to 1940 that they would not need to issue a permit for the proposed polls.\nHowever, They are obviously required for permit from the landmarks Commission, but I can have someone scale the off at the office tomorrow, the dimensional difference in height between the top of the existing area way and the top of the pole, so that you would have that dimension.\nActually, don't know if the cameras would focus where the security consultant suggests that they'd be focused, I would think on the doors, but again I, I'm, not privy to where they would be focused.\nIt needs all of the security that can be provided within the context of a historic building and that these measures should be endorsed by the community board.\nYou say that again, I'm putting up where is in, whereas in here I said, whereas this building is not only in New York, City landmark, but also it's a national landmark national, historic, landmark, okay and also a national historic landmark, as well as a architectural and cultural touchstone of the community and has been such for over a hundred years.\nOnly other thing I could think of is you might want to add something about the experience of break-ins and therefore the need for these security.\nYou can see also that there is a you know, an opportunity for someone getting on top of that low building immediately next to or low roof immediately next to the museum and then jumping over the area, the fencing and getting on to the fire escape or wherever else they wanted to get into.\nWell, you know, I, dare say a home depot or somebody needed an areaway fence, a gate, and that was procured, but it does not rise to any level of doesn't do preservation, no, not something, and then this is the view down the north area way really and those how wide it's very narrow.\nYeah, You said that the south area is elevated.\nYou could put it right across, You would started that the south is a little bit taller than the left than the North pole.\nYes, well, I would take away the reference to the gates, because that's something that the landmark staff are going to be reviewing so I instead would ask that the application to be to install two security, polls.\nI mean we may want to say something pretty brief, because we don't know a lot here, but it seems to me that we should be on record that every possible effort should be made to save these buildings and restore them.\nI would like to say, and whereas the stone facade of the building is still extant or still standing this in the tower, the belt, the steeple I, don't know how you would want to describe it."
        }
    }
}