{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UC2QG4OKWo8tQ-h3fAwxr4eg",
            "title": "2020.08.20 - CB2 Transportation \\u0026 Public Safety Committee",
            "publishDate": "2020-08-27",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nTransportation \\u0026 Public Safety (T\\u0026PS) Committee\\nThursday, August 20, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:20 - Roll Call\\n00:04:35 - Approval: Agenda\\n\\n00:01:00 - Presentation: 11 Hoyt - Kate Cella RA, Bjarke Ingels Group; Regina Myer, Downtown Brooklyn Partnership // streetscape improvements for a mixed use development\\n\\n00:32:50 - Discussion: FY22 District Statement of Needs \\u0026 Budget Priorities - Brandon J. Holmes, JustLeadershipUSA, the New York Civil Liberties Union, and VOCAL-NY\\n\\n02:41:45 - Vote: 11 Hoyt streetscape improvements\\n\\n02:43:30 - Approval: June 2020 Committee Minutes\\n02:44:00 - Chairperson's Report\\n02:46:35 - Motion to Adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 229,
            "um": 444
        },
        "wordCountFullTranscript": {
            "community": 91,
            "people": 76,
            "court": 69,
            "police": 68,
            "school": 53,
            "lot": 45,
            "system": 41,
            "officers": 39,
            "downtown": 35,
            "traffic": 35
        },
        "wordCountSummary": {
            "community": 23,
            "people": 20,
            "police": 15,
            "health": 10,
            "downtown": 10,
            "officers": 10,
            "court": 9,
            "services": 8,
            "years": 7,
            "school": 7
        },
        "fullTranscript": "The meeting of the transportation and public safety committee of Brooklyn community ward 2 called to order and is being recorded on the cv2 youtube archive in accordance with the NYC open meetings law. It is the practice of community board 2 to conduct remote meetings with all committee members cameras on please. If you have that capability and if you're calling in from the phone we understand, we encourage all public attendees to also leave their cameras on, particularly if you are given the floor to speak all attendees, please keep your microphone muted when you're, not speaking to maintain appropriate discussion and voting process, I will make it known when and which topics are open for comment by committee members board members at large and the general public. If you have questions that fall outside of the public comment time, please type your questions in the chat panel and we'll address them. If time permits, you may also contact the district office, you can use the email on the website. We are committed to providing access for all of our neighbors, regardless of physical ability or limitation. So if you require accommodation or assistance for full participation, please contact the district office 72 hours prior to any public meeting. We will now begin the roll call and our secretary john quint, chairperson, julia cohen, vice chair cheryl, gelbs secretary john quinn, president, ernest augustus, john, duke no you're. There say hello, I'm present! Yes, thank you. Gallo admire brother, caroline, I'm here, caroline, I'm! Sorry, I'm sorry, I'm looking at last night, caroline okay did you say sandy balboaza? No, I didn't santa elbows okay and we have a new committee member. That's an old committee member cyril scala that we'd like to welcome. Thank you very much. I'm happy to be here same old faces, but I hope we have a lot of new things to discuss. Welcome back zero, thank you and, if anything, well, I guess I'll see if anybody comes on. Did I miss? Are there any members whose name I called who are now have been unmuted, who want to say their presence? Oh cheryl, son? Okay, so we have we're just missing ernie dorian and brian else is here: okay, great thanks so prior to the approval of the agenda, I just wanted to make one modification I'll share the screen. So people can see the agenda. Oh kayla, could you let me share the screen? Hey. I can't share the screen. Oh got it! Thank you! So after the 11 point presentation, and then after our discussion with policy advocate brandon holmes, I've invited brandon smith from the the health and human services committee to speak to us about community courts in light of our discussion of the statement of district needs and budget priorities. So if I could get an approval of that amended agenda, I agree great. Thank you. You can stop the screen share, kaya! Thank you and then now we will move to the presentation of eleven hoyt and kate sella from bjork. Ingalls group will be presenting yes along with regina, and would you guys like to all, introduce yourselves sure, I'm kate sella, I'm the senior landscape architect at brk inglesburg, I'm regina meyer, at the downtown frequent partnership. Welcome. Thank you. We're very happy to be here: can you all see my screen? Yeah, okay, great so tonight, I'm gonna start off and then hand it off to kate. I know that you all are really familiar with downtown Brooklyn, so we're gonna keep this very quick. But I'd say why don't you go to the next slide? Hey, you know. We had the pleasure of introducing the idea that downtown Brooklyn partnership was working on a new vision for the core of downtown Brooklyn over the winter, and we spent a lot of time talking to you about our goals. The good news from that is that we had the opportunity to continue our work with the consultants over the past, I'd say winter and spring and now into summer, and we focused on some key areas of the core of downtown, where we knew that there were changes afoot and felt that we could really study them and understand them and perhaps recommend changes to really improve the pedestrian experience. And I have to say, in light of the health crisis. The idea of adding more sidewalk space and improving our sidewalk space has become more of an imperative for everyone in new york city, as we realize how important it is to social distance and to walk places and bicycle places in lieu of taking transit at this time. When everyone is so concerned, the goals of the study I'll go through very quickly, and this effort you'll remember this from the winter time, where two are to improve the streetscape, establish a stronger sense of place and strength and identity, and we were especially focusing on those areas of downtown Brooklyn that haven't seen any improvement literally in over 50 years, and if you go to the next slide, kate, the ideas were to make downtown Brooklyn, safer and greener, and more walkable and use color when it was possible to really distinguish our neighborhood and the next slide shows ways. We are doing that through geomet changes in street geometry, which is what you'll hear about today. When kate describes the project, greening new street furniture, color and different materials as a part of the sidewalks and the idea for the next. The next slide. Kate, is that, where we're handing it over to you, I just before I do turn it over to kate. I would say that we're very grateful to the partnership with D.O.T, because you'll see that we were able to fast-track a project at 11 point which is under construction to vastly improve the sidewalk space on hoyt and elm street and livingston street, and those streets really have not been improved ever the sidewalk whips, especially on hoyt and elm, are substandard at eight feet and I'm very grateful to DOT to let us work through these details, so I'm gonna hand it over to kate. At this point. Thank you. So everyone can hear me. So we really focused extensively on greening and 11. Hoyt presents a very unique opportunity in downtown Brooklyn because there are no subways underneath the block, so we're able to really focus on expanding sidewalks and providing in-ground planting, which, as regina said due to the sidewalk with elm in particular, currently only has one tree on it. So I'll keep going all right. So then, part of our downtown Brooklyn study was also looking at how to pedestrianize space how to expand the public realm. So this is sort of the existing pedestrian network in downtown, and we've really looked with DOT at phasing. How can we phase and implement additional shared streets building on what's already there on willoughby and lawrence, and will it be square and as well as alby- and this was sort of our ultimate goal- is to really pedestrianize as many of the streets as we can, that don't have high traffic volumes, and so this would be our phase two. So eleven hoyt is surrounded on both sides by by hoyt and elm, which we're trying to make into shared streets, and so just so, you can see the existing conditions. This is white street and you know due to the ongoing construction. There is a lot of scaffolding. However, as regina mentioned, the sidewalk with our substance are substandard, especially considering how busy the 2 3 subway station is and elm again. This is the one existing tree you can see: that's not in great health and the rest of it. The side along 11 point in particular, is only eight feet wide. It's quite narrow and livingston. Just due to the scaffolding, the sidewalk was are acceptable due to the scaffolding they're quite narrow. But what we're really here to sort of present to you and to ask of you is we're really looking at widening sidewalks to increase greening and those two things together: we're kind of creating a distinctive sidewalk which I'll go into more detail about, so something that, as regina meant, was strengthening the identity and really trying to establish a sense of place in downtown Brooklyn. So this is the existing bpp. The builder pavement plan at 11 hoyt, showing the trees that are planned. These are trees, are already there along both white and livingston, as you can see due to the sidewalk with there's nothing planned currently for elm street. So what we're proposing and what we've been working through DOT is widening. The sidewalks, so elm street in particular, would go from eight foot wide 16 feet wide and then we could really add a substantial rain garden as well as potentially seven new trees, which we think would be a very big deal in downtown Brooklyn and white street we'd also be increasing the planting significantly. Overall, it would be almost a 900 square foot increase in planting and 450 square feet of that would be a rain garden, so we have studied material palettes extensively. This is our preferred palette. We think it will be really durable and age, well, we're using all of dot's sort of standard materials with four inch concrete, we're just trying to add a tint to it, a color sort of a reddish and we're also using a standard steel face curve. Our other distinctive elements would be the portend steel planting guards designed to not sort of bleed onto the sidewalk, and we've also been looking at custom furniture as well with 3d printed, concrete furniture, so the color would be within the material in all cases. So it's not like it would chip away or scratch. So these are just views of our preferred option. This is hoyt street, looking back towards the fulton mall, so you can see we're really trying to establish an increase in identity with planting, and this would be livingston street, and this is elm street, where we can kind of have our most significant planting, because it's currently in the building on elm street there's only one entrance, which is why we can do such an amazing amount of planting. And then this is an. We have a few alternative, color palettes for pdc and so to kind of look at it just being a two-tone gray. Concrete is another option we have, and our third option was to do an exposed aggregate within the concrete and just to kind of show you. So the idea is really to sort of expand the sidewalk, the curb line and by expanding it you can then fit a larger planter, and you can also kind of distort the planter slightly by kind of having this indent, to create a seating area. That's out of the circulation path entirely and then the gray tones just represent the different tones of concrete and then we're sort of playing with the idea that this for the score lines in the pavement that are all saw, cut, could perhaps bend and just to give you a sense of this is the distinctive tree guards and how we're trying to kind of create something. That's durable, long-lasting. It gives a little bit of identity and we spent a lot of time really working on the planting to sort of it's a nice situation where hoyt is full shade and livingston is part sun and heart shade. So there's really an articulation we can have with the planting and elm street can be really colorful, since it's part, sun part shade, whereas white would be a little bit more green and then this is just a view to summarize. So that was what we have if you all have any questions or would like to discuss anything further or let me know if I went too fast. Thank you, regina. Thank you, kate. I would like to compliment the whole team on this. The downtown Brooklyn partnership told us a couple months ago that you guys were going to bring more open space, more greenery, more greenery and more color to downtown Brooklyn. You guys are doing it you're, finding opportunities to really bring that plant to life, and it wasn't just pretty pictures you're showing us you're actually doing it. So we really appreciate that those opportunities that you're finding and dlt that you're open to this non-standard Brooklyn, the builder's pavement plan also really great to see this expedited approval and such a cool design too. I think thanks. Thank you julia and I guess the only thing I'd want to say is that, obviously this is expedited because of the pdc but we'd love to have a time in the future. When you have more time to talk about the district as a whole, so we could really work together frankly to look at ways to fund and implement over the long term, because we all know that downtown Brooklyn needs. A lot of you know has a lot of junctures. That would really be great to improve, so I really look forward to the partnership. That sounds great. Thank you, regina. We do have one item on our budget priorities, which is new plazas, but it's not specific to location. So I think it would be great to work together to sort of envision that would be fabulous thanks. So I'd like to open it up for comments by committee members, I have a question about how it's funded. How is this funded? John? Do wants to go next. This would be the sidewalk widenings and additional plantings will be funded as a part of the new sidewalks along the development city. Funded no developer funded developer funded great. Thank you. I had a question about the scholar about the the legal size of a sidewalk. Could you just let me know what is the actual appropriate size that a normal sidewalk should be, I think, anything less than 12 feet. Downtown Brooklyn is especially in an area. That's busy is sort of substandard 12 feet, along with a few feets taken up by street lights, utilities other things, so I would say anything below 12 feet is substandard. The sidewalk on hoyt is 10 feet and the one on elm is eight feet, so they're very narrow for the amount of you're increasing the size of both that I understand yeah we're increasing the size both to about 16 feet. That's great, and do you one more question: do you have plans to increase the size of other sidewalks downtown in downtown Brooklyn? Well, that's absolutely! On drawing board I mean we would really like to and that's what I was mentioning earlier, that we don't have plans exact plans, because we don't have opportunities where developers are required to build new sidewalks, but we really want to work together to identify those locations. I mean, I would say all sidewalks and we probably couldn't like saying that, but obviously every street would need to be studied and we have to work with youtube and regina is your plan that you presented to us last time? Is that on your website, the plan, the presentation rather the one from the winter yeah, I believe so, but we'll we will check so sarah you before you joined the we joined the committee. There was a more in-depth presentation about public space, open space, transportation and downtown Brooklyn, oh great, and there are minutes to that effect. Juliet I would go to their website and see the actual picture presentation that would be. Thank you yeah. I do have to compliment them. It's a it's a it's an interesting and wonderful presentation, very pleasing, so I wanted to recognize john do who spoke and then, after that john quince, please, yes, regina. I haven't seen you in a minute good to see you good job. I want to reference the diminished traffic at hoyt and flatbush and that particular intersection is unsignaled and generally problematic in terms of crossing in the traffic that chooses to turn on to hoyt street. Is that being addressed at all hoyt in flatbush? Yes, hoyton fulton! Here, I'm sorry, okay, I I don't believe so. D.O.T did emily or neil I'm sorry. What was the question? The question is the intersection of hoyt and I said, flatbush's fulton street. That's an unsignaled crosswalk area where, when cars choose to turn onto hoyt street, there is constantly a con conflict with pedestrians and cars choosing to enter. Oh something like that, you can enter into the 311 system or you can send me an email and I'll put your request in to create a study to see if the intersection can be signalized either by multi-way, stop or traffic signal, and we can go from there that that's been a request for many years now. That dlt has not been able to come up with a solution for so I'm pointing it out again, because this is yet another opportunity to take a look at it. So it has been studied and denied correct. Oh for years, that's been an intersection that remains problematic, because it's right near the exit of the nevin street irt station folks get off 11th street and then have to walk down and cross hoyt in order to access the fulton street corridor. Yes, sometimes, unfortunately intersections if they do not meet the federal mandates, cannot be signalized either by a stop sign or a traffic signal, and if we don't have those in place, unfortunately, we can't implement a crosswalk, a crosswalk at the intersection. No stop control is more dangerous for the pedestrian than well. You might not be able to do anything from a smelling perspective, but possibly you could explore some treatments on the pavement that would further delineate a pedestrian crossing and alert the traffic to be more cautious. That's an intersection that we've asked dlt to look at again forever and to study the accidents at that intersection. So I think that might be helpful to take a look at. I mean I'll get a token into account when studying the intersection and unfortunately from what I'm sort of getting is that it's been denied that they don't meet. The federal amendments that do you think given 11 hoy is a huge condo building. That's just opening that, maybe it could be looked at like your scope could be expanded just a little to look at that intersection and what yeah might be recommended. I need to look at this more because a few different things I would respond to one there's not that many cars on fulton, if not any, because it's a bus way. So the issue from- and I think most cars, though just to speak to your question- about 11 hoyt, actually will not be using fulton, because the access to the garage for 11 hoyt is actually mid block. So I would just like to look into this more. I don't think it's something that is developer driven clearly this you know if I want to learn more about john the conflict that john is talking about, because the function of fulton street is important to all of us. Oh thanks, kate, but what you see from the developers? The from the picture from eleven point is that all the cars and the developments are actually gonna, be using livingston street and going up to elm to access that garage. But let us get back to the committee on this item, because I certainly want to learn more from john about what he's talking about with the nevin street subway, because you know the nearest subway here is hoyt street and I just want to learn more about what he's got in mind. Okay, thanks, regina, maybe john, and I can follow up separately- is that okay? Is that? Okay? Under the rules I never get. That would be great okay, john you and I have to make that happen. We also have to catch up on your oh Brooklyn bridge park, place, regina, okay and then after john quinn, caroline todd has something to say: john quint, we can't hear you john. Your microphone is off all right. I'm gonna go to the caroline and then we'll come back to you, john okay, hi yeah. This looks great and I mean it's very much in line with the presentation we saw in the winter from downtown Brooklyn partnership and it's exciting that this can happen quickly. I do wonder I mean I walked down fulton an hour ago, and you know it was bustling and great, and there were so many street vendors out and that's you know one of the things I really love about downtown Brooklyn and the fulton mall. I wonder what this does for street vendors, both regulated and unregulated, and just want to encourage that. You know commerce as helpful, not hurtful yeah, I mean. Actually, I would say this is silent on vendors carolyn. Obviously, we have to follow the city-wide rules, but you're correct that vendors are permitted on fulton street okay great as long as there's. I guess this. It speaks more broadly to fulton. Maybe, but I mean I definitely did see vendors along elman hoyt around the corners and yeah as long as there's nothing design wise to prohibit them. That's that would be something that would concern me like any kind of barricades or intentional street furniture that didn't make that accessible. Okay, john quint. No, I was actually when you heard me, I was making a comment to ciro about the presentation because it had been at the board meeting, not at our committee meeting. So I have nothing. I have no. Both they came to both right, but the bigger presentation was at the okay, that's right: the board meeting! Juliet! Can you hear me? Yes, john, you didn't have anything else to say no! I did not. Okay go ahead sandy, okay, I'm having trouble, because this is my first time doing this I was just wondering macy's is across the street and so their sidewalk is going to be the same as it was. It's not going to be like unified or connected to the 11 hoyt side right. No, but the sidewalk is wider to begin with, it's like 14 feet wide on the macy's side, but we have sort of the material. Pallet was in many ways derived from the new kyle they put on the macy's facade. They have these beautiful sort of wavy terracotta glazed tile, and that was really the inspiration for this material palette. So we think the two will work together. Very well. Okay and are you there are three curb cuts, one on each side of the building? Is that correct, hoyt, livingston and elm, and which is the which is used for the garage? The they 11 white has an interior motor court. So the one on the southern one on elm is used for the interior motor court as well as the one on points, the other one on elm. This is their loading dock entrance and the activity, because I maybe I missed that the activity of the building once it's open and the loading docks and the garages and the you know, traffic going into the building. I assume for the residents, did D.O.T study the impact or is there is that going to come later or what yeah so designs? Conclusion designs are submitted to DOT for approval. It has been reviewed, I don't know when, but I can look that up. Okay and hoyt street is a has a lot of traffic. It's southbound and there's always a lot of traffic coming I'm on I'm on atlantic and hoyt. So how does the narrowing does the narrowing of the street because you're widening the sidewalk, so you're narrowing the street? How does that affect traffic? Okay, and this doesn't change the moving traffic at all this? What this does is eliminate parking and who parked there. I know I've, you know I pass it all the time, but who exactly parks there. My pet is it's a lot of placard parking, but I'm going out of my lane here. Well, that's a problem for us all! So if they have to move from there, they're gonna come somewhere else and they need to be stopped, and I hope that the downtown partnership will work on that. Not just push that off on the surrounding neighborhoods that are still close enough for them. To I mean we have them parking on atlantic avenue, taking the meters all day, all right. Let's stay on this to see, if there's any more comments on eleven white, maybe from community board members opening it up to people who are not on the committee, you can type in the chat if you'd like to speak- and you don't see anybody typing in how about members of the public, you can use the raised hand feature. Where is that feel free to introduce yourself and speak cyril scala? Do you hear me? You already participated? Okay, I just had one more question. It was about the fact that is the developer. Do we know if the developer is at allowing for a bike parking in their building or just bicycles, not city bike, just bike parking- we don't know, but we can house can get back to you. Would you like to advocate for that on the sidewalk? What was that would you like to advocate for bike parking on the sidewalk? Well, I think the sidewalk of fantastic and I wouldn't want to add bikes there, but I think if they have a parking spot for cars, it would be good since the times are changing, they would have biking parking for their employees or people or the people who live in the building. Okay, thanks, sarah yeah, I'm pretty sure they do have bike parking, but we'll get back to you on an exact number. Thank you all right. It doesn't look like anybody else is, has raised their hand to speak it correct me if I'm wrong, caroline, oh, I don't see anyone else. Okay, then, I would like to thank everybody for presenting today. Thank you, regina. Thank you, kate. Thank you very much. You're welcome. Thank you. Okay and now, we'll move into the second part of our agenda is mr brandon holmes on the phone. I saw him sign in yes, please brandon, you're, muted. If I see you there, can you hear me? Yes, we hear you now hi how's it going great. I would just like to introduce brandon. He is mr holmes, is a an organizer and policy advocate in the social justice arena. He's worked with numerous organizations in criminal justice and police accountability, and he can tell you more of the specifics about his background and what he's going to do is just give us a little bit of color on what other organizations across the city are doing in the realm of rethinking criminal justice and accountability and civil liberties, and then, after he's done, he will be participating in our discussion of the budget. Priorities and statement of district needs and also brandon smith, is here on to discuss and teach us about the community court system as well all right I'll hand it over to brandon holmes. Thank you appreciate it julia so good evening. Everyone, my name, is brandon holmes, as julia chaired, I'm an advocate and community organizer. In some of my former roles, I worked at vocal new york, which is a brooklyn-based grassroots organization and harm reduction service provider. Where I worked with folks who were currently on parole or formerly incarcerated, in removing barriers to employment and also working on, you know some strategies to provide treatment and harm reduction services instead of incarcerating folks who are living with substance abuse disorders. Then I worked at the new york civil liberties union, where I developed an expertise around police accountability and transparency, advocacy efforts and some on the state level, some work around decarceration and decriminalization, and also advocating to repeal article 58, which until this week effectively hid all law enforcement disciplinary records from the public and now, in my current role and where I will be taking a leave of absence from in a couple of weeks, I've been at just leadership, USA, managing and directing the campaign to close Rikers island, which is effectively in the past four years. Seeing the new york city jail population go from 11 000 to below 4 000. Today, we've heard below 4 000 for the past several months, due to a lot of 19 release, efforts to rapidly just incarcerate our jails and protect people from contracting Covid-19, and also due to a lot of pre-trial legislative reforms that were passed up in albany. One of the things that I wanted to discuss with you all tonight and I was invited by robert paris as you know him. He and I have crossed paths and collaborated in different community spaces before and along with some of you on. The call I see sandy is on here too. What I wanted to share with you all is for the past two years with the close Rikers campaign, we've developed the build communities platform which our team published in 2019 and 2020, and this was done in collaboration with hundreds of directly impacted community members and service providers and experts across all five boroughs to identify key areas where the city could divest from the criminal legal system and begin to invest in local, community-based programs and resources that improve the quality of life. For all new yorkers- and I know, brandon smith is going to talk about his experience with the red hood community, justice or the red hook, community justice court- and that's you know one of the things that we definitely want to amplify and prioritize and making sure that every community gets access to conflict resolution and alternative to alternatives to incarceration or alternatives to detention. Those types of resources I currently live in bed, stuy represented by community board three, and I'm looking forward to hearing from all of you tonight about what your priorities are, and you know what the statement of needs. Some of the top issues you want to address are, but I'm going to share in the link a link to in the chat to the 2020 report that our team did definitely identifies areas of workforce development, public health consulate resolution and alternative forms of accountability, and also family planning and family support. I'm going to share that document in here so that you can see some of the language we've used about how when we talk about public safety and we talk about public health, we need to address all public safety. As a public health crisis right, we need to have rehabilitative and restorative approaches to public safety issues in our communities and recognizing that violence is also violence. Homelessness, drug use are also the result of a lack of investment in public health in our neighborhoods and I think that's true across all neighborhoods in new york city mine in bed, stuy and euros downtown Brooklyn, so I'm excited to participate in this conversation with you all and provide any support I can for my Brooklyn neighbors, so I'll pass it back to juliet and brandon smith. Thank you very much brandon. I'm we'll call on you as we go through our statement of district needs and pick your brain on a lot of those items. So speaking of public safety as public health and rehabilitation, brandon smith is the chairperson of the health environment, human services committee, and he is going to speak with us about his professional experience in the community corps system. Thanks juliette and thanks for the opportunity to talk about this, and thank you brandon for a really inspiring statement about some pretty exciting work. That's addressing a lot of the areas related to criminal justice. I come from experience of having worked as a prosecutor for five years from 2009 to 2014.. I worked as a prosecutor here in Brooklyn, and I worked in both the community court setting and in the regular, I guess traditional court setting for both felony and misdemeanor crimes, and I walked away from that experience with a kind of unique perspective of having seen both sides of the prosecutor world and really seeing the benefits of community court. So I don't have any other particular specialized experience and there could be some other people who might be more knowledgeable than me about this. Just to make that clear. But I want to talk a little bit about community courts and about how they're different than regular courts so that we can think about. Possibly the benefit of what would be my dream and about this issue is there would be effectively community courts in every local community in Brooklyn to handle non-violent and misdemeanor crimes that are are of a substantially different nature than the serious crimes that you see, get that go into felony court systems like attempted murders and armed robbery, and such the community court is based around a theory of having one courtroom, one judge and in many areas, particularly in the red hook, community justice center, which is really the best model of a community court that exists. The judge handles criminal, family and housing court cases, and the benefit of that is that the one judge and the one courtroom enables the judge to see parallel between the two cases link them together and within the courthouse. There is a clinic with licensed social workers who are able to place individuals who are charged with crimes in into different programs that can ultimately be used in the same place of the really just traditional sanctions that exist in criminal law jail community service. The value of it, though, is it instead of having the jail a more meaningful experience is exists for the person who's charged, and it goes along with the overall theory of the court, which is more on the problem-solving side than the penalty punishment side of criminal law and when defendants take a plea that exists to and requires them to complete one of these programs, whether it be for mental health services, substance abuse services, maybe anger management or their specialized services for domestic violence, which are which I've seen been be extremely effective and people embrace and really turn their lives around in a remarkable experience. But once these are completed, people will walk out the door with their case being dismissed with nothing on their record with really. The alternative is the in the traditional setting. If you plead guilty to a misdemeanor crime, you're marked with that for the rest of your life, and if you, if you have some other dispositions it can be, it can be very hard to get it wiped off your record. So a real, clear benefit of having a community court is that you have a much better situation towards solving the problem. The underlying problem. Whatever it is, you know it might, the crime might be stealing a loaf of bread, but the problem might be a substance, abuse addiction or some other kind of personal issue. So you know these are the things that kind of make the community court set setting better down in red hook. They cover three precincts, the 78th precinct, the the 76 precinct and the 72nd precinct sunset park, slope and red hook, and the effect has been documented in several studies as reducing recidivism and and being a cheaper approach, even in the in the sense that you don't that it results in less incarceration, there's substantial substantially less people being incarcerated in the time that I spent in the community court. There was not one person that I saw. Go to jail involuntarily for a drug event, believe it or not. There are a few people in this world who would choose to go to jail rather than to go to treatment for a drug offense, but the vast majority choose to be part of a program and the effects are just amazing. When you see people participate in these programs. Of course, you have to have a judge who's willing to give a lot of second chances and to be pretty tolerant, but when you have that kind of a setting and when it's in a community-based atmosphere like, I think one of the big things that drove me to this feeling is that when we were sitting there with the close Rikers hearings last year and having people who come up and talk about their experience at Rikers, one of the real things that hit me was the discussion of how dehumanizing the experience was of being there. And when I think about 120 skimmer horn in the traditional court system, it has a similar sort of effect and when you're, looking at the seriousness of these offenses offensive, trespass criminal mischief, possession of a small amount of controlled substances. While these are things that are against the law, they're, not they're, not that they're not at the level that they should be punished with such severe sanctions and such dehumanizing treatment. So having a community court really addresses. A number of those fashions makes the community a lot better and responds to. I think part of the main concern that's associated with with the massive protests and movements recently, which is that we need to have a systemic reform. We need to fundamentally change the way that we do justice across the board and you know definitely that needs to take place with the police. Definitely that needs to take place with the prisons, but it also really needs to take place with the justice system, and I think from that you know the thought would be if we, if we would want to have a community court for the part of our neighborhood and community district 2 to handle the these kind of non-violent or in some cases you have some very like minor, violent cases where you have an assault and somebody doesn't have to go to the hospital or get hurt very bad. Sometimes those are good to be resolved in that area too, and it's all done very locally. So the court is closer to the to the defendants, the victims, the witnesses and it really just promotes a much better situation. Overall, I probably have gone on a little bit too long about that, but I I'll stop there and see if anybody has any questions or thoughts. Thank you brandon. I would be happy to open it up to member questions before we dive into the statement needs of either mr smith or mr holmes. I will ask a question of both gentlemen: have you had any exposure to the organization called gangsters making astronomical community changes? Are you familiar with that organization? Yeah I'm familiar with GMAC. I know. Rashawn brown and shan duke yep yeah they've been closed partners of the campaign in the past, so they are actually in some way connected to your organization and are become a referral source because that organization, as I expanded, is heavily invested in the communities that are most in need and they're located here. At least one of their outfits are located here on myrtle avenue and they do a lot of work in the 4th green public housing project. Yeah gmax is a great. So that's one of the organizations just in case there's other folks on the call who might not be familiar with them. They do a lot of gun prevention and gun seizure work. I guess like getting folks to turn in firearms without having fear of you know, retaliation or repercussions. They've taken a lot of guns off the street they've also been able to do a lot of violence mediation. So if there is going to be violence or there's going to be a fight, they have trained cure violence, mediators and mentors who will go into communities and talk to folks on the ground and try to present alternative solutions so that folks don't have to resort to violence. They recently had a contract to also provide services and connect with people on Rikers, island and in new york city jails, and I believe this year that may have expired and also with Covid-19. It's just been difficult for them to continue having that presence inside the jails, since the jails have had a really high contraction infection rate. So I'd say GMAC is definitely an organization, though, that when you're talking about these alternative conflict resolution models that don't require millions of dollars to be funneled into the NYPD or into jails. This is the kind of group that is a local group that has like trained. You know credible messengers and can do a lot more with that money than the NYPD is able to do. Thank you for that. My other request is that the information that you have provided this evening along with brandon, is very helpful and needs to be further distributed. This committee doesn't necessarily have a mechanism for getting the word out that describes all of the work that you are doing and we need to get much more buy-in from the community. More folk need to know exactly or have a sense of what you're doing, and maybe some suggestions or ideas as to how we can get improvement and better results. So my request is for some kind of description or website or some way of knowing what exactly it is that you described that we can share with a larger community, sounds great john and in the chat box, brandon holmes did send a link to a couple links that may be helpful. Maybe we can get the district office at least to distribute it internally and then talk about some wider distribution. Were there any other questions or comments? I appreciate the juliet I'm gonna say this. It might be a little sensitive, but I appreciate the ebony and ivory of the two brandon's priest [Laughter], juliet yes danny so yeah I was on the neck with brandon and the knack is the you know. It was really run by the mock j, the mayor's office of criminal justice- and we really didn't, in my opinion, have a voice. We got present. We were given presentations and updates, and that process was about the rezoning of four separate sites and four different boroughs, and I know brenda brandon. You know I know his agenda well from the experience of working with him and I agree, and I felt that process was backwards, that we should have started with with the reforms and services and changing the culture of the corrections offices, and so I'm hoping now I mean, I think, because of the budget, the pandemic and the budget. I think the building is going to be delayed and we're trying to find out from councilman levin who's not responding, but to see if we can start to reevaluate the whole thing that was pushed through for, in my opinion, political reasons. So I mean I agree with what brandon and brandon is that right, two brandons and the city's not going to be safer or better until there are investments in the in the communities. You know from housing to health, to everything nation. You know everything to pac, to put all the resources into these giant jails never made sense to me, because the focus needs to be on building the communities and making the community stronger. So that's so I hope we can. You know, have start to focus on that and have our councilman who's still here for a year to who supported pushing through the you know the mega jail plan to start to, let the people in the community have a voice and decide how the funding should be spent sandy. I appreciate that yes- and I feel like that is a really good context for us, starting the conversation about the public safety initiatives in our statement of district needs. If we're, if we're ready to move to that now, julian, oh, yes, it's zero. I had a question for brandon, I'm very interested in the community court system. I know we spoke about it well, a while back that it's in red hook brenda, but what, where is it in the court system? Is that the only community court that we have in the city? It's not the only one that we have in the city, but it's the only one that really works in a in a in a comprehensive manner for people of all ages. There's been an effort that took some time to get a community court started in brownsville and, as I understand it, I'm not the most familiar with the bronzeville community court. But I understand it focuses on younger people, whereas the red oak community court focuses on people of all ages and the it sits in the misdemeanor court system. But it's important to know that it handles arraignments and it's the only it's. The only support outside of the outside of the regular 120 skimmer horn atmosphere that handles arraignments and because many cases get get resolved at arraignment. It's very important to have a judge who is really in touch with community lives in the community, knows the local community making the decisions and being a part of the of those cases, and then it handles the cases all the way through trial. Now you're not going to have jury trials in a in a community court that, I think, is probably better for a for a downtown court, because it's difficult with getting all the people into a into a jury. All the all the potential jurors to go out to a smaller community court, but the having it in a having it in a one-room court. Courtroom in a in a community creates a much different atmosphere and it actually makes the whole system a lot faster. So you don't have these cases that last for years and years they get resolved actually very quickly as a follow-up. Why it's part of rhetorical question: if it's been, how long has it been in existence and how, if it was so successful, why hasn't it been expanded just automatically within the court system? I mean, I I'm sure you don't have the quite the answer to it, but if the rhetorical question the way that we should really be as a committee or looking at that and saying, why can't that be expanded seems to be successful. You said the recidivism is very low. That in itself is a big plus, so I just was wondering why no one has taken up the mantle to push it well. I can't speak for it. No, I'm sure why it isn't everywhere, but, as I understand you know, in some comm in some communities there is a NIMBY-ism about having a court in your in your neighborhood and in other in other areas. You have to get a number. You have to get a number of parties on board. You know you have to give the district attorney's office. You have to get the off the oca, the court administration. You have to get department of corrections on board to get, and it takes a lot of coordination and effort to get the to get a number of people on board with the with the idea and then there's also a non-profit that manages these community courts called the center for court innovation, which they're a really wonderful organization, but you know they have to be part of the conversation too. So it's it is a big process to get a lot of these people speaking to each other, but at the end, if it can work out- and it really has in other parts of the world- there have been these community courts created in places as far away as australia, europe and such that it just it takes a good, a lot of coordination and that's probably part of the story too. Thank you also have to find a building. You also have to find a building for it too. So I think that speaks to you know if this is something that we want to advocate, for it has to be a high priority on our list. You know things that are in the 20s, 30s and 40s are not gonna, really get looked at or funded, but I think that it's something that we really haven't heard so much about. As brandon said it's not as widespread throughout the throughout the court system. This alternative community courts- and you know we really, I you know we have a site. You know we have 120 skimmer horn that is supposed to be redeveloped into both a traditional court and a detention center. You know they that may be a feasible, although it is not as community oriented as I think brandon would prefer it's a real site that could be used to incorporate a community court. So I'm going to now share my screen so that we can get into our district needs, which carol ann has put into excel form that I just formatted a little bit and added a couple of line items for us to talk about and think about. So the way this is organized is is from our original budget priorities, but it's capital requests for public safety and emergency services. Oh sorry, can everybody see my screen? Yes, okay, can? Is it big enough for you to read, let's make it bigger, make it bigger, I would say: no, I think it needs to be bigger, yeah. I think bigger how's that that's better okay, great I'm having to reduce it. But that's, okay. You would john [Laughter] be not zero, so capital requests, public safety and emergency services, expense, requests, public safety and emergency services possible editions that I sent around in an email that we can talk about and obviously open to. You know the whole discussion and then transportation. I put second because of our speakers to you know, give them the sort of opportunity if they didn't want to stick for the transportation part, we could follow up with that transportation and expense request, capital and expense requests and then in the major needs one of the top three issues, of course, being the triple cantilever of the bqe. Yes, it is, I think, caroline literally like re-typed. The whole thing by hand so completed and then noting in terms of public safety and emergency services. You know this was from last year where shooting incidents had increased citywide again, shooting incidents have increased year over year, so we'll get into that as well. In the review of the comstat report during a charge report- and this is again the triple cantilever- and I think this is more of a statement of transportation and traffic infrastructure that maybe we can look into rewarding a little bit to speak more towards needs in that regard. Can we, before we get more deeply into the report? Are we still functioning under the unwritten rule that it's only the top 10 requests that are going to get even looked at by the respective city agencies? Caroline, can you speak to that? I don't know that city planning or any of the agencies would admit to that statement, but I do believe that you know priority number one is more likely to get funded than priority number 25. and see- and we had this happen before the bqe remains our number one priority. It's everyone's number one priority. So should that remain our number one priority when it's already been adopted by every other city agency and everybody is working on it, this should be moved to follow up and something else should become our number priority really good point all right. Let's keep thinking about that as we go through our priorities and see if something else bumps up. So would you guys like to go through our existing priorities and then into recommendations, or would you like to talk about the possible additional things that we can add to the our list? Additional okay, great, so perfect. You know, we've got brandon holmes and brandon smith. Here number one thing is rethinking criminal justice, so I have one line item here: support the creation of a community court to handle cases in a community district too. Is that something you know? Do we want to add more color to that? Do we want to say potentially in 120 skimmer horn? Well, I think if we can get specific, it would make that statement. I think give that same a little more weight I mean. Have we ever, of course, I'm back in the committee. I'm not sure has this ever been on the list, no, the community court system. Oh I'm, sorry, since I've been on the committee but john or caroline, you can speak more to that. Okay. Sarah. What question were you asking? I was looking at the community court system since brandon was so articulate in his presentation. I and the importance of it seems to be so clear-cut I was wondering, was this ever put on our needs list before no, we have ever the best of my knowledge, discussed a separate course system. Of course, I think I would say if we could put more detail. I don't know the exact wording, but it would be. I think it would give it much more impact, because I think it's quite important, especially now. Okay, I think we can craft something that is a little bit more explanatory of the reason why we are supporting it yes and juliette. If I could just build one, if we are developing talking about fiscal priorities, we have to assess that this is something that is even viable before it's designated as a priority. So is there a thought process in the city of new york about expanding of the program that brandon just described? That's something that we need to begin to feed out before we make it a priority. Right I mean that's a good point. I want to be able to attach a finance to what it is that we are prioritizing and the other stuff can be handled in a separate way. I suspect, even if we support this, it's going to be years in the making similar to you know we had a we had creation of an elementary school in downtown Brooklyn into the 2004 rezoning. We had that as a top priority for many years before DOE decided to fund a new school in downtown Brooklyn, and that is not going to open until 20 years after the 2004 rezoning. I think that how I mean brandon, you can speak more about the process. If you know of how the red hook community court center got approved, but the way you explained it seemed like there's so many levels of sort of bureaucracy really to get that we'd have to get through and really this is just the tip of the iceberg. So you know, I think, it's great to add as I as a priority so that people start thinking about it, but not expect it to be funded in any. You know in this year or next year, yeah. I think we should link it link it to the to the jail because it used to be a capital thing instead of an expense thing. Well, I guess you need a building as brandon said, but you know with the jail plan, which you know was poorly executed, but based on, I thought you know, I think a lot of us think really fundamental and important principles. One of those principles was providing social services within that environment, and this is this is like a this is a key would be a key social service. You know like being treating people like human beings rather than pushing them through the factory. At on skimmer, you know so, if we so brandon, given your level of expertise in this area, I certainly am very interested in understanding more about what goes on there in red hook and how look to incorporate something like that. What kind of document do you have again in writing? I'm always going to ask for this, because I think we have to have a written document that puts people as close to being on the same page as how we are looking and understanding what we want to happen. Do you have what you described earlier in a document, or is that in that email that I'm going to get from use that just obtain abandons, I don't know yeah, I'm not I'm unclear which brandon you're speaking for, but you have a bit of a community board. Brandon yeah. I pasted a link in the in the chat, which is a pdf which is a complete research document that that explains soup to nuts everything about how it works, the study, its effectiveness and the proof that it works. Do you also have in there to contact folk that were involved in getting it set up? I think that the contact folk who the key contact folk are the people who this reports website is on the center for court innovation, okay, they're, probably the key contact folk because they're the non-profit that operates these in the in the city. That's great! That's a great idea that not for profit- and maybe even we can get them to come to right. Okay, julia julian julia, it's caroline! I just want to note that a request can be both capital and expense if it breaks out that way, so the programmatic part can be an expense request. While the building itself is capital. Okay, you can help us with figuring that out sounds good and juliette. It's john! Yes, john. I don't think- and I don't think we're going to do anything about writing a priority or writing a request, but I wouldn't I would recommend not linking it to 120 skimmer horn in any way, because I think the whole idea of the community court is to be is to be distinct from the whole criminal court system and no matter how much how they change 120, even if they build a building twice as big. You know, parkinson's law is going to apply and the space is going to expand to fill whatever. There is so and because the brandon smith noted that the community court and rental covers three precincts. So if we're gonna have, if they're gonna do three precincts in a downtown Brooklyn community court, it's gonna, I think it's gonna have to be more east. You know towards the towards the 88th and not within the 84th, because the whole idea is to make the community court not a criminal court is to make it a place where you know the criminal aspect of it is not the most important thing. So I think we should be looking for a location away from the central courts. That is the idea, john, but they really pitched us that this new detention center was supposed to be. You know a completely re-envisioned perspective on the detention center, a more humane and all that stuff yeah, but that's for people who have been that's for people who are above the cut-off line that brandon smith has been talking about, and he noted that it doesn't deal with just criminal cases. It deals with family court and housing cases. It's really it's. The everything that would go that goes to red hook would not go into any house of detention. They're talking about services for people who are charged with violent crimes, whether they be misdemeanors or not, and anybody charged with felonies. So I think the idea is that the community court would deal with the issues that would never put people in the house of detention. I mean I'll check to brandon smith to comment on that, but I don't think I think that the services that corrections is going to provide are not the kind of services that the rental community court would provide and any other and a downtown community court would provide brandon holmes. Can I ask you what you think about that yeah yeah? I appreciate john's attention to that detail that these community courts. The idea is that they're supposed to be distinctly separate from the government from you know, from the punitive system- and I think like that is something that has made that red hook court wildly successful. But one thing I you know I do, and it also uplift is what juliet said about like these future facilities being like something that can be shaped and imagined, and if that is the only court that is operable. That's the only court that we're going to use and we're going to say: okay, we're moving away from the punitive system altogether and we can, like you, know, reconfigure the system in that sense, then, yes, you could kill two birds with one stone, but I think with the recognition that, like these criminal courts are not going anywhere, that they're still going to be folks who are accused of violent felonies and therefore are not bail eligible and are not eligible for any of the pre-arraignment diversion programs. I think that's the challenge here and like making sure whatever leadership has oversight of this facility. If you make it the jail, it's going to be whatever pre-trial services agency there is it's not going to be like the department of social services. I think, is the concern that I share with john, but I would also share there have been some pre-existing commitments already made around the city funding, doing committing annual funding to the expansion of pre-arraignment diversion and community-based restorative justice programs. I'm going to post that in here in case someone from cb2 from staff, is able to kind of check out that language and those notes, those commitments in total, like across the city. They were talking about expanded, pre-arraignment diversion with 3.5 million dollars in funding or sorry across the borough of Brooklyn. They were talking about 3.5 million in funding. I think, if you were to demand that 3.5 million it kind of just reinforces that, like 3.5 million dollars, it's not a lot of money to keep thousands of people out of jail when today, it's costing us about 330 000 a year to keep one person in new york city jails. So I think these are like small dollar amounts that you can definitely point to. I think john was saying he wanted a dollar amount. You can definitely pinpoint it from some of this language, and these are things that I've already been committed to. So you can know these are the things like the mayor's office and the da's are more in line with like supporting or approving moving forward. So brandon. I just took some notes from what you said and I just wrote down, given that it cost over 300 000 to keep one person in jail, increase the approved or the the approved city. They approved 3.5 million dollars in city funding for pre-arraignment diversion yep. That's that language sounds good. What are some of the programs that it would be funding like? Are we supporting not-for-profits? Are we like? Is it going directly into you know a city court system? So these specific commitments I shared here, the one for expanding pre-arraignment diversion, is in collaboration with the district attorneys and the office of court administration, so that would be expanding services and funding that, like d.a gonzalez, has already been invested in most of the investments he's made youth diversion, but that's slowly expanding. There are two buckets, though, that are specific to one community-based restorative justice, which would be similar to you know what GMAC does as like a community-based service provider doing that violence, interruption and conflict resolution model, and then the other one is a justice innovation fund which I'm not super familiar about. But this is like a public-private partnership that would essentially allow folks to create new types of programming or invest in new types of programming, so this is kind of like when we talk about red hook, community justice center or initiative they them operating that community court. This would be like the justice fund that would be established in Brooklyn would be the mechanism that an organization like GMAC or like cci or another group would be able to submit an RFP to say we know what type of community-based restorative justice programs would be most successful in this community. Therefore, like we've applied to this fund in the city of new york, you give it give the resources to us and we'll operate this program. So that's what cci does and other groups do now around restorative justice programs. This would just be creating a fund specific to Brooklyn that came in you know, with the whole conversation and negotiations around the borough-based facilities. These were just commitments to funding these three areas outside of those jails and brandon. What you just described- and you did attach that 300 dollars per inmate right at vargas island. Do you have a way of quantifying the benefits of the red hook outside of the human aspect of it, the financial savings that the government derives from this organization? How long has it been in effect, is this for me or the other brandon it's for brandon ebony, I'm sorry brandon, which everyone wants to speak to about [Laughter]. I don't have an exact cost savings number from the community court, but what I can say is, as the as the jail population has decreased steadily. We have not seen a reduction in the workforce of the department of corrections or in the operating budget of the department of corrections, so we're still spending the same amount per year as if we incarcerated eleven thousand new yorkers. Even above four thousand this year was the first year we saw a significant decrease in the doc budget and that was like 200 or 300 million dollars. So right now, there's what I can give you as like a strong number to support your language. Is there are 5 000 excess corrections, officers to every person to individuals in custody, so our we are actually paying more to staff our jails than we actually have people who are actually detained and incarcerated in our jail. So when we're talking about where this money can come from, there's very clear sources of where this money can come from, such as you know, the NYPD dominance that were made, the doc demand and the district attorneys are also given money for these specific things. So it would just be a matter of making sure they allocate the money effectively. So as we go forward with putting a program together and juliet, we should talk about the follow-up to this. I think it would be helpful if we have examples of the savings that would be derived in addition to the otherwise human elements of this particular program. It should be a full program and there are certain folk that are only going to answer to the monetary aspect of it, so we should have everything as well as we can in one program so that it can sell to everybody. At the same time, just my comment sounds good sounds good, mr holmes. If I could, you spoke very quickly, I wanted to get a couple. Things from you were mentioning the reduction in the incarcerated population was it from twenty thousand to under four thousand eleven thousand, so eleven thousand was where we were at around 20 the end of 2016 going to 2017, and today we are below 4 000. and we're suggesting that maybe we reallocate funding from the department of corrections or what department oversees the detention system. Okay and in terms of the funding for pre-arraignment diversion it was in collaboration with the district attorney and one other partner. I missed it- the courts, the office of court administration, it's good to be specific. Thank you so establishment of a justice fund. So I think we have another one and the establishment would be redirected from the department of corrections. Okay, recent do we want to make any other recommend specific recommendations on due process, bail reform, I feel like you know. Those items may be more higher level than the community board level discussion and may not exactly be funding related, but I think the community court system will improve due process as well. Brandon, if you could, you know, speak to the speed of the the process. Oh my god yeah. I can totally do that. Let me say this: in the year 2010 I, as a prosecutor, declared ready for trial, meaning the people were ready to start trial on 45 consecutive cases without being once sent out to trial. That's in the regular court system because in you know, in having a in having a criminal court system where you have to go to a different court part to conduct the trial, it's a matter of finding the courtroom having everybody available and a lot of judges don't want to do trials because it takes a long time to do trials so they may not. They may not want to accept it as a res. There are different time. It is probably a lot faster now because we have a much more progressive da now than we did back then, but and we have a much more progressive court system than we had back then, but but in the in the red book system. In my first year there you know I did 11 trials, it was incredible. The case loads are smaller and it allows the whole system to work a lot faster and the judge will just stop court in the middle of the day and say: let's do a trial and you do a trial and then, at the end of that, you go back to doing some more cases and it's a much easier, faster system, and you don't have these cases- and I know that you have these cases in the regular court system, both felony and misdemeanor, actually which just take years and years to prosecute and resolve, and it really works to everyone's detriment. Because, two years after the after the incident, everyone has a worse memory, oftentimes, the police officer, retired and the there really isn't a sense of justice. That's involved, it doesn't work. The system just doesn't work as fairly, I think brandon. Is it not the case that less than 2 percent of all cases actually make it trial? Well, I don't know the statistics off the top of my head and I'm not going to pretend to, but it's very accurate that the overwhelming majority of cases don't go to trial. The overwhelming majority of cases go to get resolved in a plea deal yeah, yes, but I think you know the goal is to try to make a system where everybody has the right to have their case go to trial. If they want, you know they can accept the plea or they can go to trial, and the system in the community courts allows it to work a lot faster. So at least it is in the court system. That's the cause of the of the issue. Well, many cases are settled because the defendant settles for time served, and so it gets that person out of the jail and out of the system. So it's certainly a single digit low single digit number of cases that actually go to trial. One of the nice things I'm not positive, that brandon mentioned it, but once pled in the community court system goes through the goes through their program and completes it that plea that, whatever, if it was a misdemeanor plea or whatever it was, that gets removed from their record, so it doesn't follow them if they're applying for a job or applying from housing or whatever. So it's you know, that's one of the other benefits of that. So I wanted to keep going. Are there any other brandon homes alternative to incarceration programs that you think we should be mentioning here? Should we maybe support like youth-based programs, and I guess that would be broader than the public safety context yeah? I think one area that folks are seeing is very effective. Is transitional housing so there's a lot of conversation around affordable housing, but transitional housing for and removing barriers to housing and getting into whether it be affordable, housing or public housing for people who are justice involved. A lot of folks who are homeless also have come into contact with law enforcement or the justice system and kind of addressing that it would be transitional or supportive housing models, such as what we've seen operated by fortune society or osborne association folks in Brooklyn may be familiar with. The DOE fund is another group that folks in downtown Brooklyn may be familiar with, but supporting that type of housing. For folks who are justice involved to transition back into affordable or public housing, and there's been a program that the city just started this year for folks who are being released from Rikers. They do. You know peace management, work and money work with the service providers from one of the groups. I can cite that's running. These programs is exodus transitional community and they essentially like support folks in a game plan when they're released like how are you know? How are you getting connected to housing to employing an opportunity to use education so having those types of models be funded at scale is great because it also reduces recidivism and the likelihood that someone is going to end up homeless or back in the justice system. Thank you sounds great. Juliet, yes, sandy! Oh wait. I just want to go back because I wanted to say something, and I couldn't get in to john quinn's point, and I think something that brendan said. You know, judge lippman, who recommended closing Rikers and did the report. He did he envisioned services in the community, not in one big facility. He didn't envision one big facility, and so I think the you know the idea of bringing the services to the communities like the red hook. Court that seems to be working very well is really what was envisioned and the mayor the politics of this whole thing. You know just put everything in one giant jail and that doesn't bring it to the community or in integrated in the community. So I just wanted to say that I know we passed that, but oh no, that was that was good to pick that up again does anybody else have an objection, because you know we have both perspectives in the discussion have an objection to removing the link to 120, scrimmage and really focusing on community courts as an expense item and a little bit more conceptually rather than concretely in that building. I think that makes sense. They should be separated. Okay, what's one twenty squirm is that is that the jail or the court? That's the criminal court building! Okay, so is it? Is it okay to connect it to the jail project? Well, it is, you know, no, the block above it right. The new jail project has a traditional court component to it right. Okay, I just thought I thought it would. It would add sort of relevance if we if we referenced the jail project in our in our in our proposal, but I would go along with the expertise that of others who are better informed than me, I patrick, but I'll, we'll also. Yes, I will also go along with the consensus that was, I just wanted to say. I really supported what mr quint said about that. I thought that was really eloquent and I I'm very much of the same belief that it should be in the community, yeah and brandon had mentioned. You know the the you know if it could focus on just the 84th and 88th. That would probably be better rather than focusing on a larger section of Brooklyn. So maybe I can put that in I said cd2, but maybe I can be more specific of the 84th and 88. yeah. I definitely agree with john said I wasn't in any case. Yes, it doesn't matter, yeah really helpful, but from the also from a feasibility standpoint you know sometimes it's nice to have a concrete place for it too, and then it's a little bit less pie in the sky. Although you know it's, the city has a lot of resources in downtown Brooklyn and they can find another place accountability. Now this is another area. Mr holmes has expertise in. Is there we've been hearing about the ccrb and how they don't have a lot of actual power? You know it's. How can we, and luckily the state, passed recent legislation that does help to expose officer records and increase accountability? But what else can we do from a you know, budget priority perspective you hear me now yeah, including the city council. They gave the ccrb much more power, they keep the power of the ccrb already so they they're they significantly. Then. Can you circulate that information to juliet I'm sure I can find it thanks. It may take me a minute too I'll go back to you. I do think one core area is his right because of the repeal of 50a and then there's a lingering court battle to actually release the disciplinary records of officers that the new york civil liberties union actually just yesterday was able to release over 300 000 records of police misconduct. So now that is public information. I think an acknowledgement from community boards all across the city an acknowledgement that community boards support this type of accountability and transparency and support access to public access to information would be really great. You know, especially the current payment with the energy around police, accountability and reform, and I think you know if the group were to take it a step further. I think supporting the what has been the popular demand for divesting one billion dollars from the six billion dollar budget of the NYPD, divesting from that and one of the major things that I think aligns with what I saw your previous statement of needs. One thing could be removing police officers from public schools and investing that money and those resources instead in fully staffing guidance, counselors- and you know- mental health, supportive services for students in schools. What we saw this year was a popular demand and a lot of movement towards taking 100 out of the NYPD budget and moving it to other community resources. What the end result was about 400 million dollars that got taken out of the NYPD budget and put into the department of education and that 400 million dollars is still being used to hire police officers to be in public schools. So it was kind of this weird funky math. That city council did to work their way around that, but I think popular demand from many folks, especially parents, has been to remove police officers from schools and put the accountability on DOE to hire and staff guidance counselors in school. This is something that I've already posted on the chat. A link to one of the articles of gtrb's power has been increased. Thank you I couldn't hear sid is he did he? I said sharing the link to that article that he spoke about with the the ccrb their authority increased. Is there a way to be able to save those links at the end of our meeting carol, anne archaea, maybe carolyn you could copy them, and so we can all have them after the meeting ends. Yes, great I've been doing that actually has also been dumping them into a file. We have them, so is there consensus about adding this one as a priority, removing or support the removal of police officers who are now working for the department of education from public schools and increasing DOE funding for guidance, counselors and staff? I would agree with that: cheryl you're muted. Do you want to use it? Can you hear me now? Yes, you hear me now. Yes, we hear you so you're saying that you need school safety officers in school. All you need is guidance come through. I don't agree with that. I still think you need school safety officers. When I went to high school. My high school had, unfortunately, the highest arrest rate in all of chicago. In the beginning, there were no metal detectors and we started adding metal detectors, but we did not have a police officer in the school. We had a. I don't even know exactly what his what his exact title was, but we had somebody who knew every single face in that 2000 person public school that it later became 4 000 persons- and you know if there was somebody that walked into that school- that did not go to that school. This person would know, and he would call you out on it. So I think there are. There are ways to deal with public safety on a personal staff level on you know that is not necessarily police officers. That's my personal experience. You know other people can share. You know how they feel, I would say a just a blanket statement about that may be too general to say, because there are, I I'm more interested in trying to. If you take something from the budget of the police budget, we should be looking at some social services, and things like that. I mean that should be our focus. To try to take the money from policing from the police can't do social servicing they their job is different. We should be encouraging something to defective social services and helping psychologically. That is more interesting to me. Police officers are there to intimidate and or arrest? That's not what school system should be about? It might be a culture. I have police protection all the time. I grew up and I never saw a police officer anywhere near my school. I don't know why how that got incorporated. It seems so inappropriate. It sends the wrong message to the students that the atmosphere in which they are being educated is dangerous enough that an officer or more have to be defined. I actually visited a number of schools on a regular basis for family members, and the police officer is at the entrance to the building more of a social, an atmosphere clearly but in uniform and it doesn't seem necessary. It could be accomplished with someone else that has a similar responsibility, as the police officer has the police officers. Why is that police officer there? Do they expect there to be a crime committed every day? Do they think the police officer is an intimidating factor to the students? You know we have to take a look at this on a much harder police officer that permeated the entire system, no one's going back to evaluate its need or whether it should be adjusted to a lesser person. I think we have to look at all of that, but assuming that a police officer to be in every school I think, is too much now. Is it right now? Are they in every school or how is the personnel allocated that 400 million dollars they're spread out across most public schools? When you look at non-public, schools know they're, typically not police officers in there, but there is an MOU with the department of education and the NYPD that says that they have to keep those jobs in schools right now, yeah now they're school safety officers in every school. There are some police officers in schools that are high risk, make decisions right now their school safety officer in every public school in new york city, and, as I pointed out when I went to high school in 1960, we had a police officer in uniform with a gun with a gun. Oh, my god, in new york, some of this goes back to the problems that they had in colorado and connecticut, where yeah I'm a real problem with people coming into school, with guns right so that the school, but then the school safety and the and they locked the doors so that you know you know yep. If you have this, if you have a kid in preschool now right you go into a school in front those schools, those schools, a new school for a preschool student- is fortified in a way that it's very difficult for people to enter, and they only enter from one door right. That is a problem in you and there's been a problem in new york because of how the schools are designed. That's another issue, but I agree that for the most part that could be done with a non-police officer. Unless someone you know the school safety officers are not police officers they're under control of the police department, but they're, not police officers right and they're, not there. The school safety officers are unarmed, but so sid are you in support or not of removing the school safety officers. I think there needs to be some sort of school security, but I don't think it should be on the forum under the police department. I think it's not anymore, it's under the DOE. Now they got reallocated right and that they should also train those people not to just be monitoring the door, but also being there to assist in the social work and stuff like that, so they're really integrated into the school process. So it's like remove slash, retrain school safety officers in public schools. We would have to put in conjunction with the school principles, because we can't make decisions for every school and make a uniform decision, and there are some schools that may have a different relationship with their community, where they think they need to have a police officer yeah. So I think we gotta, but I also think that frankly, I knew the police officer at the high school I was tr. I was not treated like people of color. Frankly, all right and that's the problem, I mean that's, why that's a black lives matter is that police officer did not treat me. You know. The one thing I do have to say is many of the school safety officers in that 400 million dollars of funding are people of color? Are women and you know cutting them completely, also cuts these people out of jobs potentially yeah. I would like to say that when we think about new york city for the next 30 years, we're looking at like pockets of organized abandonment and like austere violence across budgets, and so when we think about spending money on police or school security guards instead of services that is doing harm, especially to people who are black and brown, and I I'm very much in favor of removing all police from schools and removing the security officers in exchange for more counselors, who are also typically women of color emily did you want to make some annotation on the screen, mrs blunt, or was that a mistake all right? I'm gonna take the sharing back all right, so I'm gonna write this hello. I'm sorry julia! I just want to say thank you for saying that most of the school safety officers are women of colors. A lot of them are single parents and to get rid of those would really demon them really hurt a lot of women, I know quite a few and they make a good salary and they it's their way to become middle class, and it would be very hurtful yeah. Thank you. I want to just comment on that too. It is a great point to bring up and one of the things that made it so difficult to invest from NYPD in the first place kind of using those women, those women of color. As like a shield to not take money from NYPD. I think what's important to think about so someone jenna gogan, put it in chat right before I was able to say it that we should be talking about how we transition to an economy and a system that invests in guidance, counselors and social services and the well-being of people, and not just saying you're, losing these jobs and that's it for you but saying you're, losing these jobs and maybe there's a way for you to be able to get intentional training right. This isn't something that'll happen in the blink of an eye. This is going to take a while to be able to talk to the unions about how it's going to happen people's you know, pensions and all that, but to say we're going to reallocate this money to training you to prepare you to take on these social service jobs that we need and we're going to need to expand in the future. I think there's a way to acknowledge that language, while at the same time saying these jobs, you know the same. Is I've got cousins? Who are corrections? Officers? I still want to see a world without prisons, despite the fact that my family directly profits and makes their income off. Of that. I want to see a world where they don't have to work in prisons in order to make a living, and you know to survive. So I think there's a way we can acknowledge that without saying it's either or it's black or white. I think we can't be specific with this. We have to identify the issue and then come up with all of the issues that will result from identification of that issue that we're not going to solve here tonight. I do agree with brandon holmes just said, but basically I think you know we shouldn't be looking at taking people's jobs away, but we should be looking at the bigger picture and trying to allocate their job in another way and train them properly, so that they could feel a sense of pride that they are they're doing something that would be a meaningful, but they wouldn't be out of a job. So I think we're really getting into a very social aspect of it. I think simpler would be better, but that is a very good point. I think we should be just categorically saying you know just get rid of these people. We have to have a way of transitioning. Well, I I'm sorry, I don't agree with leaving schools unprotected. I don't have. I don't know for school age, kids, but I don't know if some of you do not believe in this day and age of leaving schools unprotected I've seen what happens in school. What happened in schools, what happens in schools and we've all had the pain of kids and kids being killed right people going into schools and shooting kids? I don't think we should leave schools unprotected. That's my belief. I have grown children, but I still believe you have to protect children in school. There are crazy people out there. You know I you know I have six grandchildren and I and they live in the suburbs and every one of the schools that they go to has a security guard at the desk. When you come in, there's no school that I've been to recently here. Other states that does not have someone a security guard sitting at the door when people come in, that's the reality of the situation. It's the reality of the situation where they have them in new york, all right, and while we all agree that the schools need to be a better place with guidance, counselors and everything else. The first thing the schools need to make sure is that the kids are safe, yeah, but you know it's. The nomenclature there can be a security officer doesn't have to be a police officer in a uniform, and I agree if the principal feels that he or she needs to have a police officer, then that can be also accommodated, but this is uniform across the system. Irrespective of and that's what we're talking about. No, I agree, I don't think it needs and that's why they that's why, although it is somewhat rearranging the deck chairs like that, removing the security guard from the police department, I think, is a good step, a good first thing, but it's not, but they also need. They also need the guidance counselor. They also need the nurses in every school. They also need you know the met, the the social workers. You know I'm strongly in favor of vocal, that of reallocating the money. They also think that the first thing you have to make sure the school okay, I think, we've worded it in a way that is sort of capturing some of these views. So, rather than saying, remove school safety officers support reduction of school safety officers in public schools, decisions to be made in conjunction with principals, maybe we can say decisions to made on a school-by-school basis and retraining them towards guidance, counseling and social work. That sounds fine. It has flexibility, okay, next training in terms of officers. I I'm not totally up to speed on the mental health training. The officers currently have dealing with people who are homeless or have drug abuse or other issues. Do we need to increase training in this in these fields? Absolutely all right, so we'll just say: leave it at that. Mr holmes, do you have anything to add to this? I would say expanding opportunities for mental health first responders outside of the police right now, there's not many options available when you call 9-1-1, they dispatch a police officer, not a mental health, professional or expert, so some language about restricting police officers from being the first responders of a mental health emergency. You know, like folks, have said earlier about the school's issues. You can always call them in a crisis, but if you're not calling for the police, if you're calling for a mental health emergency, then a mental health professional should be the first person on the scene great and on the other side is we have had an increase in gun violence over the past two years, particularly in downtown Brooklyn. You know, and we have- we have talked about defunding the police. At the same time, there are council people that say we want the police in our community and we don't want to defund the police. We have the nco officers and you know they help keep our community safe, and these are a lot of the officers who are of color and in our district. So you know this is it's a balance of what we're talking about in terms of reallocating resources to the alternative programs, but also you know, keeping our neighborhood safe with the gun violence. So I open the floor at that. I would just want to say that the word defund becomes a very political statement and I don't think I think many people wouldn't agree with that statement, but they would like to see something done with the funding. That's going to the police, as I think brandon holmes mentioned, about social work and social services using the word. Defund will put we'll put it in a political aspect and you will not gain anything by it. It's my that's just my opinion. I think we all are in favor. Of that I mean I certainly am to try to reallocate funds, but using the word defund, I don't think is, I think, actually representative clyburn, who I admire greatly came out and said: that's not the right word to use, so I would go along with a guy. I really respect, but you just said. The right word, which is reallocation, is a great word yeah. We haven't really spoken about it, but what about reallocating away from like military-style equipment and helicopters and stuff? I would think that's aside from like taking away people's jobs. You know this could be something that you that we might want to look at, but I know that it's kind of tricky the where that funding comes from, because I think some of the funding may come from the federal government and but you know you know at some points during this process, there's been like five helicopter police helicopters flying over my house, and I don't know why there have to be five brandon. What are you doing that you're directing so much attention to you? I live next to the Brooklyn bridge people pass by who are protesting and, as a result, they have to have five helicopters to observe them. That may have been the news too, though I mean I back to ciro's point. I actually have no problem with the word defund and abolish the police. I just want to you know, take us back to 1860 for the minute, because a abolition of slavery wasn't popular. You know anti-slavery was you know the idea that you know slavery is inhumane, yeah, of course, let's we gotta end it at some point: abolition the idea that we need to end it like today, that's where we need to be and that's what made the difference so like 20 years from now, when we look back- and we say- oh, you know- we've reallocated a few million dollars from the NYPD. Maybe it made a billion, maybe that's going to be unpopular, the same way. We look back and we think wow slavery. That was really messed up. That's not, okay! We need to stop enslaving. People like I just think that we can think broadly and think actually defunding, actually abolishing police, especially police brutality and this vicious cycle, and just like the militarization of all of it and how that perpetuates the gun. Violence on our streets. I think yeah get rid of the helicopters, but you know also get rid of the police. Well, this is sid, you know, look, I think we all agree and if we're going to come to a consensus that the money should be reallocated with a significant fortune removed from the police department, I think, if you take a vote here, I know I would not support the funding the police department and I doubt very much for the majority of the committee, but that's an issue. I think it's interesting semantics. We basically agree that the amount money should be removed from the should be reallocated away from the police department. The police department should not be primarily mental health. I agree with you sid, I think, for the consensus of our funding priorities. I think we, I think reallocate would be the word to use and caroline I hear you and a lot of people are saying what you're saying you know in the in the world in new york city today I would suggest perhaps we put that into maybe its own category. You know, maybe it's reallocate yeah I'm. I understand that perhaps doesn't have a whole lot to do with you know district priorities for today, but it didn't sound like anyone was saying it. I wanted to come out and say it yeah. Yes, it was good that it was said. Thank you, so I'm going to kind of lump in what some of the funding can be for and really you know this is a line item, but then we're going to support. You know when yucca comes up with particular opportunities when our economic development committee comes up with particular opportunities. The health committee, you know, comes up with mental health opportunities like this, so I'm gonna sort of say these funds should be reallocated in generally. In support of you know these other initiatives. Do you hear me? Yes, I just want to say well the word defund people are confused about it in general. You know, since that word came up and I think it's a negative. You know defund the police, people, a lot of people think get rid of the police, and so I guess we allocate would be a more positive word to use more understandable than defund police yeah julia. Could you put it up on the screen? I don't know if we sure let me share my screen again. Thank you. I'll read it in the meantime, so I have so share. Content share. Okay, so I have this language reallocate funding from NYPD support, youth programs, increasing economic opportunities, education, internships, job training, health and mental health, social services, initiatives and I'll put it together into better english general of those alternative programs. Right and then you know what we discussed about the training of officers. You know expanding the opportunities, also for first responders for mental health emergencies, prevention of violent crimes. You know, I don't know how it necessarily gets a great dress, but also the you know. We add the root causes sandy you sent something over the Brooklyn d.a is working on. You know, I don't know, I didn't read it yet, but there are more details that I think other people can come up with. After packing up the use, it was my next item say reality funding from NYPD. It sounds like you're, taking all the funding from NYPD right now to say, partial the allocation of funding, because if you take away all the funding from NYPD, you have no plan. Okay with that we could say at least a billion. I mean that billion numbers seems it's definitely it's. You know less than a sixth of their budget, so a billion in addition to some of the stuff that has already been happening. That seems conservative and safe. Do you the? Is there a second for that? Or do people want that partial? I don't. I don't have a problem with a billion. I got too many cops. Okay, anybody have a problem with it. No can you read it again, real fast, all right so in the description reallocate one billion dollars of funding from the NYPD and the department of corrections and then in the explanation, support youth programs, increase economic opportunities, support, educational education, internships, job training, health and mental health initiative initiatives and social service initiatives. Yeah sorry can we also add the like changing traffic enforcement. So those people don't have guns like I think the next item- oh right, reduce militarization of police. I mean you want to have that as a different one. I don't know that it needs to be a different one, but like if they're going to be these other programs and different kinds of police officers, there could be you know, traffic officers who didn't have reduced militarization works. Yeah, that's great. The two places that police get killed, the most are when they go to a domestic dispute or making an ordinary traffic stop. Those are the two greatest causes of police deaths all right. So you know that if you're talking about parking tickets is one thing: if you're talking about moving violation enforcement and stopping cars, like that, I'm talking about writing tickets and you know controlling the bike lane. What does reduced militarization actually mean when you write that down what is reduced militarization? The actual word: it's a very broad word. I think if we want to do what you're saying, I think we should be more specific to the point that you're making saying reduce militarization of police. I don't know where that's going to go as far as someone was. Oh, what do you mean by that? What are you saying? So if you talk about the traffic, I think that's a very good point, but we should be a little more clearer as to what you are specifically requesting saying we reduce militarization. We don't want them wearing all these good khakis and all these armed ak-84, all that stuff they wear we'd like to get rid of that. We all want to do that there. They also exist around potential terrorist hot spots, and you know some of us were around. You were probably there during September 11. You know, I think you should just take out that statement right out, reduce militarization. Just take it out. Should we just say perfect officers, traffic agents should not carry guns. You could say that if you want to say that officers don't carry guns, oh well, some of them can't assume exactly. Some traffic is important. Some of the people. There are a small group of traffic police that do in fact carry guns. Those are the ones in the highways, no, not the ones. On the side, because it's contentious, I'm gonna, take it out all right, I'm gonna go to a non-contentious one placard parking abuse yeah. You know this is sid, brought to my attention that D.O.T used to be the agency responsible for enforcing placard parking abuse and for writing tickets and sentences to you know. Obviously, the police are not going to police themselves diplomacy who established the separate unit within the NYPD. They I think they issued a hundred tickets all year. Well, they actually issue more in Manhattan. They have what's called self enforcement right, but it used to be the trap and what happened with the traffic enforcement people used to get in the fight for the police department. As you know, the police department's armed I mean so [Laughter] sid. I think you also told me about like a new technology that they're working on where once they scan the placard or the license plate, it is automatic. The ticket gets generated automatically and that's what they're working on right now that is on that is on the agenda for the and under D.O.T. It's probably not going to be for another year or two. Okay, so let's support it then, since it's you know, it's not yet funded so I'll, read the whole thing: reform traffic enforcement and parking violations to reduce placard parking abuse such as by expanding the use of technology to scan packards and license plates and automatically issue tickets. I can also say also, I also consider empowering a different agency such as D.O.T, which was previously responsible for this function for traffic enforcements to reduce conflicts of interest, and then we have transition on supportive housing. But are you guys bearing in mind that, though, all the placards out there are not only for policemen? It's you have the courts. You have no yeah, I'm not blaming cops for placard abuse. I think it's rampant or monks. Everyone. There are people who work at trader joe's who do practices, but I, but they aren't policing it yeah and they're. Not there permits out there issued by a whole bunch of different people that aren't julia. If there is this new technology, this scanning, I don't know if we should say it, but basically those who are constantly abusing it right and they their license comes up. Quite a few times there should be much more of a penalty for that. Maybe you know if you get somebody who does it all the time? That means nothing to him or her repeat: offenders should face higher penalties, sounds good, yeah, repeat offenders right and or revocation of privileges. Yeah I mean the license. Is the owner of the car? Not the driver, who's put up the placard, usually it's the same person, but it's not. No. You know that just invites a you know to switch cars. Well I would I would. I would err on the side of the going after the abuser and then work it out later. Yeah can I can I impress for a second yes, what whatever it is, whatever the concept is, it must always be able to be tied in with a budget, so I'm not sure how this size is. This is a dlt item said that DOT was already considering creating a technology to automatically create these tickets, so yeah dlt on here at the agency. I think it's DOT and NYPD, because potentially if this becomes a different agency, it is a reallocation of NYPD funds to D.O.T I we might be stretching a little bit when we get into policy part on a budget priority, consider increasing fines for others. I don't know. Usually it's about us asking for money to come in. Okay, so we'll have to word this so fund we'll have to work it from a final perspective. All right, yeah fund, alternative traffic enforcement of perk of traffic enforcement, up alternative enforcement of placard parking obvious. How about that? Okay? Is there anything that overlaps the public space? And you know public safety or, potentially you know the criminal justice system and coronavirus? I feel like you know it's already happening somewhat, but do we want to say put something on our budget priorities? What I, what I have is you know tying it to the open streets programs, but expanding that open streets programs, which was just you know, expedited sidewalk, cafe, permits but expanding that to schools and other businesses, so that you know kids can learn outside and you know we could. We could employ the public space in a better way. Retailers maybe can set up a little. You know outside stand or something to sell some of their goods outside no seconds on that. Should I take it out all right if there's no seconds, I'm gonna, take it out all right. Oh sorry, whatever, okay, all right, that is it for our additions quickly, let's go through the existing requests, so we'll start with the capital, one that basically NYPD said we can't fund anyway, which is renovating expanding the 88th. So I would recommend that we remove this request there any disagreement to that, but we can't find it so exactly request. Okay, the next one is assign additional traffic enforcement officers. This to me, I was one of the ones that had supported this and it came to light afterwards that the traffic enforcement officers are actually trying to move cars really quickly and not trying to keep pedestrians safe. So that was not something I was really aware of, and so I would support removing that item actually but totally open to you know what you guys would like to say. I mean this connects into the pro the possible additions to discuss because, like I think that traffic and placard people we're thinking about who aren't necessarily police are the ones who would care about pedestrian bike safety. No, so those are different they're, not traffic enforcement officers, so they're crossing guards, and they only put them by schools so- and I think that there's not really a dearth of crossing guards. They're pretty they're fairly well placed I feel like so is it okay? Anybody object to removing this one. Well, actually does anyone. I don't know the answer to this, but with school being kind of murky at least for the fall do: will the crossing guards stay around even without schools? I don't know you know. The idea is that public schools de Blasio is still saying public schools are opening just at reduced capacity and at the hybrid model, where people are supposed to actually show up two days a week. If you know, okay feel comfortable doing that, my roommate is a teacher and doesn't a public school teacher, and I don't he's not convinced he's going right, but at some point I feel like it's, whether it's in the wrong conversation I'm curious about crossing guards either way, but I guess that doesn't have anything to do with this. I'm fine! If you want to remove that. Okay, thank you assign additional uniformed officers in the 88th and the 84th, and then the response is that NYPD has implemented the nco program to address community concerns, which they certainly have, and I feel like they've done a good job with that. The commands under the nco program have had a sizable increase in staffing compared to prior years, and so, given that we're asking to reduce NYPD funding, I think yeah interesting you're right julian yeah. Okay, next one expand funding for fire prevention and life safety. I better see this document. I think we keep this one. This is a john do. This is yours, hire additional fdny inspectors to inspect new high-rise construction? That's good yeah and, as I said, I don't understand why they don't train the firemen and the number of fire calls for the fire department is down tremendously and what they've done with the fire department to increase the usage of them is now when they get a heart attack. Call besides sending the sending an answer to the fire truck, so I don't understand what the number of fires being down so significantly, why they aren't retraining some of the firemen to do the through the inspection. And, frankly, as you know, I mean it's an important test, because there is a fire if the fire department has to come. So I don't understand why they just don't retrain the fire department people to do the inspections, okay, so that is it with regards to public safety and emergency services. So we still have transportation on the list, but I would like to say thank you to brandon brennan smith for all their time and their very thoughtful comments in this conversation. So thank you thanks are they? Are they even on anymore? I think brandon holmes left okay, perfect and brandon smith, perfect, okay, capital requests related to transportation. Are you guys still seeing my screen or no? Yes, okay, great, so install streetscape improvements extend flat bush avenues, streetscape improvements from default to atlantic and it is in, is funded. It's included in the 10-year plan that that's what that means right. Caroline, it means it's funded already right. No, oh, okay, it's not fun. No, we have to leave it on the list. Then. Yes, okay, all right, then we have upgrade or create new plazas, and this one particularly is times plaza. We have to keep that on the list. Install streetscape improvements, the atlantic avenue gateway beneath the bqe at the foot of atlantic avenue. Do we want to say anything about including this in the reconstruction of the bqe and making sure yeah, I think, seems to be coordinated with that? Basically, juliet can you hear me yes cindy, so that was something that our bid was working on years ago and I think it should be in incorporated in the bqe project, because there, the atlantic avenue, is it called interchange. Now I'm having a senior moment but that whole underneath the atlantic berman right, that's going to be redesigned and there's discussion about even closing the the ramps and moving them a little bit. So you know our project was sort of lighting and we did two murals and we wanted to do plantings, but there's going to be a whole a whole okay, a redesign of that area. You can remove it. You think yep, because it's part of that whole the whole setup gradually so carol ann. Do you think we can remove whatever the it decides? Yes, I don't think so. I think I think it's a more tangible local thing about the project, and actually there are lots of park spaces that can benefit from bqa. You know all the way up to sand street incorporate. Maybe we change it. A little bit incorporate public art and park and green space in the redesign of the bqe entrances and exits. Something like that, but I would say that atlantic avenue gateway is a prime example of that. Okay, so, instead of develop fully the atlantic avenue gateway to beat the bqe I'll, say that and then incorporating public green space green space, okay and then in coordination with the construction of the b3 all right great next one is improved traffic and pedestrian safety, including traffic calming and that's school zone, speed cameras. It says the agency will accommodate this issue within existing resources. Does that mean caroline that it's funded or not yeah? It means they'll make an attempt to pay to fund it with within their currency. Okay. So I think we should just leave that on there. Then anybody object okay, great and then we have the triple cantilever, which was formerly the priority item, and now we have to think about whether we want a new priority item. I'm not sure we should take that off. As a priority item I mean I know I would take it off the list, but it was. It was one of the number one pro like there's a first page. It's the top three pressing issues overall in Brooklyn community board two. It went up to the first page. Well, it actually still is a priority for everyone in the community and to now reduce it does make a statement. I think it should be forward first and forward in front of everyone, because it's still a major issue that has not really been resolved and with the budgetary issues that we have coming up. This may go on. I may have my tombstone somewhere near it somewhere before it's built, so I would be very much in favor of keeping it as a top priority, because it is such a fracturous issue for the whole from sunset park right on through to right along the northern part of Brooklyn. So I would keep it as a priority. That's my choice, it's not on here, but I mean I rode my bicycle on the Manhattan bridge yesterday and I don't know if there's room for you know bicycle improvements on the Brooklyn Manhattan bridge. I do think that like to me just in terms of what's feasible and doable and doesn't cost multiple billion dollars. I think that would be a higher priority, especially with more people biking, and you know we're trying not to have more people driving so this cap. This is capital related to transportation. So is that a physical barrier to create a bike lane sure as a physical barrier to create a bike lane in the road bed of the Manhattan bridge? Thank you and then I'll, say lanes by deleting yeah and then, if you want to copy that and say Brooklyn bridge, that sounds great yeah, I'm going to say both. I'm just gonna put it in one, because you know people are voting. Okay! Yes, I was just gonna suggest if we wanted to make it at a protected bike lane. Thank you, caroline and that's. Okay. I'm gonna send this. I'm gonna clean it up a little bit caroline, but then you can work your magic on it too and make it you know more appropriate. Are there any other capital requests for transportation that people suggest? I don't know if there's a capital request, but the mayor along the bqe, the mayor, had initiated a lower speed for trucks that are on the bqe between sand and what I had wondered is: would they be able to put some sort of a electronic you know test to find out who is speeding? I know they did something with the weight. They have a weight reduction, but I don't think there's a way of enforcing which we have you know of the speeding that goes on along that highway, which really it sort of sort of continues to deteriorate, the bed rock of the highway. So I was wondering if there was a speed, one of those cameras or something that would detect people speeding, I'm not sure we could put that in, but that was some of the things that my neighbors have told me about. So we do so rob I've been advocating for cameras for a long time too, and rob paris informed me that there are only a couple cameras in new york city that are speed, cameras that are not school zone, speed cameras and that there's no way we're going to get a camera unless it's in a school zone. Basically exactly I would have to do all due respect to rob. I would just say that's interesting, that's past history and all, I would say, is as a community board, we can take it up anyway, it's not a legislative perspective and it's the state of the state law right speed cameras are very state. They are what I didn't hear you, the authority for locating speed. Cameras is allocated by the state, I see, and it's not permitted off highway at state law right now, right so well, I have a fight on my hands yeah. So I support the idea, but it's not legislatively permissible. I understand blt can do. Is they can put a radar with a what the speed is yeah? They could have a speed board. Okay, maybe I misspoke that would be fine. That would be fine. We could do that where, on the bqe are you finding people are speeding, particularly, I would say, from the from the whatever exit up to cadmium, plaza exit that area the overpass that goes up to the Brooklyn bridge. I don't know the location yeah, that's it patrick you're, correct 28a. Is that an exit or an entrance? I think it's an exit only actually right, yeah north carolina, east eastbound exit online, the columbia street bridge area, that's where and eastbound traffic, yes towards one of the end of one island. Yes, thank you. I'm gonna move to expense requests relating to transportation, so I have conduct traffic or parking studies, see the creation of commuter van terminals in downtown Brooklyn and the response is it's discuss the borough commissioner's office? So what does that mean? Can you hear me go ahead? Yes, yeah they. You know. The commute of vans have been a problem in downtown and yeah. That's what this says it says, but there were designated stocks and they never used them. They all even the legal commute events, because some are legal and some aren't. They all use the bus stops which they're not supposed to do, but that's where the customers are so there are stops that they don't use. So I don't know what they're studying here of a van terminal. What does that mean terminal? Is it still a problem? Do you guys think it's still a problem in downtown Brooklyn, but can you do that? Oh yes, it's a big problem. Okay, I mean they shouldn't even come. No, it's a really big platform. So should there be more drop-off zones or a terminal, I think the drop I think drop off is relatively simple. They get there, they drop off and go. I think it's when they're picking people football picking, people up that they tend to bunch up stay there for a while. That's what the problem is all right. So, instead of advocating for a terminal, why don't we say we're step, study or, let's say, review and increase commuter van pick up and drop off locations? No juliet, because they can't they won't enforce it. They could, I guess, just like they could do the permit markers, but they won't enforce this. They do once in a blue moon and in my opinion they should be not co, bringing those vans to where it's so congested, because it's really a convenience, not a necessity. People could you know the bands shouldn't come into the downtown and they well we'll send them to coney island to sandy. No, you know what I used to take. Am I saying I used to take the I used to teach out in Queens and we had to use the these dollar vans, and I took the train from the a train from here and got off at rockaway boulevard and then took the bus, because I mean the van because the buses would never wait for us or they didn't show up. So you know I did it and I took two: you know the subway and the ban. What do you think? I'm not saying something that I never did? What are you saying in terms of this request? Juliette? Why don't you leave it as it is? Maybe there is a possibility. There is a creative line somewhere that they can have a terminal. You know so you you're, looking at the creation of the terminal and also you're viewing the pickup and drop off locations as it is. It's nice and broad, okay, I know cindy it. Would it's not totally supportive of that, but I feel like it's been like that for a couple years yeah. I think the creation of this terminal is a great thing to study. Okay, all right, I'm moving to the next one, which is upgrade or create new, plazas and I'll say, work with downtown Brooklyn partnership and then I'll say who has developed a not really exactly a master plan, but I'll look up what it's called I'll call it for now: a master plan to identify locations for new plazas, open space, I'll, say, pedestrian, open space and green space and traffic calming oh, yes, okay, traffic, calming and pedestrian open space and green space; okay, all right and then conduct traffic, that is general and its names, tillery and flatbush skimmer hunted flatbush particularly are the other locations that we should need. Maybe area! That's fine! You know what and it's a landing and flatbush, because people are getting either getting off or being dropped off there to go to the to go to the long island railroad. You know that they come there because that's where the people are, they just recently studied that too, and they came to us. I don't remember if we talked about the bands during that discussion. Talk about the buses, but you know they're talking about the buses, I'm not exactly sure right. That's an issue! Okay. Why don't? I add enforcement on this increase enforcement? Yeah they're? Not gonna. Do it yeah increased enforcement of illegally illegal drop-offs every one of them are illegal because they're in the bus stops not everyone yeah. I know there's something that yeah okay and then the possible addition to discuss. I added because latrell had brought. She came to one of our meetings our she was on. This call, I'm not sure if she still waited out this long, but you know she had mentioned a an incident where she got on the bus and they're supposed to do announcements for the stops. It's supposed to be automatic. The bus operator did not announce the stops turned off the feature, so she you know like it was it it's difficult for somebody with a visual impairment and perhaps the bus operators could use additional training on that. So I put that in as a expensive request. Increased accessibility features for visual and mobility, impairment and training for mta bus operators and anything else to add all right. There's nothing else to add. I'm going to save this and then close it up. You know I was just going to pull up and I don't know is this the chairs report now? No, not yet! Excuse me julia. Yes, excuse me, I don't believe we voted on the presentation following a presentation. Thank you carolyn. Thank you. Do we have a motion on the 11 white presentation? Don't move so sid motions to support second juliet seconds? If nobody else does? Oh, I did oh john quinn seconds. Thank you. Do we have to do a roll call vote? Carolyn? Oh, let's do a bit easier. Let's do it. Does anybody object or abstain? First of all, oh to what the so we'll do. All in favor aye objections, abstentions. Okay, it's unanimous trick. Were you here for the I didn't notice when you came in, did you hear the presentation I did not, but I like the idea of it. Thank you for making it unique all right and the next item in the agenda is the minutes. Is there any objections to the minutes? I abstain. I wasn't there. Okay can I have a motion to approve the minutes? Don't move sandy, second abstentions or objections? No okay, great chairs report. Very briefly, thank you, everybody for bearing with us for the very long discussion today. I'm glad we were able to tackle public safety in a in a much more in-depth way, and I just want to let you know I heard from you guys and really wanted to make that a priority today and more so in future committee meetings. So I know that we have been focused a lot on transportation and I'm going to try to balance it out on, to the extent that I can julia, can you move the cursor up? I can't see the top of the yard. All right, I'm sharing. Can you guys see the comstat report for the 84th a little further down? That's perfect! Okay! So this is the report covering the last week that rob gave to me, so the 28th day would be prior to august 9th. It does show a lot of decreases, however, the year to date we're so high on the shootings, so we're still up 300 and 200 on the shootings it is. It is heartening that some of the other stuff is their negatives and then just very briefly on the 88th, it's similar with a lot a lot more shootings this year than than last year already I had three murders this year when they had none last year yeah. So I am not. I don't have further chairs report julia. Can I just say that I'm very pleased to be back, and I think this is one of the best committees. I I've been around a few other committees also, but I think what we're concentrating on as far as looking at security and things like that, it really shows how much interest we are giving to a very important subject. I'm happy to be back again. Thank you. Welcome back zero, we're happy to have you back too. Thank you. Does anybody have any other business to bring before the committee, and I don't think, there's anybody that has left that has stayed on from the community to have community forum. So with that I would have a great summer. Everybody if I don't see you and see some of you guys in the upcoming meetings. Thank you. Thank you. Me too.",
        "summary": "The meeting of the transportation and public safety committee of Brooklyn community ward, 2 called to order and is being recorded on the cv2 youtube archive in accordance with the NYC open meetings.\nSo after the 11 point presentation, and then, after our discussion with policy advocate brandon holmes, I've invited brandon smith from the the health and human services committee to speak to us about community courts.\nThe good news from that is that we had the opportunity to continue our work with the consultants over the past, I'd, say winter and spring and now into summer, and we focused on some key areas of the core of downtown, where we knew that there were changes afoot and felt that we could really study them and understand them and perhaps recommend changes to really improve the pedestrian experience.\nThe goals of the study I'll go through very quickly, and this effort you'll remember this from the winter time, where two are to improve the streetscape, establish a stronger sense of place and strength and identity, and we were especially focusing on those areas of downtown Brooklyn that haven't seen any improvement literally in over 50 years.\nAnd I'm very grateful to DOT to let us work through these details, Hoyt presents a very unique opportunity in downtown Brooklyn, because there are no subways underneath the block, so we're able to really focus on expanding sidewalks and providing in-ground planting, which, as regina said due to the sidewalk with elm in particular.\nThe sidewalks, so elm street in particular, would go from eight foot wide 16 feet wide Then we could really add a substantial rain garden as well as potentially seven new trees, which we think would be a very big deal in downtown Brooklyn and white street Overall.\nYou have more time to talk about the district as a whole, so we could really work together frankly to look at ways to fund and implement over the long term, because we all know that downtown Brooklyn, needs.\nI, mean, I, would say all sidewalks and we probably couldn't like saying that, but obviously every street would need to be studied and we have to work with youtube and regina Is that on your website, the plan, the presentation, rather the one from the winter The committee.\nLet us get back to the committee on this item, because I certainly want to learn more from john about what he's talking about with the nevin street subway, because you know the nearest subway here is hoyt street Your, oh Brooklyn, bridge park, place, regina, And I mean it's very much in line with the presentation we saw in the winter from downtown Brooklyn partnership.\nIf there's any more comments on eleven white, maybe from community board members opening it up to people who are not on the committee, you can type in the chat.\nWe know if the developer is at allowing for a bike parking in their building or just bicycles, not city bike, Would you like to advocate for that on the sidewalk?\nPriorities and statement of district needs and also brandon smith, is here on to discuss and teach us about the community court system as well.\nThen I worked at the new york civil liberties union, where I developed an expertise around police accountability and transparency, advocacy efforts, and some on the state level, some work around decarceration and decriminalization, and also advocating to repeal article 58, which until this week effectively hid all law enforcement disciplinary records from the public and now, in my current role and where I will be taking a leave of absence from in a couple of weeks, I've, been at just leadership, USA, managing and directing the campaign to close Rikers island, which is effectively in the past four years.\nWhat I wanted to share with you all is for the past two years with the close Rikers campaign, we've developed the build communities platform which our team published in 2019 and 2020, and this was done in collaboration with hundreds of directly impacted community members and service providers and experts across all five boroughs to identify key areas where the city could divest from the criminal legal system and begin to invest in local, community-based programs and resources that improve the quality of life.\nThat's you know one of the things that we definitely want to amplify and prioritize and making sure that every community gets access to conflict resolution and alternative to alternatives to incarceration or alternatives to detention.\nSome of the top issues you want to address are, but I'm going to share in the link a link to in the chat to the 2020 report that our team did definitely identifies areas of workforce, development, public health consulate resolution and alternative forms of accountability, and also family planning and family support.\nThink that's true across all neighborhoods in new york city mine in bed, stuy and euros downtown, Brooklyn , so I'm excited to participate in this conversation with you all and provide any support.\nSo speaking of public safety as public health and rehabilitation, brandon smith is the chairperson of the health environment, human services committee, and he is going to speak with us about his professional experience in the community corps, system.\nBut I want to talk a little bit about community courts and about how they're different than regular courts so that we can think about.\nThere is a clinic with licensed social workers who are able to place individuals who are charged with crimes in into different programs that can ultimately be used in the same place of the really just traditional sanctions that exist in criminal law, jail, community service.\nIs it instead of having the jail a more meaningful experience is exists for the person who's charged, and it goes along with the overall theory of the court, which is more on the problem-solving side than the penalty punishment side of criminal law and when defendants take a plea that exists to and requires them to complete one of these programs, whether it be for mental health, services, substance, abuse, services, maybe anger management or their specialized services for domestic violence, which are which I've seen been be extremely effective and people embrace and really turn their lives around in a remarkable experience.\nYou know these are the things that kind of make the community court set, setting better down in red hook.\nYou have to have a judge who's willing to give a lot of second chances and to be pretty tolerant, but when you have that kind of a setting and when it's in a community-based atmosphere, Like, I think one of the big things that drove me to this feeling is that when we were sitting there with the close Rikers hearings last year and having people who come up and talk about their experience at Rikers, one of the real things that hit me was the discussion of how dehumanizing the experience was of being there.\nThink from that you know , the thought would be if we, if we would want to have a community court for the part of our neighborhood and community district 2 to handle the these kind of non-violent or in some cases you have some very like minor, violent cases where you have an assault and somebody doesn't have to go to the hospital or get hurt very bad.\nThey recently had a contract to also provide services and connect with people on Rikers, island and in new york, city, jails, and I believe this year.\nThat, I think, is probably better for a for a downtown court, because it's difficult with getting all the people into a into a jury.\nEverywhere, but, as I understand you know, in some comm in some communities there is a NIMBY-ism about having a court in your in your neighborhood and in other in other areas.\nI suspect, even if we support this, it's going to be years in the making similar to We, had creation of an elementary school in downtown Brooklyn into the 2004 rezoning.\nWe had that as a top priority for many years before, DOE decided to fund a new school in downtown Brooklyn, and that is not going to open until 20 years after the 2004 rezoning.\nIf, you know of how the red hook community court center got approved, but the way you explained it seemed Like, there's so many levels of sort of bureaucracy really to get that we'd have to get through, and really this is just the tip of the iceberg.\nYou know, I think, it's great to add as I as a priority, so that people start thinking about it, but not expect it to be funded in any.\nGiven your level of expertise in this area, I certainly am very interested in understanding more about what goes on there in red hook And I'm always going to ask for this, because I think we have to have a written document that puts people as close to being on the same page as how we are looking and understanding what we want to happen.\nI think that the contact folk who the key contact folk are the people who this reports website is on the center for court innovation, okay, they're, probably the key contact folk, because they're the non-profit that operates these in the in the city.\nThe idea is that the community court would deal with the issues that would never put people in the house of detention.\nIf you were to demand that 3.5 million it kind of just reinforces that, like 3.5 million dollars, it's not a lot of money to keep thousands of people out of jail when today, it's costing us about 330 000 a year to keep one person in new york, city, jails.\nI shared here, the one for expanding pre-arraignment diversion, is in collaboration with the district attorneys and the office of court administration, so that would be expanding services and funding that, like d.a gonzalez, has already been invested in most of the investments he's made, youth diversion, but that's slowly.\nThere are two buckets, though, that are specific to one community-based restorative justice, which would be similar to you know what GMAC does as like a community-based service provider doing that violence, interruption and conflict resolution model, and then the other one is a justice innovation fund which I'm not super familiar about.\nSo this is kind of like when we talk about red hook, community justice center or initiative they them operating that community court.\nYou know they can accept the plea or they can go to trial, and the system in the community courts allows it to work a lot faster.\nA lot of folks who are homeless, also have come into contact with law enforcement or the justice system and kind of addressing that it would be transitional or supportive housing models, such as what we've seen operated by fortune society or osborne association folks in Brooklyn may be familiar.\nTo pick that up again, does anybody else have an objection, because you know we have both perspectives in the discussion have an objection to removing the link to 120, scrimmage and really focusing on community courts as an expense item and a little bit more conceptually, rather than concretely in that building.\nOne thing could be removing police officers from public schools and investing that money and those resources.\nThe end result was about 400 million dollars that got taken out of the NYPD budget and put into the department of education and that 400 million dollars is still being used to hire police officers to be in public schools.\nThink popular demand from many folks, especially parents, has been to remove police officers from schools and put the accountability on DOE to hire and staff guidance.\nWe have them, so is there consensus about adding this one as a priority, removing or support the removal of police officers who are now working for the department of education from public schools and increasing DOE funding for guidance, counselors and staff?\nSchools know they're, typically not police officers in there, but there is an MOU with the department of education and the NYPD that says that they have to keep those jobs in schools right now.\nNow they got reallocated right and that they should also train those people not to just be monitoring the door, but also being there to assist in the social work and stuff like that, so they're really integrated into the school process.\nWe would have to put in conjunction with the school principles, because we can't make decisions for every school and make a uniform decision, and there are some schools that may have a different relationship with their community, where they think they need to have a police officer.\nOne thing, I do have to say is many of the school safety officers in that 400 million dollars of funding are people of color?\nPotentially I would like to say that when we think about new york city for the next 30 years, we're looking at like pockets of organized abandonment and like austere violence across budgets, and so when we think about spending money on police or school security guards instead of services that is doing harm, especially to people who are black and brown, and I I'm, very much in favor of removing all police from schools and removing the security officers in exchange for more counselors, who are also typically women of color.\nThis is going to take a while to be able to talk to the unions about how it's going to happen, people's you, know, pensions and all that, but to say we're going to reallocate this money to training you to prepare you to take on these social service jobs that we need.\nI do agree with brandon holmes, just said, but basically I think you know we shouldn't be looking at taking people's jobs away, but we should be looking at the bigger picture and trying to allocate their job in another way and train them properly, so that they could feel a sense of pride that they are they're doing something that would be a meaningful, but they wouldn't be out of a job.\nYou know they help keep our community safe, and these are a lot of the officers who are of color and in our district.\nThat's going to the police, as I think brandon holmes mentioned, about social work and social services using the word.\nThe where that funding comes from, because I think some of the funding may come from the federal government, and but you know you know at some points during this process, there's been like five helicopter police helicopters flying over my house, I live next to the Brooklyn bridge people pass by who are protesting and, as a result.\nIf we're going to come to a consensus that the money should be reallocated with a significant fortune removed from the police, department , I think, if you take a vote, here, I, know I would not support the funding.\nI hear you and a lot of people are saying what you're saying you know in the in the world in new york city today, I would suggest.\nThe health committee, you know, comes up with mental health opportunities like this, so I'm, gonna sort of say these funds should be reallocated in generally.\nOkay, so I have this language reallocate funding from NYPD, support, youth, programs, increasing economic opportunities, education, internships, job training, health and mental health, social services, initiatives and I You know expanding the opportunities, also for first responders for mental health.\nSo those people don't have guns like I, think Oh right, reduce militarization of police.\nI. Don't know that it needs to be a different one, but like, if they're going to be these other programs and different kinds of police officers, there could be you know, traffic officers who didn't have reduced militarization, works.\nRemoving that item actually, but totally open to Because, like I think that traffic and placard people we're thinking about who aren't necessarily police are the ones who would care about pedestrian bike.\nIf you want to copy that and say Brooklyn bridge, that sounds great I'm, just gonna put it in one, because you know people are voting."
    }
}