{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCd4IB48ZDqqTGryzlFV8uKw",
            "title": "Manhattan Community Board Six - Full Board Meeting - 10/14/2020",
            "publishDate": "2020-10-15",
            "shortDescription": "",
            "lengthSeconds": "2:32:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "2up-hrkZsG4",
            "fillerWordCount": {
                "uh": 409,
                "um": 326
            },
            "readTimeFullTranscript": "90 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "chair": 46,
                "budget": 34,
                "housing": 31,
                "report": 31,
                "ballot": 27,
                "thanks": 23,
                "years": 23,
                "guys": 23,
                "information": 23,
                "vote": 22
            },
            "wordCountSummary": {
                "housing": 8,
                "work": 8,
                "chair": 7,
                "businesses": 6,
                "election": 6,
                "funding": 5,
                "person": 4,
                "street": 4,
                "information": 4,
                "state": 4
            },
            "fullTranscript": "I wish I could see everyone on one screen: that's the only that's all right. It's a hard life someday, we'll be together again in person. Alright, the youtube stream is live, so you're ready to go. Okay, all right well, welcome everybody! We're live here at Manhattan, Community, Board, six's, October, 14th 2020 meeting and I'm molly hollister CB6, chair and I'm joined today by. Oh I'm, sorry, it's 701 pm joined by our Secretary Sema Shaw and District manager, Jesus Perez who's, never on screen and assistant district manager, Cody, Ostermann and Community associate Brendan Burth. So I think we're all used to this this world by now, but just to let you know that you know the board. Members are unable to unmute themselves. So, but just you know be recognized before you speak and we have we're joined by a lot about we're joined by several public members as well and elected officials. Tonight. So first item of business is, we do not have a public hearing tonight, so we need to do need to adopt the agenda. Do we have? Oh, we have it up. I think we might have one was there any? If there are no objections, I think there might be Rick. Did you want to change? Did you want to amend the agenda tonight? Did you have a change to the agenda? I do not think so. Oh I thought you wanted to change the verbiage and on your we'll. Let it we'll let it go. Okay, let's go the way. It is okay. So since Jim is there a second for champions? Okay in claude seconds? Thank you very much. So the agenda has been adopted. Sema Shaw, first roll call hi everyone good evening. If you could just verbally state, if you are present, that would be great. Everyone needs to mute. It's a TV all right. Let's try that again. Kyle Athy present all right. So there is some echo. I do not know. If other folks are hearing this as well. All right, I hear it. You do okay, but I'll. Just keep going and we'll see how it goes. Asia Body here Martin Barrett Martin Ellie Barroso, Preston, Joan, Barenbaum, President, Matt, Bondi, Matt, Claire Brennan, I'm here Jim Collins, here, Dan Divine, President, Petrus, Disman, President, Janine Dinocrio, here Richard eggers, here Charles Fernandez present Andrew gross President Adam Harkey here, molly Hollister. I believe Molly's here Paige judge here: Youssef Collin here, John Keller, your Abigail cruzmark here Anton Mallner, here Matthew, here, Sandra Mckee, here Wells Magaly, here Richard Mintz, Karen Moore, here Philip Napolitano, President, Roger, schneier Raj up on here; okay Kevin O'keefe, Present, Patel, President, Matt, Roberts, present Jean Santoro, gene Frank, Scala Frankie gene is here. Oh gene is here: okay, hello. I can't see the screen. So if you could just yeah I just he was yeah Frank Scala Frank is not here: okay, Lauren's cher, here Ann Seligman! Here Lou, I know, is not here. I am here: Sean Sherman here Sandro Gerard, here Buddy Simon, here Madeline sims, Madeline, Susan Steinberg, here Mark Thompson, here Corinne Vander Dank, here Brian Van Neufenhoeven, here Pamela Vassell, Gear, Ronnie, White, Ronnie, Claude, Winfield, President. All right thanks. Everyone great thank you seema. So we'll move into public session now with elected officials in first and then we'll go to the members of the public. If we have folks joining so I was just. I have a we kind of have a list here going so I'll start at the top and I'm not sure if we're joined by Senator Brad Hoyleman is he on the call hi molly? This is Sam he'll be joining shortly? Okay, let's okay, we'll move on all right. So I do. Thank you. Thank you. I see council member powers is on the line. Keith. I see your name here. I do not know if it's you or if it's someone else in disguise, if it's Sarah or someone else for power's office, do we have someone? I see it says powers, but maybe oh, let's see okay, I'm going to keep it moving. I we're missing Keith, but I see he's on, but I let's go the next council member Kalos Ben. Are you available? Are all these people on Mute? Maybe no. I think we could unmute ourselves. Just oh, hey, okay! Well then, since you're on Carlina, please, I think I do not think that Keith or Ben they're both showing that they're on the call, but I'm not hearing their voices, so hi Councilmember, Rivera's joining us all right. There's Aaron and I hear Paige and okay, so I'm just you know: katie is here Katy Loeb, as you know, who comes to all of the CB6 meeting. Well as many as we can obligations and everything we're trying to be careful considering the pandemic, as you know, we're trying our best here to pass responsible legislation to continue the hearings to hold our agencies accountable, making sure that we're providing constituent services and just addressing all of the concerns- and you know honestly, like the complaints that we're getting. I want to thank CB6 for bringing people together and having a really great discussion on housing, specifically around people experiencing as neighbors and as a city to kind of improve people's lives and the conditions of our neighborhoods. But I was you know. The census right 6 am on. Friday is the actual last minute that you can complete your census. So please tell your friend call your mom, you know text a cousin whatever it is. Let's get those numbers up in district 2., I'd like us to be a little bit higher in the kind of ranking of the City Council, and I know that Katie's also going to go over a little bit on testing and tracing and how we're making sure that those efforts continue and are the most efficient and culturally humble, as well as the eastside coastal resiliency, and making sure that we're getting all of those commitments done. I'm really here to say thanks to Molly, I'm really here to say thank you sure, hollister, to tell you that it has been an absolute pleasure getting to know you over these years having you in leadership, having really honest conversations around issues related to racism and policing and housing and homelessness and having you lead this community board in a way that with dignity and with respect for all people. So I came here to really just say. Thank you, molly Katie's, going to give the report, I think you're a great person and a fabulous chair, and I wanted to just be here to tell you in a pandemic, you can bump into molly on the street and it's an absolute good thing. Looking out for people who are unhoused, who are under house cleaning up her local park, doing voter registration, making sure people fill out the census, you name it. She is there and so we're lucky to have you, and I just wanted to say thank you and to all of the members for always showing up and for supporting our community. It is an absolute honor to be your councilwoman and I will keep working hard to respond to you and then to make you all proud. So I just wanted to. I was really here to say thanks to Molly, I almost went into a report, but I held back because Katie's going to crush it. Thank you. Okay, thanks Carlene, I'm not going anywhere. So I mean you know. Yeah I'll, be just be doing my stuff. I mean you know so. If you're going to be here, you're just going to not be chair, yeah, so much work, so much so much to be done. You know believe me, I was here, you know thank you for thank you for all of you do with I mean it's been it's teamwork and you guys are great. Thank you appreciate it. I just want to say thank you for your chairwomanship thanks. Thank you all right. So, let's see or do we have Keith or Ben on the line? Oh, yes, okay, hello, hi, hello, molly, hello, everybody should I go. Am I up please? Yes, you're up. Well, I mean you know it's hard to follow carlene, because she always hits the points and I feel like we do so much overlap and stuff. So it's always hard to follow she's a good act, but I will echo what you said, which is that molly halster is the absolute best and we are lucky- and I always say CB6- do not tell the other ones. It's my favorite community Board, but I did serve on it. So I'm allowed to be biased and you guys are always just so thoughtful and friendly and it starts at the top and we've always been lucky. I guess when I first started on this board or when I first started doing, but I think lyle maybe was the chair me too, we started the same time yeah and and through that I've always had really great chairs and molly knows how fond I am of her. I know we all are so I will add into that I'll. Give a few updates and then I'll hand it back to you guys, because one thing I learned on CB6 do not take too much time and I've already used a couple minutes. So just a few things I wanted to say is: I do not know if Carlina mentioned it, I think we might have mentioned it. I'll give her a shout out first, because we passed the bill last month. I think it was that extended. It was about small business, it extended the personal liability provision for for small businesses and that's a bill that she, I guess you did pass it twice Carlina but passed it. The first time and then extended it- and it means that small businesses in our neighborhood do not need to have to worry about losing their entire life savings when it comes to being closed right now, and that was a really important one that I think deserves a lot of attention correlating issues, there's a lot of support for doing in the first place, they're doing in the second place, but the Good News is we're also extending outdoor dining this week and I'm really excited about it, because I think it's really. It's been additive to our streetscape in New York City, but it's also been a lifeline for businesses at a time where they really need it. The most and having a little more time here is going to mean we can figure out how to make it work best for our community and other areas, and also making sure these businesses will stay in business at a really important time. So I'm really interested really excited about that, and then the third thing I wanted to mention on small businesses. It's something I hope you guys will look at here at the board is a 12:2 bills. One is the bill I introduced a few months ago, which is around the commercial rent tax, and I have a couple bills on it, but this one would suspend it for the duration of the covent crisis, meaning that no business is being required to pay a tax for not even really being open and that it's one area of relief. When it comes to taxes, the city has control over and one way we could really help out those businesses that are located in our area. It's only about our area in Manhattan now or in Manhattan. I should say so really one effort we're doing, but the other one we're working on. I'm working out with our old assembly member Brian, Cavanaugh Assembly, member Yulin and Councilman orlander is a bill. That's around recovery leases, which is to say to give the city the authority to come up with a program where we will do a sort of medium- term tax abatement for any landlord that will negotiate an affordable, long- term recovery lease with their with their small business. So if you are a restaurant owner or you're a retailer or any small business neighborhood, you have been unable to renegotiate your lease with your landlord. We're going to give you a way out, and it's a way to give you a little more a couple more years on your lease to give the landlord sort of the backup to be able to do it and also to make sure that our businesses have a future here and we'll be able to be locked into a more affordable lease. And it's something. We've been working on and we'll Sarah of my office is here. She'll. Send you guys some details on that? But something we'd really ask you guys to take a look at as one way one tool to be able to help small businesses at a time where we really need it and one of the ways we're trying to be most creative to view this problem being in the most holistic way, so that all people in the sort of pipeline here when it comes to our city and the properties and the small businesses are all being part of that same conversation. One other couple just do a couple more one is. If you live in Stuyvesant town, you live near Stuyvesant, town or you come in. We opened a new composting site in town to the green market. It's something I want to give Susan. I do not hear from the tenants Association a big shout out because they really when we lost composting in the city as a result of this year, what we were left was community composting program, not the pickup at your building. Stytown is such a big user of the composting program, the residential one I think, they're, probably the largest- and it's such a great, centralized community and we have a green market. So they really fought hard to make sure we kind of kept that program in there they came to me. We worked together, went to management, figured out a program and funded it, and thank you Susan. I see your comment, but I disagree you're the reason we did it, and so anyway, we have a new composer. It's every sunday. It's at the green market, it's 9:30 to 1 30.. You can store those materials in your freezer like I do and then walk over shop at the green market and drop off your materials if you'd like and they have a friendly staff there. So we want to make sure that folks have an opportunity to take advantage of that as well and finally, just a couple other bills that I care really deeply about as we're working on some bills, around homelessness and housing discrimination, and I think some folks followed the saga here at the harmonia not so long ago, outside of CB6. But not far away where the mayor proposed to displace folks in a family, adult family shelter that had opened up right when I came into office and have been really a good partner in this community and a home for these folks as they look for permanent home. So in addition to doing that, we're really trying to solve long- term issues related to housing, discrimination, housing, instability and access to housing. There's a couple bills in the council we're doing around that. What I have we just did a hearing on as a source of income discrimination, which is that if you get a voucher from section 8, voucher and you're going to look for housing, then no one can discriminate against you for having that housing and say we do not take vouchers, which does happen to make sure that all landlords are taking. That voucher. Number two is a bill around fair chance housing, which is basically banning box. People are looking for housing to make sure that they are not being discriminated against and third is a bill on the council. That would actually expand the voucher that you get so because, right now the voucher you get is about fifteen hundred dollars. You can't afford a department on that, so people stuck in shelter system when they should be in housing and when they're ready to be into housing, so we're really trying to expand that it's obviously a little fiscally challenging right now, but a few bills we've been working on. We had a hearing on a few weeks ago about so things. I really hope we're we're able to solve the near future love your support and all those and finally voting is here. It's coming up. Yes, I want to give everybody a great, a good shout out for a great panel that recently and the voting is here. If you are having issues with voting, whether it is about questions on your absentee ballot, it is where do I go vote? How do I do early voting so forth and so on put up a little faq on my website. You can take a look at, but you should call my office we're like all ready to answer those questions of course go over. I encourage you to early vote but make sure that you have an opportunity here to ask any questions. You have them and one issue we've been getting is about stamps, so I just want to plug this because I just actually was dealing with the constitutional we're trying to help get a stamp, so she could mail her ballot, but basically you do have to put a stamp on at this time. It looks like you have to put one stamp on it. If you're in our area you can put on two, if you want to be saved, you do have to put on stamp to go mailing. The reason I say that is: if in June you did it, you just filled it out and dropped it off. So those types of questions we can answer for you. If you want to call my office about anything or track your ballot or anything like that, so I'll leave it at that. I'm happy to take questions or whatever I think, Jim had his hand raised. I do not know if Jim is that for yes, council member powers, okay, hey Jim, yes, hey, council member! How are you good evening good to see you one of the things you may not be aware of with respect to extending the moratorium on businesses? There is a parking lot garage operator here in the city who is out of state it's owned by a bunch of investment bankers from Texas and what they've done in a variety of properties, particularly in condos and co- ops, is basically they've been squatting in the garages, they're not paying their rent and, as a consequence, tenants in those buildings, shareholders and property owners have to pony up the difference for the amounts that they have not paid. There's litigation on it right now I'll be happy to just to send you more information to your staff, but I insofar as is extending the moratorium, I would exclude garage operators they're frankly making out like bandits now, because everybody that comes into the city now is parking. You know they're driving yeah, so if you could, if you could take account of that yeah take it take a look at it. I'm happy I've seen this carly and his bill's happy to look at edited with her staff. What issues? I'm sure she's, I know she's here so we'll coordinate with their percent. You can send me any information around any issues, and you know all these there's so many challenges. Obviously a lot of it's piling up it also I just mentioned it does not mean you do not have to pay your rent anymore. It also does not mean that you'll never get a notice saying that you open your rent or anything like that. It's just meaning that if you are a business owner, your personal, usually savings or a lot of your the liabilities. I heard stories from like restaurant owners who had poured their savings into a business and wanted to make sure that they were not going to leave. Well. These guys are just right. These guys are just they're just being opportunistic, because I think that's right lieutenants have to balance it out, Jim you're, always on that. You always know that the nuance is so send those to me and I'll have to take a look at it. Thank you. Okay, thanks James! Thank you Keith. Thank you. Thank you. Okay, good to see you see you soon. Okay, thanks we're joined by Senator, Brad Hillman. I do believe, if he's I'm here- oh hey there hi, I can't see. I can't see you seeing me. I guess I do not want an ipad okay, but you can see me right. We see, we see you yes, okay, good! I do not know. What's, in my background, do not do not hold me accountable for what's next, usually I can see that just wanted to say hello, molly. First, let me start and say what an exemplary chair you've been. We are going to miss you in my office. I know all of the board. Everyone who's ever worked with you as chair, has such incredible fondness and respect for your sense of purpose, professionalism, self-, deprecation and just overall, really good mindset about how important your work and the Community board's work is to making government work for the people. So thank you for the people molly everything you've done. I really mean that and look forward to working in the future. A few items I'll be very brief. I recently said a letter to the NYPD, because I do not know about you, but I've seen a lot of officers who have not been wearing masks that was followed up by a comment by the governor and the mayor. So got a lot of echo and that request and I'm glad to see that the police commissioner, has sent a directive to his officers, but so far they do not seem to be any disciplinary actions attached to it or any accounting as to which officers are not wearing masks or how frequent that is. Anyhow we'll be following that, because I feel very strongly that not only is it setting the right standard for everyone who should be wearing masks, but if you're, a citizen like me or you you're not going to go up to an officer if he or she is not wearing a mask or you should not because it could be dangerous. Secondly, I wanted to thank councilmember powers for his great report, but and also assemblymember epstein, as well as Susan Steinberg and the folks at styletown on the issue involving the new combined heat and power plant. We're going to be following up on that, but I think everyone has seen a copy of the letter that we sent and thanks to my colleagues for collaborating on that, I have good news. I worked with the council member again on an issue involving grand Central terminal. There were a number of businesses there that were being penalized being fined for late payment of rent and had not received any abatements, but we've worked out a deal preliminarily with Grand Central and the MTA on a new rent agreement. That's going to be based on a percentage revenue rather than a flat fee. Hopefully that's going to make it possible for these businesses to stay open, as well as those that have closed, maybe received some recruitment of their losses. After all, the foot traffic there has disappeared through no fault of these businesses and the MTA in the state of New York, I believe, needs to set at the right standard, much like police officers who wear masks the MTA being a landlord needs to set the right tone and relationship with their commercial tenants. So I'm happy about that. I do not know if you know this, but gay men are prohibited from giving blood and that's been an ongoing public advocacy battle for the lgbtqia community, because, especially now, our blood supplies are extremely low. Due to the fact that blood drives have been canceled during Covid-19, and you know, there's wariness among the public to donate what we have done as a result is to have a blood drive, that's going to be on October 26th we're calling give for a gay, even though gay men are prohibited from giving blood because of some non- scientific concerns about the safety of the nation's blood supply. I encourage you to go and donate blood on behalf of a gay man who can not do that. We need to shore up our city's blood supply, and this is a way to do it. There's information in the report we're also advocating that the Gay blood ban be overturned. You know if you've had cova, you should be also considering donating plasma for research and therapeutic purposes. But again, if you're a gay man, you can't do it because of the FDA regulations, but hopefully we can make that point with our give for a gay blood drive and then finally, I wanted to mention a new bill that I introduced called the fighting underground racing and our streets act or furious act which is going to expand our use of the city's speed cameras during off hours to hopefully catch those thrill seekers and jackasses that have been drag racing and street racing during the night, keeping us up, making our streets less safe. I want to push that bill and fighting underground racing in our street stands for furious act named after the film and that took a very long time to come up with that acronym molly. I know you're proud of me for my great work. Actually I had nothing to do with. It was my comics in my office, but finally, I know Keith has great legislation along with Senator Kavanagh, on saving small businesses. I have a bill called the save our storefronts bill, along with assemblymember epstein. That would provide relief to tenants as well as landlords, small businesses and non- profits under this legislation. They'd be limited to the lesser of 20 percent of their actual income in a given month or one- third of their contractual rent. Payment landlords of covered tenants would be required to waive 20 of their contractual rent and the state would establish a commercial rent relief program consisting of up to 500 million dollars to provide financial assistance to impacted landlords. That sounds like a lot, but we hope there's federal aid coming soon to New York, and we want to create the mechanism to share that aid with our impacted commercial tenants as well as small landlords. So that's my report. Thanks very much, there's more in the report online. I just want to thank Sam Vasquez for my team who's also online with us on the zoom thanks molly all right, thanks, brad thanks Sam, all right, so we'll move on to council member Kaylos. Thank you very much. Councilmember Ben kills. I want to thank chair molly Hollister for her service. Together, we rezoned to stop super talls in the Sutton area, where we zoned to protect the entire borough of Manhattan from empty voids that propped up buildings just to give building billionaires, bigger, better views, helicopter views and I look forward to continuing to work together on our waterfronts. We have rece. We are continuing construction on a 100 investment, 100 million dollar investment in the Community Board 6 waterfront. I only want to see that continue down the borough, but we've got quite a number of accomplishments under our belt and we've got so many more to get done. I want to just take a moment, I'm not sure if anyone mentioned it, but we received a pretty horrible order from the United States Supreme Court. The last date for anyone to complete their census is going to be Friday morning at 5:59. A.M sounds bizarre, but it's because the court has allowed the trump administration to end the census on Thursday night at 11:59 A.M in Hawaii, and that is 5:59 here. So just anything you can do again. I imagine everyone on this call and watching has done it themselves, but please just double check. If you know anyone who is not in the city but intends to return beg a borrow plead whatever it takes to get them to complete the census at my 2020 census. Now the most important of our election is just over a month away and please make that plan to vote mail early or in person just in time. For this lesson, my law mandating an absentee ballot. Tracking system is now online. You can go to NYC absentee.com tracking. We also just had an election information session where we're lucky to hear from Attorney General James Democracy NYC vote early, New York and the State Board of elections. If you're interested in the event, you can check it out on my facebook page at benkaylos.com Sorry at facebook.com, Ben Kayla videos. I think you'll find it very interesting. We cover everything from what the ballot boxes are going to look like. I know that you may have heard from folks who are like oh we're, going to put them out and they're going to look like mailboxes they're, going to be metal. The ones in New, York City are going to actually be at the early voting sites. They're going to be basically cardboard, they're going to be colored, they're going to look like they did in high school or grade School, or what have you, but they will be safe, you'll, be able to drop an absentee ballot at any early voting poll site or any election site on election day. You can skip the line if you get that absentee ballot. I also want to just talk about everything. We've been trying to do to help our businesses recover when the when March and April started to roll around and people started to get a little bit restless in Cv6 CB8. I worked with Manhattan bro president Brewer and Council member Keith powers to ask the mayor to allow outdoor dining, rather than just having people drinking on the streets without any protections whatsoever, and so he did that. I co- sponsored legislation with council member powers, Antonio reynoso, my colleagues in the council to make it permanent and the mayor has extended it and it says he will make it permanent and in addition, we've brought back indoor dining, but we have a package of legislation. That's meant to help these businesses stay open, including legislation. I've introduced, we've been working on it for about six and a half years, there's a lot of businesses who have been getting sued for not being ADA accessible, and then they do a settlement and they do not even get they do not end up making the improvements. This legislation would provide grants so that they could do so as well as make the public health improvements they need, whether it's ventilation or otherwise, so that they can be safe and reopen I'm in my office this evening, because I have the event, but I think, as you all know, you're used to usually hearing my daughter in the background, as usually we're on our way to bed. At this point- and so I wish we had more elected officials who were in one bedroom with their wife and daughter like I have and have been kind of living, what, through what I've been living through. I know many of you have been and we've been focused on how to reopen school safely, getting remote learning, centers open, I'm hoping to work with cv6 on whether on your Learning Bridges locations and getting more just trying to hold the department of Education accountable and getting answers. Next week we have our senior health, fair on October 22nd at 6 P.M, and we're continuing our fresh food box, pickups thursdays 3:30 to 6 30.. As always, if you're interested in partnering with our office to distribute, masks and sanitizers to your neighbors, please email me at Bkayla's benkails.com. I think we just did 15,000 mass distributed with the East 86Th Street Neighborhood Association, so that was pretty fun and a pretty big deal and, lastly, we're giving away a million dollars. We do it. Every year we've been we're the first one of the first council members in 2014 to do so, and so, if you're interested in deciding how to spend a million dollars in my district or even Keith powers, district, we're both doing participatory budgeting. Please start submitting your ideas. Now. Our newsletter is so much longer than this presentation. I'm sorry I went so long. I usually get the timer, so I always remember you can time me, but you can learn more at benkels.com Newsletter. Thank you for all that you do. Thank you Ben! So much and we do have a question from Ann, Seligman, I or her hand is raised. Yep actually yep. I do I do have a question and it I'm not. It's I'm not sure if it's actually for you or for Keith, but it's about this apparently there's a proposed super tall at 131 east 47th, which is you know it's in Keith's district. I think but Ben. I know that this is an interest of yours, so I just wondered if it's on either of your radars and what you know about it. Thank you Anne, for ruining my day. I do not do is Keith still on, or do we have staff from Keith's office? I think Sarah's still here Sarah's on sorry Ben. So this is this is the first I'm hearing of it. I just hopped on Google maps, so I can see that the big hole in the ground in the middle of the block, that block looks pretty built up so and if you, if you want to email me policy at benkaylos.com, I'll work with you I'll support, Councilmember powers, office and let's just the thing that will helpful to know, is whether or not this part of the city is already pretty tall plus with the Midtown rezoning. They may be able to go pretty tall as a right or whether or not they're trying to use voids, because we were able to protect residential districts. We were not able to do the central business districts yet that is pending before city planning. So we may need to do what we've done before here at Cv6 and Russia. There's also a whole other suite of loopholes that we've been trying to close so and I'm interested in working with you and working with council member he's been particularly strong in standing up to over development. Well, I'm not I'm not. I do not know a lot about it. I will send you know what I know I'm not automatically opposed. I just I am you know. I want to know more and of course, I'm concerned about light and shadow issues yeah. We need to know more yeah. I saw that this afternoon and as well yeah, okay, I'll forward you what I've got then you know and to you too Keith and we'll take it from there or Sarah. Okay, all right! Thank you. Thank you. Ben appreciate it thanks ann okay. So, let's move to, I do not believe we have other electeds on the line, so we'll move to the representatives and I'll just start. I'm not! I have it on my list here, but I can't see if everyone's on yet but Taylor from Congresswoman Maloney's office taylor are you on the call? Okay, I'm going to move to Breese. I see that Brees is, I think he was on earlier yes hi good evening and molly, I'm sorry to hear that you are stepping down as chair as an eastsider. We have worked for over a decade easily serving the communities of the side, and I know that you're we're going to continue to work together for a long time to come, but it's really been a pleasure working with you as the board of Chair and I'm sure assemblymember Godfrey would say the same thing anyway. Congratulations on a job well done I'll, be super brief tonight. Somebody remember gottfried is really encouraging everyone to vote in person he's very concerned about all of the noise being made by some people to challenge the results if they do not turn out the way they want, and we think it's important that there's a clear popular vote mandate on election day itself. So if you can- and you feel comfortable and you're able to do it safely, he encourages everyone to vote in person if possible, so that we can get those results at least that are showing on election night to be a convincing vote count, and that goes for anyone in the country. Towards that end, if you're interested in one of the early voting sites that starts on October 24th, you can go to find my poll site DOT vote, DOT, NYC or for all other kind of questions. Www.Vote.Nyc. I would note there's been some talk about super tolls tonight. There was a court case about the 30 West 66th building, judge Supreme New York State, Supreme, Court, Justice, Arthur and Goran did issue a very strongly worded ruling, saying that the use of the oversized mechanical void in that design was wrongly approved by the board of Standards and appeals. So it's a great decision, we're really hopeful of that it'll hold up and it was very strongly worded. That's really all I have I assembly member Gottfried was a party to that lawsuit, and so he's particularly proud about that. That's really it! For this month make sure to get out and vote and to answer the census, everyone. Thank you all right. Thank you, breese all right. So next we have I'll just go to Madeline. I see her on screen or on the on the list here from Senator Krueger's office, hi molly, hi cd6, it's madeline from Senator Krueger's office. As has been mentioned, the census deadline is now very quickly approaching. Also, as has been mentioned, the election is quickly approaching and similar to what brees was describing. Senator Krueger recommends folks voting early in person if possible. She, of course, wants you to be aware of your options, but if possible, it's something to consider and something that she strongly suggests. She was just with councilman Kaylos at their voting town hall. We just finished day two of three of our senior resource, fair, which is happening now generally. This is our big annual event at Temple Emanuel, but this year it's a virtual series. We had all the videos are available on our website and on our facebook page, but we also have one remaining event tomorrow. Yesterday's event was a collaboration about culture and finding inspiration while we're at home, so we had an event with several of our cultural institutions, including moma and others, that video is available online. Today we did an actual like fitness and exercise event and that's available online and tomorrow is job search for 50 plus. So if you know boomers and seniors that are interested in viewing that they can sign up on our website and participate via zoom webinar or on our facebook page, that is all I have all right. Thank you very much and we'll go next to rebecca from Dan Quartz Office good evening. Everyone. This is rebecca from Assembly member Dan Court's office. I hope you're all doing well, molly, I'm sad to hear that you're leaving, but on behalf of the assembly member and our office. We want to thank you for all of your work. You've done for CB6. We hope to run into you in the near future. I only have two things for my report tonight. First, as previously mentioned election day is almost here and if folks need help with absentee ballots, information about tracking ballots and any other related questions we'd be happy to help. So please give us a call or send us an email, and secondly, about I think was last week the Human rights watch released their report on the Nypd's actions from this past summer. Regarding recent protests in the city, which we'd recommend, if you're interested to look into, but in that report our office helped in confirming that all essential workers, including legal observers, medics and other emergency workers, were exempt from the mandated curfew. So as a second wave is possibly looming over us, we just Wanna know our constituents know of that fact. If you have questions about that or want to see any evidence, you can absolutely reach out to us. As always, our office is still helping folks with unemployment, tenant resources and a lot more. So if you need help with anything, please reach out to us, and that is also my report. Thank you great thanks rebecca and then we have Adam from Assemblymember Epstein's office hi we're interested in just waiving the report, but for anyone concerned about voting and how to vote, we would refer you to the report attached to the newsletter. I believe, okay, thanks Adam. I appreciate it and I do not believe unless I'm missing someone can cody or Jesus do you did I miss anyone for the electeds? I think we have pardon me Katie hope. Oh katie, it's! Okay, I'm sorry! Yes, Katie hi! I forgot I was like Carlina. I crossed you off the list because I'm like carlene, okay, no, I'm sorry got some things. I want to talk about the first being contact tracing and some of the Covid-19 hot spots we've had last week, Carlina had a hearing about the tested trace core. In the summer she expressed a lot of concern about the cultural competency around who we were hiring in the test and trace core specifically around jewish, caribbean and haitian communities and, as we saw that actually did have negative impacts on health outcomes. So it's really important that we keep pushing on this cultural competency and making sure that all communities in New York are involved in this process. We do not leave anyone behind. Thankfully it seems like some of the safety measures have really helped start to tamper down these outbreaks in Brooklyn and Queens, but there's more on the north and south shore of staten island that seem to be spiking, so this is thunder. What is that I do not know timer? Did our office timer go off sorry about that kitty, but it's just a reminder: Covid-19 is still very serious. I know we're all you know outdoor dining and some of us are going back into the office a couple days, but please keep social distance in keep wearing your masks. It's very important. It's not political, so we also have a couple events coming up. I want to let you guys know about one is on this Sunday 12th 130. We have a voting information tabling event. It's on the corner of East 23Rd, Street and Second Avenue, we'll our office will be out there with information about how to vote early. How to vote absentee just make sure you have all your options and on October 29th we have a manhattan- wide virtual tenant resource, fair, it's going to be in both english and spanish and we're co- sponsored by Council, Members, Diana, Ayala and Udonis Rodriguez, as well as HPD Hispanic federation, a couple other great organizations. So I'm going to drop the zoom info in the chat. But if you sign up for our newsletter, you'll also get that in your email. I think on Friday and on a personal note molly. I just want to say what a pleasure it has been to work with you. It's kind of a newbie to the whole community board thing having you as chair. You know kind of showing me the ropes telling me what to do has been so helpful, just learning and educating. So it's been a pleasure we're going to miss you, but now that you have all this free time, you got ta get drinks right, sure I'll still be on the board. I'll just won't be, you know, won't be chair, but I'll bug you for a lot of other things too, that are not community board related. So, okay, good, please do all right thanks katie! So I we are joined by Gail Brewer and I I'm sorry Michael Stinson. I was enjoying you and your baby a little bit ago too. So all so we'll borough, President Brewer is on and then we'll go to Michael from Comptroller Scott stringers all right. Thank you very much molly. Thank you! So much it's been quite a day. A couple issues that we're working on one is that we all know about voting but, as others have pointed out, how are we going to get there? If we're poll workers there are 37,000 poll workers some work where they can walk, but others, I think, are going to need the subway or some way to get there at 5 A.M, because the subways are closed from 1 to 5.. I do not know what the governor is going to come up with. He does not seem to want to open up the subways at 3, which is our suggestion, but just let you know we're pushing on that topic. Second issue is, I know this is way in the future, but I just want board. Five has been thinking about it. I'm sure you have also, but we are thinking along the same lines as the municipal arts, society, the Times Square Alliance and others. What would a some people call the public realms our public space are look like it's the listing of agencies. You know better than I, but you know it's everything. It's buildings, it's health, it's D.O.T, it's sps, it's SLA and the list goes on and when you're trying to do something sensible on a plaza, a street SBS indoor cafe outdoor, cafe, etc this sanitation. There is not any one agency to call you have to call all of them, so I'm just pointing out. That might be something that you want to think about what you would like it to look like and along those lines. The mayor announced today or yesterday heard the governor's instructions. I think that there has to be a plan for police community relations, and so he probably saw he nominated three people to do that, and my understanding is that the each borough was going to have hearings and so on and so forth. So I think it'll be next year that the report will be due, but I'm suggesting that every community board have their own plan as to what you think community policing should look like. You can get all the information, I'm sure from the mayor's release about the three people, they're three excellent individuals. I have no idea what the staffing is or what their mandate is, but I just want the community boards to be aware of that in terms of the schools. I think you know many of you are parents, we're still working on the issue of devices, the money that we allocated in 2020. It finally is being spent. This is really frustrating because it took a year for them to decide them, meaning OMB and the City Department of Education to spend the res away funds, and it's mostly for technology. It's 12 million dollars just for technology, so we're working with the oe about that. But to say, I'm frustrated is a mild term. We've gotten lots of calls about major child care cuts in Manhattan, and I have to say, particularly in Manhattan, because the money got moved to other boroughs. We know that some centers have been defunded, that some are experiencing cuts that are important impact two and three year olds in particular. That also find services going from full day to half day, and the list goes on so we're trying to get the information. I'm very frustrated, as you can imagine. We are also not exactly in your area, but we understand we've written to the city and to New York University, because we're curious about how they're calculating positive covered rates among students and how they are addressing these rates. Because if you look at what has been published it's over a hundred- and that's not supposed to be- I do not know if it's in their undergrad, if they're, including the grad etc but they're pushing it in terms of, in my opinion, the numbers of recorded cases and they're right in the middle of a neighborhood. So we want to get more information tomorrow, October 15th we're convening the meeting of the Mount Sinai Deaf Israel Working group. As you know, it has mostly to do with the how they're relocating facilities south of 14th street- and you know, because the members are very involved with that issue. So I do not need to belabor it, but it's everything from real estate to health care and I think post pandemic, maybe change in terms of what we think should be happening. The we walked along the on the queensfold bridge the other day with other elected officials trying to figure out how we can take back a lane on the bridge from the motorists and give it to pedestrians, because right now, cyclists and pedestrians are very squeezed in both directions. And I want to thank the agencies and the other elected officials we're working. You may have a copy already of a letter that we sent with many elected saying. We need money to do this because it's already being used extensively, pedestrians and bicyclists, and we do not want any accidents. I know there's a portion of the East side, coaster resiliency project, which is in Dreamy Board six, and I want to thank your council, member and others and the community board, because you've been very involved with the design. I just want to say we're staying very much on top of it. Those are some of the issues that we are working on. I do not need to tell you about the census. It's got everybody very much on edge. I have to tell you, because we work so hard on finding the tall buildings working with 32 bj working with the redmi working with the people sending out mailings that we paid for with the league women voters to the 35,000 people who left taking out ads all through the metropolitan area, sending out our own 280,000 coast guards funding groups to work, and then we have one day to go. So it's pretty rough that and the Supreme Court and a little bit of a spread in terms of the virus, thank goodness for the community boards and, thank goodness for all your hard work, and thank goodness for how you have an upbeat approach. I wanted to say something: that's not in your board, but the other day I went to the opening of the guggenheim. I was really honored to be there. Your council member was with me, and I have to say just seeing the art and seeing something positive was inspirational. So you are inspirational also, and I want to thank molly and Asus, and everybody who makes this board work and I hate to take the bad news. There's an awful lot of work to be done. Thank you very much, yep you're right Gail. Thank you. So much appreciate all your hard work. Okay, so Michael! I do not see you on the screen now, but I did see you earlier: Scott Stringer's office. Hi. Sorry, I forgot you earlier. It's all good! Thank you! Molly, there's, no small child with you now so he's being fed right now, so he may come on anytime now so, but I'll keep it brief. I just have one update, so you guys can get your general business for tonight. Just today, the Comptroller Controller Scott Stringer unveiled a comprehensive overhaul of Workforce development in New York City, including making CUNY community colleges free for all to build a more competitive and inclusive post- pandemic economy and to better align training with the jobs of tomorrow, with cover 19, displacing hundreds of thousands of workers and rapidly accelerating long- standing trends in E-, Commerce, Telework, digitization and automation. Comptroller stringer's plan calls for the city and state to dramatically expand the scale. Quality, accessibility and affordability of education and job training. Programs controllers are outlined to a series of proposals to upskill, millions of new Yorkers, dramatically, diversify high- wage industries and generate career opportunities during their current economic crisis and beyond to spur New York City's recovery. I'll drop the link to our analysis in the chat and with the remainder of my time. I just want to thank you molly. I know everyone else has said how great you've been, and I can I'm just going to end up echoing everything they said, but since I've been with the comptroller's office since 2017, even before your chair, you've always been a great go- to person for Community Board six, and I always appreciate you always being so kind to me welcoming me welcoming me to Manhattan and I've never worked in Manhattan before so. Thank you and I know you're not going anywhere, so I look forward to continue working with you ditto all right. Thanks, Michael appreciate it. Okay, so I think if I'm not missing anyone do we cover all the electeds. Someone confirm cody or Jesus, okay, good, all right, so we'll move the agenda to the any public members. Do we have anyone signed up? I think there was one gentleman that signed up to speak. We have one gentleman. A Robert Fouche who is a resident of the district, would like to speak about double parking on East 24th street before between second and first okay, Robert welcome. Maybe we should remind him while we're waiting about the time limit for yes, well, he. So there is a three minute time limit for publix public and I guess, if you guys have the timer you can do. Can you hear me? Yes, hi Robert, yes, hi yeah, so there's a problem on East, 24th, Street and Second Avenue, there's a garage that you have to go into to access the garage on East 24th street for East Midtown, plaza residents, so there's been people double parking there and something needs to be done about it under 13 around. I guess two o'clock or whatever it was there, was about seven cars. I took picture. I called three one either. You know as a gentleman that I called this morning from the Community Board said: maybe they need to put sign up or just put a camera. So this that happened because I mean I could not get into the garage and I was threatened physically and there were some cars that were from out of state that had out of state plate. So I do not know what the community board can do about this, because this has been an ongoing problem and I do not feel safe that I need to confront these people that are illegally parked just going in and out of the garage yeah robert. We can help you thank you for chiming in, and I know the office is aware of the issue and 311's a good way to go, but we can try to stay on top of it as well 24th or 2Nd Avenue, the double parking- and I know, there's a lot more cars in the city right now and we experience that all over the district, so we'll work on that for you, okay. Thank you very much. Thank you. So much appreciate your time. Okay, so we'll move the agenda to. Is there anyone else Jesus, any other public? No, that is it okay, good all right. So we'll move to the business session and a first item is to adopt the September full board meeting minutes. They were sent out to the board members earlier in the week and if you can raise your hand, if there are any objections, seeing none, we will adopt the meeting minutes and I'll move to my report. And tonight I just have a few things. We're joined by a former member Aaron Humphries and I know Aaron, was on here earlier hope. We did not lose him. Oh there, he is okay, hi Aaron, hi, molly, hi good to see you yeah. I just wanted to just we'll I'll. Keep it brief and let if Aaron wants to say a few words, but Aaron was a member for 11 years. So since April 1st 2009 and you served as a secretary for over five years for the board, so that was like a I do not want to say a thankless job, it's a tough job and then you- and you were right there for us for all those years. So for the full board and Executive committee, you served on the housing homeless and human Rights committee parks, land use and cultural affairs. Many other big projects that you were you kind of spearheaded for the for the board all those years. So I know you moved or you're moving to philly, but earlier this year you, you officially resigned and it's been a few months, but since Covid-19 we I was hoping we could do this in person, but just wanted to thank you for your service and hope. We see you, you know in the district or at board meetings in the future, but thank you for everything. Aaron and I know I'll see you around but just want to say. Thank you, okay, thank you. It was a pleasure learning from you guys. It was also pleasure. You know teaching more about housing and trying to bring people together of different areas and different generations, because I was the one that represented the hip- hop generation. So you know it was a challenge. It was really an experience. I would would not trade for the world. I would not trade it for the world. I learned so much. I've been around such fascinating, great people who are tops in the field. It helped me bring a lot of information and knowledge and experience in my community. I meant heck, I'm back in the city right now and I just got finished attending a board meeting. That's why you saw me downstairs in the back of the building at ta board meeting help. I saw that yeah. You know, Melanie see a president like put the last. What do you call it? You know last things together with the Pack committee deal with nitrous pet comedian, helping her and you know, knight, should kind of how she said come together, negotiate properly and just continue on where they were but yeah. I brought a house in Philadelphia the last couple months from back and forth. Trying to transition over. I should be officially gone by. You know December, so I'm one week here, one week in philly one week here, one week in philly, but you know I'm looking forward to the challenge in Philadelphia. My daughters could be in my house over here, and you know: I've been slowly ending all my commitments or finishing what should I say, completing my commitments to all the different groups. I have whether it's this, whether it's acs advisory board, whether it's Bellevue, Hospital, Cab, Community, Advisory, Board, whether it's friends of W, South, Park and stuff. I hope you know they still have the money for the park. Renovations, yep, we'll make sure they get. That done. That's really important! Well, I've been like slowly trying to in my commitments, and you know I'm proud to have served with you guys, I'm proud to have met you guys, I'm proud to have been in different political clubs with you guys and been a defender actually said. You know projects with you guys and you guys rock man, you guys are cool. You will be, you will be missed, but maybe you can help us with the eternal question which one is better pats or genos for too sick. Oh, I did not know they were so close together, but they street apart from each other. Yes, they're, right, acrosss, the street wow. Is it like world war three having them so close to each other, but you take care thanks so much and Aaron you have a certificate of recognition. It's up on the screen. If you can see it, but we'll send that to you- and I appreciate it, you know. Thank you. Thank you. Thank you. Aaron come see, us come see us again sometime soon, and my only other comment was that I think the office sent this out to everyone, but Gail had mentioned that we have been working on the east side, coastal resiliency for ever it feels like, but maybe it's been about six years and I know Sandro and several other board members have been really closely involved. With the you know, beginnings of that process. We started looping in the other community board, so it's Cb 3:1, 2 and 4.. They all have resiliency projects coming up. It's called the big U. So we're having this event and it will be all the Community board chairs October 28th at six o'clock online with the city, so Janie Bavishi, I might be saying her name wrong, but the city of the mayor's Office of Resiliency and recovery will be at that meeting. Just talking about connecting all those projects and having us all, communicate, sharing lessons learned from CB6 and Cba CB3, and so please join for that, and I you know, send it out to other people we're hoping to get a large crowd to kind of bring awareness to resiliency and communication and working together, community boards and residents. So that's all I have and I'll move it to Jesus Perez for district managers report. Thank you, molly, hello, everyone! Well, I still have two more weeks under working on with molly under her leadership. So I'll hold back my tribute for another day in the interest of time, but I can echo everyone's sentiments that it's been great working with molly over the last three years. A few housekeeping things believe it or not. 2020 is almost over. So time certainly flies when you're living through a pandemic, but that means in the coming weeks the CB6 office will be posting. The meeting dates for cb6's, full board and committee meetings in 2021. committee chairs. We will send you an email with all your committee's dates before they are posted publicly on the CB6 website calendar for those of you watching tonight, whether you're a member or not. If you have a google account, you can subscribe to the individual calendars for all of our meetings, either committee meetings or full board- and you can subscribe to as many or as few as you want or all of them they will update live if any changes in the meeting date or time occur. So you'll never miss a CB6 meeting so go to our website. Click on calendar. You can subscribe there now that attending CB6 meetings is as easy as it's ever been. The office has been working to improve community attendance and participation at our monthly meetings and to increase the number of district residents that are subscribed to our newsletter. We've increased our mailing list subscribers by just under five percent in the last month and we're up 10 overall over the over this time last year. So that's great! You can help us by asking your friends and neighbors in the district to sign up for the newsletter at our website. Cb6.Org Cbsix.Org or contact us at info cbsix.org, and we can get them signed up to end a few shout outs, speaking of good turnouts. At meetings. Last month, two of Cv6's committees had meetings that were attended by over a hundred members of the public, and the video of the meeting was subsequently watched by an additional 65 people. After the fact, corrine and rich of our housing homeless and human Rights committee did a great job, organizing and managing the panel discussion on systemic solutions to the crisis of homelessness. Similarly, Adam and sandy of our land use and Waterfront Committee did a great job fielding questions from residents at their meeting where they heard updates from city agencies on large district area projects. In fact, we even got a message from a community resident telling us how much he appreciated being able to attend our meetings online, because such access enables him to be able to attend which he was not really able to before, and he hopes to be able to attend online, even after we're past the pandemic, so congrats to Corinne and rich and Adam and Sandy. And that concludes my report and you guys for making it all possible yep, it's a great team. We have a good team. Thank you, Jesus! All right, Brian, Treasurer's report, Omb's budget summer report for our board from October 1st shows that our personal services budget for the year is hundred twenty eight thousand three hundred twenty one. We have a balance of a hundred and eighty two thousand six sixty two with forty five thousand six, fifty eight spent or obligated the current budget for other than personal services, excluding rent is a hundred and forty thousand six. Fifty nine. This figure contains a hundred and ten thousand one. Eighty five of our retained street fare money and our remaining otps budget is thirty thousand four. Seventy four. We have a balance of thirty thousand two, seventy four with two hundred dollars spent or obligated. Finally, we have a rent budget of a hundred and sixty two thousand nine thirty five, and we have set aside all of this money for a transaction to pay rent obligations for the remainder of the fiscal year. Does anyone have any questions? Okay, thank you thanks, brian all, right so we are moving on. I guess we had Gail's report unless Brian Lafferty is on and has additional information. I think we can safely move on all right. So we'll go to the election of board officers. Rick Aguers chaired that committee and I will let Rick lead this portion of the meeting. Okay, thank you. Molly, I'm Rick Eggers and on behalf of the elections Committee composed of Raj, Nayar, Joan, Birenbaum, Genie, Dinofrio and Kevin O'keefe and myself I'll act as the coordinator tonight, Raj and Jeannie will be inspectors of the election. They'll watch the electronic ballots and announce the winners and Joan and Kevin. You've got the night off tonight, we'll be electing officers for the board for the year beginning November, 1st 2020.. The nominees have been locked in according to our bylaws and but tonight each candidate has the opportunity to speak on their own behalf. I assume and for the sake of time, hope that candidates in uncontested elections will choose not to speak, but is there anyone who is in an uncontested race who does wish to speak? Okay, so we'll go ahead and we have two candidates for chair Ozzy, abadi and Kyle are tired and Kyle. I believe Kyle has agreed to go. First, we have three minutes each all right. Can you hear me hello? There there's some serious echo going on I'm here. I think the echo might be coming from Kyle. I guess it went away when I muted him. Oh can you know you have a really bad echo or kyle? Might you have a set of headphones that you can plug in? No is this working? Is this okay kyle you might want to just dial in. I know I am dialed in oh, I think that's what it is. I think they're both feeding. It's like a feedback loop from your laptop and your he's getting feedback from the two different things: yeah, it's the best devices I think just choose one of them and turn down your own volume. All right. Let me try this turn down your own volumes. Can you hear me that's better much better, okay, so first, I just want to give a shout out to molly for her leadership over the past few years, and especially over the past few months, it's really been remarkable. I'd also love to thank the board staff, as always for their hard work and Rick and to the rest of the elections Committee for putting together a very fair and organized process, and, lastly, I'd actually like to give a shout out to Asia. I know that tonight we're vying for the same position, but I really have viewed ourselves as collaborators over this process, because our discussions with all of you have definitely bettered the future of our board. I've said throughout this process that this election is a rare opportunity where we do not have to vote against anything and said we can vote for what we are for. So I'm running for board chair because I believe my leadership meets the needs of this pivotal moment in time. Business is no longer usual. We have crisis on various fronts and the ability to bring people together from various perspectives into collective vision, and then collective implementation will be crucial in shepherding us through this storm and achieving our priorities, and I believe that I can provide that organizational stability while meeting these new challenges. So many of you know, over the past few years I have led Basa and together we have been proactive in our problem. Solving we've engaged with the community, we've been inclusive in our decision-, making processes, and all of this has led to accomplishments, both small and big, from protecting pedestrian space, cleaning, up Santa, Con and other quality of life issues to advocating for commercial rent control and outdoor dining and partnership. With our transportation committee, we really, as a unit, went beyond just being on the record with issues and really worked with the community and stakeholders to provide action on long- standing problems. So I'd like to bring this same leadership model to the full board and to ensure that we're not only sharing a vision for our community but are engaging directly with our community groups and residents, as well as with other community boards to amplify our policy and budget priorities. So tonight we're casting our votes, not just for the future of our city, but for our Community board district. We must confront all of these challenges of these times with leadership that is reflective of the civic engagement, the energy and the dynamism of our communities. So tonight, if all of you are optimistic about the future, if you're driven to realize our aspirations and believe that this time is ripe with opportunity and that we can really cement ourselves as a civic board of possibilities and as a voice of our communities, and I humbly ask that you cast your vote with me. So thank you. Everybody and I appreciate your consideration. Thank you, Kyle and thank you for staying within the time limit. Next we have ozzy abadi and Asia. You also have three minutes: if can the board office, please I'm unneeded great. We've got a timer going. Okay, great many thanks to the election committee for all your hard work. I know you did spend a lot of time on this and you know kyle. That was a great speech you make CB6 better, and this election has made us stronger I'd like to start by sharing some of my experiences that make me the best choice for chair. First, I led the health and Education Committee for five years, where we had tremendous impact, we were able to make cd6 safer, while also helping struggling foster youth, a majority of whom were young men of color. This was a complex issue and we had to skillfully, engage multiple entities, including the police precinct, acs, the hospitals, as well as elected officials. As chair of the committee, I pressed until acs got the funding it needed for programming and staffing, as well as created its own community advisory board. You know those kids in our community are better off for the thoughtful work we did. Let me give you another example. Our district needs statement has a section for seniors, but we had never asked seniors what they wanted. So we did that in the committee we created the first ever Cd6 senior survey a programming needs. We also found that CB6 seniors had a high rate of falls leading to hospitalizations. We incorporated all that information into our district needs and budget requests. So now, when I go to Kipps Bay Library and I see Falls Prevention programming, pre- covered or senior choir, you know I know that's because of the work we've done and my heart sings, because that's the change, we're looking to help really make our communities better. The second of experiences I'd really like to share with you is that I've been your elected vice second vice chair for three years. This role has been an outstanding training ground for the position of chair. I work closely with the board chair as well as first vice chair as a thought partner on board management and strategy. I've stepped in for the board chair both internally and externally, and I understand the time and effort required to be chair and willing to do so. All of this means that I can hit the ground running if elected. Looking ahead at Cv6 I'll be focused. Focusing on stabilizing the district for the future, we must reassess our committees to appropriately address the current situation. We also, we must also institutionalize our CB6 knowledge and super leadership development, so the board remains sustainable. Social justice has been embedded in everything I've done at CB6 and will continue to be part of the board, because the changes we make locally help improve the world globally and to glows. Cd6 has been a central focus of my life. My daughter was born at Nyu. My kids grew up at St Martin's playground, my family bikes on the East River, the mosque that I attend and where I hold a position on the board, is on East 55th. Whether you've only been here one year or lit, where were born and raised in the district, we've all been appointed to the community board, because we've shown a significant commitment to the district and represent the diversity of the community, we're here to amplify their voices and needs. I would be honored to be elected your chair and I ask for your vote. Thank you. Thank you, ozya, okay, so we're basically ready to vote I'll, give the anyone else who's a nominee, a chance who to say that they'd like to speak, but I'm assuming nobody does. It looks like Martin. Barrett has his hand up. Okay marty, oh yeah, after I was chair at the turn of the century, we, the board's focus, was to give as much opportunity to newer members who have a wealth of experience and we revised the bylaws a couple of times to Lim. You know, do term limits on the chairs of committees and to promote individuals having a greater say among the things that we were trying to eliminate, was for former board chairs to be committee chairs and to attain executive positions on the board again that we have two former board shares applying to be vice chairs, we're putting in place a a block for few for other members, newer members to get that kind of experience and to become the next chair. We have some marvelous individuals in the board. My question to you was those positions, just not that nobody applied for, and you recruited the former chairs or they actually applied yes to the first rick I can. I can I we I think I mentioned to rick, like we actively recruited like, went out and asked, and I said, yep no. I think I think you're talking about different things. The two fights chair, the two vice chairs applied. No, we had else. No one else applaud, but I did. I did try to reach out to several people and yes, I tried to actively recruit for vice chair. I just want to say that I mean I do not know if that's legal to say that, but I definitely of course it is. I definitely try it. I chaired former nominating committees and we reached out to get people to apply for the various positions. So you know I understand that, but it it's sad that there's a a lack of enthusiasm to become a chair share is a very difficult job. You know it very well, you know during my term we were the time after we extended it to three years, because two years is not quite enough, but it and Rick knows too it's a very tough job, but it's so rewarding that it's a shame that not more of the board members who are so very talented would want to step up. I agree, and I imagine that maybe it's a prerogative of the you know, executive committee and the new chair to you know just continue to kind of recruit and mentor some folks, so they can, you know, join the as vice chairs in the next several years. I would suggest that maybe one of the individuals who is running for vice chair would give their place to the individual, who does not make it to chair, because both of them are incredible. Interesting piece, I'm sorry! Okay, no marty! Your per your comments are valid. It's just not the right time for us to go any further with them, yeah, no of course. So we will. We will go on to the to the voting and I'm going to leave. I'm not sure where the ballots are physically accessed in the chat function, chat function, the link to the election of board officer ballot is right there several times. Okay, people can click on it now and submit their choice for board officer positions. Yes, and you would vote for. One of you know for the candidates are Asia body and Kyle, a tide for chair Sandro Sherrod for first Vice, chair, Mark, Thompson for second Vice Chair, Chair, Brian, Van Neuenhoven for Treasurer B Disman for assistant, treasurer sima Luthra for Secretary and Matt Bondi for assistant secretary. Oh, my last name is simasha, but I do not think it matters, but I'm not sorry do you know Asima russo. He must know another sema who's that I'm sorry, I'm very sorry. I hate to do that with people's names. My apologies no problem wrecking Nah. Probably I do know. I see myself no she's going to shut up anyway. Please mark your ballots and submit them and we will get the and if the board, the inspectors of the election, will contact modi and take a look at the air table. They'll get the numbers as well. Rick you are as red as you're sure I know I hate getting people's names wrong. It's particularly annoying to me. This is just a reminder that this is a separate, a completely separate ballot from the ballot for a resolution. So you'll need to submit this now and not at the end of the meeting. You'll get a separate link later in the meeting for how you'll vote for the resolutions presented tonight and rick. If, if it's okay, I was going to say if we I do not know how quickly I know this, the air tables is quite quick. They can have the results very soon, but we can move the agenda unless or do you have the results soon or should we could move the agenda and then we could cut in or announce the end of the meeting? Why do not we move and cut in, though I'm the one who is next up again? Oh boy, yeah, okay, okay! Is that whoever's calculating the air table there are there? Are we still waiting for people to input? Yes, we're still waiting on a handful of let's do it? Okay, let's go on okay, so we're moving we're moving to the business of the committee. So we are. Let's see I want to make sure. I do not miss anything on your notes here. Everyone so can we we'll do go with committee chairs. We have the digital ballot, which is again like a separate ballot from the one you're filling out now that will be in the chat shortly and we'll start with the chair of budget and governmental affairs, rick Aguers I just taken over. I got tired. I think I think it's time for me to be chair again, so we have a resolution that you have not yet seen and I'm going to ask if the board can, if the office can please put it up on the screen. The resolution is in two pieces, but it's a single resolution, but the most important part is what is now on the screen. If we can scroll it to the top of the document there we go you'll see that we have the those are the capital expenses, the capital budget items and then there's the expense budget items. The committee has, as usual, taken a look at last year's priorities. This year's priorities are submitted by the committees and taken a general look overall of what's been going on. We have fewer number this year because it's getting a little bit difficult to actually ask for some things that are so ridiculously not going to happen because of the budget requirements, but we do have some that we've continued for a number of years. We've highlighted the ones that are brand new and we've shown the ones that are being removed. The committee actually voted on this tonight. The vote was nine in favor, one opposed, no abstentions and none not entitled the. I do not know if there's anything that I need to explain about this, but I'd be happy to do so. I should just say that this is the first step in the development of the district needs statement and the one that the board actually votes on the it identifies our stated need for the district. It will be. It becomes narrower in the district needs statement to the point where at the when we do the final report, there are three general areas that are selected as areas of greatest need. The current district needs statement puts housing and homeless as one affordable housing as two and parks as three, and I think it'll be some, though probably some variation of those three. Maybe two of the three we'll continue we'll see what happens as we get go along with the with the document. Sandro has a question: Rick, yes, Sir. Actually I was just going to ask that we advance the document, so we can see the continuing support. Can you send this document in the link? I know I have it, but I do not know if everyone else has this document. I do not know my apologies for not getting it to the board earlier, but we just voted on it tonight. One moment: it's amazing how many of the park items have finally been funded yesterday, 20:30 years worth, they've either been funded or the committee took it off as hopeless. Well, you see continued support, though it's a good number and continued support that we're still monitoring, that's fabulous, but you know because marty you did just for people who do not know before this before Brian, who was who is the immediate predecessor to me doing this Brian Van Neuenhoven there was Pedro Carrillo, then I did it for five years and before I did it marty did it no, it's Bill Williams or Ben Williams, Dan, Williams, Right and Dan. I forgot about Dan yeah. I'm sorry Dan made some major advancements in the way we did it too yeah, and I preceded him in that. In that time period marty has seen it all, and he knows that it takes sometimes 10:15 years to get some of these things approved and we just keep knocking on the door. Good job group, absolutely great job. Okay, we can't send the document via the chat, but we can send the airtable version of this document. It is the exact same as what you see in on the screen before you, so I've just sent it now. It's an air table link great just an update on the election. We're just waiting on a few more votes and then we'll we'll have some results to share okay. So we do. If are there more questions on this and maybe you're waiting to take a look, a closer look for the budget needs. We do need to vote on this, so I guess we need to rick. Procedurally, would it maybe since you've done this longer, would it be wise to maybe just go ahead and conclude the vote voting for officers so that we can then put that ballot away, and then everyone can focus on this new one? We would not want folks to get confused between the two ballots. Yes, can I ask a quick question sure in the document like one of the higher, we asked for more provide more housing for seniors as number four, I do not see an explanation for that. Is that just a general or is there an explanation in the needs statement? The there are two sep. There are two more pieces to this. The next one will have about an 800 character description and then the district needs statement will go even into more detail. For example, tonight I was reminded that we need to. I need to talk to the 197a group, that's working on senior housing yeah and I have not directly talked to anybody about it. This comes from the housing and homeless Committee. I did not talk to that group, so we have if the district needs statement will include more information. It was originally part of supportive housing in general, but it's really a separate item. Senior housing is a separate item from supportive housing. So we've split it out and I just have not had enough time yet to flesh out the description, but there will be a separate item. Yeah and Karen and Kavita have a lot of background on that they can yeah and the surprising thing is how little we have in senior housing in our district. It's either extremely high- end or it's people who are disabled. It's not really senior housing. We have Cabrini, yes, Yusuf Khalid would like the floor. Yusuf yeah yep. I just had a quick question on items: 12:25 and 26. Basically, the security items under capital or expense, I think their capital, the security system items 12:25. Oh, it must be okay, security system for Ps 116 and then the security cameras of the at the public spaces. Do we have a greater description of what it is we're asking for? Is it just? You know we need a bit more surveillance and the reason I ask that is the systems vary widely and what they collect and how they feed into police databases and so on. So it's something that I would love to either iron out in the neat statement or follow up on later. Just because it's it's difficult to tell based on this, I can tell you that there is more, but I would like even more so. I will be in contact with you, and maybe we can talk about those three, because you obviously know something more about this than I that I do I'd love to talk further about it. Yeah it. There we've also run into some some issues with them in the past that perhaps a better a better description, better based description will get us a better response, so I'll be in contact lovely. Thank you, yeah and Rick. I know that the Ps 116 was funded by as well. It was last year funded by Council member Rivera, so that or that was talked about, so I think it there is some funding there. So hopefully we can. I think that might be something that well yeah the different pieces in of the security. Some of it has to do with cameras, and some of it has to do with secure doors, so we'll have to check and see which is which is currently funded and which is not yep. Okay, good rick, yes, Raj is going to report. The vote totals now. That's fine hi everyone, so you know, as the other ones were mostly uncontested. Well, the ones that I'm actually going to announce is the chair. So as of now- and it seems like we have all- the votes in Kyle had 21 votes, Asia had 21 votes and there were three abstentions. So we have a tie. There are 45 members voting of 49 total members on the board, currently Florida Supreme Court. I am not prepared for that. Paying chats co- chairs chairs, we do not have co- chairs in the bylaws. Unfortunately, that would be kind of an interesting concept for us, but all of the uncontested races did reach a critical majority of votes for the single candidate, so those are all settled. Okay, now that those numbers have been announced, I there. I assume that there's nobody present who has not voted, who is swayed by that information, everyone who is present, who is present for the first roll call or has come in kind of sense, that we've noted 45 members. We have 45 votes. Okay, I suggest we get on with this one item and I'll have to do some confabbing and find out what we do next. I was not prepared for a high vote. Okay, and nor is the bylaws speak to it. Why do not we vote again? It's a weird year. I think it's going to be that we have to vote again, but the come on you abstainers get committed. I believe I believe the bylaws require a majority vote. I just would have to check so in according to chapter a section to the bylaws. It says the votes of a majority of the members present and entitled to vote shall be required for election. If no candidate for an office receives a majority, there shall be another ballot that excludes the candidate who received the fewest votes or the candidates who received the fewest votes in the event of a tie for the fewest in the previous ballot. This process shall continue until receives a majority, so it does not really help us. Where are the Russians drop out drop out the abstain right? This thing can not be it's being received. The fewest votes so that candidate gets dropped out. Correct nice try there but yeah. Where are the Russians? If you give me a moment, I will construct another ballot just for the chair, this race version two, and we can run this again so that everyone does not have to vote again for the other officers. Okay, let's and then we'll move the agenda for now. Okay, so where are we with Rick Eggers Chair of Budget Committee? Is there a Sec? Is there a second yeah? Second? Okay, thank you. So so we do not have a ballot out. Yet for the resolutions and for this budget measure, so I think we'll I'll post one I'll post one right now: okay, good okay. What we can do is we can do all the resolution voting and at that very end, we can do the final vote for chair. Okay, very well. Okay, that's a good plan! Okay! So next on the is Adam harkey for land use. Excuse me, molly, there's a second piece to the oh, I'm sorry that we had with it's just it it's there. It is that I want to make sure that people have seen that because they were just looking at the table before this is the transmittal that would go. That would be part of the total resolution. The resolution would become an attachment to this. As the resolution and again it's a it's, a nine one: zero. Okay members: the link to the ballot for resolutions has been posted to the Chat box. Okay, if there's no need to take a second vote to cover the transmittal memo, I'm good with that. If you'd like to take a second vote, that's good! No! I think I think we're voting on the information that you shared and the resolution that saying we're in support of these budget needs. I think that's these budget priorities. No, it's not! Oh what pam! Well I it says on the on that in the chat we should be able to access the ballot for resolutions, but I do not see anything for you know. Is there a separate thing for the budget, or is it just this one resident is the one it's the one budget and government. If you click on the very last thing that Jesus posted in the in the chat. There's a budget okay and then you should see it. I see: okay, good, okay, good, okay, good all right, so everyone has the resolution ballot. So please vote on 1a. How do we do that? Do your name! It's what click on the link and it should guide. You we've done this a few times before, so they click on the link. And then you have to find your name yeah. What link, though? Oh there, it is! Okay, got it! Okay, good! Thank you, pam all right! So, let's move to I'm sorry Rick, do you have a report? No okay, move to Adam Hartkey, chair of land use and waterfront so used to going last. So this is a refreshing I guess. In short, we had we had a meeting about two weeks ago. As Jesus had said. You know we became Youtube, Civic famous. So if you want to watch the recap feel free. Thank you to Sandy and thank you to the board office for a very successful meeting. It was jam- packed. We had a lot of different government organizations, give updates on the various projects within our district, one of the big ones, the one the main focus was along our waterfront regarding the 54th Street Pedestrian Bridge, moving forward according to plan for the Escr project. This is also moving forward. Some of the procurement milestones have been met and actually have been exceeded, so construction can potentially begin sooner than expected. They will be updating their website and other outreach efforts, so be on the lookout for that we're expecting monthly updates from them. So they'll provide a little bit more information in the next two weeks from now. Not really much to update for 2020, but we'll get a little bit more on how things are going to progress in 2021 Ann Seligman is going to be our designee for some of the art installation that is going to occur, and so with her sort of good taste and intrepid eye. We look forward to her feedback and what she presents back to the committee, and with that that's my update, we'll have a meeting in two weeks where we hope to discuss more about some of the upcoming mitigation efforts for this project. One of the big things is that, for the accounted pier due to budgetary constraints, you know they have sort of scaled back on their project that they had presented to us early in the year before Covid-19, and so we still need to press our electeds and other community groups to help raise awareness of how to improve and activate the east side and how to get funding for these. For these crucial, open space needs that we need here in our district. So thank you. Thank you, molly. We wish you well and we'll see you very soon. Thanks Adam all right parks, Pam, Vassell, Parks, landmarks and cultural affairs. Here I am so first let me wish you the best of luck, molly and to say how terrific it was working with you and what a great job you did. So we look forward to how your relationship to all of us will change in the coming time. But you know it's been great and kudos to you so on October 6, the Parks Committee met and Steve Simon was there with his design committee and the parent group of the Saint Thornton's playground, who had many issues. If you remember from the meeting before there were about 50 comments here and there, so we decided to open it up again, have a discussion with parks and see what would happen. It could have been a very contentious meeting as it turned out. It was not. It was extremely successful in my opinion, in that both groups listened to each other and compromised. You know it was the designers provided visual options and choices would were made. If you want this, you can't have that. If you want that, you can't have this and there was a consensus and at our next meeting the designers will come back to us on November 4th with finalized drawings based on the decisions that we made and it. We hope that at that point we'll be able to vote on it and do a resolution in support of the playground so that we can start sending it out for bid and get the whole process going. We urge the group to get involved with friends of Saint Forton's and also to get involved with the issue of closing 36th street so that it might be used for the groups who want and who need asphalt and not the astroturf. What do you call that? Lookalike whatever it is? So that's where we are and that's what we're looking forward to and so that next meeting will be November 4th and we hope it will go swimmingly well. But I have to say that Steve and his team did a great job. They were very open to sort of throwing things up in the air and reworking the park, which was a great thing and the parents, because they had a chance to voice their objections and their ideas will have a playground that they will feel really happy about, having a grand opening for and bringing their children there and that's where we are. That's it pam. You did a great job too. Thank you for all of that, all those open communications and, I think, yeah. I think that everyone was being quite reasonable and it knows a lot of work. There were a lot of additional meetings, but it was worth it it'll be worth it. I hope, yeah. Okay, thank you all right. So we'll move to Bossa business activities and street affairs Kyle a tide for an update. Can you hear me? Yes, audio, good? Okay, perfect? Could we just move the slide over? So we have two different resolutions. The first one is on the save our stages act, so this actually came out of a conversation that our committee had on Broadway and the arts cultures and the different independent venues that we have throughout the city, which are obviously really hurting. After the conversation, we actually heard that the venues would be closed through May 31st 2021. So this particular piece of legislation save our stages act as part of a federal plan. That's providing independent venues with funding to make sure that they can survive. All of this, which obviously also supports hundreds of thousands of workers who are within the creative fields as well. So we discussed this, and this is what was you know our intent with this, so we put forth encouragement at the Senate level or see our Us senators and also encouraged our state and city locals to work in conjunction with that, but also to have a safe fail plan in case the federal funding does not come through. So that's the first item questions you have your ballot, so I'm used to saying all those in favor, but I mean people are saying: bundle yeah right, okay, so yes, please vote on resolution 4a and we can. I guess, Kyle moved to sure. So. The second resolution that we talked about was movie theaters. So this might sound like it's very similar, but in our conversations we thought they were actually pretty different in operations, of course, the most obvious one being that there is not a live performance. So there are not those same type of public health guidelines that you would have to follow and security precautions and obviously an influx of people within a closed space. So we discussed the reopening of movie theaters very similar to how restaurants and bars have reopened at limited capacity. We thought that this could also this industry could also be opened up in a very similar fashion, with obviously great respect and concern for public health, but at the same time, with these establishments opening up, obviously they're independent theaters they're corporate theaters, but they do provide jobs for local economy, but they also provide an indoor leisure activity, which is becoming increasingly important, as the weather has gotten colder and people have expressed that from the community as well. So we put a resolution out on that to make sure that we were encouraging the reopening of this so that they were not forgotten about. So that's the second one. Any questions comments thoughts I missed the movies I missed the movie. Seldom has her hand raised. I'm sorry, I'm just curious what the committee vote was the movie theater, that was unanimous, Letty Simon requests the floor. I just have a question as to with these resolutions. What do we? What are we doing about this? Where are they going and what is the other than the fact that we support them? Where are they going and what are we doing? Mm- Hmm? So obviously these are proactive resolutions, so this requires excuse me to do what so the first one for saver stages. We want to encourage our U.S senators to vote on this bipartisan bill, but we're also encouraging them to get the support of their colleagues to make sure that it gets done, but this is also bringing it onto the forefront of state and city- wide elected officials radars as well, obviously as a federal plan. It's not necessarily within the jurisdiction of that, but we've seen some of our local officials really calling to action. A plan on funding these independent venues. Most recent Senator Hoyleman came out. So we want to start that conversation and, of course, like with all of the work that we've done in the past. This is going to require a lot of follow- up on our end as well, to make sure that we're being pulled in and being held accountable to it too. That's kind of what I mean. You know what the substance of it was. You know we're proposing something without any substance behind it or enforcement. That's all I'm just questioning yep, no so yeah, so we built that into it as well. We also put in some stipulations about the misuse of funds and fraud, which we've seen where's the money going to come from. So the first one with the save our stages act, that's federal requests. So it's still valuable to make those requests from the federal government. But that's why we built in the state plans as well to make sure that, even if there is not funding that there are some programs or some kind of relief to this. But again this is just the first resolution on it. Everything else is built upon this foundation, which is the big request, which is you know our wish list type thing and then, as we move forward with these actions, we can be more specific about things that we, you know specific stipulations and plans that we offered as well, but again Broadway's closed until May 30th 2021, which actually reminds me there's some typos on the resolution. So we'll fix those typos but yeah. So we have some time to build up and really figure out how we want to put this together, and that includes calling in you know the Broadway League, for example, to talk to us about what their specific needs are outside of funding and then with the reopening of movie theaters. That's honestly, a policy decision so that again, is just about hounding our elected officials to make sure that we get that done. Thank you very much appreciate it. Bye Dan Divine requests the floor thanks, Dan yeah. Thank you, Kyle, just quick question and I know that you've been working pretty hard on a lot of these resolutions and it seems like tonight we have two that are pretty similar to one another. But can you just give me a better sense with you know, as the chair of business affairs and street activities, what sort of the overarching sentiment you have, or maybe a little bit more around an overarching philosophy about kind of the reopening of the city more around in terms of like what would we be looking for support in what regards versus maybe just kind of taking a look at individual situations as they come up, but a little bit more around a philosophy about how, when we are looking to help either struggling businesses or industries, specifically when it comes to basa how you think about that and how to kind of prioritize them based on? Obviously what at some point will be limited funding? So I'm not sure that it's super irrelevant for committee report right now. That's more of a super big picture type of thing, but you're, obviously on the committee with us. So you know that we've been super proactive in making sure that not only are we doing the engagement with the communities and the stakeholders themselves about that, we're including them in the decision- making process as well. All of this is grassroots leadership. This is all grassroots decision making. The rest of the committee has been. You know, had input on this as well and brought in their own experiences on this. So really, what we're trying to do here is be proactive and preemptive in a lot of things that are going to come to the forefront, which is why I was mentioning before tolletti that these resolutions are not supposed to be an end within themselves. This is really supposed to be the beginning of conversations and actions that we want to see, but we always have to start off with your wish list and then kind of you know narrow in from there. So that's what we're doing with these two. You know resolutions as we've done in the past, with a lot of big picture things. We want to make sure that the big ask about you, know federal funding and then also putting it on the right. There's our city and state officials are up there and that we can, you know, use that as a springboard to get more specific about. You know other types of support that we can offer, but again that needs to have be collective in the decision- making process so we'll pull that into and then with the movie theaters again just a policy decision about things that might have been sort of left at the wayside, but things that are very important to people's quality of life, character of neighborhood things like that. We just want to make sure that we're thinking about all of these different businesses and the employees and workers that work within those industries as well. So that's I'll answer that, in terms of these two pieces of legislation, all right, okay, kyle, we have one more question: I'm sorry we have one more from Jim and let's move the agenda because we had just yeah. No. I just wanted to comment since you were talking about the general notion of this thing. The arts and entertainment are tremendous multipliers from the New York City economy. It's 15 billion dollars a year when they're up and running. If we can get, you know, 30 percent, going on this, that money flows to actors. Stagehands restaurants bars, you name it yeah. I mean I do not know if anyone has been to the Times Square area, but it's everything's closed and, as have you seen, the resolution we've put in a lot of that statistical information as Jim just mentioned: 15 billion from Broadway alone, hundreds of thousands of jobs related to that but they're also independent venues as well, which kind of get lost in this concert: venues theaters, off-, broadway, off off- broadway that are included as part of this as well that we just want to make sure people are not forgetting about it and taking action on it. Okay, all right! So please vote on the resolution for b someone saying something: oh sorry, 4B and then Kyle do you have a report? So there's no major report again just want to thank the board staff for their support, as always the committee members again for really delving in and committing to a lot of these tough conversations that we've had over the summer and which are obviously going to be on the forefront of our committee's work, but for upcoming in October, we've reached out to decrim. Why? For those of you are unfamiliar about it, that's an organization, that's working on decriminalizing, decarcerating, destigmatizing, the sex trade and really focusing on things like trafficking and other human rights, and obviously this has impacted them as well. The you know economic crisis, but a lot of discussion has not happened around it, so we've invited them to speak at our next meeting and you know, hopefully, people can join and hopefully they'll be confirming with us soon. So that's all I have on my end great thanks: Kyle, okay, let's move to housing, homeless and human rights, Corinth Vanderdunk hi everyone. So, as Jesus had mentioned, our last meeting was a panel on systemic solutions to our homeless situation. It was attended by 115 public members and they stayed on because I was like oh my god, everybody's going to you know the people stayed on for most of the of the discussion. The top three solutions for to end homelessness was housing and housing. It was made clear that you know it's. Just the shelter system is not a solution and it's expensive on top of it. So I want to thank rich, my our the my vice chair for his work and cody, who you know helped tremendously. The other thing that was mentioned was by Felix, who experienced homelessness himself was you know now having a sense of community, even if you're homeless really makes a big difference, and so, in that spirit we are trying to do. A book drive puzzle drive for the Vanderbilt Y contacts, either Kyle or Ann. If you can donate anything, and then acs is asking for donations, multiple copies of the same titles, if you can of graphic novels, legos and duplos and again contact kyle or and if you have any of those items to donate and then I wanted to hand it over to rich who will talk about our upcoming meeting I'll, just speak for a minute because we are running over, but one of the things that we are considering is possibly a resolution in favor of better enforcement of the conditions of 421a tax exemption, because property owners who get the 421a tax exemption are required to comply with conditions, including rent stabilization conditions, and a lot of them fall out of the program and basically the system never catches up with them. So we are working with the housing rights initiative to identify some buildings in communities, district, six that are out of compliance and also talking more generally about the problem. Okay, that's it! Thank you. Thank you guys great job yeah that forum. That meeting was very good. It was it was. It was really interesting and informative all right, so we'll move to Kavitha Matthews 197A working group tour, hi, everybody yeah. I agree. I was at that meeting corrine. That was an amazing meeting. It was, I know that a lot of people in my building and community joined too, so it was very helpful. 197A I'll keep it really brief. We met earlier this month and reviewed our new website, which is getting ready to launch we're almost there. We have a couple of little things. Thank you Brian for your help, even though you're not actually you're, like the honorary member of our committee for helping out and we and I will be attending as as the borough president mentioned, the Msbi Task Force meeting tomorrow and looking for any updates on the direction of the sale of msbi sites and if there's anything, you know new in terms of information that we need to glean from what what's happening with that and we'll add that into our website. The website's meant to be just a repository for what we know about. What's going on with updates about you know anything that we hear is coming down. The pike timing, but also it's supposed to be a place to gather some community input about what the you know, what people think we need to add into the community. Obviously we heard a lot about senior housing, supportive housing things like that, we're looking for more input and we have ways to gather that in the website, which is really just a sub- domain of our community board 6 website, we also looked at some. We also went back to some issues. We had kind of started to talk about before the pandemic hit some street mapping from the original 197A report, and I will probably be connecting soon with the folks on the land, Use committee and others to see. We have some ideas about direction, but we really need some help, trying to figure out how we should proceed on those items, and so we will do that and that's really all I have for my report. Thank you good. Thank you. Thanks, there's a lot going on all right: John, Keller, Health and education. Sorry, okay. We are going to have a meeting in two weeks of the health and Education Committee and we're going to focus on the mental health aspects of implications of Covid-19. We have people from Nyu Langone coming in and Carlina Rivera will we're hoping to get this on her schedule. There's been some confusion on the timing, we'll be there as well as chair of the hospitals Committee, to talk about this. This issue, that is on a lot of people's minds, we'll also be talking about the the school construction Authority's ongoing issues at the Washington Irving Campus School, and we are planning. We were hoping for that meeting to do a survey of the schools in Cvs, the sixth zone and perhaps outside the zone in the council. Members districts and the most important data point it turns out for that survey would be the number of kids number of families that have left our schools and that information will be available until the end of October. So we're postponing the survey to to address that and in addition, there was a quarterly meeting of the Community Advisory Board, the cab for the the Acs administration for children's services center on First Avenue, and a couple of interesting things thanks to Azia came out of that and the one that struck me. The most is that you know it gets a lot of reporting for problems with the older kids, but actually 99. When you look at the data of the older youth at the center are coming in and leaving without any issues in the community, they have their own security. They have a police radio connecting with the 19th with 13th rather precinct, and you know, kids, there are going to school, their parents based on parents, decisions as to how and where they go to school. They have enough computers to keep them doing remote and thank God. You know not no Covid-19 positive tests since June, despite coming in who've traveled or been around a lot of places. So it was a very upbeat report from from the acs that an aussie or anyone wants to add to it. That would be. That would be fine. So that's that's my report and summary for this evening. Great thanks, John all right, so we'll move to Claire Brennan for transportation, hello, everyone! I will keep this brief, because it's a late night already, but we do have two resolutions to Dis to vote on so the first one. We saw a really great presentation about rethinking reimagining the area under the Fdr Right by Glyph Park, and we just want to this resolution is to kind of encourage folks at a few different agencies to consider redesigning this park when if they get funding to put some projects out there yeah- you read the resolution. So if anyone has any questions, I would be happy to answer them, but I think it's pretty self- explanatory. Thank you gene for writing. This resume questions for claire on resolution. 8A. Okay, please vote! If you have not already and Clair8B and then the next one is asking DOT to install additional red light and speed cameras. So again, the information is in the reso, but I definitely have witnessed a lot more speeding in the neighborhood and we as a board have identified 27 dangerous intersections and there's only cameras at five of them for now. So this is kind of a you know: additional push to ask Cot to install them in our district. So again, if there are any questions happy to answer them, okay, see none! Oh jim, when you say there are 27 intersections that are dangerous and you only see red light cameras at what six you said: five yeah. Okay, five! Is that I'm sorry I did not see your resolution is that incorporated in the resolution, those that data? Okay? Can we note that for the budget committee so that this kind of stuff can go into the capital budget for the current year sure Jim to clarify the the contents has identified 27 intersections with only five red light cameras or only five locations with red light cameras? The 27 intersections we've identified from an old report, but it's that's not the locations are not in the resolution, those 27. we do have that information. I mean it's not in the resolution right, but for the for the new budget cycle, something like that, I think, should be included in the in presumably the capital budget. I do not imagine these cameras last less than what is it two to three years, something like that should do on our budget. You know capital budget priorities and we should do that with all our resolutions and anytime we're requesting something specifically from the city. We should include that resolution. You know whatever is requested in our capital budget priorities, if it's not big, if it's not urgent enough to make the cut for whatever limit we have on those on those budget priorities, we should still you know, keep it on the sideline and let elected officials know that this is something we need Jim. What the biggest issue with the red light cameras and the speed cameras, is that there's a state cap on the number of them? So it's less of a budget issue. At least our understanding during the committee discussion was that it's less of a budget issue than it is getting the state Senate and Assembly to raise the cap and get more of those allocated to our district. That's right all right! So yeah, please vote on like resolution, I'm sorry 8B, and so, if we have can the office tell us if the digital ballots have been submitted? I'm not sure if you can tell that was the last resolution, so everyone can submit their ballot and we can sema can call out the missing ballots after they're coming in most of have been submitted. So it should just be another moment: okay, while we're waiting, it might be good Jim, since you're interested in perhaps the budget implications of resolutions that are passed I'll remind you and the budget committee. We do have the resolution database on our website and all the resolutions are posted there for the last three years and we're working on getting earlier years up on there. We invite the budget committee to at their leisure look through those resolutions for anything absolutely interesting. Jesus is there some column or some way we can designate items that are requesting additional expenditures or either for the for the expense budget or for the capital budget is there is, can we maybe add a column to what is an air table? You have yeah, we, the committee wants to talk about. You know what that column would look like, and criteria would be be in effect there. Then we can see about working with you guys for establishing that yeah. It just makes it easier to sort out. You know: okay, we need to put up the elections ballot again, so I'm hoping everyone has submitted their resolution ballot. We're missing two people who have who are present, who have not submitted their resolutions ballots. Do you want to privately chat them or sure I'll, send them or shout them out? Shame them public. One just came out so we're down public, shaming I'll, send this person a private message once oh and it's coming so okay. Now, okay, we've got all of the votes for the resolutions and all of the resolutions passed, I can read the vote counts or we can do that at the end. Yeah like we can do that, then, let's put up the elections ballot again all right. One moment: oh, I guess that should be Rick. I should let Rick nope you take it okay! Well, that's just that's all I'm going to post in the chat! One! Second, sorry can I just Claire. I did not I hate to do this, but I do have to get the door. Oh yes! Oh I'm, sorry, I'm like moving it along sorry. I understand I'll be fast. First of all, an announcement, a change to our committee starting next month we're going to be now public safety and transportation. So I'm going to chair along with Matt, who has graciously agreed to support us in continuing this work and of course gene will still be vice chair for us in the committee. Secondly, really quickly, I just want to encourage folks to ride the subway ride the bus. There was some misinformation early on that it, you know, was maybe a hot spot or you would get covered from doing it, but they show now that it's really what you do after riding the bus that transmits the germs so get back on the bus. Please- and finally, I just want to echo everyone what they said about molly being a chair. You are like an inspiration to us all, and especially the women on this board. I was so happy to you know, learn from you this whole time. So thank you thanks claire for everything, molly could, I add something there. Brendan has the the information, the articles and data behind what Claire was talking about the subway and transmissibility of Covid-19, and it might be a really good idea if the office could share that with the rest of the members of the board, because the committee all has it yeah. That was good. That was a good report. I tweeted that shared that, like that, I think it was really important. Thank you. Okay, all right, so we have the air table posted again for a second round of voting for the position of board chair only so please vote. I think Raj has to make an announcement about this. Oh okay, raj, not yet we're getting in votes. So please everyone continue to vote we'll. Let you know if there's any outstanding, I think we just have to check that hi. This is Jeannie. I just would think we need to check with Charles to make sure his vote stands or if he wants to make any changes. Yes, okay, Charles! Any changes to your vote. No thank you do Mm-, hmm! All right! Vote votes are coming in molly. Perhaps while votes are coming in, we could move on to older new business and okay. I do not know if there is older new business. Usually that's my that's everyone's intro to start like closing out their zoom account waiting for. Is there older new business anyone yeah? Thank you Claire for saying that about Matt and the change of the board. I had that in my notes for my chairs report and I failed to announce that, but I appreciate your so while we're waiting, I just it's Pam. Can I say one thing? Yes, please. I just want to say how very helpful brendan has been in the in this meeting that we had and Jesus as well, which, as I said before, could have been very contentious and they did a great job, as did Kevin in organizing all the comments that came in. I just want to express my gratitude because those meetings are as successful as the planning and execution and Brendan is a detailed guy. I agreed we have a great staff who the office makes. Everybody makes us all look good well, and I was going to say pam that for your committee meeting and Corinne's that they were kind of controversial or very big meetings, and we should talk it. We will talk it exact next week about how to do that, because there's it's a fine line between letting people speak and letting people do Q&And a and if there are 50 questions pouring in you know, like kind of where's, the balance. Do you want engagement, so we really need to be inclusive and be sure people are heard, but sometimes it's you know it needs to be managed a little bit. So that's a trick to that. I see. Rick Eggers has his hand raised Rick. I just want to make sure that people know after you cast your ballot. Please stay in the zoom meeting in case further action has to be done. Yeah I can't get back into the zoom meeting after I voted. I have to exit this and come back in oh you're. In the zoom meeting. I think he's saying like just yeah you're in the meeting he's just saying like the air table they might, they might have to post. I know I'm saying after I voted. I was out good, that's good! You did it right, you did it right. Yes, thank you for coming back we're waiting on the 57th ballot. We we're just waiting for for two votes, though I believe Raj does have an announcement. Well, maybe the two contenders should sing and we'll see which one sounds better. Actually, one thing that has not been raised: molly you've committed to a peaceful transfer right. Yes, I have good point. I refuse to leave. No I'm happy to hand it off okay, but I have it claude's refusing to leave all right so cody does it look like we are still missing two votes from people who were present and who voted the last time that I sent both of those people a message with a link to the to vote. That said, I do believe that one candidate has achieved a majority: okay, yes, okay, so I'll give you the the numbers and the announcement. So what we have now is kyle has 23 votes, Asia has 18 votes and there were two abstentions. So Kyle has achieved the majority all right. Congratulations guys! All right! Congratulations! Congrats! Congratulations! Good! Luck! On Us! Congratulations and we'll continue to work to claude's question: hey! That's! 43! Votes there were 45 people who voted the first time there were 45 people who were marked present during the first roll call vote right, which would mean that 23 is a majority yeah but for some reason we're missing a few votes. We are missing two votes from people who voted the first time and I did send both of those people a message. A direct message on the zoom chat asking them to vote. Are they? Are they still in the meeting? Make a difference to the outcome of the I know, but we want to know if they're going to vote or not yeah yep, I can send another direct message if to both of those individuals call them up. Are they still in the meeting? Oh no question everyone stopped here. Let's take a look, it's message went through. They should be here, yeah, yes right. Yes, both people are still here, come on raj. Do it I'll vote in my other, alias hold on hey. I think it's okay. I think we can move the agenda and I'm sorry we're missing. People are not voting nothing, yet you call them out. Those two people have voted. I mean, if that, that's up to you, I can or have that promoted. I can. I can read their names or Josh can read their names still waiting from the other precincts yeah. Thank you, Asia! Thank you Kyle. That was that was exciting and a little. You know that was a little weird that there was a time. That's never really happened, but hopefully we can. You know it speaks to how highly you are both thought of yes, yeah. So all right, so we will do the second roll call and we can get the heck out of here. So seema you're up I'm up. Okay, give me one second to pull it back up. If I could just ask everyone to just verbally say if they're still present, that would be great. Give me one second to just open this back up, I'm sorry, guys all right Kyle! I died. President Asia Paladi Martin Barrett President, Alvi, Barroso, Russon, John, Barron, Bomb, President, Matt, Bondy, all right Matt's, not here Claire Brennan, here Jim Collins, Yep, Dan, Divine, President, Beatriz, Desmond, President, Janine Dinofferia, here rich eckers, here, Charles Fernandez present Andrew gross President Adam Hartkey, here molly hollister, here, Paige judge here: Youssef Khalid here, John Keller, President, Abigail, Cruzmark, President, Anton Mullner, here Matthew, here, Sandra Mckee, here Wells Magaly, here Richard Mintz, here Karen Moore, here Philip Napolitano, President, Matt Roberts, here Jean Santoro, here Frank Scala. He was absent the first time. Thank you, Laurence Shearer, here Ann Seligman President. I am here Sean Sherman here Sandra Todd, here laddie Simon, here, Madeline sims. All right. I think she was out Susan Steinberg here on Jusurish here, Mark Thompson, here Corinne Vanderdon, here Brian Van, Neufenhoeven, Pam Vassell, here Ronnie White Ronnie. I think you were here. Ronnie was here the first go round yeah. I know she was okay, claude Winfield. Thank you all for allowing me to serve you for almost two decades. This vice chair and present. Thank you. We love you clyde. You still have until the end of the month. So you're not let off the hook yet yeah and we know he's here. Look at that thing behind him. Wait a minute! That's pretty awesome reset certificate. No, that's not appropriate! Now, I'm still in the board. Last year, the gold watch that's better. I just wanted to chime in and just think I just echo Clara actually and molly. Just you've been an amazing leader and amazing role model for a lot of women in the community boards. I just wanted to extend a heartfelt you know, thank you for your leadership and your time with me specifically really appreciate that great job for those of us with the x chromosome or the Y chromosome too, not too shabby okay. So I think we need. I do not know if it's cody or who wants to just give us a tabulation of the tallies or sema. I'm sorry is that you or do we want to go over just, but I know, there's just a few resolutions just to say that they all have if you'd like. Okay, all right the budget resolution 1a was a vote of 42 in favor. Two opposed one abstention and zero. Not entitled Bossa 4A was a unanimous 45- 0 vote. Bossa 4B was 42 in favor. Three opposed zero extensions and zero, not entitled transportation. 8A was 43 in favor, zero opposed, zero abstentions, twon't entitled and transportation. 8B was 42 in favor. One opposed one abstention, one not entitled all of the resolutions passed all right, great work, everybody! Thank you all right. So I think we can adjourn the meeting again. Congratulations to the new executive committee and we will. We will see you very soon. All right have a good evening, bye. Okay, thank you. Molly for everything. Bye.",
            "summary": "We're live here at Manhattan, Community, Board, Six's, October, 14th, And I'm molly hollister CB6, chair and We're joined by several public members as well and elected officials.\nWell as many as we can obligations and everything we're trying to be careful, considering the pandemic, as you know, we're trying our best here to pass responsible legislation to continue the hearings to hold our agencies, accountable, making sure that we're providing constituent services and just addressing all of the concerns- I want to thank CB6 for bringing people together and having a really great discussion on housing, specifically around people experiencing as neighbors and as a city to kind of improve people's lives and the conditions of our neighborhoods.\nI'd like us to be a little bit higher in the kind of ranking of the City Council, and I know that Katie's also going to go over a little bit on testing and tracing Thank you, sure, hollister, to tell you that it has been an absolute pleasure getting to know you over these years having you in leadership, having really honest conversations around issues related to racism and policing and housing and homelessness and having you lead this community board in a way that with dignity and with respect for all people.\nThank, you, molly Katie's, going to give the report, I think you're a great person and a fabulous chair, and I wanted to just be here to tell you in a pandemic, you can bump into molly on the street and it's an absolute good thing.\nThe first time and then extended It means that small businesses in our neighborhood do not need to have to worry about losing their entire life savings when it comes to being closed right now, and that was a really important one.\nHere is going to mean we can figure out how to make it work best for our community and other areas, and also making sure these businesses will stay in business at a really important time.\nSomething we'd really ask you guys to take a look at as one way one tool to be able to help small businesses at a time where we really need it and one of the ways we're trying to be most creative to view this problem being in the most holistic way, so that all people in the sort of pipeline here when it comes to our city and the properties and the small businesses are all being part of that same conversation.\nBut, not far away where the mayor proposed to displace folks in a family, adult family shelter that had opened up right when I came into office and have been really a good partner in this community and a home for these folks as they look for permanent home.\nYou can't afford a department on that, so people stuck in shelter system when they should be in housing and when they're ready to be into housing, so we're really trying to expand that it's obviously a little fiscally challenging right now, but a few bills we've been working, on.\nRight now, I'll be happy to just to send you more information to your staff, but I insofar as is extending the moratorium, I would exclude garage operators they're frankly making out like bandits now, because everybody that comes into the city now is parking.\nI heard stories from like restaurant owners who had poured their savings into a business and wanted to make sure that they were not going to leave.\nEveryone who's ever worked with you as chair, has such incredible fondness and respect for your sense of purpose, professionalism, self, deprecation and just overall, really good mindset about how important your work and the Community board's work is to making government work for the people.\nAfter all, the foot traffic there has disappeared through no fault of these businesses and the MTA in the state of New York, I believe, needs to set at the right standard, much like police officers who wear masks the MTA being a landlord needs to set the right tone and relationship with their commercial tenants.\nIf you're a gay man, you can't do it because of the FDA regulations, but hopefully we can make that point with our give for a gay blood drive and then finally, I wanted to mention a new bill that I introduced called the fighting underground racing and our streets act or furious act which is going to expand our use of the city's speed cameras during off hours to hopefully catch those thrill seekers and jackasses that have been drag racing and street racing during the night, keeping us up, making our streets less safe.\nThat sounds like a lot, but we hope there's federal aid coming soon to New York, and we want to create the mechanism to share that aid with our impacted commercial tenants as well as small landlords.\nNow, the most important of our election is just over a month away and please make that plan to vote mail early or in person just in time.\nWe also just had an election information session where we're lucky to hear from Attorney General James Democracy NYC vote, early, New York and the State Board of elections.\nThey're going to be basically cardboard, they're going to be colored, they're going to look like they did in high school or grade School, or what have you, but they will be safe, you'll, be able to drop an absentee ballot at any early voting poll site or any election site on election day.\nI worked with Manhattan bro president Brewer and Council member Keith powers to ask the mayor to allow outdoor dining, rather than just having people drinking on the streets without any protections whatsoever, and so he did that.\nI, just hopped on Google maps, so I can see that the big hole in the ground in the middle of the block, that block looks pretty built up so If you want to email me policy at benkaylos.com, I'll work with you, I'll support, Councilmember powers, office, and let's just the thing that will helpful to know.\nWe have worked for over a decade easily serving the communities of the side, and I know that you're we're going to continue to work together for a long time to come?\nSomebody, remember, gottfried is really encouraging everyone to vote in person He's very concerned about all of the noise being made by some people to challenge the results if they do not turn out the way they want, and we think it's important that there's a clear popular vote mandate on election day, itself.\nHow to vote absentee just make sure you have all your options and on October 29th we have a manhattan- wide virtual tenant, resource, Fair, it's going to be in both english and spanish Sponsored by Council, Members, Diana, Ayala and Udonis Rodriguez, as well as HPD Hispanic federation, a couple other great organizations.\nSo, all so we'll borough, President Brewer is on A couple issues that we're working on one is that we all know about voting but, as others have pointed out.\nThere are 37,000 poll workers, some work where they can walk, but others, I think, are going to need the subway or some way to get there at 5 A.M, because the subways are closed from 1 to 5..\nSecond issue, is, I know this is way in the future, but I just want board.\nI think that there has to be a plan for police community relations, and so he probably saw he nominated three people to do that, and my understanding is that the each borough was going to have hearings and so on, and so forth.\nYou are inspirational, also, and I want to thank molly and Asus, and everybody who makes this board work.\nJust today, the Comptroller Controller Scott Stringer unveiled a comprehensive overhaul of Workforce development in New York City, including making CUNY community colleges free for all to build a more competitive and inclusive post- pandemic economy and to better align training with the jobs of tomorrow, with cover 19, displacing hundreds of thousands of workers and rapidly accelerating long- standing trends in E, Commerce, Telework, digitization and automation.\nAnd I can I'm just going to end up echoing everything they said, but since I've been with the comptroller's office since 2017, even before your chair, you've always been a great go- to person for Community, Board, six, and Welcoming me welcoming me to Manhattan And I've, never worked in Manhattan before so.\nAnd I know you're, not going anywhere, so I look forward to continue working with you , Someone confirm cody or Jesus, okay, good, all right, so we'll move the agenda to the any public.\nA, Robert Fouche, who is a resident of the district, would like to speak about double parking on East 24th street before between second and first okay, There is a three minute time limit for publix public, there's a garage that you have to go into to access the garage on East 24th street for East Midtown, plaza residents, so there's been people double parking there And there were some cars that were from out of state that had out of state plate.\nAnd, I know, there's a lot more cars in the city right now, We experience that all over the district, so we'll work on that for you, okay.\nYou know, send it out to other people, we're hoping to get a large crowd to kind of bring awareness to resiliency and communication and working together, community boards and residents.\nThe office has been working to improve community attendance and participation at our monthly meetings and to increase the number of district residents that are subscribed to our newsletter.\nAfter, the fact, corrine and rich of our housing homeless and human Rights committee did a great job, organizing and managing the panel discussion on systemic solutions to the crisis of homelessness.\nCommittee did a great job fielding questions from residents at their meeting where they heard updates from city agencies on large district area, projects.\nAlso love to thank the board staff, as always for their hard work and Rick and to the rest of the elections Committee for putting together a very fair and organized process.\nSo tonight we're casting our votes, not just for the future of our city, but for our Community board.\nAs, chair of the committee, I pressed until acs got the funding it needed for programming and staffing, as well as created its own community advisory.\nThe link to the election of board officer ballot is right.\nSo we have a resolution that you have not yet seen And I'm going to ask if the board can, if the office can please put it up on the screen.\nExcuse, me, molly, there's a second piece to the It. Is that I want to make sure that people have seen that because they were just looking at the table before this?\nThink we're voting on the information that you shared and The resolution that saying we're in support of these budget.\nYou know they have sort of scaled back on their project that they had presented to us early in the year before Covid-19, and so we still need to press our electeds and other community groups to help raise awareness of how to improve and activate the east side and how to get funding for these.\nThank you for all of that, all those open communications, and, I, think, I, think that everyone was being quite reasonable and it knows a lot of work.\nWe discussed this, and this is what was you know, our intent with this, so we put forth encouragement at the Senate level or see our Us senators and also encouraged our state and city locals to work in conjunction with that, but also to have a safe fail plan in case the federal funding does not come through.\nThat's the first item questions you have your ballot, so I'm used to saying all those in favor, but I mean people are saying: bundle, So yes, please vote on resolution 4a and we can.\nWe have some time to build up and really figure out how we want to put this together, and that includes calling in you know the Broadway League, for example, to talk to us about what their specific needs are outside of funding and then with the reopening of movie theaters.\nAnd I know that you've been working pretty hard on a lot of these resolutions.\nWe want to make sure that the big ask about you, know federal funding and then also putting it on the right.\nWe just want to make sure that we're thinking about all of these different businesses and the employees and workers that work within those industries as well.\nI mean I, do not know if anyone has been to the Times Square area, The resolution we've put in a lot of that statistical information as Jim just mentioned, 15 billion from Broadway alone, hundreds of thousands of jobs related to that Venues, theaters, off, broadway, off off- broadway that are included as part of this as well that we just want to make sure people are not forgetting about it and taking action on it.\nThere's no major report again just want to thank the board staff for their support.\nSo I want to thank rich, my our the my vice chair for his work and cody, who you know helped tremendously.\nWe are working with the housing rights initiative to identify some buildings in communities, district, six that are out of compliance and also talking more generally about the problem.\nAll right, so we'll move to Kavitha, Matthews 197A working group, tour, hi, everybody, It , was, I, know that a lot of people in my building and community joined too.\nWe heard a lot about senior housing, supportive housing things like that, we're looking for more input, and we have ways to gather that in the website, which is really just a sub- domain of our community board.\nI mean it's not in the resolution right, but for the for the new budget cycle, something like that, I think, should be included in the in presumably the capital budget.\nSo we have the air table posted again for a second round of voting for the position of board chair only so please vote.\nI just would think we need to check with Charles to make sure his vote stands or if he wants to make any changes.\nBut we want to know if they're going to vote or not Both people are still here, come on raj.\nOne opposed one abstention, one, not entitled all of the resolutions passed all right, great work, everybody!"
        }
    }
}