{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UC_zta3-7PWzbHgdFdDiQRRw",
            "title": "Manhattan Community Board 10's Park \\u0026 Recreation Meeting",
            "publishDate": "2020-05-27",
            "shortDescription": "Manhattan Community Board 10's Park \\u0026 Recreation Meeting",
            "lengthSeconds": "1:27:41"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "3ho3uu6gh-w",
            "fillerWordCount": {
                "uh": 2,
                "um": 15
            },
            "readTimeFullTranscript": "45 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "park": 22,
                "place": 21,
                "exhibit": 20,
                "subcommittee": 17,
                "space": 17,
                "situation": 15,
                "parks": 14,
                "member": 13,
                "notice": 13,
                "task": 13
            },
            "wordCountSummary": {
                "subcommittee": 6,
                "park": 5,
                "exhibit": 5,
                "justice": 5,
                "space": 4,
                "kind": 3,
                "history": 3,
                "place": 3,
                "project": 3,
                "situation": 2
            },
            "fullTranscript": "You good evening, everyone we'll wait a few moments to see if other people are joining. You, okay, I'd, like to welcome everyone good evening. I think we can get started now good evening care enjoy. Everyone can hear me if you can hear me just raise your hand I see. Some people are anonymous, so I can't really see them hope Taani, you can hear me. I can hear you Karen. Can you hear me good? Okay, I just like to welcome everyone again and we could just make introductions from the board members, the I'm, sorry, the committee members and board members. That would be great, so let's see should take. How can we do this? Can you unmute people cheek Karen? This is Karen Dickson. Can you hear me themselves the board members how youssef all right good evening this is Karen Dixon, I'm, a board member and a committee, honey you're, a muted, okay, hi everyone Danny, a pushy civil rights attorney and also CB 10 member, and here you, oh, my I, see that you're unmuted hi. This is all my areas: I'm a new board member C beaten, any other board members hi good, go ahead. Karen I just wanted to make sure you can hear me. Yes, I can hi good evening everyone. This is Karen Dixon, I'm, a board member and I'm, a member of this committee and several other committees. Okay, everyone as well good evening. This is Milan, Reed I'm, also a board member and new to the board good evening. Everyone. This is our Marcus Wilson, a new board member. Yes, we have Barbara hi Karen I, probably, would you introduce yourself? Yes, hi I'm Barbara, Nelson I'm, a member of parks and recs and transportation land use committees I've been on the blood all about five years. Thank you, Karen. Were you able to hear me Donnie? Okay, awesome. Thank you. You're! Welcome any other board committee members of board members. Okay, can we go to our guests now I see we have you step I use of Salaam, one of the exotic 85. Thank you any other committee members I mean of community members. Oh, this is Sharif Salaam musil's brother. Thank you. I'm on desire. No hello, see we have Mari on yes, hello, Mars, one of our board members, any other board members or community members would like to introduce themselves. Okay, well, I'll, just introduce myself. My name is Karen Ori I'm, chair of Parks and Recreation for CB, 10 and I am also a member of the Transportation landmarks and Historic Preservation Committee and I welcome everyone and I hope. Everyone's family is safe and everyone's staying safe in this very unusual time so and I just want to also give a shout out and offer prayers to those who are on the front lines and who are and for those families who have lost family members and for people who are recovering I pray that they have the speedy recovery I just like to begin with our agenda, which is a cold big. Nineteen update for parks I'm just going to read this take a couple of minutes, but this is just to give us some brief background on what the updates are for the park. So as a Thursday May 21st, this is the update on city parks are open. The Parks Department is asking that all park. Goers. Take extra precautions to stay healthy and safe, so exercise is okay. Team sports, such as basketball, football, softball and soccer are not permitted in the parks at this time, and we're asked to please maintain at least six feet of distance between yourself and others went outside and avoid congregating in groups. The park restrooms are open, they're cleaned that the Parks Department is cleaning the restrooms daily with appropriate cleaning products to ensure that they are being fully disinfected. Restaurants located within city playgrounds, however, are closed until further notice. Many events being held in the parks by outside groups are being cancelled or rescheduled before attending. Please check with the organizing group to confirm New York City will continue to distribute face coverings in parts acrosss the city free of charge through the social distancing period, all city playgrounds are closed until further notice on all New York City parks, recreation centers are closed to the public until further notice, any memberships will be extended and they will run through they'll cover to the length of time. We're closed. I'm, sorry and they'll be extending all memberships to recreation center members to cover the length of time they have been closed. The recreation centers have been closed. City beaches are closed for swimming until further notice. However, walking running exercising and access to the sand and beach sand and boardwalk are still permitted during regular Park hours. Barbecuing and gatherings are prohibited and grilling areas are closed. Basketball handball and tennis courts are closed and locked all basketball, rims and tennis nets have been removed. Bocce courts and volleyball courts are closed. Escapes skate parks are closed. Dog runs are closed until further notice. Our parks remain open to dogs and pet owners to get fresh air and exercise out the parks off the leash rules still apply, but we're asked to note that the Center for Disease Control recommends that all dog owners keep their dogs on a leash and maintain at least 6 feet of distance from other people and animals all city nature. Centers are closed until further notice. As a precaution, the High Line is closed to provide a staging area for first responders short trottin, Fort, Totten Park is closed to the public. All city nature, centers, are closed until further notice. The city's historic houses are closed, which would include Roger Morris Park Dyckman Farmhouse park in Queens farm park. They are all closed. The Arsenal gallery is closed until further notice. At this time. Most concessions are closed, including ice-, skating, Rinks, amusement parks and carousels golf courses, indoor tennis facilities, souvenir shops and more I'm just asking if someone would mute their mic. Thank you. Farmers markets and gas stations remain open. Customers must practice social distancing, a few snack bars and restaurants remain open for takeout or delivery. Customers must practice social distancing for the health and safety of the horses. Stables will remain operational for close to the general public programming cancellations in response to the state and cities directive. All public gatherings in our parks are canceled through June 30th, in the interest of the health and safety of all of the city's patrons of New York City Parks. The parks are not accepting nor reviewing event applications for any special events or field and court permits until further notice all shape of New York City programs are canceled until further notice. Please follow shape up the city on Facebook for news on upcoming free online fitness classes and fitness opportunities. Adventures NYC is canceled urban park rangers are canceled all tournaments and sports practices are canceled, while special events held in recreation, centers have been canceled, New, York, City, Park stewardship events have been postponed until further notice. Programming service changes, New, York, City's tennis season is delayed until further notice. Tennis permits sales have been suspended for the 2020 season. If you all already have you've already purchased a tennis permit, it will be valid through 2021 green thumb. Community gardens are closed to the general public until further notice, gardens are open to garden members only at the discretion of each group and only for absolutely necessary maintenance and season preparation. Thank you for your patience and listening to those updates. Well now we're going to our first is not adding to have someone to a presentation on the open streets, but we were not able to make that happen. So we did. This will just be a discussion so and I'm going to ask a Jenkins is present. If you might be able to speak to the open street situation. Is he present? Okay, Derek, sorry I'm, president Derek is president? Would you be able to speak to I know that we have an open park situation which is on the Colonel young playground, which is on one 43rd Street between Lenox and 5th and I'm, wondering if you've experienced that, since you are, you might be over in that area? At some point, no I have not sorry all right, so we have two I know unless you take explain it and give us some information on that. There's one Derrick. Can you mute your mic? Thank you. So this is one 43rd Street between Lenox between out Malcolm, X, Boulevard and Fifth Avenue, it's open from 8 a.m. to 8 p.m. and it was open as a May 23rd and it's the full block which is which is closed off to the radicular traffic. And then we have West 138Th Street between Malcolm X Boulevard and Adam Clayton Powell Jr. Boulevard same thing closed as I mean open. As of 5:00 May 23rd from 8 a.m. to 8 p.m. and then we have areas open in the surrounding boards, 9 and 11 Shoetique. Can you add anything to that? Hi, I'm, Miss, Dix, miss Aureus, Juanita city does not learn. Oh hi Juanita I need. Would you have any information on the open streets? No, okay, all right. Anyone else in Barbara, all right so I mean I. Just had some questions myself about open streets. I wanted to know how that was going to be working. How do we make sure that people are social, distancing, I know we had some issues before with flash crowd, that's something that so I you know, and what is this signage? That's going to be available and I'm just wondering if anyone else has any questions, we are going to be getting a presentation to the to the full board. I believe was a at least the executive committee. Anybody else have any other questions or concerns about open streets, I Karen. This is a. This is more because actually I had question your garden, because I went through while I live on 138. My concern with the location on 138th was that we already have testing at Abyssinian going on and then there's also the it's so allowing parking on both sides of streets and there's also no sign it's just literally just the police barricade there and nothing that shows it's an open, Street location. So that was my concern with that location and then, on the same for 143rd, there's literally just the barricade and still parking. No one is thinking it's an open, Street location, so yeah, okay, those are good points. You know, I think we need to have some structure around these open streets, any other comments or concerns. Okay, so I think these are some issues that we can take to or bring to the board's attention, and perhaps we can draft a letter or something with these concerns to see if they, if they I mean they did they shoot so that they can be addressed. So how did? How did the committee members feel about that? Can I get some feedback if you are, if you're a committee, member and you're and in favor of this please just raise your hand electronically. Okay, I siept Suhani and I can't see everyone, so we neither can you make that information available Juanita well needed. Can you just make a note of all the hand? Arrays I'm? Sorry, it's my dog grandson. Sorry, okay, thank you Juanita. So with that I think to the next item on the agenda. Looks like his going along pretty quickly and that's going to be honored guests, the exonerated five and a associated exhibit in Central Park. So we've been having ongoing discussions for the last two meetings. Two months now since March and April we met and we discussed it and we are still working on forming the subcommittee for the group. We were able to thanks to Yusef. We were able to include to reach out to one other member, and that was Raymond Santana I'm, not sure, if he's on this call, but he was invited so we're still reaching out to the other three members, and hopefully we can get them on board as well. So this evening we just would like to discuss further how we can bring the people that we need to have to this discussion, and it was it's a very multifaceted discussion and we want to make sure we include all of the opinions and address as many or as many opinions as we possibly can in order to facilitate, which is what we're doing. Is the community board to facilitate the bringing this exhibit to fruition in Central Park, so I sent out the minutes. Everyone should have gotten a minute from last month, as well as the ones from March. So with that I'm going to open up the discussion to committee members and I do have a few focused questions and I just like to preface this by saying that this is the start of a journey and a long along this journey. We need to bring be as inclusive as possible and as diverse as possible, because there's so many opinions out there and we want to have a consensus, but at the same time we want to respect the family, the members of The, Exonerated fight and the wishes of their families. So that is, that is a priority. What does the family feel comfortable with and what matters to the families, and then we need to take a look at how the city perceives this situation and what and what the content would look like from the city's perspective as well and I'm from particularly a rent folk, a focus on social criminal justice and how that is so important and so integral to our community and how we need to be able to use this as an opportunity to educate people on what their rights are and what's available, what recourse is available to them and what resources are available and how do we bring the abstract to the concrete? How do we bring these ideas to a physical commemoration and what is what will be the specific content of that exhibit or the idea and we're just trying to get people to think together? So, even though we may have some diverse opinions, how do we bring that all together so that we can address as many of the concerns that people have as possible and I may be being a little too broad? So, please, you know, feel free to critique anything that I've said so and as a part we which we had been discussing earlier on that as a part of our efforts in this, that we should to a panel discussion. We have someone mediate the panel discussion and to bring about these ideas into to begin to Melt meld all these ideas into one as much as possible. So with that I'd, just like to oh and also another point that was raised is how do we bring the experience of the community into the presentation of this exhibit as well, because the community, particularly our community, was impacted as a result of what happened with The Exonerated 5 and how it had an impact which is even affecting us now. So you know how do we bring that experience into this as well? So who would like to comment or start to start this discussion off? There's someone who has so many comments, but let me just start with the families, Yusef Sharif and Sharon. Thank you so much for being here. Would you like to just tell us how the family perceives this and who you think the pertinent stakeholders should be at the table and if you've made any progress in identifying or reaching out to stakeholders who, you think should be involved and be a part of the subcommittee Oman? Your microphone is muted, okay, well, I have reached out to people and I. Think I did pass on some names and numbers of various people who had shown an interest in becoming a part of this situation, because I did speak to the Harry Belafonte stream, who was very interested in this process as well and gave them a number I think I. Think because they were you know we got this reminder kind of late, so maybe that had something to do with them and others not being able to get on the call big, because we can get the information until today. So you do not really know what their schedule is, but they are really very excited to be a part of it and want to be a part of it and want to really move forward. Not only all the belafonte team, all the people in the community we've spoken to about it and they are all so interesting and this being a very successful project. They see it as a win- win situation for the community at large, something that the community itself can benefit from and not just a top- down type thing, but something that can be lasting, something that's, educational, inspiring. That helps them to understand. Not only the situation in terms of the exonerated five and their families, but also moving forward understanding. All the issues related to justice and other types of situations that occur in our community by a collaboration of different types of events that would go on within that community space I know we had talked before regarding the space acrosss, the street, from Central Park the prison and that space, possibly being a house for some of the educational processes that would go on regarding this in the park itself. But we are looking at other kind of ways to bring all of this together, because we really want the community to be aware and be involved and feel that this is kind of an open area where they can come in and get information and participate fully in the discovery of what's happening and what has happened going forward as we move toward the you know, things that are happening. It would be a very important thing. I do not know if we have or if there exists within any community, a center of information that is geared around justice and collaborative effects of that justice procedure on the community that is around that space. So it would be a great opportunity and, as I say, a would not win situation for essential talk, because I'm sure that people will come from all over to experience it to see it, and probably some of them might try to emulate it within the various communities from which they come. Thank you and I just like to say that that's brilliant I think that some you know that's out that that's what I'm saying- when we last spoke. We would look at Harlan, Community, Development, Corporation istic suggested some other sites as well. One was the new National Urban League building, that's going, that's being worked on and Mart one two five, but we've also. We were not sure what the situation was with the correctional facility Rubin. Would you be able to address that what the situation is with the correctional facility? Hi Karen, unfortunately, I do not have the latest right now. But let me let me circle back with Curtis and then I can follow up with you tomorrow. Okay Dixon I can address it. I we had a housing land use meeting last week, Thursday and Mr. Archer indicated that the RFP for the Correctional Facility has not been released yet so that is still on hold and they're still trying to get the Urban League project started with all of the C's construction activities there so trying to get that off the ground. Thank you, Karen and I. Just that what we could we would like to do is to I think what might be a good idea if anyone who has stakeholders that they have in mind that they send that contact information to the office to the Community Board office. We can then draft a letter to send out a letter of invitation to them to participate in or be members of the subcommittee, so I think that's hope. That would be very helpful, also and I just like to apologize. The reminder went out this afternoon. I did send out an email a couple of weeks back from just that the meeting had been rescheduled, so we were hoping. People would have put it on their calendars at that time, but because of the holiday and everything it just went out, the reminder went out this afternoon will try to be made a promise. Again. We apologize for that. Someone else went to one of the family members wanted to, or you said, I see your mic is muted. You want to speak now, so one of the things that I was thinking about was being able to weave in what happened to us into the greater concept that was happening to us as a people in this country what's been happening to us as a people. So you know appreciating the fact that it happened to me and my family and appreciating the fact that it happened to the community at large, but that this is still going on. You know I was on CNN earlier, and we were talking about how you know here. We are now 31 years later after the Central Park jogger case, and we're still now discussing the fact that an officer just killed a man in Minneapolis by having his knee on his neck. You know how in Central Park the woman was saying that she was going to call the cops on that black man. Everybody saw the video. She was going to tell the cops that he was menacing her and he was a black guy and so for the song like how this whole thing we're watching the video in so some is surprising and to others. It's like this is what we deal with all the time. You know one of my friends reached out to me via text message and said you know. Unfortunately, the experience in America that we have is that when they cry we die that's right and so trying to figure out how it's not like this, the what was known as the Central Park jogger case should not be thought of as an anomaly should not be thought of as oh. That just happened to those folks- and this was just a one- off kind of thing, but should be understood that this is the struggle that we're fighting against and have been fighting against, and this effort that we're trying to bring forth with this exhibit is an effort to really challenge the way things have been to shift the norm. If you will so that we can begin to push forward we're using this as our piece to add to the true freedom, justice and equality of us as a people as opposed to you know, just saying hey, it happened me. We want something that speaks to. You know the exonerated five yeah, you know, I think it should be that, but it should also be like because it's us now and it's relevant now, but it also should tie in and interwove and to weave into you know. Yesterday was Emmett to you know before. Well, yesterday was Tamir rice, you know Trayvon Martin yesterday was the young lady right that they went into her home after they had already arrested someone and they ended up shooting her down. You know thank God. The boyfriend was able to get freed from any criminal charges by the judge, but he would have been looking. You know he was he was. He was looking as a person who was instead of being innocent until proven guilty. He was looked at as person. I was guilty and had to prove his self-, intersect, yeah I think that is some it's just you know we do have to establish that this is a pattern. This is this is the norm. It goes back to even the Scottsboro Boys and all the lynchings that have taken place. I mean it's just since we've been in this country, we have been experiencing this pattern of violence and injustice and I think that incident yesterday was just I mean thank God for a video camera I mean for the telephone camera, because that woman was in Seoul in violation of so many regulations that have been put in place during this pandemic that she should be. You know she that should be addressed as well. I do I did T see that she had some consequences, but you know people need to know that they can not use the law frivolously like that. You know so you know I think that should be addressed. I'm sorry I just want to add this other piece too, and this is the part that I think is the more the there there's a certain evil. That's going on right and then evil that I'm trying to get to and describe has to do with everything that we're talking about everything that happened to us, but also has to do with the fact that you know in this country. We have right there in the founding documents as a 13th amendment that okay yeah, we abolish slavery, but for the punishment of a crime we can turn you back into a slave and so as they go out and they go out and say they're policing and they go out and say that this is you know, part of government and part of this and part of that. You know how all of that stuff is playing a part in the experience that people are talking about this hashtag that was created. This is America. You know the legal lynchings that are going on and all of that stuff you know so I just want to add that piece as well, because I think that that's the part for me that takes a larger effort in terms of thought on how to bring that to the forefront because I do not want to just have this be a thing where we're we are the now Colin Kaepernick's of our time or we are. You know the people that are protesting about this particular issue. But this is the issue. It looks like there's all these other things going on, but all of those things are connected and into woven and have been like. You said, since you know, since we were brought over as Chattel Slavery, you know: Dr. John, Henry Clarke said that you know if you, if you begin a people's history with slavery and everything else looks like progress. So even that destructive thought, you know where people are saying themselves well, you know we came up with slaves, you know once we had identified and attached ourselves to something bigger than that and we realize how total destruction totally destructive. Rather even that thought process is for them to even plant in our communities and for our young people to have the idea and thought that it's cool to go to jail, they're, going to jail as a rite of passage that Jewish community. They have a Bar Mitzvah and the black and brown community we go to jail and I thought is something that somebody put inside of our minds and we had the sagging pants, which is some come straight out of that culture. Yes, but you know, one thing to the other thing regarding all of this is that this space could be also a process or space that could is use for healing as well, because many of us are suffering from post-, traumatic stress syndrome and we've not really gone to any type of psychiatrists, psychologists or anybody, but we are dealing with it every day and we think of it as a normal, because we've been dealing with it so long, but all of these types of situations have an effect on us individually and on our community as well like right now we're in a situation where there's a lot of mistrust of the police. So we be able to invite them in and talk about it and try to facilitate some sort of healing understanding. So as we move forward, there's less of the mistrust less of whatever is happening, I'm, not saying that it might be successful, or it will definitely be unsuccessful. I'm. Just saying that it could be a place that a number of things regarding the justice situation and the justice issue can be addressed in a safe environment. I think the mental health is definitely a big part of it very big and it's extensive and it's just and it runs for generations as well. Yes, but we have to start somewhere. We do thank you. Karen had her hand up, but basically I'm listening to you, seven and it's ingrained in when you talk about a rite of passage. It's also engrained when I'm looking at I was always been a business, but now it's truly a big business. So we're not only establishments to ask people. So we do not want you to invest in this business anymore and that's where we're going to run into a lot of pushback, because a lot of people have invested in making this business knocking up colorful people that have not been educated. So I, listen to your mom talk about the PTSD. It's almost like a setup to become a recipient of PTSD like Earth. What you go through the red lining where we live, how we compacted the lack of services, all those things part of the process that prepare or supposedly produce what ultimately happened, and it's sad and it's been going on for years. But we've got so much to address in it that the question becomes. If we in a place or a place where we can begin to heal, then who and whom will help support it is it a volunteer time will come to educate, Well mentor will outreach to the schools, because we really need to talk to the young people on what this system is. We were uneducated until it actually happened to you and your brothers, so there's a lot to discuss but I'm willing to help participate in your task force or whatever I just like to say. We also need to take a look at the school to Prison Pipeline, where the child is not reading by 3rd grade I'm hearing now or fourth grade, and they are pretty much on a path to incarceration and so I Karen I mean sorry- honey. You wanted to yeah I'm here, yeah I am I just wanted to echo what Yusef and his mom Sharon said. I think that this piece needs to be responsive, he's, not a reactionary piece in something long- term and in doing so, to connect all of this story. So I do not know if the families you know if the some family is up for this with others from The Exonerated five would want to have kind of a mapping of the history of basically police brutality against communities of color and the fact that something like just calling it a complaint saying that person, because they're black you know the response that it's going to garner that's going to trigger and I think that if there is opposition to it that the opposition should be documented from where it's coming from to also establish the deep- rooted mindset of not only what has kept our communities down of what is acceptable in which we should anticipate I just being either a rite of passage or a signifier of adulthood, but also the powers that are keeping that status quo in place. So it should be a really all inclusive, powerful kind of very just blunt type of exhibit that forces people to address the truth in reality of what's going on in our city, because, even in decades later, from the exonerated five, it's still happening front and center and much more stronger as well. Thank you too, honey, and then that just brings to mind Jane Elliott, who I do not know if anyone's familiar with her, but she does workshops with people around the concept of white privilege and how that impacts on people to just get them to kind of feel what it's like to be in someone else's skin. Who has to go through that Karyn Dixon, you had your hand raised Karen, do we know I was doing a clapping hand, single symbol to Mrs. Alarm statement, okay, because I'm one need is kind of managing things, so wondering if you can, let me know if anyone else has their they hand raised, because I'm not able to see them. Okay, just say, while you're waiting on the hand raise that see. Part of this is going to be deeply involved in the justice piece, but it's going to be a very educational type of piece as well. You know, and it can it mob, be a space where people can have classes our 10 classes at talks regarding these various issues bring classes in to hear these various speakers now. This is something that, as I would perceive something since it's going to be like a lasting peace, and it should be the type of thing almost like well, not quite like a museum but like a museum, ish kind of thing, but in a different type of way, because it's not just after you're going in to see its information you're going in to learn you're, going in to figure out about various issues that might have affected your life and how to move forward with these issues. You might go in and speak to. Someone in regards to you know something as simple is: how do you select a lawyer or any types of things that would prepare you for new thinking it? It's almost like many years ago, when I went to school, there was a class that they call. What is it like economics, type of thing and in those classes they taught like nice experience type of situations, and they taught you just some simple thing: they did not turn you into a lawyer or anything like that. But at least you knew if you went into a store, you could look up on the wall or somewhere and see that there was a return policies, just basic type of stuff. That would help us kind of move the community forward, because we're kind of in a way stagnated a little bit and we need to be able to move forward positively and the only way we're going to be able to do. That is through knowledge. Now, in terms of the funding I know, there are a lot of people who are looking towards phantoms and I'm. Sorry that the Bellefonte route was not able to join the call today and in the future, I'm sure they will, because they are very interested in this situation, and they are also very interested in the space to turn it into a Justice Center for Education and Social. You know prototypal healings as well, and to have programs and various things that are really needed in this community and then it more now than ever, because the community is changing and as the community changes other things start to happen like right. Now we are experiencing Kovach 19 and, as the mayor, the governor has stated that there are going to be people who businesses will not be coming back there going to be people who will be jobless and unable to fill the jobs that are being able. You know, and there going to be other things that we in our community may experience that other people may not experience, because one of the main things for us is going to be when they open up. Would there be a place for us to take put our children so for those people who want to go to work, they can't go to work, because if there are no daycare centers, it does not make any sense. How much you open up unless you're, taking your child to the work place with you see. Not all the threats in the world can change that, whether they stop unemployment or do not stop unemployment. You know what I'm saying and then there may be people who will need other types of assurances. I know there are documents that are going on and they talk about now how the level of abuse has increased because of this situation within the home, so in addressing that it brings us to other types of issues regarding that post- trauma type of situation, and how do we kind of avoid moving more into it and wiggle ourselves out of it, and so we can move forward in a homogeneous way. Hmm, that is an excellent point and I do think what you're saying about having a paradigm shift in terms of the way we look at things is really key right now, especially with all of these new innovations that are coming about even the fact that, with we're communicating and holding this meeting the format that we're holding now, this may become more of the norm as we go forward and I just want to say also well when it is this someone else who has their hand raised. Yes, miss wisdom has Oh. Terry has done mute. Okay, oh sorry, thank you. You're welcome, oh you're, muted, again one. Neither can you unmute Terry, okay, we got it. Okay! Thank you. Thank you. Very much for giving me the opportunity to speak and to be here with the salon. Family, I, think. There's a lot of discussion. I had questions as to what the potential timeframe is in terms of. When do we expect to complete or have a building a site, something that's tangible. What is the time frame that we're working with? It appears that a task force obviously should be put in place that has the families input, educators, input, medical import, youth input? You know previously incarcerated people's input elders as well as parents that would have a cross- section of people on the task force. But what came to mind- and it would not be as big as that this, but the civil Rights Museum in Memphis really did a phenomenal job of showing some of the things that happen where you actually have interactive things. When you push the button and you see videos, but you actually get onto a bus and it tells you to go to the back and you sit on a lunch counter seat and it says you can't sit here and then, when you finally go through the full tour. You end up in the room where Dr. Martin Luther King stood on the balcony on the shot, and it's a very empowering. You know a thousand- word situation, so I think that if the Prison s right, there is still available. That's close enough, but I think if there's something in the park, a monument or mausoleum type that people could go into because I think the healing part is very important, serene place where people can connect spiritually I do not know if that boathouse. That at one point, was a jazz club. I do not know if, when, if that's available, but that's right there but I think no matter where else you have a place where people can learn and educate and understand and have workshops. There should be something to me: one. The physical Saint can never ever be forgotten, but obviously all of this has to go through a task force and I would think that the time frame is important and obviously based on what ideas people come up with. Is it's a budget, but do we have? This is an idea, I guess conceptually now, but do we have a time frame, but when we would like to have it completed so thank you will I think that, in terms of a time frame, we can establish that once we had the subcommittee, which would be the taskforce that you're speaking of and then we would all and then so that's what the community board is facilitating at this point, the formation of what we call the subcommittee or chance for- and this is our third meeting so I hope that we can get that off the ground. Okay. That was a question. Where do we start the task for us? Yes, so we need to get the names and that's why I've asked it. Anyone who has names that they're suggesting to please forward them to the Community Board office and then we can develop a letter of invitation and send that out and then try to solidify what the subcommittee who the subcommittee is and who is on that subcommittee and then start to move forward and then also and then once we do that, then we can start to have the broader discussion with more stakeholders and more and more of a diverse group of people and I just like to say we have Lane I want to thank you for coming on. Lane I know you promised to be at the meeting, and here you are so thank you. So much Lane is vice president planning at the Central Park Conservancy, and we can't get this done without the Central Park Conservancy in terms of sanctioning with what goes on there, but and also city parks is, you know, extremely important, but we want us from focus right now on the Central Park component and how that subcommittee can begin to develop the content of what would go into Central Park, and then we and then we can also look at the social justice Center aspect of it as well. So Lane did you have any questions or concerns at this point. No and I apologize I just got here a little bit, I. Think after you started discussing so I. Think just people should just be aware that terms of putting anything in the park. It is a very long, complicated process. It's a historic Park. The basic kind of premise is that the park is there to be a landscape. That is there to sort of be a retreat for people to come and use the park. So I think you mentioned. You mentioned the building. That was a boathouse there's. There was historically a boathouse in the park that used to be a restaurant in that location is actually the Dana Discovery Center, which is a building that was built when the Harlem Mir was restored in the early 90s. That does have a small exhibit space that has rotating exhibits in it. So that's a place where there can potentially be programming and I think you know if there's a discussion of kind of anything permanent, there's kind of a long city process for that and the next tation that anything kind of introduced in the park is consistent with the historic character of this place. That is meant to kind of be the countryside for people who do not have a chance to go to the countryside right so, but I know there's a lot of different. You know related ideas. Mrs. LOM was talking about this idea of the Justice Center I know, there's interest in the Lincoln facility, so I think in terms of time frame really going to depend first, as Karen said, on a coming together. Kind of all the stakeholders and discussion of kind of all these different ideas would have different time frames, depending on the specifics of it. I think the most important thing first is to kind of really start broadening the dialogue, as Karen said, bringing more people into the discussion to figure out who, on the city, side needs to come in for partner to partner who needs to be involved. If there's discussion of the Lincoln facility and all of that so I think it's I think this is really I, see it as this is the beginning of a process and it's hard to say what a timeframe is for anything concrete until we kind of get further along in that process. Thank You Lane I just like to also just invite the group to visit the Seneca village exhibit that is currently in Central Park, it's a it's a it's, a temporary exhibit we're hoping it will be extended because we missed out on all this time, because I thought we can pretty certainly say that, given what's going on with I think we were thinking, we might extend it regardless, because that that's a discussion. That's an exhibit that is there as part of a whole community discussion about the idea of something eventually permanent and the fact that it's been interrupted by what's going on now and you know, a lot of people have not really been able to see it. I think we definitely would want to keep that exhibit in place until there's a next step in that in that discussion. So, but that's for people who do not know Seneca Village exhibit if you it's, that the whole area of the park on the West side in the 80s that was Seneca Village and if you do are able to get to the park. If you enter at West, 85Th, Street, there's kind of introductory sign and a map there's also a QR code. So you can get the map on your phone and it points you to various locations throughout the park with all the history. So that's an example of an educational and interactive exhibit as well that you know- and we can also just look at the processes Lane. It said what it took to bring that about, because that was like. That was a long process, but we kind of speeded it up towards the end, but so that's something that we can take a look at. What need? Is there Thank You Lane? What else who has their hand raised? This is a use of just a quick I got ta hop off I'm supposed to be on CNN Atlanta right now. I just wanted to just I'm, just kind of alert you all for that. It's only 15 minutes, I'll, probably try to hop back in if I can, if we're still on okay. Thank you very much. You Stefan we reach out to Raymond, but you can yeah I just sent out another group chat text message to all the guys or give own link and everything. Nobody has yet responded. Okay and I also reached out to the Innocence Project to invite them to be a part of it as well. Perfect. All right so I tried to talk. I'll try to hop back in thanks. You all I, see you all later. Okay, have a good interview. Thank you know. I underst, living down here near the park. I know that space over acrosss, the boat area, the Discovery Center I, know that is placing in use already, and a lot of people seem to love that space and, what's going on there and the music and the stuff, that's a in that space, and this is why one of the one of the reasons why we had thought that the Lincoln correctional facility would be a good space, because that you know that space has been many things to this community. It's been a school, it's been a prison, you know, and it can be even more as you look at it and it probably would be big enough to house whatever needed to be done within the space. That's there and still, you know, maintain itself as a historic piece that is within this community that has moved on to stay within the educational forefront of justice and when you look at the input of the Harry Bellefonte group coming in, and you look at his background and his relationship on the side of working on many of these movements that have gone through that have affected people of color and other people as well. He has a tremendous justice background and I'm sure he sees some of the things the way I do or the way we might all see various things because well he's older than all of us and he's lived through much more. You know he's lived through much more and he's ready to get his hands. What should I say dirty cleaned washed. Whatever way he can to make this a reality, all that is beautiful. To hear can I can I be heard. Can anyone hear me? Yes, okay, this is Sarina I'm, a member of the public on a member of the community and Li say that you know it may take a long time to get something permanent in the park, but I think it's that's an essential part of this project. For 25 years those young men were known as the Central Park High, so Central Park will forever be associated with what happened to them and there needs to be a common and memorial and you know we'll go through the process, but they need to be a permanent memorial that says to that community. We do not expect the worst of your young people. We do not believe the worst of your young people and that message simply must be sent broadly they're young folks, who only learned they grew up in the community, only learned about the innocence of those kids with the recent film, not even with the original Central Park five film right, because the distribution is a divinized project used a different mechanism than the PBS project and I. Just I do not see how we can not make that a permanent part of the history, because it is emotionally a permanent part of the history. We know from watching how the police in New York have responded to those who are not socially distant enough in various neighborhood that the problem still exists and I do not want to say that racism it's going to be with us forever, because there's a human being walking around and Mellon ated skin I know the toll that it takes every day. The recent case where the deputy chief of the police said: oh we're not even going to press charges against her because we had bigger fish to fry. You know it's stunning: she lost her job but sure she'll get another okay and the fact is that if he did not have it on film, would he be in jail now? Would he be dead now you know. So there are certain positions that we have to take certain stances that we have to take. We have to face certain types of behavior are not acceptable and you do it by making a permanent record a permanent record. So let's begin the process, but it's got to happen. Thank you. My name is serene okay, so I just wanted to just let you know that this is intended to be a permanent exhibit right now in Central Park we have the Seneca Village exhibit, which is temporary, but it's also in place to generate conversation and discussion around something permanent. So it's a step. It's a step in the process. It was a major step, but so that that's the ultimate goal to make a permanent, exhibit and commemoration in Central Park to Seneca Village, and this is our intent for the Central Park. Five exhibit The Exonerated five exhibit that it would be permanent and I do not agree and I do agree that we do need to make a permanent record of transgressions when they are when they, when we incur them and I, think that the issue with the woman in Central Park yesterday should even come before our public safety committee. So you know I'll make that recommendation at the executive committee. Thank you, you're welcome. We need. Is there someone else who has their hand raised? No I do not see any okay, so I think that this has been excellent and I think that we have a few steps that have come out of this discussion and I think that wine we need to get those lists of stakeholders together so that we can send out an invitational letter and so that we can solidify the subcommittee for this project. I also just wanted to mention that on the agenda, I have a listing for a voting item for a resolution and I'm just wondering how the committee members feel about this. Do you think that we need a res lucien at this point from the Community board, stating that we want to see this project come to fruition? Omar has his hand raised Miss, ory, okay, so I started to draft something I do not have it ready right now, but I will send it out to the committee members and I probably could get it out by tomorrow. You know because I started to work on, it would be very rough and then we could take it to the executive committee, which is tomorrow, okay, all right, so we'll work on a resolution I'm stating that we want to see this exhibit in Central Park, and let me see what other items other action items we have I had my Henry's just to give an opinion. That's what yes! This is no more so yeah, just as we I do not think I've heard about this specific project or subcommittee before, but as I hear more just a few ideas. I had for the kind of permanent structure would be at first I thought of maybe like a statue and I looked up. There was a statue that was taken down recently, where I think in 2018 for J Marion Sims, but I googled it and it seems like there was an artist awarded that site like come up with a replacement statue already, but I thought like something like that might be an idea where it was like an open space and it was specifically taken down because of racism and I'm, especially towards black women. But so that's one thing I thought of, but then this other image I had of maybe some other permanent structure or some statue is if people are familiar with. The fearless girl statue in Wall. Street I just had this idea of like five young boys as a statue at the entrance of Central Park, maybe like at fifth in 110th, and maybe some permanent structure where it does not block entrances or paths, but something that is like right in your face and I feel like that would definitely attract people for years on. But that would be something if it if we are planning for something else, long term versus just like an in- house gathering. Yes, the you know, the content is something that the subcommittee would discuss and we would and I mean the subcommittee would steer or facilitate what that content would be foot for whatever it is. The you know with what the what format the commemoration would take, so that I mean that's that that's certainly an idea that could be discussed. We did also mention that we wanted it to be educational so and particularly speak to the wishes of the The Exonerated, fine and their families. So we could definitely have that discussion around that sort of a concept. Are there any other comments or discussions? Juanita? Can you see if someone else has their hand raised? Sorry, wisdom, I, believe, how's the hand raised and made a comment in the chat. So Terry did you want to tie I just wanted to also address what was said, and the first thought that came to me was Seneca village, but I think that the park may have a lot of bureaucracy and it may take time and it's a historical place, but we need to be included in the history. We deserve a permanent, exhibit the Seneca village. I mean look. How many years is taken and many people did not even know about Seneca village. You know so I think that whatever the bureaucracy is or whatever the terms are, that the Conservancy is dealing with that needs to be expedited and figured out. You know for us to have this permit exhibit because for many things we have been excluded from history when we have done a lot to build this country and build this city, so we deserve to be part of the historical part of Central Park, and you know it is just critical, so we all know that bureaucracy things can be worked through so whatever it is, it takes to do that. There should be the thought right now, not that Conservancy is telling us about the historical part of the park, and you know it's going to take time and it's hard that needs to be figured out. You know and I think that that's critical, you know a space where we can get education and all those things, but there has to be something in that part. That says, remember. Never to be forgotten, so that's just what my position is that has to be figured out. It's not a answer or a suggestion that should be part of the conversation or something like this, especially when people are doing it today. You know, obviously, whatever the messages and understanding, no matter how many times this happens, Jargon while being black or whatever is all on TV and people are seeing it every second and they continue to do it more Eric garner and they still put their foot on somebody's neck. So something has to be done. This is not regular business. So that's just where my position, you know it's a demand that we have something coming. You deserve and it'll help other people so that people can get educated. People can understand. There's many statues in the park that nobody even knows who those people are. Does it happen so long ago, so I think you know we have to come current and be forward about this, because it's very serious and it continues than that. Well, thank you. Thank You, Terry and I agree and I think that we as long as we stay focused, we can bring this about and we and we do not become stagnant and I, think that the fact that laned was vice president of planning. It's taken an interest even from the time this was raised in the community as a concern and something that the community desired. Lane has been with us from the outset of this journey that we're on so I think that is so very important. One neat: is there anyone else who has a question or comment? I do not see any other hands raised. Okay, all right, so just getting back to summarizing. I think that this has been an excellent discussion. I think that we're going to we're going to move this forward because we've had enough talks. Now we want to solidify this subcommittee, so we're sending we'll get the names of those people who are suggested. Then we will draft and send out an invitation to those people and establish our subcommittee and that will probably have to get a date on where we can meet when the sub we may have just have a separate date. Our next committee meeting is June. 10Th I believe that you can get it done by then. We can arrange for that at that next meeting and then also we want to look at the RFP for Lincoln Correctional Facility, what's happening with that. Is that something that we might be eligible to that might be a bit available to the to the book for this project. Let me say, and then we also are going to draft a resolution and that'll be circulated to the committee members and then we could take that to the executive committee and show of hands for committee members. Are you earn it? We have a consensus. When neither can you tell, if would you please raise your hand electronically, okay, anyone in disagreement? Okay, so that is that a go Juanita while reading see you have not raised your hand? Okay, alright, so I think that that's where we are right now and is there any other comment or concern or anything that you think that I overlooked in what our next steps are? Anyone Juanita, yes, yeah I'd like I'd like at least start in regards to the task force like do you want us to send an email to you, Karen saying that we are willing to be a part of the task force or the test was even though we would be meeting to discuss what the task force has come up with in this committee, but do we know who is willing to participate in the task force? As of now like you said, this is the third meeting and I think we can start documenting who is willing to participate and if we have to call a side meeting or set up a time, frame- or deadline to review the resolution? That's what has to be a part of the resolution as well. We okay! Well, we have a commitment. We have a letter, a letter of agreement from Harlem Community, Development Corporation. They will be partnering with us in Rubin. Ramen is on. He has been attending. The meetings is Isaiah from the mayor's office on a Juanita. No, now he's not okay. Well, he has offered to give oversight as well did the firm from the mayor's office. We definitely have the Sheena Kaufman, who is working with us from parks and maybe an invitation to the public advocate's office. This is something impact. The whole community, okay and I think it will be fine if people want to send their emails to me that you know and I'll put everything together. So that would be fine, so just a barbecue any suggestions. You have just send me that, but your recommendations- and if you would like to be on the test- was any committee members, any community board members who would like to be on the task force. This ball so I'm. Sorry I was part of the mother, Clara Hale bus, Depot task force and it took us a long time and we did have a lot of meetings and we involved the community. So we need to start at least meeting tech issues developing meeting finding a place. Hopefully, when it is over, we can actually draw up what we're going to need with the information that Lane is giving us in terms of guideline like what took place to get Seneca to where it is now just say. One thing: am I muted? No, we can hear you okay, yes, I would like to be on the task force as well. Of course, I want to be on it as well, once they start coming in and start getting the information they also reach out to some of the community pastors some of the larger churches or does not have to be large, honor I'm. Just saying we need to reach out as we get as much of the community from different aspects. So it's not just that legal III hear you I've been silent. Cuz, you know I get a stickler for time. Yes, when it feels like it's all over the place. I know me personally: I do not function and that white quite well. That's why I've been quiet, I've, actually loved all of the comments and where the thought process is going, but I dig I. Think I just need a little bit more clarity on just like the timeline, because we're getting ready to come up on June and I do not want for the summer months we generally do not meet and so I'm concerned that we lose momentum. You know I want to see Miss Sallam, whether it's on zoom or in person I think she brings a wonderful perspective to the things that we could do and where this could go and I like to be a down the road thinker as well. So it's great to see that the thought you know it's not just here and now, even though you know the project is going to take some time but down the road. What do we want it to evolve into because it has to be something that it's constantly evolving in? As far as the educational aspect, the impact, the cultural significance, the social justice all of the pieces? All of the bullets that you want to name so I just want to know like are we also contemplating meeting during the summer or we I just do not want us to go on break and it's a break, and then we start up in September. So that's just a suggestion. I do not know Karen. If that's what you were already thinking, but those were just some of the concerns I had thank you. Okay, I think that since it's a subcommittee we may be able the rules may be a little different for us in terms of meeting. There would not be a committee meeting taking place during the summer. I could do the subcommittee meeting right and I'd be glad, be happy to facilitate that I love to stay busy. So are there any other questions or concerns? Karen I was just going to piggyback one too. What hearing 16 just said, I think if you even just develop, think about developing the task force over this summer. You know until the fall and then officially began in the fall, so I mean just to give it some. You know some room for I love. The format that you were already coming up with the letter of invitation upon finding out who would be involved so that and then going forward. You know in developing over the summer months until the fall, yeah I think that if we can get people to do because we've just been talking about who should be at the table, actually get the contact information to send out to do a letter of invitation. I think that's a very strong starting point there to give us that momentum to solidify things- Thank You, Mari, okay, unless anyone else has any other questions or comments, we can move the agenda along. Next item is old business. Any concerns regarding old business. The only thing that I would say is that we've been talking about the waterfront in our area in CB 10. That would run from one 42nd Street to about 150 Fifth Street. We do not have any plan in place for that area as a part of the vision, 2020 waterfront plan, so we will be having a presentation from the Parks Department on that for June. So that's some coming up and that's under old business. Any new business, okay hearing none can I get a motion to adjourn the second ending. Thank you very much. It's been a beautiful meeting. Thank you so much I'm looking forward to this project in Central Park. Thank you so much.",
            "summary": "I know that we have an open park situation, which is on the Colonel young playground, which is on one 43rd Street between Lenox and 5th And I'm, wondering if you've experienced that, since you are, you might be over in that area?\nWe just would like to discuss further how we can bring the people that we need to have to this discussion, and it was it's a very multifaceted discussion, Is the community board to facilitate the bringing this exhibit to fruition in Central Park, so I sent out the minutes.\nWith that I'm going to open up the discussion to committee members, We need to bring be as inclusive as possible and as diverse as possible, because there's so many opinions out there And we want to have a consensus, but at the same time we want to respect the family.\nAnd I'm from particularly a rent, folk, a focus on social criminal justice and how that is so important and so integral to our community How we need to be able to use this as an opportunity to educate people on what their rights are And And we're just trying to get people to think together?\nAll, the issues related to justice and other types of situations that occur in our community by a collaboration of different types of events that would go on within that community space I know we had talked before regarding the space acrosss, the street, from Central Park the prison and that space, possibly being a house for some of the educational processes that would go on.\nWe are looking at other kind of ways to bring all of this together, because we really want the community to be aware and be involved and feel that this is kind of an open area where they can come in and get information and participate fully.\nThe experience in America that we have is that when they cry we die that's right and so trying to figure out how it's not like this We're using this as our piece to add to the true freedom, justice and equality of us as a people, as opposed to you know, just saying hey, it happened.\nDr. John, Henry Clarke said that you know if you, if you begin a people's history with slavery and everything else looks like progress.\nSo I do not know if the families you know if the some family is up for this with others from The Exonerated five would want to have kind of a mapping of the history of basically police brutality against communities of color and the fact that something like just calling it a complaint saying that person, because they're black And I think that if there is opposition to it that the opposition should be documented from where it's coming from to also establish the deep- rooted mindset of not only what has kept our communities down of what is acceptable in which we should anticipate I just being either a rite of passage or a signifier of adulthood, but also the powers that are keeping that status quo in place.\nIt should be a really all inclusive, powerful kind of very just blunt type of exhibit that forces people to address the truth in reality of what's going on in our city, because, even in decades later, from the exonerated five, it's still happening front and center and much more stronger as well.\nThere are a lot of people who are looking towards phantoms, Sorry that the Bellefonte route was not able to join the call today and In the future, I'm sure they will, because they are very interested in this situation, and they are also very interested in the space to turn it into a Justice Center for Education and Social.\nSo that's what the community board is facilitating at this point, the formation of what we call the subcommittee or chance for- This is our third meeting Anyone, who has names that they're suggesting to please forward them to the Community Board office Then we can develop a letter of invitation and send that out and then try to solidify what the subcommittee who the subcommittee is and who is on that subcommittee and then start to move forward and then also Then, once we do that, then we can start to have the broader discussion with more stakeholders and more and more of a diverse group of people.\nIs, you know, extremely important, but we want us from focus right now on the Central Park component and how that subcommittee can begin to develop the content of what would go into Central Park, and then we and then we can also look at the social justice Center aspect of it as well.\nThat is meant to kind of be the countryside for people who do not have a chance to go to the countryside So, I, know, there's interest in the Lincoln facility, so I think in terms of time frame really going to depend first, as Karen said, on a coming together.\nI think the most important thing first is to kind of really start broadening the dialogue, as Karen said, bringing more people into the discussion to figure out who, on the city, side needs to come in for partner to partner who needs to be involved.\nYou know, maintain itself as a historic piece that is within this community that has moved on to stay within the educational forefront of justice and when you look at the input of the Harry Bellefonte group coming in, and you look at his background and his relationship on the side of working on many of these movements that have gone through that have affected people of color and other people.\nWhat should I say dirty: I'm, a member of the public on a member of the community and Li , say that you know it may take a long time to get something permanent in the park, but I think it's that's an essential part of this project.\nOkay, so I just wanted to just let you know that this is intended to be a permanent exhibit right now in Central, Park We have the Seneca Village exhibit, which is temporary, but it's also in place to generate conversation and discussion around something permanent.\nAnd I do agree that we do need to make a permanent record of transgressions when they are when they, when we incur them and I, think that the issue with the woman in Central Park yesterday should even come before our public safety committee.\nYou think that we need a res lucien at this point from the Community board, stating that we want to see this project come to fruition?\nYou know because I started to work on, it would be very rough Then we could take it to the executive committee, which is tomorrow, okay, all right, so we'll work on a resolution I'm stating that we want to see this exhibit in Central Park, and let me see what other items other action items we have Just as we I do not think I've heard about this specific project or subcommittee before.\nI just wanted to also address what was said, and the first thought that came to me was Seneca village, but I think that the park may have a lot of bureaucracy and it may take time And it's a historical place, but we need to be included in the history.\nThere should be the thought right, now, not that Conservancy is telling us about the historical part of the park, and you know it's going to take time.\nThere's many statues in the park that nobody even knows who those people are.\nThe whole community, And I think it will be fine if people want to send their emails to me that you know Was any committee members, any community board members who would like to be on the task?\nYou know in developing over the summer months until the fall, I think that if we can get people to do because we've just been talking about who should be at the table, actually get the contact information to send out to do a letter of invitation."
        }
    }
}