{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Land Use Committee - August 18th",
            "publishDate": "2020-08-18",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    Two Bridges Rezoning Co-application: Update and request for Support for application memo and cover letter to Department of City Planning\\n3.    Vote to adjourn",
            "lengthSeconds": "1:19:51"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "4bruCZsZg14",
            "fillerWordCount": {
                "uh": 108,
                "um": 291
            },
            "readTimeFullTranscript": "42 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "development": 20,
                "paragraph": 16,
                "coverage": 16,
                "planning": 15,
                "case": 15,
                "plan": 15,
                "proposal": 14,
                "chat": 13,
                "changes": 13,
                "buildings": 12
            },
            "wordCountSummary": {
                "planning": 8,
                "case": 6,
                "development": 6,
                "proposal": 5,
                "memo": 4,
                "goals": 4,
                "draft": 4,
                "bridges": 3,
                "cover": 3,
                "plan": 3
            },
            "fullTranscript": "An hour recording, okay, great, so it's 6:35 and we're going to start the meeting good evening. Everyone and welcome to CB3 land use committee meeting for Tuesday, August, 18 2020 and we are conducting the meeting through zoom tonight and my vice Chair Linda is managing a platform and she's going to give a brief introduction about the zoom functions and also some guidelines. Linda. Okay, I think at this point most of us kind of know how to work zoom, but you should know how to mute and unmute yourself which, if you're using a computer, you have a button down at the bottom left of your screen to do that with. If you're using a cell phone, you need to hit f6. The other thing is knowing how to raise your hand and to raise your hand, you go to the bottom of the participants list pop up the participants list and go to the bottom and you'll see raise hand. We would like everyone to who is a guest here to sign in using the chat. That's our official attendance list. You just put your name and your affiliation in the chat, so we'll have it for later: okay, that's it Jackie, okay, so Linda before the meeting, Linda told me to remind everyone that please use the chat box for a check- in and also ask technical questions or procedural questions. Only you can put your name title and affiliation in the checkbox, but please do not use the checkbox to share your point of view or discuss any issues. I understand it can be very tempting to do so, but if you do it, you will be removed from the meeting. This is a cv3 policy and also I attended the parliamentary procedure workshop organized for Cb members last week. I just want to reiterate that everyone who wants to speak to raise their hands and get recognized by the chairperson first, which is me so and this is to maintain the order of the meeting. So we can move it better. We hope to close the meeting 8 P.M tonight, so everyone can watch the convention if they choose to so tonight. Our first item on the agenda is to approve the minutes for our July meeting. Michael, can you do a roll calling to see if everyone approves oppose abstinence or pnd at the same time? Take the attendance, please sure, Jackie. How do you vote? I'm sorry, I hold on one second, can you hear me? Yes, thank you Linda. How do you vote? Yes? Thank you Michael. I vote yes dominic. How do you vote? Yes? Thank you Jonathan. Yes, thank you, Jonathan Herman. How do you vote yes? Thank you trevor. Yes, thank you, Trevor Lisa. How do you vote? Yes? Thank you olympia. How do you vote? I think you're saying yes, okay, I'll! Take that as a yes Damaris. I do not think I saw Damaris, but does anyone know if she's on okay troy? How do you vote are? Yes, thank you, troy Steve. How do you vote yes? Thank you. Steve and Tim is Tim Laughlin here I do not see him in the group. Okay, great we're all set thanks! Jackie. Thank you. Michael next item is two bridges resuming co-, application, update and request for support for application memo and cover letter to Department of City planning. So DCP has given us a negative response on our resuming application back in March, and in may we, we CB3 hired consultant George James to prepare strategic memos in a in a reasonable worst case development scenario, memo to help us analyze the situation and also make recommendations. The co- applicants wants to resubmit their resume application based on George's opinions, actually one of his opinions, and they also request a cv3 to co- sign a cover letter for resubmitting and what we want to do. This even name is to review the two memos and decide if CB3 should sign on that letter. We have a baby talking. Let me see it was me. Can you hear me now? That's good news, yeah, you very well olivia! You might want to know yourself. Thank you, and tonight we have maddening from kev and elise from goals. They are going to give us a presentation for about 15 to 20 minutes. I understand committee members may have questions during the presentation. You can ask them, but try not to stop them too often and too long, because we want to keep it moving and I believe our consultant george and the lawyer for the co- applicants paula are both president is paula, is George presents tonight. No, but Chris Walters is here who has been who's the planner who we've been working with on the application? Okay, so the committee members can ask them questions after the presentation. We can ask them questions as well and following that it will be a perfect session, and then committee member will debate whether we should approve this letter decline or make change to the letters so so melanie and and elise you can start. We have a couple of slides that we'd like to share just to provide some visuals for this, so Lin. Would it be possible to enable screen sharing on my end, Linda, you are mute. I'm on Youtube no linda is on milt. Okay Linda. Are you making Marilyn a co- host? Thank you. It has been done. Thank you. I'm still finding I'm not able to screen share and I do not think I'm a co- host. Try again: okay: here we go okay, let's do a full screen. How is this is? How is the size of this for folks? It's good? Okay. I think you can see our Presenter notes at the bottom, but that's not a very big deal. Okay at least go ahead cool. So thanks everyone for having us again introduction my name's elise high street, I'm an organizer at Gold, Melanie Wong is an organizer at Cavs, and then we have our technical assistance team here, Paula Siegel who's, an attorney at secret, Justice and Chris Walters who's, rezoning, technical assistance at Anhd. Well, so, let's just get into it! So, as most of you know, a complicated group consists of four of us, so the first group is pennant United fighting for the lower East side. This is a group of tenants that live in the neighborhood that this plan will be affecting, and then you have good old, lower East side, local community organization as well as Cav, another community organization, and you all Manhattan community board three. Now the next couple of slides we're just going to go over the basic outline of the proposal. I know Atlante's committee members are well familiar with this proposal, but just for the general public and then also as a little recap, because it's been some time since we last presented at land use. So within the next couple slides we have the details of the proposal's content and some a bit of a historical timeline of our work on the proposal. But first off we're looking at right now is the map of the proposed rezoning area, which I know the street names are a little bit difficult to see on this graphic. But this sort of large diagonal here is the Manhattan bridge right and really what we're looking at are these blocks in the immediate vicinity of the bridge in the two bridges area, so here under the bridge, wait going acrosss this way is cherry Street. This is the Fdr right and then this is Catherine Street on the far end and on the far end over here, I believe is Water Street and Gouverneer, so yeah and then the map also shows. This is the map that we submitted with the reasonable worst case development scenario. So it also shows the curtain. Zoning designations and so forth. So though, as a general overview of the goals of this proposal, we want to remind you all that the specific requirements and overall goals come from the Chinatown working group plan and the larger history of community- based planning that led to the development of that plan in particular, which we'll review very briefly in the proposal highlights, but the essential core values, core goals behind this plan include ensuring that future development prioritizes affordable housing, particularly at AMI levels, accessible to the existing community and then also prioritizes development of commercial establishments and community spaces that serve the existing community. Next, we're going to share a couple of the of the basic land use requirements within the proposal, but these are just a fraction of what's actually in there yeah, so you all have access to the full plan. If you want to like learn more of the specifics, but I'll quickly go through these, so 50 permanently affordable housing requirement in all new or in large residential development, with Amis at the lowest levels, so they're accessible to this community height limit of 350 feet on all new developments, at least 60 percent open space and permeable surfaces on new development sites where feasible, requires schools, affordable food markets or community support abuses for ground floors and 40-foot frontage limits for banks and drugstores. And again these all come from the goals of this plan, melanie you're, on mute, okay, there you go. I was saying we wanted to offer a little bit of timeline just to give context for the long process behind this proposal. But I also know many members of this committee are intimately familiar with this history in a variety of ways, having sat through many long meetings that are encompassed within this timeline, but as referenced earlier, the bones of this plan are directly drawn from the Chinatown working group plan for the immediate area and that dates back to the start of the Cwg group. In 2008. We picked up the project as community organizations in 2017, and the community board formally voted to become a co- applicant on the proposal in 2017.. That would be this committee. Our initial meeting with DCP was 2017 and between late 2017 and now we've been going through the initial stages of the application process. So these are some of the highlights, and at this point we are as Jackie as Jackie stated earlier. We are on our third draft of our reasonable worst case development scenario. We received feedback on our last draft on March 16th, which was, as everyone knows, right sort of right, as things were, taking a pretty serious turn in the city, so our sort of planning and thinking and timeline in recent months obviously has been seriously impacted by the Covid-19 pandemic right, but so I just want to emphasize that this has been a very long process and we are very far along. I would say, into the application process at this point. So, since March, once we all went on lockdown, we initially decided to put a pause on the project, so we could all figure out our respective reactions and plans to Covid-19. We got back together in May to revisit the application and weighed out our options and decided to revise the reasonable worst case development scenario and continue our communication with Ecp, as it provides the most options for us moving forward. The Community Board engaged urban Planner George James to help us with the reasonable worst case, so he helped with the technical edits and also prepared a strategy memo and then, with James, our technical team completed the edits which is now prepared for resubmission. We also prepared a letter to Accompany said resubmission that offers responses to the questions posed by DCP and lays out our plan a little bit. More specifically simply put. We are coming to the coming to the landings community today because, as co- applicants, we want to continue to move forward the application by resubmitting a third draft of the reasonable worst case and, in addition to submitting a third draft, also submitting it alongside a letter that uses the opportunity to respond to some technical concerns raised by DCP, and then you all have a draft of that letter and that's specifically what we're asking for the land, Use Committee's vote of approval on, so that Alicia can sign it on behalf of the board and then after submission, after submission of this third draft and letter, we would anticipate some sort of response from DCP within 90 days, because their response timeline is mandated by law. So that's the extent of our presentation and we will pause here for questions and discussion all right. I want to start the first question. I won since George James talk about two scenarios: let's make a deal, can you really share with us those two options after your speaker is cutting out? Oh I'm! So sorry, a bit fuzzy. Is it fussy, yeah also Jackie? The letter that Melanie just said we received? Is this the one that is in the calendar of CB3 or some other letter? I do not know. Can you guys hear me now? Is it better? Now? Yes, okay and what is your question Olympia Melanie just said, we received the letter that she wants us to approve, but I'm not sure whether she means the DCP letters that are posted on the calendar, because we did not receive a letter from you. Oh so we so basically Thanvada was saying that the is it better now, okay, so I did not post that DCP letter for you guys, because I do not want to overwhelm the committee member. That Bcp letter has a lot of technical technical challenges and also questions and the memo created by James George James already provided context for you to understand that. That's what we believe because we are posting a lot of otherwise. We are posting a lot of information to the committee members and also to the public. But if you read Dc George James Memo, he was basically saying that he used the term devastating to describe Dcp's response. Okay, so Melanie Sorry Jackie just to clarify, though Olympia just I'm sorry, technical clarification that what you were being asked to approve is on the website, a calendar. That letter is on the website. Yeah, that's exactly what I meant that I understood that. Thank you, responding it's responding to what Jackie was just describing. Thank you response to that. It's the document. Titled draft cover letter for reasonable worst case development scenario. Right. It's a cover letter to accompany the resubmission and as co- applicants, you know each co- op can group would be decided. Alisa has her hand up. That's all I was going to clarify the same thing. That was just clarified. Oh thank you Mommy. Can you put it in the chat? Yes, I can put it in the chat one. Second and Melanie. Can you share with us the onward and let's make a deal scenarios? Okay, so what Jackie is referencing is sort of an analysis framework that George James presented in his strategy. My bro, I want to emphasize that George was engaged by the Community Board and the memo was written for the Community Board. So I so I can. I can kind of explain it a little bit my understanding of George's analysis right, but I'm kind of a third party to this analysis that set so essentially essentially the letter we got back in March March 16th from DCP. In regards to our second draft of the reasonable worst case, development scenario discussed technical issues and edits to the application, but also gave strong indication that DCP essentially was unlikely to continue to move this application forward in an active way because of because of issues with because of disagreements with the planning rationale behind our proposal. Right- and I think that's something- that's been understood from the early days of the Chinatown working group and from the early days of this rezoning proposal- is that what we are doing both in terms of its content and in terms of this process, is atypical in comparison with kind of stamp processes and standard applicants and sort of ideologies of planning right different olympia. Can you mute your microphone? Your different base assumptions about about where planning rationale should come from and sort of what the goals are for zoning law in the neighborhood. So these kinds of objections on Dcp's part are not at all surprising and they've. We we've discussed these kinds of objections repeatedly. You know throughout the process, but this is the first time this is the first time in receiving that letter. That DCP essentially put it really clearly in writing right and it felt as if they were not responding to our proposal as a technical document, and it was not necessarily coming from their position of responsibility to carry the technical document through the application process, but rather from the perspective of of the City Planning Commission's, like ultimate role in voting, an application, yes or no right, which is supposed to be much further down the line. So when Jackie's, referring to George's sort of like onwards, analysis within the strategy, Memo George took a look at this situation and took a look at Dcp's rhetoric in the letter and so forth, and gave some background in context to why, in the face of this kind of clear opposition, it may make sense for us to continue to move forward. The application right and essentially George describes two options, one which is moving forward: the application, despite potential future opposition from Cpc, and I want to emphasize Cpc right, like City Planning, commission level, not ecb, and then the other option which he calls let's make a deal, would be going back to the application, making major revisions to its content and essentially to its like very nature. In order to compromise with compromise between Dcp's planning principles and arts right so olympia, your mic is open again, I am not opening it, so I do not know what's happening guys, you are not mute. Let me see the rationale between. I do not know. If it's still up, I guess it is not. I think the rationale between potentially compromising with DCP is pretty straightforward, but I want to emphasize that we, as community groups, are not there yet and obviously I'm not. I can't speak for the entire co- applicant group, but in terms of goals in terms of cap we've had these discussions internally in terms of top less. We are not ready to give up on the core principles behind this plan, both in terms of the logic of its of its planning rationale and then also in terms of our commitment to the original Cwg plan and sort of the community- led process that led to that, and we feel that making major revisions to all of that would compromise sort of the integrity of this process right. So, as community groups, we are not prepared to go down the route of compromise right now and we believe that we have an obligation and we also have a commitment as organizations to continue moving forward the plan as close to the original as possible as far as possible in the sort of onward scenario in George's memo. He kind of outlines the rationale for doing that right and essentially it's along the lines of what I've already articulated right, the our proposal and the Cwg plan as a larger whole. I come from a very long history of community planning in the neighborhood involved, the input and the and the input and discussion and priorities of a wide variety of stakeholders and represent a unique planning process when compared to what's been done in other parts of the city or what Dcp's like typical, typical rezoning looks like, and you know not only do we stand by the actual rezoning requirements within the proposal, but also believe that commitment to that larger process is really important and George essentially outlines you know moving forward through the technical parts of this process. Despite potential future opposition from the City Planning Commission is still a logical thing to do, because the City Planning Commission is mayorally appointed and we are nearing the end of the current mayoral administration right. So the basic sort of political assumptions, or, like administrative points of view that are shaping the decisions that the commissioner is making right now, are essentially like time limited right, and so, if we continue to move through the technical parts of this process, we will, even if this current commission and this current mayor has strong opposition to the plan. There are definitely openings in the near- term future to actually get it passed all right before I let Lisa speak Linda. Can you let Tunisia inch? I think she's waiting. Is that right? Oh, yes, okay! Thank you Linda and Lisa yeah. I just have one question and then maybe one comment, but I'm basically fine with the letter. My question is about the final paragraph in the letter which says if we do not receive a confirmation by a certain date, we will accept your statement in the prior letter that this plan will remain incomplete and the proposal will be unable to advance as a final agency determination. What is what is your purpose in that paragraph? What what's that getting at? I can speak to that if, unless we're not coordinated very well, but I think we got this, so we really need to know from the Department of City planning where we're at, because just like developers when they submit their applications for rezonings to facilitate their process, their projects. Excuse me we can submit as many drafts as we want right like we can keep spending my time and Chris's time, redrafting and redrafting there's very little. We can still change, but we can just keep going, but actually they wrote a letter in March that lays out not what's technically wrong with how we present the reasonable worst case development scenarios, but why they disagree with what we're trying to do and we're trying to in this resubmission to say: okay, you know what we're going to give it one more shot, because it's not your job to say why you disagree with the content. So let's try it. Let's try one more third draft. There's a couple of changes we'll make clean up a couple of numbers, nothing major, and this long cover letter kind of explaining. Why a lot of their comments just do not belong at this part in the process. They belong on the political end after it's been certified, but if they do not review for the technical, we want to know where we're at we want to say: okay, we're done we're not going to submit any more drafts. Maybe we'll consider another strategy, maybe we'll consider court, maybe something, but we can't just keep coming back and redrafting and redrafting we want to give them a way to signal to us like no we're not going to change our position from March or yes, okay, thanks for making these technical changes, let's just pretend it was about that we'll move forward so notice it. When I read that sentence paragraph whatever it is, I guess it's a both a sentence and a paragraph. It kind of sounded like a threat, and I guess, as a community board, it would be important for us to know if this was leading to a clear conclusion that the next step was a suit which we could not enter into. That makes perfect sense. So one of the strengths of the and that's a great question- thank you. So much lisa, one of the strengths of this application is that there's the community board as one applicant which has been here for this whole process and like kind of been the steward of the working groups and everything- that's happened in the last seven years, but there's also independent not- for- profit organizations that represent different interests in the neighborhoods and can act independently. So once we have a clear signal from DCP about which way they want to go with this, then the different actors can choose what to do based on what they want to do next, and it's clear to us that there's no, you know, maybe for the Community board. Understanding that March letter with its harsh language is a final agency. Determination will mean. Maybe the Community board wants to think about how to approach this or wants to have a different set of meetings with the mayor right, like we're done working through the agency, we're done working with the environmental review people because we're not getting anywhere with them. Maybe we want to try to leverage the president's office. Maybe we want to revisit who the applicants are, because maybe we'll get seen differently, but having that clarity there as like this is the final determination. That'll mean one thing for the community board. It might mean some slightly different things for independent for the other independent organizations that are co-, applicants that are that kind of are created differently governed differently and have different restrictions. So somebody one of the applicants could choose to sue based on knowing that March letter is a final agency determination and it sounds like one right that is their language. This application will remain incomplete, but that's not where anybody wants to go right. Now. We're really trying to figure out a way to thread the needle and get back into the administrative process and not go that route at all and have them say like okay, thanks for this long letter, let's scrap all that merged analysis and just accept your reasonable worst case. So we can all draft an environmental assessment statement and submit that and actually get it certified so that the community board can treat this euler publication like every other euler application and actually assess the merits, as opposed to getting stuck in the technical link. I had another comment, but I'd be glad, I'm sorry Lisa. Sorry, no, but then I'm glad to wait if you want other people to talk and then I'll just make well, there's one section that I have a problem with. I also have one session that I feel like is a little bit problematic, but I'll. Let olympia be first, I'm happy for you guys to. I am happy for Lydia to finish her thing. I can wait, listen! Okay! My concern is about the paragraph, the final paragraph on page three, that goes on to the beginning of page four. With regard to the height. Well, it's about the open space really and it takes the position that we think power and the park. Buildings are perfectly fine in this in this area and I just can't get there without qualification. I feel like yeah their tower in the park buildings. There, but I have a really hard time saying that that's exactly what we want to do without qualifying it by saying, if, coupled with height restrictions, and also saying I wondered if we could change the last sentence in and on page four, I'm sorry, it's last paragraph on page four, going on to page five, I think I said three and four. If we said low coverage, buildings are more appropriate here than high coverage, contextual buildings than a high contextual building independence. This requirement is consistent with current design vernacular within the special district. I do not want to say that we love how we're in the park buildings without qualification, because I hate them. Okay, let's say quickly that we anticipated this kind of these kind of edits would come up and we are comfortable making them now, provided that they do not create. You know like technical issues with the content of the language. You know what I mean, so I think Lisa the kind of qualification and our technical team is here to correct me if I'm wrong, but I believe that kind of qualification would not actually making changes to the overall integrity of the letter. So we're happy to work with the wording, and I have screen shared my my copy of the letter here for that purpose. So I guess I'm happy to be secretary. If the committee wants to sort of discuss what they find to be appropriate and then we'll give feedback as necessary, there's also a spelling error. I'm sorry, I've never learned how to spell neighborhood it's on the it's in the Middle Melanie. On that same line, there's actually two. I think, there's two periods at the beginning of that sentence: perfect, okay and Olympia. I mean I agree with what the legion just said. I think when they coined the term towers in the park, towers did not have the steroids that they have these days. So I mean I do not know. I had a couple of comments I mean first of all, actually I have a comment about the fact that we put the memo of James and this letter on our website and they say like draft not to distribute confidential and especially James. He uses words like lip service and stuff, like that. I think they're very informal, and I'm not have you cleared it by posting this publicly. I mean he could be even suit for defamation. I do not. I mean like I'm, not sure this was supposed to be public, so I do not know. This is one comment, so my comment about the presentation right now is I'm interested also in the strategy level. You are not mentioning that lawsuit that happened in that development and when all this thing was happening, we always said that we were applying for this rezoning, also as some sort of what do we call it like back game or whatever it's called so is there something that we should be considering on that level only time so far, sorry Jackie. May I speak yeah, so I just want to response to Olympia a little bit about like what to prophesize and whatnot, because we feel like without publishing that then people will not have the context to understand what we are trying to approve tonight. So that's why we want to publish that memo online and maybe it should not say confidential. I mean I do not know once your public is not confidential right. What is the public is public. Is nothing really confidential and also we've been having a lot of transparency issue. I mean the past few months, so I just want to make sure that everybody is has the same access to what we have and I'll. Let paula to answer the question about the lawsuit, so the lawsuit is ongoing. In fact, supreme, the courts in New York state are organized like a pyramid. They have three levels. So all three cases, one at the first level and the city and the developers have us- have appealed all three cases at the second level and the case that was brought by the City Council and the borough president has been argued and the judges listened carefully and they're thinking about what to do and the case that was brought by tough and Cav and goals and the nature residents. Oh my goodness, laguardia and the that case, the developers in the city just filed their appeal, we're working out a briefing schedule and there's a third case that was brought by a different set of community groups. Also, the developers in the city just filed their appeal, they're working out the briefing schedule it'll take some time. Appeals at the second level are as of right, meaning the developers in the city get to appeal. They do not have to ask for permission depending on what happens at the second level. Whoever loses could ask for permission to appeal at the third level, but the lawsuits themselves are just about procedure they're not about what can be built in the neighborhood they're about what are those buildings properly approved back in December of 2018. they're like frozen in time from that December 2018 moment, and even if the lawsuits are as successful as they can be, the developers can just start over unless the underlying rules are changed, and so what we're trying to do right now is change. The underlying rules, so yeah winning the lawsuits in the end will be fantastic. It already feels pretty good that everybody won at the first level right. We got ourselves a lot more time to make these changes to the underlying rules, but win or lose all the lawsuits do. Is they strike down that City Planning Commission vote, all on the basis of the idea that it was not the city Planning Commission's job, to vote for different reasons, but basically that's the argument. All three cases made is. It was not up to the city Planning Commission, so the fact that they approved it is not a proper approval. End of story, so from my perspective, as the litigator on one of those cases, I would love to see the rules changed as quickly as possible. So too much more delay in this administrative process that DCP has introduced here. It's a bit frustrating but, on the other hand, we're in a good position right where we're the ones with the win right now. Thank you, paula. Let me see. Do I see more hands here? Nope, okay, so Jim? I have a question for you. I I there's a session, I'm not entirely sure whether I understand this correctly. So is this you're talking about the letter or the letter, the letter, the letter, the cover letter, the last paragraph of page, one to this, the first and second paragraph and third paragraph of page two. So basically it is talking about the roles of DCP and also how they do their business. I just want to be sure that the description everything is correct, yeah. So this is what paula was just talking about. This is kind of the little in the weeds technically, but this is exactly what the prior comment just before talking about the lawsuit, that's what this was addressing right, so that right, the question at hand that you can think about right is if DCP made a determination right, which we we're trying to figure out right. That's one of the goals here is to say was that March 16th letter, you know a determination or not, and also right, one of the other things to figure out is if it. If it was a determination, you know, were they. You know technically kind of crossing the threshold of what would be appropriate for them. To sort of comment on at that point, in the process, right I mean, and the argument right being made here is that there were- and this is also outlined in George's memo- there was there's a history of the City Planning, Commission and DCP as their as their agency, that helps them fulfill their tasks, sort of slow walking, right projects that had kind of political or policy recommendations that differ from the department's goals right and then there were rules established under the prior city planning. Commissioner, that said, look we need to streamline a number of things in the public review process. One of those things is kind of this issue of slow walking projects for political reasons, right and saying that you have to kind of let them go through review as technically complete, and this is just sort of citing a number of different rules right, euler rules which are rules in the city of New York having to do with land use applications as well as the establishment of of the rule we just talked about. That goes into a little bit more detail about like what the rationale was behind that, and I mean you can look up those citations. The citations are provided you can you can, I think, there's either even hyperlinks. You could follow the links to read about it in more detail. You know, I think, there's probably there's probably pushback that DCP may have on this, but that's kind of why you send the letter, I guess, is how I would frame it is. I can anticipate some things they may say here, but we won't know until we, you know posit this particular interpretation and hear a response. Does that make sense I mean? Does everyone follow that? Yes, for me right I mean the question is: can they can they be largely? The changes asked for right in their comments that we have not addressed are one that, as Melanie very you know eloquently explained, would like change substance of the application right. It would be things having to do with the set of sides of affordable housing, or you know the regulations around commercial uses right which, like what we're proposing here, is not necessarily in Dcp's vision of how you would develop this area and or in any area right, because it has a serious, significant, affordable housing set aside for one beyond my age, but the question is: can they ask us to change that on that basis alone? On this question of policy, the application based on the with the reviews that we are now considering, should be largely technically complete right and we've cleaned up a lot of the technical issues, and we've tried to address every instance where they say. Please provide a rationale. That's what the body of this letter largely. Does it responds to individual instances where they said at least give us a rationale here, if you're going to propose something unorthodox in our interpretation of city planning, so yeah I mean that's what that's what's happening here yeah. I guess I guess my concern is that I guess I want to make sure that paragraph actually is the correct on that eventually. But I just like feel like you as a planner when we are, we land use committee is recommending cp3 to sign on this letter. I want you as a planner to make sure, like you also comfortable with the that description. You know that is. That is like my question. I guess what I would say is like if you look at history, they've certainly done this before historically done the thing before that we are saying they can not do in this letter right and the question is: is this rule change? You know, honored by the current planning. Commissioner right does there need to be a clearly established rule? If this is not the current rule? Right I mean that's a question I mean I do not know what they're going to say, I'm trying to anticipate, but I can tell you in the past right I mean they have done. This they've also stated that they won't do it anymore. They likely, although I can't say definitively because I have not been on other land use applications during this administration, but they've likely done this again right during this administration and they probably have concocted a justification for it. But that's kind of why you send the letter right. You try to get into that conversation and then that may be the grounds for some sort of legal action in the future. But this is sort of like, let's make sure we're. We understand what you're saying and you understand what we're saying. Okay, all right! Thank you olympia! Yes, I mean, I feel very comfortable with us saying this, because it's shameful, you know- and I think it is a role to say this. I'm also wondering- and maybe it's a theoretical question, but one of the things that had been most frustrating and offensive throughout the two bridges process was the seeker manual right and so the whole way of how do you define these reasonable? Whatever scenarios was very often basically technically sound, but completely logical by any stretch of the imagination? And so I'm wondering whether, because I think in the past, especially during the process of the two bridges that we were all involved in, we had discussed, you know some initiatives that were at the city level about the evaluation of seeker- and I know you know a Nhd Chris is here today and others were involved. Actually even Mifung was involved in that process. I do not know if it was officially a CB3 or something else so I mean I do not know if there is any value in adding any comment around that in this letter or whether we as community board three Wanna resume in a future agenda discussing that, because if we do not change the seeker as a language committee, we will be reading a lot of crap sincerely in the future olympia. I do not know Jackie. Can I respond directly yeah hold up yes, so the poor portion of the process that we are in at the moment is not yet governed by secret. Luckily, and what makes this really simple and makes our advocacy job kind of easy, because all we need to do is point out to DCP- is that in 2016 the City Planning Commission adopted specific brand new rules about what's supposed to happen before the before there's an eis. All the steps before there's, actually an environmental impact statement, that's going to be governed by secret and that's where we are. We are squarely in the middle of that there are specific regulations they're supposed to follow them, we're reminding them of what they are in the paragraphs that Jackie pointed out because they're pretty new, these regulations were not the law before 2013., they did not exist, but that's where this whole process lives. Is it lives in this area where there were no regulations, people kind of did what they wanted. Dcp would you know work quickly with folks? They like work slowly with folks. They did not like, and lots of people saw that as a problem and created a whole regulatory system for that piece of the process. So that's the piece of process we're in now we're not yet at the secret stage. The reason I brought up the issue about this question is because, like when I compare this against George George's comment, it looks like there are. Some discrepancies between what he described or even described, looks like different administration seems to have different practice. That's why I want to make sure that we all comfortable with these a few paragraphs yeah so what's interesting, is that when the Bloomberg administration announced that they were going to take a different direction, that was actually right after these rules were passed. So I think they were trying to give themselves cover for following the new law without ever saying. Oh we're going to follow the new law because we have not been because we were so bad at this before that there had to be a whole set of regulations written, but these two things happened very close in time. New regulations were adopted in 2013, and then the department made all these big public statements about how they were going to make a big change and how they were doing this in 2014. But it's not really the department's statement that matters it's the law and before 2013 the law was different and now it's 2020 and we live under this new regime. Thank you, Paula Jim, you have a question yeah sorry I was just going to say. I think I think, to kind of wrap on this part. You know it. I guess what I'm going to say is: DCP is going to say what they're going to say, right and part of this process. That's going to be useful is getting some clarity on in places where we think there should be clarity, but maybe there is not in practice right and it's useful. I'm sorry. Clarity means that for the sessions we just discussed like what is that, so what I'm saying is, if there's, if they're interpreting a rule that seems to go against the way it is written right, clearly written right, then we're trying to address this right and getting some clarity on that, and I think that what you're likely to see happen right is- and I'm not saying you should not sign because of this, I'm saying actually, maybe you should sign because of this, because it's it's useful to get clarity on these issues I mean, I think, they're probably going to say, even though we're not in environmental review, that the areas of study as outlined by seeker should inform the way you think about your reasonable worst case development scenario, and I think they will probably push back and say. Well, you know public policy is one of the seeker requirements, but I do not know that they'll say that, like I think part of the question here is getting them to be clear about something or not, and then there'll be a lawsuit right, but if we pose the question it pushes that forward right. It pushes that conversation forward because otherwise I do not. I do not think we'll ever get clarity on that we can go. We could we can just kind of be spinning our wheels making small technical provisions endlessly, which is which may be what they want. It we're not sure right. That may be a strategy that they want. So this kind of says like what's the rule, how are we interpreting it? If you're saying it's okay to interpret policy, then at least we know we may disagree with that, but we need some clarity here. So that's how I would wrap that okay, thank you. Jim! Do we have more questions and then I'm going to open to public bill firms, you yeah, you need to unveil yourself, my Mic, sorry hi, I'm a resident of Grand Street, Seward Park in Grand Street. First of all, I want to thank you all for going through this work, because I realize it could be like mind-, numbingly, tedious, except it's so hugely important to us that I appreciate it. I just wanted to bring maybe a little, maybe more, of a political perspective. I'll try to be brief for a different project. I had to go down to see. We went as a group of us went to the City Planning Commission and we've been dealing with the DCP, and it's pretty clear that this the planning commission is pretty much, is fairly packed with pro- development books, which is a problem to run into, but I actually looked it up today and six of the members of the City Planning Commission appointed by the mayor. Five of them were appointed by borough presidents and one by this public advocate. So my point is just possibly keeping this dragged out and rolling on and stuff like that. I know with one political, local, democratic club, I'm active with one of the things they're constantly asking all incoming candidates, or are they going to take any money from real estate developers? So that's my point would be trying to get new elected officials that are not so completely pro- development or might appoint a couple people who are more about right sizing than upsizing. The zoning rules on the city, Planning Commission, might bring around a change so making this roll out. As long as possible might be the thing to do just being on observation, thank you. Thank you. Next is Aaron Gonzalez Aaron. You need to unmute yourself, and you have two minutes: okay, hello, my name is Aaron Gonzalez and I'm a tenant leader at lands end one at 275, South, Street and the member of tough Las. We know that New York City has been hit hard by the coronavirus pandemic is mired in the worst economic calamity since the financial crisis of the 1970s, when the city nearly went bankrupt, the city's unemployment rate now is near 20, a figure not seen since the great depression and the losses have been particularly significant among people of color about one in four of the city's asian black and hispanic workers were unemployed last month, and this has led to more than 14,000 rental households in New, York, City falling behind on their rent payments, and they are at risk of losing their homes. So it's more important now than ever to protect our vulnerable communities. Our neighborhoods, our people are facing diet crisis and we need the community board's help. So we ask the members of Community board three to please support the two bridges, rezoning application memo and the cover letter to the Department of City planning. Thank you, Marin. Okay, I do not see any more hints from the. My wife would like to speak. If that's awesome, okay, my name is, and I'm a resident of lands N1 which is located at 275, South Street and I'm also a member of tough less. Now the city's zoning resolution was adopted in 1916 to limit the bulk of skyscrapers because of the widespread anxiety at that time that they will block the air and light below now, over 100 years later, we still have the same anxieties, but the coronavirus pandemic has exacerbate exacerbated them right and our asian black and hispanic community are being affected to a heightened degree. Now, so I'm here to ask the members of the Community board 3 to remind DCP what the city's rezoning or zoning resolutions original mandate was to preserve and protect communities. So please support the two bridges: rezoning application, a memo and the cover letter to the Department of City planning. Thank you for your time. In this platform, seeing no more hands from the public, Grace Memories Jackie, I'm sorry grace has her hand. Raised her literal hand. Let me see elise, yes, I want us. I would like to speak sure for some reason. I do not see your hand but anyway, okay, elise, yep, okay, good evening. My name is grace Mack, I'm a mom with three kids and we reside as the family at 82 record slip. Thank you for the opportunity to allow me to speak tonight not only as a board member of tough Las, but, more importantly, as a long time resident who grew up around this neighborhood in the past six years. We've we witnessed some many immense and accelerated changes in the bridge area, with the disappearance of the half mark supermarket that served our community for 29 years and it in its place is the out of context monstrosity luxury building by Excel Manmahan Square, which stands 847 feet tall with 80 stories over towering, the Manhattan and Brooklyn bridge and our beautiful, lower East side, Waterfront Skyline. As you know, these mega developers like Estelle and many others out there once they completed their money making projects there is practically very little or absolutely no incentive for them to help or give back to the community. These giant and greedy developers just pack up their money bags and leave. They leave the community holding the bag and having to grapple and deal with the after effects of inadequate cities, infrastructure of transportation, insignificant, insufficient, open public space light and air. Two bridges is no Park Avenue, Madison, Avenue or Fifth Avenue in terms of monetary wealth, but we are a close- knit community that is very affluent in and well- off in terms of blended culture rates, mixed diversity, pride and acceptance of different levels of social load to hard- working middle classes. These types of characters and components is ever so crucial to keep a company intact, especially during these very difficult times during the country's social and racial upheavals, as well as the panademic crisis, as a grassroots community, Centric group, tough, less along with wolves and cab. We are here tonight to ask you for to use your moral compass and empathize with us to help two bridges, be that unique centric community that continues to bridge and build and bind the gap gaps of social Inequalities cultural race and mixed diversifications, together with your support and your strong belief that we can significantly strive to make social changes by forging forward and helping one community at a time. Please vote yes tonight to our zoning co- application cover letter. Thank you for your service and your community support. Thank you please thank you. So let me see seeing no other hands, so I'm going to ask the committee to decide whether we're going to approve the letter. So from the conversation we already had, I feel like most of the committee members are in favor of them approving the letter. So if I'm not mistaking it, so I do not know if I have a motion to approve the the cover letter with the minor edit and proposed by Lisa. Do I have a motion for that? Do you want to read that just to read the edit sorry yeah? I do not need to move it. Actually. I do not think Lisa offered a specific language. I actually did and I sent a copy. I thought I had Paula's email just sent it to you Melanie. I just sent it to you funny email, Game, Sorry Melanie has the document I have my face, but Melanie has the master document. I have it in my email. I could read it, but oh you did get the urban justice one. Oh yes or I do not know. Maybe Jim forwarded it to me anyway. Now, oh okay, guys if we also, if we all take like if we all count to 12, I bet Melanie will find it and be able to insert it where we can all see. Yeah I got it, I got it. Let's see all right! It's okay! Wait! Oh wait! No! This is not the correct right. Okay, so I have the edit lisa, which portion is it's starts here and how much of this is meant to replace? I sent the actual document to Jim. Maybe he could with track changes. Maybe he could go with that to you have that, but could we just replace the whole paragraph? I think we trust you lisa, like I think we talked about the change, so I think Melanie you could go. That's basically it does. This look right, yeah, okay, so it reads: your team asked for a rationale explaining why 60 open space requirement is appropriate and how you determine the additional requirements for new construction on lots where there are existing buildings. Most of the residential development in this area follows the tower in the park, design, paradigm and coverage requirements. If, coupled with height restrictions in the proposed special district, reflect the coverage seen in the developments residential developments in the area, low coverage buildings are more appropriate here than high coverage, contextual buildings, which are generally preferable. Wait this scene yeah. Maybe it needs work now that I'm reading it again. Yes, while Lisa, is working on the changes olympia. What is your question? So I had a process question, so you wanted a motion for this letter because we're going to pass it like a rental and then it's going to be voted on the full board. Yes great so and then should not. We also disclose because we represent one of the four applicants that some of our committee members. They also represent the other applicants. You are saying Trafford and Damaris, Yes and Damaris. Thank you, Olivia. I was going to mention it yeah. I guess like later like before the votes they and so far, they have not spoke anyway. So no, I was just asking for the process just to make sure, because you asked for emotion and I was not sure what we were doing right, I'm just going to I'm going to while we're waiting. On a personal note, I'm so happy to see all your faces guys. I missed all the two bridges folks. We did not see you this morning yeah, but we do not work on two bridges on that. Other call, if we're just hanging out when is full board right in Blue here is Lisa's edit, and then I brought the original text back just so. We can compare them because it seemed like there were some syntax issues, because I was yeah. I think the only problem is one and if we move most of the residential development in the area follows the tower in the park paradigm and coverage paradigm coverage, and maybe that's where the comma goes, and coverage requirements of the proposed special district. If coupled with height restrictions, reflect the coverage seen in the residential development in the area, low coverage buildings are more appropriate here than high coverage, contextual buildings, which are generally preferable. I think that makes sense makes it sorry. Other people do not follow. This requirement is consistent with the current design vernacular within the special district. Finally, is there any way you can enlarge the file? To be honest, I really can not read it. It's too tiny for me, Jackie there's a little thing at the top. That says view options you can actually control your own. Let me see, I thought I'm already like putting like pretty much full screen already. Okay, this is better where'd. It go. It's really small. I can probably send it to everybody. I mean I think the language is okay Jackie. It is just DCP speaking, so it sounds weird, but it's correct. I think yeah, it's just kind of rearranged. A little did we lose Melanie yep, oh yeah, I think so connected. Is that what happened so paragraphs Lisa? Can you just read it for us? Would that be okay yeah? I just did, but I will again okay. So it's starting with the second sentence in that paragraph. Most of the res residential development in the era area follows the tower in the Park design, Paragon, Paradigm, comma and coverage requirements of the proposed special district. If, coupled with height restrictions, reflect the coverage seen in residential developments in the area. Low coverage buildings are more appropriate here than high coverage, contextual buildings, which are generally preferable period. Oh, can we take out that last phrase? I finally understood what it meant now that you read it with an emphasis: okay, you're right. Well, we can take it out. Okay, you're right. This requirement is consistent with the current design vernacular within the special district. Oh man, I'm going to put it the way. I think I just heard in the chat he said. Will you just check that what you just heard in the chat? Okay, I've got too many screens open here, got ta get back to the chat. Okay, I'm going to Lisa I'm going to let you put the paragraph in the chat and we need to because I do not know if Melanie is able to come back she's coming back Melanie's on her way back or she's trying I, the problem is when I put it in the chat the track changes. Let's see, maybe I can do it, but if I accept the track changes yeah, but just forget about the two changes: let's put a new paragraph in the chatbot, so we can move this. I do not see your paragraph yet I'm give me a second please I'm trying to get it open. Melanie's back, hi, Melanie, we're working on a paragraph for you! Lisa is going to put it in the chat in a second. Should I resume the screen share, yeah? Okay, then it's so dark. Where I am sorry it's in the chat. Okay, I think we see that so Melanie. Can you just copy this to the to the file to the document? Yes, I can. I can screen share again, if makes me a co- host once again, oh wait here we go. I do not need it right. Okay, where is the chat? Okay? Here it is in context. Your team has followers got a couple of extra spaces in it, but other than that, I think it's right. Okay, all right! Do we have more changes for this letter. If no, then, can I have someone to motion to approve the letter so moved any one. Second, thank you all in favor, so hi. What should we do? Okay, let me see so because, because trevor and the marriage are not voting, so are we supposed to be present, but not voting yeah? Why not Jackie? Why not do a roll call, which will all be the ending roll call yeah exactly that's what I want to do with us and that can we combine them with the the roku to finish the meeting yeah. I think we could. Yes, okay, then, let's do it, michael. If you combine them, how are you going to count Trevor and Damaris as President? That's what I was wondering not voting on the resolution and present at the end. Okay, a little informal here, okay Jackie! How do you vote? Yes, okay. People need to give me a second sorry linda. How do you vote? Yes, thank you Michael. How do you vote yes, dominic? How do you vote? Yes, thank you, Dominic Jonathan. How do you vote? Yes, thank you, Jonathan Herman. How do you vote yeah? Thank you, Herman Trevor. How do you vote as I'm not voting co- applicant? Thank you, Trevor Lisa. How do you vote yes? Thank you, Lisa Olympia! Yes, thank you Damaris. How do you vote I'm not voting co- applicant. Thank you, Damaris Troy. How do you vote? Yes, thank you Steve. How do you vote? Yes, thank you. Steve and Tim did Tim, join Nope, all right, we'll say absent, so we have ten yeses two present not voting and one absent, and we are also joining the meeting. Thank you so much guys the letter got approved and then it will be sent to the Food board and it is likely going to be approved by football as well. So we will, we will be in touch with you guys with the co- applicants. Thank you madeline. Thank you, elise. Thank you, paula for joining us tonight, yeah and also Chris, and that's all for the meeting tonight. Jackie you made it it's 8:7, 54. yeah! Thank you, okay, thank you. So much. Thank you. Bye thanks. Everyone bye, you so much.",
            "summary": "Next item is two bridges resuming co, application, update and request for support for application memo and cover letter to Department of City planning.\nSo DCP has given us a negative response on our resuming application back in March, and in may we, we CB3 hired consultant George James to prepare strategic memos in a in a reasonable worst case development scenario, memo to help us analyze the situation and also make recommendations.\nI, know Atlante's committee members are well familiar with this proposal, but just for the general public and then also as a little recap, because it's been some time since we last presented at land use.\nWe want to remind you all that the specific requirements and overall goals come from the Chinatown working group plan and the larger history of community- based planning that led to the development of that plan in particular, which we'll review very briefly in the proposal highlights, but the essential core values, core goals behind this plan include ensuring that future development prioritizes affordable housing, particularly at AMI levels, accessible to the existing community and then also prioritizes development of commercial establishments and community spaces that serve the existing community.\nSo our sort of planning and thinking and timeline in recent months obviously has been seriously impacted by the Covid-19 pandemic right, but so I just want to emphasize that this has been a very long process and we are very far along.\nWe want to continue to move forward the application by resubmitting a third draft of the reasonable worst case and, in addition to submitting a third draft, also submitting it alongside a letter that uses the opportunity to respond to some technical concerns raised by DCP, and then you all have a draft of that letter That's specifically what we're asking for the land, Use Committee's vote of approval on, so that Alicia can sign it on behalf of the board and then after submission.\nIn regards to our second draft of the reasonable worst case, development scenario, discussed technical issues and edits to the application, but also gave strong indication that DCP essentially was unlikely to continue to move this application forward in an active way because of because of issues with because of disagreements with the planning rationale behind our proposal.\nThat DCP essentially put it really clearly in writing right and it felt as if they were not responding to our proposal as a technical document, and it was not necessarily coming from their position of responsibility to carry the technical document through the application process, but rather from the perspective of of the City Planning Commission's, like ultimate role in voting, an application, yes or no right, which is supposed to be much further down.\nThe application right and essentially George describes two options, one which is moving forward: The application, despite potential future opposition from Cpc, and I, want to emphasize Cpc right, like City Planning, commission, level, not ecb, and then the other option which he calls let's make a deal, would be going back to the application, making major revisions to its content and essentially to its like very nature.\nI come from a very long history of community planning in the neighborhood involved, the input and the and the input and discussion and priorities of a wide variety of stakeholders and represent a unique planning process when compared to what's been done in other parts of the city or what Dcp's like typical, typical rezoning, looks like, and you know not only Do. We stand by the actual rezoning requirements within the proposal, but also believe that commitment to that larger process is really important and George essentially outlines you know moving forward through the technical parts of this process.\nWe can still change, but we can just keep going, but actually they wrote a letter in March that lays out not what's technically wrong with how we present the reasonable worst case development scenarios, but why they disagree with what we're trying to do Okay.\nThey belong on the political end after it's been certified, but if they do not review for the technical, we want to know where we're at we Maybe we'll consider another strategy, maybe we'll consider court, maybe something, but we can't just keep coming back and redrafting and redrafting we want to give them a way to signal to us No, we're not going to change our position from March or Yes, When I read that sentence paragraph whatever it is, I.\nOne of the strengths of this application is that there's the community board as one applicant which has been here for this whole process and like kind of been the steward of the working groups and everything- That's, happened in the last seven years, but there's also independent not- for- profit organizations that represent different interests in the neighborhoods and can act independently.\nSo somebody, one of the applicants could choose to sue based on knowing that March letter is a final agency determination and it sounds like one right: This application will remain incomplete, but that's not where anybody wants to go.\nYou, know what I mean, so I think Lisa the kind of qualification and our technical team is here to correct me if I'm wrong, but I believe that kind of qualification would not actually making changes to the overall integrity of the letter.\nOh, my goodness, laguardia and the that case, the developers in the city just filed their appeal, we're working out a briefing schedule and there's a third case that was brought by a different set of community groups.\nOne of the goals here is to say was that March 16th letter There's a history of the City Planning, Commission and DCP as their as their agency, Right projects that had kind of political or policy recommendations that differ from the department's goals.\nOne of those things is kind of this issue of slow walking projects for political reasons, right and saying that you have to kind of let them go through review as technically complete, and this is just sort of citing a number of different rules.\nIt would be things having to do with the set of sides of affordable, housing, or you know the regulations around commercial uses right which, like what we're proposing here, is not necessarily in Dcp's vision of how you would develop this area and or in any area right, because it has a serious, significant, affordable housing set aside for one beyond my age, but the question is: Can they ask us to change that on that basis, alone?\nIt responds to individual instances where they said at least give us a rationale: here, if you're going to propose something unorthodox in our interpretation of city, planning, My concern is that I guess I want to make sure that paragraph actually is the correct on that eventually.\nSo I mean I, do not know if there is any value in adding any comment around that in this letter or whether we as community board three Wanna resume in a future agenda discussing that, because if we do not change the seeker as a language committee, we will be reading a lot of crap sincerely in the future olympia.\nWe ask the members of Community board three to please support the two bridges, rezoning application memo and the cover letter to the Department of City planning.\nPlease support the two bridges: rezoning application, a memo and the cover letter to the Department of City planning.\nSo I had a process question, so you wanted a motion for this letter because we're going to pass it like a rental We, also disclose, because we represent one of the four applicants that some of our committee members."
        }
    }
}