{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCupvZG-5ko_eiXAupbDfxWw",
            "title": "Public Safety Committee Meeting 8/19/20",
            "publishDate": "2020-08-20",
            "shortDescription": "",
            "lengthSeconds": "1:19:39"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "4dk5kFXNCNg",
            "fillerWordCount": {
                "uh": 114,
                "um": 223
            },
            "readTimeFullTranscript": "44 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "street": 22,
                "block": 21,
                "police": 20,
                "drug": 18,
                "numbers": 14,
                "shootings": 12,
                "chair": 11,
                "agenda": 10,
                "violence": 10,
                "streets": 10
            },
            "wordCountSummary": {
                "shootings": 6,
                "street": 6,
                "block": 5,
                "police": 4,
                "drug": 4,
                "terms": 3,
                "jobs": 3,
                "ways": 3,
                "security": 3,
                "work": 2
            },
            "fullTranscript": "Hello, yes, good evening: this is ray roberts speaking everybody's on mute, ray, okay, I'll just stand by. Thank you, okay. The meeting will be starting momentarily, we're just waiting for the chair, so hi good evening. Everyone, my name, is Charles Powell, I'm the second vice chair for Community Board 10. Just to let you know, Charles Johnson, the chair of public housing, the public Housing public safety, I'm chair of the Housing committee will not be on this evening's call. So he's asked cicely Harris our chair of the board and myself to you, know to back him up and so we'll be co- hosting this meeting. I just wanted to ask whether or not we have our you know. First of all, does everyone have the agenda and Shatik? Can we just share the screen and put the agenda on the screen? Shitty yep give me one. Second, okay, do we have Stephanie mcgrady from warm on the call? That's up yet Mcgregor is her last name, I'm sorry Stephanie Mcgraw from Wilm, oh Stephanie Mcgraw. I was reading the agenda and it says Stephanie Mcgrady, so it's Stephanie, mcgraws Sorry Stephanie is Stephanie Mcgraw on the call, as of yet okay. So again just want to welcome everyone Shatik's going to put the agenda on the on the screen. As you can see, you know we are. You know just going to start out with welcome and introduction. So I've already introduced myself, I'm Charles Powell, I'm the second vice chair of Manhattan, Community, board, 10 and the chair of housing, and why do not we just ask board members? You know to introduce themselves Donna Don, Gill, Board member vice chair of housing and a member of public safety. Okay, do we have any other board members on who can introduce themselves? If not, we can go to our guest sedaria. How are you I think, you're on mute, so we need to unmute. You know our guest for now city. Okay, can you hear me now we can my dear? How are you I'm doing well, thank you. Sidaria Asbury Crestfield, representing the Mount Morris Park Community, Improvement Association, as well as the greater Harlem coalition thanks to David, can others just introduce themselves. I guess I'll take the opportunity, sorry that I'm not able to actually get a visual with with the meeting, so I'm participating by phone. My name is Raymond Roberts. I am my family has a residence here in Harlem since the early 80s and I live between 123Rd and 124Th Street on Malcolm X Boulevard, and I am part of a rather informal group that we are putting together amongst my neighbors to address some of the issues that have been going on in our neighborhood. We're concerned, members of our community. We and we call ourselves informally, Malcolm X, Boulevard, United, Citizens Group excellent, welcome, thank you and we have do. We have anyone else, that'd like to introduce themselves on this call hi. My name is Jacques Brunville, I'm here representing the Manhattan district attorney Sy Vance. Usually the director of our Manhattan office, Linda, Jones Janae, usually is here for the public safety meetings and she has asked me to cover for this session and I'll be happy to present when my time comes. Thank you. Thank you. Josh welcome anyone else like to introduce themselves before we move on yeah hi. My name is Ruth R Murphy, I'm just a resident in the neighborhood. Well rhutar, not just the resident every resident is important. So thank you so much for joining this call. So anyone else like to introduce themselves while we take this opportunity. Okay, so I'm looking at this. You know this agenda. Covid-19 community concerns since we're still waiting for Miss Mcgraw for more I'm assuming she has not joined yet, certainly nothing but complementary. You know you know comments from my end regarding the work that is going on and being carried out by warm and, of course, you know by street corner resources critically important to many of the issues. That's on this agenda, so I'm looking at you know, cobra 19 community concerns fireworks. You know I've been in public safety meetings previously and obviously, there's been a lot of conversation. You know regarding you know that period of time it seems like it was a couple of months where you know we were dealing with fireworks on a daily basis. I'm wondering since Mr Johnson is not on this call. Does anyone else on this call? Have any concerns you know or continue concern. You know regarding fireworks in your neighborhood cedaria, whether it's your neighborhood. I know we heard from the Malcolm X Association and a couple of other concerned citizens. Does anyone have any other concerns that should be brought to our attention this evening regarding the continuation of fireworks? Okay, because I really did not, you know, did not believe that was, you know still an issue, but again, if you do, you know, please feel free to share that Shatique Mitchell is on this call we'd like to hear from you guys. You know with respect to any issues. So that's all business we're going to again wait for Miss Mcgraw on new business. You know community shootings, you know and updates, and I certainly know that and I'm sure when cicely Harris joins the call she's been on lots and lots of calls. You know regarding that I was on a call actually Jock with with the district attorney side vance and the greater Harlem chamber of commerce. About a week ago, we had a lot of discussion regarding you know the issue of shootings, so I'm going to see Jock. Would you want to weigh in at this particular point in time and talk about what your office has been doing and then I do not believe anyone from either the 28th or the 32nd precinct you know has joined this call yet so Jack. Let's turn to you and just let's hear some things about what your office has been doing very proactively on in regards to these shootings that have been plaguing our community right. Thank you Charles! So first I just want to mention that you know, since Covid-19, all of our victim services have gone completely virtual and remote. We definitely like to make sure you know throughout the cove. The messaging for victims primarily, is that this, despite the pandemic, we're really urging victims to reach out to make 911 calls and to take advantage of the various types of services that our office provides to victims in terms of Shootings Sci- Fence. As you said, Charles has been very proactive in really going out to the community and fielding the different types of concerns that community members have. I think, whether it's in Manhattan or Brooklyn, throughout the five boroughs, really, we we've seen an uptick in crime and particularly in gun violence. There are. There are things that the D.A himself is thinking about. Doing one of those things may be a potential gun buyback program, but there are many things that that our office is looking to do. One thing that our office does between the community partnerships unit that I work in and our crime strategies unit is that we try to map out and navigate where exactly some of these shootings are coming from, where exactly some of the guns are coming from, and you know our Ada's work diligently to try to make those connections and prosecute those cases outside of that. What we do from a community partnership unit perspective is we try to bring in resources and bring in partnerships, in particular communities where we've seen high crime rates develop over the last couple of months? I'll give you a personal experience right now, I'm working on the upper West side with the frederick douglass houses and the wise towers to address some of the gang violence that has been plaguing the more youth populations, especially between the ages of 14 and 18.. We have. We also have coordinators working throughout the city, particularly in east Harlem, myself in central and West Harlem, and in Washington Heights to really try to bring in resources support the various events that are happening just last weekend. We actually attended Stephanie Mcgraw's event that was all about building awareness around these shootings and bringing people together. So we are working very diligently throughout. Very you know, various ways, whether it's with our Ada's or out in the communities to really address this uptake and violence. So before we turn Jack, I just have one question. It certainly was addressed on that call. With district attorney. Vance we've been hearing a lot about. You know the fact that the police are doing their part. Arrests are being made and there's a concern about. You know what happens either through the prosecution process, or certainly with respect to what judges are doing and we've all read. Recent examples of you know certain persons who have been engaged in gun, possession or crimes relating to guns. You know being released on no bail. So can you talk a little bit about how your office you know is addressing that in terms of what some of the criticism, even from the police commissioner himself says we're doing our jobs, the Da's are not doing theirs right, I mean, even if you look at the numbers that the NYPD has produced, the recidivism is not as a result of people coming out on bail, so I think it really depends on which numbers you're looking at and where the correlation falls in some ways. You know the legislator, with the recent bill reforms has forced. You know our office to abide by those certain ramifications, but in terms of violent crimes like gun violence, those are looked at very carefully in terms of who should be and who should not be released on bail or on their own recognizance, and I just like to point out that, even if a person you know, even if bail, is posted, that does not deny the person the opportunity to post that bill and still be able to go home. So it really depends on the particular case that you're looking at it really depends on the numbers, but even in terms of the numbers that the NYPD has released, there does not seem to be the same correlation. So is there anything that you could suggest this evening or then I'll turn it over to our guests and other board members? If they want to address this agenda item anything that you could recommend from public safety? You know this committee or from the board. You know the community board itself as to how we can be of help and assistance and with your office or you know, and obviously we'll speak with stephanie when she gets someone and others you know what can our community board do to be of help? That's you know, that's a good question. I think a lot of us are really trying to figure out what we can all do. You know. One thing that I would like to at least do for now is to leave my information available and accessible to the public, so that folks can reach out to us with any ideas that they may have, because we're very much about supporting the community from the ground up, and I think it's community members that really have a keen sense on what may be best for their communities, and we want to hear those voices first before we reach out with that top- down approach. So can you put your information into the chat if you have not done that already, you know so that we can. You know all have that, and I see that Sicily Harris has joined us, so I'm going to ask cicely to weigh in on this, because I know she's been doing. Excuse me quite a bit. You know working with warm and sweet. You know corner resources, so cicely we're on the subject. You know in the agenda of the shootings, hello, everyone I apologize for being late had another meeting, but yes, we have been very dedicated and diligent about being involved in a lot of the organizations that are especially those cbo's that are out there on the street corner resources. They were on our meeting last month. Public safety, but we continue to partner with them, continue to be intimately involved in what they're doing we are doing- and I do not know if jacques did you talk about the Harlem play streets that some of the organizations are doing. I do not know if that came up already. I did not mention that, but play streets has been an initiative directed towards combating some of that spike in crime. Yes right so every saturday for the month of August, we're partnering with, I believe it's like 15 organizations, including your office shock about being just present on the street and we're seeing that as a way to combat a lot of the violence just being out there in the open and being present and positive. So from 12 to six- and I do not know Shatik. If you have that flyer, I know there's three right now: 115Th street, I can try to pull it up, one at 155Th, 115Th and then I know 117Th 143rd is opening it up to 1.3 between Linux and Adam. So let me find that, but those are the streets that they're sponsoring so we're working with parks we're working with D.O.T to have like real activities there. So there's going to be wall, climbing and jump roping people there'll be hoops. Basketball play basketball, hoops, some of those bouncy houses for kids, Ice cream, icees Djs, just to have a present a positive presence on the streets there. So that's one of the things that we're doing, but I also send out to our board members a protect your block agreement that we have and it's about just being a good neighbor, and it's about just encouraging young people and it's not if you it's not always being the one to report, something but being cognizant and being safe for yourself as well. So I do not know if I take you if you have that to protect your block fire that that's out there, but it's a community agreement and all the committee boards have agreed to it, and every single elective official has signed off on it from your councilman. Your assemblyman district leaders they've all signed off on these, protect your block, flyers and agreements. So we're doing a lot to try to remedy these things, but there's a lot that still needs to be done and we're talking about like economically. What can we do? The reason why I'm late as I was on another call, with some of the Manhattan community board chairs, to talk about overall issues that you know that are on the ground that are not, that are the probably the true solutions to the things that we are seeing and for me, it's economics, because once you fix that great divide, you're going to have a trickle down that affects a lot of different things. So hopefully there'll be some new initiatives that are just rising out of our community boards as a whole. So not you know, God bless our elected officials, we vote for them. We expect them to do what we're asking, but at the same time we have to take an onus of what we need to do so for us community boards. We are trying to come together to come up with our own initiatives, so I'll be talking about that more next week in our executive board meeting asking for suggestions, because I'm going to take that back to the other 12:11 excuse me chairs and have a real conversation of how we can affect change from our level here as community board members. So cecily. I just had one comment about the you know the Harlem street initiatives. I you know I my church is involved first- year. Indian baptist church is involved with the one on 115Th Street one comment: I thought it was very difficult for people to really feel attracted towards. You know the street situation with all the cars parked there. I know I was out there for a couple of hours and you actually had people that were literally trying to navigate through where the Play street portion of it was. Is there any thought about? You know the fact that if you're going to open those streets, are you going to close it to traffic? So that's not that traffic, I should say parking for parking. So that was one of the things I'm going to talk about with Christina. Today we did have a call, but I was unfortunately unable to get that call because I work call, but I brought it up to Christina and Brian Benjamin's office that there needs to be more yes, pre- planning, and that comes from you know, connecting with NYPD to make sure that they're posting those signs for the cards to be moved, so they have notice, and that needs to be. You know, kind of talked about so yeah. We are going to address that. I do not know what's going to happen with that, but I do believe that would affect it and be better. But again I'm going to talk to the organizers to see if they can make that happen. Okay, thanks for that, thanks so cecily. I know you've spoken to Charles Johnson. So I'm going to turn this over to you. I think we were waiting for Stephanie Mcgraw, it was her name was misspelled in the you know in the meeting agenda. It was so thank you, Donna, gill, for correcting me on that you and we did cover the community shootings and you've now addressed Harlem street initiatives. So I think we are opening it up for any questions really quickly. Volunteers need the volunteers so on the next saturdays going forward and we're back on our e- blast. So I know you've. The community has missed us a little bit since we did not have our constant contact, but now we have a new system to really reach everyone, so there are needs for people to in a social distance thing way be out on the 22nd and the 29th on some of these play streets because they just need people to help serve. There's going to be there's not going to be food there, but there's popcorn. They want to make sure that that's out there water and that people are social, distancing and being safe. Sometimes we have little kids out there, so they just want to have folks out there to be helpful. So I do have it pulled up. It's 127th street between Adam Clayton, Powell and Frederick Douglas Boulevard, that's one from 12 to six on Saturday and then mccoombs place between 151St and 152nd, that's 12 to 6 and then 115Th Street between Adam Clayton, Powell and Frederick Douglas Boulevard from 12 to 6.. So those are the streets that we're focusing on right now and community board members and community definitely feel free to once you go there, there'll be a representative from either Brian Benjamin's office or one of the elected officials, and you can tell them you're there to volunteer or contact us and we'll give them your name. So that is my wrap up on Play street. I'm not going to talk about anymore. Let me try to go back to the so. Do we want to open up the discussion? I know there are a number of community persons and I see some other board members Terry Wisdom, Lashonda myers that have joined you know the call so welcome. Do we want any, and does anyone want to comment? You know regarding what we've been talking about in terms of community shootings and now this Harlem Street initiative before we go to resident concerns on 123Rd 124th yeah hi. This is our Rutherford Murphy I mean Jacques. He told us that the Ag's view is that the changes to the bail regulations is not really driving the shootings, but maybe he could tell us what the Ag thinks is driving the shootings, because I think these Harlem street initiatives they sound like a great thing on a good day, but you know my concern is: are they the right sort of interventions, or should we be doing some other sort of interventions to address the the shootings yeah so just wanted to make a quick correction before I get into it? I represent the Manhattan district attorney, Sai Vance and not the attorney general, but in just talking about the gun, violence, you know there's two possible con conclusions. One of them is that you know community members are either not reporting. You know you know where they think it may be coming from, or you know not making appropriate 911 calls when these situations do happen. Another situation is that you know we our office does not know if victims are not following through and that's why we really encourage that when these shootings happen, that victims follow the processes in our office, get interviewed by an ADA reach out on get interviewed by our crime strategies unit so that we can really pinpoint these things. Those are the two possible conclusions that can really be made. The numbers just do not the numbers on the people that come out of bail and the numbers on the people that are arrested for incidents of gun violence. Those are not the same people, it's a point. Eight percent of the people that are released one person since January was arrested by the NYPD that was related to a gun violence incident. So I just want the community to be very clear that, in terms of numbers that correlation just does not exist outside of you know what the news may be. Sharing, but tracking this down really comes down to a community- based effort to really work with NYPD and work with our office to track down where exactly these guns are coming from. So if there, if there are no other comments seriously, I think we can go ahead hi good evening, everyone. I do not know all the details, but I do know that our assembly member Al Taylor, also which I guess is in conjunction with us- has a something like take back the block and he's doing like 30 days in different neighborhoods, where they gather you know on a corner and it's a group of people and they walk around. So that is something that's happening, but I think, maybe from Aisha Seku and some of the churches, and you know we need to understand, like what is going on that. These things are happening, I mean, is it gang related or you know, is it? People are just like freaked out from Covid-19? You know what is what do we think internally is causing that Spike and I think you're right cicely when you said economics, because you know obviously there's a lot of disparity, a lot of economic stress, a lot of lack of education and so on and so forth. So but I think we as a community need to get to some understanding of that, and also I guess this is tagged with groups of young people, but you know I know I went past the park. I do not know if it was a pre- rucker event, but the park that's on 145Th. They had like 500 people in there for the basketball thing there was no social distancing at all. Nobody had masks on, I mean so I was like okay. What is what is that about? Because that really has to do with the public safety as well, but I think we have to try to figure out from the internal. What is it that is making this happen? You know so that then we can maybe get to some of the root of it. You know which obviously we're not going to be able to get to all of the group, but if we understand like what's going on, is it one game against the other, or is it just people random like what are the what what's happening? I think that would be helpful and then we could begin to address it and have some conversations, but it's going to take many aspects of the community from the clergy to the schools, to the young people. To the elders I mean it's obviously a systemic problem in our community. I agree with you Terry, so there's a there's a lot there and I think it's a myriad of issues that are is causing it. You know it is Covid-19 related. You know our community was already in a place economically, where we were not giving the opportunities the same as anywhere else, but at the same time people are losing jobs and when you're losing jobs, you're looking for ways to make quick money and ways to make quick money are usually some ways that leads to some things that are not that safe and not that sound. There's a there's. Gambling that's increased. If I do not know if you've noticed it sometimes on the corners there's gambling, you know when people are drinking and gambling and somebody loses their money and people have a gun, then sometimes those situations in that way. So there there's a there's a myriad of things. There is, you know: crew, slash, gang violence, that's going on that sometimes inter intermix, not maybe gang against gang, but it could be said against set, there's a lot of that going on too. But that also boils down to the economic issues that we're talking about. So you know if you, if you I'm, not saying that you would not be not affiliated with said gang, but gangs bring about sometimes economic stability to a family. So in some of the things, maybe not the right way, but at the same time it still does. So. I think that you know when we have talked to NYPD about some things and, most importantly, talking to the young people when we're out there. So I have been on some of those occupy the corners and occupy the night with street Corner resources and Al Taylor and bringing young people to the to the to the site. So they can speak honestly and anonymously about what's going on. I think that's one thing, and once you are able to gain trust and that's why it's important. I know these daytime activities. They may seem like what are y' all doing, but I will say that once you know, young people start seeing you around and it's not you're, no longer a stranger and you're, not they're, not a stranger to you and you're, not a stranger to them. They tend to talk and even in my neighborhood just being out and about more, of course, with my mask and always promoting social distancing. I've been able to talk to some young people, not that they're like telling me a lot of things, but it's a conversation and it's a trust that comes there and I think it's important for us, especially people of color, to start having more of those conversations and being visible it's hard now, because we have Covid-19, but at the same time, if there's any way that we can do it, I think it does sometimes in many ways make a difference. So if there's not any more about that, we can move on. But if anyone has any before comments, another question just needed to let you know: Cedaria Asbury Crestfield has a time limit. So I'm sorry! Okay, let's go, I just want to help come back to you, Terry, because she has literally less than 10 minutes before she has to get off so Sedaria go ahead. You know go ahead. If you do not mind Madam Champ. No, that's fine! Hi sadaria! How are you Terry? Thank you thanks, terry how's, it area, hey, actually is Raymond still on the phone Ray Roberts Ray Roberts. This is this is actually all about Ray Roberts and his block I'll just I'll just pick up for him. I think we're all pretty much aware of. What's going on 123Rd 124Th, 125Th, Lenox Avenue, we see the oversaturation and I do not want to beat a dead horse. Raymond who's, not who's familiar with. What's going on because he's right in the middle and he's always having these drug dealers actually dealing in front of his house and not being able to do anything about it, he's coming to the Community Board and seek of support. What I wanted to bring to the board today was the fact that I met with the police officers on Wednesday, after speaking, to the commander and walked with them over to the methadone centers to have a conversation with security, as well as with their director of services, so just to speak about security quickly, all three all three facilities, that's Harlem, United, Kaleidoscope, Slash, start and Mount sign up, that's Israel. They all have security, people that are supposed to be outside patrolling the area. They do not all go around the corner, so start slash kaleidoscope as an example. They only go from in front of their building to the exit of whole foods, which is not enough. That's just not enough patrol, because their people are hanging out, acrosss the street on 125Th Street and Lennox Avenue and around the corner as well. What we want to do is get these people moving and get them off the block. So they told me that the people at Beth Israel and Mount Sinai that they're not doing their security patrols either. So now you have all of the security people. You know talking about the other and what we need to do is put together a plan and preferably with the police department, because they're supposed to be doing patrols as well. So when I spoke to the police officers that accompanied me, I asked and says well, do you guys get out of your car and you know try to move people along. So the answer was if it's cold outside well, then, of course we do not go out, and if it's raining we would prefer not to go out, and I said you know I got it, but what I really got out of it was no. They do not get out at all, because if they did, that would have been the first thing. They said the other thing, and this is going to the directors now when I spoke with the directors. My concern was that they were adding new clients to their methadone dispensary list every you know every year, because for the past two years in particular, the number has grown, and it's totally outrageous and I wanted to address those numbers well. This is what really surprised me. They have not increased their numbers at all and in the case of Mount Sinai, that's Israel. They actually decrease their numbers a bit. Now, it's not! That was their intention. That is just what has happened so as an example, Mount Sinai has 600 clients, but they have the capacity for 800 clients. So that does not mean that the other 200 are not coming. You can bet your last dollar that they will. When I spoke with Kaleidoscope, they have approximately 660 people, clients that visit them on a daily basis as well between their two, their two facilities, and they said that they have not increased their numbers either. So, after speaking with the police, because now I'm saying, if we have all of these additional people, why are they here well they're here? Because with the defunded police effort, the first thing they took away was the undercover narcotics detectives so they're no longer on the street and the drug sellers dealers know this and that's why? When you walk down the street they're dealing in open air in the middle of the day, because the only way that they're going to be arrested is if a uniformed police officer sees them making the deal and make the arrest? And you know that's not going to happen- you can spot an officer in a car or uniform a mile away. That's why we're losing this battle because we do not have police officers out there. So my next meeting will be with the commander. He comes back on the 17th he's on vacation and I'm going to try to put together a plan along with the greater Harlem coalition, where we can address what's happening with the police and hopefully get them to work closer with us, because if we do not, we will never win this fight so cedaria. Thank you. I see that Mr Roberts you're unmuted yeah. I want to add something to that. Absolutely yes. First of all, I'd like to thank Sedaria for shedding some light and understanding for myself regarding what I also agree is has a lot to do with the source of the problem we're having here on our block regarding the public daily heroin sales and use by strange people. When I say strange people, I mean people, you know having lived here for a number of years. You know when you notice that there's just a like a whole army of strange people, even though you know you have pedestrians that go up and down the avenue all day, but when you notice that these people do not live here, you have to ask yourself: why are they congregating on this block? And I live on, I live in our house. I have access to our top floor. Where I can see everything like Cedaria said I can see out my window. People do not have a tendency to look up as much when they're walking around in the street, but I'm looking down on everything. So I see it and this morning and just for an example, you know when I wake up in the morning, I usually go out to take a look to see what's going on out front, if not for anything else, to check and make sure my garbage has been picked up, you know and that everything outside is looking correct. You know the way it's supposed to be be looking, and the first thing I saw this morning, which is pretty much par for the course now is two guys making a heroin deal and then you know I saw that. That's you know, that's pretty much the norm here now and then a little bit later I went back outside and I saw somebody there were like seven guys outside leaning against the Van on the corner by the bodega store just openly sniffing heroin and having a heroin party pretty much, basically their kids walking up and down the street, and you know I have an elderly mother here. Sometimes I like to take her off for a walk, and you know she. I do not want her around that. None of these people wearing masks, you know protecting themselves or anyone else. You know to add to the problem, but what I did before this meeting was. I wanted to write down a few notes I wanted to mention. You know sudaria kind of answered some of the questions that I had in her in her speaking a few minutes ago, but I want to read them off anyway, because they were my fellows and I wanted to share them with the the committee here. So the first one was well obviously the concern about the public daily heroin sales and use by all these people, and then number two was like: where did these people come from, and why did they come to this block in particular, and I would I would say that Cedaria somewhat answered those questions to a degree, because my third question? Well, let me just read on what, if anything, do local homeless shelters recently released convicts or prisoners from from you know, from being locked up due to the Covid-19 and or drug rehabilitation programs such as Harlem United have to do with this block being a de facto location for open market heroin abuse and Malcolm X Boulevard. I want to say this too Malcolm X Boulevard between 124Th and 125Th Street on the uptown side is for years been a magnet for illegal street sales of prescription, drugs and all kinds of other narcotics and the. Why has this been allowed to continue for so long? This has been like that for years now and who is responsible and what can be done about it? You know the activity from that block it appears is, has migrated down the avenue. You know it's overtaken our block. You know Cediria mentioned a lot of things about what's going on with the police as far as the undercover, so I understand now, but it's obvious, you know that these people have the feeling or the understanding that they can come here, and this is the place to come to do that and I do believe, like Cedaria said it has something to do with the programs, the Harlem united program. You know, I think, those people that have been standing outside for years now in front of between 120 fourth and fifth streets on Malcolm X, Boulevard they've been out there for years. You know every time I go outside. I woke up that block. You have to make your way through a maze of people. You know that asking you what kind of pill you want to buy, or you know or selling pills- and they sit out there and do that all day from the morning time until evening- and it's obvious you know- nothing's been done about it. So it's just the whole problem has just gotten worse and worse, and I have to say that this was something that was going on before Covid-19. So to a degree you know I have to say you know it has something to do with cobra now the blow up of this, but this has been happening before Colvin and I just asked myself you know: is this a plan or something? What kind of you know what kind of responsibility are these programs happen for their clients and, if they're not able to manage their programs properly, you know perhaps they should not be in our neighborhood and if there's a way for me to for, if, as I continue to listen to the concerns and the meetings that you all are having, which I'm glad to be a part of and honored to be a part of you know in my mind, I'm thinking I'm going a direction of. How can we get these programs out of here because they're not bringing any if they can't control their clients and their clients are adding to the downfall of our neighborhood due to their mismanagement? Then you know they're not helping anyone the drug dealers, they know where to come. They come here to prey on those clients and it's like a perfect storm, so you know I just want to know what can be done about the. How can we put pressure on these programs to act appropriately and be responsible and accountable for lack of management? Mr Shatik? So let me let me respond and then I'll, let out here from any sicily. I do not know if you want to go first on that, because I certainly know that, for example, Cedaria knows this as well as others on this call that our health committee, our Public Safety committee, Mr Roberts, have a Dr has addressed this. You know on several different occasions: I'm not suggesting that we should not. You know, go ahead and you know- and now really you know re- address it. You know, because, obviously you know you are absolutely correct. This is well before Covid-19. and everything that you've addressed and identified so dairy. You can tell him, you know the fight that we've had about Mount Sinai, the you know the fact that we've talked about the density. Our board has a resolution. You know that we, you know you know have addressed. You know the issue of the oversaturation of our district. You know, especially the neighborhood that you folks are talking about right now, there's no question the impact on businesses, the impact on residents, the impact on safety. So I know we have addressed that and I guess that will be one of the takeaways from this meeting we may as we get into our new year in September as our community board. You know we need to see how public safety, health and other committees can address it. Sister. You want to answer that. Well, I just I just agree, and I do thank you all for bringing this back up it because it sometimes it means, and if you're not walking the streets. I have seen it so since I am a constant walker in the community, but I feel that in Mr Dairy you do know that you know earlier in the fall in the winter, we were having those meetings and keeping those conversations and keeping that this alive- and you know since Covid-19 has happened, there's been a decrease in the amount of what we're talking about and this issue. So I'm glad that we're bringing you back, I still had a conversation with the 125Th Street bid about it. Wanna talk to Dr dukes and bring health back into it, but we do need to keep having a conversation and talk to NYPD about enforcement. I saw Donna Gill's comment in the chat that, yes, they had brought. They had been taken under covers off the corners and stopping snooze sets that's the plain clothes cops, but not undercovers anyway. They've been stopping snooze for the past three or four years. So this is just an increasingly. You know unfortunate storm of events and would now defund the police being this topic. This word this buzzword. I do not see that those units are coming back anytime soon and it's not that we needed to get rid of those units so much, but there need to be a revamping of the policing in those units. I am speaking in my past job form, but that's those are things that we definitely want to keep having those conversations. So thank you for bringing that here today and I believe that you know Charles and I will bring it up to Dr Jukes and maybe even start revisiting those things, because there is a disproportionate number of the mental health clinics here and not mental health clinics, mental drug substance, abuse clinics, subjects, clinics. You wanted to add anything to what we're saying yeah. I just want to thank the constituents. For always, you know, reaching out to the district office with these type of issues and any time that I get a constituent issue, a complaint specifically around you know the drug epidemic in that particular area. I always forward these complaints to the 28th precept. I know usually they would be joining the call today, for whatever reason, I do not know why they're not on the phone, but I would not encourage to keep the dialogue open for the constituents who are making the complaints I'm going to get familiar with the NCO. The neighborhood coordination officers also to attend the monthly Community council meetings of the 28th present. Also, I just want to let everyone know that the office of the Special Narcotics prosecutor is also a viable option. If you feel there's not enough plainclothes officers by NYPD, you know, there's investigations that have been started from constituent complaints that were directly through the office of special narcotics and you can afford you can afford those complaints to me. You can email them to my office. If you want to be anonymous, you can do that and I'll make sure that the office of the special narcotics receives those complaints. I know last year we did a play street. I think it was on 123Rd street between Frederick Douglass and Adam Clayton Powell, where a drug gang you know had been taken down. They had done like a year a year. Long investigation they brought the the gang down and the money that they got in the legal proceeds of that the gang profit from they invested it back to the pal and was able to put on programming in the community. So I think that we need to be vigilant. I think that you know it's good, that you're coming to get support from community organizations such as the community board. I would urge constituents to place 311 on calls, because, sometimes just looking at it, you know from out of your fifth floor window or sixth floor window. Looking down on the street, it's not enough. You have to put in a 3- 1- 1 call because the city, it's a numbers game. They look at the numbers, they see. You know where this is an issue and then they respond accordingly and I'm not saying that people are not putting in three on ones, but I'm just saying you should be vigilant and continue to do it. I mean if this is a big issue and clearly it is a big issue. Then there should be at least 20:30 calls a day. You know so. This is definitely on the minds of NYPD and specifically on the 28th preset. Okay, yes, we can go ahead. Go ahead. We hear you, oh okay, good, it's Jacqueline Joseph! You know I'm your neighbor and I really appreciate this forum and I get to see some faces that I can now attach a proper name to so that's also good as well, but as ray as you know, we've been away for a while. We came back and I felt like I walked back in time. I felt like I was entering in 1972 again I went out today. I saw some things that I have not seen since the 60s and the 70s you had mentioned earlier that there were there was open pharmaceutical drugs being sold well. I have not seen that until today, a suitcase full of pharmaceutical drugs being sold openly on 124Th and Malcolm X Boulevard. It embarrasses me that we have such a name with such activity going on these boulevards, it's so problematic, and so disrespectful to me once again, I'm on I look up my window and what I see is just totally unacceptable. I fear for the children that may have to return to that school. I fear for the my tenants who are afraid to come out of their homes. It is it's just unacceptable. What is going on in our community and the fact that it's in our community and we have made these complaints year after year after year. I feel as if it's on deaf ears, that what is happening up here is happening to us and it does not seem to matter, and that is disturbing to me. That is very disturbing to me, because that's where the anger comes in and with anger comes confusion and with confusion comes violence and it's problematic, but there's always hope like a man says, and I look forward to working with you as a group sedara, I heard your name before and now I have a face to it. I was told to do exactly what Ray said or not ray. The gentleman said call constantly call 3- 1- 1. I was given that advice by your dear friend, Deborah and so far I've done that. But once again someone had mentioned we need to do more, has to be done now. What that more looks like I'm going. To be quite honest, I do not. I do not know, because we write letters. We talk to our politicians. We talk to the police department. We I confront them in front of my home by asking them to pick up the trash. Do not leave it there I'll take it. I mean I I'm. What else can I do what I mean? I call 3- 1- 1. I do what I'm supposed to do as a citizen. I do not know if I can be heard, but one of the things that we really need to do is to stop making excuses for our elected officials and or the police department who's supposed to protect us, because we do not get a discount on our taxes. Just like everybody else have to pay. We have to go full fair. This thing was happening before Kobe. Limiting on Kobe is a is a is like a beard. It's not right. This thing has been going on for years and right trying to say well it's because of Kobe why the police is not doing their job. No, we need to hold them accountable. Also, we should we do not have to. We should not have to go to the police with our hat in our hands, because this thing does not happen. You go 20 blocks south. You do not see any of this nonsense going on. They just ran some the homeless out of Hell's kitchen when the restaurant's down they wanted to open. We have restaurants along here that are suffering, and these are business people and they're suffering with this. With this nonsense, so we need to stop the hat in our hand, attitude and literally let these people know we mean business. That is my. That is my take right. Thanks for making the case and severe, I think she's gone yeah Cedaria, you know has left, but thank you all. I mean I think, we've you know, there's no question. We've heard you if there's any take away from this, I do not want to talk, but I want to thank you also for responding to my email, siddique. You were very and you're much on top of that, really that's the type of response that we need from our leaders in our community. Thank you. So much agreed. So you know. Bottom line is as cicely Harris as the chair of the Community Board has made a commitment. You know I'm the second vice chair I joined with that commitment. We're going to raise this in our next Wednesday's executive committee meeting we're going to talk about. You know this to our chair of the Health Committee Dr, Hazel Dukes, and we're going to coordinate you know some things and you'll be getting back. You know, you've done your part and thank you for continuing to do your side of it. You've made your 311 complaints. The Good news is that there's a recording of this meeting and Shatik, I think you know we need to be able to say to the representative of the 28th you know and 32nd precinct. They need to. You know to listen to this recording you know and we need to hold their feet to the fire to say what are we now going to do about this, and I and I agree: listen I'm a hall of mine for life for life, so Miss Joseph. I remember what you were referring to in the 60s and the 70s. I remember when that block was you know, was open market. You know for everything, Heroin Marijuana, you know everything you know, and so now is the community that you know requires some attention. So we hear you and I just wanted to go to Donna. I saw that you had something in the chat. Did you want to say anything on this point and then Terry? I know you had some comments that you wish to have made and because we're at the end of our agenda right now, go ahead, Donna. Well, basically, what I wanted to say is I'm on the health committee and we have been trying to battle this issue or try battling this issue for quite a while. We have a moratorium on drug treatment centers. The city does not have equal distribution of drug treatment centers, most of them, a lot of them are in our community, and that was by design. Now that our community has changed, you know, maybe we can go to. We have been going to them speaking to them about. You know, changing the demographics getting some of these treatment centers in other areas and that's the work in progress, but then I also have to say that. Well, I had two things to say. First of all, I said you know the defund, the fact that the police officer said to sedure because of the defunding. We are not out there, because the special narcotics and units are not out there and all of that- and you know, sicily made it very clear that has been happening way before this whole thing. I feel like the fact that they do not come out of their cars and do the policing that they're supposed to that is a travesty, and that's something that we need to speak to the peace and commander about the fact that we have all of this open drug dealing or drug abuse in our community has just happened is things you know it's by design it's by design, but then again, I also want us to think of these people that we're talking about like they are. You know olgas or these strange individuals. These are people like us. These are human beings, and you know we have to think about. They need treatment, they need. You know, services all of these things, so I know when we get enraged about what's going on. We also have to look on the human side of this whole episode and start to think to rethink. You know when we say these people, it's just like other people, saying black people, you know, so we have to be very careful about what we say and how we say and that's basically all I have to say thank you. Can everyone hear me yeah? I just want to say I agree with what you just said about understanding the compassionate side and the humanitarian side of these people. Obviously they have a problem. It's a health problem. You know this leads them into criminal activity. It's a health problem, primarily, I agree with you with that and that you know these are. These are my people. I do not have a problem saying that these are my people, which is makes it even worse, because I do not see where they're getting the help that they need. Basically, what's happened is they've been allowed to. There have been some drug programs stashed up stacked up in one location from what it looks like and what I'm getting more and more to learn now stacked up in one place. These programs are here, they're, probably making money. I do not think they're supervising their clients properly, because why are they out here about using heroin in front of my house and why? And on the other side that why are the drug dealers allowed to occupy the block with no with no no no type of consequence, because it you know, I I'm not blaming the people who are sick if they're, if you're, sick, you're sick. I understand that but sick people belong in the hospital right. It's supposed to get some type of assistance and, if you're enrolled in a program that allows you to be a prey to people who are able to just come here with no consequences on a daily basis, ride the motorcycle up and down the middle of the the block. Stop in the middle of the block all day, long in broad daylight pass out bags of heroin and that's why they come here. So you know, I understand your side what you said about the compassion. I just wanted to point that out. So let's go to thank you! Raymond, let's go to Terry! You had any comments and Charles. I had something real quick about that. Just one last thing to add about that and Donna Gill. Thank you for speaking up and being on the health committee. One of the things that we have talked about and what we do need the community to talk about and still is the need for, as you all mentioned, these health or these centers that come in the treatment centers, they need to do more than just treat one that one piece of the addiction or that one piece of the illness. It needs to be more wrap around cervicals and that's what we are asking for as well. So if we do not, we know that there is an oversaturation and we know that we do not want all of these treatment centers here. But if these treatment sensors are here, they need to be very intentional about what they're doing and how they're sending out their patients and clients into the streets to be productive citizens. So that's one of the things that the Health Committee Donna Gill and the board Dr Hazel Dukes, is addressing as well. So I wanted to put that out there that we are being very mindful about that. Terry! I'm sorry did you have something? Okay, yes, two things. One goes back to the gun. Violence is happening because somebody's bringing the guns into our community- you know what I'm saying like unlicensed guns or whatever, and I mean that's another source where our community is just preyed on, and you know these people that are shooting each other. I mean it is all our people, it is all our community and at the end of the day, with victims, where somebody is making a lot of money off of our deaths and the disparity and the other side is with the drug treatment centers I mean it already happened and, like you said it's already there, but the fact that they have three centers and maybe is four on 124th between you know: Malcolm X and Adam Clayton, Powell Boulevard, that's outrageous! That would never ever happen in another community. So it's once again where we are victims of this kind of thing. That in itself, you know, is a plan for disaster, and it has been a disaster for years and on top of that, these people that have these drug rehabs are obviously not doing their job. They are making money off of these. You know people that are ill and they're, not helping them. Obviously, if they're out on the street- and I mean this is impacting businesses- I sometimes go to the quote bodega, but it's you know really the Arabs from Yemen and they are very upset. First of all, there's an awning out there now that the parking garage is not there, so they're all congregating under the awning and they're running in and out of that store, which has one of the younger brothers who's, a worker completely stressed out because they're having to navigate with these people that are not even in the right mindset, but I'm just saying it should be a thing. Like writing. Letters is not enough at some point. We need to be able to take back our blocks the mayor, whoever else black lives matter, whoever they need to be they need to. We need to converge on these blocks and say that's it. You know enough letter writing talking to the police, and all of that is not going to do it. It's getting worse and worse and worse and worse- and this is some of the disparity that we are experiencing. You know we're getting help from no one, so I think whatever it is. There needs to be all the churches, ministers, whoever and they need to just. We need to come occupy that block for a couple of days, and these people will have to go and demand that these drug centers, because they are the source of the problem- the people come out of there and that was happening for a long time in Harlem, where the people get their method on and then there's organized rings that they sell it to and they're not selling it, because that used to happen up by Riverside and 157. They would just be trading the you know, the pills or whatever they got for drugs, so the police really were not able to get them because they were not actually selling, they were trading, but I mean all of this is what it is and we really have to take a stand. You know everybody political officials, the mayor, you know heads have been turned too long and we all are the victims, because some of those people out there somebody's uncle brother and Father and sister, and it is terrible the condition, especially that heroin puts people in. We have to do something and it's more and write a letter or ask these people that are not going to help us that have not helped us before making money the drug people they have to pay something or get some kind of ten thousand dollar fine or whatever they get the same way. The restaurants are getting a fine. If they're, not you know applying to whatever the rules are, they need to get hit with some fines and that's it. Thank you. Thank you, Terry. I have to ask you what's happening here, I'm sorry when the police show up you're breaking up now. We can't hear you he's on mute. Oh no, he was not on mute. He just, but you know it was not coming through clearly he's on mute now, Mr Roberts, we can hear you did you have one last comment. Yes, I I'll make a last comment. Hopefully it'll be my last for now, but as far as reaching out to the law enforcement, I just want to say that I have taken over 200 pictures. I have a whole video worth of pictures of drug deals and 10 bags of heroin and people riding up and down the street just doing whatever they want in this regard, and I I've been forwarding these to the to the Community Affairs Office for over a year now, and then you know during the course was formulating our little block. Group Malcolm X, Boulevard united. We have, we have had another zoom meeting in the past with law enforcement involved, narcotics north. So we have been reaching out it's not that we have not tried to do our part. You know within the constraints of the law- and I agree with what I do not see you all. So it's a little difficult for me to keep up with the faces and the voices. But I just want to say: I've heard a lot of educational comments tonight and a lot of light has been shed on things for me to consider going forward, and I agree with the last speaker that we need to have like a presence, a large movement or a group of something a day or two of some type of a large presence, a group of people that addressing this situation here on this block and not just this block but around the corner. Where these places are, you know I do not know what else to do. I mean you know it sounds like we. These things have been going on for a long time. I know what I've been witnessing and it sounds like I'm getting confirmation from the comments I'm hearing during this conference call. So what to do is the question. You can't keep doing the same thing and expecting different results. So that's all I have to say. Well again, we've heard your comments and I you know we've, given you some of the next steps that we as a community board will take. I'm sure Shatik can be in contact with you. Regarding all of that, great evidence that you have you know of what's been taking place in real time. You know, I know we're at a point now, where I'm just going to ask and sister he's going to ask: does anyone have any announcements? You know that need to be made before we adjourn this meeting, and if there are no announcements, you know then cicely. You want to make a motion to Adjourn I'll. Second, it sorry just one last thing: we want to make sure that everyone is participating in Harlem week. We have a flyer on our website and on our social media. I believe Shauti, but we just want to make sure that everyone is able to participate in the virtual Harlem. Okay. Now I will go ahead and entertain emotion from adjourned. I will be adjourned. Is there a second that's good? Thank you. Donald trump Welcome back properly, saying that we returned all in. Thank you all for attending have a great and safe evening. Everyone. Thank you. Thank you very much good night. Thank you.",
            "summary": "Has a residence here in Harlem, since the early 80s And I live between 123Rd and 124Th Street on Malcolm, X, Boulevard, and I am part of a rather informal group that we are putting together amongst my neighbors to address some of the issues that have been going on in our neighborhood.\nCovid-19 community concerns since we're still waiting for Miss Mcgraw for more You know comments from my end regarding the work that is going on and being carried out by warm and, of course.\nOne thing that our office does between the community partnerships unit that I work in and our crime strategies unit is that we try to map out and navigate where exactly some of these shootings are coming from, where exactly some of the guns are coming from, and you know our Ada's work diligently to try to make those connections and prosecute those cases outside of that.\nCan you talk a little bit about how your office you know is addressing that in terms of what some of the criticism, even from the police commissioner himself says we're doing our jobs?\nYou, know our office to abide by those certain ramifications, but in terms of violent crimes like gun, violence.\nOne thing that I would like to at least do for now is to leave my information available and accessible to the public, so that folks can reach out to us with any ideas that they may have, because we're very much about supporting the community from the ground, up, and I think it's community members that really have a keen sense on what may be best for their communities, and we want to hear those voices first before we reach out with that top- You know working with warm and sweet.\nYou know in the agenda of the shootings, hello, everyone I apologize for being late had another meeting, but We have been very dedicated and diligent about being involved in a lot of the organizations that are especially those cbo's that are out there on the street corner resources.\nSo every saturday for the month of August, we're partnering, with, I, believe it's like 15 organizations, including your office shock about being just present on the street And we're seeing that as a way to combat a lot of the violence just being out there in the open and being present and positive.\nSo, that's one of the things that we're doing, but I also send out to our board members a protect your block agreement that we have And it's about, just being a good neighbor, and it's about just encouraging young people It's not if you it's not always being the one to report, something but being cognizant and being safe for yourself as well.\nThe reason why I'm late as I was on another call, with some of the Manhattan community board chairs, to talk about overall issues that you know that are on the ground that are not.\nWe did have a call, but I was unfortunately unable to get that call because I work call, but I brought it up to Christina and Brian Benjamin's office that there needs to be more yes, pre- planning, and that comes from you know, connecting with NYPD to make sure that they're posting those signs for the cards to be moved In the meeting agenda.\nThe community has missed us a little bit since we did not have our constant contact, but now we have a new system to really reach everyone, so there are needs for people to in a social distance thing way be out on the 22nd and the 29th on some of these play streets because they just need people to help.\nYou know regarding what we've been talking about in terms of community shootings and now this Harlem Street initiative before we go to resident concerns on 123Rd 124th He told us that the Ag's view is that the changes to the bail regulations is not really driving the shootings, but maybe he could tell us what the Ag thinks is driving the shootings, because I think these Harlem street initiatives they sound like a great thing on a good day, but you know my concern is: Are they the right sort of interventions, or should we be doing some other sort of interventions to address the the shootings I represent the Manhattan district, attorney, Sai Vance, and not the attorney general?\nThe block And he's doing like 30 days in different neighborhoods, where they gather you know on a corner and it's a group of people.\nSo, but I think we as a community need to get to some understanding of that, and also I guess this is tagged with groups of young people, but You know I know, I went past, the park.\nI do not know if it was a pre- rucker event, but the park that's on 145Th. They had like 500 people in there for the basketball thing, there was no social distancing at all.\nYou know our community was already in a place economically, where we were not giving the opportunities the same as anywhere else, but at the same time people are losing jobs and when you're losing jobs, you're looking for ways to make quick money and ways to make quick money are usually some ways that leads to some things that are not that safe and not that sound.\nI think that you know when we have talked to NYPD about some things: and, most importantly, talking to the young people when we're out there.\nI've been able to talk to some young people, not that they're like telling me a lot of things, but it's a conversation.\nThis is this is actually all about Ray Roberts and his block And he's always having these drug dealers actually dealing in front of his house and not being able to do anything about it , he's coming to the Community Board and seek of support.\nToday was the fact that I met with the police officers on Wednesday, after speaking, to the commander and walked with them over to the methadone centers to have a conversation with security, as well as with their director of services, so just to speak about security, quickly, all three, all three facilities,, that's Harlem, United, Kaleidoscope, Slash, start and Mount sign up They all have security, people that are supposed to be outside patrolling the area.\nThe first thing they took away was the undercover narcotics detectives, So they're no longer on the street and The drug sellers dealers know this You walk down the street they're dealing in open air in the middle of the day, because the only way that they're going to be arrested is if a uniformed police officer sees them making the deal and make the arrest?\nLet me just read on what, if anything, do Local homeless, shelters recently released convicts or prisoners from from you, know, from being locked up due to the Covid-19 and or drug rehabilitation programs such as Harlem United Have to do with this block being a de facto location for open market heroin abuse and Malcolm X Boulevard.\nYou know, I think, those people that have been standing outside for years now in front of between 120 fourth and fifth streets on Malcolm X, Boulevard they've been out there for years.\nYou know, we need to see how public safety, health and other committees can address.\nI do not know if I can be heard, but one of the things that we really need to do is to stop making excuses for our elected officials and or the police department who's supposed to protect us, because we do not get a discount on our taxes.\nYou know it's by design It's by design, but then again, I also want us to think of these people that we're talking about like they are.\nI have a whole video worth of pictures of drug deals and 10 bags of heroin and people riding up and down the street just doing whatever they want in this regard, and I I've been forwarding these to the to the Community Affairs Office for over a year now, and then you know during the course was formulating our little block."
        }
    }
}