{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB2",
            "channelId": "https://www.youtube.com/channel/UCwItHPl-cr1FP2pll1dkzUw",
            "title": "Bronx CB2 Full Board Meeting  2020 September 30",
            "publishDate": "2020-11-16",
            "shortDescription": "",
            "lengthSeconds": "1:38:38"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB2",
            "normalizedName": "Bronx Community Board 2",
            "twitterName": "Bronx Community Board 2",
            "youtubeChannelName": "BronxCommunityBoard#2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCRfzp2GSHg6CIjALtX73JGw",
            "twitterHandle": "@2_bronx",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "4FmLR7U7Vq8",
            "fillerWordCount": {
                "uh": 268,
                "um": 246
            },
            "readTimeFullTranscript": "54 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "report": 14,
                "health": 14,
                "cases": 14,
                "business": 13,
                "data": 13,
                "testing": 12,
                "face": 12,
                "chat": 12,
                "school": 12,
                "parks": 11
            },
            "wordCountSummary": {
                "trace": 4,
                "day": 3,
                "data": 3,
                "testing": 3,
                "program": 3,
                "services": 3,
                "quorum": 3,
                "summer": 3,
                "locations": 3,
                "map": 2
            },
            "fullTranscript": "Thank you, Ralph I want to thank everybody for showing we still have not or come to forum yet, but in the meantime we will have the presence on. We can have the precinct report and we could have the we have a presenter from department of the Department of Health and child right, yeah Bobby, so she's in public session. So that's the first item public section. We can do the public session. First, there was only one that was submitted and which happened to be Anita Reyes from the Department of Health and mental hygiene. She wants to give an update on Covid-19 related items all right. So if that'll be a few minutes, I should give us time to excuse me to get the quorum that we need to proceed with business, so I need it. This toy is yours, oh all, right hold on one second hold on I'm gonna mute everyone and accept Anita, and the floor will be house good evening. Everyone and thank you to Ralph and Community Ward 2 for allowing me an opportunity to speak to you all. Today, I took off my map just for a quick minute, because I am in an area with a lot of people, so I have to make sure that I'm protecting myself I just wanted to say hi without the math I'm. So I'm putting back to last so tonight, I'm here to talk about the test and trace programs that the New York, City, Health and hospitals, pets and trace teams are working on. So it's a multi-agency approach and I'm going to go over what the program is, and this can help you inform your community as well as your colleagues and those that may be in need of this program right next. I want to start by saying that you know we do have a local office in the Bronx and so I work out of the bureau of the Bronx neighborhood health center and at our office. We work very closely with the community partners to make sure that community partners are communicating with us what they're hearing what we can do to help promote health disparities in the south Bronx, and so we work very closely with many partners. We also give cribs and car seats to moms in the area and we work with schools in the area on nutrition programming, but currently we're just focused on Covid-19, so 24 hours a day, we're working on Covid-19 we're monitoring the data, you're hearing everything that's going on, and so just to give you a little update. The testing trace program is really focused on helping all those people who have been identified with positive cases of Clovis and, as you know, Covid-19 is also known as Corona or coronavirus. 19 is what they're calling it and then the symptoms are similar to a virus. It's cloth, shortness of breath, sore throat and losses taste for smell, so those are the symptoms, and these symptoms can go on from 2-14 days after the exposure next, okay and so right now, the test and trace program is really focused on trying to identify people. Isolate them, have them quarantine for 10 to 14 days so that they don't continue to transmit the virus to other people. So if you look at the picture, one person can sensitive two and two consecutive to four and four to six. You get the picture so it becomes just like in March we got a big group of people right that were able to transmit it to us. So we want to stop that a transmission chain immediately next and so isolation. We call isolation for those people who test positive. They have to be isolated, they have to get tested and once they test positive, they will receive a phone call from the test and trace program and the test and trace. You hear the word traits, but hey, there's more tracing this vibe, where this virus is. Let's look for it. Let's try to capture it and make sure that it doesn't continue to spread right because, as I mentioned in the slide before one person can spread it to two. So if we're able to track it easily we're able to have an effect and eliminate other people from getting infected. Okay next I want to mention that in New York City, we have a lot of testing the New York City hospitals offer free testing for anyone who walks in you don't need insurance, you don't need to have any documentation. Everything is confidential and it's free okay, it's important that you know that, but we're also working with other organizations that are offering it for free. So, for example, we're working with a city Md advantage urgent care they're offering it for free, and then the health Department currently has free programming and I want to say that in the Bronx we have a site, that's doing private testing and what rapid is that you get Tesla and you get your results within 24 hours. It's really important for everyone to know and the location in the Bronx is 1309, Fulton, Avenue and or some sorry in full country and that's in the Bronx by 169th street. Okay, that's very important and you know we're having people get tested and making sure that young people get tested as well, because we are seeing an increase in cases in younger people. So it's important that young people may not have any symptoms, but it's important that they get tested again. Sure the address is 1309 Fulton Avenue, the Bronx, 104, 56 and I could send the information when I'm done, and all you have to do- is either call or email to schedule an appointment and you get it within a few hours. Your results, I'm sorry say that again, Anita's Maggie, do you have a number sure I could put something very thank you, and we are also seeing high numbers among immigrant communities, so we want to make sure that we're reaching out to the immigrant community. We do know that Hispanics and blacks have been disproportionately impacted by Povid Right and in terms of numbers. We've seen close to 4,000 people died of Covid-19 in the past six months, and we do know that there's been a number of people over 900 people who have died, who have not tested and quickly I know. I have my timer on so I have a few more minutes. Next I wanted to mention that it's important don't worry too much about the time right now. Thank you, Robert. What I wanted to mention is that testing is safe, it's easy and free, and so what we want to make sure is that people are going to get tested, there's tons of spaces where you can go and you're doing it for yourself, you're doing it for your loved ones, you're doing it for your colleagues, your neighbors, because we want to stop the spread right. We want to make sure that we're not confined to continuing to be confined. So therefore, we have to eliminate this, and so I have a picture next and it's a picture just showing of you a family right. It's important that we do this. The health department has really been working on looking at data and analyzing data, and so what we're doing is looking to see if there's clusters in the neighborhood, but also looking to see what communities are, testing have the lowest testing rates, but what communities have the highest rates of positive cases? So when we look at that, then we make determinations of. We have to do a hyper local approach and the hyper local approach is just we want to flood this neighborhood with testing. We want to flood this neighborhood with information so that people can be aware and can get tested, so we've had it in the trunks twice already. We had it in this three-month area and we were there for two weeks in July because we saw the lowest and the sixth number of people getting tested. So we partnered with different organizations we partnered with a faith-based organization with a mock. We had a mobile van by the park and this really gave people the opportunity to get tested, and so we met our goal, which was like 2,500, we tested over 2000, and so we left there and our rates work just like the city. So that's important we're meeting people where they are. We had long hours until seven eight o'clock at night testing people all the way on up to Sundays so Mondays and Sundays for two weeks. Next and then we went to Sandview, we went to sunset in Brooklyn and then prom view all right. So this is a really important track piece that I want you all to know. So if you or someone you have been in contact with, have kept it positive sorry, if you or someone you know, has tested positive for Covid-19. It is important that you answer your phone when they call you so the test and trace team, which is a team of health professionals. We've hired people from the communities to help us speak different languages and are able really to connect with people and connect them to resources. They are calling to find out more information. They want to know where you've been what you've been doing, who you've been around because we want to test those people, and we want to make sure that, if there's transmission that we can help them so get tested for free make sure that they have the resources that they need. So I want to say. If you get a call or someone, you know, gets a call, it's going to be from a 212 number and it's going to say New York, City tests and trades. Please answer the phone call back and find out why they're calling you okay next so when's the tracer quality of contact tracing and public tracing has been used for years in public health. The health department uses for tuberculosis for HIV, so this is a program that has been around for many years in case you have not heard about it, but this contact tracer will help connect you to all the resources that are available so join the isolation and quarantine. We want to make sure that you maintain safe and that you have the resources you need. So, if you're unable to isolate at home, there's a hoteling program that you can go to it's free of charge for anyone- and you can be part of this program just by calling and calling making a reservation and you'll have a park pick you up to take you to the hotel for two weeks and at the hotel you will have three meals. You will have internet cables, the things that you need, as well as any medication or any continuity of care. So those people who are able to isolate at home and aren't deciding to stay at home, we do have food delivery programs that can come to your home and deliver food to you. Okay, it's also important that you know that medications we're working with pharmacies that are able to deliver patient at home and other services connect, and so this is what I want you to know today in order for you to prevent the spread of covis. These are the things that you need to do. First of all, stay home if you're sick, if you have any of the symptoms that I mentioned in the beginning, any fever cough or anything like that. You should stay home. Call your doctor wear a face. Mask right, I'm wearing a face mask right now, because I'm at a place that I have a lot of people walking in and out and so I don't want to really expose anyone and I want to also protect myself and so in terms of the six feet: physical distance, when you go to the supermarket or the bodegas I see people crying. So it's our responsibility to tell people hey. Six feet away right, so we need to know and inform the community about this and then Washington for any virus. This is gonna, kill it right. So folks and water is the most important thing and then getting tested. You can get tested. How many times you want and if you're at risk you should get tested more often next, all right. So this is the piece that I wanted to get to. So what can we do together? We could do tons of things to get the word out. We could start a what is it get tested day of action, which means that we would get a lot of people in our communities to go out and spread? The message word of mouth is important: they could post it on social media. We could have a testing ban, so H offers testing bands to go to different locations and we can organize that. What else do you think we could do as a community next and I'll? Let you guys check, put it on the chat and I'm going to read. So this was an event an action day that was done in Corona Queens, and this was just a community. They got together and they said we want to spread the word, and so here they are spreading the word giving out pamphlets canvassing. They went to the train station, they went to the supermarket in the area and then all these points they were able to give information, they gave out math and they also were able to really engage in conversations with the community. Next, it's the same. One I think it's powerful yeah all right. So how can you stay connected? There's tons of ways, so we have tons of handles and information out there that you can go to so follow. One of these go to tweet or Instagram, and all you have to do is enter NYC test and trace and fight hobits right, and you want to get check messages about where the testing sides are. You can also do that and then it's important to talk to your neighbors, your friends, your colleagues, about what we're talking about today. So that's really important, and so I want to leave you with this message that it is important for us. It's our responsibility to really continue to do the good work that we're doing the Bronx. If you look at the numbers, you know we're doing much better right, but we can't put our we have to. We can't put our guards down. We have to continue doing the work that we're doing so. That's important next, so just about the data I want to talk to you about the data and community board very quickly, as you heard today, there's transmission happening, so we are looking at clusters and there are clusters in Queens and Brooklyn and currently we're doing a lot of community outreach with the people on the ground and we have to test and trace folks working in those communities, and so I wanted to just take an opportunity to show you the data. So next and all this data that I'm sharing today is online just so it's new, the health department is currently posting the data on a daily basis and for the current data is being posted once a week. So in terms of confirmed cases of Copus, if you look at this map, it shows you where it's darker, that's where we've had the most cases. So you see the Bronx right, there's places in the Bronx and we've seen a lot of cases all right up here up north next and then in terms of cases of death. In the Bronx I mentioned earlier that we've had over 4,000 cases, you can see right next, the darker. That means that there's more cases and then I wanted to show you a quick glitch of the data in community board, two in zip code, 10, 4, 7, four and seven, four, seven, five, nine zero. So for the ten point area, which we said, there's about 348 total confirmed cases of focus and in the population of a hundred thousand we're seeing 2797 rate of Covid-19 and in terms of how many deaths using about 169 deaths for every hundred thousand next, the recent testing- this is important. I mentioned that right. So it's important for people to go out and get tested so we're seeing that in the hunts point area, people are going out and getting tested all right. So far, we've had about over 5,000 of the 100,000 population, so we're making sure that we're converting the data, and so, as you see it's point, 76 of people tested next and then in the hunts point area, 10,459 we're seeing you know about 1,740, confirmed cases and in terms of the rate of cases, you could see that we are seeing 3598 cases per 100,000 and then 37 43 rates of death due to Covid-19. Next all right- and this is the testing. So this is the number of people that have gone out to get tested, and so the percentage is a little higher and I just want to leave you with this is testing is free. All the programs that we have the city is offering it's all great and we want to make sure that people use these services and then know about these services and in terms of the contact traders, as I mentioned, these folks will be calling and if they can't reach you on the phone they may come to your household. This information is not shared with anyone. This is all confidential information and then the four core things that I want you to know and take with you tonight is stay home. If you're sick, keep physical distance, keep your mask on and wash your hands often get tested, and the last thing is: get your flu shot. It's important. This is the most important one because we don't want you to get set, so we are offering free flu shots at my office in the Tremont section of the Bronx, which is 1826 Arthur Avenue. If anyone is interested next Wednesday we're gonna have free food vaccine there from 10 a.m, to 2 p.m. Okay, I want to open it up. I'm sorry I took a little longer than I thought, but this is where I got all the data from. If people want to know where the data is from well, thank you. So much Anita we're not going to open it up. Chairman Crespo is going to discuss next. What's next, okay! Sorry, thank you so much for allowing me the opportunity to speak tonight. The only thing I would say is anybody have any further questions you neither you can you can chat your phone number and your address so like that people can get back to you. If you have any questions. Definitely so my phone number is 718-508 0603 again, that's 718.508.0603 and please we're here. I have a few folks that work with me and we're here to work to answer your thank you and to work together, because this is going to take all of us together to get rid of this coping right, you're, correct on that and I I wholeheartedly hope that everybody take you up on the testing and follow the instructions. My wife make sure that I follow the instructions every morning before I leave the house, but I want to thank you. So I want to proceed with the agenda and the agenda I want to have Roko now, since public session has there's no other presenters for the public session, so roll call Ivan. Are you ready for this Yvonne I think you should call out people and they should unmute themselves when they hear their name sounds good evening. Everybody so happy to see everybody good evening. We can't see you, but it's. Okay, sorry, but I can see everybody. When you hear your name just. Please come off a mute and say that you're present Travis Austin Jr here Evelyn here, Luis Castillo, Paula, Fields, Conyers, yeah, Julia, Chris, listen, Julia is working and she said she's gonna try and get on a little later on today. That's it did I, say Alta, Gracias Andre you on aren't you I saw her yeah I saw her too Kevin I got him too Sonya Ferguson she's on a call Jeffrey Coin Patty or Simone Lindquist Barbara Lopez Colin Lopez Nicholas Mario, which I checked his name on Monique Menace, Reverend, Moses, Lynette Olmo, here Larry Robinson he's trying to get on Silver Sanchez Richard, Sherman I saw Richard, Taveras, Maria Torres Marilyn Rohn she's. Here too Mary here Mary's. Here he was trying to get on he's just having difficulties too, not true. It looks like we have more than half of the members here and we do have some that are on the I have 19. so for quorum. What we needed was 17, so Mr chair we have quorum now and Yvonne. Just follow up with Cynthia me and we'll give you. The people that are here sounds good. Thank you. Everybody don't go too far, I wanna! So what we're gonna do there now is proceed with the agenda. I just wish to let everybody know that at this point on only board members can ask questions. Only board. Members can speak. So if you're, not a board member, you go on the chat, see if you can find somebody that can ask you a question and then maybe you know we'll get to it, but we can't have outsiders of the people that are not on the board. Ask questions during this session. Okay, that being the case and roll call is done, there has not been any adoptions of the minutes because we have not been sending out any of the minutes, but once the office is open we will be able to adopt. We will send out all the minutes for all the months that we've been meeting, and that means a lot of typing for Cynthia and for Danielle and hopefully who's there and then from there. We will then, on whenever the mayor opens meetings up that we could have in-person meetings. We can then adopt the minutes so that that's going to be put off till then until the mayor opens up all meetings or city meetings for in-person meetings. As to my report, just want to report that, because of the fact of that, we do not have a and I'm sorry but I, just it's one thing and then there's somebody else that needs to talk. There is a. There is no in-person meetings at this present time and I know that we were talking about elections for the offices. The situation is that until the mayor calls for in-person meetings, the elections needs to be halted until that point, and only because there is an issue of confidentiality when you're voting and secondly, and most importantly, anybody that wishes to be considered as a candidate needs to meet with the committee in person, and we can not have no in-person meetings until then. So I am I am asking for a motion for on this issue. Ralph. Do you see anybody? What I believe I? Let me well, it has to be first mayor. This is Jesse Harris and I make a motion that we might that we postpone having any elections until we meet face to face. Thank you any seconds second, who's hi. Who was that Gloria Cruz and she's, not a boy member. He said: that's not me! That was not me. That was not me. Gloria, Jesse and Paula. All those in favor of the motion say Aye. Anybody said a name any abstention, because if there are we gotta document, this Sonya you're saying no, I'm just voting. No I said yes, okay, any intentions yeah. So just what Mr chairman for the record. What's the exact motion? Okay, I'm on a video meeting and then hold me back, but most of them that we put on any elections for the board until we meet face to face where we can have safe face-to-face and we can't have the confidentiality of voting at the election, get that Iran pass unanimously and we have quorum, and they just want you to know that Ralph and I have been having several meetings with agencies. I know that there's been so many years have walked around I've gotten. A few calls already on the all these bikes all over the place. Bike stations, Ralph and I and councilman have been talking about it and we hope to have a meeting very soon with D.O.T because it looked like they flooded community board. Two with all these patients- and it just doesn't make any sense at all wow, and so that could fly my portion of the report and what I would like to do is recognize our councilman, who is online councilman, Rafael, Salamanca Junior, all right guys. Can you hear me? Yes, sir? All right good evening, everyone good morning, thank you, Mr, chair for allowing me to speak briefly. First I want to welcome everyone back to session I know normally during the summer months. The community boards are are not in session, but I also really extremely want to welcome back the the new members that have that have joined the board. You know this is an exciting time. You know, you're gonna have there's a lot of tough decisions that you're gonna have to make locally, but just keep this in mind and you have to remember I, take attendance extremely serious at community boards. If you have less than if you have more than three vacancies, I mean three absences that are unaccounted for. You will not be reappointed if you have more than three absences for a committee that are unaccounted for and you didn't inform the board. You will not be reappointed and you know I, as a former district manager, I understand the value of having a quorum and when you don't have when you're not present, it makes it much difficult to have a quorum and therefore business can not be conducted other than that. Welcome. Just to give you a quick update on some of the work that we've been doing and something that I think you should be informed for all of you. Drivers, individuals that drive I recently the department of Transportation made an announcement where they're converting Brockton Boulevard into a 25 mile an hour boulevard. So if you're driving down on Brooklyn boulevard, I recommend you obey the speed limit, they're installing speed cameras from Brooklyn boulevard and it's important, they I'm sorry. Can everyone that's on? Can you guys just mute your phone, it's very difficult to you're, muted Rob. Can you do me? Commute everybody, please better! All right. Can you hear me now? Yes, sir yeah all right great, so so, just you know as an FYI, if you're a driver and you're driving down Brooklyn boulevard be on the lookout. Please stay within your speed limit. If not, you will receive a 50, fine or summons in the mail just to update you in terms of CitiBikes. The chairman spoke on it. You know the department of transportation you know rolled out well, send us an email of a proposed map in the summer and then did not follow up and automatically install these CitiBikes throughout, not just community board too, but throughout my entire council district as well, and so there's a back and forth with DOT and the community board in my office as to locations. So if you feel that there's a location that the CitiBike was in store and you feel that it's inappropriate, it doesn't belong there, let us know so that we can have DOT, take another look at it and then just so three more things about two years ago, two and a half years ago we did a ribbon-cutting alliance playground and for those of you that are that visit that playground. Often you know that they it's a beautiful playground. They installed a comfort station which is basically bathrooms and since the ribbon cutting the bathrooms have been closed, they have not been open and they have not been opened because there has been a back and forth for parks and Con Edison so that Kane can come in and put electricity. It's taking two and a half years, and this morning I got a call from Commissioner Rodriguez, informing me that kind of finally did the work and therefore the buildings inspector will be coming in next week to give the okay so that parks can open up the conference station and then finally, you know just to give you an update as to some of the work that my office has been doing. Some of the work that my office has been doing. You know we've been doing food giveaways, every Tuesday and Thursday. Since the pandemic, we have fed you know close to about 25,000 individuals in my council district and recently, we've been doing. Remember: Moses, yes, you're, not paying attention come on, we muted all right! Thank you, and so you know, and then also this last two weeks we've been doing back-to-school events where we've given out over 2000 book bags and 2,000 boxes of school supplies. So in essence, my office has given out 4,000 pieces of school book bags and supplies to the residents in the 17th council district and with that I want to. Finally I just want to congratulate district manager on the birth of his daughter, congratulations, Ralph, Acevedo! Thank you. Councilman I know that we had a discussion because ever since I became the chair, wait a second I'm sorry, councilman I know that ever since I became the chair, I've always had requested this and I know that Fox Department has been reluctant to do it, but I know that not too long ago we had Dr Scherzo passed away and I would like to see how we can do that. Little Plaza, that's across the street, from the old San Juan across the street, from your office. That name changed over to Dr Richard Plaza yeah, so I'm Bobby, I'm extremely supportive of it. You know I called you earlier today to tell you of my conversation with Commissioner Rodriguez. So all I ask is that the board I? Guess you, you guys, have a discussion on it and vote on it. I'm asking you know: I will be seeking a lot of support from the board, and the goal here is to change the name from the Benjamin Gladstone Square to Dr, Richie, Scaldo, Square and there's also a commitment from urban health plan that, if this happens, that they will take over the maintenance of that plaza. We know that plaza is a hotbed, it's extremely dirty and just to have those extra hands from a local, not-for-profit taking it over would be a big honor and a great help to us. If anything, I know that it needs to go through municipal services, which is Maria, I'm gonna ask Maria. If possibly we can bypass the committee and take a vote here now on this issue so like that, we can move forward on this on this venture. To change that name over to Dr Richard is the Plaza Maria? Don't have any objections to that? Okay? So that being the case, is there anybody out there that's willing to make a motion that we can make to change the name of I? Don't know what the name is Ralph. May you I need your help on this? What's the name of stone triangle from Benjamin, Gladstone Triangle to Dr Richard Izquierdo Plaza? Is there anybody willing to make a motion on that I'll make a motion? Okay, that was Matt. I, know Maggie's voice. Who was the other one Paula and Maggie? Okay, all those in favor say. Is there any discussion on this so you're gonna? Are you going to write that up that they're also going to be taking care of the square yeah that'll be a that would I would think that that would be something that is going to be discussed between us and urban and as well as parks Department, but that was one of the conditions that Parks Department wanted to make sure that somebody was going to take care of it so that they can move on to do other things. So not hearing any other discussion on this, not hearing any all those in favor say aye. Who is this person if I may ask? Because I don't know who this is? Excuse me he's the founder of urban Health, so all of those like Urban, Health, Daya, Visa and hunts point, and he has a couple across the city and he's well Salamanca, couldn't explain more because that was actually his mentor. You know the urban opening down the corner, southern Boulevard Westchester and he's been around and provided health care to residents in the community for over 45 years, and they started urban health plan and now they're the biggest employer in our zip code, and they see over 100,000 individuals a year out of that health facility mistaken he also. Yes, he was a community board. Member I just want to say that for a bunch of years, pyramids community back in the day, because when I had asthma as a young parent with my kid I didn't have no insurance and he took care of me and my daughter with no problem. Well, then everything was interesting. He stayed in these states and made sure to continue the health coverage that we needed in this community. Since we didn't have a hospital and that back then we used to all have Lincoln Hospital and Fordham hospital and in either one of them you didn't land in. So that's that that's just the story of doctor, all those in favor say: aye hold on I got a bagels Reverend John Reverend. We lost them so that being Ralph I, guess you maybe the councilman can send you a draft of what needs to be on the letterhead and we could go ahead with it. Let's move on. Yes, you know on that same point. This is Jesse, Harris and I. Think I mentioned to you guys before about renaming Pierce 130 renaming the school and then and renaming it the name of this former principal Daniel, M Garcia, who is so many things in that school to improve it, not only academically but physically. So you know I want to keep that on the burner, because I think we should. We need to change the name of that school to someone who is definitely relevant and who's done, something in the last 10 years to improve that school, and we have people in the community who support me on this and I can bring that to the board. Just let me know what I need to do we'll get you the request for presentation and then we'll present that at the municipality committee, we can take it from there when you're ready, Jesse also make sure that you have a letter from the family or family member if they, when they come to the Municipal Services Committee. Okay right. Thank you very much. Jess I was going to say. That concludes my report, but I see that we have another elected official and that's state senator Lewis he's online, so Lloyd. Thank you so much Mr, Chairman, Cresco Ralph I, want to congratulate you on the birth of your child. Thank you. Senator I appreciate that. Thank you. It's always an honor to be here so just to give you an update of some of the things that I did. I, too, have been in communications with DOT about the bikes I. Don't know why Bobby we're not coordinating our efforts, but I'd like to because I've made some calls. I've got complaints as well about the locations, but I'd like to reach out to you so that we can make better for coordinating stuff because I know Ralph does great work there, but I'm also an elected official that gets involved and can help you guys out so anytime. You need help with anything. I strongly suggest that you give me a call, or we can work these things out, because I think two heads three heads four heads are better than one you have it that's better all right. Thank you. Now, just I was really impressed with the presentation. I helped with hospitals with healthy schools. There's several upticks throughout the city. Remember: our communities were hit terribly, but I want to ensure and encourage everyone to make sure that they take all the personal protections they need. The other issue is elections are coming up. The last day to register is October 9th we're gonna have early voting from the 24th to the 31st. You can ask your request: your absentee ballot. You can either mail it in or you can drop it off at an early voting site or you can drop it off at the board of elections if you're not comfortable mailing it, but we have to make sure that we get it done. We continue to also just like the councilman does in the council manage district in the Senate district. That I have. You know, I think at this point, we've given out over 70,000 pounds of food face mask a few months ago. I was able to secure 250,000, face masks for the health and hospitals through the government of Taiwan. They were gracious enough to help us again, so my office is getting between five and ten thousand face masks this week, if any development or anyone is in need of, face, masks please reach out to my office. Our information was put on the chat. My office number my office email, give us a call, we're happy to help we're visiting a lot of the schools to make sure that what we're seeing is that our kids are in a safe situation when they return to school. So we want to make sure that personally, I'm seeing them I'm looking at them some places, I'm happy some places, I'm not so happy if any parent is concerned, hold on a second somebody's got an open mic. Thank you. Anyone is concerned about the schools and whether they feel unsafe I encourage you to reach out to us. We are in constant communication with the chancellor and the DOE, because you know our kids and they number one most important things in our lives, so I want to keep them as safe as possible. Our office is continuously helping the community. Now I'm going to be assisting people that are in in fear of being evicted. We were fortunate that the governor has extended the moratorium on evictions until the end of the year, but I'm still very concerned about what's going to happen every time we get close to the removal of the moratorium, because you know, if we're going to have massive evictions, a lot of people are going to be homeless and that is not a safe situation. So if anybody is concerned about that again, I encourage you to reach out to my office and come to my office and we will assist. You know I personally, get involved in eviction cases, because in my first life I was a housing lawyer. So I have personal knowledge about housing laws and if anybody is concerned, I reach out to us we're going to continue to do events as well. We also gave out thousands of book bags and school supplies for children in the Senate district. I think our districts are fortunate mine and Ralph Salamancas, because both of us are doing so much for our communities. You know I'm proud to say that I think we've done a lot to help the families in our community. So I'm going to continue to do what I have to help I'm sure the Salamanca is going to do the same so together we'll make sure that our communities are treated and get all the resources that they need to combat this to stay safe. And if anybody wants to reach me, they can call me personally at my cell phone number. My number is 347-582-8173 or you can reach me at the numbers and the information that's been allocated on the chat. Please stay safe practice, safe measures, because we are not out of this and we want to make sure that our families are safe and no one else passes away because of coping. We lost too many people at the beginning, we're in a better position now to make sure we don't lose more. So please stay safe, God bless you all and I hope to see you when they open up the meetings. Thank you Ralph. Thank you, Bobby Senator. The only thing that I need to ask you is that I know Ralph. Did it on my behalf, sent you an email about club w and how SLA is considering giving them back their license on October 31st, yeah I reached out to SLA Bobby, as well as a result of that email? Yes, I'm gonna harass the hell out of them. You know. Maybe we should all sit down and see what battle plan we have, but I don't want it either. You know that's not something that we should have in our neighborhoods anymore and the fact that they're thinking about giving the license until the extension until the expiration date I think is completely absurd and disrespectful to our community plus there's others. There's other issues from that. You weren't able to send to you, but I think that once Ralph and I can sit down with you, we can show you the whole file and then we can try and push this thing together. We also need your colleagues help Senator Biaggi to work with us on that because, in all true honesty, you're the only two real elected officials that we have in the state right now everybody else's state, elected and until January 1st, they won't be the official state representatives, so I need you and I need Senator Biaggi to help us tremendously on this, hey Bob, you know whatever you guys call me, I'm there to help. So you, let me know I will go whatever height. I have to go to make sure that we stop that issue with the bar and I will again I will harass the hell out of liquor, state liquor authority to see what we can accomplish. Thank you. Thank God. I got a remote now for my car, so I couldn't replace that sorry. So thank you. I told that I skipped on this thing here and I know that NYPD was supposed to make their report. I know that sergeant Guglielmo has been on the line and sarge I want to. Thank you. I'm sorry, but you know I know the councilman had to go to to another make another meeting through through the computer and I know that the senator is driving in from Albany, so I. You know, I had to take this opportunity to recognize them, but now the floor is yours, Sarge, okay, what we'll do is we'll get back to him on that. In the meantime, district managers before well Mr chairman you skipped item b, the adoption of the minutes right, no I think we should you weren't. There I stated that we weren't going to adopt have been shared with everybody. So until we have an in-person meeting that will have all the minutes ready for everybody, then we'll adopt whatever has to be adopted. Okay sounds good, so yeah, so the district manager's report good evening, everyone and welcome back I guess to our full board, obviously from when we last met. So much has happened with the pandemic. A lot of what we've been doing over the summer has been said, in particular just trying to follow up with parks and D.O.T regarding the CitiBike and spending some time and energy. Now, with the state liquor authority regarding some of the open restaurants in our district, I know that sergeant Guglielmo has been very helpful and are monitoring all of these locations and making sure that they're in compliance I want to thank Anita, also because I've been working with the Ohmh over the summer. Just to you know, try to get as much information as we can regarding this pandemic. I just want to also say that the office is still closed. The building out our building is actually closed. We got to wait for the building to open and they're still doing renovations, they're finalizing the renovations in our office to be in compliance with with the city mandate. Regarding offices- and you know the you know spreading of any type of like Covid-19 for an example, but once the office is open, we'll, let everybody know we're still working remotely. We still have you know we're still accessible Monday through Friday nine to five. You can reach out and call, or you can email, even Daniella, Cynthia I just want to also acknowledge the work that Cynthia and Danielle have been doing over the summer. To keep you know everything in order, but with that Mr chairman. That concludes my report. Thank you. Ralph I understand that sergeant Guglielmo is on now sergeant, Sarge all right, we'll vote next. If I can district manager's world president's report, is anybody from the Bp's office, unlocking Hey Bobby good evening, Community, Board, 2. I, hope everyone is doing. Well, I'm glad to see and hear everyone on the call the borough president's report has been sent out to all boards. If you haven't received it, please just write in the chat and I will forward it to you, something that I really want to touch on. That's very important is early voting. It will be taking place from October 24th until November. First, I'm going to be entering early Bronx voting post sites in the chat and links of where you can vote and I'll get your absentee ballots online. Also, letters will be sent out by the end of this month for reappointments, as well as new appointments. I look forward to working with you all. Thank you. Alexis Ralph, you gotta, bring me back. You got me on the roll call is sergeant Guglielmo in Hey Sarge, he's here sad you there yeah. Can you hear me yeah now, I could thank you. Yeah I, don't know. What's going on, I'm actually on the phone through Cynthia I love technology, it's a great place, so you guys can all hear me right. Yes, okay, so we're going to go over the numbers, real quick, so we were down 50 in robberies. Last 28 day period down 30 in felony assaults we're down 66 in burglaries. That's due to captain Schumer and I came up with a steady burglary, auto on the on the overnight tour. So we have two officers that are that their only job is to you know, respond to burglaries and try to keep it down. We've also been working with the Da's office. I want to thank Ralph Acevedo for putting me in touch with Aisha Green in regards to Steven Smith. So that was a successful conversation. One thing we're up in is grand launch needs, but I went through the police report. The complaint reports most of those are due to domestic situations where you know husband and wife, and they have a fight and the wife. You know the husband has something not appropriate on a cell phone or maybe another girl's number one on the cell phone and she takes the cell phone. So that's kind of what we're we're dealing with grand larceny. I'm not really worried about that spike gun arrests. We are leading the Bronx gun, I'm very proud of my guys. We have made eight gun arrests in the last 28-day period between public safety and the NCOS. We've really been trying to curb down on the governor. You know the gun. Violence has been all across the city. It's been bananas. Captain Schumann has deployed a lot of picture posts in the area with the use of the shot spotter we've triangulated positions. We did a search warrant on a vehicle. We recovered a firearm. My guys are out there every night. I've got them working late tours. So we're very happy about the eight gun. Arrests, I. Would nobody got injured? The suspect was all taken into custody without incident. Last meeting we had discussed says casinos on Prospect Barbara had brought up an issue. I did not one but two business inspections. There I went I actually measured. The tables are about eight to ten feet apart, which is more than enough New York State laws, Governor Cuomo's border is, you know they have to be six feet apart, but the tables are in ten feet apart, I didn't see any overcrowding, I went there twice once on a weekend and once during the week to address Bobby Crespo's concerns about tequila mezcal, so they were shut down and then they got an emergency injunction to reopen again. But I spoke to the statement authority myself personally to the inspector and technically they're in the process of shutting them down and pulling their liquor license. So that is going to happen. They are temporarily open right now. So that's what we're dealing with that Maggie had sent me a flyer about a protest in Phil Rainey Park I have to bring it to the seals attention. This is all in the last 24 hours, so captain she wanted to sit down later tonight and we're gonna go over. That it's supposed to be on Saturday October 10th at 3 p.m. I got to get an answer from parks, I, don't know if this is a sanctioned event. All I have is the flyer that Maggie and a few others had sent me so that we're gonna have to keep an eye on. We also have a March planned on this Friday. It's the Bronx parent leaders, advocacy group. It was supposed to be yesterday but I guess the inkling and weather they pushed it until Friday. This one is sanctioned. The city gave the permit for it. It's gonna be on Friday. This Friday 3:30 p.m. It starts in is 131, which is in the 43rd precinct, but it's going to end at Father Verganti on Tiffany Avenue, so I have my NCOS working I myself is working so we're going to keep an eye on and it should be all right. My main concern is people marching on the sidewalk and not in the street and, being you know, it's a Friday afternoon there's a lot of cars. Things are opening up again. I just don't want anybody to get struck by a vehicle. So that's pretty much it for the NYPD agenda. I, don't know if anybody has any questions so I do I know that you said that it was sanctioned by the city, but why I know that it starts in the 4-3, as you stated, but why did like? Why wasn't the community bored here? But you know giving a heads up I know you're, giving us the heads up now, but it should have been a heads up prior and I'm not blaming you I like to know who in the city is doing that because, first of all, as you stated, it's a Friday and if I'm not mistaken, they gotta walk through Bruckner to get to Bryant Avenue and so there's a lot of construction going on Bruckner and so I like to you know, state my concerns and state that I have. You know really. My I have some objections to this. Not that I don't care that I I'm objecting to what they want to do. It's the route that they're taking and the fact that it's a Friday and there's construction- and you know I- try to stay away from that area because of the construction when I'm driving so I just have concerns about the route that they have I agree 100. This was actually brought to my attention by the my counterpart in the 43rd precinct. They had actually called me to inform me I think what it kind of got lost in the translation, because it was it's a multi-command March. So I think that that's why? Because originally I think they did notify the 4-3 precinct, the CEO there and also the community board there. So I don't know, I was just giving a heads up and then looking at the round, I'm like I have the same concerns that you do, and that is that it's the Brooker they're gonna have to cross over the Bruckner. Whitlock is a bad area there that whole I mean it's gonna, be kind of a cluster, so I'm gonna have to put a lot of cops there, but I agree with you. I mean once again. This about might be great, and all I can do. Is you know and make sure that everybody's safe on that day, I'm just going on the record, because God forbid something goes wrong. I don't want it to be said that community board 2 sanctioned something like this and somebody got hurt and or that the 4-1 get blamed for something that you know. We had no real control over. That's all I'm saying! Well when it comes to parades and marches, we don't have any I. Think that's taking the route that they're taking is the concern that I have you know they have that gig. When you come off of Bronx River avenue, you got that turn. You know to come across it. It's all. Wick, wiggly and waggly and I have concerns with that. That's all that I, I'm saying you know I'm just having concerns and then they have to cross over to get to the other side. So that's only my concern, such my other concern, is Club Exeter, what's happening with that, so club exit, though we've had some a bit of some incoming weather lately, so I went over there. A few times and I got to tell you they were closing up early we're going to do another business and there this weekend, I'm still working with the SLA, but I also have now been working with NYPD Eagle I reached out to lieutenants that I know it down there and we might also go the route of Lucian's abatement. We used to do nuisance abatement and we stopped obviously because of the colbit I was informed by NYPD legal that now we are allowed to do loosens abatement again, so I worked in Manhattan south for years. I was down there doing cabaret inspections, so I'm gonna use a lot of my knowledge for that and also go that route. You know I don't want lately. It hasn't been an issue, but it's also been like last weekend. I, don't remember it was very chilly out, so they didn't really have a lot of a lot of patronage. Now today is September 30th. So now indoor dining begins today. So that is not. That is another headache. So we're going to be dealing with that captain, Schuler and I have discussed the restaurants in the neighborhood. They have to be at 25% capacity and no more so we're also going to keep an eye on that as well. Have you checked the restaurants on southern Boulevard, between Avenue, St, John and 149? There's about I think we've been checking. The outdoor I did find a few restaurants that were not in compliance but I reached out to I reached out to NYPD legal, but they said it's gonna be a D.O.T issue, so they're gonna actually reach out to eot, because technically the restaurant is supposed to be on the sidewalk. The only time that they can be in the street is if there's a if there's a bus, stop there or a CitiBike. You know some something to that effect right. I'm sorry they're supposed to be in the street right. That's where they're supposed to be set up. Unless there's a bus, stop or so a few of the restaurants are not in compliance right. We don't have any legal enforcement action, it's going to be the SLA and D.O.T all right. Please keep me informed with that, because, yes, I, have a list of I have a list of the restaurants, absolutely because that place has always been a hot spot. I know that it's gonna get cold and it may not be as hot as before in the summer, but the holidays do come around and they still go crazy out there and there's been a lot of narcotics in that area. A lot of fights and savvies and shootings in that area. So keep us informed on that. Please definitely. Thank you very much. Ralph bring me back. Officials report. Okay, thank you! Elected officials. We have I, can't see I can't read this rep. I'm sorry, you're gonna have to help me on this. So we did the borough. Presidents right we got is there anyone is Siri here. Anyone from the mayor's office, no Bro president's report, Alexis already did say: Senator Sepulveda spoke Emmanuel you're still on here from Brg's office. I am a pleasure to see everyone. Thank you Ralph! Congratulations as well! Thank you man. Thank you, Mr chairman, for allowing me to be here so currently biagi. Our office is working on PPE distribution. We also are doing events as well. One thing I wanted to point out early voting is a thing that we've been very persistent on, so we've been giving information out to most our constituents to make sure that they are aware how to go about this information. So if you guys need any help with that information, please let us know in addition to that, I did acknowledge. Mr Chairman's request regarding club, w I know. I have brought it up to the senator's attention about this and she's been very adamant about it. So I will bring it up again to remind her about the push to make sure that we are working collaboratively in order to get that result for you guys all right. So that will conclude my report. I hope everyone is having a safe and wonderful day and please keep safe and continue to practice social distancing. Thank you, Emmanuel Emanuel. Can you leave your information in the chat, so people, if they need to, can follow up with you? Thank you so much next on. Is there anybody from assembly, member or Royals office I know that the council members spoke and I thought I saw Maritza, Ron I, don't know if Marissa wants to add anything else from what the council member stated hi Rob. Congratulations. Also, thank you. No I have nothing to say. Thank you. Marissa. Moving on, we have I know. Gloria was around glory for council members, I'm still here. Thank you. We have been working very hard with the census to make sure that everyone is counted. The council member has also done a lot of pte and book bags. Events as well to make sure that the community is taking care of healthy, small businesses as well. Our office is open Monday to Friday, which is here all the time, and you can always call I know that we have a small part of the district, but since day one I've never not meant to be represented by us. So if anyone needs us knows how to get in touch with us and I will put our phone number. Thank you very much, no problem. Thank you. Gloria. Let's move on city planning, Rep I know. I saw Justin around I, don't know if Justin wants to say any few words. Congratulations thank you! Justin, yeah and hello to everyone. It's good to hear you or see you for those who don't know. Maybe the new board members, I'm Justin Lamarrella, I'm a city planner with the Department of City planning in the Bronx borough office and I'm the Liaison Board too I wanted to update everyone tonight on the comprehensive waterfront plan. There's a a workshop tomorrow that I want you to know about I'll put the information in the chat about it, but the comprehensive waterfront plan is something that we update every 10 years, and so we are planning for the next 10 years for a more healthy and equitable waterfront. As you may know, New York City has 520 miles of waterfront, so it's really important to hear from everyone. So the workshop tomorrow is for Bronx community districts, one through eight and it's at four p.m. It's going to be on online via zoom. You can register to sign up when I and I'll send the rcp. How you do that we'd love to see you there we'd love to hear your vision for the Bronx waterfront. So that's all I have to update always available I'll put my information in the chat. If anyone has any questions about city planning in general, I'm available great Justin good hearing from you. Thank you. So much just make sure you leave that information and I think we might follow up with you with our housing and land use committee to maybe make a short presentation about that. Moving on. Is there anyone here from assembly member Crespo's office I do know that hello, okay, so I do know that assembly, member Elect, Kenny Burgos was on for a quick moment and then he got off so I just want to come out of that. Is there anyone from assembly member Michael Blake's office? Yes, okay, my name is Diaz. I probably met a couple of you before I'm. Actually, the deputy chief of the staffer family member Mike play sorry I. Think someone wants to speak. You got two minutes all right, so I just want to give you a quick, really update on what we are working on. First of all, our phone number is system with 718-538-3829 or any issue. Please feel free to call our office and leave a voice with the contact information, and we one of our staff members will call you back. We are hosting an education town halls twice during the month and I just gonna leave the information here right on the chat. So if people out forks are interested in participating I can you guys can be part of? We are hosting a know. Your ride. Training I also believe that here are the chats for nice residents and we I. We also are hosting an affordable housing. Education, Central, Town, Hall partnership with no skedammus and the basis of the town hall is just to talk about what are the steps for people to apply for housing? What is the process? What are the steps? What documentation you need? One of the issues that we always come across is that people don't know where are those steps, so we just want to make sure like the community is informed that, as I say, I will put all the info on the chat, and thank you great, thank you. So much for that is there. Anyone from Congressman Serrano's office I do know that we have the Elect Congress member Richie Torres. He had some staff members on I, don't know if any of them are still on I want to say something moving on then the controller's office. Is there anyone here from the controller's office, Mariela or Anderson good evening? It's marielle, I'm Maria, hello. Everyone I am the Bronx borough director controllers here and also the representative in the area so that we have it I'll keep it very short. I just wanted to announce that over the summer the comptroller has been doing a lot of work when it comes to education, homelessness, small businesses and providing support at different pieces. So one of the things that he asked for was to ensure that small business had year-round open streets programs another, and that was a report that he wrote. One of our bigger accomplishments is that we put together a back-to-school guide which is useful, and it's relevant at this moment in time, because you kind of study for school and things are not working the way that they should be working, so the guidance in English, Spanish and I believe Mandarin, and it's all of the does information in one space that people can use and navigate. Another thing when it comes to education that the controller has pushed for is to ensure that homeless students have as much opportunity as this. That has a house stable housing, meaning a lot of students and shelters that have adequate internet I, know people at home, sometimes who don't have adequate internet. But how can we work together to understand the needs of homeless students? This is a call that he's had for years with previous reports to making sure that there's enough staff to ensure that homeless, students have the support that they need and also too looking into making a deeper dive into ensuring that animals in city and city shelters are protected. We know that a lot of animals have gotten sick passed away and he did an audit revealing some of the issues that exist so, but and also too he's been a lot of work in the environment, I think the city to implement green roofs, green roof, taxi bits and also when it comes to the pension funds and how there are why part of my role is to ensure that I know what's going on in the community and to make sure that you know what the comptroller is doing. A lot of ideas for audits and reports come from community members, so the more meetings I go to the more zoom meetings in person. Meetings I attend the best I can represent this community. Also Anderson Ortiz also works in our office. That is a very active community member in Community, Board too, but, like I, said, I would love to attend more meetings and community board too. I know that there are a lot of groups and people that care about what's going on and they want to make sure that our office knows so. I will again put my information in the chat to ensure you have my information and please feel free to connect with me by email or by phone I am accessible and also to please fill out your census. You still have time. We want to make sure that people get our adequate representation and funding and I have a feeling. The more funding not I have a feeling, but the more funding we get the more successful we will be going forward because we have adequate school seats and things of the such. But thank you so much for having me here tonight. You all are amazing. I've been doing great work all summer and all year, long and Congrats Ralph I just wanted to make sure I said that, as well as an exciting venture or adventure that you're about to go on. So, thank you. Marielle I, appreciate that and thank you for all that valuable information from the controller's office, and we really appreciate you willing to come to all of our meetings. Just make sure you follow up with the office and you know and now calendar. If you have any questions, you know how to reach out. So thank you so much for that. Next up, the Department of Health we had. We already had a near Anita gave us the in the public session. I, don't think, there's anyone here, public advocates office. This is Brian you're. Still here, Brian I know, Brian was on with us a little earlier. I guess: Brian has to step out. We already heard from yeah we heard from the 41st precinct. Is anyone here from sanitation? Is there anyone here from the Fire Department Christine? Are you still here with us? Yeah Christina I, just also want to acknowledge. Christina. Give me one second, that I don't mention that this office, assisted with him and connecting with the district attorney's office, and he acknowledged me, but I also want to acknowledge Christina, because Christina played a role with that. So, thank you Christina, and you have your two minutes, of course, and I definitely don't need acknowledgement, that's what I get paid for anyway. So my paycheck acknowledges that, but I definitely appreciate it. Congrats to you and your family welcome back. Thank you. Two. I'm happy to be the Rep for this district for this year. A quick update that we have I've mentioned at the Dfc and at other meetings, that kind of overlapped, with the with community board too, that we are hosting anti-crime events throughout the borough of the Bronx. Some of it is due to the uptick in violence and really it is to bring awareness and to lower the violence within the borough and to get community involvement so we're starting. We thought we started this summer, we're continuing throughout this year. Our next event will actually be this Saturday in the confines of the 48th precinct. It will be held at East, 182nd, Street and Belmont Avenue from 12 to 4 p.m, on the playground of Del Mar and we're partnering with other elected officials Pd, as well as your violence agencies, just to name a few release: the grip, suv guns down life up, Sos, brag, good shopper services, so there's so because of the upside. We are hosting these events and we're just asking the community to come out to raise awareness, because we all play a part in this yeah, so we're also hosting a town hall and coming up. We are looking to host also a gun buyback program. So that's just my update real quick and, of course, I will be sending all the information to CB2 and to Cynthia, because we know she gets the word out there. And that concludes my report. Thank you so much Christina, so Mr chairman, that includes that concludes the elected officials. Now we're now moving on into the committee reports. Mr Chairman. Are you still here? I, don't believe. There's any committee reports am I, correct, Maria. No, we have two voting items here, Mr chairman, we do so yeah. We will start with economic, okay, those are presentations, Maria Chair, chair of the Economic Municipal Maria Torres, yes, hello, good evening. Everyone I'll try to keep this brief, so we could keep it moving. But at our last meeting we met with parks Department and they requested a letter of no objective regarding construction for the hunts point Riverside park boat, landing or the dock there, and so they discussed that at our meeting and they sent some plans, I guess Ralph! You would be able to at a later point to provide people with those pdfs if requested or something like that, absolutely actually I have it I can quickly. If you allow me Madam, chair, I can put it right on like right now and see if, if anyone's interested in it I guess you know, while you speak and go through your stuff, we'll see, we can get I'll get this up Ralph. Why don't you just let anybody that's interested reach out to you and get it from you like that? Okay, fair enough? Okay, so is anybody from parks on tonight? Yeah we had a bunch of people from park, so we have my is Mike here or the other folks that presented at my meeting. Mike was here: I, don't Mike from parks. Is here Hi Mart Mike. Do you know anyone from parks there you go you're breaking up on us Mike! You just mute it yourself. Let me unmute you there you go Mike, you can hear yeah. Can you hear me? Yes now we could thank you. Mike Ortiz, the director of operations for the Parks Department, okay. Well, thank you all very much. I, don't know if you wanted me to speak on the project. Nah I, don't think so. Maria just wanted to make sure someone from parks was here so Maria just to tuck in anyway. So there had been issues for years with this, the dock that was built there, and so this is just really improving upon it and ensuring that the main users, such as rocking the boat, are able to use it properly and without any issues, and so this is I believe is about a million dollar project that would probably start next year and be done by fall. 2022 or 2021 I couldn't remember, 21 all right, yeah, probably just as we're getting done with Covid-19. So you know it's really for me. It was, it seemed fine. They they're having a gate. There really isn't a way to completely cut people off from the dock or the waterfront there, but it is it'll be as cute secured as it can be. In the meantime, while the dock is closed for the for the construction rocking, the boat will still be able to launch through the I guess the beach side of the park there and so they'll be able to continue their program without too many issues. So our group met and then with the executive committee to because we did not have quorum and they, the executive committee voted in favor of doing the letter of no objection for Parks, Department and so I guess tonight. We're also now we're bringing it to the full board for Full board approval. Correct, yes, correct, okay, so that's what's up on the docket right now is. If anybody has any questions before we go to the questions, is there a second to this proposal in order for us to proceed with it? We need a second by reverend. Now you can open it up to discussion Maria. If Dave did there's any discussion. Does anybody have any questions moving on okay, not hearing any discussions and being duly second and approved by the executive committee for a letter of support to the department of parks for the renovation of the? What was it the last defense, the hunts point Riverside park of the Huntsville Riverside Park dock right, so we can I. Would all those in favor say aye hi, all right? Is there any Nas out there, any abstentions, not hearing none? The motion carries unanimously. Okay, thank you yep. That concludes our our meeting. Then. Thank you, Maria. The second item for voting is from the franchise license. Permit Committee is Reverend John on Carbon John. He is on. Ralph has to unmute him because he's a caller okay, Reverend John. Oh he's a call out. What's his number for the last one, the last ditch is a 4-4 Reverend John you on hello, yes Robin, you have been on all day. Did you guys mute me out of the meeting anyway for your presentation? Thank you. Please come the district manager help me with the with my presentation, please sure so we have and I think I see bq and it's bqin you're here hello. Let me know Bqn Miss, Garcia you're here, yes, oh, the flp meeting met I think it was last week we had one item on. It was the the renewal of Bqn's business license. They have to come every two or three years and ask for a letter of no objection to the taxi and limousine Commission upon looking at their last letters that they received from us. There were some stipulations as far as where their line of cars would be and being more vigilant around some time. We also had an NYPD present, the local precinct. There was no issues with them whatsoever. In the last three years. We have not received any complaints about our stipulations, so the motion was made to just renew, to send a new letter of no objection to the Tlc on behalf of Bqn, okay, the committee approved it all I need is a second from the floor. Why any discussion? Are there any discussions on it? I have to unmute Cedric Mccluster, because you know he always abstained. No. This is a cat. This isn't liquor. Thank you for that. Okay, the only thing that I have to change is that trying to presentation from Ut Bqn on the committee and hopefully in the future because become a board member and check for route, because it's easy for us to deal with the issues when we have the board members or committee members instead of having to go through all of this, but I know it's been a couple of months that we have not seen Miss Garcia for a while and I just want to make sure that she understands that we have to have representation from bqn in the community. Yeah understood thanks so much all those in favor say: hi Danny, ladies out there. Thank you Reverend John! Thank you. This is the chairman in his old business, any old business out there was. You know we went over a lot of stuff since we haven't met in June on the old business. Just the presentation by DOHMH I think was very useful and very resourceful, and if people need it, I can hand that to them any new business. Anybody with new business from the 41st president on your business, Cedric well I'll mention it because he put it on the text. So the what you guys were just talking about regarding the Bruckner and D.O.T their D.O.T commissioner for state is going to be at their meeting tomorrow at the precinct. Wait not at the precinct, 8:41, burretto I! Think if I may, I'm not sure if you guys could hear me, it's actually not that okay hold on Richard. Let Cedric talk Great, Cedric, okay, it's it's actually, not the commissioner, but it's a state representative at Aot. That is a liaison for the construction company directly doing the work, so they will be there about two or three of them representing from the team. They will be there to speak about conditions with traffic and any environmental issues with the ongoing construction between the Bruckner and Sheridan and Sprexler. Okay, who's got no business. Let's move on announcements, any announcements outside of that there's a new family member in community for two her as she goes down, then you can unzip that person, because otherwise, we'll hey good evening, everybody before I go over the road car I just want to say for everyone to have a good night and please be safe. Once you hear your name, please don't mute yourself and let us know that you're here, Selves Austin, Juniors, Conyers, Stephanie Contero here, I'm here, gotcha Robert, Crespo fun, I'm here, I just had a problem with my meal, no worries. Thank you. Papa I had to take my meal, I'm here: Alda Gracia, Cruz, Julia, Sanji, Cruz, Kevin, Allison, here, Sonya, Ferguson, okay, thank you and Guadalupe's present. Thank you. Alexandra Jesse Harris, here Shaquan Hunt, David, Coleman, Next, page Rox, Talia, Simon, Lindquist, all right somewhere, hello here, she's, just on Mute Talia's, here rolling, Lopez, Nicholas Mario he's on the court too. Thank you, Luis Marrero how's it my cluster here Monique finished Reverend Moses! I'm here, I'm sorry! Thank you! Monique Robert, Moses, Lynette Olmo! Thank you! Maggie Ortiz, Richard Sherman, here Beyonce. Thank you. Maria Torres yeah Marilyn Wroten she's at work, but she hears you here. She keeps something John Udu, probably thank you good night. Everybody take care. Thank you.",
            "summary": "Evening, Today, I took off my map just for a quick minute, because I am in an area with a lot of people, So I have to make sure that I'm protecting myself.\nI'm here to talk about the test and trace programs that the New York, City, Health and hospitals, pets and trace teams are working.\nI want to start by saying that you know we do have a local office in the Bronx.\nCovid-19, so 24 hours, a day, we're working, on, Covid-19, we're monitoring the data, you're hearing, everything that's going on, and so just to give you a little update.\nThe testing trace program is really focused on helping all those people who have been identified with positive cases of Clovis and, As you know, Covid-19 is also known as Corona or coronavirus.\nRight now, The test and trace program is really focused on trying to identify people.\nLet's, try to capture it and make sure that it doesn't continue to spread right because, as I mentioned in the slide before one person can spread it to two.\nOkay next I want to mention that in New York City, we have a lot of testing the New York City hospitals offer free testing for anyone who walks in you don't need insurance, you don't need to have any documentation.\nOkay, It's important that you know that, but we're also working with other organizations that are offering it for free.\nIt's, really important for everyone to know, and the location in the Bronx is 1309, Fulton, Avenue and or some sorry in full country.\nYou know we're having people get tested and making sure that young people get tested as well, because we are seeing an increase in cases in younger people.\nWhat I wanted to mention is that testing is safe, It's, easy and free, and so what we want to make sure is that people are going to get tested, there's tons of spaces where you can go and you're doing it for yourself, you're doing it for your loved ones, you're doing it for your colleagues, your neighbors, because we want to stop the spread.\nWe want to flood this neighborhood with information so that people can be aware and can get tested, so we've had it in the trunks twice.\nThis is a really important track piece that I want you all to know.\nThey, want to know where you've been what you've been doing, who you've been around because we want to test those people, and we want to make sure that, if there's transmission, that we can help them so get tested for free make sure that they have the resources that they need.\nThe health department uses for tuberculosis for HIV, So this is a program that has been around for many years in case you have not heard about it, but this contact tracer will help connect you to all the resources that are available so join the isolation and quarantine.\nOkay, It's also important that you know that medications we're working with pharmacies that are able to deliver patient at home and other services connect, and so this is what I want you to know today in order for you to prevent the spread of covis.\nSix feet away right, So we need to know and inform the community about this and then Washington for any virus.\nWe could start a what is it get tested day of action, which means that we would get a lot of people in our communities to go out and spread.\nSo we're seeing that in the hunts point area, people are going out and getting tested all right.\nSo far, we've had about over 5,000 of the 100,000 population, so we're making sure that we're converting the data, and so, as you see it's point, 76 of people tested next and then in the hunts point area, 10,459 we're seeing.\nWe want to make sure that people use these services and then know about these services and in terms of the contact traders, as I mentioned, These folks will be calling and if they can't reach you on the phone they may come to your household.\nThen the four core things that I want you to know and take with you tonight is stay home.\nThis is the most important one because we don't want you to get set, So we are offering free flu shots at my office in the Tremont section of the Bronx, which is 1826 Arthur Avenue.\nIf people want to know where the data is from well, thank you, So much Anita we're not going to open it.\nThe situation is that until the mayor calls for in-person meetings, the elections needs to be halted until that point, and only because there is an issue of confidentiality when you're voting and secondly, and most importantly, anybody that wishes to be considered as a candidate needs to meet with the committee in person, and we can not have no in-person meetings until then.\nAnd, we can't have the confidentiality of voting at the election, get that Iran pass unanimously and we have quorum, and they just want you to know that Ralph and I have been having several meetings with agencies.\nWhat I would like to do is recognize our councilman, who is online councilman, Rafael, Salamanca Junior, all right, guys, First I want to welcome everyone back to session.\nThe community boards are are not in session, but I also really extremely want to welcome back the the new members that have that have joined the board.\nIf you have more than three absences for a committee that are unaccounted for, You will not be reappointed, and you know I, as a former district manager, I understand the value of having a quorum and when you don't have when you're, not present, it makes it much difficult to have a quorum and therefore business can not be conducted other than that.\nYou know rolled out well, send us an email of a proposed map in the summer and then did not follow up and automatically install these CitiBikes throughout, not just community board too, but throughout my entire council district as well, and so there's a back and forth with DOT and the community board in my office as to locations.\nAnd, then finally, You know just to give you an update as to some of the work that my office has been doing.\nThat would I would think that that would be something that is going to be discussed between us and urban and as well as parks Department, But that was one of the conditions that Parks Department wanted to make sure that somebody was going to take care of it so that they can move on to do other.\nHe stayed in these states and made sure to continue the health coverage that we needed in this community.\nYou know I want to keep that on the burner, because I think we should.\nI've got complaints as well about the locations, but I'd like to reach out to you, so that we can make better for coordinating stuff because I know Ralph does great work there, but I'm, also an elected official that gets involved and can help you guys out.\nOur communities were hit terribly, but I want to ensure and encourage everyone to make sure that they take all the personal protections they need.\nMy office email, give us a call, we're happy to help we're visiting a lot of the schools to make sure that what we're seeing is that our kids are in a safe situation when they return to school.\nWe are in constant communication with the chancellor and the DOE, because you know our kids and they number one most important things in our lives, so I want to keep them as safe as possible.\nWhat's going to happen every time we get close to the removal of the moratorium, because you know, if we're going to have massive evictions, a lot of people are going to be homeless.\nYou know I'm, proud to say that I think we've done a lot to help the families in our community.\nOnly thing that I need to ask you is that I know Ralph.\nI know that sergeant Guglielmo has been on the line and sarge I want to, I'm, sorry, but.\nNow, with the state liquor authority regarding some of the open restaurants in our district, I know that sergeant Guglielmo has been very helpful and are monitoring all of these locations and making sure that they're in compliance.\nI want to thank Anita, Also because I've been working with the Ohmh over the summer.\nYou know the you know spreading of any type of like Covid-19 for an example, but once the office is open, we'll, let everybody know we're still working remotely.\nIf I can district manager's world president's report, Is anybody from the Bp's office, unlocking Hey Bobby, good evening, Community, Board.\nI like to know who, in the city is doing that because, first of all, as you stated, it's a Friday.\nYou know: I- try to stay away from that area because of the construction when I'm driving, So I just have concerns about the route that they have I agree.\nYou know and make sure that everybody's safe on that day, I'm just going on the record, because God forbid something goes wrong.\nI, don't want it to be said that community board 2 sanctioned something like this and somebody got hurt and or that the 4-1 get blamed for something that you know.\nYou know: I, don't want lately.\nAnd I, thought I saw Maritza, Ron I, don't know if Marissa wants to add anything else from what the council member stated, hi.\nI saw Justin around I, don't know if Justin wants to say any few words.\nThat I want you to know.\nYou got two minutes all right, so I just want to give you a quick, really update on what we are working.\nSo we just want to make sure like the community is informed that, as I say, I will put all the info on the chat, and thank you great, thank you.\nI just wanted to announce that over the summer the comptroller has been doing a lot of work when it comes to education, homelessness, small businesses and providing support at different pieces.\nI know that there are a lot of groups and people that care about what's going on and they want to make sure that our office knows so.\nWe want to make sure that people get our adequate representation and funding.\nAnd I just want to make sure that she understands that we have to have representation from bqn in the community."
        }
    }
}