{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB1",
            "channelId": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "title": "Transportation & Street Activity Permits Committee",
            "publishDate": "2020-12-01",
            "shortDescription": "",
            "lengthSeconds": "2:11:02"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB1",
            "normalizedName": "Manhattan Community Board 1",
            "twitterName": "Manhattan Community Board 1",
            "youtubeChannelName": "Manhattan Community Board 1",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "twitterHandle": "@CommunityBoard1",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "4nRM0cUp-zA",
            "fillerWordCount": {
                "uh": 205,
                "um": 174
            },
            "readTimeFullTranscript": "80 min read",
            "readTimeSummary": "14 min read",
            "wordCountFullTranscript": {
                "parking": 73,
                "street": 43,
                "mopeds": 28,
                "space": 26,
                "agency": 26,
                "streets": 24,
                "regulations": 24,
                "law": 23,
                "rules": 20,
                "moped": 18
            },
            "wordCountSummary": {
                "parking": 25,
                "agency": 12,
                "street": 10,
                "space": 10,
                "streets": 9,
                "mopeds": 9,
                "regulations": 7,
                "law": 7,
                "businesses": 6,
                "cars": 6
            },
            "fullTranscript": "You're good to go thanks. Welcome everybody to the December meeting of the Manhattan community board, one transportation and street activity. Permit Committee, one of the you can see the agenda tonight. It's been moved around a little bit and that we're going to start with the street use priorities because Jennifer Leung is here from the D.O.T in case we have any questions and then we'll go back and proceed. According to this agenda joining me is Lucian Reynolds, the district manager who will be running from the controls and Michael Franco. The co-chair is also going to be taking on the first topic of tonight, which is going to be the street use priorities. So I'm going to turn this over to Michael Great, so I am going to actually shift screens to show the Google Doc that we were working in last time. So let me see if that oh Michael can I just want to tell people. When there are discussions, we will start with community board members, and then it will be open to community members. So please be patient. We will get because we do want to hear from everybody. Thank you. Yes, great point great points Michael and we, while we have Jennifer I, just want to make an announcement to everyone or just ask Jennifer the one Michael's done Jennifer. If you would remind everyone about the Chinatown, the great wasted Chinatown meeting tomorrow, I'll be putting a link in for the flyer for everyone. If you want to click on the link, you can see the flyer for more information, but just wanted to get that out there, while we're probably at maximum attendance- and we have Jennifer here sorry about that Michael- you go ahead, no you're good! Actually! Well, I've got this. Let me just send out the link to eulution so that you could share it in a chat. If anyone wants to tag along, let me see if I can find my chat window. There's chat, cool, so I just sent that to you Lucian, so to give everyone a little overview of what we were talking about at last month's committee meeting. We broached this topic and this again is probably just going to stick to being a discussion further down the line, and if we have alignment on some of these issues, it might turn into a resolution. But that's kind of the arc of the of this I guess brainstorm. So last month we started having a conversation which was prompted by all of the changes that have happened over the past. What eight or nine months in New York City, in which we've seen many unprecedented changes in our the use of our streets from restaurants to open streets, for you know, exercise and commerce and DOT is taking those all of these programs that were enacted very quickly and without a lot of community board. Input and they'll be working on finalizing that and there's been a lot of different pressures from business interests from communities from the city council to extend these temporary programs and make them more permanent and given that process is occurring, we wanted to make sure that, as a community board, we start having a discussion about what we. What our input is, what our priorities are, what our guiding principles would be so that we can get ahead of some of the discussions that are going to happen as DOT is working to finalize these programs and provide them with input ahead of time as to hey. This is what our community board really prioritizes and really wants to see. This is what's working, and this is what might not be working, and so what I'm going to do is we kind of had a pretty unstructured conversation about it at last committee meeting and we just kind of went through some. You know priorities off the top of people's heads. Some bullet points, so I'm going to go through these and provide a really quick overview of what we talked about. I did provide the link to everyone in email that and everyone should have been able to like go in and edit this page. There wasn't too many edits after following our committee meeting last month, but so I wanted to give everyone an opportunity also to see if anyone has any additional thoughts once we do that, then I was thinking that we should go through and see if any of these bullet points fit into broader categories, that we could kind of group them into since I think or I'm getting the sense that the best way to present these priorities is at a more higher general level, rather than being super specific. But we'll do that again after we. If we have alignment on any of these, so I'll start and talk through a little bit of what we talked about last time and a few things that came up were freight and deliveries were a big one. We see it all throughout our district, a lot of double parking, a lot of what seems to be either a lack of enough delivery zones or the fact that placard parking is blocking delivery zones for businesses and the major freight companies like Fedex Ups, and we see that there's like one great example, there's like a fresh direct truck. That's always parked on Liberty street over by maiden lane, that seems to have like a 24-hour distribution center and a no standing zone. So that's a there's also a lot of Fedex and ups trucks that often park on the sidewalk blocking the sidewalk because they can't seem to find any parking. So that was an issue that that's come up and it was also actually prompted because we had a few discussions about the cargo bikes over the last few months. Another one I hinted at just: there was placard parking and finding ways to reduce municipal curbside parking since that's come to dominate the curbside use in our district. Another one is, you know, sanitation and curbside trash. We had talked about this a little bit. I think it was at the beginning of this year, though that seems so long ago in which the Department of Sanitation announced that it would have a clean curbs pilot program. Actually, I wonder if this link shows an image, it doesn't show an image, but the idea was that they wanted to start a pilot program in which they would create or be start putting containers on the curbs for businesses and residences to use to throw their trash out instead of throwing them on the sidewalk. Another thing that came up was actually prompted by the discussion that we had about Edgar Street on or trinity place at your street, in which there's the new school going in there. We had started having a discussion about making sure that our a priority seemed to be coming out of that discussion was we want to make sure that they're, safe, drop off and pick up areas for school kids, I wrote as a question as to whether or not there's demand around schools for additional play space or areas, especially given Copen 19. We also had a we started. Talking about. I mean it's impossible to talk about transportation without talking about congestion, pricing and congestion in general. Asking what her stance on congestion pricing is. There's I guess in terms of regarding some of the programs that DOT has in place right now, there's the current open streets, programs and so I think I'd like to pose the question to the committee. How do we feel about those programs? Do we know that they've been implemented for many restaurants? It's been a lifeline, but have they been working well for the residents? Yes or no? Do we like these programs? Would we advocate for them continuing or even being permanent? Those are all questions that I think that we can have and maybe not get too into the weeds of, because that would kind of involve maybe a discussion with the licensing committee about the processes for obtaining those licenses. But it's something that should be on the table for us to talk about, but this is one that I added related to security zones. This came up when we were talking about the closure of that street in front of the new school over on Trinity Place or Greenwich Street Trinity Place, and a possible solution to closing down the westbound side of Edgar Street would be allowing traffic on Liberty street, but currently that's not allowed because it's within the I guess the envelope of the world Trade center, which is a security zone, and we have a number of security zones in our district around the world. Trade Center around the Wall, Street Stock Exchange area and around one police plaza and so I just wanted to throw that out there as a as something at least. I've been thinking about, because that does represent a pretty significant chunk of space in our district. That's not as open to the public as other areas. Another thing that's come up. It's come up. It will come up tonight and has come up in past sessions is how do we feel about shared transportation? Bike shares, mopeds and car share. It does seem like these private public partnerships are a big are at least here to stay for the short term. Perhaps the long term in these partnerships with bot and a lot of these, like CitiBike stations, do require a public space public curbside space, and we actually had a conversation about that last month and I wanted to actually throw I wanted to show everyone. This was the resolution that was voted on Gosh. Was it a week ago, two weeks ago, one week ago at full board, but they it came out of executive, and this was about the four sites that DOT and CitiBike had come to us to talk about, and we ended up. You know supporting the expansion into two non-controversial locations, but also when the therefore be it resolves were a few points that I think feed are good examples of what we could come out of these priority discussions with one of them is you know that putting we believe in putting pedestrians first and request that new docks go on the road bag. Road beds, sorry versus the sidewalks, especially when it comes to historic, sidewalks like in the Tribeca district. Another would be avoiding docks blocking sidewalks or street space that existing restaurants are using for the open restaurants program. Another is hey: we should be putting bike lanes on streets with CitiBike docks and increasing education around CitiBike, and so some of the things that you see right away here are things prioritizing pedestrians, making sure that we are not obstructing sidewalks, making sure that we're you know supporting our local businesses and making sure that we're ensuring safety both for cyclists and pedestrians. So those are just a few examples that made their way into a past resolution that I think honestly would fit well into this discussion. We're having right now, I'll go through the remainder really quickly, so another one was pedestrian, curbside and drop-off locations, oh, like for hotels and residences, making sure that there's space in front of those I guess high traffic areas such that pedestrian, sorry residents or visitors, can get in and out easily kind of what I was just speaking to was. You know it seems like a priority. In summer past conversations has been reducing obstructions on sidewalk, making sure that residents can get around and pedestrians can get around. You know a few things are like scaffolding. You know delivery trucks, parking on bicycles, Bicycle parking. So these were just what we had right now, so I wanted to pause and see if anyone had strong opinions about any of these or had some things that we missed and I'll also try to I know. People are here for other discussion items, so I'll keep a track of the time and not let this discussion go too long, so we're at 6:20 right now so I'll stop there. Any thoughts on you, Buddy and Betty feel free to weigh in as well. Oh sorry, I see hands it's been a month or a week. Out of these meetings and I forgot how they work so I see Mark Camarouzo's hand up and then I see Patrick's hand up, so we'll go in that order all right. So the point that I brought up last week that was last month, I was supposed to be included in this is missing and it was regards to parking regulations, and we had a vote on this and before the virus. With regards to committee vote to make have this on the agenda but understand it's been busy and we're working remotely it's a little more harder, but the justice of it is that I guess the language would be change. Current parking, curbside regulations, where appropriate to comport with the current residential and business needs. So as an example in my neighborhood in Tribeca, there's still a number of streets that are, you know a throwback to when there was a light industrial neighborhood there's a lot of no parking, eight to six and there's no parking any times on streets that should absolutely be I would say, as mostly com you know, being you know, in line with other streets and air that are similar, alternate side parking and then also partly truck parking as well, a section of the street or a whole street or whatever the case, and that's something we could that's easily like I mentioned last time. Community Board two has things like this and their agenda every month. Change this to that change whatever to whatever. So we really need to start hammering those outs in every neighborhood and every all of us know our neighborhoods and what would be best for the neighborhood and we got I think we need to start working on that, and you know speaking with D.O.T and Jennifer. Maybe you can chime in on this over the years. Is that they're very amenable to changing regulations when we request it, of course, they're going to look into it? If there's an issue to let us know, but generally it's not or I found a big deal to change something if it makes sense. So if we can add that language that I mentioned change, curbside parking regulations to comport with current needs of residents and businesses, yeah for sure yeah, so I just put this here, and we can have a conversation about that. I, wonder if that also do you think that we could squeeze or that would fit well with placard parking. I know, we've had discussions about no I think that's its own issue. Placard parking is its own issue, and this is a its own thing as well. They shouldn't be combined, I, don't think! Okay, sure, that's fair all right! Thank you. Yeah thanks mark that'll be added to the resolution. Yes, so I've got it here. It's we're right now, just talking about a discussion like and so I think, once we finish having discussion about these points, I'd love to get everyone's take on how they kind of fit into broader buckets, and if we want to pick any of those that are going to become part of our resolution. So is this resolution as we're looking at it now going to be voted on not tonight? No, and it's not going to look like this- is just a kind of word vomit on a google doc right now with some ideas all right. So then there's no reason not to add the sentence. I said right, yeah for sure. Does this capture it or no, like changing curbside regulations to better with district needs, yeah, basically to comport with the needs? The current needs of the residents and businesses yeah sure yeah, but that's not a priority use. Why not? Because that has to reflect the priorities that haven't been decided, yet it hasn't been decided. It's the regulations or the regulations are what they shouldn't be. Well. We don't know that yet you do know that if you live in the neighborhood, you know that you have no parking any time on a street. That shouldn't be that there's no reason to have that. Then it's obvious. It's self-evident, yeah, I, guess I think what Betty might be trying to get at is. Are there any specific, so you mentioned like changing regulations. Do you think one of the things is more or less truck parking, more or less residential parking? If you want to get I just wanted to give like a broad stroke on it to be simple, if you really want to get into the details on it, I can spend another half hour talking about it, but I just don't get my one little sentence there would, just you know, be a shot across the bow to start getting into details later sure no I think that's totally fair. Okay, thank you. Yeah thanks mark, okay, Patrick I, see you and then I see Britney's hand up after you. So if you want to go after Britney two quick points, so one is actually building off of what mark said and I'll, throw in a specific use, priority and regulation that I think would work and I think what mark is really getting at and is something that people have been struggling with for a long time is. How do we manage all these different priorities and uses among different times right? So sometimes, commercial, loading and truck parking makes sense for a particular part of the day. Sometimes residential unloading does so anyway. To my two quick points, one is residential. Unloading is a little different than just drop off and pick up. It's something. I've noticed, particularly since the pandemic, that we have a lot of people. Maybe it's just people are owning more cars, not sure what it is. People are getting more deliveries of living at home, but I see people with a need to park in front of the building for up to about 15 minutes or so to be able to unload groceries, unload stuff that they just went and got at Costco, etc and then being unable to do it and I could say, particularly, for example, on John Street where I live. You see a lot of congestion and backup because that option doesn't exist for them. So I would add that under I think it was the second to last point about residential drop-offs and I. Think you could just expand that from drop-offs to be something a little bit more around loading and unloading, short-term, so minute regulations, for example. Second point and it's really I know we touch a little bit on construction, but to drill down on. It is more of a sensible way that we manage DOT construction permits. Jennifer probably knows exactly what I'm getting at given series complaints, but we have a situation, for example, on John Street, where the owner of the building of 110 William Street constantly has their demo hauling truck in front of two residential building entrances, which environmentally makes zero sense, and particularly the last permit that this company has they're hauling from literally around the corner. Their dumpsters have to like be rolled from hundreds of feet away in order to meet the truck that's sitting for no reason in front of two residential entrances so prioritizing where those D.O.T construction permits are in a way that makes sense with the other uses that are going on again. Coming back to the broader point, I think Mark was trying to make this it's just really about how we manage all of those uses. At the same time, thanks sure those are great Michael if I could just chime in I think one just to round that out. I think also exploring what the current New York City law is, that forces DOT to have to give those permits for very little money. So I I'm hearing that the these construction, the demo jobs construction jobs, are taking street space, but paying almost you know nothing compared to the value that it actually, you know, represents to the community in terms of moving people and goods and services through the district, that their pain was nothing and so they're acting like it has no value by you know not effectively using it, and so if they were to, if they were, if the law was changed, so D.O.T could charge them. The actual sorry you hear my son, you charge the actual value of the street space that they're taking up. Perhaps they would be more efficient with it. Well yeah, more efficient use of that street space. That's a great comment: Lucian Cool and I saw Brittany had her hand up after Patrick yeah. So if you want to go ahead, hey Brady Michael, can you hear me? Okay, we can yeah perfect okay, perfect. So the point I was gonna. Make was under the business sub bullet yeah, so I personally, actually do really like the open streets program. I think it's actually quite beneficial from a pedestrian standpoint. However, the only I think drawback and I think where there's room for improvement is around communication. When I've been biking in the district or even in a car. Sometimes streets are just closed and obviously you don't know that until you get down the street and I think that makes it a lot difficult. A lot more difficult for people to navigate around the area without having some advanced heads up and obviously different streets have different times of their clothes versus others. So there was a way to have more of a synchronized and streamlined way to communicate. You know when certain streets are going to be closed if at all, I think that would be helpful to not only pedestrians but also people that are driving or cycling or whatever the case may be. Yeah no I completely agree. That's a great point. Cool and I see Mariana. You've got your hand up too hi. Thank you Michael. This may go to mark's point, but there are some streets that seemingly at least have some nonsensical parking rules. I mean there may be very good reason, but, for example, like maiden lane between water and gold I, don't know you can't park there until like 10 o'clock now I park inside, but I notice, these things and I feel for my neighbors nothing's over there. I can't imagine why nothing's over there but residences, you know after business hours, so I can not imagine why they would be charging and it seems like I said there may be very good reason, but it seemed that they just may be. Taking advantage of, you know what they feel. The financial aptitude of the neighborhood is, and that's I mean it's unfair. It's insulting I actually had I won't mention the restaurant, because I want to continue to support and I had a complaint, I called them directly. I didn't want to complain about them publicly, but I got a burger. It was 1960. I. You know all together, I paid 25 for the burger, because I like to tip the people and stuff too particularly. You know these days and it was like a pre-made Patty that was rancid. You know basically, and so when I called I says: oh well, you know we, the prices are like for the neighborhood, but we still have to have good stuff and I feel the same way about you know these public services and maybe more so because that's our tax dollars as well. In addition to you, know something like a parking meter that has to be fed that you're paying more money yeah. No, that's a great point, I wonder so like Miriam. Do you think that like would fit in as I think you're right? It kind of fits in with what Mark and Patrick were saying and possibly even more to the point where there are some parking rules that maybe are remnants from when they maybe made sense in the past, but the neighborhoods changed, especially now with Covid-19 things have changed and it might be time to revisit. You know a bunch and maybe even look specifically at some of these parking rules. Yeah exactly thank you, yeah. Thank you. Mariana Tammy, I, see with your hand up Patrick I, also see with you. Still with your hand up did you have something else to add after Tammy I'll go? Do you after Tammy nah, let Patrick finish first, but I'd always like to hear from the community. I got to take my hand out. Okay, the floor is yours, Tammy, so I apologize for being late, I actually had a work. Call that went late, which was delightful difference from this, but it does make me come back to conversations that we have had about old remnants new usage and really one of the striking things that has dawned on me. There's been a ton of usage change on the streets, not only in fidei but kind of all over I'm gonna use, I. Think Lucian knows where I'm going. I'm gonna use the area right by Washington Market right just north of where we have the weekend market. The farmers market there used to be a supermarket there and the parking was designated specifically for it being a supermarket the developer, who bought that building and now operates it. There's a private club there you know for kids club, it is no longer a market, so it doesn't need the food deliveries. It doesn't need the rest of it and yet we look and have the same. The rules have not changed. The parking hasn't changed, it's an ideal location for other usages potentially, and the parking could change and provide relief to the area in different ways, and I'm wondering there doesn't seem to be that I have seen as of yet any mechanism that I know of to be able to report that request that you know kind of figure that out and yet it does seem that the agencies have a way to request parking on specific streets. So if an agency moves in and we've seen, we've approved numerous city agencies moving around our district, renting new space, that's come before our board and they apply to DOT for street side. You know agency parking one of the things that drives me nuts, and yet, if they move what does that parking end up being again? So I'm kind of wondering, if there's a mechanism, a form, a request file, something that's easiest easier for people to be able to funnel that, and if our goal is to reduce usage of cars and getting cars off the streets for a variety of reasons, then what can we do about agency parking to get them to use any number of the garages that we have that are not sold out in full and get them off the streets to really see what that does for our community, even if it was turned into metered parking, which would then make money for the city and allow people to travel? Those are questions that I'm not sure how to phrase in this, but I'm certainly curious to find out yeah. No, those are all great points and I think this is turning into something that actually might end up being a good topic for like a future meeting. Maybe we do some research and see if we can get some experts or someone just to speak on this topic or just minimum. Do some research for us because it does seem like we do- need to have a conversation about the current street parking regulations and, in addition like why there's so much or how there is so much agency specific street parking, for example like there's streets that have what parking for like I, don't know, DOT or parking for different agencies, federal and state or sorry? How can you tell me that actuaries have to have street parking right? What part of emergency you know need to their car? Does an actuary have just say it? Yeah no I mean I. Agree. I personally feel somewhat slated by it, because it does feel like our neighborhood is being treated as a municipal parking lot when it's our streets, you know and that's public space, and we deserve to be part of a conversation as to how that space is being allocated. So I completely agree and to Mariama's point. I do remember them DOT presenting to us. Oh gosh Betty, I'm not sure if it was before your time, but you have a better memory than I do often, but they did present to us about meter changes specifically targeted to pricing increases in Tribeca because they felt it was able to be afforded. That's before my time. So before this committee existed, I, don't remember what committee it came to, but I remember, sitting there thinking, crap, that's going to be expensive! I think it was straight back to committee. If I remember here, it must have been either that or quality of life yeah well Tammy. So the to answer. Some of your question, I'm sorry to interrupt, but to answer your question about mechanisms and how to deal with some of this, it could be just as simple and before you came on as community board two does and it could be. There's a resolution saying D.O.T: please modify the parking regulations on this residential street from no parking from eight to six to alternate side parking. Thank you very much and that's it great yeah. No, that's helpful to know so. I guess we can look at kind of some of that language that CB2 has used in theirs, I'll make sure to look at the email here and there kind of thing and then overall, with what Tammy was talking about- and you were talking about regards to the agencies using our parking, it could be a little more comprehensive as opposed to a piecemeal. We know what's going on this street in that corner kind of thing. So it's a you know pincer movement, each you know different ways to attack it. Yeah I think it's great I think that you're right mark, but I also think the way that DOT operates is with a one review. Look and I mean that by with no disparity but for example, Amazon asked them for a space on Warren Street. They did not do a study on Murray or other options. They responded to the one request for that one street, so I mean we could take a look and say holistically. You know, host meetings, looking at a three block, radius and parking and God knows it would take years. But if that's the only way we could there just should be something easier than that, maybe Lucian. Maybe you can call talk to CB2 and see because it's on their agenda all the time I get their emails, how they tackle it, but it's always in their transportation committee. There's always some kind of parking regulation change. If they want to switch, maybe you can call them and see how they appreciate. Do it procedurally? Does that work is Lucian's still there or I heard him he's at the baby. No he's there, but mark I can tell you they do it block by block yeah. That's some might have. Maybe that's a start. You know it'll help here and there you know cool I do see. I saw. Oh pat, you've got your hand up. Mark I saw you put your hand up, but did you did we hit you with that point? I'm putting it down cool and then I see Mariana's got her hand up again, so I'll go to Pat and then Mariama. Some of these issues I was going to answer, but some of you have already answered them like Tammy. We have you know a lot of these were quality of life issues and right before the transportation committee, and so you know, parking I, think Patrick brought this one up. We've had several buildings come to us over the years, asking for a pickup and drop off spot in front of their buildings. D.O.T has been aware that this neighborhood has. This community has changed. People we've talked about it in the Wall Street area, where they blocked people off, and they can't you know, get access to their blocks to pick up or if they have elderly people who need to be picked up in front of their buildings, and so you know it has to then there the parking arrangements have to change according to the residency changes in the community and again, as Tammy said, a lot of this has to do with agencies that have decided that they need all of this parking. We don't understand why I mean people, you know we work in New York, you take your take public transportation I, don't understand why they have to have agency cars for every single agency and why they have multiple cars. So we have you know several of these. Things have been on the books. I didn't quite hear what you said about scaffolding, but we know scaffolding has been on the books for ages. It's a problem in many respects. It affects many different issues in our community, so yeah, I'm here to continue working on them. I'm here to help you guys, whatever you want to do, yeah for sure, thanks for joining that, it's good to have you here, I'll go to Mariama. Oh sorry, Betty I can I just make one clarification. Yeah, please I want you to know because in fact this came up with Jennifer Leung. Recently we have somebody in fact, next month, there's going to be a group coming forward about the signage in front of their building and the ability to drop and pick off people, something that Pat Moore just spoke about. It can be done. The procedure is for it to come to committee and a resolution go to the DOT and that's how the DOT acts on it so got it want to clarify. There is a process that is how it gets done. It will be done, be very helpful for me, as chair of the committee, to have the idea of the community's priorities, because I have a bunch of individuals saying this is a good signage change, because I want this in front of my place. We need to hear a bigger picture stroke before you can deal with individuals with their personal agendas, so we've had buildings that have come before quality of life and the solutions on the call he and I just discussed this. The other day I was saying to him: whatever happened with those buildings that were requesting pick up and drop off and D.O.T attended. This was the old commissioner attended our meetings and said: they'd look into it and, of course, there was agency parking on the block, one building in particular I'm thinking about, and they never got back. They never did anything about it. The residents gave up, we gave up so I, don't know. If there's a new mechanism in place, it would be nice to know about it. Well, hopefully, we'll be able to track it more closely as it comes through transportation committee. So I will take that for warning and again some of what Patrick said is the same issue. It's got to be done. There may need to be a different signage that we look into doing too, so there's actually a drop off time, so someone can't be arrested for being in the wrong kind of signage. But that's another issue. That's going to be coming up soon, as is agency parking, is coming up soon because there's a deadline for them to all make announcements of what their usage is, but again another month or two we'll be more prepared to talk about that. Sorry, Michael, no you're, good thanks for jumping in Betty I was just going to go to Mariama, who I think you had your hand up? Yes, I did put it back up, so the last instance that patch talked me about that I recall was on Duane Street. There was a building that could the people couldn't even stop for a moment to try to unload their cars and it was a real. It was really a problem because there's so many other things that are there, the fire department and so on and so forth yeah. So we did have buildings like that. Would come to us that you know the moment. You stop. There's somebody coming to give them a ticket or something which is pretty. You know disgusting in any case, I wanted to pick you back up for quickly on what Tammy was saying as well as kind of touching on what Britney suggested. You know when you have like a new turning signal or something all of a sudden on the street. A new stop sign. There is a notification, at least on the street. They don't do that with parking and like I, it's more of like a gotcha. You know, or residents are they're used to parking on a particular street. We have very few to choose from you get. You know where the parking places are and all of a sudden there's a meter maid there. That's ticketing people I witnessed this recently in our neighborhood. There was an agency that had taken over what, prior to that, had been parking at least all day on Sunday, with Monday, through Saturday being seven a.m, to seven p.m. So you could park in the evening and you could park all day on Sunday. This was a Sunday morning that I was there. I was in my car because I don't even like to take resident parking for a moment so I just like quickly. Let my kids out to go to the store and I wasn't going to take up a parking space or if somebody came I wanted them to know I'm leaving in a second. So you can have this space that you need it more than me and that's how I witnessed all the people like a whole line of people getting tickets and I'm sure there were people from the neighborhood that were used to that being, you know free parking on Sunday and all of a sudden it wasn't so notification would be fair in those instances too. Instead of like this, like gotcha, you know now you got to pay 115 bucks that that's disgusting thanks, yeah, oh that's, great and I- was also going to say a quick time check. We've been talking about this for 30 minutes, so we'll try to wrap up the conversation in the next like five to 10 minutes. So we can carry on with the agenda. I was gonna, ask we talked a bit about the open streets program and you know it's been I know it's been a lifeline for a lot of businesses and I've been glad to see it helping or do what we can to help the restaurants and the businesses struggling. Our district I will say it has been a little heavy on helping private interests. These are private businesses that are taking public space and again glad to see them get the help that they need but wondering if we should or how people think about advocating for should the community have some similar opportunity. Should residential buildings be able to have the opportunity to say hey in front of our in front of our building like we want to participate in this program as well, but we have increased, need for you, know residential drop off and pick up and that's what it should be or what not I don't know if anyone has any thoughts on that Michael just want to, let you know with the member of the public with a hand up oh perfect, thanks for letting me know, okay! Well, in that case, I'll cut off my rhetorical question and let's go to oh, it's Carrie, Davidson, okay, let's go to Carrie hi Michael I know I'm sorry to cut you off like because I think you're on the right, not at all I, I'm gonna actually I think add on to what you might have started to say, which is that you know with all of these balancing things we're gonna have to think about. You know how many people that space is serving right. So are we serving the greater community by having a single private parking space or, by you know, a residential loading and unloading serving a tall residential building? Or you know you could argue that agency vehicles serve more people than a private car like so they're. All of these things that I think are really important. Civic conversations that I'm really excited that you guys are undertaking and the document that you have there. Thank you for sharing that link, because it makes it much easier to see the changes that you're making but I. Think one of the things that we have to do with or I would suggest that we look at, and maybe Jennifer can weigh in is that we need to focus on how we're balancing the larger buckets like. How are we weighing the needs of pedestrians versus bike docks? How are we going to weigh freight truck loading and unloading for industry like construction or Ups Fedex or open restaurants right? Those are all businesses, I suppose, but they have different communities and they serve different people and then I wonder whether or not in weighing you know, should it be pedestrian use or vehicular use or bike use or shared car use or all of those things like what is the metric for deciding how we balance those things? Is it the number of people served? Is it the ability to generate revenue for the city? Is it you know just whoever puts in a resolution because they had enough people sign a petition? What what's the right way to I? Don't know to organize these. You know these various interests and I heard what Tammy said about you know. Maybe you take three blocks at a time or the CB2 method, which I also get those things, because my office is in that area and Mark's right they have agenda items and it's block by block use by use. You don't really get to a holistic point of view unless you've got a committee with a lot of institutional history. So I'm really excited about this conversation and I all the things that I'm reading and I really think. It's great work that you guys are doing, and maybe Jennifer has something that she wants to add about how DOT is prioritizing these different uses, yeah thanks, so much Carrie I think you hit the nail on the head there, because that's the I guess the thing that ties all these things together is that there is a finite amount of space in the city and prioritizing any of these by necessity means that there's a trade-off, but it can't be used for this or that and so yeah I would love. If Jennifer is I, don't know if she can unmute herself I know she's in the attendee list. But can you shed any light Jennifer, maybe on how on a high level, how DOT what metrics it uses when making some of these decisions and how I guess what the best or most efficient way for the community board to weigh in on this and tackle this and start to? You know put this in ways that makes it helpful for DOT, so based on what I've been hearing, there's a lot of different groups that would be involved. Looking at this all together I mean the card rack. That's one group in itself. That would be the bar engineers, one who does the signage, because they would have to do their own surveys when they do those changes to the current regulations and I know when you guys are mentioning about loading and unloading zones. That's also maybe the same group. At the same time, we will also have the frightening mobility unit. Take a look at it, because if it's also a mixed-use area that they would have to look at the different uses for that block, then I know when you throw in and throw in construction. That's a whole another group that would take a look at it. I mean a lot of all these things. To me, everything that you just mentioned for the street use priority stuff I think it would accumulate into like one big study where everyone in my agency, all the different groups, would have to take a look at it. Based on what they've been working on throughout the city, I mean when you guys were mentioning about how CB2 has on the agenda items to have like current changes, you're correct that they do look at it based on someone that came to them with what they thought that okay, maybe this block they've been you know they have knowledge of this block. They have people that they've been working with who've been speaking to, and they would like this to be changed, so they would put that in as a resolution have it on the agenda. I most of the time I do attend that meeting I, you know I, listen to what they have to say. I could give them my. You know what I know and sometimes, if I get in advance, I might actually ask my engineers to take a look at it and see if it's something feasible and if they do think that it's feasible, they would like them to make sure you know get a resolution and that's something that we can work on and that applies to every you know. Community board I mean we always get all these requests through. You know different ways: I mean sometimes you know, even through our web forms. When we get certain consistent complaints or about certain areas where they want a certain regulation change, we will take a look at it, but at the same time sometimes we won't just take that and just go ahead and obviously install it. We have to make sure that this you know let the constituent know you must go to the community board, make sure they weigh in on it and based on the resolution that they provide. But then we're able to you know continue. You know we'll always do a preview and try to you know assess a little bit before. We make sure that it's something that we can do I mean sometimes we might have to do further study and when we have to do further study, then we have to let them know that. Okay, thank you for your support, but we have to make sure that this would work and a lot of times. There are certain. You know when, like I said when it comes to curb rates, those are easier things to change, but when it comes to different ask there might be different things that we have to look at I, don't know if that helps. Hopefully it does. No, that does any insight, helps no for sure. Thank you for weighing in there I'm gonna jump and ask Jennifer a quick question on that. Jennifer. If we are the constituents, because we as a community board, are looking to reduce agency parking, because we know that the agencies will not come willingly to the plate, are we allowed to make those requests or does it have to go through the agency so because our area is so different because the amount of federal state and local? Well, are you asking like say, like a particular block? Has too many agency parking that you want us to like shorten it or like, or I'm trying to think of an example? What you're think of an example so on Granite Street between Barclay and Murray? Okay, if we said you know, there's agency parking there seven days a week, but we would like to know if that agency parking could be either reduced, removed or changed to business hours, Monday through Friday, seven to five or whatever, and either be metered or free afterwards, which would help facilitate parking availability for people attending target and whole foods and the ancillary small businesses in that zone. We are the community board coming to ask that okay, Jennifer. This is I, think that can be echoing 57 Reed Street, that Pat Moore was describing. Was the community board asked DOT to audit the amount of agency authorized parking that was actually necessary for I, can't remember what agency it was for that particular street. But you know the agency makes a request. The DOT says you could have a subset of that, but the question is: how much do they really need and are they using the amount that's set up set aside for them and we'd like to right-size? That, as a first, is what that particular resolution was and I think that's what we'd like to see all over the district, because I would say that typically each agency that comes to us they have, we have to have them, submit us application and a survey like they have to give us the number of cars that they have, and you know, based on where they're located there's a formula that we look at and based on that formula. That's the number of spots that they get but oftentimes they don't get all the spots that they are requesting say like they have like 30 vehicles and they're asking for 10 spots. I think our horn will only allow them to have maybe three or four or something like that. I'm sorry to interrupt something like that. But Jennifer will is that reviewed at three spots and they? How long do they have those three spots a year or forever, or is it reviewed depending on the neighbor, the changes in the neighborhood? Well, this is the thing oftentimes, our well my office, we're not aware when the agency is no longer using those spaces and if there are spaces that you guys know of certainly send us, the requests and those spaces can return back to the public. Or if you realize that, maybe that agency is no longer the same amount of vehicles that are using that space, then we could also definitely take a look and you know resurvey them, because what we do is that our authorized parking unit is the one who does all the coordination and they they're the ones who assess see if they need that many or what's the reason and a lot of times, especially down here, we try to say we really try to say no, because then I don't think, there's any more space for us to provide them. I mean every now, and then they will come to us for relocation, which we would end up trying to see. If we can reel here and then sometimes we end up discovering wait. Why do they have that many spots when they're already using other spots, but we will actually pick them up? This is Patrick who reviews Dot's inventory of those spots DOT, as you know, and financial district has a lot of those spots. So how does that work? You mean our own agency yeah, that's a good question. I would I, don't know the answer to that. Patrick, don't bite the hand that feeds you yet sorry got it. No worries and yeah. Sorry to put you on the spot Jennifer, but this is all really great information. Pat I apologize for not calling on you earlier. Did you have anything else that I see your hand up and I see Marx yeah go ahead. I was just gonna. Ask you if you could send this document to us in an email, I'm on using my phone and I? Can't you know I can't read it. Oh sure, of course, I will send you this in an email. Great, thank you for sure, and I saw mark. You've had your hand up. Was it from a past question something new Sorry Michael for opening this can of worms, but two things I want to comment the question. The way these things will come to us is they're, not necessarily personal requests, personal needs, it's just. You live in a community and you're there all day and you know what works and what doesn't work. So that's how the request comes to us would come to us just like in CB2 I mean in the next couple of months. I have a few that I know that I'll ask to have put on the agenda that are pretty much no-brainers, we'll start with the ones that are easy and simple. A couple of blocks and I. Think I can get some support on that. But I have a question for Jennifer and corporate from wrong. I, don't think. Is there there's no such thing as there's loading zones, there's hotel loading zones but on the books, I, don't think there's such a thing as residential loading zones, but there have to be a new regulations set up for that correctly. If I'm wrong so I think right now, there is a piloting that we're doing for residential loading zones. Let me find out there's no more information that I could provide this committee, because I think I recall hearing something about it. I think we're pilot highlighting that I mean it's to allow vehicles, passenger cars to be able to drop off and pick up right, yeah, something like that right, like a taxi zone, but it's for residents only or non-commercial vehicles, non-taxis that kind of thing I, don't know how you would word it on the sign. But do you know where the pilot program is I will have to get back to you? Okay, thank you. Great thanks. Mark and I see data I'll go to you. Next I was just also gonna, say it's seven, so we'll try to wrap up this conversation in the next five minutes. There's clearly more to talk about and I can start taking a stab at organizing this, but oh, like that, that'd go first. Actually floor is yours data. If you can unmute yourself, can you hear me we can yes, okay, so the pilot program isn't that Jennifer was speaking about is in several different neighborhoods in Brooklyn I. Think it's been going on a couple years already. That's the residential loading unloading. Second of all, also to what Britney said. I think it would be very good what I do support open streets, but it would be good if there is signage. You know before you hit that open area. Maybe two three five blocks back warning that it's coming, so somebody could choose to make a turn and go a different route. Yeah. The third thing, I want to say, is I think in general. We want to have priorities that allow people to get to the curb when they need to. You know whether that's the you know, residents who need to do some loading unloading, whether that's a commercial vehicle, whether that's a delivery vehicle like we need people to be able to have curbside spot when they need it and to say that whatever parking regulations are going to support. That are what would be good, whether that's you know, metering, the street, so there's turnover or creating more loading zones and enforcing them. You know and I agree with what others have said about looking at the times and so that the times that we, you know that meters are in effect and the times that a loading zone are in effect, makes sense. I mean there are some streets where, when the businesses are open and metering, it till 10 pm makes sense, you know, but it I just think in general. My support would just be, for whatever helps keep the curb available for those who need it. Thank you, yeah thank you Dada, so I am going. It looks like I think we've gotten almost everybody with their hands up so I think we're gonna close the discussion. Now it's clearly not over, and thanks for bearing with us I know this is it's difficult to have these like open, very open-ended conversations, but I think what's going to come out of this is let me digest some of these and see if any of these fit into buckets and we'll have we'll continue. This conversation into our next committee meeting I also think some of these topics that we've taken up are going to end up turning into standalone items on future committee agendas, but I actually don't want to speak too much. I'll turn it over to Betty actually to see. If you have any closing comments on this topic, no actually I agree with you. In fact, I can think of some upcoming agenda items. Future talks that are going to specifically touch on many of these things. The idea of the priorities and I'm kind of glad to hear a little bit more gelling around certain things being important to a wide swath of the committee members and public that are speaking because that's kind of what I had the point of doing this was to get a sense of the priorities of the community rather than hearing one or two people, yell really loudly at a particular item that comes up. The broader picture would be nice to know about the district, great yeah thanks buddy, so yeah. So with that I'll turn things back to you, Betty to carry on the meeting and I will switch back to the agenda and I'll also just note that I'll send around. So you guys should have the link in the chat, but I'm happy to send around the that Google Doc to anyone who needs it and feel free to go in there and add any thoughts that aren't captured, weren't captured in the discussion we just had. Okay. Thank you, then, we'll go on to go to the I'm going to talk about Revel, electric mopeds sharing in Cd1. Again this is a continuation from last month. Let me go to the next because we're moving into a resolution after having already discussed this I want to remind those who may not have been here or thanksgiving kind of distracted them a bit with some of the things that were pointed out last month and Carol attends is here who can answer questions from Revel as well, for people who have questions, but it is an app-based, scooter-sharing rental service and again the scooters are mopeds. They cost a dollar per person to unlock and then 35 cents a minute, so it's relatively low cost, but I also wanted to remind people in case it didn't come up. Those went any kind of low income they're in NYCHA they're in any federal, local or other program that has to do with low income qualify for a 40 discount when they register with the app military members veterans, retirees all get a 20 discount. So there it is low cost for many people for different reasons. They are zero emissions, so they do meet the New York Climate leadership mandate, where we're going to have to reduce emissions in New York state. Within this decade the New York State Department of Motor vehicles classifies those scooters as class b limited use motorcycles. They do not need motorcycle licenses or mopeds. They do need a license plate. They can not be capable of going faster than 30 miles per hour. That's what defines a moped. The driver must have a driver's license, but again not a motorcycle license and they must wear a helmet. They did after a couple of deaths, closed themselves down and then worked with the DOT to come back in December 27th of this year, where they approved the DOT approved a relaunch program with that they put in training videos again via their app. They have a safety test and they have to have photographic evidence of the use of wearing the helmet helmets are provided by Revel, so they come with the scooter. The riders don't have to provide their own. There are two helmets available for each scooter, so there can be one passenger. The rebel shuts down its scooters from midnight to 5 am another concession they made to the DOT, because that's what they considered the riskiest for riders. It was just hours and the safety report that Revel has says their average speed is 12.3 miles per hour. Some of you might laugh and say: when does traffic move faster than that anyway, but nevertheless, once you know that most of the time they're not going their maximum 30 mile per hour, speed go to the next thanks. There were some questions that were raised, and so it was my mission this month and the reason we put it off a month was over these particular questions. Since the maximum speed is only 30 miles per hour and they are forbidden on highways, major bridges and tunnels can that's New York State Dmv rules can mopeds, be operated on West Street in our district and in district 2, because of course they would that's how they would get into our district if the census on mopeds are used to track their locations to determine. If they are breaking rules, then how sensitive are those sensors at tracking locations? Another question, since we have received complaints about the use on bike paths and in parks other places where they're not allowed. How can people complain about illegal or undesired operation of these mopeds and what regulations or laws exist for mopeds and moped sharing in New York City? So now you know what I've been doing for the last month was getting answers to these questions, and next give you some of the answers that I have gotten both from Revel, as well as from the D.O.T under current New York City D.O.T regulations, rebel, mopeds. In fact, all mopeds can legally operate on the 9a corridor, including West Street, from battery place to West 54th street. As with other legal roads, they must be operated in the right lane, except when they're making a left turn. So now you know the D.O.T rules about that. The GPS receivers on the scooters use data from over 30 navigational satellites to figure out locations. That's the! However, these signals are somewhat obscured in dense urban areas such as ours, so revel's location data can not differentiate a street from an adjacent sidewalk or bike path. Next, Revel encourages complaints or reports about behaviors being made via both their app. You can do it easily and you can put it on your phone or anywhere else the app, even if you're, not a user. If you want to use it simply for making reports, you can also use their email or calling them, but because of the concern that we heard last month about 311 really being the mechanism for how people make complaints about things and how the city government tracks complaints for things. So they are working with Councilmember Chin's office to develop a way to use 311 to report problems that Revel can act on next. I think there are a few more comments. Answering those questions. The dot's interim agreement with Revel gives D.O.T access to anonymized Revel data that is being used to closely monitor Revel's operations, so they are learning about the speeds they're going the locations they're going if there are any incidents, accidents or other things with the bicycles with this with the motor with the bow heads that is being followed in real time. Moped use is legal in New York state, so we are not discussing if mopeds should be allowed. We are really talking about Moped share service, which gets us to the next one. New York City Council is currently working on law 6773, which would be oversight of shared mopeds and e-scooters. Again, e-scooters are sidelight but they're, not in Manhattan anyway, and a lot 2061, a local law which would amend the administrative code of the city of New York, which would grant DOT approval for shared moped organizations. Without that, actually nobody controls, saying a new organization could come in any time they want. So those two laws will both be important for New York City. Neither has passed at this point they're too early on. However, although law 2061 has not yet passed, the DOT is creating a permit system to formally regulate shared moped systems, so they're, anticipating those like Revel in New, York City. The rule-making process is expected to begin this year. They don't expect it to be completed until sometime next year, perhaps even as late as the end of the year next year is very eventful, because we have a lot of changes in city offices. So I'm sure that is one of the issues going on here as well, and next I think there's the okay I want to move back. One I want to hear what people have to say and then we'll come to this and mark is your hand still up here. Then you have a question comment: yeah I had it still up, but I do have a question. I'll take it down now the it wasn't necessarily related to what you were saying, but there is a representative here from there. Okay, so I've noticed in the neighborhood that the bikes, the mopeds, are being parked incorrectly they're supposed to pump a motorcycle or a moped back into the curb, so the tire, the back of the tires touching the curb or you know close to it, but they're parking it the opposite direction, parallel as if you were parking a car and it's taking up spaces car spaces. Is that? How is that something? You can address to help us with that, particularly since we have so little parking, as you heard in the previous conversation, first I want to say thank you so much for inviting me. That's a I totally hear your concern on that on parking. I know like space is very limited right now, especially with all the outdoor dining going on. So if you were to see a rebel parked incorrectly, you can just submit a report through our community app on the website. Call you could call our team email us, but also we do have full-time employees that are going around they're constantly swapping batteries disinfecting the mopeds and if they see a parking job that it's just incorrect illegal, they will actually physically move the moped as well. Okay, and just to follow up, can you send that information to our board office? The contact information you mentioned and just to follow up with regards to the bikes, the mopeds being picked up or repaired? Or whatever? Are you still not doing that between the hours I think was like 11 between 11 pm and 7? Am that's still not happening in downtown? You work that out correct. We worked that out, so we flagged it for operations team, and so we apologized for that one time you said you were gonna fix that last month or the month before and I just wanted to follow up, and thank you appreciate it great and Tammy Welcome. Thank you so much for coming. We really appreciate Revel being willing to engage dynamically. The I also sit on the Hudson River Park Trust, Advisory Council, and the topic of rebel scooters has become a large conversation there as well, as I'm sure you know in individual boards. One of the concerns that I have I understand that you may not be able to see sidewalks, but the trust goes from. That has a long area that needs to be protected and covered along the bike path, as well as within the piers themselves, and that extends down to the esplanade in Battery park city all through the local park areas, Wagner park the battery and then coming around the other side onto the bike path and over by pier 17 in the East River. My concern in question is I. Understand that your GPS location may not tell you a sidewalk in the middle of the density of fidei, but is there a way that you can augment or work with the city to find an augmentation just like they do cell phone boosters to be able to ensure that they are the rebel scooters are not written on the bike path and within our parks themselves. Thank you, Tammy. Any I think what I want to just point out. First, is any green space, so I'm not totally familiar with the area you're mentioning now so I would love for us to follow up after this conversation. But if it's a green space anywhere in the city, that's already part of the no right zone that we have. So anybody riding in that area would be suspended from the platform, but definitely I, think we're always open to working with the city and improving the technology that we have to make sure that there's no illegal writing going on. So any questions from Ut or anybody else that has the technology to maybe help us augment the capabilities of our GPS I. Think that we're always open to having that conversation and exploring that technology. So I'd love for you to have a conversation with both the downtown alliance, as well as the Hudson River park. Trust, because anything that you can do to work I, don't know if the Wi-Fi services that they have can be helpful. But the other question is whether there is a way to install something that would alert riders in those zones that they are they need to leave. I mean I have personally seen them. You and I have spoken about this. I've seen them. You know right driving around Castle Clinton in battery park proper, as well as on the esplanade along the edges of the water and over by a pier 25 or six. So those are that's one set of concerns that I have I'm delighted to know that you're working with 311. That is really helpful, because I think it is unfair to put the public, who may not be a rider but who sees any type of infraction. They know to call 311, because that is the main way that you would get. Information in I will say that currently, as Betty is well aware- and you are if you report to 311 a rebel scooter, blocking something as major as a fire hydrant, it goes nowhere and the case is closed on 311 within moments and while one might say that was an unusual thing that I was lucky to have and stance upon it was one of three. So if I've gotten the same response three times, you know where I'm going on that. So do you have any updates on maybe how long it would take to get 311 integration. I don't have any updates right now. It's something that we're working with the council member on and we're exploring right now, I, don't, unfortunately, tonight I don't have a further update. Okay, thank you very much great and if there are no other hands up discussion, I'd like to go on to the because we'd like to move on to the resolution. These are things I'm only suggesting. As a point of conversation, they can all be changed. Nothing's been voted on. I want people to know the direction. So when we do move to vote after discussion, people are well informed before they vote the first one supporting Mo, Revel Moped's, share operation in New, York, City and I. Hope you see the value of it and say yes, they're being very responsible. Let's support their continuation, two to urge New, York City Council to pass legislation that will regulate the use of moped share organizations, as I said, that's already being discussed and worked on. This would be merely to make sure they keep moving on that and perhaps pass it urge the New York City Department of transportation to develop the regulations for moped share, which again they have acknowledged and the law would mandate them to do, but as our input would be, to provide clear guidance and signage for where mopeds can not be driven, which kind of mirrors what Tammy has just said and what really inspired me to think about. It, too, was if you look at West Street as you head south and I, don't know how many people would be crazy enough on a moped to do that. But the two right lanes go straight into the go down into the ground and go to places they shouldn't be going. Are there warnings, and so is there the signage to tell them? Wait you're approaching a place where you can't go and we don't need you crossing two lanes of high moving traffic at the very last. Second, when you find out so signage, be worked on also to make it safe for everybody to enforce where they can't go. Four encourage the New, York City and New York state dots to work together to calm traffic on West Street, again from battery place to West 45th street in order to protect the moped users from the larger heavier vehicles that frequently exceed 30 miles per hour. Why? Because 41 miles per hour is the minimum to be considered going is feeding even if there was enforcement, which is quite a bit faster than the 30 mile per hour maximum that a moped can go. The fifth is to encourage council member Chin again to work with Revel on this 311 process. So are there any comments, discussion about the revolution itself, which are these statements and I'm seeing no hands? If so, I'd like to move to vote? Oh sorry and Betty before you go there, Cora just texted me because she was over in the other way, yeah but her hand wasn't up. Yes, please: okay, who's, the staff member from the council member Chin's office that they're working with Carol are you available because I don't know the answer to that? Neither does Cora okay well, we'll find out. Ah Gary. Thank you. Buddy I was just gonna, suggest, I used to ride a moped in San, Francisco and so I have an experience with this, and one of the things that's really helpful is to tell moped or scooter drivers where they're supposed to be like a lot of this language is what not to do, but hopefully there's going to be some education campaign that informs moped riders or the rebel rider how to ride safely. You know that they should be in the right hand, lane that anyway, that the resolution doesn't have like a an education campaign component. It just seems it'd be nice to have an education campaign, so it's just a I, wasn't even going to raise my hand and then I thought well, I. You know I've been involved in a scooter accident and it was partly because there just wasn't good signage. There weren't clear rules of the road and as we are New Yorkers we're learning how to negotiate between these different forms of transportation. Right when it was just taxis and pedestrians, you figured out how to manage that relationship. Then we added bikes and then we've got a new wrinkle to the relationship. Right and now you add, scooters, it's just we're getting kind of wrinkly. If you will so having something that encourages an active campaign for proper usage would be helpful. Sorry well, yeah I have two responses to that. One. I'm gonna like ask Carol to speak if she's still on, because I see that she's on, but also thank you, I will look at the number. Three of these results for the signage and guidance would be to warn mopeds because yeah the big thing is them knowing before they end up where they can't make a move out of a lane such as when they're going down. So no I will work on that wording. To reflect your comment, thank you, Betty Eddie. Would you accept a friendly amendment that supports what she just said about urging New York City more than legislation or developing regulations, but to work on a public relations marketing campaign of education surrounding this education public, because a public education? So people understand what mopeds are well they're supposed to be written or, oh sorry, I'm not unmuted, but to that they're supposed to be written in the right hand, lane, for example, you know people who are new to mopeds may not know whether they follow vehicular rules or they follow bike share rules. You know, because I want Carol to speak because they have this education on their app and let's hear from her what and then I received a follow-up text from Cora she checked with her colleagues. They don't seem to be aware either. So it would be really good to have Carol identify who she's working with yeah is she does she need to be unmuted I see her on I. Just oh sorry, I was unable to unmute myself. We so I appreciate. We were introduced to council members, chin staff and we have not followed up yet, but we are in the process of working out internally. What the process to connect with 311 would be on our end. So that's something that's in the work for us, which is why I said I didn't have any further updates tonight in terms of education. We are running paid media campaigns on user education. We just developed a series of winter writing tips. We have a new how-to video that is coming out in the next couple of days. That will be up available in the app as well as on our website and YouTube, very in detail detailing how to ride the ravel, how to park properly how to actually engage with throttle, how to make a turn. So all of that information is available on our social channels on our website and we're also continuing to follow up via email with our writers as well and I. Think I heard something about signage. I was trying to frantically try and unmute myself, so I might have missed part of the conversation, but definitely we think that's absolutely right a lot of the times. It's not that people don't want to follow the rules just so they don't know what the rules are, which is why we try really hard through our onboarding process, to really to folks what the rules of the road are, how to ride safely and properly. So there is a 42 question safety training that everyone has to go through that have to watch the video which is about four minutes long and how to actually operate the moped. We're constantly sending reminders to our users via app email on our social channels, on just writing, tips writing safely and following the law. Great, thank you and do you have any comments to make about general public education about mopeds versus just your riders themselves? No comments, I think it does a great job at with writer education and we're working with DOT on ways that we could also improve our communications to writers. So that's something that we're working on with them great yeah and so I think it's gonna be just the general issue of riders drivers of other vehicles, understanding the limitations and necessities of mopeds, because it's a very different kind of vehicle on the road and Mark Ben Mimi. Just a procedural thing. I brought this point up a few times and at some point supposed to be put on the executive committee agenda, but the idea of a resolution being presented to us written where we really should be constructing these things organically at the Committee and Tammy no offense. But you fell into the trap. This is not even a voted arm resolution and you ask to make a friendly amendment to something that doesn't exist. So this is the issue that maybe members of the committee may be constricted. I take my wording back as being a friendly edition, but this is not pre-scripted. This was note that he was very clear. Listen to what she said, I understand, but that that's the problem when these things appear as resolution, we really should be producing them through a comment. Let me say that I completely disagree with you. The way of Robert's rules is the exact wording needs to be made visible and well known to those voting. So while these can be changed and some cases need to be changed and Lucian has been very good at making changes, you can certainly change to this screen to one where he's more dynamically typing. The changes in you are not representing the true Roberts rules, so please don't present them as facts as chair I am telling you we will take this up in a dialogue. Thank you. I have no troubles with that, but this is not a place to argue about Robert's rules we're trying to work on this resolution. The committee chair Mark, to quote our new Vp, I'm speaking all right, just relax, I get what you're saying. There's different interpretations of the rules. Lucian and I will have an ask out. We have an understanding if you want to have a conference call on it with Lucian. I'm happy to do it, but I really don't want to do that here in the middle of trying to work through Revel has come to us twice. We have Cora's team on fine I'll, be happy to send a ruling out by email, because this is the way forward and comedian at the full. Stop. I'm gonna ask you to be muted. If you don't continue, if it's about rebel, let's talk about this and Revel. If it's not stop stay on task, Betty, yes, Councilmember Chin's office does not have an active dialogue ongoing with rebel. Please I think number five needs to be reversed around, because Richard's office says no one from their team is working with them, so that needs to be reworked to be quite strongly worded. In my opinion, again just the wording you want. Okay, one CB1 strongly urges Revel to work with council member Chin and whatever the agency that handles 311 to develop a way for citizens to report problems related to the operations of rebel mopeds and for information to go directly to Revel for solution and follow-up. So they can be tracked. So it's too small for me to say: I, listen to you typing right now, sorry that was me: I moved just after Tammy finished speaking, so I missed most of that, but I can catch that Tammy in the recording and add that in here. Well, actually, no, if you can type this document, yes, it strongly encourages Revel whoops right. Where are we? This is the department of city-wide administrative services does 311. Thank you. If you want to put Revel and she's saying it's d cast but or just say, 311 I'll, it should be 311. Oh I'll work out I'll reach out to the department that do it rit, typically I interface with them for 311 and I'll, make that I'll optimize it for after I hear from them. Perfect I mean really it's council member will support the effort, but we're urging the agency and rebel to get it together. Yeah no I agree. Thank you for the wording for the change, not a problem. That's why we need to make a change again to number three as well in response to what Kerry's comment was, and that was we're. Gonna have to provide advanced warning signage where mopeds can not drive because again, if you're going to a busy place- and you find out something it's too late for you to turn you're kind of stuck, so it needs to be signage. So they're advised well to warn actually to warn them that it's a location where they can't mopeds are not allowed. So maybe Warren is the word warned to provide advanced warning. So, instead of clear guidance, it could be advanced warning gotcha. Does that look good? Or did you want to add warning somewhere else? No, that cause I just don't want them so late that they really can't do anything about it, because I don't want them scared and turning into traffic that's moving faster than they are I know. This is a bit smaller than the slides, but let me know if anyone I could try to increase the this year. I saw that Harry, Perry and Tammy Sorry, Harry and Tammy. Are those changes? Okay with you with your respective comments? Is there a muting problem and then I'll get to you Mimi? Thank you yeah. My mine was really about the larger public education program for non-writers. So it's I, don't think it's a something that you know. I was suggesting that Revel, it sounds like rebel. Has a good, app and education campaign within their app I. Think it's really more a question about how our streetscapes are going to be shared by multiple types of vehicles. So it's really a DOT education campaign to let the public know about you know how vehicular traffic, moped, traffic, bicycle traffic and pedestrians are going to navigate all of that shared space. It's a little different, but I appreciate you allowing me to have the input great and for you, Michael, I, guess the comment there would be: will you have and to provide it should be and signage to provide advanced warning, so I want something. Physical in real time that you can see before it's too late and Mimi hi I like to preface everything with I'm a licensed motorcyclist. I've ridden a motorcycle in the city for over two years now, and it's horrifying. It's a really great thing to do, but the overall concept to me that you can have a normal license with no extra training and get on these is a little novel and it seems like perhaps in that regular driving course. We could attempt to persuade the city or you know, whoever it is that manages those tests for New York state to consider, including more direction for drivers with cars that drive with rebels on the street. Not just rebels like people can start buying their own electric scooters and put them on the road right like this, isn't just like people want to rent these people want to buy these and have them for their own personal use, so it just seems like if there's any way we could suggest you know preparing drivers of cars to you, know better, keep an eye out and how to like manage being around these mopeds. On these. You know 25 mile hour. Roads could be useful and I, don't know that this is the right forum for it, but if there was a way that we could require people that move in from out of state to take some ex, you know because I just transferred my license over from Colorado to New York, and then I got my motorcycle license in New York, so I received motorcycle training in New York, but I didn't receive any. You know extra training to know how to deal with all the different kinds of vehicles that are on our streets, especially in the city, and it seems that you know what educating just regular drivers with a you know without motorcycle endorsement how to deal with everybody else. That's on the street could be really useful. It is dangerous out there. Yes, actually that was a brilliant idea and one you are correct. This is the last way. This is not the forum to do it, because this is specifically about Revel. Only but I think it'll be a great idea to look at a resolution to the state Dmv about driving putting into their testing system questions about driving among Microtransport mopeds, because I agree, that is a whole new dimension to who's on the road. Does that work for you, Mimi yeah, Awesome, glad to hear it great well and look at that forward and I. Will you have any great suggestions of things? Let me know in advance and I'll consider them for, whereas and it'll probably reflect a little. Maybe who might be a good speaker to bring in to talk about it too sure that sounds great. So thank you. Any other comment about the actual, therefore, be it resolved statements, because that's what we're going to vote on for the resolution and, of course they can be changed in full board, but I want to get it checked here, because it's the one place where we can make changes without motion so and great. If I see nothing coming up, then let's someone wants to make a motion that we end discussion and move into a vote. Michael you willing to move yes, oh yes, you've got my motion yeah, it's called a question. You get a second I can second, but you forgot my point about a marketing campaign, specifically for a public marketing campaign. Give me the wording that you want for a an additional, therefore, be it resolved I'll, let Michael type. Yes. Thank you. Cb1 urges New, York, City Department of transportation to develop a robust public marketing campaign to explain the rules and regulations and usage of moped share. Cheryl I, don't know what sharing is or shared usage and street rules. Actually it would just be mopeds, because moped share would be how Revel runs their organization, but it wouldn't really affect riders on their mopeds. Sounds good. I'm gonna get I'm saying, I'm gonna guess if I got a private moped, you would want me educated as much as somebody riding a ruffle. Correct and I would pay to see you on a moped. Yes Betty, yes, so would I. Thank you very much. Thanks Tammy for cleaning that up and thank you Lucian, and with that, I'm second for calling the question right. Then why don't we assume? It's a yes and I'm going to ask people just individually last name and those that are against voting no again on eat yourself and speak it orally. Last name and vote, I'm going to assume what about abstentions, amorous, abstain rate, anyone else for abstain and I can't for the life of me. Think of what is the other comment that you can make besides? No for cues. Thank you! Any recusals great an emotion passes and then the resolution passes and we can move on to the next topic excessive ride. This was a discussion again following up from last month to close it up more information that I've been able to retrieve. If you go to the I'll, tell you what I learned there were answers from last month, excessive we had spoken about only narrowing it down to excessive ride for same-day travel, because so much is in flux with the MTA. So at this time only same day, travel given that excessive ride, I learned does allow users to call 24 7 to get authorization to use a taxi and get reimbursed. So again, the whole bit of scheduling a standard ride on an accessorized system has to be at least 24 hours in advance. They stopped taking reservations at 5 pm for the next day, but in fact the phone system is active, 24 7,365 days a year and at any time a user can get an authorization to get reimbursed and starting I can't say this month anymore, starting November. You can be do this online, it used to be you had to collect your receipts and mail it in and anyway, it is still four to six weeks they guarantee for reimbursement, because this whole system is new. They just started the online, but anyway there is a mechanism, it's not great for the poorest of the poor, because you do have to pay out your taxi fare and get reimbursed. People I spoke to who are lower income said when it's an emergency and they use it, not a big problem because they budget for that and take the refund counting on the next trip when they may need to do that, so the MTA has announced but has not implemented changes yet to the Accessoride program. One of them that has been announced is they have renegotiated, they will no longer be using their own vans, such as you saw on the last slide, which you'll, probably horrified to learn subsidy for those rides was about. 80 is what the MTA told me: we're 80 per ride per person, yes per ride, so yes per person, and so in an attempt to save money. They have negotiated with private vendors with their own vehicles to do really the same service, just different drivers with different vehicles and the negotiated rate is 31 to 32 dollar subsidy per ride. I know that, but again those dates aren't quite known with when that's kicking in, but that is the more finalized part. Otherwise everything else is going to remain unchanged other than those vendors and, as I was told, everything is in flux. Even the pilot program that I told you about where people who can use the taxi service, they did propose changes what they told me with limitations. What I was told last week was that those have not been implemented yet they expect them to be implemented, but they think all the rules will change from what they've said in the past, because the MTA troubles keep getting deeper and deeper. So my recommendation is actually that we do nothing at this particular time about a resolution related to accessoried. So I'm going to open that to discussion and Tammy is your hand up about accessoried you're, muted, apologies, nope, I'm taking it down. I will wait to the end right, so I don't see any other hands, I'm going to guess nobody has anything. They want to particularly say on the topic of accessories. Then I, I'm going to assume that you agree with me that at this time we're going to leave that alone and not address a resolution for accessory. So we'll move on to the next item, which is a local law that I again I directed you to something you could read a report that was made about it. I thought kind of enjoy this one which addresses hazardous obstructions. It is a local law, and this wording that you see below is actually from the law itself, so as otherwise permitted by law. No one shall park, stop or stand a vehicle within a radius of 1320 feet of a school building entrance or exit to block a bicycle lane, a bus lane when bus lane restrictions are in effect the sidewalk, the crosswalk or a fire hydrant, be as an alternative to other means of enforcement. So, as all of us have gotten really tired of placard and other abuse with no police enforcement, they have said that it's going to go directly to the office of administrative trials and hearings for a hundred and seventy five dollar versus the old hundred and fifteen dollar. Fine. So there's a sixty dollar increase in the penalty. Go to the next one, see more of the law right, the civilian. This is part of my favorite part. Any natural person, excluding personnel of the department, is the D.O.T because they are the ones who are going to handle the portal that allow the citizens to report these various transgressions into. So no one from the D.O.T or any other employee of a city authorized to do a summons for the violations are allowed to be acting as a citizen who makes these complaints and collects the money, but if so, they'll file a form prescribed by the commissioner, which would be of the DOT, the department or DOT shall publish on its website information for how to file these civilian complaints. The department shall provide a tracking number to anyone who files a complaint within three days, so they can track it. It's very much like the idling law. That's out there, that's what they followed, so you can follow it as it moves into the court system and what happens and if you're, going to get your money because, as the last one talks about any complaints submitted, the office of administrative trials and hearings shall award the complainant. 25 of the sum that's collected, keep in mind that is dollar fine. You would get 25 percent of that amount when they collect it. Keeping in mind that sometimes there, oh, this will allow them to track also how many times the judges throw it out, because someone comes forward with a placard and says no I can do this, so it'll be an interesting tracking system. If nothing else will this whole process be and one other if you go to the I, want you to get a visual because Lucian worked this out for me he took our district. He ran where all the schools are, which are the red dots. The shaded areas which you'll see are only northwest extreme northwest of Tribeca right by where a little bit of Brookfield buildings actually are and also gateway inside around their immediate buildings. The only places in sea in our community district that are not covered by this law, so it is most all places so fine eye and Seaport. You know they're all good to go. What do you want to bet all the placards just end up in that little triangle in northwest Tribeca? That is my fear, but yes, we're paying money to judges, but Tammy Betty I will say. The flaw in this map that I want everyone to know is that it's being calculated from the center point of the school, which is where I assume New York City established the coordinates of the DOT, that this is from the official data set and the law says it's measured from the school entrance or exit. So while you know that could mean that we actually have more coverage of the law just depending on how many entrances and exits the school has, and this is actually from the center of the actual building. So you know it could create some more opportunity, but this is just illustrative. Here's a fun question for you with the cutting of summer youth programs and not having enough jobs to go around. Do you have to be 18 to participate? That was not in the definition of a citizen. There was no age limitation, yeah, just natural. You just can't be according to what we'd have to look to see what the natural person definition is under city law, but you just can't be someone who otherwise has enforcement duties from my read of the right or D.O.T right, I'm seeing a lot of jobs for people walking forth to schools. Well, I know what I'm doing on my lunch break is all I'm saying. Well, I was going to say by the end of this. We may not have any homeless at all, because everyone will have the money to live where they want. Yes, now it is an interesting law and data I see your hands up. Yeah I had just the question, so this would mean like even the back in parking, that's half on the sidewalks around police, precincts or fire houses. If that's within the distance of a school that could be reported. No, if you go back right now- and that's thank you that take me to the next point- it is bus lanes, it is bike lanes, it is fire hydrants and oh always, sidewalks too. So yes, it would include those sidewalks, and what has been reported is that it includes city owned vehicles as well as placards. It is not specifically just placards, it is anybody and in fact they highlighted that even the NYPD zone vehicles aren't excluded by this law as counting so for those of you who are really irked about the city agencies, if they do the wrong thing, their fair game as well, all those vehicles yeah. So if you're gonna do this at police precinct just bring the Aclu with you well, and that is some of the concern- is that you may want to travel with some people when you are it's not known. Yet what they're going to require that you turn in one would assume this is simpler than a three-minute film which you need to do for the idling. This would be more in the moment. I would think so it will be interesting, and if you go on to that another question, just yeah, please do is like. If it's a painted pedestrian island, you know surrounded with the delineators. Does that count as a sidewalk I don't know? Is you see who's here, Jennifer Leung's, not here anymore, and why is Brittany in as an attendee? She I think she he's just saying she had the right thing every once in a while to go back and make her a panelist. Okay. Thank you. Yeah, sorry by my read, it doesn't appear that you're, not a center island if it doesn't serve some sidewalk purpose, would count it in that yeah I. Would that would be interesting if you go to the last one, because I have a couple of points that I would like to have added and that's why I give some suggested results and it's mostly because well two reasons. One I needed some technical looking eyes looking at this, because we're dealing with am I using the right direction, such as, where I am in the city codes and things to work out the actual wording of these resolutions, but also because I want to make clear that two things that I'd like to see changed and get feedback from people I would like City Council to amend that law, to add no standing zones, loading zones and blocking sidewalk ramps or curb cuts as reportable locations where parking creates hazardous obstruction that endangers safety. Those are their words in the law that I took the creating hazardous obstruction that endangers safety and so I looked to put together. Whereas was it possible to do that and I think that's pretty straightforward and I heard that come up in Michael's discussion. Many people complaining about when cars park in standing zones, such as in front of buildings when I know, river terrace here was marked out to be no standing, was so that emergency vehicles, especially hook and ladder fire trucks, had an adequate turning radius to be able to get into the street. So there are reasons why they became no standing that relate to a safety issue other places they force double parking when you have people in them, because they're not meant to be filled so I think it could be defended as being in the same spirit as the law. Hence asking those things to be considered, and that would be great relief to us as a district to add those which illusion and I came up with. Where else would we want them to be, that might work with the law and also to do that- and this is a technical part that I needed Lucian to look at that the department of transportation would have to amend the placard parking regulations I give where it is so that it's not permissible to park with a placard in truck loading or unloading zones, because that's legal to them or to block any portion of a sidewalk ramp with a placard, because right now those are things that the DOT does allow in their regulations. So I want to change those as well. So I'm going to ask Tammy, comment, question and then Mariama, but Timmy admitted start trying to make dinner and listen at the same time with kids as if I apologize. My question is: what is I? I'm a hundred percent up to support this, but I have a question: what, by adding those standing zones right zones, I have no issues with curb cuts. You know that that's annoying as I'll get out. Is there a reason that it should that it has been allowed or permissible that we're? Not thinking of, or has it just been, a blatant disregard you understand like? Is there a reason that they've allowed other than opportunity? Yeah, no I, think some of these things are kind of lawsuits waiting to happen. For instance, the fact that United's final started the lawsuit that they won for hundreds of millions of dollars to put in curb cuts. They still didn't change. Some of the regulations of the D.O.T to then turn around and say: well they didn't. This was just predated, say yeah, you can park in front of them. If you want, how can you be found guilty in a lawsuit saying you better put them in, because those are the rights under the ADA, but it's okay. If you block them and they're, not usable, it makes no sense. So I think this is another historical glitch. That's in there well, I bet if I may I think it's an astute question when kind of we're used to seeing all these vehicles when they're at home base any kind of inspector enforcement authority. That's departing from you know, DOB, central or any other kind of agency to go. You know to another borough of town. Where have you know they are I mean in a perfect world using this video, I'm sorry this vehicle to go to some place that is hopefully far from transit and I, believe that you know them allowing them to park in some of those areas. Just kind of speaks to their needing to get reasonably close, so they can proceed on foot, do what they have to do and return back. It doesn't make sense for them to do that where the car is parked most of the time and it is left and that's really the I think the issue when they're doing an inspection they're, not spending I, don't you know I, don't believe they'll be spending. You know eight hours on location at that site, they'll be going making an inspection finding they have access or not, and then returning back and then that placard. Then those same regulations are, then you know abused for an eight hour period when they go home and there's only so many inspectors overnight. So I think that there needs to be some nuance at least say well if we agree that they should be able to park in a loading zone. If they are, you know a mile away from the Sen. You know the main office borough office or something like that. But if they're within walking distance, if they're in CB1 it really shouldn't be, there should be a place for the vehicle to be parked and not where other people should ought to be using the a facility. That's been designed to do something else. All day. Long like a loading zone or a cross or a curb, cut and I think that's where the rub is that we're seeing everything at the origin, whereas these regulations or permissions are really designed for the destination, is my that's my guess well, and they were assumed for other things such as it specifically says for non-commutation purposes. Yet, as we know, many of the placard uses, especially in battery park city, are specifically for computation. They're there all day right, yeah I mean the whole idea behind placard has been obviously abused beyond our belief. The idea that you know a vehicle, if it's in the service of the greater city interest you know, is being used to get someone to a site for an important reason and then return back. You know that's the whole idea of the placard, and then it's been, of course you know abused to be essentially a way to get free parking for whatever reason and create distorted incentives of how people get downtown, but just in the pure sense, the ability to park in those areas, while I, don't believe is you know the highest and best use for those areas, at least should have more nuance of you know where they're taking their vehicle versus what they're doing with it and how they're abusing it in our district and a lot of other places in Manhattan that have the headquarters. For many of these city agencies. Are you suggesting to nuance the third resolve or second worship, whatever no I would argue sidewalk ramp, it is absolutely never acceptable and one of my main complaints is at the end of my block as I want to go across chambers Street. There's always somebody parked there who's a school teacher at Stuyvesant, high school and they've just pulled in there and I can't get across the street because that's the only place I can get on the sidewalk, yeah I. Don't think. There's ever a good reason to block a sidewalk, ramp and I think that the problem here is in the legislation that's being proposed. It says you know it makes it clear. It adds crosswalks. The problem is that DOT does not always map crosswalks to the street, correct where people are and that's yeah and I think that that's a gap but I I'm only presenting that because you know Sami's question was I, wonder why originally this existed and I just believe that maybe in a pure in a you, know very innocent way, the intent of the placard, which is how used at all effectively in a large sense, the intent was that they deliver city employee to do some function and then return and vacate that space not leave your personal automobile there and that's the abuse. So you know I, I'm not saying to nuance: it I, just I'm trying to think through. Maybe what the original intent was. Okay, thanks I want to clarify you weren't, giving me suggestions about changing the resolves, which is part of the question and then yeah just get a higher to deliver the person. You know they should take it like a taxi or an uber there and then back and I think that's a better use of city funds than having a vehicle that just sits there and does nothing for most the day yeah. It seems not to allow parents opportunity to pick up or drop off their kids by car unless I'm reading it incorrectly. Is that right, you can't be like near a school, but no you can't park. I thought I said like no stopping no whatever, and that would permit that would prohibit parents from picking up and dropping off their children. If I read it properly, yeah it says, shall park or stand if it's in a bus lane or a bicycle lane in front of a crosswalk across a crosswalk on the sidewalk in front of a fire hydrant. Now, realistically, a lot of these things momentarily no one's going to come in and enforce it. Citizens are more likely to than police, that's true, but no. They make them very specific things where you can't do it. I would recommend having trouble thinking about I'm picturing. If there's any like bike lanes right in front of a school or anything like that, I mean I. Think most people make an effort to not park. At least I would hope so to not park by yes by the ramps or in the crosswalk, but you may need to pull over quickly to let your child out or in, and then that may be in a bike lane. If there's one immediately adjacent to the school and that could be, you may need to go somewhere else on the other side of the street or on the next block Mariama what the legislation doesn't prohibit or doesn't allow people to issue. Fines is if someone just double parks in the actual travel lane. So if a person is dropping off or picking up someone and they're standing in their vehicle this, if they do so just the lane and not half the travel lane and the bike lane, it doesn't allow someone to drop the dime so to speak. I think, okay, thank you. Yeah I got clarification. Well, you know we're just changing behaviors yeah! Well, you know people will adapt. No question. That's what's good about humans. Any other comments before you know. Moving to take a vote. I will take that as a no can I get a motion to end discussion and take a vote. Yeah you've got a motion to call the question. Second I. Second, it thank you Deda that, let's get everyone again, I will assume a yes unless you vote one of the other categories, so for all those against this resolution. Thank you and also name and then your vote. If you abstain on this resolution and finally, any recusals, then it passes unanimously. Okay, I didn't know if I missed a and a pose, but okay, unanimous I got it yeah that made it simple and I think that might be the last slide, but I wanted to remind people of that's it. There's the last side, just in case people haven't seen the news, but it's kind of been all over the place. The MTA has announced they don't in their budget. They do not think congestion. Pricing will occur before 2023 again, with the change of mayor coming in 2022, things could change a bit. It was kind of interesting. It was also in city and state that when governor Cuomo spoke with President-Elect Biden about New York and what they wanted from this administration, that's coming in, they didn't. He did not mention congestion, pricing or the barrier that the federal government has created. Regarding that he spoke about other things, but not congestion pricing. So you should know what the MTA has said in their budget they're, projecting not until 2023. The governor wasn't concerned enough to mention it to president by president-Elect Biden, and so it will come up in the future, but you'll see why it's not on my immediate radar, because we don't really even have a time frame at this point. I hope that's good news to all of you and Tammy. If you'd like to speak and then Mariana I think Betty. It gives us an opportune time to really work hard with your committee in the next three years to reinvent how our streets are. Even if we have to go street by street, as you know, was said to CB2 to really make a strong effort to work on our landscape, seeing what we can change to reclaim for some greater public use, seeing what advantages we can do to make positive change before congestion pricing comes back on the docket as a solid conversation, because it is heated, it is controversial. No one wants to pay any more money for any reason if you're living downtown. So let's just try and see what we can do to make bicyclists safer to make industry opportunities more prevalent for the people who live here. You know and some more support the businesses I know the garages aren't small businesses necessarily, but you know there's lots of places for people to park into these days if you're coming to work in lower Manhattan or I agree, and thank you for being because I think that's. The importance of Michael's discussion is to try to get some of the priorities of the wider community and we need to get some outreach if it's needed, as this gets more finalized, to see that people agree with kind of where we're going for all these shared demands on our streets well and nobody's ever taught I mean whatever happened to the idea that if you worked for a company you know you could park in one central area and then walk to work from there. Whoever said that, you had to have a spot underneath the door of your building. I mean that works out really nice when you live here, 24 7, but for the eight hours a day that you go to work, perhaps that does not need to be a street parking anymore. Just saying well, yeah I think that's! You could argue that for everything, so that's going to be the juggling act of get things done so I, don't thank you. That's kind of where we're going with this and I think that the other hands have gone down. So I'm going to do yeah, I'll, just say: I wholly agree with Tammy and I. Think that my guess would be that the state realized. What many of us have been saying that doing it now is not conducive to growth. I walked down Fulton Street the other day and almost every business on the right side of the street. So the northbound side of the street was closed and we've really got to do something about encouraging people to come down here and not you know, closing ourselves off from the rest of the city. Yeah, no thanks, I, agree. I, think this needs to be a very general consensus which I'm glad to hear you know. Building our district and the areas around and we're gonna come back very strong. If we ever really went away, I don't think we did, but thank you all I'll see you yeah thanks. Everyone thanks buddy! Thank you Betty and Michael. Thank you. Everybody have a great night. Thank you thanks everyone. If you rent a rebel wear leather gloves. Thank you for being the word.",
            "summary": "It's been moved around a little bit and that we're going to start with the street use priorities because Jennifer Leung is here from the D.O.T in case we have any questions.\nWhat, eight or nine months in New York City, in which we've seen many unprecedented changes in our the use of our streets from restaurants, to open streets, for you, know, exercise and commerce and DOT is taking those all of these programs that were enacted very quickly and without a lot of community board, Input and they'll be working on finalizing that.\nWhat our input is, what our priorities are, What our guiding principles would be so that we can get ahead of some of the discussions that are going to happen as DOT is working to finalize these programs and provide them with input ahead of time as to hey.\nThere wasn't too many edits after following our committee meeting last month, but so I wanted to give everyone an opportunity also to see if anyone has any additional thoughts once we do that, then I was thinking that we should go through and see if any of these bullet points fit into broader categories, that we could kind of group them into since I think.\nI think it was at the beginning of this year, though that seems so long ago, in which the Department of Sanitation announced that it would have a clean curbs pilot, program, Actually, I, wonder if this link shows an image, it doesn't show an image, but the idea was that they wanted to start a pilot program in which they would create or be start putting containers on the curbs for businesses and residences to use to throw their trash out instead of throwing them on the sidewalk.\nAnother thing that came up was actually prompted by the discussion that we had about Edgar Street on or trinity place at your street, in which there's the new school going in there.\nWe had started having a discussion about making sure that our a priority seemed to be coming out of that discussion was we want to make sure that they're, safe, drop off and pick up areas for school, kids, I wrote as a question as to whether or not there's demand around schools for additional play space or areas, especially given Copen 19.\nYou know supporting the expansion into two non-controversial locations, but also when the therefore be it resolves were a few points that I think feed are good examples of what we could come out of these priority discussions with one of them.\nAnother is hey: We should be putting bike lanes on streets with CitiBike docks and increasing education around CitiBike, and so some of the things that you see right away here are things prioritizing pedestrians, making sure that we are not obstructing sidewalks, making sure that we're you know supporting our local businesses and making sure that we're ensuring safety both for cyclists and pedestrians.\nI'll go through the remainder really quickly, so another one was pedestrian, curbside and drop-off locations, oh, like for hotels and residences, making sure that there's space in front of those I guess high traffic areas.\nI think we need to start working on that, and you know, speaking with D.O.T and Jennifer.\nIf we can add that language that I mentioned change, curbside parking regulations to comport with current needs of residents and businesses.\nAnd, so I think, once we finish having discussion about these points, I'd love to get everyone's take on how they kind of fit into broader buckets, and if we want to pick any of those that are going to become part of our resolution.\nI think also exploring what the current New York City law is, that forces DOT to have to give those permits for very little money.\nHearing that the these construction, the demo jobs construction jobs, are taking street space, but paying almost you know nothing compared to the value that it actually, you know, represents to the community in terms of moving people and goods and services through the district, that their pain was nothing.\nYou know when certain streets are going to be closed if at all, I think that would be helpful to not only pedestrians but also people that are driving or cycling or whatever the case may be.\nI mean there may be very good reason, but, for example, like maiden lane between water and gold I, Don't know you can't park there until like 10 o'clock.\nIn addition to you, know something like a parking meter that has to be fed that you're paying more money.\nDo, you think that like would fit in as I think you're right, It kind of fits in with what Mark and Patrick were saying and possibly even more to the point where there are some parking rules that maybe are remnants from when they maybe made sense in the past, but the neighborhoods changed, especially now with Covid-19 things have changed and it might be time to revisit.\nThink Lucian knows where I'm going, I'm gonna use the area right by Washington Market.\nThe parking hasn't changed, it's an ideal location for other usages potentially, and the parking could change and provide relief to the area in different ways, and I'm wondering there doesn't seem to be that I have seen as of yet any mechanism that I know of to be able to report that request that you know kind of figure that out.\nAnd we've seen, we've approved numerous city agencies moving around our district, renting new space, that's come before our board and they apply to DOT for street side.\nIf there's a mechanism, a form, a request, file, something that's easiest easier for people to be able to funnel that, and if our goal is to reduce usage of cars and getting cars off the streets for a variety of reasons, then what can we do about agency parking to get them to use any number of the garages that we have that are not sold out in full and get them off the streets to really see what that does for our community, even if it was turned into metered parking, which would then make money for the city and allow people to travel.\nAnd I think this is turning into something that actually might end up being a good topic for like a future meeting.\nDo, some research for us, because it does seem like we do-- need to have a conversation about the current street parking regulations and.\nFor example like there's streets that have what parking for like I, don't know, DOT or parking for different agencies, federal and state or sorry.\nI personally feel somewhat slated by it, because it does feel like our neighborhood is being treated as a municipal parking lot when it's our streets, you know and that's public space, and we deserve to be part of a conversation as to how that space is being allocated.\nHave you know a lot of these were quality of life issues and right before the transportation committee, and.\nSo you know, parking I, Think Patrick brought this one.\nWe have somebody in fact, next month, there's going to be a group coming forward about the signage in front of their building and the ability to drop and pick off people, something that Pat Moore just spoke.\nIt will be done, be very helpful for me, as chair of the committee, to have the idea of the community's priorities, because I have a bunch of individuals saying this is a good signage change, because I want this in front of my place.\nLook into it and, of course, There was agency parking on the block, one building in particular, I'm thinking about, and they never got back.\nYou know disgusting in any case, I wanted to pick you back up for quickly on what Tammy was saying as well as kind of touching on what Britney suggested.\nYou know when you have like a new turning signal or something all of a sudden on the street.\nYou, know, or residents are they're used to parking on a particular street.\nAnd I'm sure there were people from the neighborhood that were used to that being, You know free parking on Sunday and all of a sudden it wasn't so notification would be fair in those instances too.\nThese are private businesses that are taking public space and again glad to see them get the help that they need but wondering if we should or how people think about advocating for should the community have some similar, opportunity.\nShould residential buildings be able to have the opportunity to say hey in front of our in front of our building like we want to participate in this program as well, but we have increased, need for you, know residential drop off and pick up.\nI, I'm, gonna, Actually, I, think add on to what you might have started to say, which is that you know with all of these balancing things.\nAre we serving the greater community by having a single private parking space or, by you, know, a residential loading and unloading serving a tall residential building.\nYou know you could argue that agency vehicles serve more people than a private car, like so they're.\nAnd I, really think, It's great work that you guys are doing, and maybe Jennifer has something that she wants to add about how DOT is prioritizing these different uses.\nBased on what they've been working on throughout the city, I mean when you guys were mentioning about how CB2 has on the agenda items to have like current changes, you're correct that they do look at it based on someone that came to them with what they thought.\nThey have people that they've been working with who've been speaking to, and they would like this to be changed, so they would put that in as a resolution have it on the agenda.\nAnd sometimes, If I get in advance, I might actually ask my engineers to take a look at it and see if it's something feasible and if they do think that it's feasible, they would like them to make sure you know, get a resolution and that's something that we can work on, and that applies to every you.\nYou know when, like I said when it comes to curb rates, those are easier things to change.\nWe are the constituents, because we as a community board, are looking to reduce agency parking, because we know that the agencies will not come willingly to the plate, Are we allowed to make those requests or does it have to go through the agency.\nHas too many agency parking that you want us to like shorten it or like, or I'm, trying to think of an example, What, you're.\nOkay, If we said you know, there's agency parking there seven days a week, but we would like to know if that agency parking could be either reduced, removed or changed to business, hours, Monday through Friday, seven to five or whatever, and either be metered or free afterwards, which would help facilitate parking availability for people attending target and whole foods, and the ancillary small businesses in that zone.\nThe community board asked DOT to audit the amount of agency authorized parking that was actually necessary for I, can't remember what agency it was for that particular street.\nAnd I think that's what we'd like to see all over the district, because I would say that typically each agency that comes to us, they have, We have to have them, submit us application and a survey like they have to give us the number of cars that they have, and you know, based on, where they're located there's a formula that we look at and based on that formula.\nIf you realize that, maybe that agency is no longer the same amount of vehicles that are using that space, Then we could also definitely take a look, and you know resurvey them, because what we do is that our authorized parking unit is the one who does all the coordination and they.\nI mean it's to allow vehicles, passenger cars to be able to drop off and pick up right, yeah, something like that.\nYou know whether that's the you know, residents, who need to do some loading unloading, whether that's a commercial vehicle, whether that's a delivery vehicle like we need people to be able to have curbside spot when they need it and to say that whatever parking regulations are going to support.\nI mean there are some streets where, when the businesses are open and metering, it till 10 pm makes sense, you know, but it.\nI also think some of these topics that we've taken up are going to end up turning into standalone items on future committee agendas, but I actually don't want to speak too much.\nI'm kind of glad to hear a little bit more gelling around certain things being important to a wide swath of the committee members and public that are speaking because that's kind of what I had the point of doing this was to get a sense of the priorities of the community rather than hearing one or two people, yell really loudly at a particular item that comes up.\nI want to remind those who may not have been here or thanksgiving kind of distracted them a bit with some of the things that were pointed out last month and Carol attends is here who can answer questions from Revel as well, for people who have questions, but it is an app-based, scooter-sharing rental service and again the scooters are mopeds.\nAnother question, Since we have received complaints about the use on bike paths and in parks other places where they're, not allowed, What regulations or laws exist for mopeds and moped sharing in New York City.\nNow you know what I've been doing for the last month was getting answers to these questions, and next give you some of the answers that I have gotten both from Revel, as well as from the D.O.T under current New York City D.O.T regulations, rebel, mopeds.\nYou want to use it simply for making reports, You can also use their email or calling them, but because of the concern that we heard last month about 311 really being the mechanism for how people make complaints about things and how the city government tracks complaints for things.\nNew York City Council is currently working on law 6773, which would be oversight of shared mopeds and e-scooters.\nAgain, e-scooters are sidelight but they're, not in Manhattan anyway, and a lot 2061, a local law which would amend the administrative code of the city of New York, which would grant DOT approval for shared moped, organizations.\nHowever, Although law 2061 has not yet passed, the DOT is creating a permit system to formally regulate shared moped systems, so they're, anticipating those like Revel in New, York, City.\nI know like space is very limited right now, especially with all the outdoor dining going on.\nThe I also sit on the Hudson River Park Trust, Advisory Council, and the topic of rebel scooters has become a large conversation there as well, as I'm sure you know in individual boards.\nAnybody riding in that area would be suspended from the platform, but definitely I, think we're always open to working with the city and improving the technology that we have to make sure that there's no illegal writing going on.\nSo when we do move to vote after discussion, people are well informed before they vote the first one supporting Mo, Revel Moped's, share operation in New, York, City and I.\nLet's support their continuation, two to urge New, York City Council to pass legislation that will regulate the use of moped share organizations, as I said, that's already being discussed and worked.\nThis would be merely to make sure they keep moving on that and perhaps pass it urge the New York City Department of transportation to develop the regulations for moped share, which again they have acknowledged, and the law would mandate them to do, but as our input would be, to provide clear guidance and signage for where mopeds can not be driven, which kind of mirrors what Tammy has just said and what really inspired me to think about.\nYou know that they should be in the right hand, lane that anyway, that the resolution doesn't have like a an education campaign.\nThree of these results for the signage and guidance would be to warn mopeds because yeah the big thing is them knowing before they end up where they can't make a move out of a lane such as when they're going down.\nYou accept a friendly amendment that supports what she just said about urging New York City more than legislation or developing regulations, but to work on a public relations, marketing campaign of education surrounding this education public, because a public education, Oh sorry, I'm, not unmuted, but to that they're supposed to be written in the right, hand, lane, for example, You know, people who are new to mopeds may not know whether they follow vehicular rules.\nAnd, so I think it's gonna be just the general issue of riders drivers of other vehicles, understanding, the limitations and necessities of mopeds, because it's a very different kind of vehicle on the road and Mark Ben. I brought this point up a few times and at some point supposed to be put on the executive committee agenda, but the idea of a resolution being presented to us written where we really should be constructing these things organically at the Committee and Tammy no offense.\nWe could attempt to persuade the city or you know, whoever it is that manages those tests for New York state to consider, including more direction for drivers with cars that drive with rebels on the street.\nThink it'll be a great idea to look at a resolution to the state Dmv about driving putting into their testing system questions about driving among Microtransport mopeds, because I agree, that is a whole new dimension to who's on the road.\nOther comment about the actual, therefore, be it resolved statements, because that's what we're going to vote on for the resolution and, Of course, they can be changed in full board, but I want to get it checked, here, because it's the one place where we can make changes without motion so and great.\nThe flaw in this map that I want everyone to know is that it's being calculated from the center point of the school, which is where I assume New York City established the coordinates of the DOT, that this is from the official data set and the law says it's measured from the school entrance or exit.\nOne I needed some technical looking eyes looking at this, because we're dealing with, Am I using the right direction, such as, where I am in the city codes and things to work out the actual wording of these resolutions, but also because I want to make clear that two things that I'd like to see changed and get feedback from people.\nI would like City Council to amend that law, to add no standing, zones, loading zones and blocking sidewalk ramps or curb cuts as reportable locations where parking creates hazardous obstruction that endangers safety.\nMany people complaining about when cars park in standing, zones, such as in front of buildings when I know, river terrace here was marked out to be no standing, was so that emergency vehicles, especially hook and ladder fire trucks, had an adequate turning radius to be able to get into the street.\nSorry, this vehicle to go to some place that is hopefully far from transit and I, believe that you know them allowing them to park in some of those areas.\nLong like a loading zone or a cross or a curb, cut, And. Yet, as we know, many of the placard uses, especially in battery park.\nYou know, there's lots of places for people to park into these days.\nI, Think this needs to be a very general consensus which I'm glad to hear you know."
        }
    }
}