{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UCOpFH7xTu2yvyo0LID_gGtg",
            "title": "October 27th",
            "publishDate": "2020-10-28",
            "shortDescription": "",
            "lengthSeconds": "1:31:55"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "5C4JJZxEuWU",
            "fillerWordCount": {
                "uh": 83,
                "um": 427
            },
            "readTimeFullTranscript": "51 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "absentee": 30,
                "election": 26,
                "housing": 25,
                "budget": 22,
                "funding": 22,
                "state": 21,
                "capital": 19,
                "enforcement": 19,
                "elections": 18,
                "requests": 18
            },
            "wordCountSummary": {
                "election": 9,
                "state": 9,
                "budget": 8,
                "elections": 5,
                "absentee": 5,
                "needs": 5,
                "member": 4,
                "capital": 4,
                "request": 4,
                "health": 4
            },
            "fullTranscript": "Four more: if some people do not pop on in a minute or two, we will start you one minute. Okay, my apologies to all. Let's just get started 603, I do not want to hold anyone up. My name is renee quincella, I'm the chair of the budget, education and City services. Committee of CB5, that's beck's for Sure Julie Chu is the co- chair of the committee, and I want to thank you all for attending. We have a lot going on tonight. First, we have non- action items where we're going to hear about changes to the election law that the state legislature has sort of made in the last two years and some current voting related legislative priorities. So these will become sort of action items for us later down the road tonight. We're going to hear and understand. Justin Flag is here from Senator Krueger's office, Kate Theobald from the council member Powers, Office Laurie's, here from Speaker Johnson's office and they're, going to present material to us. We're then going to turn to our three- part action item tonight, which is the passing of cb5's, most pressing needs survey. The district needs statement and the budget expense and capital budget priorities for fiscal year. 2022. just give you a brief overview of how we work. Presenters are going to be introduced and they're going to have the opportunity to present to the committee and to the public and once their presentation is concluded, the committee will be permitted to ask questions of the presenter and then, when all of that committee's questions have been answered, members of the public will be permitted to ask questions of the presenter I'd ask that you use the raise hand function if you'd like to speak and then once all questions have been addressed. The committee goes into business session and that's when only members of the Bex Committee discuss the issue amongst themselves and determine what action to take. We got a lot to go through this evening, only so much time you want to stare at the screen. So let's try to limit each of the budget discussions to about 20 minutes or so in order to hear everyone's comment and yet be able to cover the full agenda. Let's just begin with Justin Flatt great thanks yeah. So I'm just going to give a quick overview of the actions that the legislature has taken. State legislature has taken in the last two years, some of which the loop needs to be closed on and then some thoughts about what Senator Kruger Views. As you know, the high priorities for for next steps on election reform. So last year in 2019, we put in some big changes. We created early voting, which we're all experiencing now for better or worse with our, with our current board of elections, consolidated the federal and state primaries in June, which saves a lot of money and reduces the number of elections. People have to keep track of. We passed a bill to make the transfer of voter registration more streamlined for people who move within the state and created a pre- registration system for 16 and 17 year olds to pre- register to vote so that when they turn 18, they will automatically be registered to vote. There were also two bills that we passed last year, which are constitutional amendments, which means that we need to pass them again and then they'll be voted on by a referendum. So they have to be passed in two successive legislatures, so this 2019 2020 is one single legislature and then starting next year, 21 and 22 will be another one. So last year we passed two changes to voting related changes to the constitution. One is to allow for same- day voter registration so that people could register on the day that they vote and no excuse absentee voting. You know now, when you fill out your absentee your application for an absentee ballot. You have to say I'm going to be out of state or I'm disabled or I'm sick, or now you can say I'm afraid of Covid-19 or another public health emergency. We passed this constitutional change so that you can just request an absentee ballot. Many states have that already, but both of those things same day, voter registration, absentee no excuse absentee voting, require constitutional amendments. So we're going to have to pass it again either next year or the year after, and then it will go to the voters as a referendum, the November after or the general election after we pass it, and so either next year or in 2022 this year 2020, we passed a couple of thing, a few things, one very importantly, given the trouble with absentee ballots, we passed a law that requires that any deficiencies in the absentee ballot. The board- must give the voter a chance to remedy that. Most often this is, they did not sign the inner envelope. You know you have to put your absolute validity in an inner envelope. Then an outer envelope frequently those are not signed. I do not remember the numbers exactly, but something like 80,000 or 100,000 votes were disqualified in June, because of primarily that and other reasons having to do with. They did not follow the directions of the absentee ballot to the t. Sometimes it's stray marks or it's unclear what the voters intention is. Sometimes their signature does not match so now the boards have to go back to that voter and give them a chance to correct that. We passed a change so that you can vote using Covid-19 as an excuse. Get your absentee ballot. We passed a law so that the ballots that are received by the board do not have to be postmarked if they are received by election day. Previously, the wording of the law made it seem that even if they received a ballot, you know today. If it was not postmarked, it would get thrown out, obviously very problematic, so if they receive the ballot absentee ballot by election day, regardless of whether it's postmarked it counts, then seven days after election day, if they receive a ballot that is postmarked by election day, that also counts. So we've increased the potential for catching. You know valid absentee ballots. We pass a law to allow local boards to process absentee ballots prior to 30 days before the election. Previously they had to basically wait until 30 days and then start processing. I do not now off the top of my head recall. We did not expand it indefinitely, but we did expand it beyond the 30 days. I think maybe it's 60, but do not quote me on that, so it just gives a you know the boards a chance to avoid some problems of having to process all these things all at once and one piece from this year. That is not yet so all of those have been signed by the governor there's one piece we passed, which I think is pretty important, which has not yet been signed by the governor, and this is to create automatic voter registration. So anytime, you interact with a certain government agencies like the dmv. When you go get your driver's license, you're basically automatically enrolled, you tick, a box to say that you are able to be a voter, but otherwise you're automatically enrolled, and the governor has not signed that that yet I do not know what his intentions are for that he has. I do not know if we've sent it to him normally the way the bill process works. Is we pass a bill and then, as a courtesy, we wait for the governor to request it, because you know there are hundreds of bills, because once he it arrives on his desk, he has 10 days to sign it or it becomes law during the year after December 31st. He can basically pocket veto it. So the automatic registration, as I recall, was worked out with some involvement from the executive. So I do not know what his intention is for that, but that would be something if you wanted to take an action, and you know liked the bill. You know you could reach out to the governor on that. So those are the big changes that we have made in the last couple years and then, in terms of what still needs to be done. There are a couple of bills that Senator Kruger carries and then there's a couple of broad issues that I'll mention that are worth exploring, so one that is timely. Now because we're you know, the city is struggling with the large numbers of early voters. It's great that everyone is voting early, but the board really needed to have had many more pull. Sites is what it comes down to that you know three or four hour weights are not acceptable and it basically boils down to numbers, particularly with Covid-19, because you can only fit so many people in a location. It does not matter how you know big it is. You may have been able to fit a lot more people previously, but regardless you know, we just needed a lot more location, so Senator Kruger has a bill which does two things. One of the issues we found on the on the Upper East side primarily was the use of schools as early voting locations was very problematic because early voting is 10 days long and it goes over. You know through a week, so they may be using the gym in the school they may be using the cafeteria. You have people coming into the school all day, while the kids are there, it's very problematic, so we had a bill that passed the Senate but did not pass the assembly to prohibit the use of schools for early voting. They could still be used for election day voting sites, but also to mandate that buildings that receive state tax exemptions or are owned by an entity that receives more than a million dollars in annual state grant. Funding can be required to be used as a polling place unless the owner demonstrates that that will be significantly incompatible with the normal functioning of the of the location. So what we're primarily talking about is large cultural institutions like the met who have previously, you know been asked and have demurred when asked by the city, and so we we've removed that ability for them to say no, unless they can demonstrate a real hardship. We would if we had passed this bill, which we did not. It passed the Senate and not the assembly. It also makes some changes about preventing the designation of a polling site with a location where there's an on- premise liquor license which could capture some of those large cultural institutions. So we've increased the universe of places that might be available for early location, early voting. That is and then another bill that I also think is really key. That Senator Kruger Carries would attempt to professionalize the board of elections. You know, I think what we have seen recently, and this really gets to the heart of I think the next step for for reform in the state and especially in the city, is you have a board of elections that is, is staffed by patronage from the political parties? And you end up. You know there are some excellent people who work at the board and there are a lot of people as there have been several recent news stories. There's one of the times today. I think one in the city. You know people who are not able to do the job and it is an increasingly complex job to run a modern election and there are a couple of places where change can be executed and it has to be at the city and the state level. Part of the makeup of the board is in the state constitution, so you know it may require as much as a state constitutional amendment. Senator Kruger has a bill that would more clearly delineate the powers and duties of the of the executive director and deputy executive director of the board in order to clarify what their who is actually responsible for the day- to- day operations of the board to try to give it a more accountability. But, more broadly, you know this is going to require an interaction I think between the city and the state determining what's the best way forward in terms of how to professionalize the board. It is a problem statewide, but it is a particular problem in New, York City and our the chair of our elections. Committee Senator, Zellner Myrie, is very good and he is obviously aware of this issue and I think they are planning. I think they even announced that they're going to have some hearings in the beginning of next year to try to map out a way forward to reform the boards of elections, and I would say that is that is the place that the focus needs to be. Now, that's really what is holding up. You know what is causing the problems, causing the problems with the absentee ballots getting out. You know, we all know about the hundred thousand misprinted ones that went to Brooklyn the delays for early voting, the problems with machines during election day voting. All of those things come down to the board of elections and how they, you know, complete their mission, and so we need to look at how to improve and professionalize them. Those are the main things. The only other thing I sort of wanted to throw out there is is ranked choice. Voting and you know we're going to see how this plays out in the city in primaries next year will be the first time which is very exciting, and you know something Senator Kruger has been interested in. She carries a couple of bills that would that would try to begin to introduce it statewide, but you know looking at how we can expand that or improve it. You know, depending on how it goes, I think, is going to be really important going forward. Yeah I'll leave it at that. I think those are the. Those are the big things. Thank you so much justin, that's a lot. Those are great things for us to continue to look at and see what we can support. I just want to ask the committee: if they have any questions, you can raise your hand. Do I see any questions? I do not. I'm not seeing any questions any questions at all right, seeing none I'll turn it over to any members of the public that are here. That would like to ask Justin a question. If you're joining us from a phone, you can press star nine to indicate that you'd like to speak okay, I I'm seeing none, so I think we will continue to look at all these issues. I thank you for coming and updating us, and so we can continue to follow because I know you know ranked choice. Voting was one of the things that we had supported before. Obviously we also are really excited to see how that plays out, and I think the other issues you highlighted are things that we'll continue to follow and see where we can be. Thank you thank you, and now I think we are going to move to Kate Councilmember powers, chief of staff, who's going to update us on. I believe the council member has some legislation that he is introducing soon or has just introduced. Yeah hi everyone. Thank you for having me tonight my name's Kate Theobald, I'm the councilman's chief of staff, and, let me just say, while we search for a new hire to provide you know dedicated service to commuter five catchment area, the role that Abigail Bessler in our office used to fill I'll, be handling this area in the meantime. So I appreciate the opportunity to address you all tonight, so I wanted to share, like Renee, said some information about the city role in the election process and what councilmember powers is doing towards ensuring more efficient elections like first and foremost. You all know that we're in a new era of elections, post- covid era or during Covetera. We all know how important the option for absentee voting is as like a safe alternative to in- person voting. So to that end, councilman powers is introducing a new resolution on Thursday at the City Council's full stated meeting in support of the state bills that authorize the board of elections in New York state to establish absentee ballot drop- off locations. Now, while we would have loved to have these, you know for these drop- off boxes for this current election that we're we are experiencing right now. We know that there still may be a need in the future as well. So like as a point of comparison, you know some facts. The city Board of elections reported that they mailed out over 775,000 absentee ballots to voters in June and that's roughly 12 times the amount in 2016 presidential primary, and you know, while this past spring, you may have heard and read in the news that governor Cuomo issued the executive order to allow all new yorkers to cite risk of exposure to Covid-19 as a valid reason to requested absentee and in that same one fell swoop. He ordered the local board of elections to mail absentee ballot application forms to every eligible voter, as well as ordered local boards to send voters their absentee ballots for the June primary, with the postage paid return envelope. We all know that you know a part of the equation is the United States postal service and that's beyond New York state's operations so like, for instance, it was found in a recent inspector general investigation that this summer, the newly appointed Master General implemented a policy change that you know was purported to reduce costs and inefficiencies, but actually removed hundreds of high- speed, mail, sorting machines and cut overtime, so also in July the usps they sent a letter to all the states warning them that if they did not require voters to request mail- in ballots at least 15 days before the election, there could be a risk that the usps would not be able to deliver the ballot in time for the votes to be counted. But thankfully, in September there was a federal judge in New York that ordered the postmaster General Dejoy and the Usps to reverse these policy changes that they implement. In the summer and pre- approve all overtime requests and treat all election mail as first class priority mail, but this just goes to show like these experiences of this past primary election, that the operational failures and the policy changes at Usps. They kind of lessen the public's trust and the ability to us to submit our absentee ballots via mail. So now, with like the general election upon us, the board of elections Director said that he expects actually 1 million absentee ballots for this November general election, which is double the amount that I referenced for the June primary. So we're really. While we would love to have these val drop off boxes, like I said here and for here and now like. Should this bill pass in Albany we'd be joining 33, other states and Dc. I believe that use ballot drop- off boxes as a part of the election process. So the councilman's resolution, like I said, he's going to introduce on Thursday the City Council, is the support of the Albany bills that we want to see past they're sponsored by your Senator Brad Hoyleman and Assembly member Dick Godfrey, and so I kind of like sharing you inside scoop they're. Not it's a pre- considered resolution. It does not have a number yet, but we're hoping that it will pass soon at the City Council so that we could send it in support of the Albany mills and also before I end. I also want to note that this afternoon, the board of elections- maybe you heard in the news, voted to extend early voting hours so for the rest of the week or for Friday. The hours are going to be. 7 am to 5 pm for Saturday they're, going to be 7 A.M to 5 P.M and for Sunday, it's 7 A.M to 4:00 p.m. So I just wanted to mention that before I concluded, thank you Kate. Does anyone have any questions for Kate? Please use the raise hand function. I am not seeing any, but I have a question myself following on from Justin's comments about attempts to professionalize the board, the Election Board and that's a state sort of local endeavor. Is there anything pending in this at the city level to address that? Do you know not to my knowledge, but I could look and review the bills and get back to you. That would be great. I'm just checking to see if anyone else has questions seeing none, I'm going to turn to the attendees any other members of the public who have questions, raise your hand and seeing none, I'm just going to thank you so much for updating us, Kate and we'll keep an eye out for that bill. Thank you so much and now I'm going to turn to Laurie at the speaker's office and she is going to update us on these issues as well. Yeah thanks there are. I want to just go over two important items from the city council: the Voting Rights Advancement act in July, the New York City Council passed Resolution 1371 that was sponsored by a council member Council Majority leader, actually lori Cumbo. It urges the United States Congress to pass and the president to sign into law the voting Rights Advancement Act of 2019., it's also known as Hr4. The first of the bill is to revise and modernize portions of the Voting Rights Act of 1965 that were struck down by the Supreme Court to ensure that all eligible U.S citizens are guaranteed their constitutional right to vote. It has passed in the house and then the second item is in regard to an oversight hearing that took place on September 25th by the committee on governmental operations chaired by council member Fernando Cabrera was entitled election administration during Covid-19 pandemic after governor Cuomo issued a series of executive orders to ensure all new yorkers could vote by absentee ballot. The board received, as Kate noted, nearly 800,000 absentee ballot applications that was about 12 times more than the number received for the presidential primary in 2016.. Nearly 45 of those were received in the final two weeks before the election. So the hearing addressed the following issues. A significant number of voters did not receive their ballots by the day of the election. As a result, these voters were unable to vote by mail, since state law generally requires absentee balance to be mailed by election day in order to be counted as Justin mentioned, roughly one in five absentee ballots cast in June in the June primary were rejected by the BOE for various reasons, as he said, signatures missing no postmarks. Finally, the boa was unable to complete its account of all the votes and certified certify the results until six weeks after the election, due in large part to the number of absentee ballots cast. So during the hearing, the committee questioned officials from voe about one the challenges during the June primaries and what were the preparations now for the 2020 general election? Two about the boe's plans for implementation of ranked choice, voting in 2021 and the committee also solicited input on these topics from the mayor's democracy NYC office, the New York City campaign, Finance Board from advocates and members of the public. Since then, local changes to improve the absentee voting process have been put in place, at least some. The boa BOE reactivated its online application portal. That was one day after the state authorized local boards of elections to begin accepting absentee ballot applications. Two weeks later, on, September 4th the board of elections announced that it was launching his first ever absentee ballot tracking system. They designated poll sites for early voting, and, yes, we need more and recruited poll workers. They received approximately 15,000 applications. I know this is a lot in a short amount of time, but both the hearing, testimony and transcript are available on the council website and that pretty much takes care of that a lot it's important stuff is a lot. Thank you. I want to ask the members of the Bex Committee. If they have any questions for Laurie Pete did I see your hand Pete Webb, I see. Rachel has her hand raised Rachel yeah, not so much a question more so just a comment. I think to all of these points as the election wraps up and work is done with both the city and the state to kind of do a comprehensive look at the BOE. I definitely want to make sure that we stay in the loop as Renee said. So, just let us know of any other advancements or legislation I'll keep following it, but if there's a way that we can be helpful, we've all I'm sure noticed things with early voting and absentee ballots and experienced them ourselves. So I just wanted to make that note and thank you so much for speaking sure. Thank you lori. I have a quick question. Do we are there enough poll workers? There are not things. I can answer that very honestly yeah, even though those 15,000 applications sounds like a lot, it was not enough much more needed understood and then is there something happening to address even that piece of it or I do not know, what's happening right now. It's a great question. I'm sure that we're going to need to do more investigation as to how that can be resolved. But anecdotally, I've heard good things from Madison Square Garden that things, even though there's a long line that once you're in it goes very smoothly. So that's good News, Great News! Thank you so much all of you for coming in and speaking us as Rachel said. This is an issue that we're really interested in an issue that we want to follow, particularly with the board of elections. So anything as things continue, please keep us updated. We really appreciate it and thank you for attending tonight. I'm going to turn now, unless the committee has any more comments on that issue, I'll just check in with everybody any raised hands: okay, seeing none. What I'm going to do is I'm going to turn to our three pressing issues in the district, which is our survey. So we have the survey that we have to do, which are the most pressing issues in our district. I've circulated it to the entire committee. You should have them in front of you. Luke has them if we need to put them on the screen we can. I just want to go through them very quickly. The three most pressing items have been identified as economic development and recovery homelessness and the issues surrounding homelessness in our district, the needs of the homeless and quality of life issues, and that includes Noise Graffiti Petty crime. Those three issues were chosen because they're Mo raised most frequently in the district. We looked at some of the data we looked at 3- 1-, 1 complaints and we've had input from committee members and from other committees in the healthcare Silo and Human services. Silo the services to prevent homeless was the number one issue in youth, education and child welfare. Remote learning and technology was the currently the most important issue, given that so many children are working remotely and from home in public safety and emergency services, public nuisance, which is noise and other disturbances, we looked at the 311 calls and that's what's driving that choice. Similarly, in core infrastructure and city services and resilience, noise solution again was number one in housing. Economic development and land use. Small business services and support is this year's number one. Small businesses have always been a concern of CB5, but the pandemic has certainly heightened that need in transportation and mobility. Traffic safety and enforcement is the number one issue there. We want to make clear that the caveat is that we would like enforcement of the traffic safety issues, which includes cars and bicycles, but we would like to see the enforcement shifted, so we're not asking for an NYPD enforcement, but rather that this responsibility shifts to D.O.T in Parks culture and the other community facilities. We rank the creation of the office of the public realm, along with appropriate staffing for that office as number one, I'm sure you recall, land use, talked about the office of the public realm and heard it parks transportation. It's something that the board cares deeply about. I know that the pandemics really impacted our selections and our number one choices this year. I just want to know if anyone has any questions or changes that they'd like to make in respect of these selections or any comments. I'm looking for raised hands. Is everyone on board generally with those selections as our top choices in each of the silo? I see Mary Brosnahan, Mary yeah. I I had heard it just mentioned in passing. This whole move to shift the enforcement to DOT and I did not really chime in because I did not think it was like an actionable thing, but I kind of I'm not behind that. I have not seen good things with D.O.T in terms of, as you know, my be in my bonnet about 14th street and that they never came clean with the data that they promised and then by executive fiat turning it into a busway which, by the way, does not have bike lanes and it's really up the traffic flow, north and south here in the Union square area. So it seems, like maybe a good thing as a pie in the sky idea, but I just would have trouble getting behind shifting enforcement to D.O.T. So that's just my comment. Thank you. Any more comments. July thanks, renee. I was just curious. As you mentioned, these knees for the district have been identified. How were they identified? Who commented on these surveys? So July the process? The last few months you were in a silo and we were putting looking at all of the community needs. We were looking at the borough consultations. We were looking at data online, so each of the silos were putting in to our Google doc the needs that they were seeing, we're also looking at across the committees at the top issues that are that have been coming up and also issues that have come into the board office. And so, if you look at the, if you look at the document that you have- and you see you get a choice of you know, if you look at parks, there's a number of choices, you could pick library facilities as your number one insufficient park or open space community facility access of all of those issues. We've looked and we've looked at what the committee has heard, what the committee has supported and what we have heard in terms of need, and also looked at the data of things like through on one complaint and chose the one that was most prevalent in all of those conversations got it so it was compiled by our committee members. Thank you, Joseph thanks renee. I I guess my biggest comment is just I guess a suggested edition. If it's not too late for that on page seven under the topic of transportation, you know you talk about. Let's see here, you know the traffic safety and enforcement, that's the terminology we use. I agree with everything here in the explanation about the need for better enforcement. I would just like it if we could highlight, I guess: traffic safety and enforcement that threatens the safety of pedestrians and cyclists. I've seen that as a big problem, I hear about people on bikes getting hit by cars every day, so it'd be nice to kind of tie it in division, zero and actually call attention to behaviors that threaten cyclists parking in the bike lane encroaching into the crosswalk. I know we can't get too specific, but it'd be nice to reference that problem too. I'm happy to add this. I I will say that this particular language came directly from the transportation committee of CB5, so we defer to them on the issue of transportation, but I think that we can add that language for sure, so we can reference vision, zero. I do not think that's going to be problematic and add that if everybody is happy with that edition, anybody have any thoughts about that. Any more comments about these selections. Okay, I'm going to move to attendees and ask if they have any questions or comments about this elections. I know they do not have them in front of them in the same way, seeing none I'm going to turn back to the committee and what I'm going to do is I'm going to bundle these issues for a vote to bring all of these issues all of this elections, the budget selections to the full board. So I will continue on and turn now to the statement of need. Everybody should have received the statement of need and it's a district needs statement, and I want to thank Chuck and Evan for drafting the document. They did the initial draft of this document. I trust you all read it you'll see. There's I think someone I do not want to take credit for someone else's work. I did not draft any part of this at all. So then, thank you, chuck, okay, just chuck not evan was on that email. But thank you chuck very nice of you evan. In any event, you'll see that there's emphasis on addressing the needs of the increased homelessness that we're seeing in the district. The quality of life concerns the economic recovery. The needs around that the needs for sanitation, composting, electronic recycling, access to ipods computers and Wi- fi for all of our students in the Discus district that are working remotely the need for enforcement of violations. Anything from illegal like vending to biking infractions that sort of picks up your point, Joseph we're clear that we're not asking for the NYPD to handle the enforcement in these different areas, but we're asking certain enforcement be transferred to other agencies like the D.O.T in the instance of bike enforcement and traffic enforcement. Affordable housing has always been an issue in the district and that's addressed as well in this statement, as well as traffic and safe public transportation. We also highlight the need for a director of the public realm to make sense of how the public space is utilized and how our lighting air can be protected, valued and valued and considered when making decisions. There's one slight change, I'd like to make in the document under quality of life, I'd like to add a line. I'd like you guys to consider this that our air and light is a public asset that should not be privatized or monopolized by private developers. It must be approached as any other budget asset and it must be protected as such, particularly as we move forward in the rebuilding and recovery of the district. I know we talk about the importance of lightner and green space in our survey, but it's important just to add that again in the district needs statement, if everyone's okay with it, so I'm going to turn it over to you for comments for changes for suggestions to that document. Renee. Can I make one technical question? Yes, you had mentioned for the sake of people's times to time, different sections. Would you like me to start a timer for this section of the meeting we can? We can start a tiger, it's going much more smoothly than I anticipated. So, yes, you could start the timer. Thank you very much luke, and if we need it going forward, we can either stop it or not. Thank you, yep. Thank you for reminding me of that comments to the district needs statement, questions to the district needs statement. Everyone finds the district needs statement workable and they find nothing to add nothing Joe, Mafia Joe. I think you are muted. Second, I'm sorry I did not chime in or I did not get a chance to read the news. The district needs statement. I would I think we should. I mean we touch upon it in this, but I think there should be some mention of Broadway and the impact and the needs of the Broadway theater district. There's mention of tourism. But that's you know, that's a hundred thousand jobs and it brings, I think, about a billion dollars from people outside the state to spend money on hotels and taxis and restaurants when things are open. So I would love to see that the additional support for the theater district- I do not have a specific language in in mind, but I would like to insert something: how does the committee? I actually think that's a great idea that we could add something to say: we need to see the support and reopening of Broadway given the way it impacts our district and how important it is to our district. Do people have thoughts about that Joseph? I see your hand is raised. It was actually raised for something else, but for this I support that. Okay, all right I'll, come back to you Joseph. How do other people feel about a line or two mentioning the impact and needs of Broadway and saying that we do need the support for this critical industry? Are we good with that? Okay, I'm seeing no one responding any comments, any questions, everyone's very quiet tonight, Joseph you have your henries. I know it's about something else, so I'll, let you go ahead all right, thanks, so you're, muted, Joseph Sorry about that. Okay in the quality of life section. I just had a question and a comment. So you're you mentioned air and light as a public good. I guess I just wanted to ask: is this? You know: are we talking about air rights as far as like zoning goes or development goes, or is this in reference to? I guess I'm a little confused by that it's sort of it's associated to the direction of the probably ground, light and shadow, there's, no coordination and there's no real consideration of shadow and light, as developers have been building, and so it's just a recognition that light. We talked about it earlier in the document where we talk about our public spaces and our green spaces, and this sort of also references, light and air in that respect, not necessarily land use, very specifically, but sort of light and air as valuable commodities, just as much as a square footage might be on a block. Okay, thanks and second question same paragraph and I've seen this mentioned before, but this might be because I'm new to the board, it mentions the location of link kiosks and it seems that this board has supported removing link kiosks. That does not seem like what I would want, but I guess I was wondering if there was any background or context I should know about. You know why we want to remove these, or at least some of them, so we've had conversations, and the committee has supported removing some of the link kiosks we're much more in favor of removing the phone booths, particularly with photos that do not work, but we're also in favor of moving some of the kiosks that are close in space to other kiosks. We find that they're not used in the way that they originally anticipated, and so generally they are not useful in the way. You know that they should be. You know for wayfaring for tourists and that sort of thing we're not suggesting that all kiosks be removed, but we do not generally love them if that makes sense, yeah yeah the site of some, not so nice activities, and so we've seen them as being less useful than they might otherwise be and take deep space on the sidewalk yeah. Okay, thanks, okay, more comments about the the district needs statement. Any changes any questions, any comments from the committee, I'm seeing none, I'm really surprised. Everyone is very happy with. This is great I'm going to look to the attendees to see if they have any questions for us. I do not see any raised hands there. I do see some comments in the chat in the chat. Okay, let's see they provide such a vital service to those struggling with housing and stability. I support the Broadway light and air and do not need to make a nice support. Okay, thank you, Rachel and Ms Hess. We see your point about providing a vital service to those struggling with housing and stability. Regarding the Kiosk yeah. As I said, it's not all kiosks, we're not suggesting that all kiosks be removed, but we have seen many that are close in time and close in space, so kiosk upon Kiosk. They take up a lot of space, so we really want to look at that again. Our objection is more to the phone boost. Okay, any more comments, questions changes, okay, so moving forward just to wrap up we're going to add the light and air language and also language regarding the support of Broadway and the need to revitalize Broadway and its importance to the district on the district needs statement, all right, I'm going to move on to the capital, the expense requests we're allowed to make 25 expense requests. You should all have a copy of those you'll see. I do not know if it's worthwhile for Luke to display them or we can all look at our own list. You'll see that the first requests generally focus on some of the issues we've seen in the district regarding homelessness. So, for instance, if you, if you let me just see, if you look at this, you can see we have funding funding for enhanced coordination on social services involving street issues such as Encampment Cleanup, Opioid addiction. So it's enhanced coordination for that and we receive that. You can see that the agency that would be involved the source of the request and whether it's capital expense and whether it's new or repeated so generally, we should put the requests in the order that are most important to us, but there's not a methodology necessarily to this beyond things that we've seen that have been important to us. So I'm willing to take your comments and your concerns and move these in whatever way you feel are most important. Do I see comments from the committee in terms of the way that these are ordered? We can go through them one by one, but I believe you all and I'm happy to do that, but I believe you have the document in front of you and we can go through the first. The first four speak to additional case management for DHS funding, to provide case managers to the homeless, individuals and especially families. More funding for the heat teams, further streamline the process for the one- shot deal which are emergency, grant applications for rental assistant as you go through. You see that these the requests sort of are in line and aligned with the three top issues that we've seen, which are homelessness and the needs of the homeless in the district and noise complaints, as you go further down and also SBS small, you know small business and creating those supports for those sort of businesses in the district renee. I'm seeing a couple handwritings, I see them, I see Mary, I see Mary. First thanks renee. I just wanted to point out for the act teams. If everybody is in agreement, it would be great to say not only to increase the funding for the act teams, but to increase the housing vouchers that are attached to those act teams. I think it's been shown in multiple studies that the most positive outcomes for act teams are those that have resources related to housing so that they can stabilize people and continue to interact with them once they're housed. It also makes the people on the street more willing to interact with them if they have that very meaningful resource to provide okay, and I'm wondering that would be more a capital, I believe so more funding. I'm sorry, I think it's an expense, because it's we're not asking them to build new units of housing, it's more of a voucher type of system where they can rent housing in the private market. Okay, so more vouchers for the act. Teams yeah both more money for act teams, including specifically housing funds connected to those act teams. Am I saying that right, joe you're, more of an expert than I am Joe Joseph, I think you mean yeah Joseph, okay, we might have lost Joseph there. I'm happy to add that into that number. Two add that additional language, so that becomes a bigger ask. I'm sorry. Can you hear me? Yes, oh yeah, sorry I'm having internet problems. I would I would agree with that Mary. I do not know if I know much more about it than you do, but I think additional funding for teams and then the more incentives there are. I think I think vouchers for homeless units are always a need, so I think that would be great. Okay, all right, so we can add that if no one has any objection into that into that line as an addition rachel, I see your hand. Sorry, so these are not actually ordered yeah right. These are just the order that we entered them so they're they are relatively ordered, but I'm asking the committee now if there's okay is, if you'd like to see changes and so ordered yes yeah. I do not love that the funding for mental health profession in every middle in high school is last on the list. I do not like the idea of ranking them in the first place because they're all important, but that is something that we've like written a resolution on and multiple letters on, so I do not necessarily like that. It's last, but I mean they're all important, so I do not know you know how we're supposed to really prioritize. I know it's not related to any of our main priorities that we outlined a few minutes ago. Is there one that you can see? That would be a natural swap Rachel. Oh that's tough! Can you come back to me on that? I can I'm going to ask Joe Mafia, has his hand raised you're going to hear a recurring theme from me tonight? Yes, on capital and expense, Broadway brings a hundred thousand jobs, 14 billion dollars to the district. I think there should be an expenditure and there's so many needs and in a cro and it cuts across some of the district needs that we've and priorities security in the district around Times Square area dealing with you know petty crimes. I do not know if it's police spending or if it's funding or grants to the Times, Square, Alliance or the local bids and or this might be a capital expenditure as well the theater dish, the theaters themselves, either grants to if it's under 35,000. I guess it's on this list help them fund conversion of their their air conditioning so that it's covered friendly. There are both for- profit and non- profit theaters in the district and I'm sure that they could use the financing to help that conversion. So I'm happy to do the funding conversion. We can add that we have additional availability in our capital requests. I'm not sure where we have some supports in the in the expense budget for small businesses, but you you're asking I think you're asking that Broadway be a separate line item. Is that correct? No, it could be it's really security in the district. It addresses the needs for petty crimes. It addresses partially, I guess some of the homeless issues, so it does not have to say broadway, but that's what I'm thinking? Okay, so you're all right. It's difficult! I'm trying to think how we, let's have a think about that, as we continue some of the other requests. Does anybody else have any comments or requests on the expense side or changes to the order of these expense requests? Renee I've thought about. You know some potential reordering, so we have numbers. 12:13 and 14 are about the director of public realm, and so I think to me like the most important thing, there is just the creation of the position. I think the funding for the administrator and coordinator obviously are important to support that position, but I think could potentially be bumped down a bit because they're reliant on creating that position in the first place and to me they kind of go together. So you know take that as you will, but that's one idea, I'm happy to do that to keep the funding for the salary position. The director of the public realm keep it at number, 12 put 13 and 14 at the end and move the DOE request for funding a mental health professional in every middle and high school. I want to do a little work to actually identify the ones in our district for this when we start to input it, but I'm happy to change that. If everyone is happy with that change in priority oriented ordering July, I think you're, muted sorry, I may be having a little audio problems. I hope you can hear me now. Yes, okay, great so number, seven increased support for small businesses with loans, grants and other programs and the agency is for the request is made out to EDC. So I have two comments on this one. I'm a I'm not sure that EDC is the appropriate agency. I mean they do work with small businesses, but my understanding is they more so provide below market rate office, spaces, incubator, spaces and long- term leasing on behalf of the city, I'm thinking it may be more appropriate for the request to be made up to SBS. I could be wrong. Also EDC did mention they. They are quite limited in terms of their budget in the coming year, when we did the borah consultation, so I'm guessing SBS may in the end, receive more hard or FEMA funding, because it is more targeted towards small businesses. That's one comment number five, so this was, I think I wrote this request for fiscal 2021.. I do not remember what Omb's comment on it was, but it was not founded. I think they might have said this is already funded, or this is not a budget request and the fact that I do not see anything changed here. We probably are not going to have a better chance this year. So this may be an item that we can potentially remove and replace with something else and if we're comfortable to replace it with something else, I've got a suggestion which is health care insurance premium coverage related. I did not make a comment before. Okay, I think my connection is just not great, so I was just saying in terms of replacing number five. I've got a suggestion and something related to health care. Perhaps we can request for additional funding subsidies to be provided for people who need continuation of their medical coverage if they've lost the job due to Covid-19 as an example or people who need just assistance to get coverage because they can not afford it and I think that's important during pandemic renee. I do not know how much of that you got, but no, I heard you. I heard you this time. I think it's a great idea. I do not know that any that I've heard from anywhere else. Besides you tonight about this, I think it's I do think it's a great idea. I think that people who need medical coverage- I do not understand, I'm not understanding what the funding is around that I as an issue to add it at this stage. I do not know number five, as you say, is something that has been on our request last year and the year before, and it's partially funded. You are correct, but we've just supported some of the initiatives for the outreach to domestic violence, women in domestic violence, non- domestic violence, shelters, and we supported that outreach, and we supported just recently in one of our resolutions to ensure that they get the same services. So I'm not sure that we should actually do away from number five. But I'm happy to listen to the committee on that Joseph. You have your hand raised. Can you hear me I can okay. I do not have a comment really about that. Sorry. I was going to raise another couple of points. Okay, can we hold it for one second and I'd like to get the committee's view on July's point and item number five. Anybody have any thoughts, okay, July, I'm happy to to understand about insurance premium and adding additional people to medical coverage. I just do not know in doing this process right now tonight at this stage that we should add that as an expense item without understanding more about it, perhaps may I suggest adding a sentence or two about that in our district needs assessment, or do you think that is you know a less likely place to go? I do not think it's a less likely place to go. What I'm saying is that this is something coming out of left field that I'm not sure you know. I do not know what the position is on health care insurance premiums. I do not know how they're funded. I do not know what monies are in that pot. I do not know enough. I think it had not come up as one of our issues in and I'm sure it is a pressing issue if you're bringing it to our attention. I just it's sort of coming out of left field, given that we have this, we've been working on this for quite a while on issues that yeah to the district. I understand, which is not to say that we can't follow this and look at this and see what's happening. Obviously, it's a concern to you and it's probably of a concern to other people in our district. So it's not that I'm just dropping it. It's just up for this for the purposes of this project right here I think it's coming a little bit late and out of left field without having enough information, any other comments of members of the committee. I do it's Joseph, I'm Joseph, sorry, my screen's off, so I hope my internet does not freeze up. I did want to add in before I go into my next points to this conversation. I agree with July about the problems that she's raising. I would think perhaps that might be more of a state funding issue. I know you know the city and the states share responsibility for Medicaid funding. I know it's not all about Medicaid, but Medicaid is a big. A big chunk of how the most needy new Yorkers get health care. I do know this state has not chipped in for New York, City's Medicaid, to the extent that they chip in for other municipalities, medicaid and that's been a problem, but of course that's kind of goes above and beyond. I do know also the city has I remember, hearing or reading in the news that the city had launched some sort of universal Health Insurance program. I think this was maybe last year or two years ago, but I actually, I honestly do not know that much about it. So I I'm agreeing with your with your point: renee we just we should learn more. I'm just saying I agree with July's kind of sentiment. Moving on, I want to clarify what I said about number two, so I do agree with Mary that I think the more tools the kind of caseworkers have in their toolkit on the act teams, the better they can do their jobs, but I actually I want to amend what I said. I think that might confuse things to have. You know housing vouchers in that same request. I think if we were going to ask for more housing vouchers, they would most likely come from HPD and they would be. You know. I think I think what Mary was referring to was scattered site housing vouchers, which, if those are what we would be asking for, then I think we should also add an additional line for a dohmh request for supportive services funding for scattered site, supportive housing, because when you have scattered site supportive housing apartments without services, it can actually lead to really terrible outcomes. So, should I move on to my next point? No, let me ask you a question number six, which is create a project- based rental subsidy for homeless set- aside units separate from supporting housing. That's not I'm wondering so. We have 25 requests. We are limited. I think what you're saying is important edit and it goes to the issue of the homeless issues and the needs of the homeless in our district. I just I do not we're going to have to trade. Something off is my point, and so I can. Maybe you can potentially squeeze one line item by putting number 13 and 14 together, but you're. You have suggested two. You have suggested HPD scottish site funding and dohmh supportive services just to be clear. I'm not I'm not really advocating for adding both of those I'm just saying. I think we would need to do it that way, rather than adding them into number two, because it's just different agencies involved unless I'm understanding, Mary's point wrong or kind of what Mary had said, Mary yeah, I guess I was not limited to either HPD or department of mental health. I would I was thinking that even you know that correct me. If I'm wrong a lot of these outreach workers that are out there now are being funded by Steve banks and DSS. No, yes, yeah! Maybe we I we should put some more thought into it. If it's going to complicate things, we can take the housing out or to be honest with you now that I'm looking more closely at the said, the request says that it's from coalition for the homeless, I'm not sure why it says project based. Maybe we could circle back around with them. Okay, because that to me speaks more to you know a section 8 type of thing: if it's project based okay, all right, we can clarify that with them, for that particular request, rene. Just to make a note, we have reached the 15 minute mark for this person. Thank you. So, let's spend about five more minutes on the expense request. I had two more points, I'm sorry but they're quick. Can I continue? Okay, so for number nine, I would request just an addition of a couple words just to clarify what I think the intent was here. I would say: recreational and activity space. I just think in the in the homeless services world. Sometimes they differentiate those, and I think I think, having recreational space is very important for the intention here. I would also add the adjective on- site to that, because, if it's not on site, then it's just not going to accomplish what needs to be accomplished. Okay, all right and then number 23, I'm just going to be a broken record about bike Safety. I think this one is great. I actually really support it. I would just add that I think we should you know, expand that pilot study. You know to cover like parking or illegal driving in bus lanes or bike lanes. I think I think those are both major problems both for traffic flow and for safety. So I know that's another committee that does that, but I would personally like that added so you're saying for bike, Lane Safety and oh, I just meant, I would add parking or illegal driving in bus lanes and bike lanes as kind of a clause to that one. Okay and that's it! Thank you. Thank you. Joseph I've added those comments. Does anybody have any comments or questions about those points from Joseph? Okay, I'm just going to summarize what we're doing on number two. I think we're going to take off the comment that Mary had and leave it as is, and then we're going to clarify on number six with coalition for the homeless, what they mean by project base we're going to keep number five, as is number seven to July's point we're going to determine whether SBS or EDC is the proper agency for that we're going to move 13 and 14 to the bottom and we're going to bump up number 25, which is the funding of mental health professional in every middle high school in our district and we're going to identify those very specifically and then we'll add Joseph's comments in item number 23.. Did I miss anything or does anyone else? Have any comments? Kim, hi, renee thanks so much so I did want to echo Rachel. Thank you so much for moving up that really important mental health professional for every school. In our district I mean every school around the city just on the summer use employment. I forget what number that is number 10. It was reestablished, so I think we can just do like use language around increasing and then just around year. Long maybe remove summer, just for clarity's sake, and I had a question around what was left off. Were there another 20 things that were being considered or we consolidated where we were? If you, if you check on the Google sheet, I can't okay, the full Google sheet yeah, so it I know that one of the things was the concrete using the concrete that is more, that is more environmentally friendly was one of the issues that were left off. I mean things. What I tried to leave us were things that did not speak to our top three or our top individual items within a silo. If there's something on there that you would added that you think is really important. Please let me know, please let us know now: okay, I'll, dig that up really quick. I was just thinking that 13 and 14 the additional staffing for the office of the director of public realm, as mentioned previously by others on the panel super important. But like could there be consolidation of that to make room for something else to be on the list in July, I really loved what you were saying about health coverage. I think that Brian had just wrote written in about some free services offered for all new yorkers. I, which I've heard about. I just do not agree, have a depth of knowledge to be able to tackle that tonight. Okay, to your point Kim, I do think we could add funding of administrator and coordinator and office of the director of the public realm into one, which would allow us to add an additional piece, and I I think that we want to think about adding Joe Mafia's comment regarding broadway and security in the district. Although I'm a little bit leery about how to what I'm not sure what agency or how to actually create that request, does anybody have any joe? Do you want to speak to that? Yeah? Let me let me think about it. I just sent I just posted in the chat potential wording for the district needs statement which can go right under the economic development and recovery. An additional two sentence: okay, or maybe it's a one run- on sentence actually, but thank you: how do we help broadway in the district? Let me look at the expense lines again come back to me. Okay, so we just have that one empty. If we consolidate and move that down, then we have the opportunity to support broadway in the way that Joe was suggesting. Given his comments about the 100,000 jobs and four billion dollars to the district, I think it's probably important that we specifically call out broadway as part of some of the small businesses. I just want to hear your thoughts on that, though, would the agency be for the police department? Let me so that it's sort of problematic we have. We have thought when we talked before about the NYPD. Is it? Is it really crime that we're talking about? Is it nuisance? Is it sanitation? Is it really crime, that's rising or is it just a perception? Is there is it? Is it? Is it really sort of the mental health providers that we need? Maybe, instead of the NYPD good question, I do think it's certainly the quality of life, the whole gamut in the district tourists. You know the drug deals are happening in the in the area, it's more like Penn station than it you know than anything. So it may be all of the above what you meant what you mentioned so we're asking for enforcement of part of the issue that at the budget level of getting at enforcement, is sort of also very difficult. As you know, from previous years I do see Michaela Goldman's chat, who's, saying that she'd like to see something addressing violence enforcement is tough. Do we need more police? I think we've said that maybe is not the solution. I'm not I'm not sure that we're seeing necessarily up ticks in crime. What do other people think about this? Anybody on the committee have a thought, a comment, a question about adding a line item renee, it's chuck, I think I'm a late joiner tonight. I think that both of the comments about the the violence and the theater are certainly consistent with the committee's priorities. I they're broad enough. I wonder if joe, if they could go into the to the district overview as opposed to being a line item and so they're more con contextual in that regard and less of a specific ask, definitely- and I gave wording to the I just posted in the chat potential yeah. Okay. If we do that, then we would leave the expense priorities the way they are right, and I think that has just as much it and it's a way of getting at the need for enforcement, joe, that we can't really get at a budget through a budget request. Thank you for that chuck being more articulate around that. I that I've been thank you Joe does that. Does that work for you, okay, well and Joe? We when we attended the the city meetings, I guess last year they basically said, do not ask for more personnel, because that's not something that we're going to consider as a budget issue. They recommended that we not do that. So that's the other. That's the other thing here. So what we will do is leave the expense request, as is, as I had outlined earlier, add to the district needs statement, Joe's comment about Broadway and also about the need for some sort of enforcement or addressing the concerns. The quality of life concerns such as crime and other issues, sanitation. We can weave that in is that. Does that sound like it would work for you, joe? Yes, perfect everybody else? Okay with that and we'll move on from the expense requests, I'm seeing no response, I'm looking at the attendees I'm seeing nothing there all right we're going to move on to the the capital requests again the capital request. We have only 28 capital requests. No, I lied to you. We have 30 now and we have the opportunity to add an additional 10. again these priorities. I do not know Luke if you want to put them up. They align with our most important issues in every area. You'll see that the first one increased budget for Hpd's our space initiative funds, new construction rental units, the second one is a remediation in a supporting housing site in our district medical respite access to open spaces, and then we move into a lot of the DOE asks which are for the students in our district. The New York public library is something they make. One request we're asking for substance, abuse beds, mental health beds upgrades to the Bellevue Intake Center physical plant. Some of these you know are from previous years. You have to keep adding these until they get funded any questions about any of these or any comments or any concern about the ordering. Seeing then I'm going to look at the attendees any comments or any questions about any of the requests that we see here. I'm not seeing I'm seeing a hand raised from Joe Mafia. What are capital requests for HVAC air filters for broadway theaters? Yes, that's my number 30., I'm sorry! I did not. I did not say that when you, when you go to the end, we only have 29, but I have fun conversion of air conditioning for broadway theaters yeah Joseph, thanks renee. I guess my question is about the. I think it's the first one here. It looks like it's from a couple years ago, this r space this HPD our space initiative. I guess you know, I'm not I'm not too familiar with that program as someone who works in supportive housing development, so I do not if it's still kind of out there and a priority for the coalition for the homeless, I would not want to get rid of it, but I guess if we're looking at capital, if we want more supportive housing for formerly homeless, I would say a bigger priority in my mind and what the supportive housing network is advocating for is restoring the capital budget cut that was made in fiscal year, 2020 the fiscal year that just ended, which was almost 400 million dollars to the special needs housing capital program. I think we have more than enough space. That sounds like that should be our number one. In fact, yeah that one's that one is huge in my mind Joseph, could you describe that program a little bit for us yeah, so this is. This is one of hpd's. You know new construction term sheet program, so it funds supportive housing development. So you know essentially they set a subsidy rate. I think it's 75,000 per apartment, so a developer can apply to this program with HPD. If they're going to build a hundred units of supportive housing that makes them eligible for a hundred times say 75,000. So basically it just helps. It helps raise money for new supportive housing developments. So it's what most developers use to build buildings Joseph. Can you provide that language? You would be best suited to provide that language for that line. Item sure. Thank you. Charles Chuck Miller. That's me! So our sanitation, I did not see the sanitation stuff in there, although I'm looking very quickly, did I is it in there and I missed it. Sanitation was for well, I think, to follow on Joseph's point to explore the cuts on if they took if the department removed any trash cans in the district to replace them and then in on the expense side. We also- and I realize it's not in there, which is okay, but we also talked about maintaining the current level of services which is already restored. So I think if we have space in the capital budget to put more trash cans, that necessarily would involve more pickup. So I think that's a good thing. Okay, so we can add DSNY additional trash cans within the district. Okay, we do say that sanitation issues come up in our district needs statement. We also mention it. I think in our on the survey of our most important items, and I did think it was here, but maybe not, but I will take that and I will add that onto the capital budget, I think you're absolutely right chuck and that encompasses the up. Then. Thank you. No thank you. Any more comments, additions, questions renee. I see that Mary wrote in the chat that she supports Joe's statement. Okay, perfect all right, yes and so Joe will Joe will add that, to we'll add it restoring the capital budget cut to the special funds for supportive housing under HPD he's going to give us the language for that and we'll bump that up to number one and sanitation. I think we may want to put that. Actually we could put that just between 15 and 16, actually, because it is pretty important for those baskets to be restored. Are there any other comments, changes questions any comments from any of the attendees non- members: okay, seeing none, we need a motion and what we're going to do is we're going to restore use, Joseph's language bump that up to number one in the capital budget, we're also going to add Joe Mafia's request regarding funding conversion for air conditionings in the broadway theaters and then Chuck's edition of sanitation, restoring trash cans and additional counts to the district. After that, what we need is a motion. I do want to say a big thank you to marisa our new district manager. She came late to the party for this whole budget and has been so incredibly helpful in putting all these pieces and documents together. So big shout out to Marisa and I think I do not see any more comments, no more hands. So what we need to do is have a motion to adopt these documents. The expense, the capital budget, requests, the most pressing needs and also the the statement of need all will be motion to adopt. Second, okay and alls. We need to do now is take it to a vote, and then this will be presented to the full board at our next meeting and they will vote on it and that will be the position of CB5. Should they vote? Yes, so I will hand it over to you Julie Rooney. Yes, Mary, yes, Joseph, yes, Tristan! Is he on okay Barbara? Yes, evan? Yes, chuck! Yes, pete! Yes, rachel, yes, July! Yes, you think I saw a black club. Yes, perfect anybody did. I miss anybody. Robert C! Yes, thank you. Thank you, everybody. I know. I appreciate all your work with all of the putting the requests together and everything that you did for putting this budget together. I hope each year gets a little bit easier and a little bit more streamlined and I'm really excited. I think Marisa is going to make a big difference to us as we as we go forward on this project. So thank you, everybody for tonight, and I look forward to seeing you at our next board meeting thanks Renee. Thank you. Hi thanks, renee good night marisa. Can you stand for.",
            "summary": "We have non-action items where we're going to hear about changes to the election law that the state legislature has sort of made in the last two years and some current voting related legislative priorities.\nJustin Flag is here from Senator Krueger's office, Kate Theobald from the council member Powers, Office Laurie's, here from Speaker Johnson's office, The district needs statement and the budget, expense and capital budget priorities for fiscal year.\nState legislature has taken in the last two years, some of which the loop needs to be closed on and As. You know, the high priorities for for next steps on election reform.\nWe created early voting, which we're all experiencing now for better or worse, with our, with our current board of elections, consolidated the federal and state primaries in June, which saves a lot of money and reduces the number of elections.\nWe pass a law to allow local boards to process absentee ballots prior to 30 days before the election.\nYou know people who are not able to do the job It is an increasingly complex job to run a modern election and there are a couple of places where change can be executed and it has to be at the city and the state.\nYou know this is going to require an interaction, I think between the city and the state determining what's the best way forward in terms of how to professionalize the board.\nAll of those things come down to the board of elections and how they, you know, complete their mission, and so we need to look at how to improve and professionalize them.\nSo, to that end, councilman powers is introducing a new resolution on Thursday at the City Council's full stated meeting in support of the state bills that authorize the board of elections in New York state to establish absentee ballot drop-Now. You know for these drop-off boxes for this current election that we're we are experiencing right.\nThe city Board of elections reported that they mailed out over 775,000 absentee ballots to voters in June and that's roughly 12 times the amount in 2016 presidential primary, and you know.\nWe all know that you know a part of the equation is the United States postal service and that's beyond New York state's operations, It was found in a recent inspector general investigation that this summer, the newly appointed Master General, implemented a policy change that you know was purported to reduce costs and inefficiencies, but actually removed hundreds of high-speed, mail, sorting machines and cut overtime, so also in July, the usps.\nThey sent a letter to all the states warning them that if they did not require voters to request mail-in ballots at least 15 days before the election, there could be a risk that the usps would not be able to deliver the ballot in time for the votes to be counted.\nSo, the councilman's resolution, like I said, he's going to introduce on Thursday the City Council, is the support of the Albany bills that we want to see past they're sponsored by your Senator Brad Hoyleman and Assembly member Dick, Godfrey, and so Not. It's a pre, considered, resolution.\nI want to just go over two important items from the city: Council: the Voting Rights Advancement act in July , the New York City Council passed Resolution 1371 that was sponsored by a council member Council, Majority leader, actually, lori Cumbo.\nIt has passed in the house and then the second item is in regard to an oversight hearing that took place on September 25th by the committee on governmental operations chaired by council member Fernando Cabrera was entitled election administration during Covid-19 pandemic after governor Cuomo issued a series of executive orders to ensure all new yorkers could vote by absentee ballot.\nThese voters were unable to vote by mail, since state law generally requires absentee balance to be mailed by election day in order to be counted as Justin mentioned.\nTwo about the boe's plans for implementation of ranked choice, voting in 2021, and the committee also solicited input on these topics from the mayor's democracy, NYC office, the New York City, campaign, Finance Board from advocates and members of the public.\nThink to all of these points as the election wraps up and work is done with both the city and the state.\nThe three most pressing items have been identified as economic development and recovery homelessness and the issues surrounding homelessness in our district, the needs of the homeless and quality of life issues, and that includes Noise Graffiti Petty crime.\nI know we talk about the importance of lightner and green space in our survey, but it's important just to add that again in the district needs statement, if everyone's okay with it, so I'm, going to turn it over to you for comments for changes for suggestions to that.\nOkay, any more comments, questions, changes, okay, so moving forward just to wrap up we're going to add the light and air language and also language regarding the support of Broadway and the need to revitalize Broadway and its importance to the district on the district needs.\nYou see that these the requests sort of are in line and aligned with the three top issues that we've seen, which are homelessness and the needs of the homeless in the district and noise complaints.\nThe director of the public realm, keep it at number, 12, put 13 and 14 at the end and move the DOE request for funding a mental health professional in every middle and high school.\nI think they might have said this is already funded, or this is not a budget request and the fact that I do not see anything changed.\nWe can request for additional funding subsidies to be provided for people who need continuation of their medical coverage if they've lost the job due to Covid-19 as an example or people who need just assistance to get coverage because they can not afford it and I think that's important during pandemic.\nI think that people who need medical, coverage-I do not understand, I'm, not understanding what the funding is around that I as an issue to add it at this stage.\nI just do not know in doing this process right now tonight at this stage that we should add that as an expense item without understanding more about it, perhaps may I suggest adding a sentence or two about that in our district needs.\nI think what you're saying is important edit and it goes to the issue of the homeless issues and the needs of the homeless in our district.\nI think we would need to do it that way, rather than adding them into number two, because it's just different agencies involved unless I'm understanding, Mary's point wrong or kind of what Mary had said, Mary, yeah ,, I guess I was not limited to either HPD or department of mental health.\nI think we're going to take off the comment that Mary had and leave it as is, and then we're going to clarify on number six with coalition for the homeless, what they mean by project base, we're going to keep number five, as is number seven to July's point We're, going to determine whether SBS or EDC is the proper agency for that we're going to move 13 and 14 to the bottom And we're going to bump up number 25, which is the funding of mental health professional in every middle high school in our district and we're going to identify those Very specifically Thank you so much for moving up that really important mental health professional for every school.\nHis comments about the 100,000 jobs and four billion dollars to the district, I think it's probably important that we specifically call out broadway as part of some of the small businesses.\nThink that has just as much it And it's a way of getting at the need for enforcement, joe, that we can't really get at a budget through a budget request.\nYou know new construction term sheet program, so it funds supportive housing.\nI, think in our on the survey of our most important items, and I did think it was here, but maybe not, but I will take that and I will add that onto the capital budget, Restoring the capital budget cut to the special funds for supportive housing under HPD And, we'll bump that up to number one and sanitation.\nJoseph's language bump that up to number one in the capital budget, we're also going to add Joe Mafia's request regarding funding conversion for air conditionings in the broadway theaters and then Chuck's edition of sanitation, restoring trash cans and additional counts to the district."
        }
    }
}