{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB1",
            "channelId": "https://www.youtube.com/channel/UCCXoCcu9Rp7NPbTzIvogpZg",
            "title": "11/23 Executive Committee 2020",
            "publishDate": "2020-11-24",
            "shortDescription": "",
            "lengthSeconds": "3:01:01"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB1",
            "normalizedName": "Manhattan Community Board 1",
            "twitterName": "Manhattan Community Board 1",
            "youtubeChannelName": "Manhattan Community Board 1",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "twitterHandle": "@CommunityBoard1",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "5KTMGKwLtME",
            "fillerWordCount": {
                "uh": 288,
                "um": 294
            },
            "readTimeFullTranscript": "102 min read",
            "readTimeSummary": "15 min read",
            "wordCountFullTranscript": {
                "street": 44,
                "bikes": 41,
                "space": 34,
                "foods": 34,
                "loading": 29,
                "business": 28,
                "building": 28,
                "bill": 27,
                "restaurants": 24,
                "traffic": 24
            },
            "wordCountSummary": {
                "bikes": 15,
                "space": 11,
                "building": 10,
                "foods": 10,
                "business": 8,
                "street": 8,
                "loading": 8,
                "traffic": 7,
                "cargo": 7,
                "businesses": 6
            },
            "fullTranscript": "Anybody who wants it please email it to Justine as well. Thanks Diana you're, welcome Susan. Just tell me when to go. What's that I was going to say, I'm happy to follow up offline, but I'm curious if you ever connected with bill Cipalis. If he ever came before your working group, it sounds familiar. Diana is that one of the girls you talked to yeah. He came last week last week. He was great he's the one that does the the art with the small business yep. That's right, yeah, he did great. So it's Kai was it two months ago. It feels like a few months ago. Anyways. It was a really well all right. Tammy do you want to kick meeting off, or what do you want to do? I think? How are we doing Diana for any kind of quorum from small business working group just to have enough people on I have to ask Colin since I, don't think I have a list of the small business working group numbers? That's okay, I think I'll probably have enough people for a quorum for exec shortly. So if you start going through your results and get it working, we can rock from there so yeah I see we are already recording. So we'll kick it off officially saying good evening. Everybody thank you for coming. This is community board one. It's Monday the 23rd. You have come early for our executive committee meeting, which will be starting with the small business working group with Colin, Mahoney and Elizabeth Lewinson. So take it away yay so month and again it was over 40 days ago. I think it was. We had a really great working group with a lot of variety of folks from the city bill Wallace. Obviously, who did the artwork around for small businesses? Sorry, oh Diana, I, don't know how to meet people so anyways and what came out of it was three really good thoughts for resolutions, so I have them here before you again: I apologize for not getting them to the group beforehand, but this is really simple stuff. The three basic thoughts were the first resolution. Let's think about that way, instead of going through the whereases and the therefore be resolved, I want to tell you what those trial resolutions and perhaps we can get there together. What you're looking at is essentially a worksheet. You guys can all see my word document here, I'm assuming yes, thank you. So the first one was I, don't remember where it came from, but some on the committee said that a lot of businesses were having a hard time. You know look it's like this reverberating effect. Where you don't have revenue, you can't pay bills, you can't pay staff, you can't pay your taxes. You've all been hearing me rail against city and federal and state folks for not giving tax breaks where businesses really need them. If you can't open, then how the hell are, you gonna pay your taxes. So now these guys are now all running into tax issues, and if you have tax issues, you don't qualify for an SBA loan. If you don't qualify for an SBA loan, you can't pay your staff. You can't generate revenue, you can't stay open. So it's just really it's a kind of a death spiral. So the idea of resolution number one was to engage I guess it's mostly a federal for SBA and their lenders to encourage them to ignore delinquent taxes when they consider SBA loans. So the rare as is and therefore be results can all be worked on, but we can all agree that that's a good idea, that's probably a good place to start. Does that make sense to you, Tammy you're running your show dude! I'm here supporting you go for it. Is there any discussion on this or do we agree that this is a resolution this one here that I should work out and that we can all approve and vote on now? I think it makes perfect sense. Okay, we I think should be supporting I'm, not a member of your committee, but I agree as well. Just to clarify my committee can not vote we're just an advisory group. So we vote for your committee. Exactly we're gonna vote, we're gonna, take it. You just need to go through all the resolutions to get them done. Colin, oh and then we and then, if everybody's okay, with the way the resolutions are, we will call the question when we kick off executive and I'm sure I have quorum and executive and hopefully everyone who's here will have had a chance to read this and then we vote to approve and move on. Okay, that works can I, be Justine, I, think that's technically a violation of state law. But yes, you are Justine today, okay, Colin can I ask a rather ignorant question. I'm sure I won't know the answer to it, but sure if the small businesses are open or if their revenues are severely depressed, isn't there a correlation between that and tax liability, absolutely meaning if they're not meaning, if they're not open and they're, not jading, generating revenue. What taxes are they owing I am not I can answer that question? Hey guys, what's up bill clementis? How are you guys? The problem is expert. There's there's fixes in place, for example, the corporate tax you have. The sales tax varies upon the business being open or closed. That's correct, but there's other situations that we have out there outstanding that they're not forgiving, so this base taxes out there that we have, but it's not just the taxes, it's also the utilities and so forth, that's being deferred but still being think like accounted for is a pretty big one right. Oh that's huge! It's now I could I encourage both hats, small business as well as a landlord. The real estate tax has not been forgiven and still based on last year's numbers right now we have to do actually I'm fighting with my lawyers to get it adjusted, but it has to go into the following year's projection, so whatever's being held today and set in stone still being accounted for. Give you an example, real quick. The bank gave me for my mortgage at leeway for three months on the second week going into the second month. I got a call from my bank saying yours, money and I go. What are you talking about? I thought I had that leeway, they go no with us, you do, but the state still wants their income so bill. Is that the example you're talking about right now, that's in your capacity as a landlord correct, got it correct now, going back to my capacity as a small business owner. I have also the bills that are coming through. Basically, for example, my my small corporate tax, which is basically the general tax liability, which is my ability to operate in New York City, give you an example on that one they raise it on us, because every year I would pay a little bit extra into the fund totally carries over this year. I got an extra bill from the state of New York, saying I owe them another two thousand dollars on top of the three grand I already gave them and I didn't just get that or everybody got that across the board, but at the same time, even I totally hear you saying, if you're not generating revenue you're, not generating tax liability, but you know it's generally sales. No, that's not tax liability, you're, not generating sales tax liability right exactly that's what I meant so yeah. You still obviously owe different a variety of different kinds of taxes, but, however, you get there it's a good question, but, however, you get there I think it can't hurt to just make it easier for people to qualify for us. That's just this. Yeah and I wasn't asking to refute the value of the resolution. I think it makes great sense. I was just trying to educate myself and now I am so. Thank you. No, it was a great question. I, I'm look I'm every week, I do this every month, I do the stuff I'm learning too. So it's good to have bill. My expert here. So I guess we're gonna vote on this. When we open that up, hi guys, it's pat someone, please email, the rezzos to me, yeah, I'm on my iphone I. Can't it's really too tiny, yeah Dorito! Thank you. I could get your email right. Okay, well, Pat is going for that email, I guess we'll go through the second one. This one's pretty straightforward. Supporting the restaurant act. Look it's under this administration. It's not gonna pass I, don't know! What's gonna happen with the next administration, it's been hanging around the house since June or July by every person we've talked to in the industry bill again help me out. If you can thinks we ought to pass this I've listed here. If you can see the screen, all the provisions of the bill, but essentially it's just cash help for restaurants. They're trying to stay open, go ahead and take a moment to read it. If you can, you know what's funny about that. That's already been approved, but they're holding it back. That's part of the original plan. It was approved by the house, but stuck in the house as usual. Let's say: I won't act. This is just simply us bill. We've done this a few times more than a few times with state infinite legislation. That's a cool, sound okay, unless you want objects, I'm going to move on to the final resolution here. This one came from my twisted brain and actually it's been recently enforced by a so obviously one of the bigger expenditures again Bill feel free to chime in here are obviously heating lamps and the propane that these things suck down all day long, especially with outdoor dining hand, especially with what looks like to be additional lockdown measures in the coming weeks back out to outdoor dining it just I was sitting there, eating I forgot where I was in Tribeca, and these guys are just coming out and changing propane tanks, like literally every 20 minutes, because these things are just burning like all day long, so people can eat outside. So it just made sense to me that the city can use its buying power to help with propane tanks or even heaters, and while researching this I found this article Hamilton New Jersey, the municipality, we missed the municipality. Sorry has actually funded a grant program for up to twenty thousand dollars for qualifying restaurants for both heaters and propane to keep outdoor dining going so yeah. No, I'm sorry! Yes, whenever we had this conversation with the council person Klein and we're talking about the heaters and how we're gonna do it back and forth and how it's been approved. Well, I'll tell you every now what's happening down the street. A lot of people like, for example, I, have outdoor heaters, but I'm not using them. The regulations are so tight and strict on how you use it and so forth. For example, story is the big thing right, yeah, the storage of the propane number one right number, two speaking to firehouse 10, which they're, basically all my friends there they're like bill. Don't do it it's not worth it you're going to get too many fines, because you have to keep it a certain fee from the space of business, meaning you have to give your door entrance on the sidewalk. Let's take George's, for example, you have to be at least 10 to 20 feet outside any door entrance to the restaurant or premise by doing that. In addition, you have to have a certain fee away from the customers. So, in that essence, what it does is defeats the purpose of even having the heaters, because, if they're so far out of reach, where they could be effective, there's no point in issuing them out now. On top of that, they were saying it's a constant change and that would it gets a lot of players like myself, very frustrated, because every time we turn ahead, it's a new regulation, whether it's from the fire department, the building department or even the city itself, concerning how they're proposing it out there there's no straight message on it and, for example, yeah, I'm sorry, yeah I hear you loud and clear and I actually saw just the other day. There was a story that came out in New York eater.com about those regulations that the city had finally kind of got intact together on what they, what restaurants could or couldn't do and I hear you, and we can address that another time. But right now it does seem clear that there are a lot of restaurants using outdoor heaters. Are the restaurants in Manhattan, though using them actually I, don't see it. I've seen a ton of it. Propane yeah, absolutely I've seen at least four or five restaurants in Tribeca doing it. That's not relevant I mean in my mind, for the companies that need it to utilize or leverage the city's buying power to help them with those supplies. So that's what just struck me. What were the reasons for not using it? Are you guys aware? Is it the supposed cleanliness or lack thereof of the fuel? Because I don't know one of the cleanest? There is one bill, who's regulating it and who is coming around. Are the fire? Is the fire department really going around to the restaurants and watching and giving spines and tickets out well I was told by by firehouse 10, just because they're, not even sure- and you know, if you go talk to Mike at O'haras, for example, we went in together and we bought four tanks for basically heaters and long story short he's like I'm, not even gonna use it. It's not worth it. That's why I'm kind of surprised, Colleen. I'm curious I'm going to take a trip tomorrow to Rebecca myself and just watch how they're doing it, because from what I understand with the regulations that I was told, it was the people who are my friends and it just didn't, wasn't feasible, because even that with the storage on top of it they're not going to be able to be open, then when it's colder, yeah I mean build these. Can we just not specify propane? Can we say, like heating implements or something? What else would you do, because the because this city should be paying I mean I? Think we support that part so can't we just say no, but you're not asking for the city to pay right, you're asking for the city to use it's collected to get it for cheaper right wholesale prices, so they well. That's essentially them contributing to the cost. So with the city, then so say they buy a hundred of these heaters. How would it be first, come first serve. How are we saying that they would distribute them to the restaurants or are they buying resolutions? I, don't like leaving too many details, I like actually I'd rather leave details like that to the city, but for me the important thing is just trying to leverage buying power for cost so I think and that to that end we should delete any wording about propane and specifics as to what kind of heating and just say you know that we're looking for support, we're looking for hosts to share in the wholesale prices like a co-op or something actually, it's not sharing the prices, I think just getting reimbursed because you're not going to have the city go out there and buy heaters. They're not gonna, do that. But if we go get the heaters and be proactive with it like I do with mine I just give it the bill to the city or just deduct it off my year-round tax. That's actually not a bad idea, but isn't it an expense anyway and so bill? Isn't it an expense for the business and so can't you appreciate it or write it off. Yeah, correct, yeah 100, but the only thing is paddock. What gets me nervous about you? God you go into the firehouse down the street from your house and you'll, see and just ask these guys and say: hey guys. What's going on and they'll tell you exactly it's just what they're saying it sounds great, but an actual alley. It doesn't fly I. Just don't think that's relevant here. Bill I mean you're. You make a good point and you know look I work with energy storage companies that can't do anything in New York, because the fire department will let energy storage into buildings. So I hear you I. Just don't think that's relevant to this I think we're trying to make cash on hand, expenditures easier for businesses. That's my goal. Bring that off next year that doesn't help you right now. Could we also have a whereas somewhere that includes the thinking about addressing any legal or practical hitches there are in achieving the safety. Have some language like that? We not only are asking for financial help but also legislative help so that we address the safety issues at the same time. Maybe can we do that with a separate resolution? I can either write it for new business or we can do right now, I'm sure no one wants to do it now. Do you mean this to be only about those heating devices or if it does, then, if you're only talking about the heating devices, then they should be in one place yeah once we start getting to safety, we start getting into all the issues that build has been aligned and that's a whole different theme. If you ask me no yeah again, I'm not on your committee but I say, leave out the safety and let that be to the experts that handle that and leave out the type of heating implement that you're seeking, because there are a number there's heating lamps and some of these restaurants over here by me, there are like Plexiglass. Well, I mean you got to be careful with that too, because it depends like how much to the extent that you create an enclosure. You know sooner you're putting yourself inside once you use a certain. You know beyond a reasonable amount of plexiglass, but there's all kinds of things that people are using, so I think we should just say heating and I think that we should not talk about the safety issues. Mariama. Can you see my screen? Maybe all right, if you can't see my screen I can see the screen. I probably should go. Get my glasses too I just wrote: how about we just strike propane I just wrote, assist with equipment necessary to conduct up dining activities. Absolutely I love it, I'm! Okay with that. If other people are good calm, one quick question and again it may just be my ignorance, but at one point a few months ago we were talking about extending the deadline for restaurants being able to stay open with outdoor dining. What is the status of that I believe it's open-ended am I right. It is yes, so there's no deadline. They can operate through the winter if they choose to something we advocated for so I, don't want to take a victory lap but good job, guys, a quick question going back over what you just said: you've taken out the safety issue. It was never in there and I personally believe. The safety issue is a whole different resolution. We're going down a rabbit hole. If you ask me thanks because Bill's right and there's been a lot of consternation among restaurants, about regulations from the city as to how to actually storing it is obviously a big deal. You can't store explosive tanks in your restaurant, it's bad throwing them on the street and Tribeca, and it's it drives me nuts yeah, so I just I prefer we don't address that I! Think we get into a black hole if we do I think but I think in terms of safety. I've noticed all different kind, I think there's a rule about 50 coverage, 50 enclosure and then, if you're, more than 50 percent it isn't elite, is an illegal outside dining place. But now so many places are building places that are tiny and enclosed and buying little tent, like structures that are made out of clear vinyl that actually are putting a lot of people that are putting six people into a very tiny little capsule, so I think there's lots of safety issues coming up, so I think I just wanted to have, since this is about heaters, to have the safety issue for heaters kind of there, the safe that I think that the safety issues around outdoor dining are very complex. They are, which is why again, I would not, at this time welcome a friendly amendment to include safety. Okay, yeah. This isn't really a it's, not really an a resolution about heaters. It's a resolution about support in the cost yeah, so I we don't have to go there at all. So those are the three I guess we're gonna vote on these during session, but these are the three rough ideas of calling their hands up. Oh I, don't know how to use this Diana. How do I give it back to you? Do you want me to call? Do you want me to just call on folks here we go I got it. Let me see here, I, don't actually see anything. I can tell you that Betty's hand is up and Alice's hand is up all right. Can you just? Oh there you go sweet, I'm getting this Betty go ahead, I just I'm a DOT, the I cross, a t kind of person, given the way I hear conversation being interpreted differently by different people. I think we need to do something to tighten up the resolve, for which one the actual resolution itself don't answer the third one, therefore be it resolved that we urged not aware as statement the resolve of the third statement. Yes, okay, if it's going to be municipal, buying power, that's fine, but it's to secure it, so the restaurants can buy it at a lower cost. So the restaurants can receive it. As a gift. I mean it needs to be much more specific about what buying power is doing, for whom yep I agree, don't mind. My typing, therefore, being further resolved I mean look. If it was up to me. The city would give this stuff to them for free, it's, you know it's an awful pandemic, but at the end of the day it's a city in the state. That's forced them to not be able to do business. So in my mind they should be giving this stuff to them for free to help them survive. But that's my personal opinion I think that's a bit draconian I think that's asking a little bit too much of the city and as bill mentioned, you can write it off at the end of the year, but if it saved them, saves them 10:15 on hand, cash costs, I. Think that's a victory. Would you agree with that? I'm not a restaurant owner. Okay I mean it seems obvious yeah, and the question is: what is that buying power? Doing it's to make available wholesale priced goods? Yeah I mean it just that's all the specificity I'm signed off talking about I, don't even know how it would physically work, but that's another issue. Yeah I know, but the city doesn't want to be in competition with businesses that sell these things after 9:11. The government brought all these things that we needed vacuums, Hepa filters or whatever, and you could go to places that were established electronic stores in the neighborhood and go to them. They were like approved by FEMA and get these items at a lower cost than they normally cause. We did it was we did it 20 years ago, I'm going there right now, I like that marijuana it can, but that was very local as well. This is the whole state. My resolution was the city. Okay, it's the whole city, yeah. Sorry, if I'm confused so therefore be mariama. To your point, therefore be whatever be for the resolve. We urge the city government to purchase these supplies on behalf of small restaurants in New, York City to be purchased through a city department, or something like that. Is that how you're seeing it yeah? Is it too sensitive to reference that they develop a program similar to what they did for 911 and Hepa filters? But you know specific to this I don't know so I, like it I think it's fine yeah too I like it too, okay. So if it's okay with a committee, what I'll do is I'll tighten this up after the meeting to reflect these comments. It's actually reflecting the 911 Biogram, which Mariano Mariama, will gladly send me information on so we'll reflect that. So therefore be resolved. One. The urgency to leverage the buying power to assist with equipment necessary to conduct outdoor dining activities, therefore being further resolved. We urge the city government to purchase these supplies on behalf of restaurants, reference 911 buying program from which the restaurants and small businesses can purchase directly from the city. Does that sound? Like a plan? It sounds good to me and make it more broad, meaning not just heaters right, the cost for actually building the structure outside yeah. No, we covered that I think it was I forgot who said it, but we changed it from heaters to equipment necessary to conduct outdoor dynamics perfect solid. This is great work, guys I like this. Oh sorry, alice, yeah, I, guess I just got a little lost I. Maybe what I'm reading here is no longer resolution. So, whereas New York City recently outlined guidelines for the use of propane heaters and the other, whereas about propane I, do think it's important to identify the three types of feeders that are allowed by the city currently, which are electric radiant heaters, natural gas, radiant heaters, important leaders and they're all different and I. Think I would specify them. I do question this idea of just any kind of equipment, because I do think to Bob's next point. These outdoor bubbles are, in fact a form of you know at least what I've read: petri dishes of a certain type, so I don't know that we necessarily want to go on a limb us to opining on every measure, but the three that have been allowed by the city are ones that should be definitely afforded to restaurant owners, and so I would just specify those what are already allowed and maybe be that specific so that you have electric and gas and portables to politely push back a little bit. That's why we're not being specific, because I, don't wanna I, always say with my resolutions: I, don't wanna pick the paint I, don't wanna pick the blinds, we're offering a path or a suggestion to make it less expensive for restaurants and businesses to buy things, we're not asking to regulate what things they can buy. That's not up to us. That's absolutely! No! I'm just saying the city has already made that regulation, so there are only three available, so I would just you know, I think that might be helpful, but I understand your point so that was it never mind, go write it you know going forward thanks, I see no other hands. I'm sorry. Is it equipment and supply because it isn't just equipment they're? Also talking about the supplies necessary to build the enclosures, whether we totally agree or not, it's still supplied, I'm okay with that. So the two resolutions are now one and again this is a work in progress, but hopefully we'll be voting for the spirit on this and again, I am sorry for not having these completely prepared. It's completely on me. I just was just crushed at work, so I'm sorry therefore be resolved. We urge New York City government to use municipal buying power to assist with equipment necessary to conduct outdoor dying activities, therefore, be it further resolved. We urge the city government to purchase equipment and supplies on behalf of restaurants, reference 911 buying program to be purchased directly from the city, but I will I hear all of you. If you trust me exciting that a little bit better I think it sounds like we all agree on the spirit of it. Colin do you mean purchased or acquired from the city? I would love to say, I would love for the city to give it away. I really would but I don't think. That's realistic! No, not sorry that was me, chuckling yeah, no, so I think again, as Bill agreed. If we can even somehow manufacture a five to ten percent savings on equipment, I think that would be a win. So what you're asking the city to do to use its purchase power for negotiation, to be able to get at lower costs by purchasing in bulk to help the businesses yeah I mean I could be completely wrong about the reality of this, but it seems logical to me: actually they don't even need to purchase as long as they make it available to be acquired I, don't care if they negotiate with vendors directly to give a discount if it's being shipped to a New, York, City business, yeah degree yep, all right Colin! Is that the third one, that's the third one. The only other thing I want to mention is I'm open to ideas. I wanted to a resolution on I know they're very touchy with this, but venues are dying. We're losing all I'm a musician. People know that, but we're losing all our independent venues. Bartenders sound engineers door, guys they're, all unemployed, they're, losing money. These venues are going to go away, they're not going to have jobs when this thing is over I, don't know what that means. Yet there's different organizations that are working on this but I would very much like to entertain ideas from anybody on how we can do that next time. I actually think that's a great idea. We can work on it. You know we have a lot of venues in lower Manhattan already. We are on record as not necessarily looking for more large venues necessarily, but we do have world. You know the world trade Center performing arts center. That's going to open. We've got lots of other small venues and places where people have performed all across lower Manhattan. It's one of the things that makes you know Manhattan, so fantastic, even as far as you know, outdoor beautiful things that have happened at castle Clinton, you know pier, 17 and etc. So I think that's a very valued if people have some great ideas, let's take them on, because Broadway doesn't only stay on Broadway. We have lots of entertainment all over lower Manhattan and artists and galleries and sorry for those who don't know. I am a musician and I've played at some of the bigger venues in town, Gramercy, Theater, Bowery Ballroom. Some of the you know more independent venues and I got to know the sound people got to know the engineers, because you know they're all good people. They all make. You know 7.50 an hour, 10 bucks an hour. They depend on our tips to help them out and they're all unemployed right now, and not only will they not have do they not have jobs, but those venues are collapsing represents is one of the larger promoters in town they own all these venues, but these places were already going under before the pandemic and I just Tammy's a hundred thousand percent correct. That's what makes New York his entertainment is. The art says music and I'm not getting emotional, but this is something we need to work together to save I, don't know what that means. Yet so I would definitely entertain ideas. Yeah I think it's not it's something that I I'm gonna give an Oma shout out to Tom Goodkind. He used to bring his dvds and hand them out at Christmas time to everybody for his band. So yeah we have a long history of supporting the arts in many different ways. So, let's think about that kind of stuff, and if we can figure it out, I mean I will say you know. If anybody goes up to trader Joe's up on Spring Street every weekend you can hear a lovely band playing on the street corner across the street. At the cafe, so I mean people are dying for work yeah. Absolutely! That's it for small business group. I! Look forward to no! You can't go anywhere yet because we're gonna take a vote on the three. If we have quorum for executive, that's how we're kicking executive off- oh so Tammy we're only one short of a quorum executive has done wonderfully with quorum. How do you want me to do this? Do you want me to take all three at once? I'm if we have no objections. I would take all three at once. Yes, let's just see who we've got for quorum, so I've got me Colin I, see Alice I see Bob who's going to represent battery park city tonight I see Brittany on Hey Bob, yeah Bob. That's right! I've got Elizabeth Lewinson for personnel. I've got fern. Are you sitting in for Patrick today, Patrick's on nope? Oh, that's, good, okay, I got pat I got Patrick I got Paul I, think I have quorum. Yeah, of course, only one short of a quorum. Have me: I got Susan yeah I, see Susan. Are you sure I'm one short one of my quorum for but I don't want to say who that is well, I'm here. Did you put treasurer I got you for treasure, Marianne, okay, yeah, we're great. We have 13. yeah, that's what I thought. I'm like I, add I! Think I'm good all right! So I met one short of a full roster. So sorry, well Hell's bells! You know we at execs show up what can I tell you all right so with that hi everybody Betty Diesel have your hand up from before, or do you have a new question? Okay, stand us down! We have a member of the public with a hand up Dimitri dynamite. If you'll unmute him before we go to call a question. Let's make sure we've got all the public hands taken care of I'm fine! Thank you very much, okay, fantastic! So without that, if I hear a call, if I call for the question, do I have a second fantastic. Let's take all three small business working group resolutions together and because this is not full board, we're gonna go the way we normally go. I will assume everyone is a yay. If you are a nay or you are an abstention or a recusal I. Ask that you, please say the name your vote and which one of the three okay so do I hear any names. Okay, do I, hear any abstentions. Do I hear any Recusals fantastic motions passed unanimously. Thank you very much Colin and thank you, the small business working group for all the work that you're doing God knows we need you thanks. Everybody appreciate it Dana. How do I do this? You stop sharing or we take it from you. I can't stop sharing I'll, take control from you. Take control, okay, all right, you're, all fat Tammy. Thanks again everybody that was great I appreciate it, not a problem Colin. Thank you! So much all right! Lucian, if you don't mind putting the executive agenda up, that would be great got it working on it no worries. Okay, so we are going to roll into the very first resolution, which should be super easy. Our task forces are only a one-year commitment and our working groups so for now in order, so we don't have to do this in December we're going to renew the street fair Task force and, if you're asking me why I'm going to tell you that we're hoping in 2021, because I'm an optimist that we will get back to the potential of maybe being able to have holiday, fares outside or anything and everything on the outsides. So if this is just a business part of renewal for the Street fair task force that runs January to January for 2021, literally that's what the resolution is. That's it say anything. Yep I was about to recognize you and say: Darren. Take it away. If you have something you'd like to add no nothing to add. This is a resolution that we pass every year around this time of the year and I look forward to continuing working with the street fair task force in 2021, and you know, as echo family sentiments here, that you know the last we heard possibly summer onward. Might work for street fairs, I'm a little, probably not as optimistic about that time frame, but we'll see what happens so, maybe the second half of the year we'll have something exactly anybody have any questions on that for Darren or myself. I see no hands of board members. Would you just text to this resolution yeah if you've got it, let's put it up absolutely okay, so you see where we started. It's a task force. It's really, basically how it rolls for anybody who can't read it I will because you're on a telephone. The therefore be it resolve, says people one pair by authorized. The sponsorship of street fairs by CB1 in 2000 in 2021, to raise funds to support the work of the organization, extends the existence of the task force for an additional year, subject to appointment of members by the chair of CB1, provided by our bylaws grants. The task force the authority to determine whether it's appropriate to solicit bids from street fair promoters, which is something that they have to do. Forestry fair is sponsored by CB1, following an evaluation in manner which the current promoter has performed, its obligation with respect to post-pandemic street fares and any proposal that promoter may choose to make in order to conduct okay. Can we call a question? Do I have a second I? Second awesome. So on that point again same thing as we did with small business working group, if you have a concern or you want to abstain or recuse, you say your name and then you would say the vote all right. So if I do not hear anything, I'll move to the next topic, so you do not have to say in favor. Do I have any nays do I have any abstentions? Do I have any recusals question passes moving on I'm liking? This is as productive as if we've been okay, 13 Harrison Street I have Jason on yes, I know. Bruce is not necessarily here tonight. Jason you with me, and can you present about 13 Harrison? Would you like me to give you presentation controls? Do you have any materials that you'd like to put on the screen in the meantime, I'll see if I can't get the slides and throw them on the screen yep, so I can give you only the information that I have thus far 13 Harrison was presented at the Landmarks Committee this month for those who attended. This was a large dialogue that went through and we have received subsequent information since the meeting, which is why this has now come into executive, because the resolution as passed in committee was not complete. What we have learned in our experiences with getting things scheduled at LPC is, if they are on the calendar. We really do need to move this here into executive to make any changes that are needed. So our vote is on record and with that let's see where we are okay, I'm actually going to even call Jason and make sure if he has stepped away that he's back. Bruce is on too but he's in attendees. Thank you for finding Bruce. Can you move Bruce over? Can you guys talk? Can you move Bruce over or talk about the retail yeah? Hey Jason here you are Jason. Is it you or Bruce I? Think? Can you hear me? Can you hear me? I can Loudon come here Bruce. We need to move Bruce over. Oh no, he's here. Okay, so he didn't want to do it. He was unless it was after seven. So let's give him a chance. Otherwise, I'm here, can you hear me? Yes, no, oh I've been trying to speak for the last 20 minutes about but I just couldn't I couldn't get on. I was a panelist or I was a reporter or something okay you're on take it away Bruce. So this was an interesting resolution. You wouldn't think it was that important, because it's a relatively small building, but there were issues when the presentation was made at the landmarks Committee. However, it was represented that it really isn't visible from the directly in front of the building, which is in the Tribeca West historic district and the mock-up is what they show with tape as to how tall it will be in the messing of whatever it is appeared. Relatively smaller I don't have the deck with me. That shows the side angle, the view card or from greenish street, but there was no mock-up. When the presentation was made. They then put the mock-up up or back up for three days. It came down, Saturday I went and looked at it twice, and it certainly was not only very visible, but in the context of the block, as you can see, I think the block is absolutely. You know one assembly with no encumbrances from staple all the way to Greenwich and around it's the perfect 19th century late, 19th century Tribeca, landmark district block and while it's hard to see all the red is the mock-up, it's very intrusive. That building happens to be in a set of buildings, as you can see that are almost identical same era even same street front. Equal cornice and I did take a little video, which I hope can be shown at the full board meeting. So I wrote one resolution as voted on by the landmarks. Committee and I wrote another resolution based on the what I consider new information for the executive committee. I spoke to our parliamentarian and it was difficult to just to abandon the resolution at the full board meeting is difficult because one is an approval and one is a rejection. It's not like an amendment. It's not like a adding a whereas or adding a qualifying word and I mean you could read what I wrote for it's short, you can read what I wrote for the executive committee, so this was the only way to handle it at this hour, so Bruce, the red part. Just so everybody for executive understands the red part is what's being shown as the mock-up and the applicant represented at the meeting that it was not visible from the street. No, they represented. That was not visible. Looking due south from in front of the building on Harrison Street, but this is the corner of Harrison, Street and Greenwich. This is the end of the block, it's very visible and it's even more visible. If you pull out in the context of the whole block. I don't know if we can do videos in the meeting, but it's like a four second video panning, the block which really gives a context to the map. So what they're building the length of it is like totally visible. You know, that's it's a big and it's 28 feet high, so no I could be overly strict. However, also it's like a two-story sloped glass facade, which you can see in the prior picture. They said you wouldn't see that from the street, but of course you would looking at the mock-up and going back to the plan view the front of it. If you can go back there, you go it's hard to see there there's in doing a contextuality program in the deck which every if which every application does there wasn't one. There wasn't one example from the Tribeca West Historic District, Greenwich Village and Hudson Square, but there was none, probably because there is none like that. You know it's a contemporary glass erection on a 19th century block so that that's something to deal with I, don't know exactly how all right, so we've got hands up, let's go through hands up and while we're doing hands up Lucian, would you please put the resolution that Bruce sent up and Susan Cole you're first I think they were disingenuous at Beth best I, don't know how Jason and Bruce feel I walked by as well so I mean I, don't think they told us the truth. That's all I wanted to say. Susan I have to ask you something because I feel I. Never do this. I have to represent the committee regardless of my feelings, but you do I'm glad you look. You felt and noticed the same thing. I did there was a big difference between the markup and what they presented right. Yes, I thought I was nuts I walked by to look okay. Jason. Did you go by I? Didn't do this in this chance, but I. You know we saw this thing happen kind of a couple months ago with the garage building and exactly you know. We just need to protect our voting rights here, but Jason I do want to say that the applicant is on the line. I see his hand is up so I'm going to give the applicant an opportunity if you I don't know if Dimitri is with the applicant or not, but I know bill was the applicant, so let's unmute bill who's in the attendees section and Dimitri. If you don't mind chatting with the host and letting me know what your hand up is for that would be great, so loose, oh I think I am the host there. We go bill, you're, unmuted, hello! Thank you. It's awfully painful to hear somebody say that they think I was not being truthful or disingenuous. At that meeting, I was quite clear that we could see the mock-up, because the images you're showing now are the same that you could see it from way. That long view all the way from Greenwich I, don't think anyone can see it. I know you can't from staple street or from Hudson or from out front. So, let's you know, I, don't think it's quite appropriate to paint me with a brush, as if I was paint pulling wool over anyone's eyes. What's left here we put the bat and the mock-up back up out there in total desire for you to go out and see it. We had tried earlier to get you to see it, but we had communication issues not getting through to the board. Secondly, let's be clear too: if we were to pull up the section, we would see that it is only a one star addition: the 28 feet includes the bulkhead to the high roof. There is really only 16 feet from the first portion of the addition and then the remaining pieces, the bulkhead for roof access, may I. Add that if you notice the, whereas that I wrote I didn't cast aspersions I just said upon viewing the maca, the proposed condition appears larger and more visible than presentation. Materials seemed to indicate that's painful, to even read that Bruce I have to say, because the mock-up is built exactly as the presentation materials show. The photographs are as real as what you saw and I'd be happy to see your video, because I'm sure it's identical well, let me say that without casting aspersions that when you say you know in the distance, far away three buildings away from the maca on the corner of the street, which is a totally legitimate view, Carter. In fact it's significant, that's where these pictures were taken. So it's the minimally visible far away Bruce. That's the minimally visible one put them both up there there's a short one from the trash can, which would be the normal corner. Had the independence closet building been built out to the street line, like all the rest of the community has been built, but in this particular case, independence Plaza is back about another 100 feet, so there's a longer view. The thing that you're looking at that you think is large is from that larger view, and you will be seeing party wall what's red netting. If you were to bring up our rendering, you would see, is going to become red, Brick Party, Wall Brick, like everything else, and can I ask a question: is the yeah sure guys, the orange that we see in Bruce's picture, or whatever picture was up here before a representation of the bulkhead of the building? Yes, that's the bulkhead poking up in the first place. Let's get that picture up again, please well, Bruce did you have your own photo just to be clear about which photo you looked at before I would like to know. I'm unclear now which photo of the View Carter Looking East, is being presented. I took a number of photos. I took a three second video and I, sent it to Jen and asked that Jen show it at the full board. Meeting I, don't know what is being is Jennifer here, I got your Bruce, the photo was there, that's that photo. There is the one that's from the trash. Can that's closer. The next image is the one that's back at the face of the building. I. Think there's all that. Oh that's! This is the one yeah. This is I'm sorry. This is the one that's on the corner. You can see the street side we're standing practically next to the sign the next one, that and in this image all that's orange is the bulkhead. When you go to the next image. Okay, it's just moving back closer to this one. Now we're back closer to Independence Plaza and the side of this is brick. The upper piece is the bulkhead, the lower portion spring and bill. That picture was in your presentation, correct. This is the picture from our presentation. Okay. Well, then, I don't feel like I, don't feel like you misrepresented, I'm just going to say my being there I, don't think you misrepresented if you showed this picture in the deck I can't really say that you didn't I appreciate, there's an integrity issue. That's important here that this meeting kicked off. I mean addressing you agree if he I never use the word misrepresentation. I just saw when I saw it. Okay, let's bill I apologize for that, I'm sorry all right if I misspoke so I, think the next I want to recognize hands up to make sure that if anybody else has hands up or conversation before we go through this Colin kind of off the beaten track here. But if this is built, where will the labor come from? Who will you be hiring and can you make it local? Yes, it will be local. All right. Cool bill is a well valued cp resident himself, all right, which is why I did not cast aspersions exactly all right. So, let's see I'm going through to see if there's any other hands up, I don't see hands Dimitri did you want to speak on this I am unmuting you thank you Tammy for Tribeca alliance. We have no opinion on this at all, but just as a an owner on Harrison, Street I think any investment in our community is welcomed and I think Bill's design is pretty cool actually and interesting and I think if that turns into a beautiful whole design. I'm it's a welcome addition to the neighborhood. Thank you very much. There is a letter that was sent by it by a neighborhood resident who doesn't live on the block, but grew up here who was very upset about it. Her view will be blocked. Her line window won't be sealed. It has nothing to do with you know not in my backyard and I guess, I told her. She should speak at the full board meeting. So there is the. There are many opinions, but I do hope is I, don't know if Jennifer is here, but I would like that little three minute. Three second video to be shown at the board, so you can get a full sense. If that's possible, we will work on that for you Bruce, I'm, not the Lucian's, our tech person. He knows what we can and can't do. I just know how to push buttons. Thank you. That's what I'm really good at all right, so I think we do need to I can say that I corresponded a lot with g h, who's present the attendee section. She may we should be unmuted, but let me find her no problem. J R H, a k, I yeah I am unmuting. You now I apologize I, don't know how to pronounce your name: Ms Chung, Jihae hi. This is Paul Chong. She is a husband hi. How are you good? How are you so we're owners in 11, Harrison Street we're? We will be directly getting impacted by it by this. So I understand why line windows don't have legal rights or whatnot, but I guess what I'm concerned about is how they're going to attach to the building, because when seven Harrison was constructing their or regarding that entire building, it created a lot of damage to the East side wall of eleven Harrison and we're worried that they're, attaching on to this building on the West, Side Wall and that'll create a lot of damage as well. So we'd really appreciate if we could see like a final drawing that they're going to be filing with and to confirm the measurements and confirm all dimensions, I think that's something that hopefully they'd be okay, providing us with. Happily, we won't be attaching to your wall they're separate buildings, okay, and that includes that build up too. You won't be attaching there. No, we will not need to attach to your building. That's your wall. We have our own wall. How much space will be there between that I think I end up with an inch at the top due to earthquake or criteria. There'll be a little space between my wall or this 113 Harrison Streets, Wall and 11th, based on earthquake code, I, understood and then one other thing. I was just like you're proposing a parapet and it is going to be blocking that second window behind that or it's our kitchen window. So I don't know like what exactly your detail is there, but we're putting up a louvered screen to hide air conditioning equipment, and we could very easily work with you to put a device outside to make it so that you can still see some sky from that window, but we would have equipment on top of our bulkhead. Not the bulkhead I mean that, like that part after the sunroom that you're building that little roof deck before the bulkhead, you see we have a window there and in your pictures there too so from what I'm trying to figure out is like is that floor. Gonna run right up to that window. I'm sorry, I, don't understand exactly where you're talking about. We could point on the photo would help me I, don't know how to point out yeah. No, he can't point picture four. You see picture four. You see behind the fence. There's a little black window yeah the upper one will be looking into the this mechanical area, where the condensers for the air conditioning equipment will be the lower window. That's in that lower left area behind the orange will be fully blocked by the bulkhead. That's the stair tower coming up, so that will be covered. Yes, that you will lose that window. That long window will be lost to the stair okay. Can you just confirm that with my arc or like make sure? Yes, it is George. I have been working with George, yes, okay and we adjusted dimensions to make sure that we could keep your living room lot. Lined windows with views, I think George is on as well I, don't know if he had any comments, but George is on so I will undo George and again we're not here to negotiate between the two of you just so you know, so we do want to move it along George. You have been unmuted. Thank you. Yes, I apologize I, don't mean to sound rude by that, but no totally understood yeah just to clarify I was on site with Bill's staff, and we did see that the infant window will not be completely covered. Paul I think those misunderstood the question there and there's nothing different here from what he's proposing for so just bill. In speaking with your staff, the the parapet, you would express that you'd be willing to modify the parapet to make sure it does not hit the window. I looked at it with your staff, and he said it looks like it will be possible with Marcos Correct, that's correct. Yes, the only question is: how can we, how can we verify that that you're making that change? You know? How can we see it made? There needs to be a modification to that detail, somehow we'll share drawings and dimensions with you, okay and prior to the landmarks hearing. Yes, okay, that that's where I'm going to update this package before then we'll send it to you, as well as to the committee okay, so the package will be I. Need you to yeah the package. Thank you before tomorrow's meeting, not for tomorrow. No I'm sorry not for tomorrow's meeting. I'm updating this package taking into comment. Well, your previous resolution, Bruce normally what I would do is take in the comments that the community board makes try to make some adjustments to our design to reflect the community board's comments expecting a positive resolution and present the landmarks standing there. Knowing that you asked us to work with landmarks, saying that I got ahead of it. I've already made some adjustments here. They are now I'm getting a negative resolution in it. So it's you know a little tougher, but we're going to make some adjustments because we guarantee that to the chunks next door so that we don't hit their window. Okay, Bruce. That puts the ball back in your court George. If you are all done, I'm going to put you back on mute. Thank you. Yes, I am I would say this. I'm prepared to you know, move forward with the modification with an amended resolution from landmarks, but I would urge the committee, the Landmarks Committee, especially to look for themselves at the mock-up, is the mock-up. Still up I was told it was only going to be up for three days, we'd like to take it down. It's still up right now, so you can keep it until tomorrow's tomorrow night's full board meeting. Yes, it can still be there. So I would ask that we circulate a circulate, a an email urging the the Landmarks Committee to walk by it's not in a remote part of the district, so Bruce the question is and for our parliamentarian. What are we doing with this resolution tonight, as we usually do? I would like to ask those people who are on the Landmarks, Committee, Jason and Susan I, don't know if anyone else on the committee is here and maybe Alice can weigh in as an architect. I would like to ask them what they think we should do. I would like to I like the idea very much of writing into the resolution, the part about making sure the staff people get off their tushies and come and see these things. Because- and this is not it's actually more less forbidden more for the application that we did this week through before no one ever came and saw that thing over the garage I guarantee it and you know we have to they- have that's part of their job and it's not bill's fault really. If he keeps it up and it's windy and doesn't want to create. You know dangerous situations for the neighborhood, and so I'm with you on that Bruce and I. Don't feel and I see the visibility issues. So I'll leave my vote for the full board meeting and then whether I, like the visibility or not- but I'm not gonna, talk more about that so Jason. The question is: what I need to know? Are we doing this resolution or not? Are we changing this resolution that includes this is a recommendation to reject it, except for the canopy Susan, but originally Bruce. You wrote one that proved it with the visibility. No because well, there's mention of it, but I hadn't seen it I mean the original resolution is also in the packet yeah and we originally as a when we sat at that table. We actually came to a conclusion that we were okay with the visibility as presented. Yes with asking Molly for LPC to work with the applicants to try to lower the height I mean I, just find it hard to do this without anyone having looked at the mock-up, which is impactful in a way that you know that's unusual, especially for such a intact block. That's all I can say so. I have no further remarks except that, given what I'm hearing, maybe we should strongly amend the original resolution of the board agrees and Susan. Do you have any I'm with you Susan wherever you go, Bruce am I hearing that I could alter. The therefore be a result say approves this record this resolution and recommends the Landmarks Preservation Commission to work with the applicant to continue with the height. No I would object to that. If, after seeing the mock-up people want an appropriate resolution, then I would it would be approved resolution, but with strong caveats stronger than what you just said illusion that would be my. We have from last week a resolution that approves it. There was a dialogue at the meeting last week that said that people were concerned and needed to go. Look at the mock-up, so that was you know the last conversation. Then people want to see the mock-up only two. This will be amended at all board. Then well, that's the parliament. That was the question that the parliamentarian Jd lit by the way lives at 11 Harrison and wanted to speak. So I'm going to unmute you Jd! You are unmuted, I'm on. Can you hear me I? Can oh okay I have no idea how to utilize this interface, I just dropped in because I actually live in Levin Harrison Street and one of my neighbors who lives actually somewhat higher in the building is more impacted because he has a couple windows. We don't we're on we're not on a floor with west facing windows, but but I appreciate the seriousness of your conversation and the seriousness with which you're taking the proposal and I mean. My basic concern is obviously that it that if there is going to be an addition to the 13th street at 1311, Harrison Roof that it conform to the architectural codes of you know this landmark street and these landmark buildings- and it doesn't go too far straight from that and that the people who do have windows that are west facing perhaps are not adversely impacted by this, which sounds like. If there is something built there, they will be to a certain extent negatively impacted by that. So they're. Obviously, you know those issues as well and also that we, since there was a major renovation at 7-9, Harrison Street a few years ago, with that the building on the corner of stable and Harrison that negatively impacted our east wall. We want to make sure, of course, that on engineering terms, that whatever is done on the roof of 13 Harrison, if there is something done, does not negatively impact engineering structural levels, you know our building at 11, Harrison Street, that's crucial in terms of our West Wall anyway. Had the applicant to had the applicant talk to you prior to this and made any you know, introduction or discussion personally, I've not had any communication with any anybody at 13 Harrison about this I, don't know whether one or more of my neighbors and my building has possibly, but so that's I, don't really know much more beyond what I've the architectural drawings and that I've seen online and that's really it so. Thank you thanks. Very much is Alice listening, I would love to get her opinion. I know we're. Checking this out. I would actually had a question. I, don't know for bill and or for you, but I just was curious. No I don't have an opinion because I haven't been by there, but I certainly will go tomorrow, but I'm just curious. What exactly are we talking about? Is this too? How hot? What is the floor-to-ceiling height of each floor? Is there two floors that are going up? Well, there's one floor, that's being added and then the continuation of the stair tower and bulkhead to the roof of that, so we're adding a story and how lar how what is the floor-to-ceiling height of that story? Well, we need to bring up our deck again. I. It's well I think it's 12 feet, I think the first story is 12 feet and then the next one is somewhat similar, not quite that tall to the top of the stair tower and then there's about four feet of louver. On top of that hides the mechanical equipment. Well, I! Guess that's right! The next I'm sorry I'll scroll down! I'm just going to ask the question bill. Is there any you know? Is there any room for modifying this at all, so that you know it's less of a Florida ceiling height or that's, not real I think on the top bulkhead. That's where I am that last piece is the piece that we're trying to shrink now in advance of going back to landmarks, responding to Bruce's comment from last week's meeting, seeing what we can do to pull down both that's the bulkhead height and the mechanical equipment, and what about the actual size of the floor to seal? Well, the 12-foot Florida floor for that expense, I, don't even get a 10-foot ceiling by the time, I'm done. Okay and that's going to be the main living floor of the house since all the other floors of that building were built with such small windows, given the history of the building in its original purpose, small windows, but the okay correct, that's correct, no light! That's why we're taking the public force at the top of the bill to get light? Okay thanks! That was my question. Thank you let's! So here's Bruce the question of where we need to figure this out. If you are not doing a resolution from here now right, then we need to move on if you're going to amend the one I'm going to listening to the comments there isn't a strong feeling, I mean Susan saw what I saw that's two of us, but there's some. You know, ambiguity about how the committee feels I think now it may be best to try to amend the original resolution. You have one remaining handout. Just so you know I'm sorry, Mary Emma, you have one remaining hand up just so you know George Showman, actually George spoke before I haven't taken his hand down. George is the architect or architectural consultant for the existing tenants in the other building, but I do want the other. I'm sorry go ahead. George. Do you have anything you need to add whoa Bruce you're flashing? No, thank you! No! You covered me. So I'm gonna all right! I'm muting! You back! Thank you! Mariama but I had him so I'm gonna, clear his hands down so I think that what you need to do is based on having been at landmarks and unless our parliamentarian thinks differently, you need to come up with the friendly amendments yeah based on the dialogues that can be added, because, if you're still approving it with the notion that bill correct me, if I'm wrong, you are looking to lower the bulkhead and lower the overall height to be less visible. Correct bill is the glass I couldn't tell from the mop up so the glass, the long glass glass, the facade, that's not visible from that Greenwich and Harrison View corner, not really the side of it. The masonry wall that closes the glass piece off is what you're going to see from over there. The party wall of it, but I do want the hour that I spent traditionally on that this executive committee I want that hour, back I'll, never have it I give it to you Bruce. You owe me for me answering the phone at the soccer field. That's all I'm saying all right! So thank you very much. You're gonna yeah you're done we're gonna, rescind that part of it was not a resolution that was passed so it'll go away, and the resolution from committee will stand. Please get your friendly amendments based on this to Jen, so she can have them ready for full board tomorrow and with the CitiBike I, leave it to Mariama. She will represent me goodbye. Thank you, bye, Bruce, thank you. Okay, oh gosh, Bruce I think I need to mute, Bruce, okay, so we're headed back now to the agenda, and the next thing coming up on. My agenda is small business. All right is D.O.T cargo by proposal on Warren Street. So there's been a lot of activity on this. I'm gonna pull up Lucian! Please! Let me know if you can pull up the letter from Commissioner, Pinkar or I need to I got it okay, so we have had a robust dialogue. Betty started the process in transportation and it was a very robust dialogue. We asked for more information and we also asked for neighborhood feedback. We did receive both a letter from one of the neighboring buildings which Lucian I hope you have that one as well and a letter from Commissioner Pinkar. So this is an update and I do think. We do need to do a resolution to be on record, because that's how we become on record for everything that happens with the city agency, so this they came in around the same time to me. So, let's start with this, this is an update from Commissioner Pinkar, saying that they're basically doing the bike, the car, if you can scroll down on the letter lotion, okay, so you can see and I can annotate so here where I've highlighted. Basically, after going through all of this, they said that they have done detailed information about the proposal and in-person outreach to the stakeholders on warranty. We have a follow-up from one of the stakeholders after the comments during outreach, and they understand that we still have com concerns they're deciding to move forward with the implementation of this project. This fall, which means this month, basically for a six-month pilot, so keep going to the next. It says during the pilot evaluation period, DOT will monitor the area, keep CB1 updated on its operations and they've made some modifications, they're shortening the corral from 120 to 100 feet and who addressed concerns about loss of overnight weekend parking. So that's only five spaces instead of six they're going to require whole foods to keep the bike racks on the sides open for public use. Dot has confirmed whole foods plans to phase out the vans at this location by the end of the year. If the corral is installed in November and DOT is separately from this project going to look for opportunities to restore parking on surrounding areas. Next, can you bring up the letter from the local constituents and Jd Victoria? Was it Jamie's yes, and for everyone who is on this call, please note that to be recorded for what you need for the public record. We do not record the chats, so you must be verbal to identify yourself and speak up much as you would at a public meeting all right for Jd who has sent me a quiet note about something else. I, ask you to email, the Community Board office and speak with Lucian, Reynolds and I will have him, put contact you and send you a okay? No thank you. You're welcome alrighty. So if you can, please Lucian find the letter. I have the email that was sent today, but I don't want to show his email address, so I need to export it to a pdf. You got it so, while we're waiting for Lucian I will say that we have been working on this for a long time and looks like we'll be working a little bit longer, I'm going to start while Lucian is getting to pull that up. We had Rece I'll, tell you what it is: a letter that came to us from the property manager from the Warren Street Condo that the bike corral is right in front of at 99 Warren. So it's he represents 99 Warren and 101 Warren Street, and I'm not sure if he's on today, I will take a look through the chat. If you are Jamie, please put your hand up. So it has many of the same concerns that we have had as a board. Jamie I see you gotcha, okay Jamie, you can speak for yourself. You are unmuted and we're trying to work on the pictures to get them up. Go for it thanks Tammy, so I do want to address a couple points from the Department of Transportation letter before I. Do we certainly respect everything that they've done thus far to try to help carbon emissions and everything like that? But from my perspective, as I mentioned right here, no one in the building was surveyed. I certainly wasn't surveyed, the staff wasn't surveyed, so I'm not sure if that's a valid survey. Secondly, on the as you can see, if you scroll down on the picture, they forgot about 99 Warren Street, which is kind of a big oversight, particularly as they said that they did a traffic study. They forgot about a fire hydrant, so we actually measured, there's 98 feet that cover that whole foods area. If you take out the fire hydrant, which is 15 feet on either side you're down to about 65 feet of usable space in front of whole foods market, unless they plan on blocking the fire, hydrant there's also significant bus activity, but I'll. Let the residents themselves speak on their concerns. Quite honestly, but in speaking of the disappointment that I personally have for how this has been presented in the letter that you had just pulled up shortly before it's something as simple as a letter dated today being the 23rd of November, with a promise that, if it's built by the end of November that whole foods will not have trucks at the end of the year. So I'm not sure you know what the point of that is when clearly, I'm assuming they're not building it over Thanksgiving. But it's just one more step of how this has been presented as an option. Then they say they're going to do it anyway. Then they say: oh well, we're gonna, do it, but make sure that there's less trucks by the end of the year, but only if we have it built in the next two business working days. So my concern both as a resident of the neighborhood and obviously a representative of this building, as well as other buildings in the area is, it doesn't seem like the input of the residents or of the community board, is necessarily being taken at face value and they seem to be just saying: whatever is convenient in that time, I see Annalise. Do you have anything else, you'd like to add Jamie? Are you all set no I mean I may say something later, but I think it's time for the residents of this building, which are going to be most impacted, as well as some of the Ptas and other things to be able to speak. Thank you, okay, Annalise hi, can you hi, I'm speaking as a mother of 101 Warren as a mother of ps234 as a mother of children who use the community center as a mother of kids who use the ball fields and a mother of many kids at Ps89 that this is really not a good idea for the safety of the met. This hot the street is super high pedestrian traffic. It is the really the epicenter of children in the neighborhood and I spoke to the principal 234. I spoke to Bob Townley at the community center is extremely concerned just as a few examples. Kids at 234 line up on Warren Street morning and afternoon for drop off and pick up. Fourth and fifth graders are allowed to walk to school alone and leave school alone. The bikes will be tearing down Warren Street the wrong way, and it's just really an accident waiting to happen. You've got kids accessing the ball fields, hundreds of children's a day, children a day going down, Warren, Street and meanwhile you know whole foods and Amazon can afford to relocate their refrigerators, which is really their biggest problem. They just need to relocate their refrigerators to their Murray Street Loading docks, which is an industrial loading dock area which is more appropriate for the commercial activity of messenger bikes tearing in and out and I. Just I don't want to see a kid get struck and then we all look back and say. Why did we allow this to happen? I'm very concerned even for my 15 year old son, the teenagers are almost the worst. They walk around with their faces and their phones and in something will happen. It's completely unnecessary. This is a residential street with high pedestrian traffic, so I'll, let other people talk. Thank you, Annalise, I'm going to Allison Bowen and then Todd, J, Middy, Allison, you're unmuted great. Thank you. Can you hear me? Okay, just fine, terrific, I'm also a mother in the neighborhood, my two of my kids go to P.S 234. We also use the community center across the street and go to downtown little league and downtown soccer league across the street as well and I will reiterate what Annalise said about this being an incredibly heavily trafficked block, because it's the main access for people going to the east for Ps 89 or coming from the east for the ball fields, as well as people going across the street for Ps234, and one of the things that I really want to point out for people who have or haven't walked around the building is that there are three large indoor cargo bays at this Amazon whole foods, location that are perfectly capable of handling this requirement. I mean we're dealing with Amazon here, one of the largest and wealthiest companies in the world and what it seems like is they don't want to reconfigure their store to use those cargo bays, because it's easier for them to load on Warren, Street and D.O.T is giving them an opportunity not to have to spend that money and instead spend the public money and take public space when Amazon could spend their own money lessen the safety risk and use the space. They already have as another point that I want to make here, it's frankly safer for the bikes on the bike corral to be in a protected area in their cargo bay instead of out here on the street, and then one other thing I'd like to say is you know we say this is a public space, but it's right outside Amazon store, so it's going to be used by Amazon I mean they do deliveries at all times of the day and night and in terms of needing additional bike racks. We have plenty of unused bike racks on Brennan Street on the other side, by the main entrance of this, the whole food store. But, frankly you know, bikes are abandoned there and other things are locked to those plenty of time. I mean I. Don't think that this is a public benefit to find this corral on Warren Street, Gotcha Allison. Thank you so much we're going to Todd, Jay, Middy and then Patricia, then Adam Weiss, then Jungmin, then Emily. If you are repeating what someone else has said, we encourage you to say: I agree with Allison or with Jamie with Annelise. You do not need to repeat everybody: Todd you're unmuted. Thank you Tammy, and thank you to the executive committee for hearing our voice tonight. You know a little bit of history and I'm also struck by the prior presentation where we, your committee, was focused on the preservation of the neighborhood Warren Street is not I repeat, not a commercial loading and unloading zone. Whole foods is treating it as a commercial loading and unloading zone when they in fact have a designated specified and quite generous loading and unloading zone on Murray Street. We're here tonight because way back when whole foods first opened their design included a large walk-in refrigeration unit at the Warren Street Entrance to whole foods, and that's when it was kind of a sleepy delivery service where people would put stuff into that refrigerator and be handled and delivered later in the day or by Vance whole foods, and now Amazon have refused to modify their space to reposition that refrigeration unit toward the south part of their store, which goes toward Murray, Street and so Murray Street, is where their storage, fulfillment and dispatching and distribution should be taking place. That is where a loading, commercial, loading and unloading area has been designated by zoning and by the original sponsor that built it, and when you go and look at it, and we have pictures of, it- is not only underutilized and not optimized. It's just being used to probably illegally store a refrigeration unit or such a refrigeration truck. That's not being used so they're expanding their space, and so I think people need to take a very hard look at is the space that is fit for purpose for this particular use of using bikes or whatever they want to use being used, and the answer is it is not so why should we as the community and neighbors suffer for the fact that whole foods is not willing to change the design on the interior of their store? I do not believe that Warren Street is zoned as commercial loading and unloading. If you look at Tribeca and you can see where all the trucks used to back up on the streets into those loading bays that used to exist in Tribeca, that's how that used to be but Warren Street as it's been built now between West, Street and Greenwich, is not commercial loading and unloading and I'll also add that we all want to applaud the hand carts that were brought in by whole foods. The problem is: there's many of them they're running over people that are walking down the street not literally running over, but they run into them. They take over. They move fast everybody's got to get out of their way now you're going to augment that with bicycles that are going to ride on the sidewalk, whether we like it or not, they're going to ride on the sidewalk. There is absolutely no necessity to places by Corral on Warren Street zero. It could all be done on Murray Street in a designated area, be out of everyone's way and there'd be no contention from any of us on this call. So we're here scratching our heads puzzled by why we're even having this discussion, particularly in the letter, that's up right now on the screen. If you go to one of the first or second paragraphs, it talks about the bicycles being in a commercial loading and unloading zone. Great, that's not Warren, Street, that's the area. It is. Thank you very much. Thank you, Todd meeting you by the way what they are talking about is there is a commercial loading zone that is 7 a.m, to 6 P.M Monday through Friday at the side there. So just everyone remember that is actually existing Patricia. You are unmuted and then, after you comes Adam and then Jungmin Emily, David Tanya and the list is growing, go ahead. Patricia, I'm putting her back on mute. You can chat to me if you come back. Okay, Adam Weiss, you are unmuted Adam, I'm muting you back Jungmin and remember before I unmute John mean if you agree with someone. It is good to. Let us know that, but you can put it either in the Q&A, where other people can see it, but the only the host or the presenter can see the chat. So it's not public record John, Min, you're, unmuted, hi Tammy, it's nice to see you at these meetings. It's lovely and Andrew Zelter, also lovely to see you I. Thank you all for your service on the executive board of CB1. It's for people like you who devote so much time to our neighborhood that we have the wonderful neighborhoods that we do as a resident of 101, Warren. Street I strongly agree with the previous speakers, but I the different thing that I want to add here. The two different things that I want to add here are that, with all the construction that recently completed on Warren Street, we resume the service of a number of bus lines down. Warren Street the M9 bus comes along as well as a downtown connection, which only adds to the congestion of Warren Street. Those are two bus lines that are very popular, that bring people from battery park city to whole foods and then take them on their way. So that is something to be considered strongly and those bus lines were suspended because of Warren Street Construction. So we are now enjoying those bus lines again on Warren Street, but only to be complicated by this new bus depot. So that's point one. The second point is that make no mistake. Whole foods is now Amazon. If you have not gone inside whole foods lately it has become an Amazon fulfillment center and the takeover of Warren Street is just another sign of how Amazon has infiltrated this neighborhood, with its fulfillment of all kinds of goods through whole foods and I have seen the evolution of our neighborhood whole foods from day, one where we were able to welcome whole foods as a wonderful grocery store, but is now turned into and transformed into another Amazon fulfillment center, which you know with all the political ups and downs of Roosevelt Island, has now found home on Warren Street. So I'd like everyone to be aware that it is not just whole foods that we're talking about is definitely Amazon and for Amazon to be smack dab in the middle of Tribeca is really anathema to me and I wholeheartedly agree with the previous speakers. Thank you good season. All right, Emily Lynn, you are unmuted hi, I'm a resident of a 101 Warren as well and I wanted to thank the community board for hosting this forum, where we can hopefully work together to make the community a safer place. I wholeheartedly agree with everything that Manali strongman and Jay have already mentioned. One thing I wanted to point out is in the dot's letter they said they're going to trial this for six months and I guess they're going to study what impact it has on local pedestrian traffic and the community. The thing I wanted to point out is that we are in the middle of Covid-19 right now and I. Don't know if you're familiar with pedestrian traffic, but it's significantly lower than normal, so I kind of scratch my head and wonder what results you're going to get by studying it for the next six months when things are not normal and that's just something, I would put out there to do the when DOT. If they were to come back to us with a study and say oh everything's, great and wonderful, but the conditions on the street right now are not anywhere near what I would say is normal for Tribeca foreign street. That's it good point. Emily David, Posen David looks like good. How are you David you're on oops? Can you hear me start sorry, David, I, muted, you by accident, that was me, apologies you're on no problem, so tiny. Thank you and thanks to the community board for the work that you do on our behalf. First I wholeheartedly agree with the comments that have been made, thus far. I won't repeat them to save us time. I will underscore one, though, which is simply that you know the well a couple. One is that the amount of pedestrian traffic on Warren is considerable. That point, I think has been made and I think it's fairly obvious, just based upon the location of ps234 downtown community center and the fact that it is the primary way to get to the try to the battery park, ball fields and the and Rockefeller Park I, just I guess I wish I had a visual to represent it, but you know, as a member of the community, I'm sure you are aware: it's a single lane road with you know, cars parked on either side and a very narrow passage for the buses and trucks that go down. It currently contrasts that with Murray, which is four lanes and gets a significantly lesser amount of pedestrian traffic. You know the points have been made by Todd very eloquently about the availability of the three loading docks and the fact that Murray Street is, you know outfitted for that type of staging, but I just want to make sure that you know that the point is underscored. It's not simply a question of you know it's. The combination of the volume of commuter employee volume. Excuse me, mattresses, didn't mean commuter, but pedestrian traffic on Warren, Street versus you know far less on Murray Street, but also the fact that Murray Street is four times as wide without the same volume of you know, of commercial traffic going through so I'll leave it at that. So we can move on to the next. You know the next person participating I appreciate that don't worry, I've got a long list to keep going Tanya. You are before I unmute, you Tanya, I'm going back to see if the people who had stepped away are back no they're, not so Tanya you're. Next, I've unmuted you Stephanie Cliven is after that Hershin Mary. Oh, my goodness, gracious okay keep going hi good evening. Can you hear me I can thank you, okay, great well! Thank you for spending so much time on this and for the opportunity to hear members of the community I want to. You know definitely say that I agree with the comments that my you know. Other residents have made and a few that I'd like to underscore as well. You know, while you know as a resident as a mother of two young kids, you know I definitely want this to be a safe, safe community and also one with lower carbon emissions. So I, could you know that seems like a you know, a good move on one hand and the other hand you know they used to talk about replacing delivery vans and, frankly, I have not seen a a single Amazon delivery Van on Warren Street, apart from maybe a couple of weeks at the beginning of the pandemic. Certainly you know, and as some of my other members of the community and the residents of the buildings have mentioned, you know they do have you know the commercial loading dock on Murray Street that can serve as both incoming deliveries as well as a safe space for the delivery, bikes or vans. You know, as you know, whole foods would need you know the other. You know the other, and so it's still unclear to me and sounds like it may be unclear to others as to why that space can not be utilized and why additional space needs to be built out on Warren Street. Another concern that I wanted to underscore again is something that was just mentioned, with respect to the fact that it is a single lane street with buses with a bike lane, you know with commercial loading and uploading. You know that's used by trucks during the day you know, even on a good day, you frankly sees a situation where a you know a mail truck can not park and has to double park to deliver mail. You know by taking again additional space out, it will just make it even much more. Even you know more hazardous for for all of us, so you know again: I mean I think that, with respect to the community being able to have a place to park their bikes, you know that there's plenty of that on Greenwich I think the whole foods you know has the space on Murray Street that they can, you know, perhaps alter a bit and then use it to for both the trucks vans, as well as the cargo bikes. While you know keeping the Warren Street, which has you know predominantly it's the school 234, it's the dog park, it's the annex to the school, it's the community center and it's the residential buildings. It's largely you know a residential street and also a pedestrian throwaway. So there's a way to accomplish all goals, including continuing to lower remission without building this bike corral on Warren Street. Thank you very much. Tanya Adam I called on you earlier, and you were away from your desk, but I can call on you again. Unfortunately, you're going back down the list, so Stephanie Cliven, Heren and then Mary Gayle. Again. If it's been said, you definitely don't need to repeat it other than your name where you are and I agree. We have heard that Warren is very narrow, the restoration of both the of all the buses, the m20, the 22 and the connection on Warren we've heard about the concerns of the crossroads as a direct access to the ball fields and Stephanie you're unmuted hi. This is Josh Cliven I'll make you happy. We live at 101, Warren parents of two children. We agree pretty much with everything. That's been said, so we'll leave it at that. Thank you, Josh okay, Kieran Hiran, Doshi, Sorry about that you're unmuted. Thank you. So much appreciate everything that you guys are doing. I agree with everything that's been said by other people who came before me. I'm a resident of 101 Warren with kids and I am concerned about the safety, but I'd like to add one more important piece of statistic: there's been a 53 rise in injuries and accidents because of bikes just from 2019 to 2020. This is based on statistics by NYPD and if the commissioner is not taking this into account that this statistic, which is right in front of our face and this street, is high in traffic, then this decision of doing this is ignoring data and the safety. So that's what I'd like to say, and especially when the comment is we do what we do anyways. So that's my only point. I'd like to emphasize further thank you very much: Karen Mary, Gail, you're, unmuted, hi, so much Tim, and thank you so much to community board. So wonderful that we're able to speak here tonight, I fully agree with everyone. What everyone's saying and then some I just want to quickly add that Tribeca has always been known as a mainly residential area, full of family for as long as it's been in existence, whether it started with the artist families or whatever, but and then you consider Warren Street, which is flanked by schools and community centers and children and huge residential buildings, whether it's in battery park or our building, I'm a resident, I'm a parent at 99 Warren. There are probably more families and children and strollers- and you know just kids everywhere on that- are one block on Warren Street than there are in the entire city. I would think, and it's already too busy as it is, with the traffic from whole foods and all the bikes already the sidewalks and everything else, as everybody said, and then to add all the other bikes going in the opposite direction on the one-way Warren Street all day long, it's just an accident horrible accident waiting to happen. It is so scary to me and I just do not understand at all. Why whole foods or Amazon would not consider their beautifully huge, very open spaces of the loading docks that they have, including the much wider and much emptier sidewalks that they have over there and then, of course, the four lanes of street. So thank you. Okay, you're welcome, thank you, Mary Sandy, and then I'm going to Adam Weiss and again, please. If we, if it's something new great, if not please just repeat, we do need to do the business of taking a vote, and this is one of two things we have for DOT. So next is sandy and then I'm going to go to Adam Weiss and then Brian Sandy go for it. Thank you, hi Tammy. Thank you, everybody. Thank you very much for convening this meeting and letting us be heard. I will make this brief. I agree wholeheartedly. With all of the articulate comments made by the speakers before me. I have two small points to make. There was a traffic study that I believe the D.O.T said that they would do, and the very good comment was made that it would be a traffic study in the middle of a pandemic where traffic, both foot traffic and car traffic will be very different in a non-pandemic situation and related comment related to. That is the fact that on Murray Street the ability to maintain social distances for the people who will be using the cargo bikes, the loading and unloading would be much more readily able to be maintained. If we have loading and unloading right in front of all the residential areas on scarce public sidewalks, that will make social distancing even more difficult to maintain for the families and children, the school children, the visitors of the community center and the people that are trying to get to the ball fields to increase both the foot traffic and the the you know, the the traffic of the workers for their safety as well. It makes more sense to Murray Street social distancing. Is your comment? I've got it. Thank you Tammy all right! Thank you all right, Adam, you're, next, hello hi, can you hear me hi I can hear me. Okay, hi, yeah, I, just hi I just agree with everything. Everyone else said just one additional point. Well, just one question the letter that was sent today I mean it's more of a dictate I mean. Is there any recourse, or will this start no matter what he said, it's a good question. That's one that we are struggling with as well is the inability of DOT to listen to and take as much public engagement as we would. We believe in a situation like this it's ground up, we do support cargo bikes. We do think it's a good idea to get rid of the you know, vans the white bands that they have that double park on Warren. Our last conversation with D.O.T was to ask them to find out why it couldn't be in war on Murray, Street or even West, which seemed to be a little bit more expedient. But we haven't heard back from that and what we did here was the letter that you saw from the commissioner. So it is going forward really, no matter what it's supposed to be a six-month pilot and public engagement should include feedback. So we can look at metrics that, for example, after December 31st, if there's loading or unloading of any kind from any vehicle truck or Van on Warren Street I encourage people to send take photographs and send it to the community board and submit it to the DOT feedback, because that's completely against what they're promising if they are causing, if they are blocking the sidewalks at all with the bikes and the bikes, are on the sidewalk or packages. Are loading on to the sidewalks, then? That is something that as well, that denotes a failure of the system and community engagement and many other things. You know, obviously, the cargo bikes riding the wrong way riding on the sidewalk things like that, so that's the best that I can yeah. I'm sorry. That brings me to my second point, which is: has there been any discussions with the NYPD regarding a bike rules? Enforcement I mean it's not just the bikes riding on the sidewalk, the wrong way, etc. I mean just in general, I mean just crossing the West Side Highway and crossing the bike lane you know along the West Side highway is an experience in and of itself, because none of the bikes really struck me none, but very few, stop at the red light and there's zero enforcement. So you know I'm gonna tell you that Adam we have a meeting called quality of Life Pat Moore is on here she's listening she's, our chair for that as well as Mariama, who is our co-chair there and NYPD enforcement of a thousand different things is a conversation that they have routinely in. That committee, and between that and transportation, if it's a dialogue of a particular intersection or in general enforcement, that's where we're going to take those and I welcome you to come and speak at those meetings, I'm going to keep it very tight because we have so many other people who would like to say something about specifically targeted to cargo bikes. I apologize. Thank you. You're! Welcome all right, Peter Hammack Peter! Do you have a question? Sorry I had I agree with most of what's been said previously. So I guess you can say all, but I'm not sure I actually heard an answer to the question that was asked, which is there anything community board? One can do at this point to stop the implementation or alter the implementation of this plan. I would say: community board. One is advisory. We have we are making our opinions known. We are going to ask for help from our city council person as well as the borough president's office, and that is you know. We don't have the power to stop. We have the power to make a lot of noise and to ask our elected officials to help facilitate. It is a city agency, okay and I, had previously written in I think to Lucian about the actual implementation which has not been discussed, but the execution of this chorale will remove I guess it's five. Now not six parking spaces with physical barriers and I know that there are some objections to using paint and signage, but there is nothing stopping on a pilot basis. The implementation of this in a much smaller area using non-barrier methods that would allow for that space to be used for parking. Has that been raised to the department of transportation it was, and they said that they could not do that because they had. We even asked if they could use temporary barriers like the kind they use for construction sites instead of doing anything majorly permanent. Therefore, if it did, if it worked, it could go permanent, then, if it didn't, then it wouldn't, but we have not heard back on that. Actually I think we did hear back and they said no. They couldn't do that, but they allow cargo bikes currently to use any commercial parking space. So I'm a little confused by the lack of allocation of it is not safe. It is not safe for the cargo bikes to use the space without protection, because the cargo bikers can be I, don't know how else to express that the cargo bikes could be can run over I, don't hear it so. I also believe that the design of the corral prevents vehicles from using the space, thus keeping it free for a constant flow of cargo bites to come in and out. Commercial moving zones are frequently used by all manners of vehicles that aren't commercial loading and unloading vehicles. So this I think also is there I believe their way of trying to prevent larger vehicles from using the area that aren't doing loading or unloading like, for example, it's confusing, because cargo bikes currently can use any commercial loading and unloading zone, and so the city has already accepted that risk. What we're doing is completely eliminating that risk for a pilot which, but I'm not aware, perhaps there's statistics on it- of cargo bikes actually having been struck by cars, that, by or by trucks that are parking in these commercial loading zones. I don't know either, but it's a question we can ask D.O.T I think it would be helpful to understand why we're taking away this space in a permanent way as opposed to a temporary during working hours away. We have asked all of these questions and not gotten an answer that meets the satisfaction of the board. Okay or clearly the community or clearly the community has, as we are hearing. Indeed. Thank you very much. Tell me from a quality of life perspective. Can we suggest to these people now that they contact D.O.T rather than wait until after the pilot is underway? Since the Ot claims I've spoken to the world truly hasn't okay, Helen I should have known. You were already going there hell, though yeah, because what DOT had said to us is that they did outreach and they did not get any significant feedback, and so my conversation is going to be that I think that everybody on here going to ask if Lucian can provide a note to who to contact for DOT to make their position known. Obviously, commissioner, pinkar in response to the letter would be fine, but I also Cora is on the line from council member Chin's office. So I'm hoping as she is listening that she will be able to take the feedback. That's come tonight and have it and have Margaret's office have a discussion with DOT saying you know you got the two big buildings residential buildings and you know we've got 75 people on the call today and many people unhappy. So yes, I'm going to ask if Lucian can drop into the text, DOT email and the council member Chin email, okay, so, let's see I, you know the list keeps going so here's what I'm going to do. Please understand when I do this, I'm going to clear everybody's hands simply because many people have spoken and not taking their hands down and it's null or nothing. So I'm going to ask that if you still want to speak and if you have something fresh and new that no one has said before, please put your hand back up. Okay, Peter, I've! Gotten you correct! Peter. Are you good I'm going to take that as a yes, Dominic, Totino hi? This is Erin Chen wife, so I wanted to understand. I! Guess how can we certain that this will just be a pilot program because from the last meeting that the D.O.T had with you, there have been many gross misrepresentations there I believe you actually asked the DOT representative on the last meeting if they were waiting for approval before moving forward, and that representative said yes, that clearly is not the case on the last meeting. They said that they had surveyed the residences and community on 101. The only two residential buildings on this block were not. They did not reach out to I, also heard earlier that the director of the community center was not happy as well and the previous meeting he said. The DOT representative had said that they spoke to the community center and they were happy about the changes, so that was a gross misrepresentation as well. The fact that it's now November 23rd thanksgiving week the letter comes out saying that they're moving forward anyway and that, if they can complete this final by the end of November, again I feel like how do we know that this is indeed going to be a pilot and that they actually will take community feedback because it doesn't sound like they are or that they will agreed. That's all I can say on that. I'm gonna move, I'm gonna we're gonna we're moving forward towards a resolution, so we're taking notes all right, sorry go ahead and just for the record I do agree with what previous speakers have said on behalf of 99 and 101-1 I assumed you did thanks all right. I've got remember, I'm gonna unmute, and hopefully that will welcome from council member Tins. Yes, Cora, you need to have I, guess better, except you have a lot of feedback or if you can turn off. If you have two computers running or you are on a phone, please make sure you do one or the other. Please I'm here. Can you hear me now it's perfect! Thank you. Okay, sorry about that. Yeah I've been listening and I understand all the concerns. Jamie is also in touch with me, and I also have herself from some of the presidents, such as Adam and sanjir. She I also got her emails. I didn't get from everybody, so I'm trying to get from everyone, I just put in the q and a my machine's email, and also my there I posted it in the chat as well for you yeah. Thank you. Okay, so again, council members, email and Quoras is in the chat. I highly suggest you email them and I'm gonna say put a cc to Lucian Reynolds, who is our district manager as well? I will get put I'll drop his email into the chat as well and Tim. Right so said earlier that Lucian's going to find out who at DOT that the resident should write to right. Well, at this point, I'm going to let Lucian on mute himself, I tend to think it. You know we are I, think that they should probably write directly to Commissioner Pinkar, who sent the letter. Yeah I think that works so I mean Jennifer, Liang, probably more directly. Anything would probably bounce to her. So it might be easier to send it straight to her, but I'll confirm who the best person is to receive those emails. Send it to the commissioner, yeah I think send it to you. Come I agree with you Susan it's Cora, Commissioner, Pinkar and you're welcome to copy all of us, so we're all together. Sharing all the ideas and comments. Betty. Can you unmute? Is it Jennifer, I-N-n-e-F, Jennifer, Inns or Jennifer Leong Personas is the Deputy Earl Commissioner Jennifer Lee Young is the essentially the she's helping us on to our community board, okay and for D.O.T? Okay, there you go it's all in the chat, alrighty, so I think with that I want to try and go to a resolution, because we are at a point of 8:13 and it's one of two DOT reference things, the other being CitiBike stations so, and we have some committee reports and I would not like to be here past 8:55 tonight. So I'm going to ask if you have your hand up- and you have already spoken like Jamie- if you can put your hand down and then anybody else who has already spoken and if you have not I, will recognize you but again, if it's not new, just say your name and where your address is and I agree, we're gonna start with Patricia going gone: okay, Sanjita, Gupta, you're, muted hi. My name is Gauram Gupta, I'm Sangeetha's, husband, everybody's spoken very eloquently and I. Don't really need to add anything. I agree with pretty much everything. I just want to add couple things. Firstly, I'm speaking more as a husband to a wife who uses a wheelchair and I think there's a assisted community living right across the street from us who tend to use Warren Street a lot, so I would like to add their concerns as well just from a traffic standpoint. Secondly, if this is a. Secondly, if this is a pilot program, I completely agree with Emily. How do they plan to evaluate this over the course of the next six months, given that there is a very good likelihood that most of the college, most of the schools and commercial establishments might be closed for the foreseeable future? So just those are the only concerns that I would like to add. Thank you be back on mute, Demetrius, hi I just want to make a couple points. Some people mentioned that whole foods could use basically sidewalk space to basically do their cargo bike pilot, but I just want to reiterate that sidewalk space is busy. I would assume that everyone should assume it should be only for pedestrians and especially now with social distancing, it's really hard to keep space from everyone on the sidewalk. Another point is I assume that a lot of residents use whole foods to shop online. So, basically, with an increase of people shopping online whole foods as a business has to basically find solutions to accommodate all that increase of business. So I don't think this is such a terrible idea to allow a business to basically succeed in what it's trying to do and basically, third whole foods is not really asking for a lot of space they're, just asking for like 20 30 feet, so I, don't really think 100 feet. Oh 100 feet, so I, don't really 100 feet. Five parking spots outside the space, yeah 100 feet, I, don't think. That's such a big of a demand considering how our streets look right now, I feel like the curb needs to be diversified for more uses. So thank you. Okay, Dimitri Ganares! You are unmuted! Thank you Tammy. So as a resident I agree fully with everyone. What everyone said from the Tribeca alliance perspective in local small businesses going back to the small business committee, we don't get the same ability to use street space for loading and loading. As now, Amazon is doing a lot of our folks who are doing loading. Unloading, get tickets, 150 dollars a piece, so it's completely unfair that local businesses that are struggling have to compete on the same level, but don't get the same equity from DOT thanks. Thank you, amen exactly all right, Christina Chew Christina going gone Cornel. It says F Cornelius, yes, good evening, my friend my name is Francine Cornelius. I'm an educator at ps234 and I totally agree with comments regarding the concerns about the space, and so the proposal to implement this space across from ps234, which uses a socially distanced entrance facing that space. The dog run, which is also used by children and families ps234 annex which is also used by children and families, as well as the community center, and my point is I- do not want to bury another child in our community. We have buried our children, and so many families on this call I have taught your children. I've been in the community teaching for 25 years, I taught your children or at least waved to them in the hallway and so I know your families. I do not want our community to bury another child and those of you who know and have lost a child and know someone who's lost a child. We do not need that in our community, so I'm against this proposal and I think everyone should call write email to block this proposal. Thank you very much. Thank you very much. I am going to point out one thing and we talk about this many times. One of the benefits of cargo bikes is that it gets rid of the double parked trucks who should be over in the loading dock anyway, but nonetheless towmen Ghouler hi. Thank you so much I'll make it very simple. My name is teom angular I live in 101, Warren, Street and I agree with everything except the person who was rooting for the 100 feet is not a big problem. Thank you. Okay, Patricia! Are you there Patricia once twice gone Hank. Thank you. I'll. Keep this br brief. My name is Henry Smeal and I'm a resident of 101 Warren, Street and I would like to join with everyone else who was opposed to this cargo bike storage space on Warren, Street I think it will make the block more dangerous and I support the efforts to have it placed on Murray Street as a better alternative. Thank you. You're welcome, okay, so Yuan Crane, yeah, ewan, hello, hi yeah, I'm a resident of Warren, Street, 99, Warren, Street and I actually directly overlook the street and from time to time during the day that the street is completely packed with buses and traffic and I have a question with regards to these cargo bikes. We don't see any of these bikes at this current time, so where are they coming from and what are they taking the place of? Because there are no vans on Warren Street that belong to Amazon? They, you know the white. They do have white bands that they load and unload on Warren Street. They do they are not branded or marked, but that's what they're, using for deliveries as well as their so they do load and unload out on Warren Street. Currently, that is what they are looking to replace are all the white delivery vans that they are currently using with cargo bikes. Yeah I would think, there's a very small number now also with regards to the point that was made earlier about there being it's a delivery zone. Yes totally agree with that, but there is a time limit on the delivery zone from seven in the morning till six pm in the evening. I believe, yes, all right. Thank you. Okay, you're, welcome. All right, I think everyone who has signed up has gotten at least one opportunity to speak, so I think we are done with all of that. Do you, like it, Christina, I, gotta, I, think I have Christina. Yes hi. Can you hear me? Okay? Thank you. Yes, thank you. So just want to point out. Whole foods happens to have four sidewalks. They can choose right and West. Side Highway off Limits Greenwich was actually rejected by the sponsor Murray. Street is widely available and a proper loading dock they're choosing the narrowest and the most highly traffic street. In addition, if they're talking about safety, it's the children, as everyone has mentioned- there's also the safety of the workers. When you load bikes, you don't just you know, magically hop the sidewalk and get on there. You push these carts with all these bags and you get in there. It's an endless amount of traffic that makes the situation extremely dangerous, and so the question I have. Is there a way, given evidence now of significant objection that we can have them at least postpone the decision to begin the trial they purport that no feedback was received in opposition I. Don't think any of us agree with that or have seen evidence so, given the dispute, can we have a proper call where they can present their evidence that there has been no objection and members here can speak up as well. So it's a balanced conversation. We our process, how this works from a community board perspective. They have come twice. They have come to our transportation committee in October and then to executive committee, and then we have the resolution again here based on feedback and everything. That's come so from our process. Just so, we understand we're going to be doing a resolution tonight on this councilmember Chin's team is on Cora is here, she's heard an enormous amount of feedback that she'll be sending them as well. So maybe the process did not work properly. However, they attempted to solicit, given a huge amount of opposition and their commentary that there was in I mean perhaps the mailing got lost, you know or burned, but I think you know we should have an opportunity, given the imbalance in the results, totally respect your process just requesting, given the circumstances. If we could kindly and respectfully request a re-evaluation of this process and I think we all know, once you go through a trial once it's implemented, it's that much harder to reverse you know than if you have a proper discussion at the onset I would agree with that. All right, thank you. Christina I think I have everybody who's raised a hand to speak so I think at this point we should do a resolution. Lucian was fired up all right, so we have okay, a quick question: did did whole foods ever come before the community board themselves, or did they always rely on D.O.T too? They relied on D.O.T. We asked them to come. We ask D.O.T to bring them along. There has been zero representation from them, so you know not showing up, says I think we need the thing. I think we should make a strong comment in any resolution and insists that they engage us themselves and that D.O.T shouldn't have the a trial until Amazon at least comes and engages I agree with Paul I mean, even though you know we're pissing in the wind. Pardon me everyone, yeah I, don't disagree with any of those all right. Just I just wanted to say real, quick that that the fact that there is no representation from whole food or Amazon and the DOT kind of made the decision and really didn't listen to any real feedback or real real input from the community, and that what we've learned tonight from the community is how dangerous this is in all of the inconvenience it poses, and so I think that that actually, that the selection of the site itself has is actually part of the experiment and that's simply the wrong site and that the pilot shouldn't go forward because it's too dangerous and that the idea of the corral is a good idea. But what we have determined tonight is that it's just the wrong place for it, so it should just be moved somewhere else. This should be called up and called off per se and and that when they have their real proper pilot, that should just be in the right place, not in a place, that's so dangerous or inconvenient. And that's my comment: gotcha okay, pedestrian sidewalk, okay, Lucian I am typing, but if you can share screen, people can see while I'm typing it. Okay, so am I getting the sense from the executive committee that this is going to be a negative resolution. Yes, okay, fantastic for everybody, but I would think so. Absolutely okay, so I am in here! You can see where we are so I've got. We've got a lot of the concerns in there. So therefore be it resolved Manhattan community board. One expects that New York Cdot do more to engage with local stakeholders and design the project with their concerns in mind. Yup. Sorry, on that very specific point, is there any value to referencing this meeting to see the fact that we had 30, plus people express concern it's up in the whereases, we're sticking all over there got it. Okay, sorry, yep I can do that super quick to make sure you see that that's in there, whereas on November 23rd over 30 local, this event representing and again notice, I'm not the greatest type. Yes, 99 Warren, and also, if we know Townley and team are opposed to this I mean Countley has to say something. I mean I heard that comment that you know the director from Manhattan youth, but he's a board member. So he will. He has not said anything to us and he will be voting on it anyway. So that's kind of where we're going to go on that. Okay, yeah, you can tell my typing skills: I need to go back to take typing pal with my kids. Okay, CB1 urges DOT to postpone the pilot installation address community concern. It's raised, including interference with local pedestrian, sidewalk traffic, bicycle movement on the streets, alternate location concerns and preferences, ultimate location for vehicles, including vehicles, and like cargo. How about the reinstatement of bus service? Yep I know it's further up, but I think it would be good if we did include here the failure to properly notify and then to engage the community, because that's been something that we've asked for since our first meeting and in fact why a couple of us, my myself, definitely included if nobody else didn't even feel comfortable voting on it, because there was nobody from the public here when we had the first visit from them. Cb1 urges DOT that all pilot brush must include a robust community engagement, outreach standards and evaluation before installations and then include some evaluation, engagement portion. Okay, all right, yeah I, think I've got everything here: okay, we'll be lost to the fight crowd, yep, okay, so that's kind of where we are. Everyone has seen our therefore be. It resolves something in about inviting whole foods themselves to engage with community. Thank you, yep all right, I, wanna, actually I wanna have to actually add that request. Fdot return with the applicant. Thank you Paul, then I, don't know if it's appropriate to interested in this one or not, but the whole idea that the tech it's being paid for with taxpayer money as opposed to whole foods. It's like they've asked them to get their vans off the street, stop double parking and for doing that, they're going to be rewarded with this new system of parking that the public is paying for at the cost of their own parking spaces. Hey Tammy. Yes to that really great point and to Dimitri's point earlier, I'm personally kind of I'm not sure if this sounds vindictive, I'm kind of offended that they haven't done some of the things we have to ask them to do for small businesses, but they're willing to do this. So I wonder if there's something to be said in here about that I think there's a whereas that goes in here about small businesses, not having the same opportunities, yeah I, think mariamo you want to be. We want to be really careful and not talk about whole foods paying for it, because if any of our small businesses want the same then you're going to say, okay. Well, then the small business has to pay for it too, because you can't have one or the other, so I think that I understand a dangerous precedent. Thank you. I appreciate that I respect that Tammy could I just suggest that the idea of the bike rail is a good one, but that at a different site it could be successful that what we're really doing here is overruling that site and that we think that it's good to go forward with the corral experiment, but in a place, that's more appropriate and safe, for it says, alternate locations for whole foods and the bike cargos station, including Murray Street and their own loading docks, including Murray, West, Street and or their own loading docks. Okay, it's on there all right! So is everybody ready on this? Then? Can we take a vote? Yeah call the question absolutely so. I'm gonna! Second, it myself! So I'm going to run the same way as we're running everything else. It's going to be everyone if you are in approval, that's the way we're going. If we need nays, you have to call your name say your vote, abstentions and refusals. Okay, so okay call on the vote. So all in favor with a yes. Are there any no's, Nelson, no, okay! So no any others. Are there any abstentions? Susan. Are you abstaining? I hear you? Oh I'm! Sorry, that's okay! You know, I'm all for it hook line and sinker gotcha. All right. Are there any abstentions? Any Recusals motion passes it's for everyone who is part of the public. What they need to understand is committee. Votes are ratified at the full board, so there is still one more step. It has to go to the full board and that's where our votes are final, but in the meanwhile I am quite sure that Cora will be bringing back the dialogue to the community to yeah okay. So, let's move on same. Thank you very much for your engagement on that. We have the same conversation coming down the bike on CitiBike stations. Betty did an amazing job with CitiBike D.O.T came and presented on the infill, so there it was a robust engagement and we all know what CitiBike is. So we started adding Eddie. Thank you for your research on this and information about what CitiBike is and their expansion they're in phase three of expansion from 2019 to 2024. That will add approximately 16,000, dots and 33 more square miles into these three areas, as well as throughout the existing. So one of the things that came up in the conversations that we had transportation is we ask them for as Anthony called it. The saturation rates of the areas in community board- one we, as you know, from sitting here through small business, are somewhat struggling through what is going on and knowing that we don't have the people back. Downtown alliance has been very clear on that. We don't have the people in lower Manhattan that we have had for a long time. There are a lot of businesses that have not reopened, and so we are looking to understand the metrics that CitiBike was using. They did send us some information and we did have. They were citing forced locations, two of them people came and had major issues with, so the news stations were Water street at John on the West Road Bed Spruce street, at gold on the East Road Bed, Fulton, Street and pearl, which was going to be in one of the pops and then Albany at Greenwich in the North road bed. Okay, so a couple of things that came back is we asked commute. We asked D.O.T if they would be using any kind of robust public feedback and engagement for the community in terms of citing locations and what determinations were made on whether or not they were going to pause or not. They stated that they have a contract, and so they have contract, fulfillment deadlines and numbers and quotas that they need to meet, which kind of seemed a little odd. So we asked to review local ridership data and technical criteria. We haven't gotten all of the information that we asked for. Let's see, residents objected to it being cited in the parking lane in front of the restaurants, which would limit open space. We've heard that numerous times along a variety of locations, we heard feedback that it we didn't want it on a sidewalk versus the parking lane due to limited pedestrian space in our neighborhoods were all well aware, and then there was a lot of pushback on locating it within the pops itself versus again being in a parking lane where people were parking. Residents reported that CitiBikes were being written on the sidewalk, including to and from the docks, which is one of the other concerns about putting the dock in the pops, and that sidewalk sightings implies that it's okay to ride in the sidewalk a practice an endangered pedestrians and is illegal bike lanes are not always present, as we well know in community board, one where the city docks are located and there's no obvious guidance that bicycles same rules as cars, which is a missed opportunity to show the cyclist that bikes belong on the road. And although the app contains biking rules, the material is not rigorous or tested, and there's no test about pedestrian and cyclist safety. So you got there's you know you just hop on and go as they say. So we have supported in the meeting in the dialogue two of the non-controversial locations, which I believe and Betty will have to correct me. If I'm wrong on this, we 100 supported the ads to water, it John and spruce, and gold teddy. So right. So those two need to go there, that those seemed really non-confrontational and great sightings. We did not support necessarily the other two sightings that they had, which were one in the pop which is at. Is it Fulton and Pearl, which was in the pop itself and Albany at Greenwich, because Albany is a very narrow road and so is Greenwich and there's no just open street grid there? Okay, so that's kind of where we are so here we go again where we support the two non-controversial locations we're requesting that they do robust engagement with the online portal to allow people to provide the community. Not people allows the community to provide input and feedback on the needs and locations and then share it, because we've had a lot of robust dialogue of people coming to complain because they just announced the location without asking feedback. First and I did that I can be alone in this, but I want to go on record objecting to spruce and gold's. Bruce and gold is a hospital on one side and it is the exit to my building on the other. If there has to be something on gold, I would recommend 100 in front of 100 gold, which is city property, that is department of housing. They have a huge sidewalk there. Let them put in right there on their own property when supposed to go to the hospital. Is the hospital yeah I think that, because they provide free bicycles to essential workers, I think that's. Why they're looking to do that there? So, but that's fine! It's a good point. It'll come up in discussion, so everyone sees where we are on this and that you know we're looking for engagement at least two months before so that you know adequate time. So we don't have what we have at the cargo station: pedestrians first new docks on road beds. Thank you very much for that. Lucian avoid ducks blocking sidewalks Street space, okay, so that's kind of where we are on this one. Betty, please tell me, have I missed anything, okay, cool all right. So, let's see if I've got hands up on this I see one hand in the public and I know: I have board members Colin Mariama and then I'm going to carry Davidson next Colin go sorry. I was up from home perfect! Thank you, mariama you're good. Yes, I'm lowering mine too, because that was my comment that South Bridge Tower is private property. So if it's on that side, that's a problem and if it's on the other side, that's a problem to me because it's a hospital, but if the hospital's okay with it, then of course I would have no opposition and no further opposition to it. Thank you all right Lucian. Can you unmute Carrie Davidson, please hi, Tammy, hi and thanks you guys for all the work that you've done. I don't know if I don't know how many people are on this call. I know that we had a lot of people who were concerned with the CitiBike process over the last several months, so I hope it'll get reflected that that the community has been trying to make its voice heard. I just want to draw one distinction that isn't readily made in the summary you gave Tammy there's two different kinds of DOT proposals: one is for expansion in community board and the other is for infill. Expansion is when they add new stations. Infill is where they add bikes to existing stations. So I can't see the resolution, but if we're only addressing the expansion, then then I don't have anything to add to that. But if we're also passing anything that allows them to continue with infill, which was also part of our discussion, then I think you know then there's you know. There's 1500 people who've signed the hideaways petition and you know anyway, so I don't want to go into all of that. If it's not, you should because you're talking about yeah, yes, we will make sure that infill and expansion right, so we need to just. We will show those two things: okay, right. So, and just so that people are clear, infill is in the dot's little bit of data. They provided us a few statistics to Betty. They did not provide what was asked for by people on the transportation committee in terms of density, ridership statistics or any of those things. They also didn't. Let you know they've done quite a bit of infill in various locations in what's called the historic district, Tribeca historic district and I'm really thinking of the bikes that they added on Lake Street bikes on anyway. There's I, don't know how much detail you want here. So maybe I should read the resolution and then, if I have comments, maybe call me back in. You can also read the resolution and send any of the board members friendly resolution friendly amendments for tomorrow. Okay, so let me because our final vote is tomorrow right. Okay, so I will read that as you're discussing and then let me just go on record for, like the four main things that I think sure people should know. So. The community preferences that came out of the public engagement, which really was only at the last transportation meeting when D.O.T finally sent representatives, were that we wanted to minimize the impact to restaurants. So infill and expansion should not go in front of restaurants. There have been occasions where Madeline at Grain Park Patisserie received a com, a call from Trans from DOT. That said, you're gonna have to move your tables and chairs because we're putting bikes there. That is not public engagement, and that is not in line with community preferences of supporting small businesses and restaurants. So community preferences should include minimizing the impact to restaurants, preservation of historic space such as blue stone sidewalks, because there's been notice received by buildings that they're going to put docks on vaulted sidewalks, the third preference would be preventing riders from using sidewalks or riding against traffic. So I'm not saying that. Okay, I'm just making sure I have all the yep. That's okay, keep going yep and then the last one was to to relocate the ones that have become problematic when DOT said that they were first launching the program. They said these docks were easily movable, so we think that they should move the one from Duane Street to be in front of the old best market. There's a cut out there, they're moving it to they already announced at that meeting. They're. Moving that one that's in front, that was where Tokyo Bay went out of business. The hideaway is and Duane Park Patisserie they're moving it to the side of the park itself. Duane Park that was not announced at the meeting and if it had been friends of Dwayne Park would I represent, would have a lot of people on this call. That was not announced at that meeting. I thought they said that they were going to try and because it was one of the locations that we had all suggested was getting rid of the parked cars, the placards that were there absolutely. If that was not part of that part of the agenda, then that was maybe, after that part of the agenda adjourned. Foreign knows this. I've been on record with D.O.T, for, since the program launched that is a historic park, the friends of Duane Park does not want bikes around the perimeter of the park. We've walked to the blocks and gave them six locations in 2012. We've walked the blocks and given them alternate locations to try and save the hideaway, and can you do me a favor? Send me the timeline, so we can include it in the resolution. So, like you did a walkthrough in 2012. You know and we'll include that in here, okay, it would be part of your September minutes, your October minutes and your November minutes, but my thinking, my only thinking on that goes kind of like this, because we talked about having robust engagement and listening to dialogue and what you're telling me controverts the dialogue that about outreach. No, so okay, so let me go through this again. D.O.T announced that they were putting a bike rack at the apex of Dwayne Park, the West side in 2012. When they were doing the proposal, they did not I remember streets right, so we found that out after the fact, I had to work with sushi at the time and propose six other locations because they didn't know there was a fire hydrant there and because everybody on the block said they didn't want bikes in the middle of Dwayne Street, we have taster Tribeca. We have. We had a lot of more users back then than we do now, but taste of Tribeca and friends of Duane Park and lots of residents said they did not want it in the middle of the public square. It was a safety hazard because there's no way for pedestrians to get to a rack at that location, etc. So, after the fact I then worked with Suchi to come up with the location that it's currently in that was eight years ago from eight years ago, until September of this year or August of this year, there was no public engagement whatsoever with residents around the Dwayne Street classroom. The engagement happened once hideaway and Dwayne Park Patisserie were told that the bike rack that is currently there was going to be expanded and Madeline would have to remove her outdoor seating. That was the first that we had heard about the infill project on Duane Street. So since that time, I've been as many of these meetings that have been called to remind people that we don't want to put businesses, restaurants out of business, and you passed a resolution back in September, which DOT wasn't really participating in and hadn't asked for our input. They had just sent Madeline a letter. So that's a public engagement, that's move your stuff, then we complained to the transportation committee last month was the first time that DOT came in and presented their infill and expansion plan when they got there. The deck was the same one that they've used at other community boards. You can see it on their website now it wasn't made available prior to their meeting and that was November 6th November 5th. So that was the first time that DOT came in with a plan that showed infill or expansion in community board, one that discussion did not talk about infill locations at all. It focused on the four expansion locations and at that meeting, November 5th you and other people on the transportation committee asked the DOT and Anthony made the point about density and saturation, but we all tried to make DOT answer questions about the lack of data that justified their expansion and infill plans. They gave us information about expansion. They did not give us data about infill. So far, there's been no data that suggests that there's increased demand for bikes, that's not being met by the current docs there's, no data that suggests that that we need that any demand for bikes in one location can't be met by rebalancing bikes that already exist. So we in fact carry if you remember, they said part of the expansion and infill was a contractual requirement that they have. It wasn't based on saturation data. That is one node of what they use, but they have a contractual obligation that they have to fulfill right. But that's first is phase: three is the Bronx and the outer boroughs? That's not infill into phase one locations. That's it doesn't make a difference. What they said they have is a requirement from a contractual obligation of how many expansions that you know how many docks and bikes and things like that they have to have that's part and parcel to the conversation of we're asking for them to come to us and discuss with us about usage and need in this in the community versus what they need to fulfill right. But there is no. So there is no additional need for bike assets in Tribeca. We don't know that you get. We don't know that to say that. That's not a point we can say until we look at what the data says and the data that's the data that you asked for that they didn't provide correct. I am not an analyst, but they have CitiBike data on websites and I've been trying to crunch these numbers or usage. You take out CitiBike city Bank and West Side highway at Stuyvesant. Our numbers are down considerably, so there's no additional demand for bikes down here. So it doesn't make sense that they're, you know, except that they think that everybody's gone and no one's gonna complain, but it doesn't matter they're, just gonna. Do it anyway? That's what they said at the meeting when we asked them whether or not you would ask them or said that you were disappointed at the lack of public engagement and they said they were going forward anyway, which is the same conversation as the last one, which is. You know why I'm so sorry to take up all this time at nine o'clock at night. But it's the same problem. The DOT is rolling right over the neighborhood. They are sending letters to residents and businesses that say we're doing this and you have to come and justify why we shouldn't 16 Hudson had to retain a lawyer in order to have their voices heard. That's not public engagement, so anyway, I don't want to go on and on I do want to read your thing. I have to minimize the screen to do that. I'm sorry so I'll read that, but I do want to make sure that people understand that there has not been public engagement other than me coming and asking you and Betty he's been super terrific and patient, but DOT has not been responsive. Dot has not engaged the public. You guys have engaged the public. The DOT has not been part of it. Appreciate that I'm gonna, have you go back on mute, Dimitri, generous, your hand is still up. The only thing I can say is Carrie Parker Davidson God bless you thank you very much. You've said exactly what's been happening in this community and the businesses are getting the short end of the stick on this, especially on Duane, Street and Tammy. Thank you very much. You're welcome. Okay, so I think that gives a very broad understanding of the conversation that we had for a couple months with. Does any board member have anything they want to add or recall a question. I just want to clarify my statement before we call the question. I just want to make it clearer that 90 gold street was not asked about this. So if this, the plan is to put this in front of our building, the exit ramp to our building, which is the only place I can think of if you're saying, spruce and gold- that's where we are. We were not engaged on this, and that is something that should go in the resolution because yeah it's about that. Okay, any anyone else. Anyone ready to call a question I'll call the question. Thank you! Lucian you ready to roll ready, okay, so I, don't think we need to do this as a roll call either I'm going to go the same way we did before. So if you are a no an abstention or a recusal, please state the name and the vote. I'm going to say the a here are: yes, any no's, any abstentions. Any Recusals okay motion passes Cora, you have been on and I know. You've been very quietly listening to this, but it goes into the tank of public engagement and D.O.T with all the others. Please all right, 903 unless I hear to the otherwise. If anybody has anything that they need to tell me that's going to light the meet the community board meeting on fire tomorrow, I say that we just run through community boards and call it a night so motion to adjourn I. Second, yes, bye, see you guys tomorrow have a good night, I'm going to get dinner good night, and thank you, everybody for coming.",
            "summary": "Are we doing Diana for any kind of quorum from small business working group just to have enough people on I have to ask Colin since I.\nDon't think I have a list of the small business working group, numbers.\nYou have come early for our executive committee, meeting, which will be starting with the small business working group with Colin, Mahoney and Elizabeth Lewinson.\nLet's think about that way, instead of going through the whereases and the therefore be resolved, I want to tell you what those trial resolutions.\nOkay, we I think, should be supporting I'm, not a member of your committee, but I agree as well.\nI'm, sure I won't know the answer to it, but sure if the small businesses are open or if their revenues are severely depressed, Isn't there a correlation between that and tax liability, absolutely meaning if they're not meaning, if they're not open and they're, not jading, generating revenue.\nBasically, for example, my my small corporate tax, which is basically the general tax liability, which is my ability to operate in New York City, Give you an example on that one they raise it on us, because every year I would pay a little bit extra into the fund.\nOr everybody got that across the board, but at the same time, even I totally hear you saying, If you're not generating revenue.\nThat's a cool, sound okay, Unless you want objects, I'm going to move on to the final resolution.\nObviously, one of the bigger expenditures again Bill feel free to chime in here are obviously heating lamps and the propane that these things suck down all day long, especially with outdoor dining hand, especially with what looks like to be additional lockdown measures.\nI forgot where I was in Tribeca, and these guys are just coming out and changing propane tanks, like literally every 20 minutes, because these things are just burning like all day long, so people can eat outside.\nSorry has actually funded a grant program for up to twenty thousand dollars for qualifying restaurants for both heaters and propane to keep outdoor dining going.\nYou're, going to get too many fines, because you have to keep it a certain fee from the space of business, meaning you have to give your door entrance on the sidewalk.\nAnd, that would it gets a lot of players like myself, very frustrated, because every time we turn ahead, it's a new regulation, whether it's from the fire department, the building department or even the city itself, concerning how they're proposing it out there.\nI mean in my mind, for the companies that need it to utilize or leverage the city's buying power to help them with those supplies, Because I, don't know one of the cleanest.\nSo, I, think and that to that end we should delete any wording about propane and specifics as to what kind of heating and just say you know that we're looking for support, we're looking for hosts to share in the wholesale prices like a co-op or something actually.\nIt's, not sharing the prices, I, think just getting reimbursed because you're not going to have the city go out there and buy heaters.\nGuys, a quick question going back over what you just said: you've taken out the safety issue.\nI. Think we need to do something to tighten up the resolve, for which one the actual resolution itself don't answer.\nI think that's asking a little bit too much of the city and.\nI know, but the city doesn't want to be in competition with businesses that sell these things after 9:11.\nIt sounds good to me and make it more broad, meaning not just heaters, right, the cost for actually building the structure.\nI do question this idea of just any kind of equipment, because I do think to Bob's next point.\nI think it sounds like we all agree on the spirit of it.\nWhat you're asking the city to do to use its purchase power for negotiation, to be able to get at lower costs by purchasing in bulk to help the businesses.\nThese venues are going to go away, they're not going to have jobs when this thing is over I, don't know what that means.\nSo, Let's think about that kind of stuff, and if we can figure it out, I mean I will say you know.\nLet's, take all three small business working group resolutions together and because this is not full board, we're gonna go the way we normally go.\nWe're, going to renew the street fair Task force and, If you're asking me why I'm going to tell you that we're hoping in 2021, because I'm an optimist that we will get back to the potential of maybe being able to have holiday, fares outside or anything and everything on the outsides.\nIt's really, basically how it rolls for anybody who can't read: it, I, will, The sponsorship of street fairs by CB1 in 2000 in 2021, to raise funds to support the work of the organization, extends the existence of the task force for an additional year, subject to appointment of members by the chair of CB1, provided by our bylaws grants.\nThis was a large dialogue that went through and we have received subsequent information since the meeting, which is why this has now come into executive, because the resolution as passed in committee was not complete.\nOur vote is on record and with that, let's see where we are okay, I'm actually going to even call Jason and make sure if he has stepped away that he's back.\nYou wouldn't think it was that important, because it's a relatively small building, but there were issues when the presentation was made at the landmarks Committee.\nI, don't know if we can do videos in the meeting, but it's like a four second video panning, the block which really gives a context to the map.\nWe just need to protect our voting rights here, but Jason I do want to say that the applicant is on the line.\nLet me say that without casting aspersions that when you say you know in the distance, far away three buildings away from the maca on the corner of the street, which is a totally legitimate, view, Carter.\nThe independence closet building been built out to the street line, like all the rest of the community, has been built, but in this particular case, independence.\nIf, you were to bring up our rendering, you would see, is going to become red, Brick Party, Wall Brick, like everything else, and can I ask a question: Is the.\nGet that picture up again, please well, Bruce did you have your own photo just to be clear about which photo you looked at before I would like to know.\nI, think the next I want to recognize hands up to make sure.\nWe have no opinion on this at all, but just as a an owner on Harrison, Street I think any investment in our community is welcomed.\nSo I understand why line windows don't have legal rights or whatnot, but I guess what I'm concerned about is how they're going to attach to the building, because when seven Harrison was constructing their or regarding that entire building, it created a lot of damage to the East side wall of eleven Harrison and we're worried that they're.\nIf we could see like a final drawing that they're going to be filing with and to confirm the measurements and confirm all dimensions, I think that's something that hopefully they'd be okay, Providing us with.\nSo I, don't know like what exactly your detail is there, but we're putting up a louvered screen to hide air conditioning equipment, and we could very easily work with you to put a device outside to make it so that you can still see some sky from that window, but we would have equipment on top of our bulkhead.\nKnowing that you asked us to work with landmarks, saying that I got ahead of it.\nI would like to ask those people who are on the Landmarks, Committee, Jason and Susan I, don't know if anyone else on the committee is here and maybe Alice can weigh in as an architect.\nI would like to ask them what they think we should do.\nI like the idea very much of writing into the resolution, the part about making sure the staff people get off their tushies and come and see these things.\nI mean I, just find it hard to do this without anyone having looked at the mock-up, which is impactful in a way that you know that's unusual, especially for such a intact block.\nI have no further remarks except that, given what I'm hearing, maybe we should strongly amend the original resolution of the board agrees and Susan.\nObviously, You know those issues as well and also that we, since there was a major renovation at 7-9, Harrison Street a few years ago, with that, the building on the corner of stable and Harrison that negatively impacted our east wall.\nWe want to make sure, of course, that on engineering terms, that whatever is done on the roof of 13 Harrison, If there is something done, does not negatively impact engineering, structural levels, you know our building at 11, Harrison Street, that's crucial in terms of our West Wall anyway.\nThat last piece is the piece that we're trying to shrink now in advance of going back to landmarks, responding to Bruce's comment from last week's meeting, seeing what we can do to pull down both that's the bulkhead height and the mechanical equipment, and what about the actual size of the floor to seal.\nYou know, ambiguity about how the committee feels I think now it may be best to try to amend the original resolution.\nAsk you to email, the Community Board office and speak with Lucian, Reynolds and I will have him, put contact you and send you a okay.\nA letter that came to us from the property manager from the Warren Street Condo, that the bike corral is right in front of at 99.\nSecondly, on the as you can see, If you scroll down on the picture, they forgot about 99 Warren Street, which is kind of a big oversight, particularly as they said that they did a traffic study.\nI mean I may say something later, but I think it's time for the residents of this building, which are going to be most impacted, as well as some of the Ptas and other things to be able to speak.\nAnd I will reiterate what Annalise said about this being an incredibly heavily trafficked block, because it's the main access for people going to the east for Ps 89 or coming from the east for the ball fields, as well as people going across the street for Ps234, and one of the things that I really want to point out for people who have or haven't walked around the building is that there are three large indoor cargo bays at this Amazon whole foods, location that are perfectly capable of handling this requirement.\nHere tonight, because way back when whole foods first opened, their design included a large walk-in refrigeration unit at the Warren Street Entrance to whole foods, and that's when it was kind of a sleepy delivery service where people would put stuff into that refrigerator and be handled and delivered later in the day or by Vance whole foods, and now Amazon have refused to modify their space to reposition.\nThink people need to take a very hard look at is the space that is fit for purpose for this particular use of using bikes or whatever they want to use being used, And the answer is it is not.\nStreet I strongly agree with the previous speakers, but I the different thing that I want to add.\nThe, two different things that I want to add here are that, with all the construction that recently completed on Warren Street, We resume the service of a number of bus lines.\nAnd I have seen the evolution of our neighborhood whole foods from day, one where we were able to welcome whole foods as a wonderful grocery store, but is now turned into and transformed into another Amazon fulfillment center, which you know with all the political ups and downs of Roosevelt Island, has now found home on Warren Street.\nOne thing I wanted to point out is in the dot's letter they said they're going to trial this for six months, And. I, guess they're going to study what impact it has on local pedestrian traffic and the community.\nDon't know if you're familiar with pedestrian traffic, but it's significantly lower than normal, so I kind of scratch my head and wonder what results you're going to get by studying it for the next six months.\nI think it's fairly obvious, just based upon the location of ps234 downtown community center and the fact that it is the primary way to get to the try to the battery park, ball fields and the and Rockefeller Park I.\nCertainly you know, and as some of my other members of the community and the residents of the buildings have mentioned, you know they do have you know the commercial loading dock on Murray Street that can serve as both incoming deliveries as well as a safe space for the delivery, bikes or vans.\nYou know the other, and so it's still unclear to me and sounds like it may be unclear to others as to why that space can not be utilized and why additional space needs to be built out on Warren Street.\nI mean I, think that, with respect to the community being able to have a place to park their bikes, You know that there's plenty of that on Greenwich.\nI think the whole foods you know has the space on Murray Street that they can, you know, perhaps alter a bit and then use it to for both the trucks vans, as well as the cargo bikes.\nBut, and then you consider Warren Street, which is flanked by schools and community centers and children, and huge residential buildings, whether it's in battery park or our building, I'm, a resident.\nAnd, you know just kids everywhere on that- are one block on Warren Street than there are in the entire city.\nI would think, and it's already too busy, as it is, with the traffic from whole foods and all the bikes already the sidewalks and everything else, as everybody said, and then to add all the other bikes going in the opposite direction on the one-way Warren Street all day, long, it's just an accident, horrible accident, waiting to happen.\nIf we, If it's something new great, if not please just repeat, we do need to do the business of taking a vote, and this is one of two things we have for DOT.\nThat is the fact that on Murray Street the ability to maintain social distances for the people who will be using the cargo bikes, the loading and unloading would be much more readily able to be maintained.\nWe have loading and unloading right in front of all the residential areas on scarce public sidewalks, That will make social distancing even more difficult to maintain for the families and children, the school children, the visitors of the community center and the people that are trying to get to the ball fields to increase both the foot traffic and the the you know, the the traffic of the workers for their safety as well.\nWe do think it's a good idea to get rid of the you know, vans, the white bands that they have that double park on Warren.\nWe can look at metrics that, for example, after December 31st, if there's loading or unloading of any kind from any vehicle truck or Van on Warren Street I encourage people to send take photographs and send it to the community board and submit it to the DOT feedback, because that's completely against what they're promising if they are causing, if they are blocking the sidewalks at all with the bikes and the bikes, are on the sidewalk or packages.\nYou know, obviously, the cargo bikes riding the wrong way riding on the sidewalk things like that, So that's the best that I can.\nI actually heard an answer to the question that was asked, which is there anything community board.\nWe are going to ask for help from our city council person, as well as the borough president's office, and that is you know.\nI believe their way of trying to prevent larger vehicles from using the area that aren't doing loading or unloading like, for example, It's confusing, because cargo bikes currently can use any commercial loading and unloading zone, and so the city has already accepted that risk.\nI think it would be helpful to understand why we're taking away this space in a permanent way, as opposed to a temporary during working hours.\nThat I think that everybody on here going to ask if Lucian can provide a note to who to contact for DOT to make their position known.\nThat's come tonight and have it and have Margaret's office have a discussion with DOT saying you know you got the two big buildings, residential buildings.\nSo, let's see I, you know the list keeps going so.\nSo I'm going to ask that if you still want to speak and if you have something fresh and new that no one has said before, please put your hand back up.\nThe letter comes out saying that they're moving forward anyway and that, if they can complete this final by the end of November, again I feel like how do we know that this is indeed going to be a pilot and that they actually will take community feedback because it doesn't sound like they are or that they will agreed.\nWe're, moving forward towards a resolution, so we're taking notes all right, sorry go ahead and just for the record I do agree with what previous speakers have said.\nWell, at this point, I'm, going to let Lucian on mute, himself, I tend to think it.\nFirstly, I'm speaking more as a husband to a wife who uses a wheelchair, And I, think there's a assisted community living right across the street from us who tend to use Warren Street a lot, so I would like to add their concerns as well just from a traffic standpoint.\nSome people mentioned that whole foods could use basically sidewalk space to basically do their cargo bike pilot.\nEveryone said from the Tribeca alliance perspective in local small businesses going back to the small business committee, We don't get the same ability to use street space for loading and loading.\nWould like to join with everyone else who was opposed to this cargo bike storage space on Warren, Street.\nThink at this point we should do a resolution.\nThere has been zero representation from them, so you know not showing up, says I think we need the thing.\nOkay, so am I getting the sense from the executive committee that this is going to be a negative resolution.\nUp, but I think it would be good if we did include here the failure to properly notify and then to engage the community, because that's been something that we've asked for since our first meeting and in fact why a couple of us, my myself, definitely included if nobody else didn't even feel comfortable voting on it, because there was nobody from the public here when we had the first visit from them.\nI. We want to be really careful and not talk about whole foods paying for it, because if any of our small businesses want the same then you're going to say, okay.\nWe asked D.O.T if they would be using any kind of robust public feedback and engagement for the community in terms of citing locations and what determinations were made on whether or not they were going to pause or not.\nResidents reported that CitiBikes were being written on the sidewalk, including to and from the docks, which is one of the other concerns about putting the dock in the pops, and that sidewalk sightings implies that it's okay to ride in the sidewalk a practice an endangered pedestrians and is illegal bike lanes are not always present, as we well know in community board, one where the city docks are located, and.\nI know that we had a lot of people who were concerned with the CitiBike process over the last several months, so.\nIf we're also passing anything that allows them to continue with infill, which was also part of our discussion, then I think you know.\nYou know they've done quite a bit of infill in various locations in what's called the historic district, Tribeca historic, district, And. I'm, really thinking of the bikes that they added on Lake Street bikes on anyway.\nOkay, so I will read that as you're discussing and then let me just go on record for, like the four main things that I think sure people should know.\nThe community preferences that came out of the public engagement, which really was only at the last transportation meeting when D.O.T finally sent representatives, were that we wanted to minimize the impact to restaurants.\nThey were doing the proposal, They did not I, remember streets right, so we found that out after the fact, I had to work with sushi at the time and propose six other locations because they didn't know there was a fire hydrant there.\nAnd, because everybody on the block said they didn't want bikes in the middle of Dwayne Street, We have taster Tribeca.\nSo, since that time, I've been as many of these meetings that have been called to remind people that we don't want to put businesses, restaurants out of business, and you passed a resolution back in September, which DOT wasn't really participating in and hadn't asked for.\nThey said they have is a requirement from a contractual obligation of how many expansions that you know how many docks and bikes and things like that they have to have that's part and parcel to the conversation of.\nSo, I'll, read that, but I do want to make sure that people understand that there has not been public engagement other than me coming and asking you and Betty he's been super terrific and patient, but DOT has not been responsive.\nI just want to make it clearer that 90 gold street was not asked about this."
        }
    }
}