{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "title": "Parks Committee Meeting December 12.01.2020",
            "publishDate": "2020-12-02",
            "shortDescription": "",
            "lengthSeconds": "0:57:22"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "5OgI96amXeE",
            "fillerWordCount": {
                "uh": 42,
                "um": 158
            },
            "readTimeFullTranscript": "31 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "parks": 17,
                "park": 17,
                "garden": 13,
                "center": 11,
                "money": 8,
                "playground": 8,
                "tree": 8,
                "kids": 7,
                "friends": 6,
                "event": 6
            },
            "wordCountSummary": {
                "garden": 6,
                "parks": 4,
                "park": 4,
                "composting": 3,
                "food": 3,
                "scraps": 3,
                "individual": 2,
                "summary": 2,
                "event": 2,
                "cards": 2
            },
            "fullTranscript": "Hey, hmm huh, so thank you. Oh yeah. I'm waiting for phone calls. My brother had a stroke yesterday. Thank you are so much about somebody that really take care of himself. He runs and he eats well and he walks miles and miles I mean with my fat behind. Don't do that kind of stuff. I am you know it doesn't matter I. Guess you get struck anyway, oh yeah I tell you he never went in the hospital, never he's 71! Okay, are you not Jesse losses at all? Julia? Oh no I didn't know that Jesse Hamilton yeah and his wife lost my mother too. No I did not know that yep. She just died this month thing. You know a lot of people are losing a lot of their loved ones. So all I can do is hope and pray that you guys family continues to stay safe and yeah. My mother, my siblings, a brother and sister yeah. We all know somebody that passed right exactly you know. These are strange times. We live in tough times for many people, so we can do is continue trying to strive to stay in the light. Well, I'll tell you what I wasn't feeling funny, because you know this is a huge house. If I don't want to be upstairs, I go downstairs, but now I feel funny, because they are saying for us not to leave the house, especially people with diabetes and I feel funny. At least I will go to the supermarket and come back now. It's like I'm afraid and hurt me. Let me be scared, oh my god. He's scared yeah just keep your mask on when you're outside definitely keep distance. They asking you to stay to put on your mask inside too. So that's what's concerning me, because I can't breathe with nothing. You'll, be fine. If you're around people that you've been around since just the pause started, you should be fine so long as they keep their masks on around other people. Unfortunately, you know we, the Us is very individualistic society. We've got some really selfish people that seem to have lost a little bit of their humanity somewhere along the way, but we just each have to do our own part and that's to wear the mask. I can tell you mizuna it's a hell of a lot easier to breathe, with the mask on your face than it is to breathe through Covid-19. So just keep the mask on well, you know remember that I had the stroke during the time this started. I wasn't in April, I came home in May and I could tell you that I saw people so I. Don't look like that. I, don't want to feel like that. You know like exactly my girlfriend. She made my heart and my mouth would go with it. She made a few of them, so I have things so comfortable, but and when he comes home on Monday morning it concerns me. You know he went to be tested the other day, so it was negan yeah and that's another thing. You know we need to make testing for Covid-19 as regular as we made testing for HIV and Aids. You know 10:15 20 years ago, and you know, but unfortunately the same little roadblocks we ran into trying to promote HIV testing we're running into a Covey. People are afraid to get tested. They don't want to know they feel it's safer to not know, but the bottom line is we each have our own individual personal responsibilities and so long as those of us that are willing to do so continue to do so, then you know we and for the most part, those that we are rounds will continue to be safe, and that's all that we can really advocate for at this point in time that the individual will do what the individual can do instead of looking to outside courses, for you know to tell us that people's not only afraid of Aids or Covid-19 they're also afraid of diabetes. You know a lot of people. I ask them. Are you a diabetic? Oh they get frightened. Oh no, don't not me I, said excuse me, I was walking with that bill for the longest I didn't know when I went to the when I fainted in my classroom in school. When they took me to my daughter, he was seeing me for 18 years. He asked me: are you a diabetic because hell are you going to ask me about my diabetes and I? Come here? All the time, and then he tested me and said you are a diabetic. Are you you've been diabetic like for 18 years now? Isn't that something yeah? You know, I mean it's not it's so long as this man is just under control. Miss Benbry, you were going to say something well. I was going to agree with your assessment of what's going on in the street and I've gotten to be unsympathetic, because these people are just so contrary and I. Tell everybody when they're talking about my constitutional rights and they're free, so I said you know what they are absolutely right. They are free to commit suicide. In fact, I wouldn't pass it for anyone you're right, you absolutely love it. Yes, Ms Benbry, that is, that I love the way. You said that was very much on point, but you know what we need to do is start reminding these people. You might be free to commit suicide. You can kill yourself all you want, but, however, to endanger other people. Is you know exactly it's murder so and we need to just. We need to stop using euphemisms to describe what's happening. I. You know that Michelle loves the sweet sour but remain on the sweeter side thing and I'm like I know, can we just rip the band-aid off and just call it what it is. But you know it's we just that is right. They have an absolute constitutional right to commit suicide. However, even you know like if you do attempt suicide in the United States, you will be put on a maximum minimum 48-hour hold for psychiatric evaluation. So you know I kind of feel like the laws around these masks and Covid-19 and individual responsibility is a little bit obscure and it's, as you said, contrarian to you, know all the other laws. So it's going to be interesting. Talk about the 48 hours of psychiatric evaluation. We don't have enough space in the jails for the number of people, that's out here, trying to kill themselves and others yeah. It's interesting. It's just really interesting, but I'm really interested to see what the long-term mental health discussions will be. You know no longer can we say entering nine months, the full gestational period for a human life, that mental illnesses and I quote a disease that one can't afford to have, or it's a white people, disease or it's just I was born depressed and you know for people mocking. You know the depression that other people experience. I'm that's what I'm really interested in seeing you know with. We we've had so many opportunities to realize and recognize just how far and wide-reaching mental health effects are and what they are not versus what they actually are. So that's encouraging, even if not a bit disconcerting, but I'm really excited to see what our mental health professionals will be able to come up with long term and especially for those that are like. Ah, my constitutional right says that I have the right to be stupid and kill myself good evening. Everyone, okay! So if you are free to handle your meeting, I'm going to mute myself permanently now, hopefully you don't need me, because I'm going to go back and try to finish some minutes. Y' all have a great meeting to you. Julia have a good evening: okay, Julia! Thank you. Julie I have a question: did she close me? Okay, when you you're recording these meetings, the meeting is being recorded and it's also concurrently being live streamed to YouTube as it's recording. Okay, are you still responsible for sending you written minutes? The state, local, the state legislation for virtual meetings says that there has to be a draft summary of the minutes. Okay, it doesn't say how extensive it has to be, but there is a recording of the meeting and I use YouTube as a redundancy, because I don't always have the best success in the meeting file. Saving when I am the one you know operating the meeting. So this the YouTube live stream is my redundancy to make sure that the meeting is actually being recorded and Miss Henry, Youth and education starts at in one hour, so, hopefully, parks wraps up I know yeah, I'm not going to be too long today. I don't have that much, but is it can it be forwarded to me sometimes? Can that me that recorded meeting be folded to me? Oh sure I will send the link once it once the meeting finishes uploading. It takes about an hour for the full file to save on YouTube and be accessible outside of the live stream, but once it is available I'll forward it out to the committee via the Google group. It's fine, okay! Thank you! So much all right, hello and what's happening so I can't hear you Glenda. Oh wait a minute. Let me see what's going on you can't. Let me see me turn my thing up. I had my son fix this thing for me today. Can you hear me now it's a little bit better? Yes, oh okay, all right I'll try to get closer. We're not gonna have a very long meeting, but we do have a few things to talk about. The meeting is called to order now. It's 6:20. I, don't have the written minutes, but I will have him the next time. I was, you know. A whole lot of stuff was going on. I was out of town for a while. My sister is ill, so I've been trying to take care of her but she's doing. Okay, she's getting better, you know, but I had to go to South Carolina for a while, okay, but with that being said, I like to welcome oh Marva, you new person, I'm here, okay, welcome, hi! Thank you for having me. Okay, you want to tell us a little bit about yourself. Certainly, I've been on the community board since August 2019 I generally have been participating in the youth and Education Committee meeting, which is next and public safety committee meeting, but I'm recently taking on a new role with the friends of Brower Park, so I thought it would be important to join youth and educate parks. Well, Miss Dorothy is on friends of Brower Park as well: Miss Dorothy she's on Nicole, but who's in who's, since Robin left, Right Robin moved who's in who took her position, it's looking like me, but it is a team effort, everyone. It's a team effort, there's an executive board, but it's looking like I'm gonna, be doing a lot of the administrative stuff. Okay. This is great. That's what we were just talking about, I'm so glad today. So what we do. Usually we have friends of reports from the different parks and you know you come to the meeting. You can just give us a summary of what you guys are doing and if you need support from the committee, let us know what you're doing so. We can get that out. If you need flyers for your event, we'll try to get that, go, get it to the community board and then print it up for you, okay, so those type of things all right, well, somebody's at the home going here, I, don't know who it is but yeah. That's me, I'm gonna mute it all right! So welcome! I am so happy you guys you're here. Okay, so we're gonna get started since you have to go to another meeting. I don't have any updates on any other projects, any practice going on, except that there's two things I want to talk about and then we're going to have the friends of report. The first one is Ralph Lincoln Gardens. It appears that we are having a lot of problems. I'm sorry this light just reflected I want to make sure you can see me a lot of problems setting up this getting just moving forward. There was one good thing that there were some tulips that were donated for the park and they Mr Thornton was part of that was there to collect the tulips, so they can, you know, be ready for this for the spring. So, but while they were, there was still some distracting of people that was kind of concerning and, like I know, Gilman you were talking about. There was a problem with a lot of people hanging out in the front and doing things in front of the garden so, and they said, and Miss tires was saying that the gate was open and they were doing all you know some things that you know playing cards a lot of things that you know that needs to be changed a little bit so they're, going back and forth with that. What they end up doing now, they're locking the punk up and the park is going to be I mean the garden the garden's going to be kind of closed for most of the winter to let them know that they can't be going into the property. You know playing cards and doing other things and fixing their cars in front of the building in front of the garden. So you know I, guess we'll figure out. You know after this winter is over. What is the next step, and how are we going to have some type of community to? Let them know that? It's not that we don't want them they have, but we have to think a little differently how we treat this garden because they want to bring it back and renovate. You know privilege to do that. They have to abide by the rules of what God wants. It's going to be done so they're going to put no trespassing on the gate, they're going to keep it locked for the time being and then I guess we're going to move forward from there. Okay, so I'll keep you abreast on that, once I get more information on where's that garden located, yes, which garden was that was around Lincoln A Garden Ralph, Lincoln, Ralph and Saint John Ralph Avenue and St John's place yeah it's near there, so this is one of the guns that Mr Matthews had originated originally started. You know up when he you know when he was chairperson, and so now they want to bring it back. It's been neglected for many years. They do have a few people that are planted a few things in the garden, but I don't know if I sent you guys a picture but I. You know, I went to the meeting that they had and there's a lot there's some work that has to be done there and they want to brainstorm because they want to know what you know besides renovating the park, and you know rejuvenating it. What other things can we bring to the park like programs for the children or some things about the gardening you know about? You know, education about. You, know gardening or those type of things. So it's in a very early process of brainstorming, okay, so we're gonna have multiple meetings and eventually they're going to come to our meeting to talk about their plans and what you know what they plan to do. Okay, so you'll have you'll, hear more about that and that's the Brooklyn Queens trust that owns that property land trust so that owned the property. So there are the ones that are going to be. You know telling us they're playing, but they want us to join. They want the community board to be I'm sorry. I got my[ _ _] getting ready to die on me. I'm trying to make sure the plug is in okay. They wanna they want to partner with the community board, to help you know, but they have their. You know clean up days and when they need, they also have a fundraising. Also. They want to do some fundraising and they have a link where you can donate money to help the gardens. So you know we'll I'll, give you more information as we go along. The second thing I wanted to talk about is that on October 22nd I met with the parks and NYCHA, and they want to redo the Kingsborough park, the park at the and over there in the apartment buildings over there and the park there so they're in the first very first stage of that they want to partner with the community board and the community to find out what they want to do with that. You know the playground, it's a playground, so there were so many ideas that was brought out, but they're going to eventually another one they're going to bring their the plan to the parks before, of course, before it to get it approved before it. Any work is done now. There was just so many people on the on that meeting and they had so many ideas, but they're going to be. Of course, we are redoing the equipments there they're going to be updating the benches they're going to be doing the Astro turf. You know the ground, you know the he do the surface of the ground and a few other things, but those were some of the ideas that were thrown out. There make sure they have proper lighting, you know, and so I'm going to reach out to them and see if they can send me a summary of that meeting. So I can give you a little bit more. You know details on that, but they're going they are going to reach out to us in the beginning part of next year. Sometime, maybe like the spring. By the time they have a plan together and your architect to design what they think the community have already suggested and, of course it's not going to be witness storms and once they bring it to us, we can always say well, we need this and we want that. You know, add things, take things away and talk with the people from the community come to us and have a meeting with all the you know. All of us together. So, that's you know: that's in the future of early part of next year, sometime I think you know maybe like in the spring. They will be ready to come to us and present there. Okay, quick question: is this like an allocation from the council member or the who where's the money for this coming from Jimmy I? Think it was from the yeah, the council person Carnegie yeah? Where is it yeah? Yes, so this was part of it may have been. Also I got to see it might not only just be on quantity, it might be like a partnership also, but I got to see if there's a borough hall just some. Sometimes it used to be Eric. You know for hall and quantity together, but I know I forgot the amount I don't have it in front of me, but I forgot. The amount of budget they had I will have that for you the next time, but is there an active tenant, Association Resident Association there they have some people I think they do have one that they have some people from the building that was on them at the meeting. What about the is there a? What do you call it community center there I know that's usually funded by the you know. I didn't hear nature about the community center. They probably do have one there, but they didn't. They have a big kid there. What happened have a daycare in the building yeah. They do have a daycare, oh daycare, but there's no community center I didn't hear anything about that I. Will I'm not going to say yes or no, but I can look further into that. So there's a lot of brainstorming with that. You know we wanted to make sure that the children you know one of my question was: is the playground going to be like a child from each one or when they grow older, that they have something to play? You know to play with in the playground, so they're going to make sure that the equipments are age appropriate as they get older that they can. You know continue to play in the playground. You know and still have you know some enjoyment with it. So that's one of my suggestions, so you know, like I, said the early stage. We only had the first meeting and we're going to have many more meetings. I can see that and but I think one of the they have a very strong community there, because there was one guy who was very concerned about what they actually put there and they want to make sure that it's appropriate and he just was very adamant about what they actually plan to do with that. You know. With the you know: renovation of the playground, okay, so I I'll, you know bring you up to date. I, don't think we're doing this Regina on the line. I didn't see this no Regina. Okay. Did anyone go yeah? You have a question yeah. Well, not a question, just a simple comment: what are they going to do with the violence around that part yeah, because the buildings to the right of the park there's a lot of craziness going on there yeah, so Mr Matthews had that place. Looking so beautiful, all of a sudden, it looked like crap. That's why we have Mr Thornton involved with this. Also, so he's gonna make sure that the safety over there is a little. You know they're gonna, you know, make sure the police, you know, go around there, a little bit more. You know to try to manage it better. So that's one of the plans they want to do. I. Think that's the first thing. Yes, you can sit there and then all of a sudden, you start running you know, but then what they were trying to do when they went there to do some renovation they had to paint. They asked the community, the people who were playing the cars and doing all this. They said why don't you come and help Kane? They said: okay, we're gonna help, but they never came back. They never came to help paint the gates that they, you know the black paint he Mr daughter brought the paint there. They left it for them and they never got to paint the game. I, don't know and more meetings with the community, so we can kind of break the ice. You know so I think it's just going to take a little time because it's been like this for years. How many years has been like this? You know so. I just have an overnight go ahead, so I'd like to get back to the Kingsborough, I'm pretty familiar with the Albany houses. Okay and they've got a or have had a very active resident association in a very active community center and I hear from Albany houses. So take it for what's worth, that's not the case at Kingsborough and I'm just wondering if there's actually any organized or any organization I mean you know. If you drop all this money into that playground and there's no tentative resident Association and there's no community association who's going to monitor it. Who's going to I mean it's a bunch of people that show up at a meeting and then they disappear and come back three months later. It's a different thing. If you've got you know, a resident association and I know that the Albany houses is funded through Canada, but I heard from them that there was a different funding source for the community center at Kingsborough, okay yeah. That makes me wonder if they're active, because that's a great way to engage kids. Obviously, youth is through the community center. Yes, and if that's not happening, maybe that's I mean there was just you know at least one shooting over at Kingsborough about four or five months ago right that young man was killed right by, like nine cops, yeah just yeah a few months ago, so maybe I mean before you start dropping money on the playground. We should try to encourage there to be some active organized. You know, community input on this thing right, like the brother, Association or the community center I mean the person to ask would be that would be the nature manager. Was she at the meeting? There were plenty of people at the meeting. I think there were at the meeting, but they were like I said there was one particular guy I think he was representing a group. I can't I need to get the you know the minutes or whatever some yeah but further, but he was so adamant about yeah, there's, always one, and then you never see him again for six months. You know that works, but I think he was with a group I. Just don't remember what that was. Okay, so I could follow up with the I think I was the guy. He was the guy who was running the meeting, so I'll go back and you know see if I can get with him. Okay, so but new, that's a good! It's a good idea! I! I'm glad you said that great because I think we think about the community center, and that would be one of the problems that will help. You know I mean Kingsborough is about the same size as Albany right, there's like Albany has like 1250 units Kingsborough was got that one giant high rise and then a lot of low rise. Yes, but it should have the same funding from NYCHA to have a community center and for Resident Association, so, okay, yeah, so I will follow up on that and by the next time we have the meeting, we'll I'll have more information on both the Kingsborough and the Ralph Lincoln. What's going on with that, I think the Ralph language is going to be kind of quiet for a while, like I, say because they're going to close it because they have to play luck on it. Now, as I speak, so people can't get in there. I don't know if they're going to try to know do anything to the property or jump over there, but you know just hope not. You know, let's hope, that everything is calm for this the winter time and then, when the spring come back up, we'll start resurfacing. The information again, did you Linda? Yes, did you ask? Did you actually command an office after seven or seven percent history over there? Maybe he could tell you something in order to protect the land. Yes, Mr Thornton is working with him with the police department. We talked to Mr Thornton because he's the one that's really going back and forth, and monitoring then to see what's going on it. So he's really on top of it. Mr Thornton is really I. Don't know, I know he's my friend I know he's good. Yes, so I can reach out to him and eventually we're going to have a meeting, because that's what Mrs tyres want us to have a joining meeting with the police with the safety and parks about this Ralph on Lincoln, eventually we're going to have a joint meeting, so that's going to come into play anyway. So you know when we have that meeting we'll just make sure we have our questions and our concerns, and maybe we'll have to have him, have the police department. Somebody from the police department comes into me also, so we can have. You know, stay on top of it and I. You know I want to because, just like we say we're going to spend all this money they're going to spend all this money. Do the part the garden over again. We don't want it to be destroyed. You know we don't want to understand misunderstanding that you know something happened and then go back and destroy this stuff, so we got to have some type of meaning of the minds and bring everybody together on one page. You know, yes, you know it's going to be changed, but, yes, you can still enjoy the garden, but don't you know come back. You know all these other things that's going on that they had in the past. Well, you know, I'm retired, now from work and from the school I used to wait for the bus right in front of that building there on the corner and one time I was waiting for the bus and the people started shooting each other across the street, and this is why I keep asking about the security of the place, because to me it's like cancer. Over there. You know they got the required people living next. They don't want anything nice. They want to do the wrong thing fix for the kids because they care there. The kids could come in and plan stuff and all of that, but they don't have to really be sure they do have a few concerns community people that's living in that community that wants to you, know help. So we have to reach out to those guys there's about three or four of them that came to the meeting that day. So we're gonna reach out to them to make sure that they keep the communication going with these. You know these other people. Okay, so you know we'll see what happened. Thank you, okay. So great quickly, do you have anything? Do you want to report about the Imani Gardens? Well, yeah? Actually, there's a big emailing and phone calling campaign right now, because the parks department is not renewing the leases or three big composting facilities which handle most of the food scraps that we pick up at the Monte and other gardens, and so it's going to force these sites to close there's they're going to have to haul these food scraps probably to fresh, kills in Staten Island, oh wow, and the thing is that there's the parks doesn't seem to have any particular reason to close them: they're, not using them. The sites are red hook, farm which is in red hook. Okay, the fight under the Queensborough Ed, Koch Bridge, and there's one on the lower East side. Lorry sound ecology center and they signed I think it was like two year leases with them. They expired December, 31st and parks has just decided. Well, look it! You know these were two-year leases. They're up, you got to go somewhere else. What are you going to do with the whole? There's, none of your business, it's kind of cool sanitation, has spent a lot of money. You know investing on these sites to make them good composting sites. So all that money will just be wasted now, they're- and it just seems- like parks- has just kind of got an attitude. What can I say yeah. So a lot of people are writing letters. A lot of groups, big reuse, growing, Yc, they're, the ones who manage these facilities and staff them there. They may well lose their jobs, you know, and what about partnership for parks? Have you talked to partnerships for parts about this because I know they work closely with the parks? Yeah I know some people there, but I think they probably take their lead from Mitchell silver. That's what I'm hearing from the grapevine all the employees are intimidated to say anything wow. He apparently he's got some legacy projects that he wants to finish up he's apparently his last year or whatever, and you know his legacies are going to be shut down the composting center, not a great legacy. I'm sorry Mr Todd I, don't I'm not familiar with it's called Imani Gardens, but yeah, that's your site, but where do you bring your compost, usually comedy? There's a nonprofit called big reuse and they come by once a week and pick up a large toter and take it to the red hook facility where they composted. So that's one of the facilities that will be shut down the city refunded about maybe 20 percent of the composting budget. After a big fight, they put back 2.8 million dollars, it used to be about I, don't know five times that so they have begun picking up again at drop-off sites like the garden like Amani and dozens of other places, but they've relied on these composting facilities, like the one in Ed Koch Ridge, is very important and is the red hook is very important in Brooklyn, lower east side is Manhattan, so I don't know much about, but losing those sites would be a big problem. Wow yeah I, don't know if he has trickled out, but all right, I'll just shoot an email to Delancey she's the partnerships for parks person that we were working with from friends of Broward Park. So she said she covers I, think she said like eight or nine community boards in Brooklyn. So I'm not certain. That includes red hook, but you know Marvin. If you could put your email on the chat. I can forward you a letter. Okay I'll afford you a letter that outlines the problem because it's kind of complicated okay, it's in the chat, all right. Let me just see if I can get it now and announce me web access. Where is the chat? Let me see here, yeah, I'm looking for there. It is all right, I think chat. Let's see switch audio! Oh there, it is over there where'd it go yeah it's up there. Oh man, oh there! It is all right now, I see it all right! Yeah, it's Marvin Brown to the far right at the bottom, four right hand lower right hand corner. So I'm going to make a note to myself here all right, I, don't see it! That's when I see the chat, so you can tell me all right there we go! Ah, if I can get back to where it was huh. I asked to be added. I sent the email to just communicated eight to see if I could be added to the parks and Recreation Committee like mailing list or whatever. So, okay I'll, try and shoot you guys an email. So you have it okay! Well, I'm this is recording, so I can go back and get it, but all right so I wanted to reach out to you because I know this. A lot I want to. You know, get caught up on. What's going on with brown, Park and I know, Robin was very robust with her yeah with her activities there. So what did she call huh? She went to Manhattan she's kind of like been priced out of here and so she's. Currently you know staying with her son but she's looking for in her own place, stuff. Okay, she loves her though, and well. She spends a lot of time at like a cousin's house in Brooklyn she's supposed to be coming on December 12th to do the leaf breaking here in the park. So she's still, you know trying to be involved. It's just our management company in this building is not friendly and constantly trying to get people out of limit stabilization. Oh boy, that's terrible! That's horrible! Yeah! Okay! So what Marvel do you have anything? Oh, are you finished upgrade? Do you have anything else? No, that that's it all right! So, let's? What did you say? Let me go back one more time that people are there any resolution to this or any chance of them. Not doing this to you guys. This is already done. Well, it's really hard. I got a meeting tomorrow with the group called save our compost and it's all the leaders of this effort and we'll find out more but they're trying to get a hearing with a parks. Commissioner Coo, but the sense is he's not gonna do it, but we have resumed composting. Now, after the Covid-19 at our garden, we have open hours, Saturday 11 to 2 and Wednesday 8 to 10 a.m. So if anyone wants to drop off their food scraps, we're at the corner of Pacific and Schenectady, so we can maybe put that in a minute. So they can get the word out. Okay, I'm writing and, as you speak, Saturday 11, 2, Wednesday, 8 to 10, okay, all right now, Mama just quickly. Do you want to say anything about? What's going on with the parks with Brown Park sure I can, because we actually had a meeting this afternoon at 3:15, so I am getting acclimated to the board of friends of Broward Park, that's, okay! We are having our it's my park day, event on December, 12th it'll be leaf raking and we have a compost Bin in Broward Park, but it's just for the leaves, and so over the time of the pandemic. I think other compost. People had brought food scraps in and you know it's not really conducive to the park setting because then the animals get in there and things like that, because it's just an open bin, and so we know members of the organization have, in the last couple of weeks, cleaned out most of the food scraps, and so now we're going to do this leaf breaking event on the 12th to kind of fill up the Bin more and also put the leaves in the flower beds and the trees and things like that to protect from winter. Although with the way this weather's going, who knows and then we're working on doing a tree lighting, it's probably not going to be the big event that it's been in the last couple of years, obviously because of the Covid-19 pandemic. But we want to at least get the lights on the trees. So we've already gotten the approval from ps289 to have access to the electricity, because that's always the issue right. We need electricity to turn on the light from the tree, so the school has given us permission to use their electricity again this year, and now it's just a matter of getting the permit from the parks department to actually get the cherry, picker up location to get the lights put on the trees, and so I'm actually going to be filling out that request tonight and while there's no tree lighting event, we do have a flyer from Mr Carnegie's office that they're doing a gift to give away in the park on December 9th from 3 to 5 p.m. That's a Wednesday afternoon, and so, while again it won't be the full event with the tree lighting and hot cocoa and things like maybe I can forward it to you, Ms Andrews. Yes, please I should put my email. So is this going to be package a gift for people who come on one gift? I mean yeah, it's okay, so here it is the honorable Robert E, Carnegie, Jr Council member 36th district. It's a holiday gift, giveaway and it says, while supplies last child must be present, no exceptions. So I guess it is for children, yes bring the kids yeah bring the kids and they can get Christmas gifts from the council member okay, so I can definitely forward that and it's going to be in Broward Park. Well, what time Wednesday, December, 9th 3 p.m to 5 p.m. Okay, make sure my granddaughter will come. Thank you so get one yeah, certainly so yeah leaf breaking the 12th gift giveaway on the ninth. Hopefully a tree lighting goal would be to get the tree lit by the ninth, but I. Don't know if that's going to happen, because this is very short notice. You know the Parks Department notes that our request is coming, but it's a matter of how fast they can get it processed and all that. But we do have like I said that the parks partnerships for trucks person who's like really assisting us with that. Did they say what location in the park they're gonna have it park place and Saint Mark's Avenue? Well, it says Kingston between Parkways and St Mark, so I, don't think that's very specific, but I think they usually do everything up at the Shirley Chisholm Circle right there. Thank you I'll forward that name with Gmail.Com. So that's the easiest. One obviously remember that good. So y', all you still you're moving forward. It's still like you got a lot of things planned anything okay, so moving forward to kind of prepare the park for winter. It's not specific to the butterfly garden, but just once all the leaves are off there'll be some pruning of bushes. Going on and things like that, I'd say: I, don't have a green thumb, I'm just kind of more to do administrative work for the organization. I, don't know if I'm regarding or anything like that, but you know my kids and I can greatly, but they are going to be trying to winterize the park and get it ready for winter as far as cutting back and we're trying to get. You know a time where the park gardener can be on hand to direct and guide us to teach us how to properly prune, okay, good yeah, and then you know just keeping up with events moving forward like, as you said, Robin was very involved and integral getting more people involved. So the weight of organizing is not just on one person. Exactly just let us know when you need support from us. I'll try. You know. If I'm available, you know I'll try to help you. If you need support right, we'll just reach out to the community board. You know make an announcement there. Also right. One thing that we're also trying to plan is kids need to be outside and have something to do with themselves. So when they're committing we're gonna do like making bird feeders and we're gonna do Christmas tree ornaments, where we can't leave them on the tree in the park, because that would create litters like maybe make the ornaments there and bring them home. So hopefully we'll get that in before Christmas Holiday, okay, Great fantastic. Do anybody else? Have anything ursa see that you hear you're all new? Do you want to say hi? Yes, good evening, everyone this time, I'm just listening to the wonderful ideas. That's great! I'm excited that's like right where I live? Okay. So if you need any help, you know really just dispatch that because I'm right there thank you just to hear what's happening, yeah! Yes, the goal is just spread. The word. That's what I'm trying to do? Oh yeah, it's great who who's on the line is 917. I, don't see the name who's that it's not Regina, okay, well, okay, so write 9-1-7, yeah, all right, 9-1-7 was here, so anybody else have anything else. They want to announce. I know the holidays are coming up and you know was the tickets up. You know everybody I hope. Everybody was safe and I hope everybody had a good thanksgiving, so the Christmas is gonna, be like quiet for me. I don't know about anybody else, but you know we're healthy we're alive and that's the most important thing so amen. Yes and I wasn't talking I hear I am looking at all of you and my boyfriend over there. I could see him see right, Greg. Yes, the girlfriend almost left this world boys into the city, Council Ursa, yes, I, know well next month, January 1st is on the Tuesday. That's new year's, so I can see if we want to have it the following Tuesday or we can have it in February. What do you think about it? I'm you know I'm even up to you know you guys have put an input to it. I. You know we can have a meeting, but we just have to have it on a different day. I wouldn't have it on the holiday. So us know I'll, let you know. So. If we're going to happen where it's probably going to be the following week, the following Tuesday I, have to you know, make sure it's not clashing with any other committee meeting so I'll. Let you guys know what day that we will have it. If we're gonna, have it in January, okay, wait. It should be Tuesday. The 5th right January 5th is the fifth is on the Tuesday yeah I. Don't know why I thought it was on the same as December, but, okay, all right, so I'll send out we'll send out another link for that it'll be, for you know the same time on the 5th okay. So unless anybody else want to have anything else, they want to say we're going to get ready to end the meeting. Thank you for a great meeting yeah. Thank you all right, bye.",
            "summary": "Then, you know we and for the most part, those that we are rounds will continue to be safe, and that's all that we can really advocate for at this point in time that the individual will do what the individual can do instead of looking to outside courses, for you know to tell us that people's not only afraid of Aids or.\nYou know I kind of feel like the laws around these masks and Covid-19 and individual responsibility.\nIs my redundancy to make sure that the meeting is actually being recorded and Miss Henry, Youth and education starts at in one hour, so, hopefully, parks wraps up, I know.\nWell, Miss Dorothy is on friends of Brower Park as well: Miss Dorothy she's on Nicole, but, Like I'm gonna, be doing a lot of the administrative stuff.\nYou can just give us a summary of what you guys are doing and if you need support from the committee, let us know what you're doing so.\nYou need flyers for your event, we'll try to get that, go, get it to the community board and then print it up for you, okay.\nSomebody's at the home, going here, I, don't know who it is.\nThere was a problem with a lot of people hanging out in the front and doing things in front of the garden so, and they said, and Miss tires was saying that the gate was open and they were doing all you know some things that you know playing cards a lot of things that you know that needs to be changed.\nI mean the garden the garden's going to be kind of closed for most of the winter to let them know that they can't be going into the property.\nYou, know playing cards and doing other things and fixing their cars in front of the building in front of the garden.\nThey do have a few people that are planted a few things in the garden, but I don't know if I sent you guys a picture.\nThere make sure they have proper lighting, you know, and so I'm going to reach out to them and see if they can send me a summary of that meeting.\nYou know to play with in the playground, so they're going to make sure that the equipments are age appropriate as they get older that they can.\nBut I think one of the they have a very strong community there, because there was one guy who was very concerned about what they actually put there and they want to make sure that it's appropriate.\nBecause the buildings to the right of the park there's a lot of craziness going on there.\nYes, You can sit there and then all of a sudden, You start running you know, but then what they were trying to do when they went there to do some renovation they had to paint.\nI, don't know and more meetings with the community, So we can kind of break the ice.\nSo I think it's just going to take a little time because it's been like this for years.\nI think there were at the meeting, but they were like I said there was one particular guy.\nYou know I want to because, Just like we say we're going to spend all this money they're going to spend all this money.\nWell, you know, I'm retired, now from work and from the school I used to wait for the bus right in front of that building there on the corner and one time I was waiting for the bus and the people started, shooting each other across the street, And. This is why I keep asking about the security of the place, Because to me it's like cancer.\nActually, there's a big emailing and phone calling campaign right now, because the parks department is not renewing the leases or three big composting facilities which handle most of the food scraps that we pick up at the Monte and other gardens.\nThey're going to have to haul these food scraps probably to fresh, kills in Staten Island, oh wow, and the thing is that there's the parks doesn't seem to have any particular reason to close them.\nYou talked to partnerships for parts about this because I know they work closely with the parks.\nYou know his legacies are going to be shut down the composting center, not a great legacy.\nAfter, a big fight, They put back 2.8 million dollars, It used to be about I, don't know five times that so they have begun picking up again at drop-off sites like the garden like Amani and dozens of other places, but they've relied on these composting.\nYou know it's not really conducive to the park setting because then the animals get in there and things like that, because it's just an open, bin.\nSo we know members of the organization have, in the last couple of weeks, cleaned out most of the food scraps, and so now we're going to do this leaf breaking event on the 12th to kind of fill up.\nStill like you got a lot of things planned anything okay, So moving forward to kind of prepare the park for winter.\nGoing on and things like that, I'd, say: I, Don't have a green thumb, I'm just kind of more to do administrative work for the organization.\nI, don't know if I'm regarding or anything like that.\nYou know a time where the park gardener can be on hand to direct and guide us to teach us how to properly prune, okay, good.\nOkay, all right, so I'll send out we'll send out another link for that it'll be, for you know the same time on the 5th"
        }
    }
}