{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB2",
            "channelId": "https://www.youtube.com/channel/UCRfzp2GSHg6CIjALtX73JGw",
            "title": "Bronx CB2 Economic Municipality Committee Meeting  2020 Sept 16",
            "publishDate": "2020-11-16",
            "shortDescription": "",
            "lengthSeconds": "1:33:18"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB2",
            "normalizedName": "Bronx Community Board 2",
            "twitterName": "Bronx Community Board 2",
            "youtubeChannelName": "BronxCommunityBoard#2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCRfzp2GSHg6CIjALtX73JGw",
            "twitterHandle": "@2_bronx",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "5vm12IpVSUA",
            "fillerWordCount": {
                "uh": 197,
                "um": 286
            },
            "readTimeFullTranscript": "58 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "dock": 43,
                "miles": 22,
                "project": 18,
                "parks": 17,
                "park": 16,
                "team": 15,
                "hunts": 15,
                "delivery": 14,
                "pier": 14,
                "operations": 13
            },
            "wordCountSummary": {
                "hunts": 7,
                "project": 5,
                "dock": 5,
                "delivery": 3,
                "day": 3,
                "house": 3,
                "park": 3,
                "bid": 3,
                "update": 2,
                "associates": 2
            },
            "fullTranscript": "I think we're going to get started, I guess if Ralph can Ralph mute himself or no because he's the host it's the matter better, it doesn't matter, I'll pay for it just get it. If you want mute yourself, okay, all right, I guess we're gonna get started with Amazon they're first on the list and I'm gonna go get my headphones. But in the meantime, if my dogs start barking, I'm gonna just mute myself because they go crazy for anything who's. The person from Amazon, that's I, can't see. We have Christy Kelly and we have Jessica. Thank you. So, in addition to myself, hi I'm Jessica Schumer, I'm an economic development, I'm public policy manager for Amazon, covering the northeast and based out of Brooklyn and I'll. Let the rest of the group introduce themselves. We've got Brad Griggs our senior manager, Pj and Christy. So why don't you guys just introduce yourself sounds good thanks, Justin and apology. For some reason, my camera is not working but Ralph and Roberto Great. To see you guys again. Apologies. You can't see me but great to reconnect. We've had a lot of you know really great conversations here about our locations there in the Bronx and really excited about the meeting here tonight. For those of you I have yet to meet. I'm Brad Gregg senior manager on Amazon's, Economic development team I lead our efforts on government relations and economic development for the northeast region, obviously including the five boroughs and so great to connect with you and then we've two new team members here tonight, Pj and Christy from our community community, empowering team between the engagement team, so I'll let Pj and Chrissy introduce themselves, and then we can jump into what would love to discuss here tonight. Thanks Brad, your audio, the clarity of your audio made up for the lack of videos. As I said, my name is Pj. Bonjourney I am from the logistics community operations. Team I lead the team here in the New York City Metro region. So thank you all for having us today good evening. Everybody Christy Kelly appreciates the opportunity to spend a little bit of time together this evening. I work closely with the team at the delivery station there in the Bronx and I'm very much looking forward to this conversation and learning about the ways that we can engage more deeply into the community. Great. Thank you guys. So we thought we would start with just a quick update on what's going on at dnj3 or what we call dnj3, which is our delivery station in hunts point which Brad and I can give you and then we would introduce our community operations team and their role and what they are doing and then open it up to questions. If that works. For everyone, great, that's, perfect, so Brad, would you like to start with our update on dnj3? Or would you like me to do that? You take it Jess, no problem so dnj3, which is in hunts point in the Bronx, has been very busy lately, I'm sure you've all noticed, given Covid-19 we've seen increased demand for our products, helping people get essential items help people who don't want to leave their homes, obviously because they have a pre-existing health condition or their quarantine get supplies good services. Anything you can get on our website, and so we have been busy there right now. We have approximately 450 full-time employees, our employees, Amazon employees working out of Dm working at a dng. How many 400 and 450 people directly employed by Amazon, and these individuals are getting all at least 15 an hour, if not more they're, getting full benefits, so medical dental vision, paid, leave, 401K life insurance, basically, the same benefits package that Brad, Christie or Pj or myself get so the same that we give our corporate executives and they, you know, are working hard to deliver packages in addition to those 450 full-time associates. We all are third-party delivery service providers, who are the Van drivers that you guys probably see around the neighborhood we have about 500 I. Think roots are running right now. Christy. Is that right? So that's an additional 500, full-time jobs that we're running out of the site. So it's busy and there's a good news and bad news to that which is as we head into what normally would be our peak season, our holiday season, which is our normally busiest time. We don't expect those numbers to change much because we're basically running the site at full capacity because of Covid-19 I, don't know Brad. If there's anything else, you want to add to that quick update. Sorry I had to get off mute. No from that simple one. I think you know we're. We've been able to really engage well with the hiring process there in the Bronx and we've been able to. You know, get our location really operating at a very efficient level. We appreciate the support, Ralph and Chairman Crespo that you guys have given us that yeah with the hiring events and being able to broedcast that through the community board, that's been a great effort and great level of engagement there. We appreciate your support on that process and you know I think one of the things that we want to do now with Christy and Pj and Board is talk about how we can engage through you guys on our efforts there in the Bronx and what they're going to be looking to accomplish so I. Think I I'd like to you know turn it over to Pj and Chrissy to let you guys know more about what they're going to be doing now as a team broadly and then what we can look to try and achieve there directly in the Bronx. Alongside of you guys, on the community board thanks Brad again, I'm P.J, bon Jordy, I'm leading the community operations team out here in the New York City Metro region. I just want to say a few words about our team. Our our purpose and overarching goal for our team that Christy and I are on, as well as our commitment to partnering with communities like the Bronx and elsewhere in the city, and then I can pass it over to Christy, who will say a bit more about some of the specific work that we've been doing in the relatively short time that we've been a team and also talk a bit more about how we can even get more engaged. So our community operations team is part of our broader Amazon logistics business. Our Amazon logistics business is our last mile delivery, business operating there in hunts, point and other places in the city and around the country and about I think in May or sorry. In April of this year, our community operations team was formed and has been growing ever since our our roadmap and overarching goal at the 30,000 foot level is to do what we can to make sure that we're being the best neighbors we can be in the communities where we have last mile delivery operations and, broadly speaking, we kind of do that in two broad categories. One is promoting operational excellence of our Amazon logistics business, and here we're talking about working with our local operations. Our delivery station managers, our on-road operations, to ensure that community members, our customers, community members at large, are having a positive experience with our Amazon logistics business and operations. So we will work to ensure that you know traffic is staying under control that that other on-road issues are not impacting communities negatively and also will work through issues whenever they arise with community leaders and community members that may be experiencing any challenges with our operations. The second part is what Brad and others have been alluding to, which is our community outreach and engagement efforts. We've come up with some guiding principles that help us focus on the types of outreach and the types of organizations that we want to support in the communities where we have operations, but ultimately we're really driven by a hyper local focus. So you know, while we have those guiding principles, we're ultimately looking for ways that looking at community needs on a hyperlocal level and seeking out ways that we can support organizations that that are looking to address those needs, so I can pass it over to Christy. Now, who can talk a little bit more about some of that hyper local work that we have been doing thus far in the city? In a few months that we've been that we've been doing this work thanks P.J, you know he outlined the work we're doing operationally and our goal really is that you know at the end of the day, you guys feel that we're being a good neighbor and that you like having us in your neighborhood and some of the ways that we've this even the last few weeks been engaging with communities in the Bronx, and then you know, certainly in throughout the five boroughs. Is we've been doing things like delivering backpacks filled with school supplies to schools. We've delivered food to food banks, we've delivered PPE to Va's just this morning in the Bronx actually elsewhere in the Bronx, I dropped off about 200 headsets for the kiddos who are having to manage school virtually or you know, doing a lot more school work from home and having to stay plugged into a computer. You know I think there are myriad ways that we can get involved. We're also looking at and exploring ways to figure out how we can support the south Bronx asthma partnership out. Having outlined some of these areas would love to turn it over to you guys because you live there. Where do you see the need that we could be? You know, uniquely positioned, to help support or lean in deeply or really help you guys make a difference. Can I say something: Miguel Caldwell from Urban, Health and project hope. Absolutely. First of all, you know the things that you mentioned. You know they're, wonderful, thank you. You know the PPE is definitely the headphones for the children that are homeschooled. This is it's all very important, but I. Just one quick question of the employees that were that are hired that are working now. Is there a way that you can state what percentage of those people are from the hunts point area? And if you can I understand and the reason why I'm asking is because you know we have people in the community that are in need of employment if there's something that we're talking about trying to support that that's a key factor of trying to get more of our community residents employed. But I was just curious if there was any percentage that you might know of the people that came from the community that were higher toward the end of the year in the barn. So this is Jeff and we did this exercise before Covid-19 and I'm looking to pull those numbers. I don't know if we got as detailed as hunt's point, but we did get. You know the zip codes right near hunts point and I'm gonna try and pull those from what I have. Obviously that may have changed since then. This was before, but we are trying to run our hiring out of the site at least again before Covid-19. Now it's more virtual, and so we really are trying to target that local community for hiring, but I'm gonna go on mute while I try and find that from pre-Covid sure yeah I had a couple questions, one I guess giving headsets. Thank you very much for that, but also I. Think a lot of a big need in this city, and especially in this area, is a lot of our kids are just in terms of internet Wi-Fi in their homes, I mean Amazon, be able to give hot spots for these kids to be able to do online schooling, or even for the schools to distribute amongst the local schools here in the 104 in the peninsula, as well as whether it's computers chromebooks something for the kids to take home for those because a lot of times you might have two or three kids in school, and they, if there's only one computer everybody's, got to share it. Those are some issues that we're hearing about that. A lot of families have that I'm sure Amazon can definitely assist with, as well as I. Also had a question about. You mentioned the site. I forget how you how it's designated in your terminology, but the site, that's the 1300 Vieli spot. You guys also opened another area on Longfellow, there's trucks in an old site on sims recycling, not the one on edge. It's on Longfellow I I'll, try to figure it out, but did you guys have another spot in terms of at least keeping trucks and so forth? I think Jessica right, you had told Ralph and I when we met a while back that you guys were planning to open up one of the sites in hunts. Point yeah. Sorry I just wanted to follow up on the previous question, because I found those old emails. It looks like, and this again was backed in late January, so obviously things may have changed, but from the zip codes immediately surrounding the hunts point area about 81 or around you know, close to around 15 percent of our associates are from there and then, with our Van drivers hold on I'm pulling that right now so of the Van drivers about 200 of the around 500 are from those zip codes. But this is again updated information because you know there's turnover, but I just wanted to make sure you guys have the latest and we're happy to look into that again. Yeah. We can definitely get updated info and we'll have our teams pull that and turn that back around to you and then on the locations. We do utilize at from time to time off-site lots when we hit the repeat capacity, so that might be what you're referring to. As far as the Longfellow lots, our contractors for the vans have a requirement. As far as you know, when we have the independent contractors that, if because of the location they're on Valley Ave and the parking requirements of the site, we have to sometimes utilize off-site lots when we're running at this Covid-19. You know, unfortunately Covid-19 peak level, and so they from time to time we will work with them and they will identify lots and say all right, we're going to do a short-term lease with that lot, and so, therefore they may not come directly through Amazon. That might be a lease that they, as the third party independent contractor, have set up. So we can check on that location and get back to you guys on exactly what is happening out of that site. If you can get us the address. Okay. Thank you. Yeah I'll, get that for you within this. Within this meeting, I'm trying to think I had another question: did you guys are also not necessari? Is this our community board where the old ABC carpet was with the pro-largest site? No, that's, not that's nine! Okay, but is there that's also going to be Amazon? Is it like correct? It's a Bronx, River Avenue, Right Box River under Brook, now, yeah I think we actually may have just had a call earlier today related to a Bronx river site. It's pretty early in the pipeline from a due diligence standpoint. It's not I, think you're mixing them up. No I know the core of them were right, but there was another call on this. So I think it's very early in the due diligence process. We still have the other ones in the pipeline and we're working through. It may be something that we'll be able to update shortly. My anticipation is that what we're looking at related to that location could be later this year, that we'd be able to give you a more significant update for that site. Okay, Maria, oh yeah! We got one other thing in terms of 1080 Legget. Are you guys doing that entire site I know it's like dual level like you have the 1080 legget that you see, that is, connects to the last yeah right with Lafayette where's that garrison there's also the lower part Ralph. You remember where the mechanics were supposed to be the sunrise 80,000 square feet. Is that also part of the new Amazon, so the that legged site I believe is not a delivery station that we're evaluating for that's a ultra fast fresh, which is our grocery delivery process, just correct? Yes, so that that's what we're evaluating there and from that standpoint, if you want to kind of get, we can give you a quick overview of how the ultra fast fresh. It's basically, you know our grocery delivery service that we're looking at for that location, so it wouldn't operate just like the. It would be a different operations from the delivery station location that they're in the alias, but it would allow for increased delivery capacity for groceries in the hunts point area. Okay, all right I got a couple of things. I'm sorry how many jobs are expected there Jess do you have the numbers for the whole time, I don't, but I can get them and follow back up. We'll have them for you in the email chairman, okay Jessica, you could give me. Can the 500 drivers what was the percentage for community boarding around? So again, it's not gonna be worth two. These are the zip codes surrounding hunts point. We did the closest zip codes and it was around 200 and again. This is as of January 31st. So the world has changed a lot since then, so I don't want to promise that we're at the same point, but you'll get us up to date. Yes, we will get you up-to-date numbers. Thank you. I just have to go off camera for one minute. It's my turn with our son, so I just need to bring him. Don't worry Jessica! Thank you. I just want to piggyback off of what Miguel was saying about hiring. You know whenever the opportunity presented, so we could reach out because we do have everything at home. I got him and then Brad or Jessica. If any of you can answer, like I'm happy come with me on your call: okay, hey Jess, yeah, you're yeah, that's okay! Don't worry about it! I'm either. Thanks rob yeah! No problem. I got it so Brad, I'm having a lot of residents, reach out, saying that they applied and have not heard back. If I get their names, can I shoot you an email just so you can follow up with that. Yes, just like when we did the last time you had a couple candidates when we met with you and Chairman Crespo. If you give me their names, we'll work with workforce staffing on what happened. Okay, that works. If you still want me to like you guys this Bobby, but you haven't questioned okay, Bobby I. Don't need to be told twice, I guess my last my I don't have a question but more of a comment. You know I've always emphasized with you guys, I'm trying your best to remain invisible and we I mean I, see the Amazon trucks all over the place and to hear that you have a third party opening up a warehouse, maybe just so that they can have their vans in the district. If there's any way that you can relate to them. This message of remaining invisible because clearly we're having a lot more truck traffic with you guys in our district, and it's always been a concern regarding truck traffic and just what comes with it, the negative that come with increased amount of truck trafficking. So if there's any ways of staying off the local streets, I know we discussed the gas station. A lot of them are gassing up right across the street, from the Mcdonald's on garrison, but for the most part, I have not heard any major complaints, which is a good thing to hear that you have 450 employees and viele plus another 500 drivers. I think you are remaining invisible to an extent, but that is one point that I'm going to always emphasize as far as remaining invisible and staying off the local streets. I appreciate that yeah totally understandable and from the off-site lot on Longfellow that that is not an additional warehouse that we'd actually be operating. It's merely the parking lot. If we are utilizing it and we'll get answers on exactly what's going on there and be able to get back to them, so we're not actually utilizing a warehouse for operational purposes. It's just an overflow parking lot right, no, which is fine and I'm happy that you know, there's a need for it. Obviously, however, it's still the amount of truck traffic in our community and the main emphasis is remaining invisible. That's what I have so chairman, Madam Chair. Thank you so much I, don't know if you have anything else for Amazon I, say something bro it's Maria's show but I guess so can I say something please sure Paula I, just my name is Paula fields, I'm the treasurer of Community Board too, and I just wanted to pick you back off of what Maria was saying in reference to the internet. A lot of parents in the district, especially on my side, are having problems with internet and logging on, as you said, there's more than one child in the home. That's doing the remote learning, so you know if you could just reach out if Amazon could reach with and partner with the pals and the casita Maria's in the district that house and do a lot of work with the students in the district. That would be a great partnership for you guys to look into taking down that note for sure, as well as the 401 council, if possible. I'm sorry can you repeat that again, I want to make sure I get the note, as well as the four one council reporting. First recent council. Okay, they have a big avenue of communication. I know that we were told today that you guys were having some break-ins on some of your trucks in hunts. Point and I just want to relay that. We we've been in communications with the 4-1 and the 4-1. It has informed us of that they've apprehended an individual that had done it a few times. We had the Da's office to get this morning also, together with with the 4-1 and they're, proceeding to make sure that this individual, because it's supposedly this individual, has broken into your truck several times and has let go so we're staying on top of it. We want you to know that you know we will do whatever we can on this side and I informed the district attorney's office that we would like to hear that this individual got some jail time. Only because you know I know people do crazy things these days, but we need to do. We also have our partnerships with you, guys and you're part of the community, so we have to make sure you're protected as well. We appreciate that a great deal and yeah I gotta, say your guys's ability to help us engage with the 401 was also really helpful in the midst of the pandemic, and you know, unfortunately, when there was the riots and some of the things going on the relationship, you guys helped us establish there. Actually, we had a report come through from the precinct that there might be an incident where they were targeting our trucks heading out of hunts point, and so we were able to shut down the facility, get everyone safely out of the location and get and make sure that our employees and our drivers were not put in harm's way, and it was really great. You know it was great coordination. It was an unfortunate event, obviously, but it was a great relationship standpoint for with the 4-1, and we really credit you guys with helping us make that connection. You know together a lot of that comes from Ralph. He did a lot of that work so on behalf of the board, but he did most of the work and, together with Maria who's, our chair, they're, the ones that did a lot of that work. Okay, yeah, I'm sorry, Ralph yeah, not your head, I mean this is great. You know at least like they had mentioned earlier. They met with Bobby, and my and myself a long time ago, I'm gonna say like January. So this is the first meeting back. I'm happy that they were able to jump on. I gave them a week's notice, but they would look. They have a whole, their whole team here, so I really appreciate the efforts that they made and following up with whatever they can assist in their community, like what Madam Chair had mentioned as far as creating hot spots and jobs. Obviously those are the two big things that we're looking for right now, so I also just you know to I mean any opportunities of greening and electrifying. Their trucks would also be helpful. As you know, we move forward. In terms of you know, we see everything that's happening in this country in the world in terms of climate and resiliency. Those things could go along a long way as well. What wasn't that a discussion that we had, the last time, Jessica or Brad, I, don't I, know, did talk about yep and yeah. There's been a lot of commercials, which are both a great thing to see, but also it makes it a little difficult because there's just not the capacity of vans available. So the what we have done at every station, including the one on Vl and any future delivery stations that would come into hunts point. We have designed the facility to allow for future electronic vehicles ev vehicles to be able to be deployed at that site. The issue is, we want to put as many electric commercial vans in our delivery fleet as possible. The issue is they're, just not manufactured yet so we have literally created our own demand and manufacturing process to create a fleet of 10,000 electric vehicles that will be deployed, but there just was no manufacturer in north America that could deliver these electric commercial vans to us. So we have designed all of our facilities, including the one on the alley to be forward looking to allow for the deployment once these vehicles are manufactured. Our understanding right now is a conservative timeline. Is early 2022 we'll see the first significant deployment of these vehicles into our delivery network. Okay, thank you. I mean there's a lot of talk in the news about electric electrifying trucks and all the companies that are trying to get in on that. So hopefully, Amazon will also take advantage of that and start doing that with the vans that we see. Okay, any other questions or thoughts. Yeah, then you're more than welcome to stay on. If you want to see a presentation by the parks Department, but you guys are great and I'll definitely follow up with you via Email, Jessica and Brad. Thank you so much appreciate the time. Yes, thanks. Thank you for the whole team coming out. Thank you, Mr Chair. Thank you Ralph. Thank you. Everybody. We greatly appreciate it have a great evening. Thank you. Continuing this relationship thanks, everybody thank you, yeah all right, I guess! Next up we have Chris Amay from parks. Is that did I say it right. I know, Mike is on oh I, see Chris is Mike under an alien, alias Mike is right here. Sometimes hi. My name is Chris Amy. How are you all doing today? Okay, hi? How are you I'm good? I am with the New York City Parks Department, and I'm going to talk to you today about a capital project for a dock replacement at hunts. Point Riverside park shouldn't take too long. I'm looking to get out of this conversation. Any questions you'll help you out with any questions you might have, but then we'll need a letter of no objection from the community board for us to move forward with permitting and oh there I am with permitting and and just for with our typical process. So I'm not sure who has control over the presentation, but I'll just jump right into it. Like I, said reconstruction of the floating dock at hunts, Point Riverside park, which is, if you're not familiar at the end of Lafayette Avenue, I'm the project manager, I'm the deputy director for Marina infrastructure for the Parks department, it's being designed in-house by one of our in-house engineers. That's Gabrielle, Chernik who's, not here tonight, but I can. If there's any technical questions, I'm sure I can get them back to you. The total budget for the project is not very much for a parks project, especially the marine parks project 350,000 of council money. It should be just enough to do the scope that we're talking about here. You can jump to the next one, so the goals of the project, initially, what the funding came in for was the first goal here to restore and improve the dock for human power boating activities. The dog is a key site along the Bronx river for the Bronx river water trail for kayakers and road, boaters, and so on and so forth, and there were some issues that the major operator rocking the boat had with the original design we'll get into that later. But that's what that's where this project is coming from, once we got out there and took a look, there was some deterioration. We want to repair and also there's an environmental problem with the dock design that has to be fixed for permitting purposes. So those are the three main goals you can move on. Here's just the location in case you weren't familiar next, it's in a flood zone as most of our parks are so we'll have to design. For I'm sorry, most of our docks are so we'll have to design for some flood elevation issues, but that won't be a problem. Next, this slide the only real reason to look at. This is just it is an industrial area, as you know, which is actually relevant to the design of the site, with the commercial haulers of scrap and junk that are upriver and we'll get into that a little bit more next. So here you can see the park itself, you can probably possibly see, depending on the size of your screen. You can see the pier and the dock jutting out into a little cove in the river, so the dock itself kind of follows the shoreline of the larger river, but it is sheltered within a cove so and we can move on, but also you'll note here as it exists at the end of Lafayette Avenue, it was originally part of Lafayette Avenue. It was in the D.O.T right of way. Part of this project has been decoupling, that park from D.O.T, so parks took ownership of that property, not ownership, but we took control of that property through the process of this project. This is the dock in question. It's supported by two rows of piles that are parallel to each other. Four on each side of the dock, which is part of the design problem as you'll see on the, but you can also see some rusting here- that's typical of all the metal structures and infrastructure and there's some problems that go along with that rust and corrosion. Basically, the dock. Once we got out there and took a look, it had to be replaced. It's just not cost effective to repair next, so you'll see here. These are the boats that rocking the boat, which is the adjacent operator, typically use. You can see just from looking at these photos. They don't pull up alongside the dock. That's because the piles are too close together. The piles are those tall white pipes, so you can not pull a dock up. Sorry, you can't pull this type of boat up alongside the dock, so it's just not an ideal design for the type of use that we want to see here. We want to encourage- and it's been trying to utilize the site ever since it was originally built, so we're going to try to alleviate that problem by shifting some things around. You can also see in the background here in both photos. You can see a pile cluster, a black pile cluster kind of off in the distance on the top left of the corner of the pictures. You'll see and we'll see it on a map in a minute. I'll talk about that, but also beyond you can see the scrap hauling sites where the you know the junkers and scrappers haul their stuff down river, which is a site condition that we have to deal with here next. So this is a major problem. This dock rests on the mud, flap permitting wise. We couldn't get DEC to re-permit this if we were building it from scratch, it's damaging to the mud flat, which is a tidal wetland area. The dock originally was designed to not rest on the mud flat like this, but either because the mud level has grown or because of the failure of some of the dock systems. It does now. So that's no good. That definitely has to be fixed, which is part of why we're going to propose to actually move the dock slightly and we'll get to that in a second. Also, you can see this gangway here on the right hand, side that gangway doesn't rest flush on the dock, because the dock is resting on the mud flat and that kind of bends and twists and warps the gangway, which is no good. The gangway is going to also have to be replaced because it's no longer considered or I, don't believe it ever was considered ADA compliant we're going to need a slightly longer gang way, so replacement of the dock and replacement of the gangway are going to be involved, skip to the please okay. So this is basically the gist of what we actually want to do. You can see the dock overlay here is showing we're going to move that dock slightly deeper into the river, which will get us off the mud flat and onto water to keep that dock floating at all tide levels. It's better for the environment, it's better for permitting, and it's going to be better for the users who don't have to worry about their boats. Getting stuck in the mud at low tide, we'll have to adjust the pier slightly as you can see. In the right hand, photo just because the angle of the gangway that leads down to the dock it'll have to be adjusted, so we will adjust the pier and then make it look like. It was always designed that way, with matching railings and so on and so forth, and then the dock would move down in deeper water, and this is there's not much play here. This is the farthest out. We can move it because of the commercial traffic, those pile clusters. I mentioned the black pile clusters. You can kind of see them to the North, North, West and southeast of the dock they're there to protect it from barge traffic, because apparently a barge did hit this dock at some point in the past, so we can't really move out deeper than those pile clusters, so that's kind of determined exactly where we were going to go with this dock there's not really anywhere else for us to go with it. This is the only place it's going to work, but we think we have the funds to do it and we think it'll solve all the condition problems that we have just some of the materials we're looking to replace, replace it with a floating dock. Here in the top left, you can see aluminum frame, rpl plastic, timber dock material, exactly the same as what we have there now, except we'll have only one layer of piles on the side of the dock that we're working with that we're reinstalling. So that way, we'll have a nice flush edge on the outer edge of the dock, so they can pull up as many boats as they want to. They don't have that problem of cramming them in between the pilings, and we think that engineering-wise that works, fine, which was good for rocking the boat, the operator, but also for anyone who wants to pull up a kayak or a rowing skull or whatever they don't have a nice flat ice to work with and we'll be replacing with the ADA compliant aluminum gangway, not as long as the one shown here, but a little longer than the one that was originally provided and totally to code. You can go to the that's really it so that was pretty quick. Only thing that wasn't in this slide presentation that I, anticipate you might be interested in is the staging of the project. This will all be done from land. We don't have to worry about bargaining, water, probably just a truck or two coming in and out of the park. So anyone in the neighborhood won't even you know, really notice, aside from the pier being shut down, probably just for a couple of weeks. The anticipated construction start here, ideally, would be for the fall of next year and the construction time that's allowed in parks contracts is a year I. Don't think this project will take that long, but that means that the completion time would be fall of 2022. If there's any questions, I'm happy to go into anything. You like I, just want to say, Madam chair that you don't have quorum in your committee, although we have three executive offices, I, don't know how you want to handle that before we have any questions or if anyone starts to make a motion, there's no quorum for the committee, so I just want to bring that to your attention. Okay and so parks will need this letter. They need a letter, am I correct the letter, a letter of no objection says advice. A letter of support would be great too, but some just something letting us know that this community board has no issue with the project, so we can move into our permitting. That's it for us, and you would like that letter before the end of the month, but at the end of the month, because the sooner you get it the sooner you can get started right. Yeah, yeah I mean we're rolling things in parallel. I wouldn't say that you know I'm not desperate for it immediately, but if you could do it by the end of the month, that would be totally acceptable. You know anything beyond that would be. We would probably be fine too, as long as I had an idea of how long it's going to take for scheduling. Okay, if I can I like what I saw, but there's one thing that I did nothing that I have concerns with, and that is a offense for that area because, as you make it nicer, you're going to have more people interested in the area and I'm afraid that what happened over at Stonehike Park, where you had kids going out there hanging out and trying to swim. There was no prevention of them jumping in yeah, and that's my concern that I seen this particular project, this particular site. It has been an area of concern for swimming before you may have seen in one of the photos that parks has. We don't have many of them honestly, but there are, is a parks life ring here, a float. You know one of those emergency floatation device boxes, the parks keep stocked with a life ring. So that is a concern, our typically for a parks, Kayak launch or floating dock of this nature, they're, not locked off. You do need to have a permit to launch a craft from there, but the pier is a fishing pier is used heavily by the community. Is my understanding from the meetings we've had, so we don't typically lock it off because that's the major use, but then, of course, when you have the floating dock, you have to think about that potential of swimming or other unauthorized uses. So it's signed no swimming. We have you know the flotation device for emergencies, but it is a valuable. It is a valuable note. We do keep this particular pier gated, but, as you probably know, it's not typically kept locked and there has not historically been a gate from the pier down to the dock and I would if that was. You know. That was something that we could potentially look at that replicated at other sites. We haven't considered it yet at this location, but it is a possibility, depending on whether that works or within the space, because it's a rather limited range of motion at the end of that pier I want to thanks. Chris I want to add to that and I apologize. If there's background noise, this is Nate Grove, I'm the chief of waterfront and marine operations for New York City parks, I appreciate that concern expressed I responded directly to the Starlight Park tragedy losing track of the years, but maybe five six years ago, and we we did a lot of thinking a lot of discussions, a lot of engagement with all interested parties and, ultimately again Chris pointed out some of the measures we took. There's a. We have a lot of launches citywide. Only a few of them are actually floating docks. Where people were kind of more of an attractive nuisance, you might call it for people who want to see if they can use it as a swim platform. Two of those are on the Bronx river. This being the second one you mentioned, Starlight Park. So what we did do with these sites is install. Those life rings, I pay for those when they get stolen. We constantly replace those. We have people checking those weekly another measure was the closing gate. The concept being you know, kind of like a kiddie pool that, if a kid wanders off a toddler that there's a gate there, that they can't they can't open themselves a toddler, but but ultimately, the rule of protecting our waterfronts is that people need to be able to get out as well. So the idea of locking everything becomes fraught if there's an emergency, if emergency responders need to get in or out, we really can't find ourselves in a position where we're locking people out of our out of or exiting our waterways. Finally, I worked very closely with NYPD and we installed those emergency call boxes both at Starlight Park and there at hunts point Riverside park. This was only six sites, city-wide, where we did that full treatment and two of those were in the Bronx river. So those are the measures we've taken. Chris mentioned the signage, but at the end of the day, we think that this is a successful combination of response to that very valid concern. Ultimately, I've been at this job now, 18 years, I don't want to jinx it, but we haven't had any incidents at this site. Starlight Park. We obviously have in concrete plant park where people just go in the water, regardless whether you have a dock there or not are kind of some of those challenge sites as well and- and we did similar treatment at those. So I can answer other questions. If you haven't flabby anything else, no I, I'm just saying I enjoy what I saw, but my only concern is that, but if there's going to be police call boxes there, I would think that they're connected to the 401 precinct, where the 401 can respond immediately. You know somewhere. Communications has to be because if, in the event a child decides to jump in and he has a friend there, I understood that the one in Starlight Park it took a while for the individual to go out of the park again to try and get some help for that individual. You know I, that's my only concern it is that and I understand that you can't close form because you want them to enjoy it, but also we need to be safe and bad enough may do it, but when it's a child, it's even a bigger loss, the community, and so when I, when Ralph presented this to the executive committee a week and a half ago, I said well what about gates what's happening with case? And you know he says. Well, let's have them make the presentation. That is my only concern out of this whole situation. Is that this? Oh, that there's no pre we shouldn't be preventing, but in most parts I believe you close it up at a certain time. You know you've got pep offices, you could come over the pep officers and closer. You know to make sure that at least in the evenings, there's no such danger. Yeah Bobby, a few things- I, don't know! If you guys can hear me very well, but sometimes the microphone comes in and out, but you're fine Mike. We can hear you Mike. We can hear you yeah over at Starlight Park. One of the issues was that the NYPD there's two different priesthoods that intercept there and they weren't familiar where exactly the doc was so one of the things and I believe that Nate was part of the conversation with NYPD on that was to make sure that we put a call box because the call boxes have a GPS to them. So if somebody would press that call box, it would have a direct tps to it and over at at this point that we're referring to when we put one in Nestle. We also put one in here- and this was also the location where we did the water safety- that we installed the self closing gate through the pier or the gainway, I'm not exactly sure where, but it's a the self locking gate where a toddler can't just run out, they would have to be able to open it. So those are some of the safety measures that we have taken here. So I just want to mention that as well. I'll. Just add to that Mike thanks for that, that's absolutely right! Look! This is an issue citywide, often where, as good as our emergency response services are, if it's in a park, they often can't find it. So that was one of the big motivations of getting those call boxes. There is that it immediately identifies where the person is calling from quite frankly and you're talking about 15 16 year olds, a lot of times. They don't want to use their own phone even when they have it. They don't want to admit that they were doing something they weren't supposed to, so that call boxes also gives a level of anonymity that makes people more comfortable to call in an emergency. So you know it's I, think it's one of the best things we can do to ensure safety along our waterfronts. Also, we do lock this part in the evening, so it is one of the parts that we lock up and the gate. The fence on the front of this park is pretty it's a high fence. When it's locked up yeah, it's I can't see somebody getting it's Chris, the operative word. There is when you lock it up. You know. That's the operative word I want to make sure that at least it gets up every evening. So like this, don't have curiosity in the evenings. That's yeah, I'm sure. So at the moment we locked up about 110,115 parks, but we have about three crews that go out and they don't always start at the same park. So you know they're, basically like ultimate, but they go out beginning in the summertime beginning around nine o'clock and they start locking up the playgrounds in the parks throughout the barrel. So, even though the status quest draws at ten, sometimes they won't get there at ten. Sometimes look after ten thirty eleven sometimes they'll closed at add time. Sometimes they have issues where people become confrontational. If they're trying to ask someone to leave and they become confrontational, our crews basically just leave, report it and try to come back later. Fortunately, for us, this is not one of those sites. People when you ask them to leave here, they do move. We haven't had much issues of the sort. So you know we've been fortunate, and hopefully that continues: okay, thanks and nice to hear from you Mike, I'm just trying to think you know the other concern with that doc in the previously was I know under hurricane Sandy. That one was one that kind of the tide came in and it kind of jostled, the dock, and it was kind of you know you guys had to do some repairs from it with this new design. Is that something that's going to happen again? I mean like the way it rises. It would give that give and take with the tides. Could that be a problem again? Should another storm happen or I mean I know it's probably not completely storm proof, but just some thoughts on how much more resilient this stock will be in the future. With this new design yeah, this is so the design at that time and I would have had to have understood the condition the doc was in at that time to go through what I went through, but there were some failures on the in the underside of the dock and in the chalking system that held the dock aloft at low tide. That I think probably would have contributed to any kind of like inability of it to properly go up and down. It also is missing a lot of the collars that attach it to the piles. The kind of infrastructure wear that was showing on that dock now I would say would make it difficult for it to activate properly in those kinds of extreme conditions, but then what it was at the time of sandy I can't say so it should work as as designed it should be able to go all the way to the top of the pile and back down in the event of something like Sandy. The gangway will be conditioned to be able to handle the incline change to to the degree allowable. So you know it's hard to stop perfectly storm proof: everything and a lot cheaper to probably replace a dock and to make it impervious to every kind of weather event. So that I mean that's the best answer. I can give, but it'll be better in much better condition. Now, when this project is done, then it would have been probably at the time immediately preceding Sandy. Okay and I'm sorry, can you give the time frame of construction and what are the safety measures that'll be happening then, and then for and then. Lastly, regarding rocking the boat and their access to it, how did how will that work sure so I'll answer the second part of your question. First, so rocking the boat won't have access to the dock during construction. Obviously that's just impossible, but what we're going to try to do is maintain access to the adjacent shoreline which rocking the boat uses a lot. There's almost like a boat, a gravel boat ramp immediately adjacent to the pier that we would ideally not have to pen off so they'll be able to get boats in and out of the water. During that time period in terms of site protections, there will be a fence on the staging area, which will be some portion of the grassy lawn adjacent to the pier which will be needed to park a truck and just to store some material, whether or not that needs to be secured with a higher fencing or just kind of portioned off with the orange plastic range fencing we're not quite sure yet, but there's definitely enough space there to stage everything we need and to park the construction vehicles, which would just be a van or two for the scope of what we're talking about and then in water protections. We'll need to do likely a silt fence here to keep runoff of mud and muck from the construction. In case we do, you know, have to interact with the river bottom during the removal of the dock, that'll pen in any environmental concerns and and then the pier will have to be closed as well during that time period, so that'll probably be the biggest frustration to the community. I would guess, is that the fishing pier being out of commission for that time period and, like I, said that could be up to a year, but I don't anticipate this project to take that long, but that, but it will be part of the contract that it will be closed off for that time. So, it'll, you guys, are again I. Guess it's dependent upon when you get all your approvals but you're. Looking it's going to be like 2021 to 2022, yeah fall of 2021 would be as of right now our ideal start time, and so the contract would allow for construction to continue for a year, so completion and fall of 2022. Well. That should just be when we're getting all the covers, then. Okay, all right so, okay, so Bobby and Ralph I guess the next issue I mean Miguel is my only other committee member here I know I. If he has wants to raise any other questions or if we want to try how we can approve this or give the letter of no objection or and or the letter of approval, how do we do this? Or do we just do this in executive session? Since we already have three members of the executive committee here, Ralph Bobby, I'm leaving it to you guys how many members you have in your committee right now, it's just Miguel and myself, no, but I'm saying in norm, I'll get it up hold on. We got echo agenda hold on so as of right now we have Elvis Miguel, Lewis and Nick. So five members, five and you got two out of five okay, that I for the executive committee members. We have three executive board members, I'm sorry yeah, Paula, Larry and yourself, okay, well, Maria! We you we'll take your lead on this thing. How do you feel I think regardless it still has to go to the full board? No I mean if yes, if they're looking for a lot of no objection and- and it doesn't have to be like yesterday, we could wait till it goes to the full board. That's not a problem, or we can do it all for the executive committee, which is in another week right well, no, the executive committee will meet on the 28th all right. So then, in a week and a half correct all right, so I would say you know if Miguel has no concerns on this project and you Maria don't have no concerns on the project. We will take the lead of the present members and make a presentation to the Executive board all right and then from there. We can then take it to the executive to the full vote in two days after that. I have no objections. Okay, so yeah I think if we had our whole crew, this would go through without an issue, but because we are short, we have to go. Kick it to you, guys yeah Larry you're online. So you want anything to say: Larry yeah, you yeah I. Just don't like the fact that the doc is closed down rock the boat, don't have no assets, but it has to be done, but I think it's a good idea of fixing this area having some place where the kids can go. I really like the young kids going there, but that's something we have to deal with all right. Well, Larry, rocking the boat just won't have access to the dock. They have access to the other side where they kind of do it, yeah push, they always go over there, so they'll still be able to do their program. But again you know this is the full of next year. So you know, hopefully they might be able to get this summer off without a hitch next year, all right so and Paula. You have any problems. I totally really don't have any issues or answers. I mean questions about. It was very clear and nicely presented and I think it's a benefit for what needs to be done to be fixed right so we'll. What we'll do is we'll take it to the executive committee in a week and a half if everything's, okay, then from there we'll take it to the full board. We don't need parks for the executive committee correct. The presentation was made, I have it on the pdf. I know the timeline, and we know that in particular rocking the boat is not objecting to this they're, the ones that are supporting this to be changed. So I just want to have a copy of the plans in case anybody at the executive, yeah I have the pdf I'll. Have the presentation handy for that, so, okay, so Mike and Chris? Thank you. So much I will follow up with you guys. However, you will be needed for the full board meeting on the 30th. One of you is fine in case there are any questions from the General Board members which I doubt very much, but if there are questions that were not presented now at this committee meeting that you guys can answer so I'll leave one of you guys there for that. All right, we'll make sure we send you the invite for that. Also Ralph before, but before you go, Mike actually I think I have a concern on another note. In terms of monitor field, the drug use in and around that area is really just out of control. I, don't know if you guys can send some pep officers by every now and then especially I go walking in the morning. So between eight am and nine am there's people just today, there's people they shoot up on the wall right on the monitor side, and it's really, you know it's really kind of disheartening and it would be great I know we I sent a message to the 4-1, so we would greatly appreciate anything. Farce can do in terms of that in terms of additional surveillance, or you know, checking out the majority of it. You would say well when I'm there in the morning 8 a.m to 9 a.m. I guess that's the morning shift, I'm just, but it goes on all day. It goes on, but Mike you even got the other day, I'm with my my nephew and we're driving through there and we got prostitutes hanging out there. One picked up her dress and exposed herself, you know, and so but I think Ralph and correct me. If I'm wrong, we want to set up a meeting with the precinct and Fox anyway regarding Bill Rainey, that's what you are requesting, okay, so maybe we can also include this at that time. Also we can do both of them at the same time, but in the meantime, before we get into that meeting Mike, maybe you can get something about it. Have your prep offices talk with the 4-1 and coordinate something out of there for doing them, yeah I'll reach out to Captain, Sanchez and Captain Daron about it. You know it's it's a lot of it. You know it might be, would be better quick to handle obviously, but I'll ask them to work with them on it. If it's a drug use in the park, we can definitely take a look at that. I'm not sure what they can do about prostitution outside of the park, but I'll speak to them and let them know that something's going on I have another question: is any of this related to the living room because I remember a couple of years ago we had a meeting there and I know that their security does patrol the family and they were doing their patrols. So I, I'm just curious to know. So if you should also be part of that conversation again so well this morning, so I also I sent I can send you these the photos that I took this morning into your email shortly, but I I sent it also to the Bronx works right and I sent it to the 4-1 I have not Ralph and Bobby I didn't hear back from Socola. So if you guys can flag that, for me, that'd be great I'll get out yeah, so the gentleman from Bronx works did say that and I do I have seen this as well, that they they're not their clients that they do. They most likely live in the building. Another building. That's across the street from the park right directly across the street, from the Post office and Ralph and Bobby. That's the sunshine place! No! Well, it I, don't know no well. On the other side. This is right. Next to the Odyssey house, the women's thing that building there is also I mean I, see them come out of there in the morning as well, and so I don't know. If that's another cluster site, I, don't know. What's going on with that building, I, don't know the address. I'll try to get it for you, but it's the one that's directly closest to the park and directly across the street from the Post office. So I don't know if they're running a cluster site on the low, but a lot of these guys do come out of that building in the morning and they're there all day in and around the park get the address to Ralph and he probably reach out to HRA yeah just to see if they're doing anything there, it's probably like 13 something Lafayette I I'll get it for you tomorrow, yeah I, just you know it would just make sense to have everybody at the table because I remember after the meeting we had with the folks from Bronx rights, I know that they stepped up patrol significantly. So if they were their clients, you know I would suggest bringing them back, but it doesn't sound like this, so I'll reach out to Captain, Sanchez and custom bait on and see if you know, ask them to get in touch with the 4-1 and step up. The trophy thanks and I mean. If we need to have another meeting, you know Ralph, we could set it up. I can meet with Mike during the day or something else. So we can well. The chairman wants me to set up a meeting with parks already in the NYPD, along with DOHMH. So I'll include you in that email, so hopefully we can get like a zoom meeting going I, don't know- maybe hopefully next week, hopefully by the end of the month. It's just to go. You know on those agencies respective schedule, okay, but I will follow up with that for sure and I think any I think it's not 1300 might be like 1200, something about it yet so we'll double check that, though, that's fine and Mike. Thank you for assisting us with this. No, of course, I'm actually eating more than them right now. I don't want to I, don't want to get too late before any moment. Okay, all right Ralph! Is that all that's on my that was the two main things of my agenda, but two main things. Madam chair. We also have I, don't know if you're more than welcome to stay on Mike, I, guess, Chris and Mike. Thank you. So much I'll follow back up with you at the executive committee. If it doesn't pass, but you'll get the invite for the full board meeting on the 30th just in case there are questions that need to be answered and then on Madam chair on your end, I know we got miles on maybe and I know you might want to give us an update on what's going on at the bid miles. Okay, guys! Thank you very much. Thanks guys miles, you're there miles you're around. Can you all hear me? We hear you now: okay, hey everybody! So I got. You know the request to what's going on with the southern boulevard, we're very busy I, don't know exactly what angle to is from I spoke with Chairman Crespo about you know some of the conditions. One of the biggest concerns was vendors, we're in our here about it over here, because a lot of our stores, like the vendors that we have here, a lot of vendors- are just showing up now because they think of different circumstances going on with the pandemic. But you know either way. In the last couple months we've been noticing some consistent problems that stem from the vendor. So we've been working with project, which is a non-profit organization that helps advocate on behalf vendors across the state enforcement, and we have been working with them to devise an outreach strategy with materials that they are. There are things that we also need as the bid to fulfill our mission cleaning up after your able to light poles- and you know tree pits and things like that for the next day, some things that I would consider basic we're gonna have to do a campaign of kindness and see if we can get people to have a good face, make some changes. We've noticed that they don't respond to our citation guys like when they see them coming, they get really on their stuff, but we need to create behavior, because that's all that's anybody here when it comes to solving that problem. That I can think of because make some changes and the mayor has rolled back enforcement and whichever see with the last reforms, so it really put us in a position where we don't have any teeth and we have well that's what I did with the board aware of that where and then work on I can get in. Like your question, Ralph well, Maria, I'm sorry! This is Bobby. Crestburg, listen! First of all, I don't know about enforcement, but you got guys and I've seen that every day you have people with their tables selling wares selling everything in front of stores, selling food in front of stores, their rappers and everything going on to the floor, which is a burden to the sanitation guys on for the bid and nothing's being done about that, you even got I call it a car dealership where you got guys with he's, got 12 motorcycle electric motorcycles, which I'm sure that he has to have. He needs some deal, D.O.T or department motor vehicle permits to do that and he's selling it on the sidewalk. There's not nobody bothering these people and honestly, you know my board members from the board, the community board. They're saying you know, they're getting ripped off because you got the bump and grind you got the people, you know studying their stuff, which is cheap and taken away from people that are going to the bid. They rather go other places and spending them on their money. Other places bad enough that we don't have parking, but then, when you got people selling cheap stuff out there that don't have permits that don't have anything you know, and we just you know overlooking it, and this has been a concern that I have and I've I I'd like to know. If the bid's going to have a meeting with consumer affairs Department of Health, because people are cooking out there and they're cooking with our permits and the small SBS, because that is the only vehicles that you guys can bring together and we can then bring in the law enforcement side. We can bring in the police department on a meeting like that, but something has to be done, especially with that guy, that's selling the motorcycles. I, don't even I'm even asking the police department to stop there to check to see if any of those motorcycles are stolen and I, don't hear that well, yeah the the a little bit of a different situation than on the vendor problem, because he is there are fines that they could bring against him. But I mean I'm not trying to point fingers, but you know you're, lucky I, don't get any calls from DOT to do a walk through I, don't get any calls from sanitation when I need help. They tell me you know little for me. They don't pick up sanitation from Saturday afternoon until Monday afternoon, which I think is completely Un acceptable. The busiest time their corridors agency across the board is failing us. So, while I definitely agree with you, Mr Crest I think that you know we're awesome here. I I've been told that they don't have the hours and they don't have overtime. Yeah miles you've been around long enough to know that you've been part of the Dsc meetings you could have talked to DOT to set up a meeting. You could have spoken with Ralph about this. To set up a meeting with DOT or whatever city agencies, I know that Larry Robinson requested a meeting with sanitation. They spoke with us with Ralph and myself and Larry, and there is no reason why sanitation does not make themselves available. You heard it this morning that the representative of the mayor's office is going to be reaching out to these agencies that are not making themselves available to the board. So there's there is no reason why we can't be on top of it that guy that's selling the motorcycles should be. The first target should be the first target from everybody, but go, but you know multiple times on this, and I've told agencies about it, and we have elected officials on the corner here and we have the other corner. So I mean I, agree with you together, we should be able to get some movement here, but I have no ability to enforce that. No you, if you get if you need to set up a meeting with Ralph and the councilman, there is no reason why we can't oblige you on that. If you need to set up other agencies that are not responding, then we you got SBS, which is a very strong agency that to get to those agencies to bring them to the table, you know and you've been around long enough as being a representative of an elected official working on different fronts, with no we're not because we need to start I'm sorry, I we're not fighting in different fronts: we're not fighting different fronts. What we're doing is attempting to try and get a stop to this whole nonsense. I mean you go to Westchester and Southern Boulevard. You can't walk through there. You go to the middle of southern boulevard by others. You can't walk through there, you go to on 63rd street in Southern Boulevard. You can't walk through there. That's right, we're done, and it's filthy and you're absolutely right, because I mean between everything and I am here willing to work with you at every step of the way and I've made myself available for these issues, but at the same time, when there is no enforcement from the city there's no permitting, and there is no ability to give anyone a ticket on this I, don't have a solution to offer me just. Let me just give you the problem everywhere throughout the Bronx and throughout New York City. This is something that we're working on, but I haven't done. Let me just give you a little history and clean myself. I am working with the different agencies. I've expressed that this is something that we're working on and I've been met with everything I've told you so I'd like to work on a way miles to go forward too. Let me just give you a little history. The reason why you're getting a lot of resistance from agencies is because the bill took a position at least a decade ago, at a minimum a decade ago to lead those vendors there, because the store owners wanted them there and that's why you get resistance. I'm sitting there communicate with the vendors about the issues that we're having that right. Opponents will run out after us and tell us please do not make them leave, so there is a, but then they don't understand what the community has. These vendors don't live in our community offline, then the vendors don't live in our community. The stockholders I, don't agree with you Bobby. Okay, all right. This is getting to be uncomfortable conversation here. Yes, this is what we're going to do, and I'm really getting tired of coming to community board meetings and getting lambasted by everybody at the meetings miles. Just let's just take it back a second because right now this is Bobby and you have been discussing I. Think other community board members have really jumped in I. Just have a concern about Southern, Boulevard I. Think the main thing to go through here is to now set up a time for you and Ralph to get if you're having difficulties with sanitation. I think Ralph has a very good relationship with sanitation. We should utilize that in terms of getting them to the boulevard to assist with the cleanup and I know in the past, we've had meetings with the bid and the 4-1, and we really hashed out exactly what we wanted to see get enforced on the boulevard and what we were kind of okay with letting go right, I think a lot of times before food vendors were okay, people said fine, but then it I know due to Covid-19. A lot of things have gotten out of control because there were no eyes on the street. There's people trying to do lots of different things so either we table this into another meeting. That's not in this format or at this time, so we could get a little bit more constructive and more answers instead of just going back and forth with each other. I'm sorry Madam Chair, but Ralph can you do me a favor and set up the meeting with miles sanitation, 4-1 and maybe the councilman? Listen, I'm going to be very honest with you miles. Has all of these people, so I need to figure out why if what miles is saying that they don't want to meet, I got to figure that out first, because I'm not going to start scheduling, meetings and they're not going to show up so I, don't want to know I'm not trying to meet that. They feel that they don't have the ability to make changes either. Okay, so it's something that chairman Crespo was mentioning Myles and it was like you said before you came on, but I think you really need to revisit is division, zero policy where you're not gonna, allow any street vendors on the bid. I mean you can't be exclusive as well. I had a conversation with our elected official route. Oh my god. He basically told me that this vendor is okay. That vendor is okay. This vendor is okay, but that one's not that we can't have a policy. I agree with you, I. Don't want to have to be having sales in their stores, but this has to be a whole list. Okay, stick approach right so miles. Let me ask you and telling me of the bid solely on me and everything's. Just rolling back seems like the flapping. No I get you miles. Give me a suggestion. What are you? What would you suggest then? Well I mean it's not until there's legislation on this issue that increases permitting, creates zones and then putting importance in place. There's a director's hearing from every community board and every merchant association they're dealing with I mean it's a failure on behalf of the city and until the city is willing to make big boy moves, there's never going to be big boy solutions miles. Let me ask you something: have you had a I, so I understand that the council member has mentioned certain values? Have you ones that they don't no I get you, but I think you need to I will assist you with whatever I can. First of all right, you just gotta. Let me know what it is that you need from me. That's the first thing, but to say well, I suggested in a very appropriate and respectful manner because of the way bids get a name for harassment of vendors in the first place. So it's a very tricky issue, but if people have questions about other, you know- and we do that's nice miles. Okay, just we'll have to follow up because you I in order for me, you know Bobby wants me to have a meeting, but we've got to tell you the whole purpose. Huh all I want. Is you and the council since he's saying that he's not getting any support, at least maybe if you we can relay all this to the councilman, then the councilman can probably bring in the city agencies that need to be brought in, because this is get. You know, I'm the one that gets the heat. You know it Ralph and all my board members know I'm the one that gets the heat. When people are saying you can't walk through southern Boulevard because of all the all these, all that is on the sidewalk, come on I'll reach out to the council member I'll reach out to the council, member and I'll set up a meeting with miles the council member and myself and then we'll take it from there. Fair enough miles is that okay, I think that would be a good solution. Yeah I! Think for that point, it's okay, a solution! This is a start. It's a lot of work has to go into this. The bid on Something Boulevard, a lot of things are going there negativity and a whole lot of junk on there and we have to start someplace I agree totally with Bobby I also understand where miles coming from, but we have to start someplace. Okay, so you guys are going to connect and take it from there miles. Would you in order to end this on a better note? Is there anything else you want to report on the bid, some something some positivity okay, I like to ask about what real quickly the cleanup will be upgraded, Larry, wait! Let miles come finish and then okay and then we'll go back okay miles. I'm sorry go ahead. It's okay, I'll actually kill two birds with one stone on there, because we have been do doing really well with our cleanup efforts. This is when they start crying. She said her graffiti been there for years and she had the resources so during difficult times, I think it's been a good way to not only show the bit all the businesses within the bid that you know we're here, we're back on here we're trying to get on things. It's also been able to show them the utility that the bid is- and you know it's much genuine relationships with people when they see the work that you can help them with and do for them as opposed to just pitching them. You know come to a meeting later on and some so that has been really helped, not only just building outreach but beautifying some of our districts, because we drive through the great deal covered in graffiti, and we do we've been working very hard to to get the polls which are in terrible condition. After years of posters on that tape and adhesive, so it's been an effort, but we have brought in the maintenance crew. You know not to go back to street vendors too much, but I think that you know it's helped to create a better community environment just internally, but a lot of our businesses are not open if you've seen I think we have about 28 at the moment, I'm still closed and we're trying to figure out where they're at and, if they're going to come back or if they can so it's a difficult time in the normalization, but we're trying to fight on every front from outreach to sanitation, to advocating to being a utility to our businesses and then on to throwing some events. So it's been tricky, but you know my email is I will just reach out to me. If you ever have questions about what's going on or ideas of how I can do better because, but is very much needed, but did I answer any well the questions anybody had. Does anybody have any more questions? I have one question my: what was the issue with ABC not like? Let you guys paint their their gates. They gave you a reason why they wouldn't let you paint them. They didn't let us yeah. What did they say? They said the older didn't want you guys to touch you started. They stopped you guys. They said they open up this door. They got to do the regular business I just thought. It was unusual that owner getting a free paint job would turn you guys away. That's all! Oh! You know what it was back, it's that they started, painting his and could be there about 30 damn and he opened the 10. So I think he just didn't want to be Sl we're having another cleanup day in November, earn sorry in October. So we'll just start there next time a little earlier, okay, I got you I just wanted to check on that. I thought he's giving you guys a hard time. Okay, oh and we do here's the guys when we have new commanders, many years of old street banners, we're going to be having brand new ones, hopefully by Halloween is my goal and there should be about 50 of them. So it's going to look a lot better up on miles. Thank you, and you know one of the things that I tried to pride myself with my meetings and I'm sorry that kind of got a little bit more difficult with in this format, but we like to have a positive and productive discourse and we don't want anyone who comes to present to feel as if they are being attacked or anything like that. So in the end, that's all we really want to see. I know people go about it and we all go about it differently, but in the end, I don't want you to feel that this is a committee that you don't want to come and present to, and we will you know we always try to have that convey. So thank you for your time because we are all taking I appreciate it and I are just very passionate about this. I think Bobby and I are passionate about the same thing, so we're going to get some solutions here. Yeah. You know you guys, you know you're going to spend a lot more time together. I think you have some more meetings. You can really hash it out. Robbie's laughing at you now miles we're good all right, we're, okay, you're right! You got the same objective. It's just getting there! That's what it is all right! That's it Maria! There's nothing else on your agenda all right! Well, I! Thank you! Everyone for coming out and listening. It's been a riveting hour and a half and see you all at the full board meeting, definitely and then next month. So thank you thanks Miguel for coming all right. Stopping the recording now Maria I'll, see you next week and I have.",
            "summary": "You want mute, yourself, okay, all right, I, guess we're gonna get started with Amazon.\nKnow, really great conversations here about our locations there in the Bronx and really excited about the meeting here.\nWe thought we would start with just a quick update on what's going on at dnj3 or what we call dnj3, which is our delivery station in hunts point which Brad and I can give you.\nHow many 400 and 450 people directly employed by Amazon, and these individuals are getting all at least 15 an hour, if not more, Medical dental vision, paid, leave, 401K life, insurance, basically, the same benefits package that Brad, Christie or Pj or myself get so the same that we give our corporate executives and they, you know, are working hard to deliver packages in addition to those 450 full-time associates.\nWe, don't expect those numbers to change much because we're basically running the site at full capacity because of Covid-19 I, don't know Brad.\nWe appreciate the support, Ralph and Chairman Crespo that you guys have given us that yeah with the hiring events and being able to broedcast that through the community board, that's been a great effort and great level of engagement.\nYou know I think one of the things that we want to do now with Christy and Pj and Board is talk about how we can engage through you guys on our efforts there in the Bronx and what they're going to be looking to accomplish so.\nOur, Amazon logistics business is our last mile delivery, business operating there in hunts, point and other places in the city and around the country and about I think in May or sorry.\nWe've come up with some guiding principles that help us focus on the types of outreach and the types of organizations that we want to support in the communities where we have operations, but ultimately we're really driven by a hyper local focus.\nYou know he outlined the work we're doing operationally and our goal really is that you know at the end of the day, You guys feel that we're being a good neighbor and that you like having us in your neighborhood and some of the ways that we've this even the last few weeks been engaging with communities in the Bronx, and then you know, certainly in throughout the five boroughs.\nOr you know, doing a lot more school work from home and having to stay plugged into a computer.\nAnd, if you can I understand, and the reason why I'm asking is because you know we have people in the community that are in need of employment.\nA lot of a big need in this city, and especially in this area, is a lot of our kids are just in terms of internet Wi-Fi in their homes, I mean Amazon, be able to give hot spots for these kids to be able to do online schooling, or even for the schools to distribute amongst the local schools here in the 104 in the peninsula, as well as whether it's computers.\nSorry I just wanted to follow up on the previous question, because I found those old, emails.\nIt looks like, and this again was backed in late January, So obviously, things may have changed, but from the zip codes immediately surrounding the hunts point area about 81 or around you, know, close to around 15 percent of our associates, are from there.\nThis is again updated information because you know there's turnover, but I just wanted to make sure you guys have the latest and we're happy to look into that.\nWe will work with them and they will identify lots and say all right, we're going to do a short-term lease with that lot, and so, Therefore they may not come directly through Amazon.\nWithin, this meeting, I'm trying to think I had another question: did you guys are also not necessari.\nProcess, just correct, It's basically, You know our grocery delivery service that we're looking at for that location, so it wouldn't operate.\nA lot of them are gassing up right across the street, from the Mcdonald's on garrison, but for the most part, I have not heard any major complaints, which is a good thing to hear that you have 450 employees and viele plus another 500, drivers.\nSo you know if you could just reach out if Amazon could reach with and partner with the pals and the casita Maria's in the district that house and do a lot of work with the students in the district.\nI know that we were told today that you guys were having some break-ins on some of your trucks in hunts.\nAbility to help us engage with the 401 was also really helpful in the midst of the pandemic, and you know, unfortunately, When there was the riots and some of the things going on the relationship, you guys helped us establish there.\nActually, We had a report come through from the precinct that there might be an incident where they were targeting our trucks heading out of hunts point, and so we were able to shut down the facility, get everyone safely out of the location and get and make sure that our employees and our drivers were not put in harm's way, and it was really great.\nThey have a whole, their whole team here, So I really appreciate the efforts that they made and following up with whatever they can assist in their community, like what Madam Chair had mentioned.\nI am with the New York City Parks Department, and I'm, going to talk to you today about a capital project for a dock replacement at hunts.\nYou'll help you out with any questions you might have, but then we'll need a letter of no objection from the community board for us to move forward with permitting.\nLike I, said reconstruction of the floating dock at hunts, Point Riverside park, which is, if you're not familiar at the end of Lafayette Avenue, I'm, the project manager, I'm, the deputy director for Marina infrastructure for the Parks department, it's being designed in-house by one of our in-house engineers.\nWe want to repair and also there's an environmental problem with the dock design that has to be fixed for permitting purposes.\nThis is the only place it's going to work, but we think we have the funds to do it.\nThey, don't have that problem of cramming them in between the pilings, and we think that engineering-wise that works, fine, which was good for rocking the boat, the operator, but also for anyone who wants to pull up a kayak or a rowing skull or whatever they don't have a nice flat ice to work.\nI. Don't think this project will take that long, But that means that the completion time would be fall of 2022.\nYou, like I, just want to say, Madam chair that you don't have quorum in your committee, Although we have three executive, offices, I, don't know how you want to handle that before we have any questions or if anyone starts to make a motion, there's no quorum for the committee.\nA letter of support would be great too, but some just something letting us know that this community board has no issue with the project, So we can move into our permitting.\nIf, there's background noise, This is Nate Grove, I'm, the chief of waterfront and marine operations for New York City parks, I, appreciate that concern expressed I responded directly to the Starlight Park tragedy losing track of the years, but maybe five six years ago, and we we did a lot of thinking a lot of discussions, a lot of engagement with all interested parties.\nBeing you know, kind of like a kiddie pool that, if a kid wanders off a toddler that there's a gate there, that they can't, they can't open themselves a toddler, but but ultimately, the rule of protecting our waterfronts is that people need to be able to get out as well.\nWe obviously have in concrete plant park where people just go in the water, regardless whether you have a dock there or not are kind of some of those challenge sites as well and.\nYou know it's I, think it's one of the best things we can do to ensure safety along our waterfronts.\nOkay, thanks and nice to hear from you, Mike, I'm, just trying to think you know the other concern with that doc in the previously was I know under hurricane Sandy.\nIt should work as as designed it should be able to go all the way to the top of the pile and back down in the event of something like Sandy.\nYou know it's hard to stop perfectly storm, proof: everything and a lot cheaper to probably replace a dock and to make it impervious to every kind of weather, event.\nSo then, in a week and a half correct, all right, so I would say you know if Miguel has no concerns on this project.\nI'm, not sure what they can do about prostitution outside of the park, but I'll speak to them and let them know that something's going on.\nI mean I, see them come out of there in the morning as well, and so I, don't know.\nSo I, don't know if they're running a cluster site on the low, but a lot of these guys do come out of that building in the morning.\nAnd I know you might want to give us an update on.\nYou know tree pits and things like that for the next day.\nLike your question, Ralph well, Maria, I'm, sorry, First of all, I, don't know about enforcement, but you got guys.\nAnd I know in the past, we've had meetings with the bid and the 4-1, and we really hashed out exactly what we wanted to see get enforced on the boulevard and what we were kind of okay with letting go, right.\nI think a lot of times before food vendors were okay, People said fine, but.\nSo I, don't want to know I'm not trying to meet that.\nOkay, So it's something that chairman Crespo was mentioning Myles and it was like you said before you came on, but I think you really need to revisit is division, zero policy where you're not gonna, allow any street vendors on the bid.\nOkay, just we'll have to follow up because you I in order for me, You know Bobby wants me to have a meeting, but we've got to tell you the whole purpose.\nSo during difficult, times, I think it's been a good way to not only show the bit all the businesses within the bid that you know we're here, we're back on here.\nSo I think he just didn't want to be Sl. We're having another cleanup day in November, earn sorry in October, Okay, I got you.\nDon't want you to feel that this is a committee that you don't want to come and present to, and we will you know we always try to have that."
        }
    }
}