{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCzF4Ryn8TKn64md77gS5Q5Q",
            "title": "2020.09.17 - CB2 Transportation \\u0026 Public Safety Committee Meeting",
            "publishDate": "2020-09-18",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nTransportation \\u0026 Public Safety (T\\u0026PS) Committee\\nThursday, September 17, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:45 - Roll Call \\u0026 Introductions\\n00:03:57 - Approval: Agenda\\n\\n00:04:50 - Presentation: Revel Scooters Safety Update\\n00:45:00 - Approval: August 2020 Committee Minutes\\n00:48:20 - Discussion: CompStat \\u0026 gun violence\\n00:57:10 - Discussion: Statement of District Needs\\n\\n01:47:06 - Other Business\\n01:59:38 - Community Forum\\n02:00:00 - Adjournment",
            "lengthSeconds": "2:00:29"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "682yhhRkzmM",
            "fillerWordCount": {
                "uh": 162,
                "um": 387
            },
            "readTimeFullTranscript": "65 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "police": 36,
                "safety": 31,
                "statement": 26,
                "training": 22,
                "app": 21,
                "law": 17,
                "rebel": 16,
                "bike": 16,
                "programs": 16,
                "member": 14
            },
            "wordCountSummary": {
                "member": 10,
                "safety": 7,
                "ride": 6,
                "report": 4,
                "bike": 4,
                "police": 4,
                "rebel": 3,
                "program": 3,
                "guys": 3,
                "training": 3
            },
            "fullTranscript": "Recording may begin. Thank you. This meeting of the transportation and public safety committee of Brooklyn community board 2 has been called to order and is now being recorded for the purpose of transparency and for permanent public access on the CB2 youtube archive all attendees. Please keep your microphone muted. When you're, not speaking and district staff will assist in maintaining that protocol, it is the practice of CB2 to conduct remote meetings with committee members cameras on, if, particularly, if you're given the floor, to speak, to maintain appropriate discussion and voting I'll, make it known when and which topics are open for comment by committee members and then board members at large and then the general public. If you wish to speak, try to use the webex feature to raise your hand or you can maybe use the chat function to let us know you would like to speak and we'll get to you. If attendees experience, technical difficulties, you can consult Help.Webex.Com or maybe after the meeting reach out to the district office and in regardless of physical ability or limitations. We strive to provide access for all of our neighbors. So if you require accommodation or assistance for full participation in the meeting, please contact the district staff 72 hours before any public meeting and we have not had such requests for this meeting and now we'll begin roll call and introductions I'll start with myself, and then we can just go around the the webex boxes and the committee members can introduce myself themselves: I'm Juliette Colin, Chang Chair of the transportation and Public Safety committee, I'm Cheryl Gillis Vice, chair of the committee John Quint Secretary of the committee sid, my member of the committee member of the board, Cyril Scala member of the committee and member of the board Patrick Sorry Dorian Gallo member of the committee member of the court Patrick Blackie member of the committee Caroline Todd member of the committee and Howard member and the Committee Sandy Unmute yourself, oh Ernie, you too say hello Ernie. We can hear you now: okay, Sam. I know sandy you're. Still there hey I'm good at this. Did I do it? Yes, now we hear you everybody's here except John. Do is John Do on Sandy, go ahead and introduce yourself? Oh, I thought I did. Okay, Sandy Balboa's, a committee member- I have everybody here, except John, do as somebody's called in. I assume that's, not him. Okay, we have a quorum. As I said, every member of the committee is here except Mr. Do so we'll move to the approval of the agenda, which is pretty brief. Today we have the relaunch of the rebel scooter rideshare program, the approval of the minutes, chairpersons report, other business and community forum. During the chairpersons report I wanted to let you guys know that we'll be reviewing the statement of district needs that caroline distributed as well as the comstat reports, and if do we have a motion to approve the agenda? Exactly okay, John Sid, any objections: okay, great we're going to start with the relaunch of the rebel scooter program. I see that Lauren briens has joined the meeting as well as Carol and Antunias, and you guys can feel free to take over the presentation function. Thank you. I think you're going to have to give me exit one more time. There we go hi everyone. My name is Carolyn Tunis, I'm the community affairs manager of Revel. Thank you. So much for having me I'm joined by lauren reids who's, our general manager for New York. I think you guys had met with our previous community manager John White a few months ago and lauren when we initially visited the board and since then, we've relaunched with some safety initiatives. So I'm going to share my screen. I do not Wanna, I do not. Wanna bore everyone with a long presentation. I think, for the most part, most folks are familiar with Revel in the area, so I'm just going to move through this fairly quickly, so that we can really have some time to do a Q&A. I'm sure everyone will have several questions so a rebel or a street legal vehicle that parks on the street, no sidewalk, pretty space, efficient, Quiet, 100, electric rather affordable, only five dollars to sign up a dollar to start and then 35 cents per minute. That is how our fee works, we're a local employer in New York. We have over 300 new yorkers working, it's actually 329 to be exact. We do not do the gig economy, so every single person, a rebel, is an employee with benefits. The same ones that our CEO has same ones, I have, and we work with local workforce partners like say: Nix Alliance, work on workforce innovations really to hire within the community, as well as the New York City Small Business services, who we've hired over 65 different folks from from the very beginning. Rebel, has always been about access and giving everybody a way to get around so just providing new yorkers for more options. So we have an access program that offers 40 off every single ride and that's part of our new initiatives. We're also providing those folks for free helmets. But I'll talk about that. A little bit more ahead and Carol. You may not have really known, but we did hear a presentation, maybe a year ago, from Revel when you guys first launched or expanded your launch. Wonderful, so we're interested in that maybe the updates- okay, great particularly the safety updates yeah. So let's just go straight to that. So, as you guys know with Covid-19, we did a lot of stuff around that we did a healthcare program where we provided over 3000 nurses, doctors, hospital staff with free rides. What ended up happening in the last like two like two and a half months was so we started seeing really a shift in the behavior of our users, so for the last three years that we've been operation, we've had pretty great users, we're respectful of our rules and also the city law. So I think you know, I think everyone here watches the news. We had two fatalities that happened and that really shook us to our core and from before that, we knew that we really had to do something to improve some of the behavior that we were seeing on the street. We were noticing a lot of folks now wearing helmets, and that was really worrisome for us. So after those two fatalities happen, we kind of just paused all of our operations and then for the next five six weeks we just dedicated ourselves totally to improving our safety and user accountability. So as we relaunched on the 27th of last month, we came back really with some really strong new safety improvements, the first being that before you start your Revel ride. The way that it works is when you hit on like start ride only your helmet case will unlock so that what that forces users to do is they have to go to the back. They pull the helmet, then they sit and they have to submit a helmet selfie, and they have to also do that for the passenger if they have one. So that's straight off the bat, something that we've done just really adding some friction to the entire process. Before you could hop on the bevel and go, you can no longer do that. You're not required to take this photograph for every single ride, and then we did a comprehensive safety training. So this is really, I would say, like our biggest item, we really wanted to make sure that every single user on the rebel platform which was over 360,000, knew what the rules were. Not only what rebel rules are, but New, York, City and state law right so, like you can not ride on a bridge. You can not ride through a park. You can not ride in a bike lane, so we worked with the behavioral insights team, which is our leading expert and are really great at putting together exams and trainings that really help people learn and understand concepts. So we have 42 questions now that you must take whenever you go to the whenever you sign up for the process, so the way that this worked was when we re- launched a lot at the end of last month, every single person 360,000 people they were suspended. So if you wanted to actually get back on a Revel, you had to go on the app and take a 20 minute safety training with the 28:42 questions. Basically every question you get it twice so you're tested on helmets, like our helmets required writing with miners, which is not a state law but a rebel policy. We do not allow miners on our vehicles, so you must be at least 18 years old and then riding on sidewalks Bike lanes highways stop signs red lights. Basically, the feedback that we've been getting at other community boards and just from people that write in is hey like this exam is pretty comprehensive. I actually failed it the first time all right, like it took me a really long time to get through it, and it was harder than my dmv test when I was getting a permit. So we're pretty happy with the results of the test, and we think this is really been helping us see like a curve downwards on all bad behavior overall, but we did not stop there. We really took time to one automate as many processes as we could, so we started with just like automatic alerts and suspensions for anybody that was on a highway on a bridge in a park riding the wrong way on a on a one- way street. So we're really the first micro mobility company to have mapped out all one- way streets in New, York, City and then just automatically suspend the users for doing so. The way that it works. If you're doing like two three blocks the wrong way on a one way great, you did it. When you stop your ride, you're actually going to get a notification saying hey like you've, been suspended, and this is the reason why so that's a practice step that we've taken we've also really increased our lessons capacity in all four bars where we operate. So we've always had lessons seven days a week out of our Gowanus HQ. Now you can do Gowanus, you can do Inwood, you could do the bronze. You could take a lesson in a story a queen, so really just making lessons more accessible. We have the capacity to do over 1,000 lessons per week, which is also like updating our app. So now, every time that you go to the app you get safety messaging, we did link NYC ads and something that we're really proud to share with you. Guys is the fact that we have our in- app community reporting tool. So previously you would call rebel at our Cx number or email safety. I got Revel. Now we encourage everyone to download the rebel app. You do not have to become a member or pay the five dollar fee. You just download the app takes 10 seconds and you're able to report any bad behavior in under 60 seconds, so there's actually a menu where you just click the multiple options of like whatever behavior you're, seeing. Maybe someone just is not wearing a helmet or they're, not wearing a helmet, and they did not fully stop at a stop sign. You can report that on the app you should tell us the location. The time and the only information that will be asked is for your email address and then our team gets that notification automatically and they can go in and issue the suspensions. This is just a little bit more on what we've done. We've actually temporarily shut down our servers overnight. So when Revel first started, when we were here last year, our service was closed from midnight to 5 A.M during the height of Covid-19. We realized that our we had a lot of essential workers on the platform. So I mentioned earlier that we had over 3000 nurses, hospital staff that were using right to commute and we actually had a network of 57 hospitals that were using the service, but as we're coming back, we really want to encourage users to be on their best behavior. We know that maybe at night there have been some issues in other communities, so we just have shut down the service overnight from midnight to 5. Am we heard people on like hey, I'm not wearing a helmet? I used to wear a helmet, but because of Covid-19 I'm a little reluctant, so we've made helmets available on our website at cost, so we actually lose money doing this. We do not make a dollar, we sell them even cheaper than what we purchased them for, which is only 35, and then you pay for shipping and handling. You can have your own helmet and, like I mentioned earlier, if you are part of our access program, where you receive 40 off, you also get, you can request a free helmet. So I feel, like I've talked a lot, so I'm just going to open it up for questions. So, thank you. Thank you, Carol. Is there anything that lauren you wanted to add before we open it up to the committee members? No, I think it'd be best just to go straight to questions okay. Committee members. I think you can feel free to ask. I do not see any hands raised. Oh do you. Can you hear me? Oh, go ahead sandy okay, you broke up a little bit, so some of it I could not hear. But how do you know if somebody's riding the wrong way is it? Does the machine tell you the bike or does somebody report somebody doing the wrong thing? So the great thing about Revel is that every vehicle has GPS technology built in. So we just use the GPS pings that we get to kind of automate that entire process so with the GPS. The thing about GPS in New, York City, is that it's not super accurate just because of the density. So what we do is if you're writing two blocks on a one way. Then we know for sure, because we'll get several pings and we can. We can just suspend that account. If someone wrote like a fourth of a block the wrong on the wrong way, then that's a little bit more difficult. Then we would need someone to report that activity, but for the most part, if you're writing two blogs three city blogs like we can just use technology to know so the next time they I think one just went by so the next time, so the next time they try to use it, they would be suspended. They would not be able to access it right so like what we do not do is stop your ride mid ride because it's fairly dangerous on the city streets, but once you conclude your ride and you end your ride, the next time you would try to log in you would actually just be suspended, so you would not be able to do so and what do people have to do to get off suspension so the way that we have it set up now is there's really not much. The user can do so like we're being very strict about making sure our users are being good neighbors. So if you're riding like through a park, there's nothing you can do that's going to. You know change your mind about the fact that you should be back on the platform, so there's some suspensions, for example, if you're not wearing a helmet, we'll suspend you for seven days the first time, but if you do it again, then you're permanently off the platform, because we feel like a user that is caught the second time. The same violation is just never going to learn. So that's the way that we've set up our suspensions at the moment. All suspensions have a seven day first strike and then second strike you're out no, some of them depending on the gravity. So if it's a no helmet, then it would be. If you know, maybe you did like one block on the wrong way. We'll do seven days, but if you did like a bridge a highway or a park, that's just a permanent suspension. So it's not even a suspension. You're just kicked off the platform, better terminology for it. Okay, cyril yeah. You mentioned something about the bike lanes I was. I was not at the first presentation, so I may I may be redundant. So I'm sorry, but how do you keep rebel bike riders out of bike lanes so, unfortunately, GPS technology is not precise enough that we can use technology to detect when a rider is on a bike lane. So really with the bike lanes, we rely more on the community reporting, as well as our staff, so because we have a network of 3,000 bikes throughout the city, we're constantly doing batteries bikes around so we have 20 to 30 employees out at all times. So that's one of the ways that we make sure that we catch people who are on the bike lane and people tend to report that activity often so, as a follow- up question, have you had an increase in bikers complaining about Revel being in the bike lanes? How do you let me rephrase it? How do you deal with complaints? You get a complaint that maybe Revel they're using they're using the bike lanes. I know your GPS catches, people going on one way streets and things like that, but if there's an over amount of rebel because it would be tempting human nature, that would be a tempting place for a rebel rider to actually to ride. I would imagine, but how would you? How do you deal with those complaints if any community complain about a rebel rider on a bike lane and you submit a photograph which is suspend that user right away so you're so you're taking on the policing, vis- a- vis, the city basically you're doing most of the policing to try to keep everyone in order? Is that what I'm getting so the city's saying? Okay, go ahead, use the streets, but we're not going to do anything you're going to have to do it. That's just that's one of my that's a very interesting concept. Okay! Well, I had another question, but I'll come back to a license thing. Do you do you? Do you issue a license? Is there a license for a driver of a rebel? So in order for a person to ride ravel, you must have a driver's license. So you need to have a driver's license. We require you to go through the sign- up process where you submit a photograph of that driver's license a selfie to prove you're. The person on that matches the I d a debit or credit card, and we run a check to make sure there's no suspended license, but they do not have to have a lesson: it's not mandatory, but they're available, but you, but you must go through the mandatory in- app training, which is the written exam. The written test, there's 32 questions in about 20 minutes, okay, but you do not have to have no practical lesson at all they're available, but is it part of the training video right? So when you first, let's say, you're getting ready to take your exam. You actually first have to watch a how- to video, that's just based solely on the operational side of Revel and how to write, and you then take the written examination or safety training which is kind of the direction not to ride in bike lanes in that training. Initial training, video right. So all of the content before you even get to the bike, you get all of that information. So like no bike lanes and highways and bridges helmets, no miners. All of that is constantly cycle through before you even get on to the level I just downloaded the app and the first thing that popped up was no longer. Okay, doreen, you had a question. Yes, so I'm a little I'm going back to what Sarah said you know back in the day, I rode a motorbike through Southeast Asia, and you know it's a lot different than driving a car and I've been driving a car for a long time. I you know, I'm I mean I'm just kind of curious about the insurance. You know the you know, people doing it for the first time. You said that lessons are available. Is it I mean it seems like it should be a little bit like part of the process. You know it's having a driver's license and getting on a motor scooter, two different things to navigate on a city street, and what are you? What are the casualty? You know like? We know about the casualties, but the accidents are you having any? You know what is how many people, like first- time users, get on their like? I listen, I'm just remembering like when I was much younger and doing that and like okay. This is not like riding a bike or driving a car, so I'm just surprised, there's not a little bit more. You know. Listen! You have to you have to see that you know how to do this and where is it? You know if they can have a lesson. Where does somebody do that? How do and do they have to pay for it? Do you provide, does rebel, provide that so lessons are always free, they're, totally free they're, an hour long. We actually worked on our. We had the motorcycle safety training school work with us on the curriculum which they loved they're available in all four boroughs. Seven days a week, they're totally free. You just go on the app and you're sure. Do you encourage people to do that? Is that something yeah? We encourage everyone to do it. You know they're not mandatory, because there's a large there's, a large segment of a rider population that have that ride motorcycles. They have an M class license they're, you know, they've been riding mopeds for a long time, so it's not a kind of like one size fits all model, so we do have you know a large lessons capacity and we're always encouraging users to take advantage and they're totally free and they're really fun, and just like a follow- up about insurance, you know if you drive a car, you have to insurance. What have you know your overall rights, the second that you get on a rebel you're covered, so, although all of our rides come with insurance, what is the liability? I mean, what is the? What is it cover? What is the package? No, because you can get all kinds of insurance, you can get car insurance and it covers nothing. You know or you pay for it and it covers significant damage. What is your basic policy? The policy covers up to fifty thousand dollars of liability, and then, on top of that, we do have an umbrella insurance. Fifty thousand dollars is nothing I'm just telling you know when we called it like first game. So when we were actually insuring our mopeds, we just had to go with the maximum that the state allowed for a 200 pound vehicle got. It can not be required by federal law, and since it's a for higher or higher they're doing it for higher federal law requires that their maximum liability is the minimum required by state law. That's the law, the federal law. Thank you and I can appreciate how much effort you all put in a very quick amount of time. Thank you, cyril yeah. I have another question. I just do. How do you avoid people using the rebel for deliveries and commercial? That's an interesting question. I mean I do not think that we avoid it if someone's willing to pay the fee for the rebel and they're following the rules. We do not have a problem with that. So if you wanted to do deliveries and you're paying us the regular fee and you're using a helmet following the rules of traffic, that's fine. We actually partnered with restaurants back in April and may to help them kind of a delivery, only model that we had for a few months in New York during Lockdown, but the insurance that would not change the insurance issue for you, no so like every ride would still be covered. Whether or not it's a delivery. Thank you did you do anything in your new safety program to improve the safety of the vehicle like sometimes the tires may have been a little bit more bare than would have been optimal to say right in the rain or any other safety improvements to the actual scooters themselves. Lauren. Do you want to speak a little on the on the safety yeah sure we have? We have a pretty strict protocol on kind of regular preventative maintenance checks on every single moped. That's set in kind of collaboration with our manufacturer, and we also just have a massive team of operations. Employees that are going around checking out the rebels continuously, so either they're swapping batteries and doing a safety check of all the kind of DOT required safety components. So the lights, the horn, the blinkers the tires, obviously- and so that happens on an almost daily basis, and then we also have kind of regular interval checks as if it's a car, so you know a 2500 mile increment. The entire moped is brought back into the shop and anything that has a wear and tear kind of end date is replaced and repaired. So what is the average or maybe maximum time between the mopeds actually getting serviced? I mean daily, some of them do, but how often does each one of them get serviced? In fact, do you mean like a like a like there's, a full kind of the service interval, so that's like when we expect you know brake pads to wear down or tires to wear down, and so that's at a at a mileage increment, and so that's at 2500 miles, but they are checked almost every day by one of our field techs or our service techs. And if there's any particular issues that arise within the app users can report issues, so it is a user's responsibility to check the vehicle before they ride and then submit any sort of issues that they see. So if there's a flat tire or a blinker is broken, they submit that within the app and then we were normally within a couple. It gets removed. They submit it within the app it gets removed from service. So nobody else can rent it and within a couple of hours, we've fixed the issue or brought it back to our warehouse to fix it. Okay, and is there any regulatory environment that you function in terms of ability to ticket or assess fines for people, not just suspend them from your service yeah we're regulated under the state currently and like any vehicle on the road like we get tickets and then those tickets. If, for example, you park by a fire hydrant and you received a ticket, then that ticket is built back, so I mean like instead of suspending people, because that may not be enough of a deterrent. Is there a monetary fine that you could impose on people and did you did your behavioral scientists think about that? As a you know, alternative mechanism to get people to do you know operate them properly. To be honest, we really wanted to curb bad behavior. So, instead of just doing a monetary fine, we decided, let's just make sure you're, never back on the platform. So most of the like most of the consequences for bad behavior is just an explosion, so they you know you're gone so you're not going to do it again. Okay, and can you speak a little bit more to the headliners, the helmet liners? Previously, they were not always available in the vehicle either because somebody still like took them or they just were not available anymore. How do we make sure that they are there for people who are renting the vehicle so kind of like lauren mentioned as part of like the battery, swap that happens every day and like the cleaning of the moped also just like liners are replaced. So if you come acrosss a moped that does not have the liners, it's very rare these days, that would happen. Maybe that vehicle was just extra popular that day, but they're constantly being replaced and we do bags of 20 or 30 liners so that we know like the next user is going to have them, even if it had 10 days 10 racks a day, and there is two people per ride. We know that we have sufficient liners. You allowed only to pull one or two liners per ride, because some people steal them. That's what I'm saying well yeah, there's no way for us to kind of prevent that, but we are constantly replacing them. Obviously, in a time of coronavirus, you know people are that may have like that. May have been part of the reason why people were not wearing their helmets. Hi Sandy. Did you want to speak? Yes? Can you hear me yes? So today I have two questions: why not mandate one in person for everybody, whether they ride a motorcycle or they've, ridden a motorbike or any other kind of vehicle? Why not just mandate it? So they really get the message that you're, that safety is a priority and rules is a priority. I think this is really a question of access. I you know there are a lot of instances where people just do not have like a dead the dedicated time to go in, but they have been riding a motorcycle. Their whole life or they've been running a moped for a really long time. So you know for someone, that's maybe like working an hourly job. It could be difficult to just kind of mandate, something acrosss. The platform we can do is just make. You know, let's extremely accessible to folks, so we have them all four boroughs, seven days a week all day and we have a very comprehensive safety training in app that you take. So we have loads of videos on just like how to ride, and you can go on youtube and also find more videos. We have all those tools are in- app as well, so really there's something for everyone, but safety is at the core of everything. Rebel does okay, and I have one more question so well. First of all, when you came like two years ago or a year ago, you seem more concerned about whether they were going to park the moped correctly like they were not going to block a fire hydrant or something they seem to be focused more on that than safety. And then you had to pause because there were some crashes. So I have a question to. I do not think Doreen asked this, so if you have, the passenger is the passenger and the driver equally insured? Yes, so if they're both hurt, they both are not short of one or the other okay, both. So when you first, when you are starting a ride, we asked if there's one or two passengers in that vehicle and that helps us determine the level of insurance. Okay, I'm going to open it up to members of our community board. That may want to ask questions. Ms blount, we did not see your hand go ahead, Brian. So I know we've heard a lot about rebel and safety with the suspension, but I am curious. I know that, like three people were killed on rebel scooters in the past, but I do not know if you know how many other people have been killed by people operating rebel twitter. I believe the answer to that is: zero. Okay, I think that's a key when we're talking about safety- and I know you that you said earlier- you know harder than a dmv test to get a permit to drive a car, and I think that that's really telling given you know how much smaller a rebel scooter is, and I I've never been on a rebel scooter. I can't because I do not have a license but and if you're familiar there's an app called the reported app that allows anyone to report a tlc licensee, for you know bad driving of any kind, and this seems your changes to the app to allow people to report. Bad behavior seem very much in line with that. I just wish I could do it for drivers and not just people on rebel scooters. So thank you. Thanks Juliet Cheryl, you asked how many passengers one or two there should only be one passenger on the level. Am I right or wrong? No, so the vehicles were big enough for two riders. They were meant for two riders, so, like you could ride solo, but 22 of our rides are actually two passenger rides no well, there is the driver. I call the person in front of the driver and the person in the back is a passenger, but I've seen them with one person riding in front and there's two people sitting behind. Oh that's different. I do not know so when you said one or two passengers. I was like really they're allowed to do that. I've seen that when I say two passengers, I include the driver, so the limit for the vehicle is two so one or two you're, okay, if you're three like that's, not allowed, so obviously you would so maybe you need to put that also in your safety package, because I've seen that okay, that's skinny enough they'll fit two others behind you. We hope that was common sense, but I'll take that feedback back to the team. Thank you on your website. I just checked it out. Is there a way for somebody to quickly go to your website and submit a picture of a non-, compliant writer yeah, so on our website? The there's also a link to the community reporting tool before I log off. This call I'll make sure to send it in the group chat. So it looks just like the app, but it's if you do not, if you do not want to download the app and you want to do it on a laptop or a computer, you can do so as well. It's not a parent, I'm on the website. Right now, I'm on the home page. I do not see a link to report anything is it buried, it should not be, but I will I will get that over to you in a couple of minutes. What I'm trying to say is that you know it would be nice if the reporting could be super simple and people who do not have the app are able to report even a text. You know, even if you have a text number, that you want to, let people you know text from their phones, so the more you can simplify it. The better. Thank you for sure. I agree. Caroline thanks not directly about human safety, but maybe environmental safety. What do you do with the batteries and other pieces of the physical scooter at the end of their usable life? And what are you finding to be the end of the battery life and the vehicle life like how long I can answer that carol if you'd like the so this the mopeds are intended. Life span of them is three years, that's kind of what they're rated for and we can fix them and keep them on the road for a very long time, which is actually a huge advantage versus kick scooters which have a very short lifespan, and so that's kind of the benefit of the vehicle that we have. Our batteries are intended to also last that long. We do sometimes have one or two that we have to recycle if it if it does not work anymore, it's a dead battery and we use a nationally a national company. That's rated for recycling lithium ion batteries, specifically cool. So if I do not, I do not actually know of how big your fleet is. How big is your fleet? It's about 3,000 mopeds in New York? It's awesome so like if they're 3,000 and like one or two out of a hundred so you've disposed fewer than 50 batteries. Yeah I'd say probably around that. Oh yeah, great yeah, they're, pretty they're, very good quality panasonic cells, which is they're rated very highly so great right. Okay, I'm going to open it up now to members of the Community board. I know Miss Blount is on and then I wanted to recognize a new member of the community board. Her name is Kate Gilman she's, the phone number caller she's thinking about joining the committee and she's sitting in to participate for a while. So, if either of you guys have anything to add, you can feel free to chime in okay hearing nothing from those members. I would like to open it. One question one more comment: Juliette Okay Siro come on. I was just going to say: I think you guys are doing a really great due diligence job and trying to put together a lot of facets of your business without the state or the city getting involved you're giving them. It looks like you're, giving them a real lease on life there, because you guys are doing a lot of work instead of what our city father should be doing, and I think I congratulate you for that. I think, if you keep it that way, you'll go far, but there are areas where you may have some issues that I think could happen as far as bike lanes and things like that. But thank you. I would also. I would I'm pretty impressed. This is Patrick member I'm impressed by the it's. I did not realize you'd gone this far. I also want to add that I do think this service is an important part of the transportation network, a more sustainable transportation network. So thank you for that. Okay, thank you. I'm going to open it up to members of the public carolyn. Did anybody sign up to speak? Sorry, I just want to flag that we do have a heart stop at seven, because we need to jump to another call. So I do apologize fantastic, so we have other things to do too. No hands no hands! Okay, I'll! Just give it a couple more seconds to see. If anybody else would like to say anything something. Can you see me? Oh hey sandy! Yes, would you like to say something so just one thing about safety: the helmets are all black, correct, yeah black, with blue lettering, on the on each side. What about something that's more visible than black like for night riding, like maybe the light blue color or some other, more repeat, yeah. We're. Definitely considering that's a really great suggestion. I think we're kind of exploring what you know the helmet design can look like in the very near future. Just speaking of night time, I really, I think, that the closing between 12 and 5 is really smart, as people start going out more, except for healthcare workers. Of course, you know people are more likely to be drunk after midnight, so I think you're. You know that's being cautious to do that, and I do want to share that starting today for the next 30 days, possibly a little bit longer, we are offering unlimited memberships to teachers, so whether it's charter or traditional public schools. So if you're, a teacher or you know a teacher, let them know they can go on the rebel website and sign up for a free account and at least make their. You know back to school, commute a little bit easier. That's great! Oh! I had one more question about: do you disable the scooters in torrential rain like not while somebody is on the scooter? Obviously, but you know after it's parked yeah, so we're always monitoring the weather. So if there's heavy rains or snow or like extreme winds, we just shut down the system. Okay, all right! Nobody has signed up in the chat to speak. So I would like to thank you for coming before a committee and presenting and answering our questions and good luck in the continued outreach to the community. Thank you so much for having us always a pleasure. Okay, thanks for having us have a good night, have a good night all right! Thank you so as they're signing off, I think our next agenda item is the approval of the minutes. I think it's just. If you have any comments you can give you can give them to the district office, and I think it's just you know the John may have made attract changes edit, but if there are no more edits we'll move on to the next thing. Thank you John, as always for your excellent meeting minutes. Oh that's! Getting a little dark here. Next, I'd like to share the compstat report. Is there any way, caroline that you could pull it up on your compute on your screen? Sure, okay, thanks I'm going to turn on my leg as she pulled it up, pulls it up and we'll be able to see it, but notable to me is the big jump in gun violence- and you know I'm sure, everybody's, seeing the news and hearing about it happening throughout our district and beyond, but that is that is our number one pressing issue that is in our statement of district needs for public safety is gun, violence. Okay, I have it if it's difficult, okay, I do not know how to get it at my ass off my screen. Hey. Can you help if you want to give me we're currently looking at the district? Vpn Page is the document in your email or where is it located? I was pulling it up directly off of the web, but my signing page, that's my second screen. That's popping up if you'd like me to share, if I can, I can do it if you want to or caroline if you want to help me share content, sure once again. Okay, did it pop up? Yes, okay, so this one is for the 84th and I can make it bigger. Okay. Is that visible for everybody, so 84th and cheryl feel free to jump in and talk about the precinct council meetings. If yeah we've not been having any of those meetings? Okay, no. I did see that one was scheduled for an outdoor meeting. Perhaps no, we have no meetings and the seat has to decide whether they're going to do zoom calls. But you know how it is it's up to the city. Okay, we've got no meetings, there was one outdoor meeting yeah, but that was your NCO meeting. Okay, that was not the Community Council meeting. That's your NCOS are continuing to have their meetings. That's good to know. Yeah they're still doing the community outreach yeah. So you can see you know there are certain areas that have increased 300 percent greater and then there's some that have decreased like robberies, Grand Larceny, so that is, that is positive. I will just pull up the other one, and this too shows a large increase in shooting violence, 17 victims and 12 incidents. So far to date- and I think Caroline mentioned that it did not include by the date the most recent activity that has happened, do we have any feedback from the precincts as to where why or where or how these shootings and some where they come from and what's going on, we had actually invited the new head of the 84th precinct and they were supposed to attend this meeting. Cheryl. Could you remind me the name cheryl, I think she's muted, I'm sorry was he invited? Yes, he was supposed to attend, but then at the last minute, as usually happens, there was a conflict, and so he did not make it. So that would be a. We are trying to get a representative to be able to address those issues. Zero is what I I'm trying to say. I would hope we get one or get a written, we're going to have a meeting next month. I think am I correct yes, so before that meeting, I think what the district office could do is make sure that if captain rana could not be on the call, maybe the excellent can be on the call to explain the numbers, because I would not take it upon myself to explain these numbers, it's their numbers and they and they have all the details to say about them. So if he can't calm caroline, maybe you suggested him that he said he puts the Exo on the call sure, okay, great I'm sorry, this is esther. Can I say one thing: please do the 88 precinct did have a precinct council meeting Tuesday I was there. It was outside at 288 Clarson Avenue in the park, and it was a lot of people there. Thank you esther. Would you like to let us know what I do not have the stats. As far as all our you know, I do not have the stats. They said that crime is not increasing, that they talked a lot about car break- ins. They seem to think that was a big people are leaving things in their car where people can see it and a lot of car break- ins. They talked a lot about that. They talked about taking some guns off the street yep I do not have to you know. I do not have the statistics, they did not hand out anything with numbers or anything right did they did they speak to the increase in gun violence and what they thought the causes might be. No, they spoke to it, but they did not say what the cause may be. Okay, so I think caroline yeah, it would be great to you know, even if the commanding officer is not able to come a representative from the 84th or 88th. Frankly, we could reach out to both precincts. Okay. Thank you all right and I will stop sharing if I can figure out how stop sharing okay so we're back to the screen. Are there any other comments that anybody would like to discuss about the Comsat reports? Yes, Juliet Sandy! Yes, go ahead sandy, so I you know when I hear about the shootings on the news, they seem to be attributing it to gangs. I do not know if that's correct, and so if somebody can't come to the next meeting to give us the information, can they write it? Can we get a written report or a written report anyway and just in case it's a last minute change, because you know we should know caroline. What do you think about that? Do you think it's more likely to get somebody to come sure I can always ask and I'll do that you know maybe as early as tomorrow, just so they can get it on their calendar, okay and then, and in the worst case, if we're not able to get somebody to attend, it would be nice to get some kind of statement as to what they think the causes are. I wonder we're being flexible right, so it could be an NCO as well we'd like to get as high of a officer as possible, okay, so the Exo or the commanding officer, if possible, but if not then we'd like to get somebody who can speak and maybe the head of the NCO unit as opposed to a particular neighborhood which may not be seeing you know if we get Brooklyn heights NCOS, that person may not be seeing the violence or being addressing the violence. Okay, gotcha and may not be on the gang unit or specific, specifically focus on the gun task force. I think that's what we want to specifically address is the gun, violence, Julia Cyril. Yes, I was just going to reiterate. I think this is a very top priority and I think that they should be made aware that the community, as we are the Community Board of representatives, we would like them to at least come to a meeting or show us and tell us why and what's going on with this? This is a very important subject to all of us, so I wish they would take it that seriously and make the effort to come or join the meeting cyril, I mean they're doing their jobs. That's why they're not coming so. You know we are trying to get them to come, but we also want them to do their jobs. So, like that, I agree with you yeah. I can't argue with that yeah. Okay, that's why I suggested a written. I think yes in the in the case that we're not able to get somebody. I think that's a good way to address it if there's a gun task force. You know if there's somebody specifically dealing with these issues. Okay, if I could share my screen again, I'm going to move on to the statement of district needs and the primary processing issues unless there's other comments, okay, so moving on okay, this is the language that Carol Ann put together. I just wanted to review it as a group to make sure that we're satisfied with it to go in as the transportation and public safety top priorities, so the BQE again being the top priority until that work starts and being underway. You know it does not. It does not specify any sport support for a particular plan. It's just putting this on the agenda. So if you as a committee, want to add anything to this now's the time to do it point of clarification. So are we saying that this is the biggest issue with transportation? Okay, so just transportation, not transportation and public safety? Okay right, but it is one of the top three pressing issues in or as was voted on in the whole community, Board. Okay, good to know, okay I'll, give you guys a few minutes to read it, and I know some of you are more involved in this panel. I'm sorry in this issue I do I mean I think this is a good statement. I it's. There are a lot of unknowns here and you know it's just it's just a very different situation from even eight months ago, and but I think what this says is keep it on track. Yes and it's urgent, because we can't we, you know this one, this one actually can't wait. Okay, I'm going to connect with that too julian. It is a pressing issue and I think I think it's a pretty a very concise way of putting a very big topic together. Great all right, I'm going to I'm sorry, I can't see anybody's hands so feel free to Juliette Sandy go ahead sandy. Yes, so I'm on the stakeholders, Committee! Yes, number of people are as well and I'm not aware of any follow- ups since the I do not know when the last meeting was should we have somebody come to our committee to give us an update on where things are. At this point, I think that's a great idea. I do not think we need to put that in the language here, but yeah I mean do we want to put into the language continuing meetings with the stakeholders and engagement if you're saying that you have not been engaged recently. Well, I'm not aware of that. I'm not aware that a meeting for the stakeholders has been called. You know in a very long time and we do not know what's going on so I'm I mean I'm not. I was not actually thinking for our statement, but it could be that the Community board wants to be. You know, kept apprised of yeah the next steps or the delay, or I think, since this document will probably live longer, hopefully live longer than us staying informed. I think we should just try to get informed on the side of, and not necessarily put that in this document right, but I think put putting continuing public engagement is good. Caroline, if you could work that into the language, somehow that we support continuing public engagement on it, but really the work needs to begin immediately and that's you know, that's the that is this. You know this is our main priority: okay, yes yeah! This is Brian just go ahead. Brian, I'm sorry! I was not here last month, I was wondering I know that this has been the. I know that this has been the issue for several years. Did we put together this text last month, or this is the text that was previously there and I think Caroline may have wordsmithed it so Brian last month's agenda was a a. I think it was really enlightening in terms of our communications and discussion and education, about a lot of justice initiatives and both in the criminal and in the social justice arenas. You might want to watch the video of it, but I do have the document that we were going to review as well. That came out as a result of that with our revised statement of district needs and I think Caroline distributed it in advance of the meeting as well. So after we go over these two, I can spend some time on that document as well to make sure that we're good with it and to address Caroline's suggestions for two additional initiatives. Okay, it's going to be good that there's a video, because I am very sorry that I missed last month's meeting. I just wanted to call attention to one of the lines in there at the BQE. The rerouting of traffic will send tens of thousands of vehicles into local communities, increasing the risk of crashes, environmental pollution, congestion and stifling of neighborhood businesses. I do not really think that that's necessarily a neutral statement. I know that there are many opinions on this and I think that the rest of the statement is neutral as to you know that this is an important thing and that you know a decision needs to be. It needs to be reached and planning for what comes after. The current roadway is very important, but I think this sort of stands at odds with what we know about you know induced demand and that this is not necessarily a statement in line with the rest of the sentence is not necessarily in line with the rest of the statement that, like rerouting of traffic, will surely happen, but I do not know that it will necessarily increase pollution, congestion and stifling of neighborhood businesses. Ryan, do you have an alternative and includes? Because I think I think the community is all is certainly concerned about the traffic rerouting of traffic? Maybe you want to reword it and add something to it or change it in a way where we could make it amenable. But basically there is a point to that. I think that's why we talked about it last week last meeting that it was important to address it. If you want to add something or change it, maybe that would be interesting too yeah. That's why I was you know, asked about because I think it was came up. I was not here. I think if there are diversions or the road is closed in some way, you will have fewer cars and fewer trucks and you will probably have less total pollution. I'm just saying that I do not think that this statement is sort of you know. We must build something, otherwise, problems will get worse, and I do not think that I do not agree with that, and I think that there are many who do not necessarily agree with that. I think it's more sensitive if no, if no alternative is decided upon and implemented before the roadway is shut. That will be something that is problematic. I just I do not really have any alternative language, but I do not necessarily think that rerouting or traffic will increase pollution. I think if it's more difficult for people to drive, you will see fewer people drive and you have less pollution. You may have more trucks, but you may have more trucks to make trucks going down narrow streets and in the in the local communities. I think that's what the community is thinking about. Overall, you may have less pollution but you're bringing the pollution into the neighborhood right. My suggestion is to leave it in there. I would I would leave it just as it is. I I'm in favor of leaving it in there so long. As you know, this is the way we treat anything that adds cars or parking spaces. Moving forward in this community board. That's good, can I say something: that's sandy yes. So this issue is the is a very big issue and concern to the surrounding communities. Brooklyn Heights, Forum, Hill, Cobble, Hill Dumbo, you know all the neighborhoods are going to be impacted by traffic, so I do not think we're guessing. I think I think it's going to happen and that's what everybody is very nervous about and how this is going to be. You know how what the phasing is. We know that if they're going to take parking, the small businesses are going to are going to be impacted, so I do not. I do not think we should leave it out. I do think. Brian has a point that if the capacity is reduced, then the vehicular usage will be reduced as well. That's typically how the engineering models go, but I do also think that, because of the truck usage on the BQE that the trucks are not going to have are not going to necessarily maybe drivers will be reduced, but I think trucks are still going to do their daily trips other than in times of Coronavirus, where demand is very low and the city is shut down. So I do think you know, though environmental pollution overall may go down. I think, maybe, if we tailored this a little bit more and said you know environmental pollution in residential neighborhoods, what about noise pollution increasing right? So the truck so you're going to balance you have environmental energy pollution in residential neighborhoods, something like that you're going to get into a lot of nitpicking, but basically you're going to lose one and gain another trucks going down narrow streets, making noise at different hours of the night. They may not be traveling between nine and five and we travel between seven and seven at night to three in the morning. So I will say again: I would leave it in it's, not it's not specific, it has a range and I think it does encompass our concerns. Okay, and I understand what you're saying I think that I mean there's a difference between having a truck only highway and trucks being diverted off a road. That is closed. I just I hate to be a broken record, but we're talking about probably the largest highway project in New, York City for maybe a decade and there's nothing in here that even mentions climate change. I mean like our skies. The last several days have been blackened by smoke from acrosss the country, and I think it's strange that we're talking about rebuilding a highway. Nothing in here that says, like it's important, that the city deal with it in a way that is not. You know also destructive in ways that affect community board too, and I know that's very vague, but there really is not anything in here about climate change and that really makes me uncomfortable. I definitely see your point Brian, I mean most of the community- based organizations that are involved with this. Have that at the top of their list, the urgency I felt you know this with this year's statement of needs was just to say, you know really keep it on the agenda, but I do think that I think the language should should reflect. You know the horrible real world that we find ourselves living in now, at least to say that the pollution is going to be in the neighborhood. You know it's, but induced demand will will result in fewer less traffic. You know what I mean so far. We're not you know. We have not come out in support of a particular plan, but there are plans that are out there that reduce the the capacity of the BQE. Do we want to phrase some support for plans that may benefit the climate? I think I would stick with more general design goals of like, and you know like Brian said these are vague things, but sustainability, okay, just to stay away from like the specific design options. I do not think sustainability in this case is the way to move forward, because that just means maintaining the status quo. I think we would have to say we want a solution that results in fewer emissions like, I think, that's vague enough that it might be okay, it means very little just incrementally more than sustainability would. But I do think that you know if we move forward with this precedent of having this line, that everyone seems to agree with, except for Brian about cars in residential neighborhoods. We are on the right path to get rid of cars in residential neighborhoods. I think you're making a good point. I think we could talk about something add something like that into it. My only fear is that if we tamper with it now- and we get into this conversation, we may be muddling it up and changing a great deal. I think the idea of environmental climate change is important, and maybe we could include something, but I do not think we should go back and start changing it as it was done. Maybe add that to it. I think the result with what Carolyn just said, with a thing that may be a nice broad statement about the end result should end up with a very vast improvement of our environment. Could you make that statement again? Caroline? I think it was like, so it could be. I'm reading the last sentence, Community Board 2 hopes the DOT can find a workable solution for rerouting vehicles, blah that results in fewer emissions and a better environment than we had before. Can we say like that, just add on to whatever that does not worsen climate change. Great I'm concerned about the word sustainable in context of what DOT is capable of doing so. I would like to leave it out. Okay, let me just write the sentence. Oh sorry, I already can talk about it. So, okay, I've last chat results in fuel vehicles and then I lost track. What was the rest of the vehicles, fewer emissions and fewer impacts to climate change? Does that work Brian are in consideration of the climate. Just something trying to think of like solutions does not work, does not worsen climate change. Does not. I mean it's a more ecological devastation. I just feel like when we like yeah, I feel, like the other when we start saying things like sustainable and ecological, that D.O.T, you know, sees them as weasel words to find some way in which they have done something sustainably, but like blessing climate changes simple. Thank you. Sorry for sorry. Thank you. Yeah thanks Julia that works for me. Do we have consensus on this good change, okay and move on to the next one? Oh, thank you. Any comments from the public or other community board members feel free to speak up. Go ahead. Dude, I do not know. Do we expect to have any response from Dlc to any of these items? Well, I mean real. Realistically, this conversation has gone on for the past 20 years that I know of Blt has not presented to the community any proposal about how they're going to address this issue. You know they're going to be some rerouting. I do not know unless trucks magically disappear. You know they're going to be some impact and you know you can engage in this academic exercise, but you know to be truthful. It's going to be hard going for the community and you have to say that we say that yeah we do. We kept that language in here, okay, yeah we kept that language, but I'm going to have to excuse myself. Sorry, I can't hear you very well ernie, I'm going to have to leave the meeting. Okay, thank you for participating all right. I'm going to move now any last opportunities for BQE comments. I was just going to say: Julia. Would it be better in wording lessens the impact of climate change? Just is that better English or just leave that at least yeah? We got to work this out like let's let Carol Ann figure out the okay, all right public safety. This is about gun, violence, well violent crimes and then also about bias in policing. I think Caroline did a great job with this one personally, this is this is very good. I thought it was a well done. Caroline! Thank you. Do we have consensus on this one? Yes, for me, I agree. Yes, thank you great job, caroline you're glad we have a lot to work with really nice all right. I will not do anything with that, one okay. So now I'm moving to our statement of district needs, which we went through last time and Carol Ann. Would you like to talk about your two suggested editions? Can you can you? I will increase the size yeah. I have old lady eyes. Okay, here we go okay, so based on our statement and needs, we talked about using some of the funding. That's coming out of the police budget for training, so I thought we should add the types of training as well, since that is a separate tab in their budget priorities and that some of that funding can also go to youth crime prevention programs through the pow program- and I was thinking with this one staff and training resources. Maybe we could combine that with the mental health one and sort of take this part of it and make this its own statement, expand opportunities for mental health experts professionals to be the first responders for mental health emergencies and then consolidate training here and add mental health to their training repertoire. So de- escalation techniques, bias training as well as dealing with persons of with mental health, homelessness and other issues, and just so you know during the general meeting somebody asked me specifically: do we have a statement that calls for first responders to be something other than police officers to be mental health professionals or other people who know how to deal with people having mental health or drug emergencies? And so I think you know. I think that is an important one to stand on its own. Is there any comment to that? If not we'll move to the next one yeah. My comment is on the youth crime prevention programs. Are we there? Caroline? Do you want to talk about that one? Well, the police department has the police Athletic League the power program, and so that that's just sport, so I thought that maybe they can look at expanding their programs to provide chess. I do not know but other types of programs that use that are not that, like they could get involved in. Yes. That second thing you say, I think, is a good idea and I wonder if we could extend it to like holding apprenticeships and internships for youth with some of the alternative justice programs instead of the police like that or in addition, I think we have something like that. I it seemed familiar but yeah. Let me go to internship yeah. We have this okay. I guess I just want more opportunities like we talked about the center for court, innovation and stuff, like that, and I'd rather us think about allocating money to things that were not in the department of corrections and the police department than that were in the police department, like community- based programs. Exactly thank you sandy. So let why do not? We put it in the reallocation bucket redirect funding to educational Internships job training like something like the employment program, since it's specifically outside of the NYPD we're looking we're looking at job skills, internships? Okay, are there any comments specifically about expanding pal programs? Carol, you know, maybe you have more experience. It is because Powell does a lot already. You know they do have preschool and after school programs and caroline is right, expanded beyond sports for teenagers. They already have that Yep Kyle has preschool so Carol Anne, given that pal already has that what were some of the ideas that you had? I mean after school programs, not just sports after school program, cheryl, like other sorts of after school programs, yeah expanded to maybe they can have internships. As everybody was saying, internships, even technical training classes things that are useful for communicators, things that pick a job. Okay. The link that you just saw Caroline has the mention of like acting program and like college preparatory work, so definitely things that were not just sports okay, so they already have that. I do not see that so I do not know that we need this one, since we already have internships up in this one. Let's take it off. I did not see internships on there. When I looked at their website Brian, do you see internships on there? They do have actually say have Powell expand their program to be on sports. We know that they dare. There is pre- k and this preschool training, because I see them there's in the projects. I see the Pal Athletic League has a preschool training, or maybe you need what they need to do is when you come to teenagers, to focus not only on sports focus on other things that will get them away from activities. I kind of like the way, caroline worded it it's fine, because I think we did use Internships in somewhere else before on Understand. I can't put my hand exactly where it is, but you just want how to expand if they're, if you're going to be taking money from other places and putting it towards how, then pals should be a little bit more, encompassing of not only younger kids but more older kids, okay yeah, I so the reason I brought up the alternative justice Internships, which is a line item apart from this. I understand that now is that I think anything we can do to create programs that are not from the police related to the community are helpful as we move toward a world where, ideally, there are fewer police or the police, are you know not having a reach as wide and as discriminatory and dangerous, especially to people of color, as it has been lately. It's also good. I mean, on the other hand, it's also good for the police to improve their relationship with the community by being participants in the community playing basket playing these sports with the kids training mentoring them. You know uncertain, you know, sort of you know. Maybe it's even you know I like with Fdny, I think you know we. I went to a one of the 84th precinct councils and there was like a youth training program with the fdny, and that was a really good way for Fdny to connect with the community. It goes I think, if they're too separate, you know that will help enforce the bias. So you can not separate the police department from young people. You want to build a relationship. You can't want them to do anything with the police. I'm sorry! It's not right, because you got to remember that these kids live in this community and they are cops who live in the communities too, so you're trying to tell them. You do not want to be friends with cops. You can't do it, I'm just trying to imagine a world where they are not necessarily as prevalent, because their presence can be violent. I definitely recognize that there are good police officers and I'm grateful for a good number of them and they do some great programs like pal. That said, like, I think that when we get used to the presents it's kind of like the military recruiter who's, always there I mean it's lucky that the police department will pay them a living wage. But it's sad that too many officers end up. You know the lack of a better word brainwashed. I just I would be remiss if I did not say that I felt like any dollar we give to. The police is a dollar that should be spent somewhere else. Cheryl is there? Is there a brochure that the police department puts out explaining? What pal is that we can see? Do they have an actual written mission statement on it? I'm not sure, I'm sure if he went online and went up on the police update, please I'm sure there was a much information about that and then, when you talk about how the people who are doing the preschool training are not cops, they hire people to provide this service, of course yeah. So I do not know you know everybody has to you know. Some people are pro cops. Some people are against talks, but I'm advising is. I do not want a world where children do not feel safe because they were brought up thinking that autopsies are bad. I think I think that I think that that's what Juliette made that statement. I think that's very good statement. I think you're right they should be, they should be in the neighborhood. We should see them and be familiar with them and not put them in another area where they look like to them and we're here. So I think Pal. As I remember when I was young. It was a very interesting and good thing that the police did, but I do not know what how it's evolved since then, but it must be a much bigger thing than it was before. It'd be good for us to know what exactly it does do before we start changing it or just adding to it they may have. They may have those things in their mission as it is just we could put in our needs to encourage it and let it grow, and that may be something the Committee board should do just leave Caroline's statement as it is. I think it does address that yeah. I think I mean it. Why do not we leave it as it is this? All of these statements will be voted on in the larger community board, so the priority will be voted up or down by everybody in the community part. Can I just interject for a second juliet on Pal's website they do mention. I do not want to say the need, but that they see a reason to increase their programming as well, so just saying that that's part of their goals. What do you mean on their website? They mention seeking to expand their programs, so this is their goals. Okay, that's good! I just want to caroline's point, I think so. I did not participate in like Pow as like a regular thing, but I like ran track and often at pal meets none of the people. I believe who are like administering these programs. Are you know in uniform, and I think that this is like something that is often seen as different from like what the police department will often tweet about, like our officers playing volleyball with some kids as they did the other day did. I do not think this is being like this should not be an experience with law enforcement. This is these may be experiences with people whose jobs are law enforcement, but I would not phrase this as an experience with law enforcement. That seems to be somewhat at odds with our line from our statement. Being you know, systemic over policing of people of color. Do you think, then it's not appropriate in our public safety district needs. You think it's more of a community affairs Yucca kind of thing. I no I'm not I'm not saying the statement I just I do not. I think that the police athletic league activities can be positive, particularly because they are not really seen as like, interacting with police. They are like under the ages of the police department in a way, but we're talking like people, coaching students and people at this program, teaching kids act- and you know various other, I think- is the 1500 students in the summer Youth employment program. I would not really say that this is an experience with law enforcement and that's not necessarily something that we should having like a positive experience with a police officer. This is more like positive experiences with people in law enforcement, as opposed to with law enforcement itself. I was just commenting on the wording really. Okay, do you want to you still supported staying in yeah? I'm not I'm not. I do not oppose this being in here. Caroline, are you post opposed to this being in there? No, this was just a draft to help. I do not get a vote and caroline todd. I'm sorry if our names are so similar, I so I just did an internet search and the police Athletic League is a non- profit, independent group. I did not know this and they do not wear. Thank you Brian for that explanation. Like I'm in favor of pre- k and stuff, I just I maybe it does not belong here. If it's a totally, you know separate group every everybody else likes it, I'm happy to fight over other things. I made my piece about you know if I have the opportunity to give a dollar to the police or a dollar somewhere else, I'm going to give the dollar somewhere else. I have no personal experience with pal, so I I'm not familiar with it. I do not know. Okay, that person experienced a pal. I grew up. I grew up in the streets. Are people interfacing with law enforcement personnel? Well, when we had the pal in our on our block, we had policemen with. I guess they wore, I guess, a sort of shirt where they had their insignia on it, but they did not have the uniform on, but they were there to help us and teach us and for sports and a lot of different things. My experience, the experience, was pretty positive in that sense, as I said, it was a while ago, but I think that was it made us and the police more interactive. Let's put it that way. We call them by their first name. We had lunch with them. You know it was there was there was that they were there for a long time. During the day it was not just a couple of hours and what neighborhood was that cereal that was Ben Stein? Okay, so can I say something it's sandy hi yeah, so I think the idea and I've been part of pal, but the concept is to. I think it works both ways for the kids to see the police in a different relationship. I agree with you yeah and then for the for the police to see the kids differently. I mean it's it it's two ways I mean I taught for a long time I taught for over 40 years, so you know, I think it's very important. That relationship as opposed to just the police in the uniform I mean police are people, you know they're, not just they do not just wear uniforms 24:7 they have families, they have you know, so I think the understanding that you know police are family people they're people in the community. That help is a good way to change the perception, okay and then again for the police to see the kids differently. Not all trying to you know do something: bad, that's what they're looking for? Normally it's a different dynamic, hey! I just want to go back to something that caroline said. I remember over the years you know from when I was growing up till to more recently that the police, actually that pal is non- profit, but the police actively raised money for the programs. I mean I've donated in the past. I mean yeah no you're and it and they, I just remember getting these phone calls over the you know like, and this is going back from what I knew while I was growing up, and so it's I just was wondering about the funding part, because it seems like that these two officers are, you know, you know on the wrong time actively trying to raise funds. Well, actually you know that's a good point. If it's a 501c3 not for profit, is it getting city funding? Yes, okay, I'm true, probably through DYCD, so I may have to rethink if it belongs here or if we can ask Yaka to pick it up. Okay, yeah, they received city funding all right as long as it's getting city funding, let's keep it in and then people can vote on it in the greater Community Board. So I'd like I added the people in law enforcement, I made it both ways. The relation the positive experiences. So it's you know between the and people in law enforcement. Okay, so I'm going to move on the other ones are the same as before and Brian you have it in your email and anybody else who missed last month's meeting has it in their emails. So we will submit these as our statement of district needs. There is one addition I wanted to just let you know of the Economic Development Committee Bill Flenoy was kind enough to send me his proposals as well. They do have a funding priority that is, provide funding for employment programs aimed at reducing recidivism, offering, formerly incarcerated individuals, ongoing support to build career capital and financial stability. So you know they have sort of cross promoted a similar agenda as we're promoting. So I just wanted to let you know that's on their list as well and having said that, I'm not going to get into every single one of these because you have them and we went through them very thoroughly last time, so I will give the screen back to the meeting. Did you get? There was one more in there that there did. I miss one yeah here. It surveillance cameras this one huh, please. I think we had a discussion about that last week. Thank you for reminding me go ahead, Carolyn, okay, so the Community board has received some requests for Philip purchase of surveillance cameras for a couple areas in the district, in particular along Fulton Street, around Washington Avenue, and also along Myrtle Avenue, where there recently has been a series of break- ins, and so this was a request from the Myrtle Avenue bid, in particular for Myrtle, Avenue and constituent request from the Clinton hill area for on Fulton Street. I think we should support that. I do not see any reason. Why not yep? I agree great. Thank you. Caroline for the edition. Oh Surveillance cameras. Caroline, I'm opposed, but you know privacy yeah, I mean we have civil liberties and I do not want to live in a militaristic state where you know anyone can watch me doing anything and we do not have proof that they make things more secure. If you look at the London bombings, there was surveillance everywhere, but we're it's. If the majority, that's fine, I'm not going to convince anyone. Who's in favor of surveillance, cameras to be opposed to surveillance, cameras in five minutes surveillance cameras, but I'm not going to go with the group. It's good to hear you guys. You know, I appreciate the diversity of opinion and you know I'm glad you are able to speak about that. You know if you want to have the opposite on there too. We can talk about that. I also support those comments and also, I do not think it's worth getting into. Okay, all right! Thank you. Are there any other additions that people have been thinking about since they're last month? Okay, if not I'm going to move on to other business, I have a question: is the Brooklyn house of detention currently being used for something other than admin type stuff and like okay? What is it being used for? I guess is the question. I think the prisoners in there, but they've called. I know that they're calling a updated meeting, there's an updated meeting scheduled for next week, where they're going to talk to some of the community people, and let us know when, where they are at this point, they really have not announced very much but they're supposed to hold an update what's happening next week. I think okay! Well, if you should I, how can I find out more about that sign? I just heard about it from at a meeting with that and I was not personally invited, I'm not exactly sure. Okay, I guess my so it was empty and the thing that tipped me off was every week every saturday there are a ton of police vehicles parked illegally in the blocks around it up foreign place and state and Smith, and so I noticed something must be going on. Well, there's still central booking, you know, there's so central booking that we bring people down to central booking on State Street so that that's they may have been bringing people in from the night before that have been brought down to central bookings, and so then anyone from central booking correct me. If I'm, I know very little here, I they are not there very long right. It's just like a stop gap, no they're there until they're arraigned and on the weekends they may not actually be arraigned. Okay, then they're not running the night court, I'm not exactly sure, but you know they're, they hold the you know they go down to central booking. The complaints are filled right and then they're held until they're arraigned before the judge, and then the judges said and then you know, then the judge would decide what they're going to do and most both of them now, unless it's a violent crime, but I'm not again the meeting of the house's attention. I know it's taking place. I have not been invited, so I'm not exactly sure. Caroline have you heard anything about it or if anybody from the community board attends that meeting, could you let us know how it goes? I believe Rob attends that meeting I'll follow up with him on that. Thank you, I'm Juliette! It's the mayor's office. Thanks Ed. I guess I could not hear what Sid was saying, because I have been involved in the whole process with the with the jail and the you know, but I could not hear what Sid said, because it was a little muffled. He said he was just. He just found out about a meeting about the house of detention and update, that's being organized by the mayor's office of I'm not sure if it was well, and so I would that be I'm on the knack, the neighborhood advice were you invited to a meeting? Not I have not heard about it. Okay, so that's why I'm asking, but now I'm going to look into it. Thank you and other business Patrick. Did you want to talk about that task? Force yep thanks for that prompt, so they're, the community coalition for the bqa more BQE comments. It has put a request into the mayor's Office Act. Actually, it's had Steve Levin's office put in a request for a task force, and this is a a long time or this has been a persistent request. Through this whole process, there have been a few community meetings, but they tend to be kind of like just these mass meetings and you know not very clear agendas. So the idea is to create a a regular meeting of regular and key points, reporting modeled on the Lich task force, that's in place and that you know just one issue that stands out. There was a request for repaving and the DOT said: okay, we're going to do it and they actually did it this past summer, but it turned out. It was only the northern end of the of the roadway and the rest of the community was just so frustrated by that and that's that sort of information could have been shared and discussed in a meeting of that sort. So that's what we're asking for it's going to be a long time coming. They just you know DOT is, I do not think is so excited about the idea. But it's that's the request. That's in and, of course, we would have community board too. Of course would and other community boards would hopefully be a part of that. That's it thanks. Patrick go ahead Doreen, so I attended the meeting Senator Cavanaugh had with the MTA for the rutgers tube rehabilitation, which is the two between East Broadway and the York Street Subway Station. I'm on the chat I'm going to post the website. It's really they did a great presentation. I have to say, and you can see it and there's all the information there. So it's getting late. So I do not want to drag it out, but the whole idea is to rebuild it so for resiliency and Yada, and so, if like say the electricity went out, there would be, you know, a backup generator for at least two hours, they're improving cell service. I asked and suzanne quint the CB2 member. We were in the chat asking. You know you were able to ask live questions and they were answering about the York Street. You know this second means of Egress at York. Street is not part of this, but the Mga said you know, get your elected officials to allocate money, but if York Street, the East Broadway Stop, is getting ADA improvements, but York Street is not. They said that it would puncture the tomb. It did not seem like a really good answer, so I'm going to follow up with that, but the service is going to be shut down. You know one week in September October, I think November and then four months in the beginning of 2021, but it's the last of the sandy, the damage from Sandy's the 11th project and they seem pretty confident that they've really learned from their mistakes. So a lot of the what they have found is that when they provide shuttle service that most people really would rather have train service. So they're going to have a very active, wait and see and see what people they're going to provide shuttle service, but also, you know see what you know people's needs are so I mean I mean they seem pretty confident they're going to be on schedule and you know seem very upbeat about it all, but it's probably good that it's happening at a time where people are not using it. You know where the advantage it's a silver covered lining thing. I thought it's happening at the you know during this time, but anyway it was up right now, I'll put the website up and you can look at it. So any specific questions, please feel free to ask me, but I think everything you'll see on the site so I'll put that on your house, what what's the duration durian of the shutdown, the it's going to be four months for the in the beginning of 2021, but for a solid week and except the dates are like the 14th to the 21st of September and on the website. It gives the dates, but a week, almost every month, up until 2021, and then it's going to be completely shut down for four months well, when they, when they actually do when they actually do that. Well, I do not know yes, I think you're right, I'm giving you the wrong information when they actually in the beginning of 2021, it's going to be shut down completely, that's not what they showed all right. Maybe I'm really wrong about this. You tell me I'm going to put the website on I'm a little distracted right now, but but I'm going to put it on the day: that's not what they showed at all. Really, what did they show? They showed that it would be closed down a couple of weekends, all right and it would be closed at night for a while, but it would not be closed but where you know that it would not be closed, you know that it would not be closed weeks at a time. It would be close one or two, you know long weekends closing, but the rest of it would be open, accepted, you're, right, you're, right, trains, nights and weekends. During the weeks of September 14th 21st 28th one week in Mid- October and one week in mid to late November, I'm going to put the website on and okay that sounds good, we'll go through them. We need information and we do not need to chit Chat. So I'm going to do that right now and then, just following up on that, do we need to add expanded? You know in terms of response to hey, get your electeds to fund this Yes York Street station on our capital request related to transportation. Yes, okay, so I mean it was always on there so yeah. They really need to. I talked to Dan Wiley before the meeting and then after the meeting, and he said that Nydia is still trying to actively get the money for congested congestion pricing. So I do not know we have a we're trying to schedule a meeting to try to get her to get funding for that. It's a federal he, the MTA. I do not know he seemed to think that had to be federal funding. So oh, okay, caroline, I think she's right it did used to be on here, but I do not see it. Did we remove that accidentally yeah? It used to be on here it used to be a kind of at the top yeah. I think we need to make sure that it's on there so we'll just go back to the previous yeah, make sure it's on there I'll follow up with Carol Anne tomorrow, okay, jax rutgers! Here we go if there's no other business. I would like to open up for community forum if there's any other members of the community that are left on this zoom call feel free to speak. Okay, hearing no comments from the community. I will first I'll let dorian post her. Oh, she did okay great. So I will adjourn the meeting and look forward to seeing you all next month. Thank you, Caroline bye! Thank you good night thanks a lot say. Well, everybody.",
            "summary": "This meeting of the transportation and public safety committee of Brooklyn community board.\nAnd now we'll begin roll call and introductions I'll start with myself, and then we can just go around the the webex boxes and the committee members can introduce myself themselves : I'm Juliette, Colin, Chang, Chair of the transportation and Public Safety committee, I'm Cheryl Gillis Vice, chair of the committee John Quint Secretary of the committee Sid, my member of the committee member of the board, Cyril Scala member of the committee and member of the board Patrick Sorry Dorian Gallo member of the committee member of the court Patrick Blackie member of the committee Caroline Todd member of the committee and Howard member and the Committee Sandy Unmute yourself, Okay, Sandy Balboa's, a committee member- As, I said, every member of the committee is here except Mr. Do.\nWe have the relaunch of the rebel scooter, rideshare program, the approval of the minutes, chairpersons, report, other business and community forum.\nLet you guys know that we'll be reviewing the statement of district needs that caroline distributed, as well as the comstat reports.\nI, think you guys had met with our previous community manager, John White a few months ago and lauren when we initially visited the board and since then, we've relaunched with some safety initiatives.\nThe same ones that our CEO has same ones , I have, and we work with local workforce partners like say: Nix Alliance, work on workforce innovations really to hire within the community, as well as the New York City Small Business services, who we've hired over 65 different folks from from the very beginning.\nNot only what rebel rules are, but New, York, City and state law So, like you, can not ride on a bridge.\nIf you wanted to actually get back on a Revel, you had to go on the app and take a 20 minute safety training with the 28:42 questions.\nThe feedback that we've been getting at other community boards and just from people that write in is hey like this exam is pretty comprehensive.\nYou stop your ride, you're, actually going to get a notification saying hey like you've, been suspended, and this is the reason why so that's a practice step that we've taken We've also really increased our lessons capacity in all four bars where we operate.\nWe know that maybe at night there have been some issues in other communities, so we just have shut down the service overnight from midnight to 5.\nIf you're writing two blogs three city blogs like we can just use technology to know so, the next time they I think one just went by so the next time.\nSo like what we do not do is stop your ride Mid ride because it's fairly dangerous on the city streets, But once you conclude your ride and you end your ride, the next time you would try to log in you, Would actually just be suspended, so you would not be able to do so What do people have to do to get off suspension So if you're riding like through a park, there's nothing , you can do You know change your mind about the fact that you should be back on the platform, so there's some suspensions, for example, if you're not wearing a helmet, we'll suspend you for seven days, the first time, but if you do it again, then you're permanently off the platform, because we feel like a user that is caught.\nWe rely more on the community reporting, as well as our staff, so because we have a network of 3,000 bikes throughout the city, we're constantly doing batteries bikes around So. That's one of the ways that we make sure that we catch people who are on the bike lane and people tend to report that activity, often so, as a follow- up question.\nI know your GPS catches, people going on one way streets and things like that, but if there's an over amount of rebel because it would be tempting human nature, that would be a tempting place for a rebel rider to actually to ride.\nIf any community complain about a rebel rider on a bike lane and you submit a photograph which is suspend that user right away?\nYou know it's having a driver's license and getting on a motor scooter, two different things to navigate on a city street, and what are you?\nThis is not like riding a bike or driving a car, so I'm just surprised: We had the motorcycle safety training school work with us on the curriculum which they loved they're available in all four boroughs.\nYou do anything in your new safety program to improve the safety of the vehicle like sometimes the tires may have been a little bit more bare than would have been optimal to say right in the rain or any other safety improvements to the actual scooters themselves.\nThat vehicle was just extra popular that day, but they're constantly being replaced, and we do bags of 20 or 30 liners so that we know like the next user is going to have them, even if it had 10 days, 10 racks a day, and there is two people per ride.\nYou know there are a lot of instances where people just do not have like a dead, the dedicated time to go in, but they have been riding a motorcycle.\nWe do sometimes have one or two that we have to recycle if it if it does not work, anymore Okay, I'm, going to open it up now to members of the Community board.\nI was just going to say: I think you guys are doing a really great due diligence job and trying to put together a lot of facets of your business without the state or the city.\nThat I think could happen as far as bike lanes and things like that.\nWhat about something that's more visible than black like for night riding, like maybe the light blue color or some other, more repeat, I, think we're kind of exploring what you know.\nJust speaking of night time, I really, I think, that the closing between 12 and 5 is really smart, as people start going out, more, except for healthcare, workers.\nOf course, you know people are more likely to be drunk after midnight, so I think you're.\nSo I would like to thank you for coming before a committee and presenting and answering our questions and good luck in the continued outreach to the community.\nThink it's just You know the John may have made attract changes edit, but if there are no more edits, Next, I'd like to share the compstat report.\nWe get a written report or a written report anyway So it could be an NCO So, the Exo or the commanding officer, if possible, but if not then we'd like to get somebody who can speak and maybe the head of the NCO unit as opposed to a particular neighborhood which may not be seeing you know, If we get Brooklyn heights NCOS.\nAnd I think that they should be made aware that the community, as we are the Community Board of representatives, we would like them to at least come to a meeting or show us and tell us why and what's going on with this?\nThat, like rerouting of traffic, will surely happen, but I do not know that it will necessarily increase pollution, congestion and stifling of neighborhood, businesses.\nYou know all the neighborhoods are going to be impacted by traffic, so I do not think we're.\nI. Think I would stick with more general design goals of like, and you know, like Brian said these are vague things, but sustainability, okay, just to stay away from like the specific design, options.\nSomething trying to think of like solutions does not work, does not worsen climate change.\nThat second thing: you say, I think, is a good idea and I wonder if we could extend it to like holding apprenticeships and internships for youth with some of the alternative justice programs.\nI, understand that now is that I think anything we can do to create programs that are not from the police related to the community are helpful.\nI went to a one of the 84th precinct councils and there was like a youth training program with the fdny, and that was a really good way for Fdny to connect with the community.\nYou know in uniform, and I think that this is like something that is often seen as different from like what the police department will often tweet about, like our officers playing volleyball with some kids as they did the other day.\nI think it works both ways for the kids to see the police in a different relationship.\nThey have you know, so I think the understanding that you know police are family people , They're people in the community.\nOkay, yeah, they received city funding all right as long as it's getting city funding, let's keep it in And, then people can vote on it in the greater Community Board.\n, there's an updated meeting scheduled for next week, where they're going to talk to some of the community people, and let us know when, where they are at this point.\nYou know one week in September, October, I, think November and then four months in the beginning of 2021, but it's the last of the sandy, the damage from Sandy's the 11th project, So A lot of the what they have found is that when they provide shuttle service that most people really would rather have train service."
        }
    }
}