{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Licensing Committee Meeting",
            "publishDate": "2020-10-15",
            "shortDescription": "",
            "lengthSeconds": "3:02:33"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "6AonoqKk6Ms",
            "fillerWordCount": {
                "uh": 974,
                "um": 307
            },
            "readTimeFullTranscript": "90 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "item": 70,
                "business": 53,
                "agenda": 42,
                "residents": 42,
                "license": 42,
                "music": 41,
                "restaurant": 38,
                "location": 36,
                "guys": 29,
                "place": 29
            },
            "wordCountSummary": {
                "business": 11,
                "residents": 10,
                "license": 10,
                "noise": 10,
                "music": 8,
                "agenda": 7,
                "item": 7,
                "liquor": 7,
                "parking": 7,
                "concern": 6
            },
            "fullTranscript": "This so we're waiting for chrome. Once we have forum, we will start the meeting. So please give us a couple of minutes. Yes, so it seems that we have forum now with us cindy joining in before we start organizing. You know if we have someone from the 33rd prison not at this time. I need to look for it all right. So we'll take a couple of minutes and then we will come back hello. Yes, we have officer brown from the 33rd prison, he's there over the phone, okay, very well. So having said that, I would like to start this meeting 632 with Quorum. My name is Isidro Melina sharing this meeting with forum and at this point before we start I would like for Interpreter Lilly to please introduce herself, and let me please share with us how we're going to do a translation. Please, oh hi! My name is lily hawkins, I'm an interpreter from indie translations. How many spanish speakers do you have, or you just pick up calls, and they ask you questions in spanish or how do you hold the meetings? No just a highlight in Spanish that if anyone needs assistance- or they do not understand something for them to try, raise their hands and send you a note, so you can trust me. Oh, that would be great. I can do that. Thank you. So if they have any questions, then I just raised my hand to address that question to you guys. So you have a certain time that you do it. No you once. If anyone has any questions they understand or they need translation, you raise your hand and if you do not see that I do not acknowledge you perhaps so feel free and interrupt okay. Thank you. The only person that will have that freedom. Okay, thank you. Thank you for your services. Lindy, oh you're, very welcome. At this point I would like to go around and introduce other members of our committees that are present for the members that are present. Please on me yourself and introduce yourself once again. My name is Cecilia Ramadin, I'm the chair of this committee, looking forward to hearing as to what new products going to come, I'm going to have in the neighborhood new restaurants, foreign launches. I've been doing this for some time, but I do have a strong committee that is fulfilled with highly skilled people that are committed to serving our community. Having said that, I do I guess I will start with you and then the rest will fall good evening, Gerard Dangle Assistant chair. Let me call out Cindy good evening. Cindy Matos is here: well, it's not in Ashley Ashley's. Not in. I know that Lee was in the house leo we'll come back to Leo. You need to meet yourself, we'll go back to Rosie hi. This is Rosie you're here, I'm sorry about that. I'm having camera issues, but I'm here, thank you Leo, and I see that we also have angel. Yes, I'm here. Thank you so much so taking into account that we have a current reality. We try to work with our merchants as closely as possible. We also recognize the fact that how we run this committee might not be perfect, but we are surely trying our best, and for that reason I know that with this technology that we have, I will soon things can happen every now and then, and we would like to prevent anyone who has been waiting for a long time and will not get the proper attention because of some glitches. On that note, we're going to make a roll call on a nightly basis when we meet to see who's in and who's out. That way, we would wait for someone that has registered and for some reason, when we call them they do not they're not present, for whatever technology glitches. That might be so. On that note, we will make a roll call to see who's saying who's out and we'll have we'll try to have some patrons to see that everyone gets the proper attention that I deserve. Having said that, I'm going to ask for girard to please do a roll call before we start and before we do introduction of our prison and, of course, any elected officials that might be in the house you're right sure good evening. So we'll go straight down the agenda for roll call item. One would be Flk Inc, Dba, Sushi Mambo. Are you present again roll call for Flk Dba Sushi Mambo located at 431 West 202Nd Street? Are you? Are you President? Thank you you're right before you go, and I see that Lily has the question of race. She raised her hand. Really. I have a question for you hold on with the answering questions. I do not have access. Only the hosts and the panels can see the questions. So I guess I have an answer. I would need your help on that yeah because I do not have access to that either. Okay, agonies I'm going to. I rely you and the staff. So please keep that in mind. Thank you. Lily go ahead. Europe. Thank you great. So again, item agenda. One is present item two is Villas Lounge two Corp Dba Villas Lounge two. Are you present? Yes, we are great all right. Next, on the agendas item three Dikeman billiards cafe: are you present dichmann billiards cafe it's 100 Dichman Street is a representative or ownership present item three okay, we'll come back next is item four on the agenda: it's cdb Kitchen and Bar Corp Dba room 4996. great. Thank you. Next on the agenda is item. Five Inwood Hospitality partners, llc Dba, Hudson, Crabb and Q- is ownership or representative President great welcome. Thank you item six crack and peel 126 Nagel Avenue. Are you President owner or Rep President great welcome here? Item seven Henshaw Inc Dba cloisters grill again, seven heads great welcome. Eight I'd have made is Buddha Corp 1654 at Saint, Nicholas Avenue against Buddha Corp? It's item present welcome item. Nine is Fuego Topico Restaurant Corp is ownership or a representative present again item apartment item; nine Fuego, Topico restaurant co-, op 3856, present; okay, we'll come back item 10 Mama, Taco, Llc, Dba, Mama, Taco, 5025, Broadway ownership or rep present President great welcome item 11 La Bas La Basse Sports Grill, Inc, Dba, El, Canuco, Restaurant 65 that was withdrawn, but that is withdrawn. Thank you all right item 12 on the agenda. Gender is elegant, Corp, Ellen, Elegant, Club Gorp great. Thank you all right item 13 coup, Raku New, York, Inc, Raccoon, New, York, Inc item 13 ownership or app Rep present one more time: item 13. Item, 13, Kuraku, New, York, Inc, 3952, Broadway, present, okay item 14, Jade, Sushi and Bar Inc 1506 present wonderful, welcome, and that concludes so just for everybody's edification. All are present except 14 has been withdrawn and 3 and 13 have not stated that they're present. Yet so, whenever you're ready so agenda, item 11 has withdrawn. You say: item 11 was withdrawn correct at this moment. I would like, for our president, are to please introduce themselves, starting with authoritarian presidents. Officer Brown hello good evening, it's officer brown from the third precinct. Can everyone hear me? Yes, we can? Okay, great, I'm sorry, I'm having a little trouble with the with the visual, so I just wanted to make sure the audio was working. We hear you loud and laughing to you perfect. Now we go to our 34th season. Excuse me: can I make a quick suggestion? Is it possible for the interpreter? I guess to let herself be known that she's here only because if there's only spanish- speaking people and they do not understand English, how would they know their translators if they're, not if we have not mentioned it in Spanish, we'll do that once we get up from, I mean 32:34, sorry, perfect! Thank you. Obviously, I know that you're on the line, but we can not hear you welcome back to Officer Matthew Martinucci from 34th prison lily. Can you please state that the audience will have rights for interpretation, please in spanish, very well! Thank you so much Lilly. I also wanted to thank the office, our staff evening, Sir, Paul and Chanel, for putting together these documents. Lisa. Thank you for delivering these documents to me is important, because I need to have things visually and it's much easier to do it in print than individual forms, because often times with so many screens, it's hard to follow everything up. So having said that, the way that we're going to function for the new applicants is that we would entertain the agenda as this. We will do one by one. Usually we will listen from the merchant the prison then from our residents. Once other committee has gathered, all these opinions will deliver on your application and we'll take a vote. Please understand that this vote is not final. You guys. I know that this will need a vote from the General Board as a whole and that vote takes place on the fourth Tuesday of every month and that'll be the final decision that the board will make on your application. Do I have before I proceed? Do we have any elected officials or representatives? And if so, please identify yourselves? I do not see any elected officials and on that note I would like to proceed with a meeting Mr Molina since I'm in the Q&A there's a cheryl miller that says that the establishment of West 165Th Street has been trying to call the name Maki Erenisa. Can we please upgrade already as a panelist? I see them as a panelist, so they are on board. They can introduce themselves once other turn has come. Thank you. So much are there any other questions very well you're on Let's. Do I proceed when it comes up? This is kind of a house keeping for the committee who's going to volunteer to do the minutes and the resolutions good evening, I'm so sorry this is Adrian Felton. I am with New York State Attorney General Latisha James's office hi. I know that a lot of you guys have an agenda. I just wanted to pop on really quickly to share our initiative that we have for all voters if you go to the polling sites and you're facing a challenge with your ballot or you're, facing a challenge that you're not on the list or if you feel any pressure that you're being prevented from voting, we actually do have the live assistance, so I did not see a chat room. So if you want me to put it in the Q&A, I can do that the link- and maybe you can share it with everyone, because it starts soon as early voting starts, which is October 24th to November 1st, and I guess you guys can share it and I'll also put my contact information there as well. Is that okay, yes, please, okay and then perhaps you'll be a kind enough to share the link with the rest of us yeah, I'm going to definitely put it in there in like a few seconds, him he's already online. The phone number answer in 380.. Oh then, he's yeah he's already online. Just send me a note that he needs to be taken off nuke officer matanuchi. Can we, I think, see if you can, you might want to mute me. Sorry, we're recognizing item 13 cool raku that it's miho, so we've got you as present Ku raku. Are you President? I believe. That's me mijo on you just to say, you're present Mijo Ku Raku. Are you present good evening? I believe Mijo. Are you practicing me? Yes, are you present? Yes, fantastic, we'll come to you shortly. Thank you welcome, but please at this point I recommend that we go to the next one. Okay, so we'll come back on once so Flk Inc, Dba, Sushi Mambo stand by we'll come back and circle back to item two is for restaurant wine item. Two is Vera lounge to Corp Dba Villa, Lounge 2, it's located at 130-, 132 avenue at the corner of West 172Nd. Street present. Yes, great! Welcome, yes hi, so we are here for renewal on our bm1 license very well for the record. What's your name, where's merrick spread she was supposed to be present, so I do not. I do not know. Are you the manager, I'm the representative officer Brown? This is with the Fergus 33rd precinct, we'll be the opinion of the 33rd prison hi good evening. It's officer, Brown Canal. Everyone hear me: okay, yes, okay, perfect, so I could take a look back. We'll start year- to- date, 2020 at Villas, Lounge we've had four three one calls. We had one in June, two in August and one last month in September for loud noise and music. Coming from the location. We also had an incident inside the location in February 2020. There was a misdemeanor assault that occurred. A woman was her, hair was pulled and she was inside the lounge and she was followed outside the lounge, where she was further assaulted. That happened on February this 2020.. If you want to look back, we could go to 2019. We had three 311 calls for the year. Those are also for loud music from the location. Oh, we had no criminal incidences in 2019 in 2018 to go back two years. We had eight three one calls for loud music, so the calls have definitely gone down from 2019 and 2020. We had eight calls back in 2018. We also had three criminal court summonses issued in 2018. We had a civil court summons issued for loud music in 2018, and we also had someone that was cut with glass on new year's eve from 2017 going into 2018 at that location very wrong. Are there any comments from our residents merrick? So you heard the comments here and, as I read back on the last resolution that the Community board passed, we objected for the renewal of this license for issues going back to 2017. from noise complaints until 4:4 am loud, music people throwing battles one another on one January, 2nd 2018. wrestling complaining about live music in April 2018. and then the new violations. You also have some the prominent health violations. Six violations, evidence of mice flies. The hound West facility was inadequate. You receive a c on your last health inspection. What do you have to tell us? Well, I'm not I'm not aware of the Department of Health Inspection report, but I know that they have been they've been very proactive if it comes to the noise, no noise and an overall how they carry themselves. You know there is an ongoing issue of just people congregating on that block, and I visited them myself a number of times in the past, and you know they have this. They have this 24-hour little grocery next door, where you know, residents just set up camp right in front of it right next door to the Villas lounge and play dominoes and drink beer openly and basically play their own music, pretty much 24:7 any day of the week. So that's something that is just going completely out of out of the their control. I myself been there many times, and this is what I've observed. I have pictures videos, you know it's something that they can't control and they've been they've, been they've been received the receipt summons because of that establishment next door. I know I I've been there. You know late night, you know I do not think the music is loud. I mean right now throughout the pandemic they they're allowed to set up camp. You know I mean set up tables outside so they do have music outside, but I do not think it's loud again. It's just that some, the residents on the on the block. They create a lot of a lot of commotion, a lot of a lot of issues very well. The problem that I see here is that there's a pattern of a lot of music going back to 2017, so I can understand that perhaps one or a couple of times you might have gone in and the La the music was not loud, but we have a part of live music on this premise. Very concerning thank you. So much do I have any comments from our committee members seen that I recommend that I'll go to a vote. There are no issues. Committee members agree: let's go to a vote I'll give our piece yeah. So again, this is for agenda item two Isidro. How do you vote? No? Okay, gerard! I vote no cindy. I vote yes angel Vasquez. I vote yes, okay, Leo Jimenez! I won't know okay, Rosie! Sorry, I was having difficulties I vote no did I did I leave anybody else out on the committee. Is anybody else that I did not call president? I could take your vote on the committee. Okay, so that's George Gerard, sorry about that. This is angel. We, you said you are number two correct. I'm sorry, I was a little lost. No worries, no worries. So it's item two, and just so you know it's. This is for restaurant wine. It's Villa lounge to court, Dv8 Villa lounge two. So if you want to keep your vote, you voted yes or if you want to change it, it's your prerogative item two got it I'll, keep it okay! So with that said, if I did not leave anybody on the committee out, that's present that this is one two three four nos two yeses. This motion does this does not pass so four nodes and two yeses. Well, the record. Please give me those yes and no, please, oh well, no is Isidro. Gerard, Leo and Rosie and yeses are cindy and angel very well. Thank you! So much you are so my vote of 240. This application fails Mr Marek. I recommend that you have a chat with management there and try to address the live music issue. Besides the pardon. I understand that might not be your fault, the crowd that is outside, but, as you hold your license, you are accountable for your frontage work with your neighbors and see how we can alleviate this problem. Okay, all right! Thank you. Thank you. So much you're right sure next is, if item one, do we wanna step back to one? Is Flk Inc, Dba, Sushi Mambo here otherwise we'll go forward. We got to check back. Yes, we are okay, so we go with them. Yes, so we're stepping back to item one. This is Flk Inc, it's Dba, Sushi Mambo, located at 431, West, 202Nd Street, it's between 9th and 10th Avenue. Welcome very well. This is a renewal. It's within the purview, 34Th Precinct officer Matunuchi. Thank you for coming back and we have a representative from Sushi Mambo. Oh yes for the record right, yes, Sir, Miguel Acosta here representing Sushi Mambo. Thank you officer. This is within your jurisdiction. Can you please tell us your opinion? I think we're still having problems, so we may have to go to the next one. Okay, why do not we do that? So I'm sorry we're going to a circle back to you once we get a clear communication of 34. If you do not mind yes, can you guys hear me now? Okay, oh there, you go it's officer martinucci. Can you guys hear me? Yes? Yes, we can all right. Sorry about that everybody. Can you please tell us our opinion. 34 precede swastika number, one! Please sure we we have zero issues with Sushi mambo they've they've been very good since they've been open. Thank you so much officer matinuchi. Before I proceed to the residents Miguel, I see that the license is about to expire. Have you received the new certificate? Not yet it was recently mailed out. The 30 days of notification has just expired last week, so we mailed it out last week. They should be renewed by the end of the month. Very well. Are there any questions from residents? I see that there is a question from Nancy Preston Nancy, please all right, hi Nancy Preston moving forward and I just want to say it's wonderful to hear. There are no problems with this operator and we need to acknowledge that when that comes because we always hear about the problems, that's all I have to say. Thank you nancy. On that note, and for the purpose of moving forward with agenda, I recommend that I go to a straight vote, a second okay, so for item for item one we're going to vote is seizure. How do you vote? Yes? I vote yes, cindy, yes, angel, yes, Leo, yes, Rosie, yes, okay, this unanimously passes it is six. Yes, congratulations! Thank you very well! Thank you. So much miguel, please thank you for folks at our Sushi member that you know we are very proud of the work that they're putting out and obviously how they're handling their business. The fact that we do not have any issues so from the 34 prism and all the residents speaks volumes. So thank you so much you're right. So next on the agenda again still under restaurant wine is item three, it's dichmann billiards cafe. They did not say they were present earlier. Are you present dikeman billiards cafe? This is for a renewal, so it's either they're not present. I guess do you want to vote or you want to wait to the end or wow. That's a good question: were they here it's a renewal, so we could vote well. Let's? What do you think if we hear the opinion of the 34th reason? If there are issues we could come back if there are no issues, we can move forward and you know so officer. This is with the private 34th prison. The idea is to renew this liquor license russian wine. What's the opinion of 34 prison, so on March 19, a summons was issued there for violation of the mayor's executive order that was placed in effect on March 16th. I was there with lieutenant contreras people were inside. That was at the time where nobody was allowed inside at all, people were playing billiards. You can see them through the glass. On the second floor, the manager at the time Pablo Jimenez. He was under the assumption. This is what he stated to us. He stated that he thought that he could not have more than 50 patrons inside at one time, which was clearly not the case at all, especially when the coronavirus was first kind of came into effect within New York City, so that was in March and then most recently in on October 1st, the SLA and the NYPD vice they conducted inspection at the location, and they found that they were also again in violation of the mayor's executive order. People were inside of the location, drinking playing billiards playing dominoes, but there were no. There was no food served at the time, so they were also cited there wow. So this happened on October 1st. They were in violation of the major secretary of order where there was no drinking or playing domino and shooting pool, and all of that was taking place right. Yes, so yes, yeah guys and prior to that was March when March 19th all right. So the executive order came down on March 16th, which ceased all inside dining at restaurants. So three days after that executive order, that's what we found them with patrons inside the location. Very well like how many patrons were there on March 19th. They were like seven or eight, but you know I know it does not sound like it's a lot of people, but they were told there was no indoor dining at all and it was seven. It was seven or eight too many, of course, of course, no doubt so. You're right for the sake of of giving people a fair chance, an opportunity to come and have their opinion be heard and, obviously to themselves. What do you think and I'm asking also this at the rest of the committee as well, if we leave this agenda item until right after five, we come back to this because after five we're going to go into all new licenses and that way we'll finish up with the renews, so we can we can go up until five, we'll ask again to see if they're here, if they're, not here, we're going to vote on the matter sounds reasonable. Three. What's the name of this establishment, eichmann, billiards and billiards? Okay, thank you very much. Fine with that. I agree with it great so we'll come back to this and let's proceed with agenda item number four right. Sure item number four: this is under item c, which is state Liquor, Authority method of operation change. This is to change Monday closing hours to 4 pm to 1 am, and this is 4c the kitchen and bar Corp. It's Dba room 4966, it's located at 4966 broadway, it's at the corner of West 212Th Street, and they want to change their method of operation on Monday's, closed closing hours from 4 P.M to 1. Okay can A.M get on board. The representative from agenda item number four, please: how are you doing to sign Miguel Acosta once again representing Susana manon who's on the call with us here in the meeting she's, the president and operator of Cbb Kitchen and Bar Corp doing business as room 4996, so we did submit when we applied for this license. We indicated that we were going to have the same operations that the previous owner had in that location in which he closed on mondays, so the license was approved under those conditions. Now my client is seeing that on mondays will be a good day for her to open and also offer her food and beverages, especially down with the pandemic, being able to do the indoor, dining or partially, with the 25, and also pickup and deliveries. Now. My question is this as well: we submitted for the request of this day only my client wants to know because she's considering opening up for lunch, opening at 11 A.M- and I was wondering to see if we can discuss that in this meeting- or we would have to know- submit another notification to go in next month and discuss being her being able to open at 11 A.M, or we could discuss this and be part of this resolution. Since this is a discussion about changing the method operations which you will be to add, opening up the place on mondays, and we have opening up months like to consider all the hours. I think we can take that into consideration if they are not interested. It's just opening hours right now, closing hours will remain the same and as for Monday, basically it'll be the same hours for Tuesday, which is from 11 A.M to 1 A.M, which now, which now is only allowed till midnight. I would entertain a discussion with committee members once we hear the opinion authority for prison and also from our residents, but I'd like to hear first of all, 34 percent. Thank you man. So the opinion of the precinct, this location has had zero three one and zero. Nine one calls over the last two years, 2019 and 2020, so we encourage them to buy to continue their events. Thank you so much officer Montenegro. Do I have any comments from our residents. If not, I will go into a discussion with within the committee movies. I see none, so the idea here is to expand the hour of operations, also to include mondays, which will be from 4 pm to 1 am and also miguel. You would like to add hours for lunch as well. I understand I understand that, because business is kind of tight right now, this is serious but pandemic. Of course, I think definitely we're trying to take advantage of you know. The other deliveries right now is very key factor to the revenues and restaurants hours. Are you referring and specifically, which days basically Monday through Friday, to be able to offer lunch? You know opening up at 11. to three and then they'll close and fix everything up for dinner, which starts at four, so it is to open up to the place at eleven o'clock in the morning. Yes, correct for brisket sandwich no sides, I'm sorry who's that if you guys please meet yourselves if your turn is not up. I would appreciate that. So the idea of committee members is to open the place up by 11 o'clock in the morning, so they can serve lunch and also to what mondays on the schedule. So I think I'm open for that committee. Members yeah sure I have a question. Oh my god, you just you mentioned Monday through Friday for lunch, so not Saturday and Sunday. Well, no! Well, you know we're trying to get the business class. That's you know getting lunch during the week. You know on the weekends they're offering brunch at the time, so they already have a time frame that reasonable for themselves, because Monitor Friday's for lunch, you get right yeah. I have Susan she's there, so Susan. Is that exactly what you're? Looking for? Oh? Okay, hi? Yes, actually I want it to open at 11 Monday through Friday and 12 o'clock yeah. We wanted sundays yeah and saturdays and sundays, because our liquor license does not permit to serve any alcohol or beer pm so you're looking to do 11 Monday through Friday Saturday and Sunday at 12., yeah. Okay, I will have no problem with this committee members. Can I please hear your opinion, probably, if not, I think I would recommend that we're going to vote. Okay, so we'll go to a vote, and this is again for item this is again for item four right. This is seated in the kitchen, all right so cathedral. How do you vote for item four? Yes, I vote yes, cindy, yes, angel, yes, Leo, yes and rosie. Yes, this applicant passes unanimously. Congratulations! Thank you, guys, miguel once again very proud of the work that this merchant has been conducting for some years. I know that things kind of tight and I hope that in the process of not of trying to get too sophisticated and make things you know not work, please stay real. I know it's kind of difficult all right. This is a reputation that it's outstanding and I know that a sting becomes more complicated and really tight. People might have an idea about doing things that are not proper, so please keep them in line. Thank you so much understood. Thank you. All right. Next on the agenda is under item d on the Agenda State Liquor Authority alteration license, and this is going to be to convert one of its service bars to a full bar. This is for applicant number five. It's Inwood Hospitality partners, llc Dba, Hudson crab and Q they're, located at 348, Dieckmann Mariner, and it's to convert one of its service bars to a full bar. It's applicant number five! Welcome! Hey! You have a representative from agenda item number five, please, and if so, please identify yourselves Jim Goldman. I'm here on video good evening Jim, how are you? Okay, Jim? You are the honor. I am very well officer matinuchi. This is when the jurisdiction on the 34 prison. What is the opinion on the matter about converting one of our services into a full ball? Can you please give his opinion? We have no reason to object that in any way, listen everybody knows the down at the Marina people pack it up. They play music. We do our best to enforce it, but that is not Mr Goldman's fault at all. We do get three on one calls there we do get 911 calls there again. It is not. None of these calls are directly rated up related to the location and Mr Goldman. Every time something happens, he is in contact with me and the precinct. So I want him to continue to reach out to us. Keep in touch keep our relationship, but yeah. We just we're going to continue to do the best that we can with the 3- 1- 1 and 9- 1- 1 calls down at the dead end to help his business, but again he's given us. No no reason to to object. Thank you so much officer matinuchi. I know that because of our previous experiences with the establishment, we need to be very careful, so we how we move forward, however, taking into account that Jim Coleman has done an outstanding job in keeping that place as a restaurant and not as what the community was forced to witness. So many federal accidents and issues there, I'm very happy Jim, they're doing an understanding job. Thank you, but on that note, I'd like to hear some comments from the residents. If there are any from residents, I see two hands. Let me just recognize: First Lis Ritter. Thank you. So much liz before you start for bringing some recommendations to our committee, we're taking that into account we're trying to be smooth as possible and trying to understand that a lot of difficulties are not only technical but also on how businesses are surviving. So your recommendation to have a raw call has been taken into account. Thank you so much liz and you have a vlog. Thank you. Can you hear me? Yes, we can okay. I just want to say that I am a community resident. I live a few hundred yards from this particular applicant and I just want to echo what the representative from the 34th precinct says, which is that this applicant has been an outstanding operator. He's been really good working with the community, unlike the previous operator, at that location and the one at that location prior to that he runs a really clean business. There are not noise issues, there are not underage alcohol service issues, there are not drug consumption issues, and this feels like a totally reasonable request. That's going to help him continue to operate his business in a way, that's economically beneficial to him, and I hope that you approve this application. Thank you so much liz for your comment, also a community board member. Thank you so much for your comments. I would like to hear now a word from Nancy Preston, yes, hi, thank you, and I want to just reiterate what you've said: what officer Matt Chanucci? What Liz ritter has said and thank Jim Goldman for living up to his promises of what he was going to bring us at this concession. That was very troubled in the past, and it's great to see this. You know an operator have a business in this way. That's really become an asset for the community. So thank you very much. We know there are problems in that area, but it's not. Those are not of his doing at all. Thank you. Thank you. So much nancy for your comments. They will be part of the minutes as well. Any word Jim. I Wanna. I Wanna. I Wanna thank the people for those kind words, and I actually just put everyone further at ease to expand on what we're doing here and why we're doing it the outdoor upper deck. You know, assuming cover to stable at some point we're making an application for the license there so that we can actually serve the community. You may have actually seen the community release we're trying to do some free weddings for people who are inconvenienced by Covid-19 and a full bar is going to make that catering area come alive. That's why we're doing it. Thank you so much on that note. I see okay, no more hands. I would like to move now into our community discussions committee members. Any questions, please feel free to say, seeing none I will move. I will go to a straight vote. Gerard please! Yes, certainly so! This again is, for I item number five on the agenda. It's to convert one of its service boys to full, bore the siezer. How do you vote? Yes, I vote yes, cindy, yes, angel, yes, Leo, yes and Rosie! Yes, okay, great Gerard, I'm on the car as well these. How are you weldies? Give me one Sec? Oh, yes, give me one moment while it is one second, so this is fine! You vote yes, okay, so this application passes unanimously with seven yeses. Congratulations. I really appreciate the vote. Thank you and we'll continue to serve the community all right. Thank you. So much all right! Next on the agenda, I mean is item one here: Flk Dba, Sushi, Mambo, okay, we're going to come back to that all right, so we're going next door. We are. We got to go back to agenda number three right, dyckman billiards! We could do dietman billiards! Sorry, pardon me yeah, stipend billiards. What do you would not vote on that matter to give the opportunity to see if they had a right, so we're ready to vote on that? Yes, do we have any representative from black member before we vote? I would like to hear the prison one more time so that I record some information for the minutes of Matanochi. Are you on the line? Yes, I am just to reiterate what I said about this location before on March 19th, three days after the mayor's executive order was issued, which was on March 16th, there were seven eight patrons inside there were supposed to be no patrons inside and they were playing. They were playing billiards and again. The manager at the time stated to us that he thought that the mayor's executive order stated that he could not have more than 50 patrons inside, which was not the case at all. It was no patrons inside again that was March 19th three days after the initial executive order, then on October, 1st, the soa and the NYPD did a inspection at the location and found that they were in violation of the mayor's executive order. Again, people were inside, they were not eating food, but they were drinking and playing billiards and dominoes. They were cited at that time very well. This is a very dangerous, an unfair situation where people or businesses were taking advantage of regulation when pleased to prevent other barriers from going to infect our community and yet this merchant. We can understand that perhaps there was something within a 10 at the beginning, which would be very hard not to see what was going on on March 19th three days after everyone had closed, meaning that all the business were closed and this business decided to stay open, and on top of that on October 1st, there was not further violation. On that note, I will go to. I recommend that I go to straight vote. I actually have a comment. You see them. Yes, what's your comment? A lot of those early violations and and suspensions were acknowledged by the liquor authority that they did not know at that time. All the rules and the regulations were vague, but now, if something happens, going forward going like September October forward, they've already know they already know what the penalties and fines are. What officer Martinucci failed to notice was mentioned was that they were fined heavily 25 and 30 000, sometimes 40. Thousands, in addition to being summary, summarily suspended. I do not think that it is for us to be deciding on those violations that it's to this day, or we have issues with them. Even with the 25 percent, I do not think it's fair to judge the business based on those early days, three days after the via those, because even I did not understand the rules, so I do not think it's fair. I think we should wear on the conduct of the owner as a licensee in the premises whether they're troubling their neighbors. This is a community board, whether we're bothering the community troubling them these carpet violations. This is just in my opinion. This is just good time. Thank you. Well, this was a straight down shakedown by the liquor Authority and we all understand it, but I think thank you. Aurelia you've been muted. Your time is up. I understand what you're saying I received the regulations prior to, and I can understand that there could have been problems in people, not understanding the regulations. There were changes to the regulations, but for a business to decide to open when everybody else was closed, not acceptable for a business to come back on October, 1st and open when they were supposed to be open, not acceptable. That's my take on that. You know that matter. Please give out if you do not mind yes, issues. I recommend that we go to school agreed. So this is for item three on the agenda: Zachman, billiards cafes. How do you vote? No? I vote no cindy, no angel, no Leo, no rosie. I vote no! Thank you, voiles! No! Okay! So this pass. Pardon me this fails unanimously. All knows zero to seven to zero. This application fails. It fails. Next on the agenda is under item e. It's the state liquor Authority for new licenses. So this is the new license section put on the agenda and this is for item number, six crack and peel located at 126, Nagel Avenue, it's at the corner of arden street crack and peel welcome hi. This is Sandra Jimmy, representing Crack and peel cassandra. So please see if you can not fix that. Please I'm sorry! It's like a nickel. Can you hear me now? I can't hear you but this neck. I do not know why I mean. Can you hear me better there guys? Can you hear that? Well, yes, no! Yes, we can hear you probably me so not a problem for the purpose of the Minister. Please identify yourself. My name is Andrew Jimenez, I'm representing crack and field at 126, Nagel, New York. This is going to be a seafood restaurant. Let me see the restaurant is not going to be opening late. It's going to be opening from 2 to 10.. We will not be having any live music or djs. This restaurant is going to be servicing seafood, potassicerian individuals and it's going to be focused only on seafood and signature, sauces, painting, events, it's going to be a family oriented restaurant very well. Thank you so much sandra. Based on what I hear. What I see here, there is a complete application, which includes a complete questionnaire. The floor plans are here and domain is also attached. So let me ask you a son that is, this is not a new place or you should start a new place. It was a grocery before a grocery store, it's being designed right now. It has not opened its own. It's not going to have any promoters, no dancing! Nothing like that. It's going to be eating and painting events, the restrooms. Are there fully accessible? Yes, they are two restaurants in the back. They are full. They are weird wheelchair proof. I think too also so the capacity here is 40. It's 40. yeah, four employees there'll be four tables and about 30 chairs six are schools. I just you have indicated there'll be no dj. No jukebox hours of operations will be on mondays through thursdays, from 2 P.M to 10 p.m, and then mostly one second, then our Friday is from 2 pm to a 12th midnight second same as Saturday as well, and then going back to a sunday from 2 P.M till 10 P.M. This is with the preview 34 prison of the methodology. So the only concerns that we have as a precinct- and this is not picking on this location- and I do not want to continue to sound like a broken record but 25 occupancy, including staff until the law changes. We are. We expect strict compliance on that again and just I know you said, there's not going to be a dj or promoters or anything. It looks like you checked off. Only recorded music, you know the location you're directly under a residential building, we're just concerned for the residents, and we just hope that you know you can sound proof in some way just make sure that if you're approved the residents are not disrupted in any way and please 25 occupancy inside it includes staff until otherwise changed. Okay, thank you very much. Yes, the residents have been notified and they are aware and excited for the store to open just a correction guys. It is not 25, it's 25, not including staff, and I have that recorded by SBS and the commissioner so officer Martin Nucci. I think we need to meet and connect that we have a forum here and and she'd be introduced or introduced. Herself people are not supposed to jump. People are not supposed to jump in, especially please. Please raise your hands and see that you have your hand raised, but please do not interrupt until you're recognized point well taken, though aurelia. My understanding is that the 25 percent does include the staff, but you know it's something that we can check later on right, so office mate. The concern is that you know, as we move forward with inside dining, that you know is being placed correct. Yes, correct, very well. Do I have any comments from our residents? I do not see any. Actually I see nancy. Is that a previously or you still do you have a question and also list reader? Is this like something that new or yeah no yeah no[ _ _] drop? My question was just: is this a 500 foot because I know there are a number of places in that area. This is the 500 feet of food hearing that we have to go through SLA. Thank you alice. I think yeah. Can you hear me? Yes, we can. Will this restaurant be offering takeout we're going to start offering takeoff with fantastic birthday right very well. Seen no other questions now I would move to. I really you have something else so and if so, please you have one minute. Is it one minute we'll go one minute I just wanted to say it sounds like a great restaurant. I and I look forward to patronizing very well. Thank you so much eric on that note. Are there any comments from our committee members yeah? I have one easy Joe: will there be outdoor seating? I'm sorry. Will there be outdoor seating? Yes, there will be outdoor speeding, probably not sure. Thank you so much committee members. Do you use it for any stipulations? I see none. On that note, I recommend that I go to straight vote. I'm sorry, it's Leo again. I do recommend stiffs based on Nypd's recommendation. I know they said they won't have live dj or jukebox, but if they're going to play some type of music coming from an ipod or a phone, maybe they should have some soundproofing. I know it's in the is in a residential building at the bottom. You know just to be courteous to our neighbors, so I do recommend a step, some type of sound proofing. Yes, there is lots of insulation since it was a grocery store, and now it was converted into a restaurant. Everything was remodeled inside and there should be all documented as privacy of all all the pyramids that they have. They have thank you for the sake of keeping our residents saying and perhaps from preventing the community from getting issues, I'm going to recommend that you do buy a sound limiter. We have any objection on that Sandra Sound limited. You said yes all right, so the idea will be for you to purchase a sound limiter and for that receipt, so you can buy online right and I see has to be submitted to the office, the Friday prior to the general report meeting, which will be that on the 23rd that receipt has to be received at the community report before five o'clock in the afternoon. Okay, I have a good question. They might even have it before I open up the question, but I want to make sure that we understand that, so the idea is to for you to purchase that online add a copy to the Community Board office copy of it and the idea is for that receipt to be in the office. I would check that on Monday and if we do not have a receipt from you sandra. Unfortunately, I will have to ask for the Community Board to vote against this resolution. No, that's fine! You will have it very well. Thank you! So much so, let's just put the sound limiter and as a stipulation, I see that there was someone had a question. Can you please was it you rosie? Yes, it was me. So my question is: what kind of sound system do you guys have? What kind of what kind of sound system do you guys have? Well we're going to be Repo using recorded music? So we do not. Even they have not even bought the sound system. Yet it's not going to be something. It's only background music. That's going to be! No! No speakers, no big speakers or nothing like that. Thank you. Mm- Hmm, Leo, the instructions yes for the art and the painting and all that, so we really so I requested for a sound limit to be purchased. Do you think that would be a good idea? Yeah? I think that should help. I second that very well very well so with one step in place that would be to purchase a sound limiter and to submit a copy of purchase to a community board before Friday the 23rd all by Friday 23rd before five o'clock in the afternoon. I would recommend the world to stray Board. You're right, you are muted, apologies, so agree so item. Six. We're going to vote on is seizure. How do you vote? Yes, Yo Mute Gerard apologies! So Isidro votes. Yes, I vote yes, cindy, yes, angel, yes, Leo, yes, Rosie, yes, and while these all these yeah, yes great, so this application passes unanimously by seven yeses. Thank you very much. Congratulations sandra. We hope that you do well, and I hope that, as you open up your place, that you also hire people from the community as a best practice and again, we hope that you do prosper. Thank you very much good night, all right good night next, on the agenda again under on- premise, liquor license for new is item seven, and this is for seven Henshaw Inc Dba cloisters grill, located at seven henshaw street. It's between Riverside drive and Daiquiri Street again. This is for seven Henshaw Inc Dba cloisters grill, located at seven henshaw street. Are you present? Yes, Miguel Acosta on behalf of Giselle reyes who's, the owner, the premise before we start Gerard and Isidro this just something I wanted to correct on the hours of operation seems like my assistant over put the wrong hours on here. So business opens from 7 A.M to 7:30 P.M Monday through saturdays, okay, so 7:30 a.m, through what no 7 A.M to 7:30 p.m. Okay, and on Sunday, 8 A.M to 7:30, P.M and for method of operation is just Ipod, Background recorded music. All right. So let me just review the hours of operations. Sundays from 8 am to 7:30 P.M 11 A.M, to 7:30 Sunday, 11 A.M, to 7:30 right, correct on sundays, and then the rest of the days are seven to 7. 30. 7, to 7:30, correct and for method of operation is just Ipod and recorded me, which is recording music. That's it no entertainment all right. So just let me go with specifics. The capacity is 40.. You will have four employees on place in place. Okay, no jukebox. Now it's dj no karaoke very well. I see that you have a floor plan. You have a menu, it's a completed application. This is where the preview of the 34 prison of the Matinouchin we do not. We do not have any issues with this place. I mean those hours do not sound like they should be an issue. We do have four three one calls for noise on that block in September and October. So I do not know if there's any residents in here that made those calls, but there are residents who are nervous about potential noise and prior noise, but that's all that's all we have to say about it all right, so there was so much three on one calls from noise from around the block right, four, specifically for for the location in September and October yeah, just to point out that there are residents who hear noise at a loud volume just want the people to know. Okay, I see that Liz reuter might have a comment. Yes, hi. Thank you for taking my comments. I live at 1793, Riverside drive and my apartment overlooks the applicant's location. My bedroom and my office I'm on the second floor, and so if I were so inclined to throw an egg out my window at the location, which I would never do, tempting though it has been, I would absolutely hit somebody sitting there. That is how close I live there. So I do not actually want to say that I oppose a liquor license. I do want to say that I have serious misgivings about it. I get that these are really that it's hard running a business, it's hard running, a business that size and it's really hard running a restaurant in these times. So I respect and appreciate that you know you kind of need a liquor license to make this happen, but I have real misgivings because there was no posting of this meeting around the location. So residents were not aware that this application was being made. There is not a lot of attention paid to responsibility for people double parking when they're picking, stuff up or dropping stuff off, there's a lot of double parking on this block that is related to that business. I will say that, although I was surprised to learn that the closing hours are 7:30, because there have been many times when it has been open later than that, it's not usually terribly late, but it's off there. I there have been particularly on weekends times. When it's been open until nine ten o'clock there was a mariachi band there over the I think, last weekend or last Friday. I forget what day it was. It was somebody's birthday. There was a Mariachi fan for like an hour and a half when parents are sitting at the restaurant outside having a nice meal and their kids are bored, the kids run up and down the street screaming and yelling like it's a playground, I get it. Children need to play, but you know not running up and down the street screaming at the top of their lungs on a quiet residential street. I could go on, but I I got a real problem supporting supporting this request. I will also say that I personally have witnessed people consuming alcohol on the premises. Not I can't I do not think it's alcohol that's been served by the premises. I think it's people who have brought their own wine or beer but byo is illegal in this state and I think that a restaurant that's applying for a liquor license should have said to their clients. Hey it's illegal for you to consume that here. This could jeopardize our license application. So anyway, I could go on, but I'll shut up. Thank you. Thank you. Liz. Now I before we move on, I would like to recognize Alana who has been waiting online. Okay, she lowered her hand. So now I recognized nasty questions. Hi. Oh sorry, I just was not unmuted before okay, sorry lana, please yeah! That's! Okay! Thanks for hearing me, I guess I'm just reiterating a lot of what Liz said. I live in her same building, 1793 Riverside drive. My window overlooks this restaurant and while I do not have specific issues with this restaurant, so I do not want to take away their chance to try having a liquor license. This street is so loud. People park on this street with their stereos turned all the way up when they get back into their cars after partying on dykman. The music is insane, so I'm nervous about bringing the party even closer to the home and having alcohol on henshaw yeah. I'm also surprised to hear that their closing hours are 7:30, because I know that they recently put a screen outside, so people are watching sports in on, like the outdoor patio seating, and it's definitely still going when I'm asleep, and I never go to bed at 7 30.. So I do not know I want to say like I guess everybody deserves a chance, but I'm also super skeptical very well noted. I would like to recognize now Nancy, yes, hi, thank you, and this is conveying this for Ted gallagher, who is a resident of the same building, and also you know a community member for over 38 years, who actually has a worked for 17 years as a senior city planning at HPD. You know so he has some background in this, and you know he opposes this because he says henshaw street is effectively a service road for the henry Hudson parkway drivers use it to avoid the bridge toll, even without a proposed liquor, license noise and traffic congestion. Today is a grave nuisance. It's a choke point into the neighborhood. Any additional traffic in this area will only degrade quality of life for existing residents. He also says it will also add to the already harrowing noise and traffic problem, and he talks about a number of years ago when there was a proposal to put a school here. The community came out. For these same reasons, the community came out that this is a traffic issue. It's a really big problem, and is you know, and he's very much opposed to this? So that's relating that for him. Thank you very much. Ed gallagher is his name and I believe he sent in a comment a page to this and he to Ebenezer and was told that it would be shared with the committee. So, okay, it got shared just fyi great. Thank you so much what's the first name again: ted Gallagher. Thank you so much. I do not have any other comments. Now I see from our panelist aurelia. You have a flaw hi everybody. I just want to also have be mindful that I think that location has been there for a while, but cloisters is in between three parking lots through no fault of their own, and I think that with earlier closing hours, if they sticked to them, I think that, and maybe here reiterating the importance of early closing hours and making sure. I think that when you have an applicant that closes at 7:30 and is saying they're going to stick to it there, then maybe an opportunity should be given, because I do not think there's going to be much disturbance thereafter, but I do not live in the building but and I can commiserate, but I think that you know I think they've been a good neighbor as far as I know, but and some of the those issues are not of their making. So I just I hesitate to see that a license gets. You know, maybe not approved because of those reasons. So I do not know. I asked and Ko. This is a very tough time for restaurant owners and if they go out of business, what's going to take their place is crime. Thank you so much aurelia point as well noted. I see that the operators are Jisa, Regis Miguel. Yes, the celebration is the operator. So actually my client presented themselves at the community board back in November because they purchased they purchased the establishment. What what exactly they have handling alcohol? Well, they actually have and we're operating until September 30th of restaurant wine license. So this application has been submitted already for the board. A temporary license has been issued for a restaurant wine license until the license for on- premise. Full liquor gets approved, so basically they are in compliance there. I understand 100, there's no byob in New York City, which is illegal, but they do operate under a restaurant wine license at the moment. So, basically, right now, in order for them to be able to serve alcohol, they would have to wait for the entire process, which would take up to six months in order for them to get the idea- and you know it's not only one resident that brought up the concern that this establishment is beyond seven, and you know, the concern is that you know, given the opportunity to have a last follicle license that this, our behavior will continue and it's concerned. Yes, I understand the concerns and, like Liz, addressed she's being a little bit specific about certain days about having my reaction. As you may know, you know hispanics we own a business. You know somebody's birthday party in the family. You may extend your hours a little bit more. You know and hoping that it does not extend to two o'clock in the morning or past midnight. You know, or you know, past 11 o'clock. You know on Cern one day you know- and I understand, there's some concerns with kids running around up and down the neighborhood. You know on the block- and this has been I've been. You know in the neighborhood for my entire life for over 40 years, and I know that area is very quiet over there. I have a couple of clients that live in the area right there 1795 as well 1793, so I understand their concern. I will address this to the operator to let her know that whatever she's doing past 7:30 needs to stop. And aside from that you know, my main concern is more with regards to music, and I understand the tenant's concern is any type of noise, but sometimes especially right now we have 25 indoor dining some days, especially this past couple of weeks, we've had great weather where we can entertain patrons outdoor. You know as allowed by the city. So I understand this has made a very drastic change in comparison to the last five years where this business has had a license and has been good operators and there have not been any complaints. You know right now, it's a very difficult. You know time for business owners to comply with every single rule and regulation when it comes to noise, because if you have a pickup, you have patrons that. May come in their vehicle, they said and lana that they come and pick up their. You know, and these are things that you as an operator got to come out. Your restaurant kindly ask these patrons to you know: lower their music, and sometimes it may be. You know putting you at risk as a business owner, because you do not know the patrons behavior, but I'll definitely address all these concerns. Tomorrow morning with Miss Reyes, you know right now, she's operating her business and was unable to attend the meeting, but I would definitely address every single concern that may have maybe liz Lana Mr gallagher could probably meet with Miss Reyes to discuss the concerns as well. I could probably set that meeting up. You know because thank you and I'm sure that they will I'm sure that I'll greatly appreciate- and I think and thank you for letting me know that these things are occurring because you know as a consultant. I always like my businesses. You know to operate the correct way. Thank you so taking into account that there are some concerns from residents, even though this business promised promises to close. Very early, it is something that you know closing at 7:30 at night. You know somehow around this community, but taking into account the residents that are very concerned about noise, double parking issue and opening late, I'm going to recommend some stipulations sure my steps will be a sign that will be no bubble. Part, no notable parking sign to be visible and display in front of the premise. A good naval sign: okay, a phone number where they are. If there are any issues for someone to be contacted directly and for a sound limiter to be installed and, as you know, Miguel to send us a copy, approve a purchase out to the Community Board before Friday the 23rd before five o'clock, perfect committee members, do we have anything else that would like to add? Let's go very well on that note at G right. I think we should go to straight vote if there are no objections. Sure so again, this is for item number: seven Henshaw Inc, Dba courses, grill essedra. How do you vote? Yes? I vote. Yes, Cindy angel, yes, Leo! Yes, Rosie! Yes, Valdez! Yes, okay! Congratulations! This passes unanimously with seven, yes, votes. Congratulations! Thank you! Thank you! All right, seven votes, seven and seven, hopefully there'll be a number that'll bring you lots of luck. Let's move to the next! Thank you. Okay. Next, on the agenda again, this is on under new licenses on premise: item 8 Buddha, Corp, 1654, Saint, Nicholas Avenue is between 192Nd and 193Rd. Street again, this is for budaport. Are you present? Yes for the purpose of the menace? Who is representing this agent item? Aurelia tavares yeah. Give me one second well, I'm here, John Garzon is the attorney on it, I'm just covering the community board for him, which I've done before on this section's application. Just give me one second very well, I do have the floor plan. There is a menu and the questionnaire has completely been filled. What is the nature of this restaurant? What kind of food are we bringing to the table? This is latin. This is latin infusion and sushi, but also I just want to note. This is a re- notification to the community board, our prior notification, the liquor authority's requesting it was approved that we re- notify you because our notification is they only last a year and it expired. You know we Covid-19 and everything and they want to make sure that the stipulations with the community board are still the stipulations with the community board. Those tips that we had previously, I attached them for your review and consideration to the packet. I do not see them here. I sent them to the Community board. I'm sorry they're here apologies, so they include some meat proof of purchase for sound limiter right. Yes, it's attached to the packet. Sorry, my luggage went out: oh yeah, oh, it's dancing so purchase of a sound limiter that you would operate on specific hours. Those are the two steps, but we can we can check into them later on and are you on the line Sir? Yes, I am, can somebody just say what the occupancy is of the location? Yes, so you start going over that, so the capacity is 130. There will be 12 tables and 64 chairs with a 10 parse tools. Let me go through other method operations, so the idea is to have this place: open mondays through wednesdays, from 4 P.M to 1 A.M, then thursdays, Fridays and saturdays, from 12 noon, to 2 A.M, then on sundays, from 4:00 P.M to 1, A.M there'll be aurelia. I did not see it clearly here. Do you have a going to have jukebox all right? Look, yes, I'm looking at the! Can you hear me I'm looking at the at the 30-day one moment, please yeah. While you check on that officer, dj music recorded music, dj, recording music and at the end live all right and you indicated there'll be a sound limiter properly installed, there'll be no promotion. Has the space being properly soundproofed? Yes and there'll be security guards personnel registered by new state? Yes, and just so you know the reason that this the last one was passed by your board and we on June 25th. So that's why they're asking reno for vacation June 25th of 2019, where the full board voted 33 in favor for a pose and two abstentions? Very well, yes, I do have that resolution passed by the board. Yes indeed, and it was sent out on July 1st so officer martinucci. Are you online? Yes, I am before you move on. I just lose our attention. Did you notice how I have not called you officer, pena yeah you're, doing very well. I appreciate that. Well, I was just curious how many security guards I do not know if it's cut off or if that was answered. I do not know. I understand that the number is one per 70. I think they're going to have two on the weekends, but when we do not anticipate having more than 70 or 80 people the space, it does have an occupancy of larger, but they've already filled it up with stuff. So I do not think that and we only have 64 chairs. Okay, all right. The only concerns that the precinct has is so. This is at the corner of 193 in Saint Nick. That's like a focal area of the precinct when it comes to noise and disorderly groups and people playing music and stuff so in every direction from this location through the summer. Up until now, there's just it's just crazy with people playing music and stuff, I think the sound limiter from the last step- that's definitely good, because that was also a concern because it's directly under the residential building, but other than that I mean the double parking on Saint Nicholas Avenue is horrible, adding a their establishment, definitely not going to help. So we're definitely going to need some help with that and, like I said before, just the groups of people that hang out and bless music. There are too many residents who call 311 and 911 on a daily basis on Saint, Nicholas Avenue and that's what we are concerned about. We do not want more calls because it's hard enough to enforce what what we've already been doing. So that's pretty much it from the 34. very well. Do we have any comments residents? I see Gabriel Estrella, please you have a flaw. Thank you very much. Can you hear me? Yes, we can okay, as you some of you might know. I am also a member of the Community board 12 and also a member of the Public Safety committee, and also I am a resident for 12 years already, living in 11 Fort George Hill, which is a right acrosss from where this particular business will be located and understanding that you know we are a community that we need to live with. You know among ourselves and try to to make sure that we are all good neighbors. You know I am very concerned very concerned about this business in that location. Where is as the officer from the 34 prison already mentioned, has been, you know, having many noise complaints and other complaints. As you know, we have the George Washington High school block away. We have also Feb, which is a charter school, also like a block away. So again, I am not against you know business, especially local business, because every everybody is entitled to make their lives and make their dreams come true. But at the same token, I you know as a resident of this of this building. I am very concerned about you know the noise about the the traffic, the crowd, the you know the excessive, probably situations that we really do not need. To be honest, so I just wanted to to put my heart off as a board member and speak as a as a resident and by the way my apartment is right. Acrosss. You know my window is just in the street, so I can. I can see everything and I can hear everything, so I just wanted to share my concern. Thank you. Thank you. So much gabriella on your point will be noted. Thank you so much at this point. I would like to recognize mercy, Joseph mercy. You have the floor, Mr Joseph, you have the floor. Please do not eat yourself, we'll come back to you. I would now move for Nancy Preston, yes, hi, thank you and I want to just piggyback on what gabriella had said. You know we had at a public hearing on noise pollution in this community at the Community Board had it in August- and this was one of the areas this right here is- was an area of lots of noise traffic safety issues, so that you know we would hope that the committee really considered the impact of this on the public safety. You know there are large occupancy buildings, the Mitchell Llama buildings, those Fort George, you know build residences. Are there so a lot of people can be affected, and- and I also I wanted to know- I'm not sure if someone was trying to get in eileen king. I do not know if you were able to see that wanted to speak, that's also a resident, so I just wanted to mention that as well. Thank you. Thank you. So much nancy at this point I'll come back to okay, so he lowered his hand. I'll come back now to someone named Eileen King, 7 G Arlington flaw eileen, okay, I've. This is irene king speaking, okay. I live at 11 for George Hill and I also serve as the president of the board of this building. We are 105 families that directly face this restaurant. We can hear absolutely everything and we have suffered tremendously this summer from the social club that has become Saint, Nicholas Avenue and 193Rd Street, it's already an out of control, social Club for every weekend, night and sometimes during the week. So I might I have certain questions. My question is the frontage on this building is all windows that look like. They are glass doors that will open out onto the street and I want to ask what would a sound limiter do inside the building? If we're going to hear everything out on the street very well. Thank you. So much eileen you've got your questions too, but I'd like I'm doing them in one order. Do you want me to give me all the questions? No, you have you have two minutes to state everything. Oh then. I then my other question is I've been monitoring this building for a very long time under all its construction? I do not ever remember seeing a sign in 2019 about a public meeting and I've monitored all summer the signs about this meeting when it would come up- and I only saw the sign for this meeting last night- the last time I checked it was Sunday morning and there was no sign. I want to know from the committee how long you give the community a chance to be notified about this meeting yeah and I, the 34th precinct, has already said it's paralyzed to do anything about what's going on in the street, so I'm asking my third question is about enforcement. Thank you. Thank you! So much eileen. I would now like to recognize listviewer this piano floppies. There we go. Okay, thanks! Thank you for recognizing me. Can you hear me? Can you hear me now excellent? So, looking at this location, there's a huge establishment- and I just want to echo what the previous speakers have said- that's a it's a highly saturated area. I do not know if this application meets the sla's definition for oversaturation, but from the perspective of a layperson, the general activation of the street, the number of SLA licensed establishments within a couple of blocks and the construction of this particular place, which I do not know if you've seen pictures of it, but as Eileen says it's all windows, which is going to offer zero very little sound proofing from just the glass and is going to be a huge problem when the windows are open, it's good for ventilation for Covid-19, very bad for noise, so I just have real concerns. I do not know speaking as a community board member. I do not know that. That's really doing the community a service to support this particular establishment and as a speaking as just a community resident. I'm really glad that I do not live anywhere near that address very well. I would encourage you to vote against it unless, in case that was not obvious. Thank you so much. We now go to the panelist aurelia. I had you have your hand raised. You had two minutes please. Thank you. I appreciate all of the comments regarding the location, but I just want to remind you: this is a re- notification to the community board. This license was already approved. The liquor Authority just wants to make sure that, after a year that some of the stipulations are in place after suffering, maybe some of the things that are happening with other businesses. I think it's unfair to put this onerous on this owner who's a new owner and who, I think, might even clean up the area. But then you know there can be stipulations we can stipulate to 1 am closing all the way around no 2 A.M on the weekends week, or I think 1 am closing all the way or 1 am closing in all the way around, and we can also stipulate to closing the windows at a certain hour which they do downtown a lot. We can close. The you know make sure those windows and doors are closed by like 11, so that we do not disturb when sounded is emitted from the location. I do not. You know. I do not know this. Is that there's a positive and a negative about using garages that where we, you know the the valet parking so that we do not disturb traffic? This is a good operator. I want to give him an opportunity to really show his stuff, but we also do not want to serve the neighbors. So I will take all these these comments under advisement and talk to him and make sure that we try to avoid any of these problems. Because, again you know this is a struggling time for restaurant owners and we'd like to see them prosper and violations do not help. You prosper. Thank you so much so to answer the question that eileen raised eileen the public has to be notified and that note has to be put on on establishment very visible, at least anywhere from 30 to 15 days. The fact that it was not that you say was not in any way shape or form or display when they came in the first time in 2019 and as you mentioned, that it was only posted by yesterday and he checked that it was not there on Sunday, it's very concerning, because it seems that the residents did not have a fair chance to know that this is coming forward, and you know the understanding is that the public has to know when a liquor license is coming to a community or an area. Having said that, I like to hear we did post it, I understand from the licensee that it blew off and then they posted it again. Remember the location is closed. You know, so he put it again and then he even sent a picture to the community board. It's in your records. When was this sent? I sent it to you guys with the packet over the weekend so over the weekend. I do not know long time ago, but I'd like to now limit discussion now with our committee Members Committee Remembrance. I would like now to open up the floor to hear what you have to say about us anyone. I would like to say something. If I may, I'm sorry who's this, I'm sorry. This is gabriella, I'm sorry, I'm trying to follow Protocol and I raised my hand since I'm not a committee member. You know. So I'm sorry. I did not want to break the protocol, but I just wanted to reiterate what eileen said I saw myself and this public meeting notice. It was not posted in the time frame that you just mentioned. Thank you so much gabriella that has been noted angel yeah. So I guess I need some more background information as a new committee member on the on the stipulation piece here so is the is the the establishment already been operational for the last year. Is that my understanding you see they've been on the they've been remodeling for some years after some time? I'm sorry and they've been closed, for at least I would say, like maybe eight months while the regulation takes place. So this committee and the board had already approved their liquor license a year passed and in the meantime they had been doing some type of construction work is what I'm hearing and now they're coming back, because the it expired it's only good for a year. The 30-day notice so angel saw him some background, so they came back. They came here first up for committee meetings going back up to June 12th of last year, then the Community Board Board met up as a whole and it was approved back in June 25th. The resolution to approve this was rain on July 1st of last year, but because the year has passed it is required to come back because it has already passed and, of course, things change and that's why we have this hearing in the sense that if there's any new issues, we will have to address those issues any other members, so yeah. This is Leo, I'm sorry for the interruption, I think and obviously we'll leave it up to voting. But I think, if they're just coming back to kind of, I want to say renew, but I guess to renegotiate the steps and stuff like that. Why do not we just add a step, maybe to put a good neighbor sign somewhere so that you know if people have complaints they can reach out, and you know no double parking because of Kogit. I think we should give the business owner a chance if they have not had any complaints. They understand there's a lot of noise in the area. Unfortunately, it's happening a lot of places in Washington Heights, but it's not in direct correlation with the business. The business has not been operating, so it's unfair to kind of put the blame on them for things happening in the environment. I think we should give them a running chance to see if they can sustain it, and you know in the future. If you know if something's happening or they're causing any ruckus, you know NYPD gets involved, they get violations and then next time around you know we'll figure it out then, but that's just my two cents. You know I was not thinking along this line. You're right, I think it's unfair to say that this business is not going to follow the regulations and all stipulations. The concern is that the area I know the area very well and based on the testimonies given by the residents they're very concerned that you know if this becomes an overblown lounge, it's going to be chaotic not only for the residents but also for the safety of even the patrons, and it could be a problem. It could be an issue, but I also understand what you just mentioned about giving them a fair chance, but this well. We have been having this discussion to see how we can you know, go in different ways. So thank you so much for that. I see you, though suggestion maybe would it be a good suggestion, possibly if you would reach out to ownership and could work with ownership. The precinct some of the community members who have voiced legitimate concerns where maybe a meeting at the establishment could be held where people would come together and express. You know the things that they've experienced their concerns and ownership should certainly take an interest in trying to be an intermediary and helpful in resolving these. So you know that might help very well in the past. Thank you. Thank you. Thank you during. I will consider that as the best practice, a business coming in wanting to be fair with other residents, noting that there are concerns also for prison, because I'm very concerned that, in case of emergency too many double product vehicles, there could represent a problem for the precinct and, of course, other amazing services. So that is very concerning to me as a resident as well, so we can not stipulate for them to meet because we do not have the authority, but as a best practice. Yes highly. We would highly recommend that this take place. That's how I meant that I'm sorry, I did not mean there's a step I mean. Well, maybe you could step up with ownership and literally reach out to people like eileen, with some other people on this course, where you reach out with ownership, and as you said so now we have all parties involved. We have the representative, we have president, we have a precinct if you can coordinate a meeting amongst yourselves Thou Hop. If a meeting does not take place, and this becomes a problem, the resident to come back and tell us that you know a meeting was not scheduled for whatever reason, but we can not stipulate that it would be highly recommended you're right and to that's something else. Oh, that was great. Thank you. Anybody else from committee members, okay, so I'm going to recommend that first Novalee parking sign it's illegal, but I would like to emphasize that we should not have any double part vehicles in this area for obvious reasons of safety and security, and that no bullet parking should be visible. The standard, I think, is three feet high on the sidewalk, not on the street. No valet parking, no double park sign as well a sound limited to be installed and with a proof of purchase that to be brought up to the Community board prior to or before the 23rd of this month. You see that it's in the file. I gave it to you. It's attached to your packet, the sound limiter. Is there please resend it, because I do not want to look back okay presented again, that there will be a phone number properly display, and I know that area is very wide. I would recommend at least three signs with a phone number in case there are problems that the residents can cause someone that will take the pr take out the problems right there on the spot. I might miss. A good name was sign as well and gerard and the rest of the committee members just parents on this. We need to work and redo the school network. Sign because it's not working, I mean, let's be open. As we frank, no one pays attention to design: it's not visible, it's not big enough, so we have to come up with idea community members to make sure that we get something like really that can call attention right in making sure that the pages are not hanging out outside in front of an establishment. So we need to rework on this grenade sign. So let me just repeat the steps: a sound limiter, a no ballet parking sign, not our parking sign as well phone number on three different areas where someone can be reached in case there, any problems, a good neighbor sign and as a best practice, we will recommend that the owners meet with the residents and the NYPD did. I need anything else. On that note, I recommend to go to vote. I agree you're right. Okay with that said. So again, this is for item number eight on the agenda. It's the Buddha Corps so is Israel with steps in place. How do you vote? Yes? I vote yes, cindy, yes, angel, yes, Leo, yes, Rosie, yes and Valdez, yes, Sir! Okay, congratulations! This passes unanimously with seven, yes and zero no's. Thank you so much gerard! Congratulations! Please! Aurelia inform the honors to please proceed up with the stipulations in place. Quick question: are we getting those stipulations? You see that? Are you going to email them to us question good question: you have? We have a template for the steps. Do we have chanel? Are you on the line? Yes, so sheena, can you please email the template in essenzarella? You do not need to notify. You do not need to memorize anything. You just have to submit the unlimited proof of purchase. Okay, I'll resubmit that now, okay, because at the double park sign you have to take care of the phone numbers that will be displayed. You take care of that and they're going to sign. You can pick it up from the from the office, so no need to have that unauthorized, but there will be steps nevertheless, so you're going to okay I'll work it out. We should know I want to take questions aurelia, you know be in touch of line and send another template suggest that I see Nancy's on he's still on, and I lean but Elio, could you maybe transfer some information just to the residents that gave concerns I just as a community resident. I would be very interested if you come to the next general meeting or the one following and let us know if this actually occurred, because I think it's really important and Alegria is going to show good faith or not with this ownership. So, if eileen and nancy- if that please come back and report to us, let us know at our next licensing committee we're very interested. Thank you on that note great point: you right on point. I think that aurelia they will have no idea how to communicate with you all the owners. So please put us put it in the chat. Yes well. Eileen gabriella, please write down the number that I really share with you, so you guys can communicate and organize this meeting. Yes, thank you. Thank you so much great. So with that said, we can move on to the next agenda item, which is number nine on the agenda and that is Fuego Topico Restaurant Corp. It's located at 3856, 10th Avenue, it's between 204th and 207Th Street. Again, this is item number nine on the agenda. Fuego Topico Restaurant for a new license. Are you present item number nine, any ownership or representative from application number nine. So with that said, we'll go to the next one to see, though, no we I recommend that we go to what will be your recommendation. You want to leave it on come back or you want to move the next one we could vote. You know they did not check in. They did not check it at the beginning. So let's vote yep. So this is for item number nine for the record. When we do a roll call at the beginning of the evening, they were not present. They are not present. Now so we're going to vote so seizure. How do you vote? No? I vote no cindy, no angel, Leo, no rosie! Sorry! No rosie! Okay! Thanks! Oh well, these! No! So this does not pay us unanimously. It's all seven no's with that said, we'll go to the next one on the agenda, which is item 10, Mama, Taco, Llc, Dv8, Mama Taco. This is located at 5025 broadway at the corner of West 215Th Street again, this is for a new license. Mama Taco Llc Dba Mama Taco. Are you present? Yes, hi welcome. You want to introduce yourself, yes rose, Rodriguez rose Rodriguez and you are owner. I'm sorry. Are you, the owner of the representative owner all right, we're both here, yeah we're both here. We have you on speaker so we're both here together very well. See now. Are you on the line? Yes, no, I'm sorry to bother you. I did not receive a copy of the menu for Mama Taco. Can you take a minute and check on that, while reading this application and it's Cedro- I know Martin collins at some point- will is on the queueing line. With some questions I could read or you can read, let's take care of that now. While she now looks into that, am I calling you have a flaw. Please submit yourself. I do not know. If he's, I could read what he's saying: Morton Collins Jayasidro: what's the method and hours of operation for number 10, mama, Taco, 5025 broadway, and will they have live music or dj? Also, what is the menu that merits a liquor license it's in it's in the ground floor of a three seven story: residential buildings and adjacent to 500, 505, 6, broadway, two more residential buildings. So primarily the questions are method and hours of operation and will they have live music or dj for that menu? I do not have it either. All right so on that note, but let me answer to to mine, because mine has been a great contributor, a contributor to our community bringing out issues, and I appreciate that so I would like to answer those questions so mine. They have a check here that they will bring a recorded music, only there'll be no jukebox, dj, no karaoke not live music and the hour's operations are 12 P.M noon to at 12:00, to 2, A.M, Mondays, tuesdays and wednesdays, then from thursdays, Fridays and saturdays, from 12, at noon to 3 A.M and then on sundays, until 2 A.M from 12 P.M. At this point we have Rosa Rodriguez, who is the owner Rosa? Yes, so we do not have a copy of the menu and that's part of the requirement for us to have a complete application. And on that note, since this application is not completed, we can not entertain this application. So I recommend my recommendation only that you withdraw this application until next month, until you bring a complete application which includes a copy of the menu and a complete questionnaire, which you have and also a copy of of a floor plan. So we come inside Rosa. Oh no, I remember submitting a menu with the attorney who was helping me fill out the application and submitting for the license. I'm not sure why that was not handed in yeah. I've been checking out of the package that I receive from the office and I do not see a copy of the menu so well we're still sticking by the previous menus mexican, authentic mexican Food. Okay, just give me one second, but if you know for us to consider, application has to be a complete application and a menu has to be part of it. Okay. What I can do is we, if you like, we draw this without punitive action to be thinking of this application until you come back next month, but you know you can decide to proceed with it. Give me one. Second, I see that eileen, you had a question. That's eileen! All right so I mean, if we'll be, we will be able to answer any questions you know about if to not delay the problem who's. Speaking now, please Nathaniel, I'm also part owner with Rose Rodriguez. Okay, so again, you know we will not be able to proceed with this application because it's incomplete. I recommend that you withdraw. If not, we will go into a straight vote without any discussion on the matter. It is part of the process of not considering any application if they're not 100, complete chanel. Are you on the line yeah, so you thought we checked and there are no menus right, yeah, no menus, just the questionnaire in the diagram. Thank you. So much before I move on committee, our decision, at least you have a question yeah I mean if you're going to vote on it. I hope that you vote against it, because we do not have enough information to fully consider the application if the applicant decides that they want to withdraw and represent next month. I have one question and a request. The question is: can somebody tell me what does the clock look like for the SLA and are we compelled to reply in some way? Is the SLA going to be deciding at some point before your November committee meeting and our November general meeting, and my request is that if the applicant withdraws the application and represents next month, I hope that they would be able to address. I do not want to hold them responsible for the mistakes of prior bad actors in that location. That's not their fault, but they do need to be aware of how many problems there were at that location and address the community's concern about that location and what it is. Specifically. They are going to do differently from all the previous operators, so that the folks who live in the 215th area do not have to be on the receiving end of bad actor after bad actor that has operated previously in that venue. So Isidro. I make a motion that we, as this individual applicant, are they withdrawing? Are they going to vote because we're actually doing the application, which is the exact point we're not supposed to be doing the application? These are conversations that should be have when this application is complete. So are you withdrawing it or do you want us to vote? It's a digital question? Yes or no? Okay? No, we will have to withdraw because we got ta submit the menu and we got ta come back to you guys with any questions that you guys have also, so you know address the matter of yeah, so you have to submit a full. You have to submit a full application and be prepared to answer any question of committees, members or residents, or anybody else that comes so we put that down as a withdrawal. Econo, it is great, is not it that's a withdrawal. Thank you. So much all right. Thank you. Thank you. So much. Thank you so much mine are you on the line before we move forward. I see that my colleagues is not on the line so we'll move forward. This application will be drawn. Let's move to an action piece, so item 11 earlier. Oh I'm here I actually it finally showed up to unmute myself. I pressed it like 50 times go ahead, Martin they went through the application, so you're probably going to want to come next week next month, we'll come next month, and we hope that the questions that the committee members the board members had and the public have will be addressed at that time. Thank you, that's great, and if you could, please ask the owners to post the notice in the window at 50:25 broadway for the November meeting, yeah Juan Gomez. Thank you so much. Thank you. Thank you. Mark item 11 had been withdrawn earlier, so we're going to go to the next item on the agenda, which is item 12. and that's under restaurant wine. That's a different category and item 12 on the agenda is elegant: core Elegant Club Corp. It's located at 84, Nagel Avenue, it's between elwood and sickle Street, so again, item 12 on the agenda, Elegant Club Corp! Are you present Miguel Acosta on behalf of the owner, Jose Sierra, very well, Miguel! You are the representative. I'm trying to take a look here as to where this place is at what was there before this is, I guess you know the little complex there where the barbershop is on the on the ground level, but you have to walk up like three flight steps. Well, there used to be a pool place there. I'm not sure my client is looking to put one table or billiards, I'm not sure if there was a previous location there, that was lightning yeah. If I'm not mistaken. Yes, you're right, it's around that area where the barber shop is at right next to the pizzeria, yes yeah. I think it's literally right next to the Pizzeria yeah. I think that is there is a pool place there. That was downstairs right, yeah, correct, yeah, very well, so you are the representative. Yes, and what is the nature of this establishment? It's an establishment, it's bee and wine yeah. Basically, it's just a beer and wine tavern. You know this applicant had a previous license. I believe it was on 204Th Street, then Avenue he had an issue with his partners surrendered a beer license, they've always operated he's. Always operated with a peer license, so basically it's it's more like a place of gathering. You know, friends and public. You know he's going to have one pool table. The operation is going to be very small. He has. He has a patio which is looking to extend his beard to the back of. It is not going to be there's going to be some sort of entertainment, which is ipad and trying to do karaoke and maybe have live music. Certain occasions operation is going to be from 4 P.M to 2 A.M, where there's a school acrosss the street. This will have to go to liquor authority within 200 feet from the school. This school, I think, is close to 396 naked. Just give me one second, she now are you on the line? Yes, so Chanel, I do not see a an application as part of this package yeah. It was emailed around 12:1 today, okay, so this is not part of the complete package that you sent at a very late afternoon. No, it's not part of the packet from yesterday moving forward as we do the zoom meeting. Please send me like everything that has not yet, but I mean they sent it yeah we sent it, we sent it on it. Yeah we got the email. Today we sent it around a little bit past twelve. Today, let me guys give one second, please if you do not mind, so you know like send me, like all the documents all in one package that way. I will know that everyone that submitted some documents and we're doing this because of Covid-19 that I'll get one package and that way I can print it out and not have it to look like in 20 different ways. I mean yeah. I sent it to you earlier in the day, but this is what I'm saying do not send it separately, send everything on one email. Only that way. I know that. That's all I have okay, you understand. Yeah, I mean that's what I did. Okay, you said that you sent it earlier. Yeah with the whole, like about seven applications, sent their documents around 12-ish one, and I put them all together. It was just one that got sent at like four, but other than that. Everybody else was in one packet, so everyone was in one pack right, yeah, except one that was the outlier that scented at like four, and that was cool. I had no control over. That was the one that centered at four was dykman billiards, okay, yeah, all right I'll, probably use them no problem. Thank you so much. I stand corrected very well so officer Mike. This is with the prairie 34 quiz and let's go with us. So the idea is that there'll be no jukebox. No bj there'll be karaoke, recorded music live music; the space has been properly soundproofed. The capacity is 75, the hours of operations are from 4 P.M to 2 A.M. Seven days a week. You heard us some of the descriptions brought by Miguel Acosta, who is a representative. I do have a crop of the menu. It will have a copy of the floor plan. It's a very limited food service. What's the opinion, 34 percent opinion 34th precinct. The biggest concern that we have is since outdoor dining began. Nagel Avenue from elwood to dykman has had double and triple parking on both sides of the street for the entire three to four block range. It's been completely out of control. This dislocation will only add to that. So that is definitely our biggest concern, because there have been emergencies that we've had to respond to where Nagel Avenue is the fastest route and it could take a marked car with lights and sirens way too many minutes to travel three to four blocks, and this falls in between elwood and sickles. So that is definitely our biggest concern. The only question that I had because I do not I did not see the document for this was the occupancy on this place. This is 75.. Okay. All right, I mean I need to stress it similar to how I was stressing it before with 193 in St Nick, as the other residents did, the the double and triple parking on both sides of the street has been an absolute mess over the last several months. So I want to stress that very well. Do I have any comments from residents I see mine? Are you still on, or that was from before same to you list as well no comments? I have a comment this. I just want to echo what the officer from the 3- 4 said. I hate to hold it against an establishment, that's just trying to be a business and go about their business, but that part of the neighborhood is a hot mess and I just do not think it can sustain another tax on it's on this on the street. It's just out of control and I yeah correct information is as follows. Thank you so much liz. Your comments have been noted. Now I go into a committee members. I really how you hand out before I move on. No, I did not no okay lower your hand. If you do not mind committee members, my only concern is the it's in front of our school, so maybe the hours of operation for the weekdays, maybe a 12, a midnight closure versus 2 am but that's pretty much it very well anybody else. Let's go look so on this particular agenda item. I'm a little bit concerned about the fact that, in case of an emergency kafir paid that either the NYPD, the firefighters would not have the proper way of coming around could be a problem. I can sense the frustration on the 34 prison about this particular area no fault to the owner, but adding new venues that can bring more traffic could be a problem. I do not know how this can be rectified. I do not know how we can solve this problem if we can solve it. So, at this point on this particular agenda item, I'm not optimistic that we can come to a to an agreement as far as like how to alleviate this concern. This very serious concern on my end, my recommendation. Only since this has been brought up by many residents about the school double park triple park, it's a problem I for one. I would not vote in favor of this, but the committee can move as you wish. Gerard you are muted. You know I good evening. I say I was just thinking about this business owner and I'm conflicted, because I totally acknowledge and recognize the public safety issue that has deteriorated in our community, from the tip of our of it, with down deep into Washington, Heights and well passed us and it's unfortunate, because a lack of will and a lack of leadership and resources. Businesses are kind of getting stuck, and it's not the police's fault. The police are not resourced, properly they're not supported properly in the enforcement. These are enforcement issues that have been permitted to continue to deteriorate in our community and because of that, instead of looking in the areas that should be making business possible, we're actually looking. You know, there's a side of me that it goes along with it that hey another business is going to create more of a problem, but more of a problem that we have permitted to exist. So I do not know, maybe I'm just thinking out loud. I think this community and leadership and public safety needs to start moving in the direction of enforcement and resourcing agencies that are supposed to do that and supporting that enforcement, so that business owners can be empowered to try to make a go of it. So it's more of a statement. It's conflicted. I do not. I think the businesses unfairly are getting negatively impacted by a lack of will and you know proper responsibility and resourcing. So I just wanted to say that yeah hey well made you right, and you know that you have a question, but I do not necessarily have a question I just I wanted to make a statement as well. I am a firm believer in consistency and just the way that we wanted to give consideration to the business on 193rd and saint nicholas, even though they have not been there, but there's been a lot of noise and there's been a lot of like community activism or a lot of the community making a lot of noise in that area. We were still willing to give the business owner a shot. I'm that's just my. I I'm a firm believer in consistency, and so, if we're going to treat one business that way, that is having a similar issue with the community at large in terms of noise in the area, then I would move to try to treat the other businesses in a more in the same consistent manner and you find well made and we'll take them as well. I think you're right, but you voted against that one, the one on 193 I did not. It was the one on saint nicholas and between 193rd and 192nd number eight was unanimously. You all voted unanimously. No, we voted in favor of it, yes, yeah and, I think angel just in committee right now. I agree with you because and that's you're spot on. When you talk about consistency in this committee, it's so important and I think the issue that 34th was bringing up while there is some issues of noise was more about the public safety. In terms of you know essential services getting down those streets. That's the point I was speaking to where I get conflicted, where you know the public safety issue of police and fire trucks being able to get down these streets. I think that's what he was talking about, but I agree with you on that note: angel and Duarte. I think that you made yourselves very clear. I got three other people who are under the impression that you voted no on that other one. So I'm very confused. No, it was no thank you right now I'll come back to that later on, but it was quoted a woman in favor with stipulations going back to what angel you have said in Gerard. I think you made outstanding points. I'm glad that I have you guys there to every now and then like push me to the wall, and I like that, I think you're, right officer, matinuchi, the question has become about enforcement. Why is it that we can not enforce double park and triple park since they do constitute a critical issue where emergency vehicles can not pass by? I think it's a question of enforcement. You're right angel, again, you're right as well. How can we enforce in cleaning this area out because it is within the that is within your jurisdiction, and if there is an area that needs to be cleared out, you yourselves are the only enforcing agencies that can do this. What can you tell us on that on this issue? No, I completely. I completely agree, especially with what gerard said, but basically what everybody's been saying. It is extremely unfair to hold a new business accountable for the problems of a four block stretch. I could not agree with that more and I fully accept it. The only thing that I will say is the problem is not continued by a lack of enforcement by us. There are tickets being written, there are cars being towed, we are trying. We are trying very hard to move everything and I know you're not saying that we're not trying, but it's just one of those issues that if you write a parking summons on a double or triple parked car, somebody will just leave the car there and, if we're in the middle of writing a ticket- and somebody comes out, it's a good time to use discretion. But as that car leaves now, they know that as long as they're on the sidewalk and they can see the police officer approach their car, they know that discretion will continue to be used and they could just cut spin around the block and park back and if they do not take that spot, somebody else will. So it's not it's not this new business's fault. I fully acknowledge that it's just it it's basically what gerard was getting at it. It's an impossible thing for us to continue to enforce and just the thought of adding another business. There is like depressing for the community honestly any comments from other community committee members yeah. Just on that note. This is a be a behavioral issue in the sense of you know, a sense of a lack of awareness and concern for your fellow residents or people that live in these buildings, because I always look at this as it's a public safety issue. You know when you're blocking streets, that's fire trucks that can't get down in its police cars. So I think it's a serious thing. It's not just somebody looking to have a great time in Parker there. You know, I'm just you know, maybe it's something that traffic and transportation Jordan. I was just going to jump in and I was going to say. I think that that's something that I'm on that committee as well, something that we could. We can bring up there to figure out. You know where you kind of create zones where it's not viewed at that you're double parking you're, creating a public safety which could be a life safety issue. Maybe that's the way to talk about it, but you know angel. Maybe we could bring it up in traffic, where you know it's more than just double parking, you could be putting somebody's life in jeopardy if a fire truck can't get through or a police car can't get through it's and it's not. It's someone's good time does not really trump that public safety should always be in the forefront, and you know we should do a better job in our community. Our leadership should support resourcing as well, and they should be more vocal in support. Cindy Leo. I want to hear from you guys I am I'm it's Leo, I'm going to echo Angel's statement and say yeah, I you know, I understand it's been tough, you know people are out and about and they're doing things they're not supposed to like Gerard said it does affect the community, not only the buildings residents with the noise, but you know people, students, acrosss the street, there's a school there, but I do think we should give them a fighting chance. A fair chance- and you know maybe like it- was previously mentioned- bringing it up in the traffic transportation committee and then go from there very well. Anybody else cindy here. Definitely some great points being made and I agree we do need to give businesses the opportunity to prosper when operators are good, they tend to clean up the areas that you know have major issues. So if we, you know, do what we do best as a community board ask the right questions require steps, and you know you know listen to our residents. Then I think you know we do have that opportunity to give these businesses a chance to. You know, help us out basically by cleaning up these areas that we struggle with so much so yeah very well. When you guys, then I recommend awesome steps. Well, we like to move with our thought without steps. I do not know if steps are required for this. You know it's really a it's a density issue. I do not know if stiffs can do anything with that, you know, and can I come? Can I comment easily over real quick just before we finish with the comments I like to exhaust arguments within committee members, so I could have a full understanding, perhaps how we're going to move forward and then I'll get back to you. I know I'm good all right, so I seen other committee members Miguel yes. Well, I want to thank everybody that voiced their opinion with regards to the neighborhood and things that are going on in our area and in our community and basically addressing the the traffic situation is very key. You know that should be very addressed in any meeting that traffic is discussed, Dyke, I'm my office in the corner of Dykma Street and Sherman Avenue that, where it's loud music, you know illegal bike, riding double triple parking right on dickman, you know, so the concerns on Eagle Avenue should be a concern in the entire. You know Inwood area basically- and I understand exactly what everybody's referring to with regards to emergencies and emergency vehicles being able to pass by, but let's also understand that not every business in our community brings traffic, not every business in our community brings noise. Business owners, especially now, are very careful with the way they operate, but we've seen a lot of licenses being taken away these past years, every business that has been cited for violations have cured their violations and have been better operated. As you can see, you know with the communication that we have recently and in the past with regards to businesses that were fat operators. So I understand you know the concern and I do not think that a small business will have an effect on driving in the neighborhood. Thank you. So the idea is that, based on the comments that I got from Andrews Gerard, Cindy, Rosie and Leo- that indeed we had to give business a fair chance- I for once at the very beginning, was not going to be willing to go that way or move that way and after you know, you mentioned that this issue perhaps is beyond the control of the owner. So you know thank you angel for bringing that up euron dollars as well. Taking that into account, I recommend that we got the vote. I agree so we're voting for item 12 on the agenda. Well, actually, before I go there just to a point brought up earlier, I think Liz was asking about it was it was. Where was that 10? What was that was seven I'll? Give you the votes? The votes on item seven was a unanimous. Yes, I'm sorry is agenda. Item number eight, my apologies! So I item eight was it was a unanimous yes just for everybody's edification so and Mark's nine was a unanimous. No, but okay, that's what I was confused about. I apologize sure. So again, I wanted to you know circle back, feel this item number 12 we're voting on right now, so cedric. How do you vote? Yes, I vote yes, cindy! Yes, angel! Yes, Leo! Yes, Rosie! Yes! Well these well! These! I think what this left. Okay, so that's fine, so this application passes unanimously with six yeses. Congratulations! Thank you. Thank you. We're going to thank you guys have a good night. Thank you very much. Thank you please. When you speak up with the owner, please let him know about if he can at least work and making sure that his patrons do not double park so that they will not exacerbate the problem even further and nobody parking please work without the owner, because this is a very serious concern for the precinct and, of course I understand this guy. This gentleman, you know he's in the 60s. You know 60s, you know mid 60s, so you know, I think it's going to be something conservative, there's not going to be any party atmosphere anymore. Thank you! So much just for him. You know you're right. So next on the agenda is item 13.. It's cool Raku, New York. I like that name, 3952 broadway, it's between 165Th and 166Th street. Again, it's item number 13 on the agenda. It's for restaurant wine, Kuraku New York! Are you present all right? You got to unmute Mijo yeah. Yes, we are here welcome and for the purpose of the minutes. Please tell us your name and affiliation to this business. I'm a manager- and this is japanese restaurants. This is japanese, restaurant very well and it's a japanese restaurant. I do have a complete application from this applicant, which includes a copy of the floor plan, a copy of other menu, and let me just go through the specifics. This is with the probably the 33rd present officer Brown. Let me just tell you: the metal operations, if you do not mind, will be mondays. Seven days a week from 11 A.M to 11, P.M there'll be there'll, be no dj; no jukebox! No karaoke, no live music. I know sound Limiter will be necessary, there'll, be no security, record, no third- party promoters. The capacity is 150 and there'll, be eight tables and 30 chairs there'll be no bar stools officer Brown. What will be the penalty of 33 percent hi good evening in regards? We have no complaints and no issues with this location. We did have a three on one call on that block last week in regards to double parking, but that was not associated with the restaurant that was associated with a different establishment just in the vicinity of this restaurant, and we also had a couple 301 calls at a different establishment on that same block for failure to enforce social distancing and mass wearing. So we just asked them to please just please understand that we're in a pandemic right now and it's important to a social distance wear your mask, but in regards to this location we have no complaints. Okay. Well, I see no questions from residents. Any quick question from our committee members. Otherwise, taking into account that the hours are not prohibited, there will be no live music unless there are some very concerning issues from the committee members and to save time I recommend I go to straight vote, so item 13 on the agenda. How do you vote? Yes, I vote yes, cindy. Yes, okay, great angel, yes Leo! Yes, Rosie, yes and we're going to say well, these is not here. So congratulations. This applicant passes unanimously with six yeses and zero. No, so good luck! Thank you! Thank you. We are dismissed. I can leave yes, you can. Thank you very much, sir. I hope you do well good. Take care of yourselves stay back. Thank you. All right! Wonderful have a good evening. So last but not least, is item 14., it's Jade Sushi again. This is under restaurant wine and it's item 14 on the agenda. Jade Sushi and Bar Inc 1506 Saint Nick Avenue between 185Th and 186Th Street Jade Susie. Are you present? Yes, this is a re- notification to the community board. The liquor attack now for expiration. The liquor authority is asking that, if for a new application to re- notify the community board, this was a new owner the same owner, but it was the same business just a different owner and we had to come back to community boy. It's a location of 1506, say Nicholas Avenue of it's operating, it's been open. I think the residents won't have any complaints, because Natalie Rosario's running a really I'm even the miss Covid-19 without a liquor license. This is a you know, an application to to bring it in only because liquor has really helped the locations she thinks it's going to help her sales and from the way the business is operating. I do not think it's really adorable. I do not think it's a Mr Mangu, it's really a cute location and and it's half the size it of the there was a prior ownership there. It's actually half the size of what thank you so much. Let me just go further. This application. It is a complete application with a proper flow plan and all that this applicant came here last year and a resolution was voted in favor for them to receive the restaurant one license. I also note that they received that a on the based on the last health inspection. Let me just go over the specific officer martinucci. The idea here is to have the hours of operation between mondays through saturdays, from 9 A.M, to 2, A.M and sundays, from 9:00 A.M to a midnight. The capacity in this area 74. again as it was recording the last time I came here last year, it was approved for dj, recorded music amplify jazz and no karaoke, no karyoke right, aurelia, no karaoke, my career. Thank you so much so. Based on that office, Matinouchi will be the opinion of 34.. We dare I'm just hold on one. Second, I'm just going through my the notes. Yeah. No, we are. We have no issues with with their request. Thank you. So much obviously any comments from our residents. I see that Cheryl Miller's on the line. I sherry you have the floor. Cheryl, please do not meet yourself. I think. Okay, I see that you lower your hand. Okay, can you hear me now? Yes, we can. Okay, actually I have my hand up before Zedrow and I wanted to speak on the previous, the previous license before this one, the ones the japanese place, because I'm right over there I wanted to know where are they opening up at because there's Bbq's over there and it's on the block of Chase Bank? I believe it's got to be on that block. So there were two empty spaces there. One was the Ex- caf day used to be a coffee shop and the other one was, I believe, the Columbia bookstore. There was a bookstore that was there. Do you know what space you're in? It's got to be one of those I live in the area. I live in the area, it's the cafe, one show. So how are they fitting 150 tables in there? That's a small place, not wonderful, to say, 150 people not favors, oh okay, they said 150 tables. So what are they serving they're serving Japanese? That's it! Yes, just japanese food ramen, okay, but I think, but I think they fall under the 500 foot. Zedra do not they. Let me see how many licenses are there because you have a bbq. You have public house on the corner by me. You have Wendy's acrosss the street. I believe Wendy's is still a restaurant right. Even though they're fast food, it's a restaurant yeah. They do not have alcohol, garnet beers with alcohol. This is this. Is wine? It's a wine license. Oh it's wine! Okay, so they do not. For so it's not under the 500.. This is what yeah it's restaurant wine. Okay, so it does not yes! So it's only if they have a full on premise: liquor license that then it would be under the 500., correct, yeah and just stepping back to this application. We're talking about jade, we're on right now, Jade Soucy, any other. I think you meant to say you said a liquor. Jade Sushi is coming for a restaurant wine, not for on- premise, liquor, just no. It's coming for an on- premise, local license! So I'm just saying on the agenda. It was on the agenda it's on under restaurant wine. Just so you know yeah. They made a mistake that I on the notice it says full liquor. Did they make the mistake or did the office make the mistake? I think the office made the mistake because I actually looked at it today to sort of you know and it's full liquor, I'm positive. No, the application that you filed is for wine and beer. I think that's supposed to you. It's fire. It's full liquor. Let me see the applicants here, Natalie Natalie. I do not know if you can see what you yourself file right there I can make. I can make the correction it's full liquor. No, we can not entertain that now. Hello, yes, Natalie is the founder of wine and beer wine and wine and beer. Only! Oh okay. I'm sorry guys! My mistake, I'm sorry, my brain! Thank you! So item 14, Jade Sushi, is seizure. How do you vote? Yes? I vote yes cindy. Oh yes, angel! Yes, Leo! Yes, Rosie! Yes, while these I think it's going so congratulations. This application passes unanimously with six yeses zero knows. Thank you so much guys. Thank you so much location, thank you guys have a good night. Everyone have a good night guys. Thank you guys before you leave, who will take care of other minutes and the wrestlers ross you have volunteer before and I do not know what the status is. As far as that is concerned, I do not. I do not mind volunteering as long as we have the transcription services that we mentioned prior, but if we do not, then I'm not volunteering for it. So this is going to fall on the vice presidents, cindy and Gerard. I can take care of either all, but I can not take care of both unless anybody else wants to volunteer, but I can not do both. I did that last and we need to have more involvement. I mean I can not be the only one and again angel. Thank you so much for bringing something to my attention about consistency. I'm open, I listen and I'm glad that you know you have the courage to say: let's do this right and I like that, but in the sense, at the same time we should also take ownership of this committee and you know be a little bit more involved right. I do not want to be the one always determining the any way, shape or form any licenses. We are committed with a team, but we also got to be a team when we have to work. So let's address this topic now, because this has to be addressed comments, so I'm okay to do minutes. I've never done them before. I could take a crack at it. You know I'll give it a shot. I can send you the template and samples, it's actually not bad, because the way that roosie has done the minutes- it's very, I would say, like 100 easy, but it's not really bad. I just feel that I want to make sure that you guys are part of this committee, that you know that we're going to work together that we're going to fight together. You know we'll come to a general board meeting that I can't talk, feel free and you know defend me please, because good part of the team, that's all I want to highlight if you want, because I would love to learn how to do it as well. I have no idea how to, but I do not mind doing it for next month, so volunteering for next month- and maybe you know, having Rosie, send out her minutes when she's finished so that I can use it for next month. The templar at least very well, so yeah, I'm also happy to volunteer in the future. I would just you know, give it a heads up beforehand so that I know like okay angel take notes today, because you know you're going to be writing the minutes or something yeah. So I'll send the templates to us cindy for the minute and rosa you say you can do the wrestle, maybe rosie she seems to be on me. Oh I can take care, then the wrestle the rezzos I've never done before. If you send me over the template of the prior one, then sure yeah but honestly I feel like if we, if we figured something out in terms of the transcription services, because Natalie had mentioned it before it would be a thousand times easier to do the minutes. So the office staff would be the one to deal with this matter. Right, yeah and Natalie has suggested it so she's the one who knows in case. If nobody in the office knows how to go about it. Yeah Natalie mentioned that how to transcribe a minute. So let's do I'll, send out both cindy and the template for the minutes and then rosie. The wrestle actually has the same format. They all follow the same pattern, but I'll send you different formats, so you can have an idea I'll share that with everyone, but Rosie you take care of the russell since the minutes and then I'll share the minutes and 10 plays for press on the minutes with Angel and Leo sounds like a plan sounds good with me. Thank you. When we go to the board meeting, I feel free and feeling sometimes I forget you know not as young as you are. I forget a lot of things for free and you know fueling whenever you see fit, so I'm really grateful for your support and your participation. Thank you. So much have a good night stay safe, stay healthy! Thank you have a good night. Everyone. Thank you. Thank you. So much guys take care. Peace.",
            "summary": "We also recognize the fact that how we run this committee might not be perfect, but we are surely trying our best, and for that reason, I know that with this technology that we have, I will soon things can happen every now and then, and we would like to prevent anyone who has been waiting for a long time and will not get the proper attention because of some glitches.\nHaving said that, I'm going to ask for girard to please do a roll call before we start and before we do introduction of our prison and, of course, any elected officials that might be in the house, you're right sure, good, evening.\nThank you for delivering these documents to me is important, because I need to have things visually Having said that, the way that we're going to function for the new applicants is that we would entertain the agenda as this.\nI know that this will need a vote from the General Board as a whole and that vote takes place on the fourth Tuesday of every month and that'll be the final decision that the board will make on your application.\nWe had a civil court summons issued for loud music in 2018, and we also had someone that was cut with glass on new year's eve from 2017 going into 2018 at that location, very wrong.\nYou know there is an ongoing issue of just people, congregating on that block, and I visited them myself a number of times in the past, and They have this 24-hour little grocery next door, where you know, residents, just set up camp right in front of it Right next door to the Villas lounge and play dominoes and drink beer openly and basically play their own music, So, that's something that is just going completely out of out of the their control.\nYou, know, I mean set up tables outside They do have music outside, but I do not think it's loud again.\nHe stated that he thought that he could not have more than 50 patrons inside at one time, which was clearly not the case at all, especially when the coronavirus was first kind of came into effect within New York City, so that was in March Most recently in on October 1st, the SLA and the NYPD vice they conducted inspection at the location, and they found that they were also again in violation of the mayor's executive.\nYou, know, I know it does not sound like it's a lot of people, but they were told there was no indoor dining at all You're right for the sake of of giving people a fair chance, an opportunity to come and have their opinion be heard, and, obviously to themselves.\nAnd I'm, asking also this at the rest of the committee as well, We leave this agenda item until right after five.\nWe'll come back to this and let's proceed with agenda item number four : This is under item c, which is state Liquor, Authority method of operation.\nThis is to change Monday, closing hours to 4 pm to 1 am, and this is 4c the kitchen and The representative from agenda item number four, please: How are you doing to sign Miguel Acosta once again representing Susana manon who's on the call with us here in the meeting She's, the president and operator of Cbb Kitchen and Bar Corp doing business as room 4996, so we did submit when we applied for this license.\nI. Would entertain a discussion with committee members once we hear the opinion authority for prison and also from our residents, but I'd like to hear first of all, 34 percent.\nYes, actually I want it to open at 11 Monday through Friday and 12 o'clock, Yeah and saturdays and sundays, because our liquor license does not permit to serve any alcohol or beer pm.\nCan I, please hear your opinion, probably, if not, I think I would recommend that we're going to vote.\nNext on the agenda is under item d on the Agenda State Liquor Authority alteration license, and this is going to be to convert one of its service bars to a full bar.\nThat's, going to help him continue to operate his business in a way, that's economically beneficial to him, and I hope that you approve this application.\nYou know, assuming cover to stable at some point we're making an application for the license there so that we can actually serve the community.\nThis is a very dangerous, an unfair situation where people or businesses were taking advantage of regulation when pleased to prevent other barriers from going to infect our community, and yet this merchant.\nThis is the new license section put on the agenda and this is for item number, six crack and peel located at 126, Nagel Avenue, it's at the corner of arden street crack and peel welcome hi.\nThank you for the sake of keeping our residents saying and perhaps from preventing the community from getting issues, I'm going to recommend that you do buy a sound limiter.\nThank, you very much good night, all right good night next, on the agenda again under on- premise, liquor license for new is item seven, and this is for seven Henshaw Inc Dba cloisters grill, located at seven henshaw street.\nTo point out that there are residents who hear noise at a loud volume just want the people to know.\nSo I, respect and appreciate that you know you kind of need a liquor license to make this happen, but I have real misgivings because there was no posting of this meeting around the location.\nI would like to recognize now Nancy, yes, hi, thank you, and this is conveying this for Ted gallagher, who is a resident of the same building, and also you know a community member for over 38 years, who actually has a worked for 17 years as a senior city planning at HPD.\nYou know he opposes this because he says henshaw street is effectively a service road for the henry Hudson parkway drivers use it to avoid the bridge toll, even without a proposed liquor, license noise and traffic congestion.\nAnd I can commiserate, but I think that you know I think they've been a good neighbor as far as I know , This is a very tough time for restaurant owners and if they go out of business, what's going to take their place is crime.\nAside from that, you know, my main concern is more with regards to music, and I understand the tenant's concern is any type of noise, but sometimes especially right now we have 25 indoor dining some days, especially this past couple of weeks.\nYou know time for business owners to comply with every single rule and regulation when it comes to noise, because if you have a pickup, you have patrons that.\nYou know right, now, she's, operating her business and was unable to attend the meeting, but I would definitely address every single concern that may have.\nYou know somehow around this community, but taking into account the residents that are very concerned about noise, double parking issue and opening late, I'm going to recommend some stipulations sure my steps will be a sign that will be no bubble.\nAnd, as you know, Miguel, to send us a copy, approve a purchase out to the Community Board before Friday the 23rd before five o'clock, perfect committee members.\nThat's like a focal area of the precinct when it comes to noise and disorderly groups and people playing music and stuff so in every direction from this location through the summer.\nUp until now, there's just it's just crazy, with people playing music and stuff That's, definitely good, because that was also a concern because it's directly under the residential building, but other than that I mean the double parking on Saint Nicholas Avenue is horrible, adding a their establishment, definitely not going to help.\nI am also a member of the Community board 12 and also a member of the Public Safety committee, and also I am a resident for 12 years already, living in 11 Fort George Hill, which is a right acrosss from where this particular business will be located and understanding that you know we are a community that we need to live.\nYou know we had at a public hearing on noise pollution in this community at the Community Board Was, an area of lots of noise traffic safety issues, so that you know, we would hope that the committee really considered the impact of this on the public safety.\nI want to know from the committee how long you give the community a chance to be notified about this meeting.\nI do not know if this application meets the sla's definition for oversaturation, but from the perspective of a layperson, the general activation of the street, the number of SLA licensed establishments within a couple of blocks and the construction of this particular place, which I do not know if you've seen pictures of it, but as Eileen says it's all windows, which is going to offer zero very little sound proofing from just the glass and is going to be a huge problem when the windows are open.\nIt's good for ventilation for Covid-19, very bad for noise, I, do not know speaking as a community board, member.\nThe fact that it was not that you say was not in any way shape or form or display when they came in the first time in 2019 and as you mentioned, that it was only posted by yesterday and he checked that it was not there on Sunday, it's very concerning, because it seems that the residents did not have a fair chance to know that this is coming forward.\nAnd you know, the understanding is that the public has to know when a liquor license is coming to a community or an area.\nSo, this committee and the board had already approved their liquor license a year passed and in the meantime they had been doing some type of construction work.\nThe precinct some of the community members who have voiced legitimate concerns where maybe a meeting at the establishment could be held where people would come together and express.\nI will consider that as the best practice, a business coming in wanting to be fair with other residents, noting that there are concerns also for prison, because I'm very concerned that, in case of emergency too many double product vehicles.\nWe have president, we have a precinct if you can coordinate a meeting amongst yourselves Thou Hop. If a meeting does not take place, and this becomes a problem, the resident to come back and tell us that you know a meeting was not scheduled for whatever reason, but we can not stipulate that it would be highly recommended you're right and to that's something.\nAnybody else from committee members, okay, so I'm going to recommend that first Novalee parking sign It's illegal, but I would like to emphasize that we should not have any double part vehicles in this area for obvious reasons of safety and security, and that no bullet parking should be visible.\nSo we have to come up with idea community members to make sure that we get something like really that can call attention right in making sure that the pages are not hanging out outside in front of an establishment.\nLet me just repeat the steps: a sound limiter, a no ballet parking sign, not our parking sign as well phone number on three different areas where someone can be reached in case there, any problems, a good neighbor sign and as a best practice, we will recommend that the owners meet with the residents and the NYPD did.\nI would be very interested if you come to the next general meeting or the one following and let us know if this actually occurred, because I think it's really important and Alegria is going to show good faith or not with this ownership.\nIf that please come back and report to us, let us know at our next licensing committee we're very interested.\nSo much before I move on committee, our decision, at least you have a question: I mean if you're going to vote on.\nThey went through the application, so you're probably going to want to come next week next month , we'll come next month, and we hope that the questions that the committee members the board members had and the public have will be addressed at that time.\nI was just thinking about this business owner And, I'm conflicted, because I totally acknowledge and recognize the public safety issue that has deteriorated in our community, from the tip of our of it, with down deep into Washington, Heights and well passed us And, it's unfortunate, because a lack of will and a lack of leadership and resources.\nI think this community and leadership and public safety needs to start moving in the direction of enforcement and resourcing agencies that are supposed to do that and supporting that enforcement, so that business owners can be empowered to try to make a go of it.\nIf we're going to treat one business that way, that is having a similar issue with the community at large in terms of noise in the area, then I would move to try to treat the other businesses in a more in the same consistent manner, and you find well made And, I, think angel, just in committee right, now.\nHonestly any comments from other community committee members This is a be a behavioral issue in the sense of you know, a sense of a lack of awareness and concern for your fellow residents or people that live in these buildings, because I always look at this as it's a public safety, issue.\nYou know people are out and about To, like Gerard said it does affect the community, not only the buildings residents with the noise, but you know people, students, acrosss, the street, there's a school there, but I do think we should give them a fighting, chance.\nWe do need to give businesses the opportunity to prosper when operators are good, they tend to clean up the areas that you know have major issues.\nIf we, you know, do what we do best as a community board ask the right.\nAll right, so I seen other committee members Miguel Well, I want to thank everybody that voiced their opinion with regards to the neighborhood and things that are going on in our area and in our community and Basically.\nYou know that should be very addressed in any meeting that traffic is discussed, Dyke, I'm my office in the corner of Dykma Street and Sherman Avenue that, where it's loud music.\nPlease let him know about if he can at least work and making sure that his patrons do not double park so that they will not exacerbate the problem even further and nobody parking please work without the owner, because this is a very serious concern for the precinct.\nThere will be no live music Unless there are some very concerning issues from the committee members and to save time, I recommend I go to straight vote.\nThis is a you know, an application to to bring it in only because liquor has really helped the locations.\nShe thinks it's going to help her sales and from the way the business is operating."
        }
    }
}