{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB6",
            "channelId": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA",
            "title": "Gowanus Infrastructure Update from DCP",
            "publishDate": "2020-12-02",
            "shortDescription": "December 2, 2020 DCP on Gowanus Infrastructure\\n\\nCheck out meeting materials here- http://bit.ly/GowanusInfrastructureMeetingMaterials",
            "lengthSeconds": "2:28:33"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB6",
            "normalizedName": "Brooklyn Community Board 6",
            "twitterName": null,
            "youtubeChannelName": "Michael Racioppo",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA/videos",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "6hVbEJx8nmc",
            "fillerWordCount": {
                "uh": 255,
                "um": 391
            },
            "readTimeFullTranscript": "77 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "stormwater": 67,
                "rule": 64,
                "water": 53,
                "sewer": 52,
                "infrastructure": 46,
                "development": 45,
                "canal": 43,
                "sites": 40,
                "rezoning": 35,
                "storm": 31
            },
            "wordCountSummary": {
                "stormwater": 31,
                "rule": 23,
                "sewer": 18,
                "infrastructure": 17,
                "volume": 13,
                "water": 12,
                "canal": 11,
                "development": 11,
                "connection": 9,
                "requirements": 9
            },
            "fullTranscript": "So we're recording people are coming in I think we have key panelists so far and 601, so we will give it a few minutes for more people to show up I think we had over 250 getting close to 300 people who registered for tonight so we're at 84 at the moment and I'm gonna take one of these books and Jonathan did we're not live streaming right, yeah, we're broedcasting right now, oh no but say YouTube, oh no! We weren't able to figure that out yeah we are barely able to do it. Okay, I just lair, just wanted to know you of activity, a partnership between getting the news at the same time, huh all right, we'll give it one more minute. Maybe two minutes and we'll get started. Okay, see I think we can get started 607. We have about 134 attendees my interco table, so we may as well so good evening. Everybody. We hope you are well and healthy, we're glad to be back. Our last meeting was less than two weeks ago actually, and we, along with our colleagues at housing and preservation, development and environmental remediation, presented an update on the Gowanus green development proposal with the development team. We are happy we're happy, then, and are still happy to share that the news that the development will be 100, affordable and will have the latest best practices for sustainability and resiliency in early October. It was announced that after four plus years of planning work, the Gowanus zoning proposal would enter public review in January of 2021 the community board and others requested. We provide updates and refreshers on the plan and proposal in order to prepare the board and community ahead of the official review period. So we plan a few meetings that could occur before or after certification, and this is the third one and tonight we are here to give an update on key infrastructure pieces that the community has had a keen interest in over the years. Specifically, we will be presenting on sewers and drainage and how the Gowanus plan will support the creation of new schools and improvements to the area's transit network and infrastructure. There are a number of panelists here with me tonight and we should do a round of introductions to make things easier in the zoom format. I can introduce my colleagues at different agencies, I'm just going to run down the list here and it's I'm Jonathan Keller from the Department of City planning, I'm a project manager for the Gowanus neighborhood plan, I'm here with colleagues from DCP Alex summer Amrita, Mahesh, Amy, Jin, and also Siggy Galan and Tom Smith, Joan, Rogoff and Winston Von Engel. We're also happy to be joined by our colleagues from DEP, including Angela Likada at the gate, and we're also happy to have Gail Mandero from SCA with us as well. I also see Council. Member lander is here with us as a panelist as well. I, don't know Brad. If you wanted to take the moment now or in a minute, if you wanted to make any remarks, you can go ahead and make introductions first, yeah I think I ran down the folks of the panelists, so I think you're, the last one and I can keep going on the meeting format. But if you'd like to take the moment now feel free sure, thank you. Jonathan I won't take too long because I know there's a lot of information to present tonight. But you know, as we've been talking about- and you know, I think folks know, I think that the broadly, if we get it right, the Gowanus neighborhood rezoning offers us an opportunity to build a more affordable, more integrated, a more vibrant, more sustained, a sustainable community than the one we have today, but there's a really big caveat, which is that growth must come along with the infrastructure needed to sustain it for new families and businesses who would come, but also for all those of us who live and work here today. I just live a block and a half away, and so having that infrastructure in place is just critical and that's why, from the beginning, community members have been pushing to demand. You know new stormwater policies to make sure that new construction doesn't add any csos into the canal, that we really get a resilient waterfront esplanade and that there's enough new schools for not just the new kids but the ones that are already here, because we already have some overcrowded schools and some transit policies to make sure that we have the subway access and the buses that we need to nurture our families for a long time to come. There's a lot of questions. People have there's a lot of information. That's going to be provided tonight, there's time to keep going over. It I'll just say one thing here that I know. Last night there was some good discussion at the Cag about some of the cso and stormwater issues and I think the EPA has made clear that they're going to take a real good hard. Look that just like it's important to me and to you and to the community that there's no additional csos in the canal that we make it cleaner to protect the remedy of the dredge and those tanks that are getting built. That they're going to look with real hard scrutiny at the new stormwater rule at the data that's being presented tonight and tell us what they think about it, and that's one of the great things actually about the super fund is that it brings the EPA in as a real guarantor of the canal cleanup. And so you know with that in mind. I'm looking forward to hearing the presentations tonight I will stick around as I did last time participate a little bit in the chat and look forward to hearing the Q&A thanks. Oh I was meeting saying thanks Brian and I also forgot to say at the beginning. Thank you to the community board sticks for being our zoom conduit and I. Think Mike wanted to say something. Yeah I know I, just basically. Second, what you had said and what Brad had said about. We had asked for the pre-certification meetings and we're pleased just like I said at the start of the public place meeting we're pleased that DCP is holding these meetings and letting you know the community. You know, engage and ask questions at this point, but of course you know our final. You know judgment or whatever of this, not whatever our final position on this in the end will be determined by the content, and we are looking forward to what's there tonight, because obviously the csos and infrastructure have been a major issue. You know even as I always peripherally even heard about the canal in this sense, having grown up in you know, on the southwest side of Prostitute, Park and Windsor, Terrace and I. Think I'm excited to hear this thanks and you know, as we figure this out, I was very happy to be a zoom conduit, as I've been referring to it. We got a pretty good turnout and I will share the information in my newsletter. Anyone who's here that doesn't receive that. If you want to, you can send me an email, Mike, Bkb6.Org and I will add you to my daily list, or you can text Bkcb62222828 or go on our website and sign up there as well. We'll share the presentation, the videos and we'll go from there. Thank you. Jonathan and oh yeah I'll see you guys tomorrow night at our land news meeting too. So yes and I'll be there as well great thanks, Mike I'd also recognize we have a representative Richard Bearak. Many of you are familiar with from the borough president's office who's actually at our last meeting as well, but just with everything going on I missed mentioning that he was also there. So thanks Richard for being here, okay, so the meeting format tonight I just want to go over it. If you weren't here last time, it's largely similar, but first I just wanted to always thank you for taking the time out of your day. I know many of you are taking time out of your night from your families or jobs or hobbies to come here, and we have lots to talk about and I. I've said this the past two meetings: it really is true and it bears repeating for newcomers, others. As a reminder, we are all here because we care about the future of our city and neighborhoods and want to shape that future. What that future could not could be not just for ourselves but for future generations is the focus of our work and always grounds us in what we were discussing a little bit of tonight's format. It's going to be a presentation with a Q&A session, the meeting we have running till 8 pm like last week. You know we ran over, given that we started a few minutes late and the presentation went long, so we can certainly stay on longer than eight and be flexible to extend our time to get more questions in during the presentation, all mics will be muted. By now, you have seen that the chat function will be disabled, not the entire time. Just during the presentation. This is after feedback from our prior two meetings, where a lot of people found the chat to be distracting during the presentation. We will re-enable it during the Q&A portion and during the presentation you can start submitting questions using the Q&A feature or emailing us at gowanasatplanning.new Yorkcity.Gov. As a reminder, you know we are all human beings and we deserve each other's respect. And you know this includes the chat during the Q&A portion. We ask that we keep it civil and really edify tonight and help each other learn more and ask questions the quick orientation for those new to zoom. Jonathan can I just jump in for one second, on that yeah on the chat point I would just as a point of reference I feel like people don't realize that, like that is recorded and like last time, people said stuff about you know nothing but drug addicts coming to live there, and things like that, so I would just recommend like when the chat does open up to not do that because, like that is public, and it's on our website, so I mean, if you I mean I, guess if you secretly or not so secretly, harbor pretty classist and, in my opinion sickening opinions feel free to share them, but they're gonna be made public. So just an FYI thanks, sorry to interject, no worries, it's a good reminder. Mike and the community board have done a great job. Sharing these out, the presentation will be shared out, the recording gets shared out and the chat transcript gets shared out as well through the community board's links and emails, and so a quick orientation in order to understand how you can get involved tonight. There are three symbols that you may use. We will be taking questions like I said through the Q&A feature, checking questions in our email, but also through a raise hand, function if you raise your hand and you're called on you'll need to unmute yourself with the mute unmute icon and when that is opened up. It'll be a first come first serve basis, otherwise you can start asking questions through email or that Q&A icon that you see below okay, so quickly before we get into the new stuff. There are new people, I'm sure that are on here and really quickly wanted to let people know. In October of 2016 we launched our study of Gowanus. We asked the community how we should go about that. We came up with a four plus year process. We held numerous meetings, both large and small, and the process led to the planning and land use framework that we released in June of 2018. That framework includes recommended land use, changes to be implemented as part of an overall Gowanus neighborhood plan. The draft zoning proposal that we crafted subsequent to the land use framework will enter into public review in January of 2021, but the framework also included goals and strategies in a number of categories, including those that we'll be discussing tonight: sustainability and resiliency, community and cultural resources and transportation. So first up sewers and drainage, and before I kick it over to my colleagues at the Department of Environmental protection. I just wanted to as a reminder, specific goal for improving capacity meet increased demand. Since we released the June 2018 framework, we have made progress on a number of fronts, including completing the first phase of high-level storm sewers along third Avenue, completing a major upgrade to sewer and water mains and the Gowanus IBZ along 9th street and 2nd Avenue, and progressing planning, design and property acquisition for the Cso facilities at the head of the canal. I'm going to pass it off to my colleagues, Angela Kada and Melissa Enoch, who will walk you through an exciting and critical piece of the Gowanus plan and they're part of the presentation and just a reminder. I'm going to be doing the slide. So when you're ready, just you know, tell me hello everyone. This is Angela Likada speaking, I'm a deputy commissioner with New York, City's Department of environmental protection. My role is quite broad here at DEP. One of the points that I concentrate on day in and day out is a sustainability agenda for the department, so I work across multiple bureaus. What we call operating bureaus those that deliver safe drinking water, those that collect our stormwater and wastewater and an operating bureau that is dedicated to wastewater treatment at the 14 wastewater control plants, and so please I'd like to focus on the drainage work that we have done for the environmental review. Of course, that chapter is very technical and will be much more complete than the time that we have allotted today to comb through. But we would welcome your comments as you receive the EIS go through the chapter, and you know obviously we'll obligated to do a response to common section, but we're very much looking forward to coordinating with the community and city planning on all aspects of the infrastructure chapter. As you know, we are responsible for a sewer system for the city of New York, one that is both combined, that's shown by the blue color, one that is separate, which means the storm and the sanitary sewers are separated with a dedicated pipe for each storm water and sanitary flow. That is the way to go. There's no doubt about it. That's how more newer modern cities have developed combined sewer systems, however, are a legacy item of the older cities. You'll find that in Boston and usually up and down on the northeast corridor. Some most of those cities developed with the idea that let's just get this sanitary flow and the storm flow off the streets and to a treatment plant. So that was more of a legacy system and then there's the pink shaded area, which is what we consider direct drainage areas that does not flow to a municipal pipe and that is managed by the New York state DEC, and we're very excited to talk to you and I'm going to turn it over to Melissa who has been spearheading what we refer to as a unified rule for our combined and separated areas, and we think this will have really tremendous benefits. It's a city-wide rule. So please keep that in mind. It's not something specific for the Gowanus, but it overlays very nicely on the Gowanus rezoning area because it really protects the benefits that we've accrued thus far from the Enviro to the environment, from our drainage issues. Okay, Melissa. Will you take it away? Please? Yes, thank you Jonathan, so I'm gonna jump into the specifics, as Angela said about the unified stormwater rule that DEP has been working on for the last two years before I. Do that I just want to give everybody a summary of the stormwater rule that we have in place right now for specifically foresight and house connections and show you this introductory slide on how it compares to what we're working on and we'll be releasing very shortly. So today, all sites that require a cider house connection proposal to the city. Sewer system have standards they have to meet. While there is no specific retention requirement, there is a detention requirement that requires on-site stormwater management to be managed based on a 10-year rainfall intensity and released back to the sewer system at a restricted release rate of 0.25 cubic feet per second, and that is based on a that release rate is based on a five-year peak intensity and that was back in 2012 what we considered to be optimal for sewer operations and peak flow reduction. So to date, since that rule has been in place, most of the compliance has been through detention systems. We have seen a fair number of blue roofs and green roofs implemented as a result of the 2012 rule, but not as much as we were looking for so fast forward to today. On the right hand, side of the slide, the unified stormwater rule is underway now, and it differs from the 2012 rule in a few key areas. One the first component is that sites that trigger twenty thousand square feet of soil disturbance or increase impervious area by 5,000 square feet are required to retain the water quality volume which in New York, is one and a half inches on the property on the site where it falls. In addition to that retention requirement, there are updated release rates. They are much more strict than they are today, and those release rates will apply to all sites regardless of soil disturbance. So any site that connects to the city sewer system will need to meet those new release rates and they are significantly increased. They're more stringent we've made a simple technical change to reduce the minimum orifice size that we will allow for detention systems that are used to meet this new release rate. That's giving some more flexibility for the development community and allowing them to manage the storm water in a way that is more cost effective in terms of the amount of space that a tank takes up so again, just want to highlight the new, unified, stormwater rule will affect all new and redevelopment sites that drain to a city sewer. So, regardless of lot size, all new development that drains to a city sewer is affected. The first component is going to be updates to DEP rules, chapter 31, which are the site and house connection permit requirements that I mentioned on the previous slide again. These requirements are in place today and they are in place to maintain optimal stormwater quantity and flow rates in the sewer system to help with that peak reduction, but they're being increased moving forward, and so that's going to trigger the sites that trigger that are all new construction additions, alterations and other agency projects. The second component is the new stormwater construction permit requirements. When you hear us talk about that lot, size, soil, disturbance of twenty thousand square feet or more or the addition of five thousand square feet or more of impervious area. This is the component that we're talking about so it's above and beyond that new release rate, and so this is the what we call the retention first requirement, which means, if you trigger this component of the unified stormwater rule, you must use green infrastructure to meet the requirements. The graphic on the right hand, side of this slide is showing you that projects that trigger both of the components of the unified stormwater rule will get credit for implementing green infrastructure. So you'll see that more clearly in a few slides, high level benefits of the unified stormwater rule from a resiliency standpoint, point we're requiring more on-site stormwater management for all new development that improves water quality. It reduces urban flooding, there's lower burden on our public infrastructure and reduced energy demands. We have projected 362 million gallons of annual cso reduction by the year of 2030, with the implementation of this new rule. That is helping us meet our green infrastructure program, goal of 1.67 billion gallons per year by 2030 and is a significant part of our plan moving forward. It also increases green space because of that retention first requirement and supports the 2019 climate mobilization Act on the right hand, side. We have some high level points on the process. We are allowing for more flexibility and design options than we used to. We have new guidance coming out. This is going to establish a new stormwater design manual. We have better formulas and an easier application for site connection. This is going to minimize the time for the development community and make the review side even easier on the DEP end of things, and then we're going to create more consistency across the sewer areas, which makes it easier for development to plan. You know how to implement stormwater management practices, regardless of which sewer shed. They fall in. So okay, there's a lot of info on this slide, so I wanna take some a few minutes to go through it really closely. This is a implementation scenario of how a site in the Gowanus rezoning area might comply with the unified stormwater rule. Dcp gave us this site as a typical lot to use. We did ask for a site that was large enough to trigger both components of the unified stormwater rule, because we really want to hit home on the credits that we're giving to redevelopment that chooses to use green infrastructure to meet both requirements. But again, just because we chose a 40,000 square foot lot doesn't mean that's the only property. That's going to trigger the rule. All of the properties will trigger the rule. This is just one that triggers both components. So we chose a fully constrained site. There have been a lot of concerns about how developers might meet the requirement if they have a complete lot, lined a lot line building. So that's what we chose here for a site like this. It would be very typical for a project to implement a green roof and a blue roof for their water quality component and then a detention tank for their sewer operations component. So this is a 40,000 square foot lot. It's in the command sewer area, it's completely space constrained. They are implementing a 28,000 square foot four inch deep, green roof along with a few blue roof drains on the rooftop. So under the current rule there would be no water quality volume requirement. So there's no retention requirement. In the current rule. The sewer operations requirement here would be managing 40,000 gallons in a detention tank at a release rate of 0.25 cubic feet per second fast forward to the new unified stormwater rule. This would require a 51 increase in the total stormwater management practice volume on this site, so the green roof, the blue roof. The detention tank collectively will manage 51 more than what's required today. In addition to that, which is probably the biggest win for this particular site, is that the detained volume so whatever is not being managed in Evapotranspirated from the green roof, is released back to the combined sewer system at a rate 63 percent slower than today? That is quite significant and again one of the things we did to help minimize the amount of space a tank is going to take up is reduce that minimum orifice size, so that allows for more flexibility. So essentially the takeaway here is that the new rule is going to require more on-site. Stormwater management, more stringent release rates back to whatever is going back to the sewer system, and it requires green infrastructure. So this is green, first detention last and then whatever you are sending back is significantly restrained. So the last note I'll say about this is that on the second to last bullet on the slide, we have a note that there's a credit given for the green and blue roof and that's applied to the tank, and that is something the development community has asked us for many years. They're willing to do green infrastructure. They want to do green infrastructure, but they want to see how they can apply, that volume that's being removed from the system towards a smaller tank, and we agree. So we found a way to make it work and that tank is getting an 18,000 gallon credit. So it's slightly smaller than it would be today simply because they're using green infrastructure. So next steps on our unified stormwater role, we completed our interagency technical workshops. In March, we worked with City Council to pass Intro number 1851 with which authorized the expansion of the water quality volume requirement from Ms4 to combine sewer area that happened in August. We've kicked off our industry and community stakeholder outreach and we're finalizing the draft rule for interagency review. We expect to release the draft rules and the draft manual for public comment through kappa in February and March, so we're excited to circle back to everybody and get out to the community boards and let everybody know about the rules when they're public so I'll turn it back to Angela. Okay, back to me, thank you, Melissa your leadership on this and sewer that take the flow to the treatment plants during dry weather all as well. When we get a certain storm events, we can still do that treatment at the wastewater plants. However, when we have those heavier rainfalls, we have the system overloading and relieving itself at these combined sewers. Maybe we should spend a little time for those of you in the community that don't really understand what a combined sewer is I know. Most of you are really quite exceed my expectations in terms of how much you do in fact understand these issues and you've provided invaluable. You know feedback to us on it, and we appreciate that one of the things that we have done over time is. We have kind of shifted from the idea that somehow the city could separate out all the sewers I'd hope to see that at one point in time, but not affordable in the short term, we have moved from the idea that we could just keep building sewers that are larger and get all of the flow to the treatment plants that would require us to build bigger plants, require more energy, more greenhouse gases and all the rest of it, and we decided and started to think really hard about. Well, we need private property storm water management. We need to kind of push and syndicate. If you will this burden for how to manage our stormwater and that's, why you hear about as Melissa reviewed the 2012 stormwater rule and now the new and improved 2021 stormwater rule. So that leads me to an analysis that we did of this rezoning action with two ideas in mind. One. We wanted to see the effect that our 2021 rule would have on the growth that would result from this rezoning and we wanted to ensure that the growth in the area, meaning the sanitary increase in flow, would not offset or would not create additional csos from overflowing into the Gowanus canal, because we have worked so hard already to reduce those csos into the canal, both with the efforts that DEP made prior to the Superfund program, with the two tanks that EPA is requiring, and so I know that most of you- and probably all of you, agree that we do not want to see any backsliding. So that was the goal in mind and when I review this slide with, you will see, although I can not see without my glasses that the projected development sites in the diagram to the right are in purple and the potential development sites are in the yellow, color and the black demarcation is of the resulting area. So we evaluated the effect of the rezoning on the infrastructure and we analyzed a future year of 2035 without the rezoning and with the unified stormwater rule and a condition in 2035 with the rezoning and the unified storm order rule. So we could see the impact that it was having. Let me review just some assumptions that it went to our analysis and modeling. We assumed conservatively that all of the lots connected to the combined sewer system. Now when I showed you, the opening, slides you'll recall that some of the lots in the areas that front our waterways in New York City are direct drainage. So in fact, some of those lots may actually continue to apply to the New York state DEC for direct drainage. However, for this analysis, we conservatively assume that they would all want to connect to our sewer system. We assume that 16 of the lots, the projected development sites, those in purple, are assumed to trigger the new site, connection proposal, House connection proposal, volume and flow requirements that Melissa reviewed with you and volume, and infiltration practices associated with the chapter 19 rule, and we assumed that 84 of the lots would be the smaller lots and they would be assumed to trigger only this out site connection proposal, House connection proposal. So again they would be the under 20,000 square foot, lots so important to note there would always be a control. It's just how much control it depends on how large the site is. Okay, Jonathan! Next, okay, here we go so we have predicted that the cso volumes to the canal will decrease with unified stormwater rule in place, because that management of the stormwater on those sites as they redevelop will offset the sanitary increases in flow. And again we are providing our assumption. So the rezoning is anticipated to add approximately 18,000 new residents and that would be predicted to generate approximately 1.253 million gallons per day of sanitary sewage, and the vast majority of that, as I had said earlier, would be transmitted to the water resource recovery facility. As we call our wastewater treatment plants these days and with the exception of certain wet weather events, when the facilities that we have in place, whether it be at the interceptor level or at the sewer level, would be overwhelmed with the wet weather event, then there would still be some additional cso into the Gowanus canal and, frankly, the only way to ever get to a zero on cso or 100. Cso reduction is to separate your sewers. So what we have identified through the analysis is that the anticipated unified stormwater rule is projected to reduce stormwater runoff to more than offset the sanitary increase by approximately 5 million gallons a year of cso reduction. So in my mind, I mean that's a number 5 million gallons a year, but that's just essentially equivalent and I'll. Show you a slide that shows that our storm event that we utilize is what we consider 1.66 inches of rain over a five-hour period. That's a pretty intense event and we are showing that the event would generate 0.3 million gallons of sanitary flow, the stormwater runoff reduction due to those lots being redeveloped and developing those stormwater management controls, either through the lower flow orifice or through tanks or through green infrastructure such as the Green Roof Melissa, was showing you would be about 0.9 million gallons, and so overall, net weather flow decrease would be a 0.6 million gallons. That's essentially what goes into the analysis, so the resulting does not affect the city's ability to meet the requirements of the rod. In fact, I will show you in a moment that we exceed the requirements of the rod already and we will not upset that reduction. Okay. This is just I, find it easier to kind of look at this and have a better sense. So we talked about the pre, what we consider water body, Watershed facility plans so, prior to the upgrades that some of you may be familiar with at the Gowanus canal pumping station, we had flows in the vicinia of 500 million gallons a year of cso into the Gowanus canal and without the tanks, but with the improvements that DEP made, which included the upgrade to that pumping station. That also included some additional fresh water flow that came through the Flushing tunnel. We included some green infrastructure and high-level storm sewers in the area. That is where we separated a portion of the flow that just falls onto the street in these high-level storm sewer. Only and we've maximized the extent that we can do that in this area. So you can see that we were able to reduce the flows into the Gowanus canal with those efforts to about 280 million gallons a year and then without the rezoning and with the tanks. We see a nice reduction again to roughly about a hundred million gallons a year and then our 2035 analysis with the rezoning. Even with that additional sanitary flow, we see a slight reduction as a result of all of that stormwater management that will be occurring as the lots redevelop. Please we changed the scale on this slide, so you should look and see that oh no! This is not that one okay, so the 20 35 without the rezoning again we're just blowing that up for you to see it a little bit better and the 2035 with the rezoning to me that that's a reduction but I consider it to be roughly equivalent and here's where we change the scale. If you look at the y-axis there you'll see that we start with 94, so you have a better sense of those volume reductions again. The modeling is predicting that 5 million gallon a year reduction and that's essentially where our numbers stand. Today you can see that the 2012 rule without the rezoning and the 2012 2035 with the rezoning and the 2012 rule. So if we didn't initiate this rule that Melissa spoke to you about today, you certainly would see an increase in csos to the canal. But because again, this is again just repeating ourselves. Trying to show you a different way so that folks can really wrap their heads around this, because it can be somewhat technical in nature because of that off site management of the storm water. That's happening on those private properties as they come for permits to redevelop. We are managing that flow. That is not going to be seen by the sewer system in the cases where it can not all be managed on site, either soil conditions or other issues or in the case where we have those smaller lots where you won't get the green infrastructure or the less than 20,000 square foot sites. What you will see is a smaller orifice, so that's what I would consider detention, not infiltration, and because of that, you were seeing that the 2035 with the rezoning and the unified rule has a reduction in flow. That's our 5 million gallon a year reduction, so I believe, let's see do we have one more slide. No I think it's back to me. Okay! Well, hopefully, we can get into a little bit of question and answer it's hard when it's not an interactive dynamic discussion, but I do appreciate everybody's time and I hope that was clear for all of you. Thank you Angela and yes, we're gonna get to some questions as soon as we can. I'm gonna get talk about the schools tool here and then our transit bonus quickly, so along with planning for storm water and drainage, we've also been working closely with our partners at the SCA and DOE on school planning. This is something we've been hearing about for a long time and since the beginning of the study- and it's also featured as a key goal and strategy in the framework chapter on community and cultural resources, but before getting into the zoning tool that we've created, it bears giving some background and basics on schools and Gowanus. The Gowanus rezoning area covers portions of three school districts. Community school district 15 covers the resulting area, covers portions of sub districts, 3 and 2, and also a small portion of community school district 15 sub district 1. The majority of the development anticipated in Gowanus is within Csd 15-3 about a third or so of the development lands in 13-1 and very little lands down in 15 3. Here's a picture of community district 15 from the D15 diversity plan. It stretches from downtown Brooklyn to sunset park. As you know, it's one of the most currently socioeconomically and racially segregated school districts in part due to the segregation in our housing stock. But it is important to note that you know key work has been done in the d15 diversity plan in the past couple of years, we're headed by the council members and the community boards and other organizations and the other year. The plan came out with recommendations for diversity and inclusion in the school district. We should also note that new housing in Gowanus, coupled with new schools, will make not only for a more integrated neighborhood but also a more integrated school system, so real quick. How are schools planned for in general? We got some of these questions the past couple years and so I figured to add a slide for it for the children to be produced. Income of school age there's a lot of there's a lot of monitoring and development trends that goes into school planning and once it's determined that a school need exists, the SCA and City act to provide seats and can do so in a number of ways through outright purchasing of property, to construct schools, leasing and renovating space or doing add-ons to existing schools. And here in the area, we have a couple examples: there's an add-on to Ps32, which also includes the underway school resulting process in the stand-alone school new school in the past decade, plus at Baltic and 4th Avenue. The Gowanus plan can help facilitate new schools through zoning that encourages developers to include new schools in their mixed-use developments. The zoning proposal will include a special district. We went into this the other a couple weeks. A month ago. Special districts allow us to create special tools and regulations that are tailored to the needs of the area in response to the anticipated need from a growing population. We've come up with a special tool, a school's zoning tool that allows the largest sites that can handle and accommodate a school in its base to exempt up to sixty thousand square feet of school space as of right on so along the canal, who are large enough to accommodate a school in their base building heights. The maximum heights could rise by four stories to accommodate that school without compromising the urban design principles that guide building forms along the canal. We do acknowledge that not all the sites in Gowanus are canal sites and some sites have unique programming or may have unique programming or site conditions, or they may assemble differently over time, and so we're also including a discretionary action whereby a owner developer may seek additional exemptions and height and envelope relief. This would require additional review from the community board and City Planning Commission to determine if the relief is necessary and appropriate. Also note a discretionary action includes its very own environmental review and public review process. Okay, moving on and remember, we will have questions and answers. You can email us or use the Q&A zoom function. I see. We have a number that have come in quick background and history on Gowanus, that's related land use policy is transportation policy and vice versa. They are inextricably linked. It's something that gets missed by many in the general discourse on transportation and infrastructure, but it really does need to be in underscored here. Gowanus historically was a naturally occurring mixed-use community. This led to a naturally walkable neighborhood, where people, homes and jobs were nearby as the heydays of the canal. As a working waterfront for Freight Wayne, the subway system was expanding and changing the face of the city and the neighborhood by 1950. The canal was handling a fraction of its previous freight volume. Structural changes like suburbanization and other global changes in production led to a decline in industrial activity throughout the city and around the canal. In up until about 1961, when the zoning resolution was updated, Gowanus was actually allowed to grow and evolve naturally, but in 1961 with that update, new residential was prohibited from being built next to the shops and businesses it had historically been allowed to do so up until that time. You know housing was built as it was needed next to the businesses and jobs. As you can see here, the neighborhood is well served by transit. The Gowanus rezoning would align the land use regulations with the transit abundance that this and nearby neighborhoods enjoy. As leading climate experts point out. If we're going to really tackle climate change and make our city more sustainable, we must make room for more people and do so in smart ways, proximate job centers, near transit and other modes of transportation. That's not to say that transit infrastructure does not need improvement. Today, additional population growth will need to be planned, for which is what we are here doing today. What we are talking about and what needs to be reckoned with, is that the transportation network around Gowanus can be leveraged for more people and jobs. A key place where subway improvements can be made is along 4th avenue. As a reminder, 4th avenue was rezoned in 2003 with no affordable housing incentives or requirements. As part of our proposal, we are proposing to increase the density along fourth avenue in order to get affordable housing requirements under the mandatory inclusionary housing program. As part of our original proposal, we shared in the spring of 2019. We are proposing transit, easement zones, which I'll get into a moment, but at our spring 2019 meetings, we also received requests from stakeholders and local elected officials to study whether we could include a transit bonus as part of the proposal we looked into this further and with some effort are including it into the proposal that will be certified in January of 2021, so, first up, transit, easement zones, the in yellow in the graphic, would extend 50 feet from a station envelope on fourth avenue. These three stations at Atlantic, Union and 9th street. All redevelopments within these zones will be required to work with the MTA and the city planning chairperson to determine if a volume easement is required before the department of buildings will issue any building permits. In practice. This looks like if a development needs an easement the size and placement would be worked out between the MTA and developer. The space would be dedicated for whenever the improvement can be made in the future through a legal instrument that runs the land, which is just a fancy way of saying it doesn't go away if the developer sells the property, so the transit bonus that we've worked on would be applicable to a 500-foot buffer from the station envelope along fourth avenue. The special district would allow the city Planning Commission through a discretionary action to increase the density and height up to 20 percent in exchange for funding and constructing significantly improved access like elevators and stairs, but it could be other improvements at subway stations along 4th avenue. We've also made it so off-site improvements can be made. We want to cast as big of a net to make sure the improvements are made, so a site does not have to be necessarily on top of the station where a new entrance can be built, but could fund and construct an improvement at a station on a different piece of land in exchange for that floor area bonus. So to recap, the Gowanus, rezoning and anticipated new development would mean a cleaner canal. The rezoning proposal would also support the creation of new schools as new homes and population increase, and the proposal would also encourage private developers to help build new transit infrastructure in return for an increase in floor area. So now before we head into a quick break as we get ourselves situated for the question and answer session, I just wanna make sure you're aware of the next steps we are planning to certify the rezoning in January. We also plan to come back to the community board for a MIH and affordable housing presentation that could very well be in January before or after certification and we're excited to be here again and take your questions, and so with that I will we'll take a five minute break and we'll be right back and while we get situated, we will put the chat back on. As we talked about at the beginning. That's okay: we've enabled people to raise their hands so start raising your hand. If you have a question and we'll start taking them in a first come first serve basis. I think we'll kick off with some written questions as people file in for the raise hands. Does that sound right to you, Alex yep, ready to go okay good evening? Everyone we've combined some of the questions that were similar, so they can be asked the same time. We'll start with some of the DEP questions, since they were earlier in the process and I'll do a couple at a time and then we'll switch back to attendees that have raised their hands and will go back and forth so first off for DEP. Can you clarify if the new rules only apply to new buildings and what triggers the new rules? And then you mentioned developer credits. Are these tax credits and can you clarify what those are hi sure I can take those I'm just looking for those one more time the can, you repeat the first part of it? Absolutely so. Do the new rules only apply to new buildings, oh right, and what triggers the new rules right? So, as I mentioned in my part of the presentation, there's two components to the unified stormwater rule so, depending on the type of activity being undertaken, a property will trigger one or both components. So if a site needs a new house or site connection, then it will trigger the site in-house connection modified rule and similarly, if it triggers twenty thousand square feet more of soil disturbance or increases impervious area by five thousand square feet or more, it triggers the second component of the unified stormwater rule so effectively for this area. Any of these projected redevelopment sites will, as long as they are draining to a city sewer, they will trigger either one or both of the unified stormwater rule requirements. So hopefully, that's clear and then the credits that I mentioned they're, not tax credits, they're their volume credits, so the way that our stormwater rags work today is that the way that they're written is primarily so that a developer can plan their site and know exactly how much stormwater they are releasing to the combined or separate sewer system and exactly which rate- and that is what they go ahead and plan for that certainty. They build a tank to manage that volume and that release rate back to the city sewer system. What we're doing in the new rule is we're, saying you still have to build a tank for your sewer operations requirement. But if you build green infrastructure in addition to that, you can downsize that tank. You can take credit for the volume, not all of the volume, but a portion of the volume that DEP feels comfortable is never going back to the sewer system because it's being managed either through infiltration or retention, and so therefore, that tank they're building is downsized to allow for that credit from the green infrastructure. So it's not a tax credit. It's a volume, credit and it's something that the development community has been asking us to do for a long time, because tanks do take up valuable, real estate space and we, you know, we acknowledge that they're not always being used to the full size requirement if they're doing some other practice on the property. That's removing stormwater from the site. So now there's a way to apply that. Thank you. Do a couple more for Dp then switch to hands up. So can you explain how the new stormwater rules will be enforced? And what happens if the green infrastructure is not maintained? Yeah, that's a good question! So again, two components to the unified stormwater rule, the component that triggers the water quality volume requirement that requires retention, has its own authority enforcement authority process and then the sewer, the site, connection and house connection requirement has its own enforcement process so for any green infrastructure. So for any site that triggers the 20,000 square feet or the 5,000 square feet impervious area added. The property owner is taking out a maintenance easement and they are getting a maintenance permit and they are certifying to DEP that the practice that they've implemented to meet their stormwater management requirements is functioning and they send that every year and they recertify it every three years with an engineer stamp and seal, and there is a fee associated with that maintenance permit and we have a review team. We also have an inspection team and we also modified our rules to give us the enforcement authority to get onto properties, to inspect the assets being constructed, and so that you know this there's a similar process in place for the site connection program. But at the end of the day, you, if you don't get your site connection, if you don't build your tank to meet your site connection requirement, you don't get your site connection and therefore you can't get your DOB permits. So it's that process is very clear in that you can't finish the construction of your project unless you meet the site connection requirements, so we feel very comfortable with the compliance under the new unified stormwater rule. Great Jonathan. Do you want to go to Han's hands up? Oh I'm on mute, yeah, let's go ahead! Amy. Are you ready, okay, yep, so the first person with their hand up is Jack Riccobono. You can talk now hi. This is Jack Riccobono from voice of Gowanus and I want to again thank the panelists for participating in this event and for their hard work on these issues. I know. You've obviously studied a lot about these issues. There's been a lot of talk about storm water tonight in particular, and gallons of storm, water and I. Guess you know for the community we're really concerned about health and safety issues and for anyone who has concerns about health and safety with this Gowanus rezone, we invite you to join us at voiceofgowanus.org, but I also just want to ask the panelists specifically about pathogens and fecal contaminants, because you know we're living in a pandemic right now, and the pollution in the Gowanus canal is. Unlike anything, you know. That's that commonly exists. I mean people have compared it to love canal, it is so polluted and the New York City is the number one polluter right now by dumping raw sewage into the canal, hundreds of thousands of gallons of raw sewage on an annual basis in violation of the Clean Water Act. So I'm just wondering there's been talk of this unified stormwater rule. What does it do to solve this long-term environmental catastrophe? Does it really substantially reduce the fecal contaminants that are flowing into the water that the city is responsible for, and can you speak to why the city has failed to build the federally mandated tanks and keeps pushing back their plans for actually building the tanks that would address this environmental catastrophe? Okay, I'll. Take that and I'll try to unpack what I heard, because I heard quite a few points there. First and foremost, it is really critical to look at various sources of pollution in the canal, and we are definitely you know a number one responsible for the sewer system that delivers the fecal matter to the canal. That's the bacteriological component, but the city of New York is not the number one responsible party for the coal tar and petroleum contamination issues in the canal. We have some responsibility for that, but we are not responsible for what constitutes and makes this a Superfund site. The cleanup of the tanks is to support the remedy. Is this: the site has not been listed as a result of the sanitary flow to the canal or all of our tributaries with cso discharges would be listed as Superfund sites they are not. Secondly, we are in compliance with the Clean Water Act and we are predicting that the and trust me I always want to say this: I'm not defending combined sewer overflows. They are egregious it's disgusting. I've seen them when they occur. I am not in defense of combines who are overflows. If, as a city, we could afford to separate the system tomorrow and we could handle that rate shock, I'm all for it. You know we want to rip up the streets and get that done. You know there will not be a cheerleader more aggressive than myself, but it's just not affordable. So we have to grapple with this issue and, frankly, we have to deal with it on these increments and we've been trying to deal with this as best we can throughout the entire city, where this occurs not just in the Gowanus area, because it is a problem everywhere. It occurs. So, just getting to your point, when we looked at the volume reductions in the combined sewer, overflow and I showed you, those blue bars before, and we're roughly predicting that as a result of that reduction in combined sewer overflow from the work that DEP has done together with the work that the EPA is requiring the additional requirements that we will be meeting on. A average geo mean basis. So not each and every time we have a hundred year, storm or 50 year, storm or a major event. That's going to lead to some additional cso overflows, but on average on most conditions we will not be triggering bacteria loads that are inconsistent with a primary contact or inconsistent with secondary contact such as how the canal is typically enjoyed by kayakers and boaters. So that's just really important to mention and we'll be able to produce that analysis in the is, but we have produced that analysis already, if you're interested in the public record on that there is some information already in the Gowanus canal, long-term control plan that is available on the dep's website, great okay, so the next person with their hand up is Owen Foote, I'm unmuting you now thank you. I was attending because I thought we were going to be talking about the infrastructure, I.e, roadways and traffic impacts on our neighborhood. As the city's aware, there are three or possibly four major transportation destination. Last mile warehouse is planned for Community, Board, six and beyond, and I don't understand. If the environmental impact statement is inclusive of that volume of traffic and also second I guess is: when will the actual map filing and discussion occur, or is that also part of the nine-month Euler process? Thank you before we, oh, and can you clarify that last part? When is the map? I'm sorry I missed that? Oh, and can you unmute yourself, sorry I? Is there a filing of the map in advance of the certification of the Euler or is it concurrent sure, can you elaborate on I'm not thank you Owen, I'm not understanding what you mean by filing the map. Do you mean the rezoning map, like the application, the street mapping of the New York City Map, and how that's I in my experience years ago, it was submitted to community boards for review in advance of the certification of the completion of the EIS I. Don't know if that's still the case, okay, so the map, the street mapping application, that's associated with the rezoning on, particularly that we discussed two weeks ago on go on a screen public place. Is that what you're referring to I think you need to unmute yourself again, sorry, I wasn't given an opportunity. Correct is the filing of the official map going to be reviewed in advance of the certification of the overall Euler rezoning sure, thank you and I'm sorry having to go back and forth on that. There's a lot of jargon in terminologies, and sometimes you have to take the time to make sure you understand each other. So sorry about that Owen Good, to talk to you and also everybody else- apologies for that back and forth. So yes, as we noted last two weeks ago, there are street mapping park, mapping and other actions related to the city map. Those do need to be filed before certification in order to allow for utilities and agencies to review them. Those maps have been filed, they were filed the other week and they will they're not referred out for official, like votes and comments or action necessary from the community board or others, but they it's a necessary minimum number of weeks. It can be a couple of months process, and so since we are identifying January for certification, we needed to file those maps which we have done and we anticipate them running with the overall rezoning when we certify them I think we can take the next yeah the next raise hand person okay, so the next person yeah, so the next person with their hand raised, is John Golden, I've unmuted, you, okay, hello! Thank you presentation, my the question with Jonathan covered the transit bonus, transit, easement I, don't see any benefit to what you discussed. It seems to have. Maybe I don't understand it, but it seems to affect construction in your subways. What I was looking for was adding more trains and buses to accommodate thousands of more riders, where how is this transit bonus, any improvement sure. So, thanks John I appreciate your question and comment. You know the transit bonus is focused on I, guess, I would say hard infrastructure, maybe not the I'm, probably not the transit geek that there are on this call, not necessarily the rolling stock or the line hall or the bostas per se. Those are you know different in terms of what zoning can really affect. What we have the ability to do is incentivize developers to fund and construct. You know hard infrastructure where people enter into the system. I mean what we know is that you know the particular Union Street is constrained. The stairwells are pinched and looking for ways that the private sector can help create. New improvements will be key as we're anticipating more population when it comes to buses and line halls for trains. Those are things that you know we will be looking at in the EIS and we will be sharing when we do certify this. The effect of additional growth and people coming living here, leaving what that means for peak periods of A.M and P.M and weekends, and we'll be able to share that and talk about what that looks like. As you know, different lines have different capacities and it's really in the details and the data that we will be sharing, but tonight was really just on what we can do in zoning to effectuate positive improvements to transit infrastructure all right, so the next person with their hand up is Andrea. Parker you've been unmuted hi thanks everyone for the presentation tonight and another question about the stormwater rule, and this is building on the some of the questions already about enforcement and the increased pathogens. I definitely appreciate the information that you shared tonight about the modeling work that you've done on how the stormwater rule would work in Gowanus, but I still have questions on how we will know if it's working, if it's just a model, so I guess my question is really how will DEP be following up with actual monitoring in the canal to ensure that it's working? Will the city install sensors on outfalls to measure the amount of cso? That's coming out. Do regular water quality testing report back to the community? What are the goals and strategies that the city will use to actually ensure? This is working okay, I'll! Take that hi Andrea! Thank you. So much for your question and I think there's a couple of ways in which we can really be certain that we're hitting the desired objectives here. One is that the department is typically doing. Harbor survey work as well as by the way we do some sentinel monitoring and what sentinel monitoring means is we go through and look at outfalls in general up and down the shoreline and I believe we get to every piece of the shoreline. Every three years, so that's certainly not as good as we'd like it to be, but it's pretty resource intensive I've done it myself. That allows us to look at not only the municipal outballs, but also other owl falls that are either on private property. Some of them are industrial, in fact, and we will report any you know what we see is maybe illicit activity to the state for enforcement. So that's a really good way for us to have eyes and ears on the water bodies, but with respect to our own harbor survey, we have stations in these areas and we will be collecting not just fecal data. We will be collecting dissolved oxygen data and some of the other parameters that really indicate the health of the ecosystem, both the health for human activity and also the health for the habitat that we want to encourage to either thrive or to actually return to some of these areas. Sensors at the end of csos, have been a terrible failure for us, our csos, the way they would built and the way the regulators were built. I'm not going to get into the details today, but they have not been accurate at all, and so, as you can imagine, during those very high flow conditions, it's pretty hard to get a sensor to withstand some of those conditions, but, most importantly, the way the Tide gates are developed and the way the regulators are put together with their weirs. We tend to get even tidal and wave action that misinterprets a cso event. So I haven't been very successful here, but there will be ongoing monitoring and that should be the short answer to your question, with respect to fecal and other parameters as part of our ongoing harbor survey monitoring and that is typically occurring at least once a month, particularly during the recreational season. Okay I think we're going to go back to written questions. Just a reminder. If you want to ask us a question: use the Q&A function or email us and I think some people are putting questions in the chat, but we are looking at emails and the Q&A for questions great thanks. Okay, these are going back to DEP now. So how much will all this new stormwater infrastructure cost, specifically associated with the new rules? Do New York City residents in the city, pay for this or do the developers? Okay, so with respect to the infrastructure that the city is installing designing and implementing, such as the two tanks that will be paid for by rate payers across the city? So there's about eight hundred and some thousand accounts, those will be responsible for paying what is predicted to be a 1.4 billion dollar program for the two tanks, as well as some additional infrastructure that the department is planning as part of its state of good repair, obviously, and as part of increasing level of service throughout the city. So we have some sewer extensions, very extensive extensions planned for southeast Queens, just as an example and there's other cso work that we will be doing so. We can plan for these improvements and to be quite blunt, as we plan for an absolute increase in water and sewer charges in the city. But the good news is I think what I was trying to get at earlier and I want to emphasize. Is that we're realizing that we can't do it all alone right? Private property in the city is about 50 of the land ownership believe it or not between the city ownership, Park, Snycha, schools, all the rest of it, it's roughly 50 50, so we need help from the private sector. We need them to do their utmost to manage their stormwater on-site to send us the minimal amount that they need to send us and, as we redevelop property in the city, that's exactly what you're going to get from this unified stormwater rule and that will be borne by the private sector and the private development will have to pay those costs. We don't see them as very large costs in terms of the percentage on the overall project. So we've looked at a couple of prototypical sites and we don't see it as a major undertaking, in fact we're not seeing much in the way of pushback from the development community at all. In fact, as Melissa said what they're really concerned about, is they don't want to be held up? They want to know that they're going to have an efficient process with us and that it's going to be a well-oiled machine and that they're going to be able to get their permits and proceed so we're up for that challenge from them and, as Melissa mentioned, I've developed a new group. That's going to be dedicated for this purpose, so I hope that answers your question. Thank you for the question. Thank you in clarification on I think this was raised during the presentation of the example. Will the green roofs be accessible to people and are these counted as parks and open space I think I can take? I can probably take that I. Don't know Angela if you have a an answer for that, but I think that's going to be largely up to I think the developers I think maybe Melissa probably has a lot more actually now that I'm thinking about it, Melissa probably has more experience with developers in their green roofs, but the last part in terms of, as are these counted as parks and open space no they're counted, as they typically are kind of amenity space for the private residents and they're not counted towards an official city capacity towards the neighborhoods acreage. If you will of open space I, don't think there's much to add. There I think that's right, Jonathan from our perspective, it's going to be up to that private property owner how they're going to allow access to their green amenities. Our green infrastructure program is pretty diverse at this point, so, for instance, when we put money into a school yard that school yard then is available for the neighboring community. We like to manage those school yards in a way that the agreement with the trust for public land and the city of New York is that they'll allow for the custodians to have overtime and to continue to allow the community to access the park amenities, but for the private sector sites we're not going to insist on that type of access right. Can you discuss the relationship between the rezoning and the new rules? The citywide rules? Are they tied together? Are they traveling separately sure Jonathan by all means, go ahead? No I was going to say if he could repeat the question because I misheard, the first part. It's can you discuss the relationship between the rezoning and the new citywide rules and are they tied together? Yeah I mean I can answer that, but actually I feel like that's Dep's wheelhouse. If you want sure the rule is independent of the rezoning, obviously we're pushing as hard as we can to get it in place. We gave you those dates and I have a paper. Here. We had to get authority from the City Council to develop the rule. We're now in the process of going through those rule, changes with the REBNY and other stakeholder groups and we're going through the process of what that new rule means to other city agencies that will also be regulated by the rule and we hope to have the final rule. Along with what is a very important companion document, which is the manual that tells you how the rules should be applied. Rules are only good if they're being followed and they're understood, so that manual is important, that we'll get to the law department this month and we're hopeful that the entire rule will be adopted by a March of 21 or spring of 21. yeah I, that's right. They have they work together. They have independent utility I. Think I would just highlight some things that I would you know related, but also very unrelated to the specific you know, rule per se, but this came up a number of times early on in our planning process in the working groups and elsewhere about you know, what's the where the benefits of a neighborhood study? What are the benefits of doing this kind of a process? And we've been working at this for years now, four years and we've been coordinating with the community listening hearing the concerns about growth and we've been working with our agency partners, including DEP, very closely. There are things that happen in a neighborhood plan that are directly related and respond to growth and they're like capital projects and other things that we'll probably get into during Euler and towards the end of Euler, but there's also something that's really special. That happens in these studies that take takes time and that's just the alignment and understanding between government agencies about what is going on in the community and having relationships with people and I. Think, while this is a city-wide rule, you know I believe Gowanus has had a you know, outsized effect on our ability to make this happen, as this is case in point how development will be part of the solution. You know, if you look at the surrounding communities in park, slope Wormhill, Carol, Gardens, that's where the sewage is coming into the canal and through new development in this role, we'll be able to make it cleaner and I. Think that was something that really was part of the long coordination that we had and was really helpful in moving both the rezoning and also the stormwater role together, even though they are of independent utility. Okay, thank you, Jonathan one more question and then we'll go back to the raised hands in one of the earlier charts in the presentation. The combination of the citywide rule and the rezoning showed a decrease in sewage and discharge. Is there a point in time that no sewage will be discharged into the canal in the foreseeable future? Unfortunately, I think the answer to that is no in terms of foreseeable. The way I'm looking at it. You know going out the 2035 we're still looking at cso events happening in the canal as a result of the fact that the sanitary and the storm travel in one pipe and that our intercepting sewers that take flow from our local street sewers to our wastewater facilities are not sized sufficiently that they can carry all of the flow from all of the uplands for treatment. Those treatment. We would probably need several more treatment plants and those treatment plants that are currently designed to treat two times dry weather flow would have to be upsized considerably. I'll tell you one very encouraging note, because our sanitary flow is generally under the rated capacity of the sewage treatment plants. When we can get the flow to them, they can sustain more wet weather treatment. So that is really good. If you look at the rated capacity, for instance, of a treatment plant, you will see that on any given dry weather day it does under that sanitary treatment. So then, when we do get a rain event, we can bring more storm water to those facilities. That is, why is another one of our sustainability initiatives and Jonathan's right I mean we're locked up with city planning all the time right, they're, looking at level of service and growth in these areas and we're trying to come up with the solutions that will enable that without again, any backsliding on the environmental gains that we've made and that's why we have these companion programs, known as like water conservation programs, the less water we use, the more capable we are of decreasing the amount of generated on a per capita basis or per person per day, the better able we are to utilize our existing facilities, and we should really in New York City, I'm not going to digress too far, but we should be quite proud of the per capita flow that we develop every day, because we are super tight. When we compare ourselves with any other major cities, we come out looking really good in terms of those. You know what we get, what we generate on a per capita basis. So unless you separate a sewer system, you will always have a storm event that will lead to a combined sewer overflow. If you get that big event, the 100 year storm you're, going to have that sewage come out on the canal. Great, thank you. So we're going to move on to the raised hands again. The next person to speak is Marlene. Donnelly you've been unmuted Marlene. Thank you Marlene. Can you help me yeah you're gonna hear me the concern that it's still very much here in the community that you're not answering at all by this presentation is the these lots that are your you've. Modeled are primarily we walk by them all the time parking lots the end of my block here. It's completely been a parking lot for storing on trucks and stuff. For decades they don't send any rain water into the sewer system right now. What they will be doing under the development plans is sending a lot of new waste into the system. So we are looking. We anticipate what will be the changes in the pathogen levels that are going to flow into the canal as a result of this that, if all you're going to be doing is adding more dirty sewage into the bond street sewer, what are going to be the changes in the content of those csos that do happen, even if they remain at the same level of volume, and particularly here on the west side of the canal, where there is no infrastructure work. How is this going to be managed, and please answer the question about that- was brought up at the Cag meeting last night about the constrictions in that bond street, sewer that run under public place site and how that's going to be managed? Okay, so thank you for your question. I'm going to answer the first part of it by repeating what we showed in our slides. We have generated the dry weather flow increases from the development lots that are predicted to occur by city planning, so any of the increases in growth that would lead to sanitary flow for each of those projected development. Lots was calculated and is considered at the same time we subtracted the storm water flows. That would be managed, utilizing the unified stormwater rule, and that is a net reduction, so that was our math, and that is the analysis and we tried to peel that back a bit tonight and show that in our slides there will be more detail about that in the EIS chapter and I believe. The second part of the question was about the bond Lorraine sewer. There is no work proposed currently for reducing the restriction in the bond Lorraine sewer. That is a very important project to get to at some point, but we anticipate that would be hundreds of millions of dollars and require several pump stations in order to resolve that flow constriction. That will not be exacerbated by the rezoning, but unfortunately we do not have plans at this point for the amending the drainage plan and again that really just comes down to the seriousness of that issue versus some of the other competing needs within the city all right. So the next person is Toby. Hyde you've been unmuted: oh no, okay, I'm gonna skip on to the next person. I'm gonna come back to you, Toby, there's something up in the back end here, so the next person is Joanna. Smith you've been unmuted hi good evening. I was hoping the EP could speak to actual numbers of cso events annually and whether they are rising or stable. I'm concerned about the modeling and how you know the recent changes in our climate might be impacting those models faster than we think and if you could shed any light on that. Thank you so much for that question. Just looking for some notes. Actually, I'm going to go off the top of my head a bit. So if you follow our long-term control program, that is our program. That is a city-wide evaluation of the combined sewer overflow issues and what we aim to do to reduce those combined sewer overflows. So when you look at that over time for the last about 10 years or so, we've spent over 4 billion on programs designed to reduce the annual volume of combined sewer overflow events and we've been able to move the needle. Pretty well I mean we're looking at somewhere in the vicinity of 75 capture for Csos, and we have, with the green infrastructure program, another 1.5 billion dollars that is being spent just on the green infrastructure. So we're looking at with all of that spending, combined about an 83 reduction in combined sewer overflows and with the new long-term control plans, also, the current capital projects that we would like to implement. We are looking at an additional 6.2 or 6.4 billion dollars of investment over the next 20 to 25 years that will be required and that will only take us to approximately 87 capture. So again, it's we're seeing some diminishing returns for our efforts, and that is because, as you start to get into the more and more you know less economy of scale, we've hit the locations where we can get major capture, and so we get a lot of benefit for the dollar spent. But as we get into as you can see on even on the Gowanus I believe there is 11 combined, sewer, owl falls and with the tanks we're hitting two of those apples. Previously, we've had a number of other outfalls and we're trying to tie in some additional outfalls under the EPA program to the two tank locations. That's o34 and owls had double o seven. Some additional apples will be connected there, but those incremental improvements get more and more expensive. I hope that answers your question with climate change. I should just touch upon that. We have really been looking very closely at the last 10 years of data or at least going up into I think it was the 2012 or 2015 event. So we've been what a lot of other utilities do is. They will weigh the rainfall for the last 50 years, so they treat the average rainfall for the last 50 years as if it's the indication of the rainfall that will occur in the future, DEP has done it differently. We have been waiting the more recent events about 10 years of data in a more recent history of rainfall and looking at what our program does with that type of rainfall event, we've even included a 2011 year, which was very indicative a very wet year, very indicative of what some of the projections are for climate change. So we have been waiting our more recent intelligence on wet weather events for our program. Compliance I hope that answers the question. I know this gets technical quickly. Okay, so I'm just gonna go back to Toby, so Toby I, unfortunately can't unmute you because you're on an older version of Zoom, and so I'm not able to do it. If you type out your question and put it in the Q&A section, we'll fish it out and then we'll read it in the next round of written questions, I'm so sorry, and so the next person, with the raised hand, is David. Briggs you've been unmuted all right. Can you hear me yep, oh great? Well, thank you for that presentation, good to see and hear everybody tonight. I'm gonna ask two or three questions and in the context of what I've been advocating for a long time, which is a phased zoning, I strongly believe that with Jonathan's presentation earlier on the special districts that each of them could have their own effective date and the reason I've been advocating for that is I think was made clear tonight. We have two models that are going to go into effect. At the same time, we have a model for zoning and a model for the unified stormwater rule and, at the end of the day, they're just that they're models and as the zoning gets built out and the unified storm water rule goes into effect. We're going to find out things, and it just seems to make all the sense in the world to me and others that the zoning is not just laid out all at one time, but actually is. It is phased in a way. So it can allow the infrastructure to keep pace with the new development which is necessary. So my questions are and I'm sorry if I missed this I was taking some notes, but I'm not clear in the presentation how the unified stormwater rule projections take into account the retention tanks that are going to be built in the city. I mean they're not going to be online for about a decade so I, just like some clarity on that and then second of all, I'm not clear how the transit easements are responding to the long-term impact of Mta's cutbacks and I believe the ones along fourth Avenue are really only going to be effective on the southbound traffic and not so much in the northbound traffic and generally, what is Dcp's assumption on how 20,000 people access mass transit. Given everything that's happened in the last year and particularly these cutbacks. Thank you sure. Thanks, there's I think three questions in there at least stick around David just so you can clarify if I actually just remind me of the questions honestly, because you asked a bunch so I think the first one I think I can handle and also DEP can correct me or help me if I'm off on anything. But you know to your comments about the zoning. Having you know, phase in periods. You know, I appreciate our back and forth on this for the past couple years as it relates to this particular comment, question on the stormwater rule and infrastructure catching up. You know I think, frankly, the what we're showing here is that the new development is part of that infrastructure, and that's not just the case for housing has infrastructure, but this is now the case also for storm water and that without the new buildings- and there are graphs we're showing it that you know that world actually without the new development will have more csos going into the canal. So the new developments from at least the sewer stormwater point of view is part of that infrastructure, and so I think this phased approach, I'm not quite seeing the connection there. The what's your second question that you had on the applicability of the transit bonus to portions of 4th avenue. Can you remind me again David? Well just go back to the first question. I just want to know how the retention tanks are built into the whole modeling, but then the transit bonus you're, proposing transit easements, but we have 40 percent cutbacks being proposed by MTA. Now, maybe that's a little bit steeper than it's going to be, but it seems like most of the transitions are really only going to benefit the southbound traffic along fourth Avenue, not so much the northbound traffic, where it's probably more needed, yeah. Well, the transit easements work, yes within the fiscal reality of the MTA that that's. That much is clear and we definitely need to shore that up and make sure that we have a rolling improvement ability across the city. I, don't know if that necessarily undermines its efficacy. I think having an easement there in perpetuity on a site is still a worthwhile zoning tool and particularly as the transit bonus I was pointing out. We're looking to you know, afford help to the city writ large for the private sector to help with some of that transit infrastructure and yes, I, jumped over the question. I think for DEP about the analysis of the tanks within I. Think the presentation and the data that was presented- okay, so we're gonna, move on to the next proof, I think D Angela. Did you catch that I? Think David? Do you want to rephrase it for DEP I? Think it's a straightforward question and I'm sorry I jumped around with this? Is what happens David when you have three questions, all right, you get it. You get a all over the place. So thank you restate the question for DEP sure and thank you for your patience with my questions. No I in the modeling as I understand it there's going to be a net zero result more or less by going to the new stormwater rule. So if that gets rolled out next year as presented then for the next 10 years, we're relying on that to diminish the csos into the canal and that that's fine, what I'm not clear on is what happens when the Cso retention tanks. This is the core of my question when the Cso retention tanks are built and operational and depending on who you ask it's somewhere between 2027 I, think we heard last night or 2028 from EPA and 2032 from the city are their capacity going to replace augment I mean how are they calculated in the reductions that were presented earlier? Okay, so they were considered part of the baseline. So the way we looked at our analysis as we did this snapshot of 2035 with a lot of the growth having occurred in the rezoning area and the tanks online. That was the assumption for the announce. That's how we set it up as projects get built over time, they will be offsetting the stormwater, that's on their own property, so we will accrue benefits as the rezoning redevelopment properties turn over and then the tanks will come online and do what we're expecting with the tanks. Online I believe, is about a 78 reduction in total to the Kiwanis area, to the Gowanus canal itself, and the Epa's range that was required as part of the rod was between 59 and 74 reduction in solids again, the Epa's reductions were not as a result of volume they're interested in the petroleum hydrocarbons that adhere themselves to the organic material in the combined sewer overflow. That is the requirement, and that is why circulars regulating the combined sewers they're not regulating the combined sewers because of the fecal matter. They don't have jurisdiction over that they're regulating the combined sewers because of the petroleum hydrocarbons that adhere to some of the organic matter, and we have, under the record of decision a requirement to reduce those part particles if you will, by a range of 59 to 74 percent, and we are exceeding that range with the tanks and then exceeding that even further with the rezoning properties turning over I hope that answers your question. Thank you very much great I think we'll go back to some written questions. I think we fished out. Toby's I also do a time check. It's two minutes to 8 pm we're happy to go over sometime and we'll keep taking questions, and maybe we can run down the folks on the raise hand, which would be great so Alex right, I'm going to go to a couple of other non-uh DEP questions for a second and then we'll go back to those. So the first question I think Jonathan. You can answer this one. How are sites determined to be projected for development and what is the timeline for projects of new development and those new resident estimates? I was frozen and then I was muted, and so that's how you don't get any answers. So I think the question was about: how do we determine projected development sites? That's right and then what is the kind of the timeline for those both developments and population? Sure I, it's very technical and you know the process can make your eyes bleed. So that's very fun. But what to give you maybe an illustration that can help? We basically are using a sieve. If you will, and at the very highest level, we look at every single lot in the neighborhood and then we start to whittle it down, based on standard assumptions, from development criteria and known proposals as well of developers, and we do legal searches and we basically look under every rock to basically come up with a list of soft sites that are most likely to develop. Given where we're proposing new density, where we're going to induce development- and we have that that's the universe of our soft sites and then we break those off sites into projected and potential development sites based on whether they're more likely to be developed, which goes into your second question, which is what's the time frame, because what's the time frame really has a relationship to what's most likely to be developed. So within our build year, which we have 15 years here for the foreseeable future, build your meaning. What can we reasonably analyze? We chose 15 for Gowanus, because there's so many other projects going on and because development is gonna occur over a longer period of time, as there's a lot of relationship to the other actions and so forth that are going on. So we chose that as 2035, and that is the anticipated arc of new development that would occur from the projected development sites that are most likely to be developed with that time frame how we divvy them up is outlined in all of our environmental review documents. You can read them right now. If you go on our website, the biggest stuff is also just like. Are they the lowest hanging fruit? Are they known proposals from developers? Have people come in and said, I want to develop this, and though there are some others that are in there as well. There are things like if they are, you know, city sites or other sites that would need discretionary actions. Those can be also pulled out or put into potential sites. So it's a very in-depth process, and probably you can hear from what I'm saying it's I've kind of gone on about something that people probably have heard nothing about, and it's something that we detail in our environmental review documents. So people can look at it and piece back the puzzle and understand where we're getting our projections from thanks and I'm gonna sneak another real, quick secret question in there, because I think it'll be very quick to answer. We talked about transportation or subways schools and storm water. Will traffic air quality and other environmental impacts also be studied and disclosed? Yes, they will I will say traffic, air quality, environmental, other environmental impacts will be studied, I think traffic, air quality and noise are really the bedrock of what seeker was supposed to be when it was created for actual public health impacts that would potentially harm people along with hazardous materials. There's about 20 chapters in total that we look at and we look at these across the board and we give our assumptions our methodologies. We determine whether there's an impact or not, and if there is an impact we identify, potentially what mitigation may or may not be likely, and we then continue that discussion with other agencies during the review process. Thanks. So now I'm going to go to the subway discussion, and this also responds to Toby's question lumped it in with a couple of others. Will the subway bonus only be available to sites directly next to a subway station, and can it be applicable to a larger area, since people can walk a block or two to the subway sure so can site? Can the bonus be applicable to a larger area? Is this a question of the buffer kind of just reading? Toby's question yeah. We chose the fourth avenue because it's a higher density district, the districts on either side of fourth Avenue, both in our re-zoning area, in some cases and also in park slope, our lower density district and such a bonus can't really be accommodated within the overall building height or, and it's also just not in keeping with the side Street built character in urban design. There we chose 500 feet because that is a nexus to the station envelope. That makes legal sense from that point of view. Instead of saying it could be anywhere, there needs to be a legal nexus for the bonus being near where the density would be ameliorated by the that new improvement. So it's really a legal thing that you know we were really adhering to and I think. The other part of the question is: why not make it larger and I think you know there's we have this question I think a year ago or so, and I think that there's a few answers to that I think the one that I posited that in that time and I think is appropriate. Now too, is that we don't just go into a neighborhood and say hey: let's do the highest density districts and the high in the highest height that you possibly can. We are careful. We are meticulous. We look at both the density that can be accommodated on sites, given the urban design, guidelines and principles that we come up with collaboratively with the community, but also what we believe will be satisfying to the policy goals that we have as a city, and so we really try to balance that where we have a housing crisis. But we also want to make sure that this is the appropriate scale for a neighborhood, and we chose our nr9a here instead of even going higher and so I think. What we're saying is, we think, not necessarily along the entirety of Fourth avenue, because this transit bonus wouldn't be every single development or every single lot can't partake. It has to be an improvement that improvement needs to be determined by the MTA, so it's only going to be maybe a handful of sites around the stations that, given that we believe 4th Avenue could handle on a couple sites the additional height and density. So we looked at this from a number of angles. Can you explain what the quantitative size of the bonus is, and does this also include allowable increase in building height yeah? So the quantitative size, I believe, is 20 percent I mentioned of the developer floor area. So you take the lot area and the development that can be produced. It's 20 of that and what we have in our. What we're proposing is that it would there would be a ratio of development, floor area increase and height. So if you go up so, if you have a 10 height, 10 density increase, you would also get a 10 height increase. They're related you need more height to fit the density. This is something we talked about a lot in the past about why we have the heights proposed on the canal and elsewhere. It's because density is like liquid, when you compress it in certain ways it goes up and you know you have to fit it somewhere and that's one of the reasons why we're keeping the 20 bonus of the height and the density connected. Thank you and I just want to say this is all really complex stuff and we're getting really complex questions, and so I think this is a great discussion. Yeah I love these questions. It's great to be able to answer them. It's awesome! Thank you! So here's a complex one for you on the schools. Can you explain what the square footage exemption means? Does that mean the square footage will be exempted when calculating the maximum floor area ratio for a development site that that's exactly right? It's. It is an exemption where you know I think, to take a step back the to give an example on the canal we're proposing five far. You know it's 4.4 is for residential and you can only get up to the higher density 5 if you include non-residential uses in the Gowanus mix that we've been working on with the community, the council member for quite some time. If you include a school, you can exempt that school size. So you would have a 5 far building if you're, including all of those uses, you would add a school on top of that. So, theoretically you could say you have a 5 point. Whatever far, let's say 5.3 I, it depends on the lot size what your far would be, but the 60,000 would be exempted from the overall floor area ratio for the site. Okay, I'm going to do one more question which is again related to storm water and then I think we're going to go back to people with their hands raised so for DEP. This is a question about the new rules. If a development can not meet on-site requirements, is there an off-site or in-lieu mitigation that is proposed? I can take this one. There is not an off-site mitigation opportunity at this time. We are. We've done a lot of analysis on this and set the rule up so that we know it's possible for every developer to meet the requirements on the property that the stormwater is falling on, and that really is in the best interest of the city for water quality objectives when a developer builds or tries to comply with their requirements using an off-site location, it's not always in their control. So, for example, if they are allowed to meet a portion of their on-site requirements in the right-of-way in front of their property, there is some risk in that stormwater management practice being damaged due to work happening in the roadway or just random, vandalism, or anything else that happens. So when we drafted the rules, we went forward with the a strict stance on requiring 100 on-site stormwater management and we think it's feasible and again, if you can't do a site-level practice like a rain garden, you are required to do a green roof and then, whatever is left over, you are required to manage in a tank with a new release rate that significantly slows that water down. So we think this is the right approach. Great thanks, Melissa I think what we're going to do since we're at 8:11. We have a number of people with their hands raised. There's a couple of folks. Who've already asked questions with their hands raised. I think what we're going to do is run down the list of people who are up when I started talking, and we can also, as we know that last time write us. Your questions, we will be posting them on our website once we can collate them and organize them. So folks can see all the questions that we've received in written form. So if you didn't get able, if you weren't able to speak or if we didn't get to your question, please write us and you know we'll post those as well. Thank you all right. So the next person, with their hand raised, is Daniel Wiley, you've been unmuted. Thank you. If you're screaming it's my three-year-old getting a bath and we're creating some gray water, I think so, with regard to the net zero cso into the Gowans canal goal and I think this goes to what Marlene was getting at. With her question about sewage, adding the sewage into the system. I think not all water is created, equal, so shouldn't brown, water be retained or detained, not just rain water. So, for instance, if it's inevitable that there's going to be cso events, the net zero is great, but those csos that are happening. The input from toilets and stuff from the very large developments will be contributing a lot of the brown water. So the tanks that are being built to capture overflows in those events- the 8 million gallon tank at Rh-34, which would go to the red hook, sewage treatment, plant and oh 007, which is we go to owl's head I, don't know that those caps are the csos along the whole length of the canal, but certain catchment areas so, for instance, public place site. Would those would one of those tanks capture that or, if not shouldn't they capture their? You know, detain their own and clean free? Okay, if you heard that Angela good to see you hi and nice to hear your little one in the background he's still awake, I guess: yeah I, don't disagree that it would be nice to get some additional called it gray. Water I call it black water, but black water, mixed with gray water. Black water, is what we consider what we do in the toilet. Gray. Water is what we consider comes out of the washing machine and the sink, and that thing, but that both of those things constitute what we call sanitary sewage and the department is looking at some additional credits for the water sewer bill. If you do some border recirculation devices we've been also working with the health department and nationally, particularly with California and some of the very drought kind of prone areas, to encourage some of this water recycling and come up with the right controls on those pipes on those lines so that public health is protected. We want to make sure that there are no situations where those lines get crossed with drinking water and or you know that they backflow in into the system. So those are very important issues that still have to be addressed, but I'm excited for what the future holds. There I believe there's a lot of modern and cutting edge technology. It's not something that we require on the city scale basis, yet because would require a lot of additional and investigators and standards. Frankly, that, probably the health department would have to promulgate to be sure that we could permit those types of facilities, but I don't disagree that that's something that in a modern world, at the cutting edge level that we can aspire to do in our future I as the sustainability person here, would definitely like to lean into that one. But we're not there quite yet. But thank you for that comment and well. Could I ask there's never like in the city? No one has septic tanks and septic tanks wouldn't be like a temporary detention of black water is not possible. We do have some septic systems in Queens and in Staten Island, where only when there's not a sanitary sewer fronting the property is that allowed that is permitted by the building department, and so that would be what is considered individual on-site septic systems and those limited circumstances. They do occur, they're, not wonderful, because they do have lifespans on them and you don't want to be in that period when the thing has gone bad and someone hasn't detected it. What we see with respect to that kind of on-site handling of sanitary- you know black and gray water is that typically in soils such as those surrounding iguanas, you probably don't have that separation from the groundwater table. You need a pretty hefty sand column in order to allow those septic systems and leachate fields is how they do them. Upstate to function properly, so they're pretty tricky systems to build in these types of soils. Great okay, so moving on to the next person with their hand, raised Mac Thayer you've been unmuted, hey. Thank you thanks. A lot just wanted to say, thanks to all the speakers for the presentations and info I, said a quick question about parks and open space. How do you guys feel about parks and green space as tools for storm water management, both in the long term and the short term too? I've heard some talk about like the 2035 number and a lot of long-term solutions for the cso issue, mostly for the short term, and what options may be available. Thank you. I can take that one. Well, you know, as far as the New York City Green infrastructure program goes, parks is arguably our greatest partner in stormwater management and in public property on-site stormwater management. So we have over 200 parks that we've partnered with them on with over 40 constructed sites where we've gone in and comprehensively retrofitted, the properties to manage stormwater and, in some cases, we're able to direct some right-of-way flow into those to take even more storm water out of the system and they've been a wonderful partner for us and for our 1.67 billion gallon per year target. So we'll continue to work with them. We have some ideas in this area to work with them on and we'll continue to pursue those properties all right. So the next person with their hand raised, is Baron, Bonnay or bonnet. You've been unmuted. Baron are you there yep you hear me. We can hear you okay, very good, okay, a couple things the city seems to be always decades behind any kind of infrastructure to support all of these developments and for various reasons, just because it's the city and also because of a lot of bureaucracy and lack of coordination between all different agencies, so because, in a case in point, I live across the street from Ps32. Their extension is 15 years behind the times and there's no discussion about police fire, because in the last 20 years that's been reduced in this neighborhood, and so my question is also regarding transit. The F train was never improved. Okay and there's talk about putting the express back, but that's the even the MTA has said. That's not enough capacity to deal with what's around here, so I just don't see how these developments are gonna benefit from all kinds of tax reduction and etc, but there's very little addition neighborhood, because by the time everything catches up with these developments, it's going to be 20 30 years down the line, and then, by the time it catches up, there'll, be more development and then we're always chasing our tail here and but developers always have the first dibs here and they can put up a building two or three years and everyone's happy, but nothing else, catches up with that, so I, just don't have this plan is dealing with that all right. So unless you have an answer for that, you know I, just don't see it thanks! Baron I think you got to a question at the very end about how does this plan dealing with that summarizing? A very long comment with a lot of different spokes along the way. I think the only way I can answer that would be to say that the purpose of working together over the past four and a half years is to come up with a comprehensive plan to deal with neighborhood growth and plan for growth in a way that can accommodate it and can respond to it and can monitor it and I think what you're seeing tonight is the beginning of that fruit, because we're showing what we can do in zoning to encourage key pieces of infrastructure and also how our relationships with other agencies can help influence policies that are beneficial for the community and growth as well, so I think very much we're responding to that through the framework and through their neighborhood plan, and look forward to being able to detail more of that in the coming months. All right, so the next person is Dan. Miller you've been, oh, so Dan the same problem that we had with Toby is present here. So if you can just type up your question and put it in the Q&A section, we can try to fish it out thanks Dan with that. Actually Alex. Do we want to take one more question from the written side before I think it's almost 8:30, and while we ask that question, maybe it'll give Dan some time to ask his question and then we can call it a night sure this goes to a question back to DEP. In the example used, you described a 51 increase in retention, for that example. Is that, like an estimation of 51 across all sites? Is that just an example? And do you have a range of the percent retention across the geography? That's a really good question. It is not a 51 increase across the board. It will go up or down depending on the size of the lot, whether or not the lot triggers one or both components of the unified stormwater rule and what sewage drainage area the practic the property is located in. So ultimately, the sites that trigger both components of the unified stormwater rule will have a significant increase in retention requirements, because today, they're not required to retain stormwater they're required to detain storm water and retain if they choose to so. If they trigger the water quality volume requirement, they will be retaining one and a half inches, and that is brand new. So that's a huge increase and then the other component is the 51 increase, was actually the cumulative total of the stormwater management practice volumes. So it was the blue roof, the green roof and the tank collectively that's 51 more and then the actual volume. The increase in volume that all sites will manage is based on a formula that uses the square footage of the property, so it's scaled and that was done intentionally to make sure that we weren't requiring too much storm water on very small lots or two less storm water on very large lots. So that's a long answer, but it varies based on the lot. Thank you and again awesome detailed questions from community. So this is the question that Dan Miller had asked, and it's now in the Q&A. So I was very disappointed to hear that the density bonus won't be applied along the entirety of Fourth Avenue. If that's not possible, what's the best way to ensure that it at least applies to the maximum number of parcels, can you work with the MTA to ensure that we get the most density possible thanks, Dan I, it's a great question, because it actually clarifies some things from the presentation and also the question we received and I answered previously. So we're talking about the area with on fourth avenue within our rezoning area, not all of fourth Avenue that goes down the length of western Brooklyn, so the what we've looked at and what we said is the buffer would be 500 feet. I. Think one of the questions is: why can't it be the entirety or 800 feet and I responded that there's a legal nexus that we're adhering to that? The density needs to be in a geographic area where there's a nexus for the amelioration of that density by the improvements at the subway stations. That said to your concern, I would just note that when we did overlay that 500 foot buffer, it does touch on most of our projected development sites that are on 4th avenue so from in terms of casting a wide net which I had described earlier is one of the things that we're really hoping to do. It is touching on some of the sites that, as I described before, what are projected development sites, they're soft sites and the most likely to be redeveloped. We are, you know, we're capturing those and I think you know you wouldn't get all that much more in terms of potential from extending it all the way. Instead, you would actually probably have a more of a legal issue by doing that. So thank you for that question and thank you for all the questions we've had tonight. It's 8:30. and we will, as I mentioned, be posting the rest of these questions on our website as soon as we can format them and condense them. There are some that are similar and we want to make sure that people are correctly attributed. So there's some work to be done. So we thank you all thank you for the panelists and for our colleagues at DEP. This was incredible. The questions from the community were extremely technical and detailed and, as Alex said a number of times, we appreciate those technical questions and also the DEP folks that were able to respond with such specificity on the technical side of the analysis. So we appreciate and happy to be here and we look forward to coming back as I mentioned. This is pre-certification meetings. We've come here three times we are moving into the public review period shortly in the next month and we will be coming back for many more meetings, and so this is not. This is just the precursor to those, and we hope that this really kind of roots you all and helps give you a foundation for asking even more questions on these topics during public review. So with that we'll say goodnight and we will talk soon, goodnight all.",
            "summary": "It was announced that, after four plus years of planning work, the Gowanus zoning proposal would enter public review in January of 2021 the community board and others requested.\nSpecifically, we will be presenting on sewers and drainage and how the Gowanus plan will support the creation of new schools and improvements to the area's transit network and infrastructure.\nI think that the broadly, if we get it right, the Gowanus neighborhood rezoning, offers us an opportunity to build a more affordable, more integrated, a more vibrant, more sustained, a sustainable community than the one we have today, but there's a really big caveat, which is that growth must come along with the infrastructure needed to sustain it for new families and businesses who would come, but also for all those of us who live and work here.\nBut the ones that are already here, because we already have some overcrowded schools and some transit policies to make sure that we have the subway access and the buses that we need to nurture our families for a long time to come, It I'll, just say one thing here that I know.\nLook, that just like it's important to me and to you and to the community that there's no additional csos in the canal that we make it cleaner to protect the remedy of the dredge and those tanks that are getting built.\nThat they're, going to look with real hard scrutiny at the new stormwater rule at the data that's being presented tonight and tell us what they think about it, and that's one of the great things actually about the super fund is that it brings the EPA in as a real guarantor of the canal.\nYou know judgment or whatever of this, not whatever our final position on this in the end will be determined by the content, and we are looking forward to what's there tonight, because obviously the csos and infrastructure have been a major issue.\nWe released the June 2018 framework, We have made progress on a number of fronts, including completing the first phase of high-level storm sewers along third Avenue, completing a major upgrade to sewer and water mains and the Gowanus IBZ along 9th street and 2nd Avenue, and progressing planning, design and property acquisition for the Cso facilities at the head of the canal.\nWe would welcome your comments as you receive the EIS go through the chapter, and you know obviously we'll obligated to do a response to common section, but we're very much looking forward to coordinating with the community and city planning on all aspects of the infrastructure.\nAs you know, We are responsible for a sewer system for the city of New York, one that is both combined, that's shown by the blue color, one that is separate, which means the storm and the sanitary sewers are separated with a dedicated pipe for each storm.\nAnd I'm, going to turn it over to Melissa, who has been spearheading what we refer to as a unified rule for our combined and separated areas, and we think this will have really tremendous benefits.\nDo. I just want to give everybody a summary of the stormwater rule that we have in place right now for specifically foresight and house connections and show you this introductory slide on how it compares to what we're working, on.\nThe first component is that sites that trigger twenty thousand square feet of soil disturbance or increase impervious area by 5,000 square feet are required to retain the water quality volume which, in New York, is one and a half inches on the property on the site, where it falls.\nThat's, giving some more flexibility for the development community and allowing them to manage the storm water in a way that is more cost effective in terms of the amount of space that a tank takes up.\nSo again, just want to highlight the new, unified, stormwater rule will affect all new and redevelopment sites that drain to a city, sewer.\nThe first component is going to be updates to DEP rules, chapter 31, which are the site and house connection permit requirements that I mentioned on the previous slide.\nThese requirements are in place today and they are in place to maintain optimal stormwater quantity and flow rates in the sewer system to help with that peak reduction, but they're being increased moving forward, and so that's going to trigger the sites that trigger that are all new construction, additions, alterations and other agency projects.\nThis is the what we call the retention first requirement, which means, If you trigger this component of the unified stormwater rule, you must use green infrastructure to meet the requirements.\nHand, side of this slide is showing you that projects that trigger both of the components of the unified stormwater rule will get credit for implementing green infrastructure.\nSo you'll see that more clearly in a few slides, high level benefits of the unified stormwater rule from a resiliency standpoint, point we're requiring more on-site stormwater management for all new development that improves water, quality.\nThis is going to minimize the time for the development community and make the review side even easier on the DEP end of things, and then we're going to create more consistency across the sewer areas, which makes it easier for development to plan.\nWe did ask for a site that was large enough to trigger both components of the unified stormwater rule, because we really want to hit home on the credits that we're giving to redevelopment that chooses to use green infrastructure to meet both requirements.\nIt would be very typical for a project to implement a green roof and a blue roof for their water quality component and then a detention tank for their sewer operations.\nThe sewer operations requirement here would be managing 40,000 gallons in a detention tank at a release rate of 0.25 cubic feet per second fast forward to the new unified stormwater rule.\nThis would require a 51 increase in the total stormwater management practice volume on this site, so the green roof, the blue, roof.\nIn addition to that, which is probably the biggest win for this particular site, is that the detained volume so whatever is not being managed in Evapotranspirated from the green roof, is released back to the combined sewer system.\nEssentially, the takeaway here is that the new rule is going to require more on-site, Stormwater management, more stringent release rates back to whatever is going back to the sewer system, and it requires green infrastructure.\nThe last note I'll say about this is that on the second to last bullet on the slide, we have a note that there's a credit given for the green and blue roof and that's applied to the tank, and that is something the development community has asked us for many years.\nIn March, we worked with City Council to pass Intro number 1851 with which authorized the expansion of the water quality volume requirement from Ms4 to combine sewer area that happened in August.\nWe, have kind of shifted from the idea that somehow the city could separate out all the sewers I'd hope to see that at one point in time, but not affordable in the short term, we have moved from the idea that we could just keep building sewers that are larger and get all of the flow to the treatment plants that would require us to build bigger plants, require more energy, more greenhouse gases and all the rest of it, and we decided and started to think really hard about.\nWe wanted to see the effect that our 2021 rule would have on the growth that would result from this rezoning and we wanted to ensure that the growth in the area, meaning the sanitary increase in flow, would not offset or would not create additional csos from overflowing into the Gowanus canal, because we have worked so hard already to reduce those csos into the canal, Both with the efforts that DEP made prior to the Superfund program, with the two tanks that EPA is requiring, and so I know that most of you.\nWe assume that 16 of the lots, the projected development sites, those in purple, are assumed to trigger the new site, connection, proposal, House connection, proposal, volume and flow requirements that Melissa reviewed with you and volume, and infiltration practices associated with the chapter 19 rule, and we assumed that 84 of the lots would be the smaller lots and they would be assumed to trigger only this out site connection, proposal, House connection, proposal.\nNext, okay, Here we go, so we have predicted that the cso volumes to the canal will decrease with unified stormwater rule in place, because that management of the stormwater on those sites, as they redevelop will offset the sanitary increases in flow.\nThe rezoning is anticipated to add approximately 18,000 new residents and that would be predicted to generate approximately 1.253 million gallons per day of sanitary sewage, and the vast majority of that, as I had said, earlier, would be transmitted to the water resource recovery, facility.\nWhat we have identified through the analysis is that the anticipated unified stormwater rule is projected to reduce stormwater runoff to more than offset the sanitary increase by approximately 5 million gallons a year of cso, reduction.\nThat's a pretty intense event and we are showing that the event would generate 0.3 million gallons of sanitary flow, the stormwater runoff reduction, due to those lots being redeveloped and developing those stormwater management controls, either through the lower flow orifice or through tanks or through green infrastructure such as the Green Roof Melissa, was showing you would be about 0.9 million gallons, and so overall, Net weather flow decrease would be a 0.6 million gallons.\nWe talked about the pre, what we consider water, body, Watershed facility plans, so, prior to the upgrades that some of you may be familiar with at the Gowanus canal, pumping station, We had flows in the vicinia of 500 million gallons a year of cso into the Gowanus canal and without the tanks, but with the improvements that DEP made, which included the upgrade to that pumping station.\nThat is not going to be seen by the sewer system in the cases where it can not all be managed on site, either soil conditions or other issues, or in the case where we have those smaller lots where you won't get the green infrastructure or the less than 20,000 square foot.\nIt is important to note that you know key work has been done in the d15 diversity plan in the past couple of years, we're headed by the council members and the community boards and other organizations, and the other year.\nThere's a lot of monitoring and development trends that goes into school planning and once it's determined that a school need exists, the SCA and City act to provide seats and can do so in a number of ways through outright purchasing of property, to construct schools, leasing and renovating space or doing add-ons to existing schools.\nAll redevelopments within these zones will be required to work with the MTA and the city planning chairperson to determine if a volume easement is required before the department of buildings will issue any building.\nThe space would be dedicated for whenever the improvement can be made in the future through a legal instrument that runs the land, which is just a fancy way of saying it doesn't go away if the developer sells the property, so the transit bonus that we've worked on would be applicable to a 500-foot buffer from the station envelope along fourth avenue.\nThe rezoning proposal would also support the creation of new schools as new homes and population increase, and the proposal would also encourage private developers to help build new transit infrastructure in return for an increase in floor area.\nAny of these projected redevelopment sites will, As long as they are draining to a city sewer, they will trigger either one or both of the unified stormwater rule requirements, So hopefully, that's clear and then the credits that I mentioned they're, not tax, credits, they're, their volume credits.\nSo the way that our stormwater rags work today is that the way that they're written is primarily so that a developer can plan their site and know exactly how much stormwater they are releasing to the combined or separate sewer system and exactly which rate.\nYou can take credit for the volume, not all of the volume, but a portion of the volume that DEP feels comfortable is never going back to the sewer system because it's being managed either through infiltration or retention, and so therefore, that tank they're building is downsized to allow.\nIt's, a volume, credit, and it's something that the development community has been asking us to do for a long time, because tanks do take up valuable, real estate space and we, you know.\nWhat happens if the green infrastructure is not maintained, So, again, two components to the unified stormwater rule, the component, that triggers the water quality volume requirement that requires retention, has its own authority enforcement authority process and then the sewer, the site, connection and house connection requirement, has its own enforcement process.\nYou can't finish the construction of your project unless you meet the site connection requirements, so we feel very comfortable with the compliance under the new unified stormwater rule.\nI mean people have compared it to love canal, it is so polluted and the New York City is the number one polluter right now by dumping raw sewage into the canal, Hundreds of thousands of gallons of raw sewage on an annual basis in violation of the Clean Water Act. So I'm, just wondering there's been talk of this unified stormwater rule.\nI definitely appreciate the information that you shared tonight about the modeling work that you've done on how the stormwater rule would work in Gowanus, but I still have questions on how we will know if it's working, if it's just a model, so.\nWe need them to do their utmost to manage their stormwater on-site to send us the minimal amount that they need to send us and, as we redevelop property in the city, That's exactly what you're going to get from this unified stormwater rule and that will be borne by the private sector and the private development will have to pay those costs.\nWe like to manage those school yards in a way that the agreement with the trust for public land and the city of New York is that they'll allow for the custodians to have overtime and to continue to allow the community to access the park amenities, but for the private sector sites we're not going to insist on that type of access.\nI. Think I would just highlight some things that I would you know related, but also very unrelated to the specific you know, rule per se, but this came up a number of times early on in our planning process in the working groups and elsewhere about you, know, What's the where the benefits of a neighborhood study.\nYou know, If you look at the surrounding communities in park, slope, Wormhill, Carol, Gardens, that's where the sewage is coming into the canal and through new development in this role, we'll be able to make it cleaner.\nAnd please answer the question about that- was brought up at the Cag meeting last night about the constrictions in that bond, street, sewer that run under public place site and how that's going to be managed.\nSo we're looking at with all of that spending, combined about an 83 reduction in combined sewer overflows and with the new long-term control, plans, also, the current capital projects that we would like to implement.\nThis I was taking some notes, but I'm, not clear in the presentation how the unified stormwater rule projections take into account the retention tanks that are going to be built in the city.\nYou know, I appreciate our back and forth on this for the past couple years, as it relates to this particular comment, question on the stormwater rule and infrastructure catching up.\nYou know I think, frankly, The. What we're showing here is that the new development is part of that infrastructure, and that's not just the case for housing has infrastructure, but.\nSo, the new developments from at least the sewer stormwater point of view is part of that infrastructure, and so I think this phased approach, I'm not quite seeing the connection there.\nWe've done a lot of analysis on this and set the rule up so that we know it's possible for every developer to meet the requirements on the property that the stormwater is falling on, and that really is in the best interest of the city for water quality objectives when a developer builds or tries to comply with their requirements using an off-site location, It's not always in their control.\nYou can't do a site-level practice like a rain garden, You are required to do a green roof and then, Whatever is left over, You are required to manage in a tank with a new release rate that significantly slows that water, down, Great, thanks.\nI think what we're going to do is run down the list of people who are up when I started talking, and we can also, as we know that last time write, us.\nWell, you know, As far as the New York City Green infrastructure program.\nWe have over 200 parks that we've partnered with them on with over 40 constructed sites where we've gone in and comprehensively retrofitted, the properties to manage stormwater and, in some cases, we're able to direct some right-of-way flow into those to take even more storm water out of the system."
        }
    }
}