{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UC0eHT9Wk9HHqj0MW8EA-3kQ",
            "title": "Brooklyn Community Board 10 Zoning and Land Use Committee",
            "publishDate": "2020-04-06",
            "shortDescription": "Brooklyn Community Board 10 Zoning and Land Use Committee Meeting\\nMonday, April 6, 2020\\n7:00 PM",
            "lengthSeconds": "1:17:18"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "6obxVD22yXk",
            "fillerWordCount": {
                "uh": 2,
                "um": 0
            },
            "readTimeFullTranscript": "32 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "cafe": 48,
                "building": 31,
                "zoning": 30,
                "uses": 29,
                "feet": 19,
                "buildings": 19,
                "street": 15,
                "door": 14,
                "height": 14,
                "restaurant": 13
            },
            "wordCountSummary": {
                "zoning": 8,
                "uses": 8,
                "building": 6,
                "street": 5,
                "buildings": 5,
                "cafe": 4,
                "kind": 4,
                "height": 4,
                "stories": 4,
                "type": 3
            },
            "fullTranscript": "I order and a full- service italian restaurant 118 at the corner of one hundred and First Street and four damn you we've been in business at this location for almost three years. We currently have an enclosed license at the location for the employed cafe. We would be using seven feet, four inches of the sidewalk, which is two inches more than we're currently using when the unenclosed cafe. We would have 19 tables and 38 seats in the enclosed I think the current unenclosed cafe has more seating and as 22 tables and 44 seats, the entire cafe would be on 4Th Avenue, just like the unenclosed. At this point we have approval from the Department of City Planning, and the application now goes to the Community Board and, as it makes its way down and he'll go to the Department of Buildings, already we'll be looking at all plans to make sure everything's legal and it may be changes by them and we're here to talk about the cafe with Joseph. He told you earlier today you do not have any. It does not say that you have no. This is the enclosed sidewalk cafe application. We do have a non enclose cafe, meaning the unenclosed cafe are just seats and tables that are out on the sidewalk way to describe it. They're open to the sky in closed, cafe, I sense, some type of rendering of what doing and the enclosed cafe is actually a built structure with a roof on it. Walls and I'll have opening windows, but the owner, Joseph who's Ilana's can explain what the enclosed structure would be. He made it yeah, so if I could just jump in for a second nice to see some of you again, we've been I think I've been to community board previously I own Positano as well as Campania. We did have a meeting regarding Positano and the outdoor enclosure, which was a while back I, do not know the exact date, but it's true that we had was that we did not close that with bad weather or has it got colder, and we realized that we did not for the right permit at that moment. So we've been going at this for a year to sort of remedy the situation and what we did have was an outdoor cafe that we enclosed, which is not really how that permit, could be applied, so weary applied for a permit to have to be able to have that same outdoor cafe, but also enclose it with bad weather or temperature, not being so ideal. So that's the Desta thought. That's what precipitated the change in the application requirement. Some of the other questions were you're. One of the things I do not understand. It's a bit peripheral that you show something about the tree wills. Yes, so d, he pits around the trees are slightly elevated, so we would just have to be eight feet away from them and I do not know if the plans are available to everybody, but there's radius measurements on the plans that just show that we're eight feet away from the trees put paving stones on them. Yes, okay, I'm, sorry, yes, so they'd be flat. Paving stones also put around the trees. This way anybody walking by would be able to walk on the paving stones. Well, sometimes paving stones become problematic, because that's the tree roots change, yes, and it also decreases the nutrients. Do not do the trees, no I know we me and Joseph talked about this we'd have a professional gardener doing that, and also why no trees to make sure this does not happen. The other thing that can be done is a metal not raised. It could not be raised because we have to keep it quiet like a great yeah, okay and it has more openings more water to get in as the tree grows with the roots. I think the grade would be not as good as the plant flat paving stones, but if we kept to a person- and we would keep an eye on to of course watching the tree grow- we'd be changing flat, paving stones as it went along. Another question that was raised was that you use La Valle parking surface. Yes, sure clearly shows parking. Signs are in the driving way. That is not permitted and it's not unusual to be three to four cards lined up on forth and waiting to be moved and probably about it was even a car. This is yes, spoke with Joseph about it before if Joseph. If you want to yeah how recent the picture is and not you know, obviously we have issues with parking. You know in the neighborhood we try to. We try to address it by increasing I. Believe I spoke to a community board. They sent me a letter and I called and I'm, not sure who I spoke with at that point. I realized that it is an issue. So it's like it's sort of a catch-22, not necessarily Catch-22, but you know there's not much parking. They put the sign out the sign being out somewhat of an issue because they use it to sort of block a spot. So we tried to now. You know we explained to them. That obviously can not do that. We increase the amount of attendance when we see that it's going to be busier than usual. There are times that were abnormally busy and it becomes a little bit backed up. We try to park the cars as quick as we can. You know it's I'm, not denying you know. There's moments, I'm sure that this car's double- parked there, but we try doing our best. We do address it. You know the police department comes by and we do realize it's an issue. You know we definitely do not want to cause an obstruction. It's a little bit of the nature or the beast of the restaurant. Is that just you know if you have a table o'clock, seven o'clock, Saturday night, there's just a lot of cars that come it's hard to handle that all at that moment. Well we're trying to by increasing the attendance we're doing a better job I feel at it is their work. I'm sure there is I mean you could do know a little more. You I know you're very aware, but what well yeah I mean just recently, you could see what happened that was due to speeding. You know other things, but no it listen. It definitely is my concerns. Not only for people enabled parking also for the attendants being in the street there, it's dangerous for them as well. To sort of have these cars double- parked getting in the car. You know in a passing lane, there's other risks involved that I would like to avoid. You know start from the community reason the people are actually working. You know not to create more of a hazard than necessary when they're trying to do that. Job. Okay, so I got a question. So the think it's going to be you're, going to switch back and forth from being an open cafe to a closed cafe. Depending on the weather. We have some pictures, some ideas of a type of enclosure. We would use it's sort like a trifold like you have the picture, be a permanent structure, but what will happen? Is the windows will be opening up so give me the feel of a non enclosed cafe there, especially during the nice weather, but it also has the ability totally self- enclosed. So it would be something along the lines of this demonstration here. Pretty much like a trifold window looks like this closed drops down to street level, creates like sort of a barrier also in between the restaurant and the sidewalk, but got ta be open. Obviously, on top of this is open as far as the roof goes, whether or not that abhi retractable opened or closed. I really I really do not know the honestly. You I really have not got to that point. Yet. We've been so long at this trying to get this done. I do not necessarily want to put the cart in front of the horse. You know so we're waiting, obviously for this to go and then we're working I'm working with them. This company, in particular to do an enclosure in Staten Island, another Campania that we're putting, but it's know something more. It's a nice sleek looking design, that's something you would see typically like a fruit store or something on the corner, something more modern. Looking you know: LED lights, built into the rules. So that's the architects rendering. If you look at the bottom of the plans on the left side, they'll say one foot Max: would that be a solid piece of the enclosed Jefe we've be there and at this point that's the other closed cafe is the access to the fire escape when it was 101. There is access now, I believe the same cut out that 101 had there's also there's a cutout also for the fire escape to drop through it's a Velcro dress. It's a piece of canvas, that's like velcro, it's I do not know the exact dimension. It's a you see at the base of the ladder you get sort of yeah, so I'm, not even sure I'll, be honest with you, I'm, not sure how far out from the building that is, the enclosure might very well be within that Mic I'm sure we could clarify whether or not it is what I've seen with you in closed cafes, as the latter is built a little differently. So we would have to do that and we'd also have to get approval from the Department of Buildings. To have this witty ladder would come out at a slight angle. So it hit the sidewalk and it would rest against the actual enclosed cafe of it, but that's going to have to be quite as calm in the building they're going to be looking for a safe first. But if it's necessary, we do not have that exactly and how far out is the thing they enclosure comes out seven feet: four inches: okay, using the hand raised Oh using a hammer I how much concrete sidewalk is there between the outside face of the cafe and the edge of the actual concrete, not paver is not tree bed flat, concrete, yes, partition to the to the well of the tree. I thought I thought you were counting just the distinctive pavers of the well in the 8 feet. I know dat tree I'm. Sorry there is. They have used to 8 feet of flat concrete before the yes night, Oh distinctive in that, in that demand there is, there would be some papers in the a thief okay. So what is the dimension of the flat concrete from the place face of the wall to the start of the distinctive pavers concrete along, be to the cafe? It's about nine feet so from here. The flat concrete is about 7 feet, 7 feet. Yes, what is it now between the open, sidewalk cafe would be an additional 2 inches. The open, cafe, 7 feet, 2 inches the enclosed cafe would be 7 feet, 4, inches, ok and then you said that extra foot would actually be distinctive papers in the in the in the tree. Well, yeah landscape maintained as flat. Thank you yeah. Yes, Mr. LaRocca before you had a unenclosed sidewalk cafe, you were operating a none, enclosed sidewalk cafe and you did it for quite a while and I recall that when you applied for it, we asked you about that and you really did not have an adequate explanation. My question for you is that if you ignored the rules back then why should we believe that you will abide by the rules now? Oh well? Okay, so yeah I do recall that we were working with the outdoor cafe from previous restaurant 101. My partner at the time fell to file the renewal for it. That was what made it was, what made it illegal since then, we've had this meeting and we rectified it by applying the proper way to get the outdoor cafe realizing now that we applied for the wrong permit, because we'd like to keep a year round that issue came up before the community board. We pulled it down to adhere to the Community Board and the law, and now we're reapplying again. So we went the whole winter without an outdoor cafe. Without that space you know because we did not have the permit for it now. I were trying to do it. You know we have been trying to do it and we're going to continue to try to do it. The proper way I mean this is the way. This is the proper way we're not trying to do anything. If you go there now, there's no outdoor well, actually, now legally we could have an outdoor cafe weather permitting. So if the weather is permitting, you would see chairs and they'll be there were tables, they would be there within the law within the, but while you applied for it, you continued to operate it. Despite the fact that you advised that you should not so my question again is that since you did not listen to us the second time, why would we believe that you're now going to operate properly? Well? I mean I'm here in good faith? You did that prior? What happened was that you applied for it, but why you applied for it? You continued to operate it despite the fact that you were told that you could not. So that's actually two times that you did not comply with the law. True I'm, sorry, that's what can you mention both times? I recall one. We left the meeting and I believe that night. The meeting was late. I remember that it was dark. The outdoor cafe was up that night and it was down by Monday I believe the meeting was like a Thursday or Friday. It was down by Monday the time that you're mentioning I did not cooperate, was I believe either that Friday night or Saturday night. That I do recall that there's no use for that, but this two times I do not know the second time. If that's the first, what I'm? Talking about is that you were told about it, then you applied for it and during the application which took a while as it always does, you can operate it once the enclosed is bill. That's it. Nothing else can go on to make it illegal. It's going to be within the same parameters and one point: Joseph was operating his other restaurant and that's where he used to be all the time. I was operating this one at this point, Joseph is the only one operating positive he's one. Actually, we went reported waves as far as that goes, but I do you know. I do have a sense where you're going with that, and it's not it's not to be disrespectful to anybody. I hope you do not take it. That way. We tried to do best that we could there was you know. The question came up the time. I do remember. The question came up of whether or not if that partition was taken down nightly, whether or not that would be considered a temporary structure or a permanent structure, and that was how the conversation went, and it was sort of through consensus, that it was sort of believed that whether or not we take it down nightly does not necessarily matter, but I did not find it factual. Leaving that meeting I thought it was more like it's better off that you do not type of thing the way I remember it. I could be incorrect. This is a while ago, I'm, not sure how long for two winters 17:18 and 18 and closing the canvas barriers. Yes, that's correct. We were operating under the assumption that, if it was even though it was not closed, if it was able to be, it would be within the within the letter of permit. That was the assumption that we operated in under what I see a lot of people operate. They do get these plastic things or canvas things and surround their I'm in close cafes with it under the City Lord. That makes it an enclosed cafe, which would make it illegal, but on the what an enclosed cafe really is a solid flame resistant structure, meaning glass and metal, but you know once he puts the canvas around it technically, he would be operating him in closed cafe. So he was breaking the law at that time. At this point, he's trying to remedy that. Thank you and when I was talking metaphor for one, his partner was operating the restaurant and he did not have as much to do with it as he does now. That's not making an excuse for what happened. No I'm, not trying to make I operate under the advice, with the assumption that, if it's removable it could stay and not to say that we removed it every night, I'm, not trying to say that. Well, if it's possible to remove it not anchored into the into the side wall and into the walls up above et cetera, that would be considered a temporary structure. I'm talking about the unenclosed cafe. Okay, originally we told you it was there illegal, continued, yes, well, I lost you I'm! Sorry, I lost you a little bit the unenclosed cafe the original run, all right. That was something that you operated for a long time without any kind of permit which is required for an unclothed cafe. So the question is: why would we believe here that you're going to operate within all the parameters that are required? Okay, so I interr, that two ways and it's not being it's not trying to come up with an excuse. I had a partner, I positano, my arranger, with my partner, because I operate the companies'. It's a big enough job to do that. So I had an opportunity to get involved in positano through my partner Alex, who was no- one on my partner. Our arrangement was for him to operate the restaurant and for me to support him monetarily and every so often we speak about financials, etc. At that time, I was not operating the daily operation or restaurant I was not doing the paperwork. All this fell through the wayside, not by my fault at this point now well as of 2020 I'm, the sole owner as of 2019 January I'm operating the managing member of the company operating the restaurant. Since I've been operating, the restaurant we have not had we've had a legal, temporary outdoor cafe a legal seasonal outdoor cafe, and my intention is that's why we're here is to do this the right way and to get a year- round outdoor cafe? Yes, some partners and my it's not necessarily an excuse at that time. I was not operating the restaurant day- to- day, you know I'm, sorry, I do not know so. Campania I do operate day- to- day since it opened in 2014 and I. Do not think aside from once in a while, the garbage man drops some garbage on the sidewalk. It's really not my fault. We have not had any issues regarding anything you know with the community board, so I would use that as the barometer of my credibility as opposed to what my partner has done as the managing member previous to me, we obviously have our differences. That's why I'm the sole owner now he's no longer with me any more questions we had I think we have unmute yourself too bad for you that I unmuted myself Joseph. You know we have the community's interest in heart, but it was particularly touching for me tonight to be listening to you that business go forward attitude in these tough times and it is uplifting. Well, listen. I appreciate that my intention is to be a you know, contributor to the community. We do contribute to you. Can image church, you came a police station, you can aim a school, we contribute up and down the line. If anybody asks for anything, we never say no we're not here to. We took some missteps, but you know we're trying to right. The ship I will right. The ship I promise you that yeah we covered everything, it's Steve I. Think I would are we talking about discussion now with the members on? Yes, we just lost your video, your audio Isaac. Oh you got me. Okay, I just wanted to say that I think the despite the fact that I'm a little bit concerned about the past I'm likely to vote for this, but I am concerned about the latter has to be passed through the department that ladder is crucial to the people who live above Mr. LaRocca again. This is not. This has nothing to do it that if we do prove it with specific concern about the ladder- and we do not approve in the event that the ladder can not be made safe for the people above that ladder, that ladder is a fire escape, and that to me is they is a deal buster, and we realize that particular fire escape letter in question is not shown on that plane. Obviously we're not trying to cause an obstruction and off a bit of an emergency, but we know that fair enough to approve it. Based on that, that's fine by me, but I guarantee you. There will not be a not an allowance made for that job at the cafe comes in the straight line where the door is there's tables on either side, where there's a possibility of us bringing that in and making a little cubby hole there approximately two feet in this way: it'll maintain the enclosed cafe, but it will also give that ladder a couple more feet to come down. I'm sure be discussing that with the Department of Buildings. Also reiterate that okay I'm back, you hear me now my internet connection, you hear me now better. Yes, this is okay, I'm done! Okay, this is the site. The enclosed cafe would cover the cellar doors. Are there any issues with that with buildings or other departments, key cell doors, for where we get deliveries in yes, so they're going to be finding a new way to come up and down in the inside? Well, those cellar doors are already well, they have a gate around. We just would never get around them already. The cellar doors yeah look on the yeah, no I'm telling our Mike to show on the plan yeah. The new is that cellar door access for the part of the build, a basement that you have access to, or do other it's just for your users. Yes, okay yeah, you can see it right at the end that I first sort of batch of tables there, which is right there right past that I'm sorry I did not see. I did not see that cellar door. Is it on 4th or on this side street it's on 4. So it's so it's it inside the cafe Mike. How do they have proposed? How they do not, because it's not only about the deliveries but about fire egress from the cellar trying to find a picture of a picture so that can be with Mike is going to be within or outside it would be within it, so would have its own door to access it. You know: is there another way into the basement? No, it's the only door without goin the other way into the basements through the building. Yes, so that's not practical to do that yeah. Would they be used with not use the door Donnie cafes operating hours? Then one thing you know this is a while ago we submitted this I, believe that was the idea not used during operating hours. I believe that was the idea. Yes, everything would be done before, whatever prep they do that, the basement would be done before the cafe open, yeah access or egress. If something was in the basement and if it's for egress in a fire and it should be available- and it does not lead to a door and there's a table on top of it to me, we would not be using it during operating hours of the cafe. So, if you'd be knowing down there well during the hours where the cafe is not operating, then the door would be open into the cafe. The workers would look whatever they're doing downstairs and then they closed it down when people started sitting in the cafe until there's a problem, yes, Joe saying there is access out of that basement through the building. Besides our closed cafe Joseph I'm, just thinking is it possible to let's say, put a door on that part of the enclosure. My floor I'm saying on the under on the enclosure that you have yes, so we could use it during non operating hours, but if, for some reason we just you know it becomes a situation that we have to use during operating hours, how could how can we do that? Is it possible to slightly amend that design put a door there? Instead, let's say at that part of the enclosure. I do not believe ya, you might have to use it a little bit there. Those is their access through the building into the restaurant. No, it's not their doors. There is not the most practical route to take you're, not really using it. Someone had to do something. There is access out of the base, it's possible for you to eliminate the table that it will be placed on top of that Sidewalk vault door, so that you maintain the two exits from the cellar one internally through the building and the other directly through the sidewalk hatch yeah, that's sort of that's sort of what I was getting at. You know. Well, this ways: once you get up that cellar door, is you have access into the restaurant? It's a means of egress, so the other one being through the building, the other one being through the building, but I'm saying to keep that as a viable means of egress, and this is very similar to Steve's point about the fire escape above I. Think if we're going to look favorably on this application, it needs to highlight that it's pending Building Department approval yeah. You know both from the upper floors and for two means from the cellar level not either to be extracted yeah first, even though the practicality of having a table on top in the cellar door, I do not even think it's possible and supported during hours of operation, but okay, yeah I would just go there to get rid of that table. You know I agree with that. Oh yeah I wanted to let you know that DARS lost her connection, she's trying to log on again. Did you hear me yeah? Okay, when I left the doors and went through Buildings Department, you know we'd be ready for motion. It's Steve I would move yes, I would move approval subject to the two things were talking about: the fire escape and the and the door being approved by the Department of Buildings. Oh, we can all favor. We have a second, yes and one second, and there should be an individual voice vote here. I think we have to do that on here. Yes, okay, I'll, go through the committee, lift I vote. Yes bar burger, Mac barber. You hear you have to unmute you, yes, okay, Anthony Marina, yes asking she was on and then Donna Cruz. Yes, you never met. Thank you. Okay. Next item. Thank you all. This was interesting. We are the first zoom meeting. We are the first thanks mark right coming to the end of his fellowship here, a community board- and you know- we've been talking about. You- know- sort of vision for the 65Th Street corridor. We had a little Shirin January seems so long ago, the folks from the committee- and we talked about sort of bounce ideas off each other about what we could consider for the 65Th Street corridor. We know that there's all sorts of development going on there potentially and initiative notes at the meeting and put together a presentation that sort of summarizes some of the ideas that we came up with and some of his own independent study of the area to give us an idea of what we may want to see there on 60th Street, so I'll leave it to initiative to go over some of his findings that he has and yes present to us. Thank you. Mike. Can everybody hear me? Wait! Okay, I just share my screen. Oh wow, can you see it? Yes, very good. Okay, I'll start dreaming. Everyone I hope you had a chance to skim. The report should have I could also post the report link in the chat here so that if anybody wants to have a look at the report, just do that right so basically going over the stub that is returning the report so feel free. If you have a copy of the report to open on your computer, if that helps, I first want to briefly revisit some of the discussion we had during the share it on this map. I have marked the comments, some of the comments we were discussing on that day and if you see in purple these are the new developments that are either ongoing or are proposed, for example, the zoning text change on the Getty Corporation Lord here. Some of the comments were that the area before the 7Th Avenue is has a different feel to it, then the rest of the area, access to the Leif Erikson Parkway, is difficult from the street. So if any new development comes here, if it is residential, the residents will have a difficult time coming to the Parkway. The streetscape currently looks dull, as there are no trees and many auto repair shops fill the street with dust and dirt, there's also a mix of traffic on the road, because it is also a designated drug route and a lot of auto shops, auto repair shops and also cause mix on the street, and they all speed up after Fort Hamilton Parkway as they get a clear road as the area after the Fort Hamilton Parkway is predominantly residential other than this. There was also preference for six to eight story buildings in the area and also building form that would taper off like that would decrease in height as we go to the fotomat Hamilton Parkway. Some members also light this building model in the zoning handbook. On that day, this is a mixed- use, building type with a base as commercial type of uses and condos or apartment buildings at the top set back from the road, so that you do not see a major mass of the building right from the sidewalk, so I'll taking you from these building forms and streetscape I've tried to select some zoning types which we can see if they suit what we are envisioning for the street. But before that, let us see the current zoning map first most of the corridor most of the corridor. Right now is zoned for M1 uses, which is the light manufacturing uses. It does not permit residential uses as of right. Decent text. Amendment in the city has also ensured that hotel users are not allowed in EM when stones now, as of right other than that to the right side. A single- family attached owns after the fourth Hamilton Parkway and the orbiting the tenth Avenue with R5 be zoning. Well, the Lord's facing the Fort Hamilton Parkway our zone for our 6b zoning, which is a higher type zoning, and also so I overlaid with a commercial overly so as to provide for local retail needs. So now, let's start looking at the options, so we are basically looking for zoning times, which would replace these events. Earnings from sixth Avenue to forty Milton Parkway, the first option, I think which could be useful as if we zone all the Lord's before the Seventh Avenue, that is, from the sixth Avenue to the Seventh Avenue as m12 zoning, with a kind of insane incentive zoning that is currently proposed in North Philly imper Williamsburg, we'll talk about it in a bit and the Lords after the Seventh Avenue till the Fort Hamilton Parkway could be zoned as one of the zoning types of C4 districts. After that, the residential areas would be kept as such. The incentive zoning is currently proposed in North Williamsburg. It is a way to preserve the current light manufacturing units present in the area, so, for example, with the current zoning, a certain kind of commercial uses are also permitted and for every square feet of light manufacturing use in the building. The developers get an additional 2.5 square feet of commercial uses, so it is a way to up zone the area permit more types of uses, but also to house the light manufacturing uses and the c4 zonings are to serve a larger needs of a larger region than the local retail stores we find on Say, 5th, Avenue or 4Th Avenue, and the pictures here on the next page shows some building forms that are present in sorry. The pictures here show some building forms that could be generated using a c4 zoning, for example. If it is a commercial building, it requires a set back from the street, and if it is a contextual zoning, it also requires a setback after the seat. Wall Height, if it is a mixed- use, building the residential portion is treated differently than the commercial portion, and it would result in a building form that we discussed that day. The district, the ATC six feet in southern part of the city 10, is currently zone as C4 to a district. You are aware of the area the bed. It promotes different kinds of uses with different building heights. The newer building here aisle six floor high buildings with local retail needs on the right. You can see a rendering of 65Th Street if we stone the area to a c4x use. This is if all the Lords are developed with their maximum potential. That is to a height of eight to nine stories. It should also be noted that this is very difficult as not all Lords are wide enough to support eight story structure on them, so this is a very real possibility, but maximum this is the maximum potential of the Lords present on the 61st Street. The second option could be okay. The second sewing option keeps a lot from six to Seventh Avenue as mixed- use, industrial and commercial. While the zone large from 7th Avenue to Fort Hamilton Parkway could be zoned as residential uses. When we look at the area surrounding the 65Th Street, most of it is zoned for residential uses. The Lots facing the 64 Street, as you can see here in this picture, are also single- family residences, which exist within a within a manufacturing area. The proximity to PS 96 to the two subway stations to the Leif Erikson park to shops and to the Medical Center, also made it a desirable area for SN, introduces I think this is a zoning map for the larger area. You can see this. The purple is the current we are talking about areas surrounding it are all residential and the major avenues have commercial overlays on them. So the idea is to show in the current roads as residential, while continuing this commercial overlays to join the northern portion and the southern portion of the corridor. These are some of the building types that can be produced with the proposed r6 zoning. There are various options developers can choose, but the buildings can go maximum up to eight or nine flows. Generally, the pictures on the right show some of the buildings in the area. For example, this tall building is actually 12 storey, high condominium building at 60Th, Street and Ninth Avenue, twelve storey height is actually I, guess determine also by the building's location in a transit zone which decreases the required amount of parking for it. The second pictures show the second picture is a picture of the Fifth Avenue and 60Th Street in Brooklyn. The commercial overlay allows the retail for neighborhood needs and the new buildings are required to follow the housing requirements and thus start right up from the street. So the conditional zoning you see here is this one and the height factor. Zoning RUC, which allows for taller buildings allowed for this kind of a building. This could be another option for the area permitting eight to nine storey high buildings over the street. The third option could be if we keep the area as it is, that is, to keep the area zone for uses which are currently present on the street. So the proposal is to map all the areas up till the Ninth Avenue as C8 district, so the CA districts were actually mapped along side streets in 1961, where auto oriented uses are present, that is along the major arterial roads. So if we look at the pictures of the street at present, these are on the left are pictures of the 65Th Street. Today, a lot of auto oriented use like car, wash shops or auto repair shops. Gasoline stations are present because it is the truck route and because it is also near to the expressways on the right. You can see area around 90Th Street in Brooklyn right near the 86th Street bit. This also. This area also has a similar feel to it, with car dealerships and auto repair, shops and other kinds of uses which are between manufacturing and commercial types of uses. So this area is currently zoned as C8-, a zoning which allow these kinds of uses to locate in the area and also allow some type of community facilities to locate there. The proponent the proposal is to use see a district, but with a higher zoning suffix. So these are the building types which could be generated by a CA district. You can see there's a gasoline station here and a building which is lower in height, because the CH zoning allows for a zoning allows for a lower density, a lower fer for the building. How it is different from the current zoning is that when one type of zoning allows for a commercial fer of 2.4, if we choose a higher suffix earning such as it c 8:3 or C 8 for higher density, community facilities could also be located in the area. So, if you can see here in the table, the CH 3 and c84 have a higher commercial fer of 2& 5, and also a higher community facility affair, which would allow for uses such as schools or other kind of committed community facilities to be housed in the area. Sorry did I find I went too fast, or was it ok? So these are the 3 zoning types I think could be explored in the area. This is the present zoning map. The first zoning option explained was using M 1 and C 4 C 5 districts. The second used are 6 or r6p districts that is allowing for only residential uses with commercial uses along the major avenues, and the third was using a CA district to preserve what is currently not to preserve but to house similar kinds of uses in the future similar to the uses which are currently present in the area, but also to allow for higher Fer community facilities. All right well, thank you is that is that the full presentation in Ich yeah I, think that was it also I had some suggestions for sweet scaping, but because the zoning changes also require a kind of street treatment from the new buildings. So I could not like include it here, but I will include it in the final report. I only have one hand available because the other hand is holding down the young mute. If I could I would you did a great job? You kept up a tradition with the people who come in and do the you just did a great job. Thank you, we're quiet, because we have a lot to absorb. Oh yeah. Maybe I went too fast because it's difficult to convey on a video, I guess I can send you an Excel sheet for that yeah. Several, like J Something Realty, called like eight properties, yeah, look at that and because a serious motor ability to write yeah. That was also something that came up during the planning said it. One of the things in Asia I recall about our Charette meeting was that we wanted to at least consider not having any high- rise on the block between 6th and 7th that that's essentially almost like an entrance ramp, if you will, and which of your options, shows zero residential on that block between 6th and 7th. So all of the options permit legs. You know that essentially uses on the blocks, because the four okay I can pull up. So the first two options you can see here, I'll both soon as the area from six to Seventh Avenue is so in for manufacturing and commercial uses like we are incentivizing manufacturing, but we are also permitting other kinds of commercial uses, but in both residential uses are not allowed in the third form in a CA district forms are not allowed as well. So in all kinds of like in all three options. There is no residues from six to seven you. What is the height limitation in each of those three options for that particular block? Okay, so for the first two options it depends on. So it's a new tool which is currently being proposed in industry city and in like there's a building called 225 Genta when you, if I recall correctly, Michael told me about it and so that would permit an fer of let's say, 3.5 for every square feet of manufacturing uses if we are getting 2.5 square feet of commercial uses, so you can expect up to also height of the building is also determined by how wide and how deep the lot is. So if a building can support like a four- story, structure or eight story structure, that would also be determined by how big is the lot itself. So we can expect buildings up to four to five stories. Maybe four maximum of four stories or five stories in this area and for a CA de state I think it's the same because a commercial fer yeah I'll recheck for the CA district, but I guess for these two kinds of options, the maximum building height could be four to five stories. The presentation is great, but I think for me. It highlights that block is too dense. Okay, this one from six or seven yeah. If we do our six or r6p, we get mandatory, inclusionary housing and increasing height yeah, so the height of eight stories is like the maximum possible height with the mandatory inclusionary zoning, as well as a qualifying ground floor. So, with both those options, a maximum of eight stories can be permitted on the block, and if it is a non conditional zoning, then the Builder can use the height factor or the tower kind of development, but that is generally not encouraged because they also get a higher fer, make a more fer if they align their building next to the street. So I guess you can expect buildings of eight to nine stories in this option, as well initially was interesting. I think it was for option 1. You said the zoning that you were proposing is the same zoning. That's currently on 86th Street I'm leaving yeah, so I was wondering because on 86th Street it does not look that tall to me over there I mean currently. Is that because a street is not as high as it could be, so there are two reasons for that. I believe one is that 86Th Street also comes under the British District. If I am NOT I guess it also comes under the beer if districts, which limits the height and second thing, is most of the buildings which are like low- rise. I checked on the zoning and land use map. Those are built, like maybe 30 years back and the newest buildings such as the one such as this building on the Fort Hamilton Parkway and 86 feet like towards the end of the bed I like newer buildings and are more in height. These are all six storeys high buildings, six storey high apartment buildings, so I guess the new constructions would be taller than the current buildings. There I have another question: I think it was an option number three: you talked about after the zoning, the new kind of zoning I'd be in the corridor and it would I think it was the ca3 c84 yeah, which I think you said excludes manufacturing uses. Is that true yeah? That's true? Okay, Carboni! Do you have any idea? Why did you see any actual manufacturing uses or are they just in general, like industrial uses, did you see anything being made? There's other kinds of uses as far as I remember, I also take the photos again, which we took that day. The industrial uses are located in the narrow streets like on 63rd Street and further. So I guess there are no industrial uses as such. On the 65th Street itself, there are a couple of initial shops and all the uses are I guess either restaurants or the three guys from Brooklyn store. All the other uses are all auto oriented for the heights. I can recheck the height permissions in each type of zoning and because this is a new type of zoning which is currently being proposed elsewhere in the city, I will recheck once like what are the height limitations for this type of zoning and how high can buildings go? I do other people have comments or questions and I think in the days ahead. We're going to really delve into your report. Options very thorough and I. Think I think we have a lot to think about and the more we go over it and maybe email and Morgan just I should not have done I think it'll be interesting to with these new times or in what development it's going to start to look like in the next six months to a year. It's really hard to say you know I think. Obviously it seems like everything's going to be on hold. Things are going to get close to normal, but at least we have this all this information, locked and loaded. If things do sort of trying to get back to normal, we have the data to be able to consider the area again that thoughtful way and yeah I would look. Thank you and initiai I. You know I said thank you yet everybody else is in there but I. You know. I was a pleasure working with you and obviously you can. You know, keep in touch with us. If you have any questions or you need anything from us or just want to say, hi or whatnot I think we, you know, we all wish you still our union last Semester Columbia already have more yeah, I mean so I have one month to go. Oh okay, so it must be exciting and we're happy for you yeah we're glad to have you for the year. So thank you so much. Thank you. Thank you. So much do we have anything else on the agenda for the for the meeting business. Do I have a motion to adjourn okay, we did it.",
            "summary": "This point we have approval from the Department of City Planning, and the application now goes to the Community Board and, as it makes its way down.\nThey're open to the sky in closed, cafe, I sense, some type of rendering of what doing and the enclosed cafe is actually a built structure with a roof on it.\nIf I could just jump in for a second nice to see some of you again, we've been I , think I've been to community board , We did have a meeting regarding Positano and the outdoor enclosure, which was a while That we had was that we did not close that with bad weather, or has it got colder, and we realized that we did not for the right permit at that.\nDrops down to street level, creates like sort of a barrier also in between the restaurant and the sidewalk, but got ta be open.\nThe outdoor cafe was up that night and it was down by Monday That I do recall that there's no use for that, but this two times I do not know the second time.\nWe have not had any issues regarding anything you know with the community board, so I would use that as the barometer of my credibility as opposed to what my partner has done as the managing member previous to me, we obviously have our differences.\nAre there, any issues with that with buildings or other departments, key cell doors, for where we get deliveries in yes, so they're going to be finding a new way to come up and down in the inside?\nWhen people started sitting in the cafe until there's a problem, yes, Joe saying there is access out of that basement through the building.\nFirst, even though the practicality of having a table on top in the cellar, door, I, do not even think it's possible and supported during hours of operation, but okay, I would just go there to get rid of that.\nWe are the first thanks mark right coming to the end of his fellowship here, a community board- You, know, sort of vision for the 65Th Street corridor.\nWe know that there's all sorts of development going on there potentially and initiative notes at the meeting and put together a presentation that sort of summarizes some of the ideas that we came up with and some of his own independent study of the area.\nThe first option, I think which could be useful as if we zone all the Lord's before the Seventh Avenue, that is, from the sixth Avenue to the Seventh Avenue as m12 zoning, with a kind of insane incentive zoning that is currently proposed in North Philly imper Williamsburg, we'll talk about it in a bit and the Lords after the Seventh Avenue till the Fort Hamilton Parkway could be zoned as one of the zoning types of C4 districts.\nThe developers get an additional 2.5 square feet of commercial uses, so it is a way to up zone the area permit more types of uses, but also to house the light manufacturing uses and the c4 zonings are to serve a larger needs of a larger region than the local retail stores we find on Say, 5th, Avenue or 4Th Avenue, and Pictures here show some building forms that could be generated using a c4 zoning, for example.\nStorey, high condominium building at 60Th, Street and Ninth Avenue, twelve storey height is actually I, guess determine also by the building's location in a transit zone which decreases the required amount of parking for it.\nThe commercial overlay allows the retail for neighborhood needs and the new buildings are required to follow the housing requirements and thus start right up from the street.\nThis could be another option for the area permitting eight to nine storey high buildings over the street.\nThe third option could be if we keep the area as it is, that is, to keep the area zone for uses which are currently present on the street.\nIt is different from the current zoning Is that when one type of zoning allows for a commercial fer of 2.4, if we choose a higher suffix earning, such as it C, 8:3 or C 8 for higher density, community facilities could also be located in the area.\nThe second used are 6 or r6p districts that is allowing for only residential uses with commercial uses along the major avenues, and the third was using a CA district to preserve what is currently not to preserve but to house similar kinds of uses in the future similar to the uses which are currently present in the area, but also to allow for higher Fer community facilities.\nI had some suggestions for sweet scaping, but because the zoning changes also require a kind of street treatment from the new buildings.\nMaybe, four maximum of four stories or five stories in this area and for a CA de state I think it's the same because a commercial fer I'll recheck for the CA district, but I guess for these two kinds of options, the maximum building height could be four to five stories.\nA maximum of eight stories can be permitted on the block, and if it is a non conditional zoning, then the Builder can use the height factor or the tower kind of development, but that is generally not encouraged because they also get a higher fer, make a more fer if they align their building.\n: You talked about after the zoning, the new kind of zoning I'd be in the corridor and it would I think it was the ca3 c84 There are a couple of initial shops and all the uses are I guess either restaurants or the three guys from Brooklyn store.\nI will recheck once like what are the height limitations for this type of zoning and how high can buildings go?"
        }
    }
}