{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UC9bXJCRFPLxMhT22nZ7t8XA",
            "title": "MCB4 September 2020 Housing",
            "publishDate": "2020-09-18",
            "shortDescription": "September 17, 2020\\n\\nAgenda\\n\\n1. Committee Discussion: Statement of District Need and Budget Requests for Fiscal Year 2022\\n\\n2. Committee Discussion: Department of Homeless Services to discuss Temporary Hotel Shelters in Community Board 4\\n\\n3. Committee Discussion: Midtown Community Court \\u0026 Ryan Health Center and Stakeholders to discuss District Harm Reduction Initiatives – POSTPONED\\n\\n4. Old/New Business",
            "lengthSeconds": "2:12:48"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "6TFUlH8IBe8",
            "fillerWordCount": {
                "uh": 203,
                "um": 162
            },
            "readTimeFullTranscript": "85 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "street": 72,
                "hotels": 43,
                "shelter": 37,
                "shelters": 35,
                "situation": 32,
                "services": 31,
                "residents": 29,
                "plan": 22,
                "hotel": 21,
                "streets": 20
            },
            "wordCountSummary": {
                "street": 14,
                "shelter": 10,
                "hotels": 10,
                "shelters": 8,
                "safety": 7,
                "streets": 7,
                "plan": 6,
                "sites": 4,
                "hotel": 4,
                "public": 4
            },
            "fullTranscript": "Foreign shelters in our district and both Mary- and I will do a quick recap of what's happened since July, so in response to Covid-19 and the concern that the city had with congregate, shelters and the ability to spread clove at 19 and convenient shelters. The city began to move homeless, shelters out of congregates into temporarily into budget hotels around the city. Our issue with our district is at one point: we hit 2200 temporary shelter beds over a number of sites they and they were the watson on West 57Th Street, the skyline motoring, the Cashier hotel, the Washington Jefferson on West 51st, caches on 42nd west to 10Th avenue the hotel on 44th street. Between 8th and 9th. There were some people put into the Aladdin, and then we have a number of four shelters on West 36Th and West 37th streets between 8th and 9th avenues. The community's major concern initially was that we were just not notified. Neither are our elected officials notified and we began to have a series of meetings with DHS. When I see meetings like this via zoom and discuss them one by one as the summer has progressed into September, we have had ongoing issues of public safety at every location and we've been working with DHS on a one by one basis, trying to come up with a solution. This has really created a major community issue. The constituents here tonight are not happy. They are extremely concerned and the community wants to make a few statements and then we'll turn over to Ghs. First, our community. Yes, who is it maria? Who is what oh? No? I thought you said something. No. I wait before you give the statement. I just want to well I'll. Do it after God, our district and our board has long welcomed all kinds of social service facilities, from shelters to supportive housing. Maria worked at the shelter on West 52Nd Street. Our board received an award for that as a compassionate community, and that's what's left just last year. So we are not an organ, not a neighborhood. That says no. We are not in NIMBY neighborhood, never who we have ever been, however, the it's the concentration and the degree of the number of people with serious social service issues. That is simply not being managed well, while the initial thing had to happen in order to protect people and our most vulnerable new yorkers, we're now at a point where it's not being managed, and it's created a lot of difficulty and a lack of public safety on the streets. That's what we want to address, that's what we want to hear from DHS about and how we're going to manage this. How we're going to deal with this and how we're not going to have a sole concentration here in our district I'll turn it over to Maria. Now I the only thing I wanted to add before we're going to let DHS go right, Joe, yes, okay, so I just wanted to you set up the stage. So thank you. I just wanted to share with everyone if they've never been on a zoom before that, everyone is going to stay muted throughout the meeting, except for the people who are presenting and then after they speak committee, is going to ask questions and comment. Then members of the public will ask questions and comment and usually what happens on some items after the public comment. There's a discussion again among the committee. They vote on writing a letter of support or to make recommendations, and if you need to comment or ask questions whether you're on the committee or you're part of the public, if you can raise your hand, use the raised hand button it's on your screen and if you're calling in you have to press star 9 to raise your hand and star 6 to unmute and just two quick announcements. So everyone please complete your census. Health kitchen has been having a look, has a low response rate right now, and the other thing is that I know everyone has seen the agenda. Obviously, now you know that first then we'll talk about the budget, then old and new business, and that last piece to remember is that nelly is our moderator, yes, we'll be able to bring when we get to the public portion. You raise your hand she'll, be able to bring people into the discussion. Ask your question get a response and then they'll come in and come out so right now we're going to start with a presentation by DHS and if you're going to introduce yourselves and say what your roles are. That'd be very helpful. I'm Matt Leilani sure one at a time, we'll speak at the same time over each other no hold on. You go first, hello, everyone! Thank you Committee Board for having us. My name is Leilani Irvin, I'm the Manhattan borough director for the Department of Social services and thank you Leilani and thank you Joe. My name is Matt Borden, I'm an assistant commissioner for the Department of Social services for external affairs and government relations and I'm happy to go into our Spiel and obviously I want to hear mostly questions from the audience. I know that, unfortunately, both Leilani and I both have a hard stop around 8 o'clock tonight. So I really, I really want to make sure that we hear all the questions and answers and I do not joe. I know that you've heard this. Oh no you're on mute, yes got it absolutely. So, as Joe mentioned, this is the quick elevator version of it. As Joe mentioned before we started before Covid-19 hit. The city. Cb4 was the home to three permanent shelters, a site, Jack Ryan. There was a site for win for women and as well as a sight on that Joe just alluded to on 52nd street another site for women. In addition, we were using three commercial hotels for families with children. One of those hotels now has been converted to men. So right now, as we as it stands, there are we are using two. We have two families with children, hotels that are happening in the district and there are six hotels for single adults, both men and women within CB4. Just so, everyone has a sense of where that puts CB4 in relation to the city. It's certainly near closer to the top. Obviously, the we have the most dense areas in CB5, which is obviously very close by. We also have quite a few hotels in CB1 in Queens, as well as CB12 in Queens, and then we all have heard about the upper West side, but there are obviously more sites here in CB4 than there are in CB7, basically to give a quick summary. Covid-19 hit homeless individuals, because of so many underlying health issues. That a lot of folks who are experiencing homelessness have are some of the most at risk. People for Covid-19. There were some very disturbing alarms that were being rang acrosss the country in terms of what this would look like within the homeless community and how devastating it would be. The city began to act in a very expeditious fashion, moving almost a thousand people a week out of our permanent shelters, which they have been where they were located into hotels and with very little notice. I've been at DHS now for about five years and one of the things I'm proudest of has been trying to work with the agency to give as much advanced notice as possible. Previous to this job, I actually used to be chief of staff for Assembly Moment Deborah Glick, so I have a pretty good understanding of how important it is for folks to get a heads up on it and it was really challenging because in this situation we did not do that and obviously it was being we were. We were basically just finding hotels and putting them in, and so we could make sure that we folks were safe, and so that being said, we things ramped up rather quickly. We did not do the notification in any way that we would have liked and we've been playing catch- up ever since we've been having lots of conversations with CB4. I really appreciate the all the time that the board has spent dedicated to this issues, and so, as we move forward, we want to continue to try to be in communication recently two of these sites that were in the district actually exited, as Joe mentioned, the cachet hotel we're no longer in there actually was a case of legionnaires disease there, and so we exited that spot out of the out of the Community Board, and there was another site in Washington Jefferson, as we all know, or many of us know, that was the site that ended up going to the upper West side now at the Lucerne. So that's where we are now. I also just want to say that I did learn today. This is a bit of news that we have been able to get granted. I do not have the numbers as of yet, but I was informed that there will actually be additional security coming to the three sites on 36th street in the form of individuals whose job will solely be would be community engagement. I think obviously, there's been a lot of questions and concerns about those sites. I do not have the specifics of it yet, but I said even without having the specifics. I did want to share that because I think that obviously is one of the key elements here and making sure that those patrols happen and folks our individuals are able to be engaged with. Obviously, there's also, you know a host of other issues that we can get into as well in terms of within that within you know, within the city that we're all trying to deal with in a very difficult time, but ultimately I think that that's the that's the 35,000 elevate site from a bird's eye, View Leilani did I please did I miss anything or did I can you fill in any gaps? I that I might have missed nope you covered it, you covered it all, okay, all right everything, okay, all right! So that's where we are, oh in terms of I think this is actually really important. This is the timeline. When are we exiting these sites? That's obviously what everyone wants to know. That's something in which we are. We obviously are actively looking at to figure out when that's going to happen. We've all heard from the mayor who has made it very very pointed remarks that he would want, you know, wants to see us be able to exit hotels as soon as possible. Obviously we're just waiting for the health guidelines to do so, but no one, no one, that's engaged in this work would like us to see it be in hotels for a second longer than we have to be just given the given the nature of these existing shelters that they're already have and have programming, and once folks can move back to their sites. That would also mean that there's a lot of more of the indoor work that we can do, which obviously is hard to do now because of social distancing, and I think that would be the only other piece I'd want to say before we hear from the crowd tonight. The only thing I would add to Matt's points is that the Community board has been very persistent and diligent in asking for us to create a monthly check- in system with all of our providers. Density reduction sites, and so that's something that we've committed and agreed to do so we look forward to having a streamlined, a conversation, a dialogue with all the providers, Community Board for elected official principals on it by month on a monthly basis. So that's the the only thing I would add to all thanks. That's a great! That's a that's a good addition! Thanks a lot joe you're on Mute, I think you're trying to talk. Thank you! So much Matt. You gave us some good information. Could you please just give us some detail on it? The three permanent shelters that were in our district prior? How many beds in total in those three shelters? That's a great question. I want to say that there are at the Jack Ryan. I want to say approximately that there's about 290 in the Jack Ryan. I think the wind site I'm drawing a blank on it thanks and I feel like they're about 100 or so or 150, or so at the at the 52nd street site. I know it's a little over. I think it's a little over 100 on a 52nd street, okay, yeah 50 seconds. Yeah there's over I'm sorry, I have it up here. Oh thank you. Go ahead, I'll, give you the numbers in a moment my computer's Wi- fi, give me one moment I'll circle back with the numbers. I have them: okay and then the for the three hotels used for family with children. Roughly there are, there are so there are two hotels, a family with children higher prior, oh prior. There were, I believe, I want to say I think, total I would say about 230 families, okay right and then for the current families with children. How many is that? Well now there are two so now that's about, I think, there's about a hundred and 170 okay families and then for the singles. The specific I do not. I do not have that. I do not have the sentences. I do not have that. I do not have that in front of me at this at this. Second, I'm sorry, I'm using my yeah. I went back to the board's letter and back in July we, the new ones coming in, were 2100 beds, approximately not 22., I'm sorry. I misspoke on that, but the Washington Jefferson had how many beds that moved back. You know that I think there were 100. I want to say one. Was it 130 there at the Washington Jefferson Right? Does that sound right? And then there were more, I think north of 100 at the cachet. I think it was like one. Two Washington Jefferson had 182 beds. There was 182 okay and what is the other hotel? You wanted the cachet. I think that was 100. and the cachet hotel was 130 beds. That was also 130 right, so that so I'm sorry. I have the numbers for the single adult sites for Jack Ryan. If you'd like, let's go ahead, and so the Jack Ryan site was there's 200, there's a 200 bed capacity there and the care for the homeless site. There's 120 beds there. Okay and wins like the win, is about 70 beds at bed capacity. Okay. So that means in terms of the new beds, I'm trying to just get to a rough idea of where we are as a community. If we were at 2100 and we removed the 182 and the Washington Jefferson and the 130 in the cache we're looking at still one 1788 in terms of new beds, approximately I'm not going to hold it to that. But that's true, that's roughly what it is. So I think one of the things we need to understand as a community, then we're going to really ask open it up to the to the committee. Members is, I understand, other communities may have more sites, but in terms of the roughly 1788 plus the original again one two to 300, I mean we're talking we're well close to almost two thousand two thousand beds in our district. How does that compare to some of the relocations you've done in other locations? I think that's one of them. Sure I mean listen. I think that the it's every community is different, I mean and that that's to say that there are communities in the Bronx right now where there are two. You know two and three thousand beds that folks have in terms of relocations there. As I said, I think that there are similar numbers that they have in Queens, one similar numbers that we have out in southeast Queens as well and previous to the Covid-19 and obviously Community board. Five has even more, but definitely CB4 is one of the hot, like the most that we have in the city, so we're probably like somewhere in the top five and I'm not holding you to it. Just saying roughly yeah. I think that for relocation yeah no for sure, I think that I mean Manhattan has definitely in terms of where were there hotels? Obviously, as folks may know or may not know, DHS is not does not actually go out and select hotels ourselves. We actually have a contract with the Hotel Association for New, York, City and hotels that are within their membership group are hotels that are eligible, so that's sort of the that's who's, that's where we're using and obviously because of given the nature of Midtown in normal times. There are a lot of hotels within Midtown area, so the other issue we bring to is we've gotten many reports back the issue that the ability of these of these operators to provide social services is highly compromised, because the nature of the buildings are literally budget hotels, there's no congregate space, there's no ability to do things and we've got lots of reports back from people who are in the shelters that they just can't get the same kind of service, and in fact I was on one call. One of the providers said that in fact, given the cohort of mentally ill and chemically addicted that they were, people were not necessarily thriving in this environment. We know that you did it for the right reason: we're now interested as a neighborhood to maintain public safety and get people services, so they can succeed and it's not working as it is now I yeah I listen. I totally hear that I think that's why. Obviously I was glad to hear at least for at least for half the sites that we're talking about in the district. We're able to be able to have an increase of the number of staff that will be on hand to engage with clients and in the kind of ways that we're talking about to help deal with those issues and listen in terms of the actual services being provided. Providers are really, you know, doing an amazing job given the circumstance, but I think again, as the mayor himself said, you know. Ultimately, we want to see everyone back in the shelter environment because we were the first we'll be the first to admit. That, ultimately, is where we can do the most good and we're just waiting to get the green light to do so before we open up to the community we'll open up to the committee members and understand committee members make your comments clear and brief, because we want to give the we want to give Dh DHS to be able to hear from the public. We only have an hour and seven minutes more with Ghs, so starting with Jd yeah. Thank you Joe. Thank you. Matt Liana. I just want to say one thing: there's you're talking about you're, not talking about the number of homeless residences for the mentally Ill Salvation Army Rehab. There are already a number of services providers right in Hell's kitchen. I do not. I do not know if that came into your calculations when when another couple thousand people were brought in, but that should be considered- and I have to say I think one of our major concerns is that there was no notification. I live on. 48Th street people were brought into a hotel ambulances. Buses arrived unloaded people, we did not know what was going on. Nobody would tell us for three or four days there were people on the street coughing not wearing masks. There are compromised immune systems among our residents, some who live on that street, some who were getting chemo and coming home. Our lives were put at risk. How is that, and you talk about 36Th Street now providing some extra security. Those people on 36th street are frightened. When is that security going to be put in place on 36th Street? So I just want to say thank you so much for your comment. I am terribly sorry of what you experienced in terms of obviously having a new site. I do not know which offhand which site it is on 48th street. That was placed there, but I totally can imagine got it I, but I totally can imagine what that experience was like, and I think that was actually to be quite honest was a time in the city where I think we all were really scrambling. I know it feels the pandemic feels in some ways like it's gone on forever and I have I have two small children at home and so it every day feels some ways like an eternity, but especially in the beginning, that was that was a time when we were really just scrambling and there's. Obviously I think if we could do it again, you know that would have looked much different, but I can't go back and put the Genie back in the bottle. I understand, if you could do it again, would you tell us? Listen absolutely, I again, I just so you know so. The job that I have is going acrosss, New, York, City talking to individuals and communities regarding shelter. I would always whenever I can want to give as much time, because the one thing that I've heard again and again and before I started this job and for previous administrations, it was exactly what happened during Covid-19 was sort of the normal process for normal shelters and it did not work communities do not like it, and so again it's hard to stress that this was such an unusual circumstance. I dare I say this was a once in a lifetime pandemic, especially at the beginning, as we were trying to scramble to do it, and so I understand that there's nothing that I can say that's going to change that experience of what that was like for you, but all I can say was it was not done out of malice and it was not done out of out of Cruelty. I think it was. It was done out of the triage situation and really from a genuine attempt to want to save lives and again I, but I apologize for that. So I'm going to go to James next and I'm going to ask people. Can we also focus on where we are today too? It's clear? This was not handled properly. We know that everyone's acknowledged it and we appreciate DHS, saying it, but now we're in a crisis situation. I want people to address what you've seen how you've engaged. What are the issues that exist today? So DHS knows how we move forward. Covid-19 is not going away tomorrow. This may be with us through 2021. Therefore we have to figure out how to manage this and bring safety back to the street going to James and then dolores first Matt and Leilani. I want to thank you both for coming tonight. It's not we're not an easy audience and you're not in a good position, and we appreciate the public service that you're doing so it's our job. I appreciate it difficult situation just so you know I was in the air force for 10 years. I've experienced a very difficult situation, so I understand what you're talking about being in a crisis situation. That being the case, it's not like this city has not been in a crisis situation before, and so we expect actually performance to improve when it matters, and now is one of those times that it matters. The first thing I wrote down after you all were talking was basically what Joe said. What is the path forward? My two biggest concerns when I look at the letter that was sent to us. I do not, or were you familiar with the letter that was sent in responses? Yes, okay, my biggest concern when I read this letter was number one. It says that the people who are in the shelters will be moved and I'm quoting or paraphrasing at the point. The health guidance says that it's okay to me, that's a very fuzzy commitment. What and, as Joe just said, I mean this, could health guidance may never come so? My first question is there some way to more specifically identify what the path forward is, and I do not assume that the path forward means going back to what was what was before, because, as Joe said, we are in a crisis now. So when you say that there are going to be additional security patrols, what does that mean? What shape does that? Take I'm what I'm looking for are specifics. I found the letter to be disingenuous, not specific, vague. It made a lot of excuses and without thinking about the past, it did not lay out a plan for the future and it did not commit to communication all it said was we look forward to meeting with you every month? That is not a commitment to keeping the community informed and I will I will suspend so you can respond sure. So I totally hear everything you say. The only thing I would push back on is. I would say that agreeing to meet with the community every month is a form of communication. I think that is actually a request that the board made that was totally understandable and one that we were happy to oblige, and I think the purpose of that is to continue to make sure that we can stay in contact with each other in terms of when are we when are we leaving and how are we going to get out of the situation? That is that's the question that is not only on your lips, but the lips of people that work at DHS. There is a. I appreciate the it's a it's an incredibly understandable question to have. It is a frustrating situation that we're in that we are faced with this situation and we do not have certainty in terms of well. It's going to be at this point, and it is so murky right and I think, as we're seeing right now with the China opening of schools, which is an amazing effort, is that it's very challenging it's a it's a it's incredibly challenging to try to make sure that situations are safe. When we're talking about dealing with clients who are coming from congregate settings. These are situations in which clients are coming from and generally around sites that are, you know, usually around between 150 and 200 number that are dorm like settings that have shared meal space that were created to serve individuals in a temporary basis, as they find their way to permanent housing, and they were not created at all, as this is how we're going to be able to live while there's a highly contagious pandemic, and the city you know is obviously now in deep conversation trying to figure out okay. What does that have to look like to actually move folks back into these settings in a safe way and it and the and the answer is a very vague answer, and so I share some of the frustration that you're talking about. I mean I wish that I had more clarity on it other than I think that we're seeing what's happening right now. I think we all are hoping and praying that these numbers remain low as we go through this next cold and flu season, and hopefully, as we can, you know, seeing as we can continue to take precautions as a city and continue to stay low as a state that will be able to figure out how to you know, transition people back from these hotels into appropriate shelters. I think that means that is going to happen. Yeah, please. You know what I want to go to I'm mindful of time. Folks sure do you have a follow- up question the dolores fault, yeah Matt you referenced sergeant. When will these meetings, the monthly meetings start Leilani I'll, have a definitive date tomorrow, Friday number or October just give me a rough idea, early October, very good. Thank you very much. Thank you. Matt you mentioned. There's a list of hotels, they're contracted, etc. We have 10 occupancy acrosss the city in hotels. What is really troubling is not that people have been moved into hotels, but they were not cited from our understanding from conversations with some of the operators. They were just told move. Here's a list for the fact that there's three shelters on 36th street those decisions were not made with anyone. Mapping out how many people would be there. The unintended consequences happen. So what I like the fact that you want to have more conversation every month, but what is happening on the ground day- to- day is affecting everybody every single moment that they're on the streets. What needs to happen is to cite what are the appropriate facilities where the services can still be delivered to the folks that need it. The at- risk population has been destabilized to a point where a lot of good work that could have been happening in their normal settings is being undone because we've moved them into really inappropriate sites for those services but, most importantly, you've concentrated too many people in an area which means bad habits begin to happen. And what also happens is we have public safety issues not just for our normal residents but for those shelter residents. So is there any possibility to look acrosss that entire list of contracts or can't the city leverage the fact that hotels have absolutely zero occupancy to find the right spaces that may have conference rooms that may have areas that are large enough for full staff to be able to spend that time during the time that they're supposed to be working with their clients to provide what is needed for our at- risk population, even just more room to use as program space? So in fact people are connected with something, as opposed to just ending up on the street decompensating yeah. Listen, I mean I totally hear. I think, that's a that's a really fair point and I think it's really challenging for providers to be able to make sure that they are able to give the kind of services that folks need when they're in these settings. That's without a doubt- and I think it's a very I'm- going to interrupt you because I'm not asking about the providers, I'm asking about leadership at DHS to actually manage the process for where folks are put where their sighting is for, where they're put so that it is appropriate for the population. The hotels, as Joe mentioned from the onset, their budget hotels. So essentially, you created the health criteria where they're separated in rooms, but that isolation in and of itself can be a problem. The fact that no one is able to do their normal programming creates a problem sure the whole point of shelters is to help people transition to a more stable and permanent setting. This is not happening. We know that you can't change the fact. There was a crisis, but you can manage the moment. So I want to know what DHS is doing, so there are many different ways. Sorry I just wanted to chime in that there's a lot of different ways that folks were trying to be creative in the beginning, with the pandemic, with the need to social distance, engaging clients, it was a challenge, but we're now at a place where you know lots of communities have been gracious and donated community space in the summer. Our sites for us to have you know to actually operate appropriately in social distance effectively to have and host different activities and services and programming. Some of the providers have also worked closely with hotels to identify space such as ballrooms and the hotel rooms to host, maybe bingo nights so they're being a lot more creative. Now, especially now that we're in phase three we've conducted testing at all of our sites, the sites in Community Board, four all have come back with negative tests. So that's great news, so you do see providers engaging clients more on site with the space that has been designated or deemed safe spaces for us to effectively host and have programming. Could we be doing more? Absolutely, I hear what you're saying, but those things have begun. Actually, where providers are engaging clients more frequently around different, not just services but programming, but with the need to social distance, of course, there's limitations on how many folks can be in a room, etc. So there's some real strains and challenges that providers are facing with following the CDC guidelines on what is permitted and allowed, but I would say that those things are actually occurring and happening on site. There are also individuals who, in a system who may not be appropriate for the hotel settings, and so those under those individuals who are identified or deemed as inappropriate for these settings immediately, will get a transfer into an appropriate shelter setting so sometimes DHS. There is a screening process, it won't be too long, but there is a screening process. Every individual is evaluated and assessed their place if it turns out that the individual- maybe this is not a good setting. This is not a good fit for them. We do identify a new location that can best accommodate their needs, and so those transfers do happen frequently. But of course it comes up case by case with every individual, so those engagements do happen. We have check- ins with our clients daily to check on their well- being their mental health, their physical well- being, but so those engagements are happening. We are monitoring our clients closely and also clients come to us. If there's an individual in a room and a lot of times, those transfers happen by way of their of their roommates coming to us, letting us know letting not me know, but letting the provider know that an individual may be struggling or having some. They may be having some challenges. So then we case conference those individuals and then we find or identify appropriate setting if we feel that setting is not the best setting for them. I'm going to I'm going to keep on moving through the committee members and be mindful another 10 minutes Max on committee members, because we have a lot of public who wants to be heard and DHS needs to hear them go to leslie. My concern is the human component of it. Those two I think you mentioned two places where there were families. Some of those families, I understand, were moved out of those shelters into other locations out of the common location that they were accustomed to. Some of these people may have children, of course, who have schooling issues now with Covid-19 these people all over the city. We do not know where they are and that's another concern that needs to be addressed. What happened to those people who were in family shelters who were whose lives were disrupted sure? So I totally. I totally appreciate that right now we're in a really interesting point in the system that we have not been before, where we're actually at. I think it's a five or six year low in terms of the number of families that are within our system and we at the same time, we've actually seen an increase in single adults. So that's just where the system is right now, so in terms of when we're talking about the need for additional capacity and for that particular hotel for the skyline, which had families and then those in those families were removed. Those families were moved into other sites within the city and when we move families we look at that their youngest kid and where they're going to school, and we make sure that we try to have that those families stay within the borough and that's what happens to families that are exit or forced to relocate. I think you need to hear very much, though, that with the skyline or the traveling, we had families, no one even noticed they were there. It was background integrated, not a question. Now. This is a major public safety issue in those blocks and there have been has been constant police activity there. So I think one of the problems we're having is that the decision got made for the right emergency reasons. Things are not working out. It's again the concentration of too many individuals with too many social service problems in a slightly or come somewhat inappropriate. Setting and now we have public safety issues, and I want to again bring you back to when we bring in people from West 36Th Street, especially you're, not going to hear our polite back and forth here. These community residents are out of their minds. You need to hear that so I'm going to move again to another committee member, I wanna I'm going to be right back. I just my device is dying. It's going to get a power cord. Give me one! Second, okay, should I wait till he comes back? Oh, so I really appreciate the information that's been provided this evening and I actually, as many people on the board, know I'm actually on the board of one of the providers of services. So I also see that, and so I think that these I'm delighted to hear about the monthly calls that will be coming up where we can get information for our community, and I think it would be super helpful if we can have concrete data. I think there's a lot of impression. A lot of things are being tossed around, but I think we need actual facts. One of the things I would love to hear on the call is what percentage of clients, if any, are not receiving their services, because I know that there are lots of mandated services, and I know, for example, where I'm on the board that they're absolutely receiving their services but of course, in a different way and not in a group setting, but I think it'd be really helpful, because so many of us are concerned about their services to know not by Hearsay. But by fact you know by fact how many are receiving their services and what services or programs they usually get that they may not be getting. That would be super helpful. You could provide that. Thank you. Thank you, hello. Yes, I had one quick question. I was at the corner of 50th and 10th right, acrosss from the from the skyline, formerly a thrifty european tourist hotel just two days ago- and I was talking with one of my neighbors and a fellow at the corner started screaming, and I thought I just had a very big argument. With someone on the phone. There was no phone, he was just whirling around like a dervish and I realized. Sadly, I did not know who to call. I remember the police department saying well we're not going to be dealing with the homeless. What is the fastest way to get someone to the scene, I'm a little bit at a loss and someone else asked me there in the bodega who should we call who's regal, and I was not quite sure the police have been asked to solve all problems. They're not equipped to handle mentally metal sets mental problems. This guy was so far off the wall. I really did not know who to call and that's I asked the DHS folks. What do you suggest? I'm not a sure yeah. It was insanely such as distress and was just big enough to make me scared and I'm you know six months, yep yeah. I would sorry go ahead, no saying go ahead. Sure! No, I think that's a really excellent question. A lot of people I did not know until I started working for the agency that there was a unit solely dedicated to be dispatched to cater and support and offer resources and beds to our most vulnerable new yorkers betting down outside in the streets. So there's an arm, the agency has called homestead. We have an outreach team, that's on the ground, 24 7. they're, dispatched within a constituent's 3- 1- 1, flag anytime. Anyone in community reaches out to 3- 1- 1. You see anyone outdoors who appears to be homeless if they're betting down outside and it looks as though you think they may need support services or bed. 311 is the most appropriate tool to utilize. Within the hour. Our outreach teams are dispatched to engage that individual for a bed and services oftentimes. I know folks in community may get a little discouraged and say I always call 3- 1- 1 and the person is still sitting there. Nothing has been done, but I want folks to know that you should feel actually empowered. It's the most empowering thing you can do as a community member, because you put that person on our team's radar. They remain on our team's caseload and we come back to consistently engage that person until they accept services. That's the ultimate goal, there's also an app which is far more quicker and faster for you as a person walking in the street. If you download the 311 app, you can request homeless outreach on the spot, it'll geometrically track your location. We request outreach it'll, even send you an update on if whether or not they found the individual, if the individual came inside for services or if they refused services, but if you get a response that they refuse services, please know that does not mean that the teams stop engaging them. We continue to engage them for services, so that would be my recommendation on the best tool to utilize to Request, Street homeless. Outreach support do not know if you're coming from a shelter or from the street and that's an ongoing issue, so we have to figure out going forward how we manage this because there's a definite confusion. I have definitely seen people in and out of a shelter decompensating in the street and then just street homeless decomposition. So one of the positive takeaways from the meetings, many meetings that we've been having with with CB4 with you guys was that was confusing for the members and community and so as an action step. What we, as an agency decided to do, was to have our jcc unit, which is DHS street homeless outreach unit, be dispatched to this particular area in the district of concern that we're talking about so we doubled outreach here and what the jcc unit is doing is if they engage the individual, and it appears if they're able to capture in the data, the demographic that this person belongs to a shelter site or even if they get a name and they can cross- reference in the system and they find out that they belong to a site. They then flag it to our programs, administrator and myself. So now, there's a joint, coordinated effort happening here. That was not necessarily happening before, but in light of our conversations and discussions we figured out that was a big question mark and no one knew who belonged where so. That is something that we put in place. It's still in place, so we have a better sense now, when the teams go out to engage if they do belong to a site, they coordinate with the site, so you can have them engage them. So I'm going to ask the committee and with Maria, as the committee members will get back to you later, because there's 12 speakers really got to get the public to speak Maria if you can speak and then we'll start with the speakers yeah. Thank you. I was actually you read my mind. I was going to say before the public speaks. If I can speak just for a minute, I know you guys have a hard stop at eight I'm going to make it short and sweet. I attend a lot of these meetings, so you already know the questions that I ask and what my thoughts are and the only thing I want to add Matt to something that you said something that katie said something that katie said when we talk about this situation, particularly I'm talking about 36 and 37th street. The word challenging does not speak to what's occurring there. It's really, I would say untenable. There is no one here on this panel who would be happy to live there on 36 or 37 or even 38th street. It's really it's an untenable situation, and I hear you saying sorry, but sorry does not suffice and what I know that the community is looking for is going to be action. So I'm glad I heard you mention the fact about the monthly meetings are finally happening, which we've been advocating for right at the beginning in early October- and I heard you mention more security- that's great, but really you know that what we were looking for, because we put it in our letter, was looking for a reduction on 36th street or removing one of the one of the shelter sites, because 800 people on one block is really is really too much, and I most of you already know, I'm a social worker, I'm very compassionate. I am. I am empathetic even to the plight of people who are homeless. I worked in a homeless shelter, so I understand a lot of it and there was a New York Times article that recently came out really interesting. That people shared with me that I had read- and it is very true it's about families, but the thing I wanted to say is that I am understanding of the situation as we all shared why this needed to happen. We were in a public health crisis because of Covid-19, but in that community, in that little area we are now in a pub there's a public safety crisis and that needs to be dealt with, and I guess that's it, and it's just really frustrating to have to attend these meetings weekly and you guys attend them a lot off as well and nothing seems to be happening, and I do not even live on the block and I do not have to endure it, but I hear it we get emails about it. I have some emails that I printed that I have to mention later, so I'm just looking forward to hearing what the community residents have to say. I know there's a lot of them, I'm going to have now. The other thing is that we need the public to keep the comments or questions to a two- minute minimum. Shall I do the timing or nelly? Will you be able to do it, of course nelly? If you could do it? Sorry, marie? If you can do it, because that'll help us move along with nelly, focusing on so I'll. Do the timing? Two minutes I will call to nelly to bring people in and out, and one of the things I want to say is that we now have 84 attendees, plus 17 panelists at this meeting. 16 are raising their hands, I'm going to call on people from West 36Th Street first, because those are the ones who are absolutely out of their minds and then Nellie will bring you in and bring you out. I'd like to start with Brian Weber from West 36Th Street hello. Can you hear me? Yes, we can, and it starts now, Brian all right. Well, you might not be able to hear me over the siren which is perpetually going outside my window. You guys have a heart out at eight o'clock an hour and a half is not enough time to address what is going on: West 36Th street alone, no less the entire community promises of monthly committee meetings. Additional security and improved protocols are not going to solve the situation on West 36Th Street. We must reduce the density of the population. Here you have 820 individuals and three shelter sites in a one block radius. That is 45 percent of the Congregate shelter population transferred into health's kitchen and by the vague numbers that I could figure out from what DHS has relocated the single adult population. Since the beginning of Covid-19, we have between six and eight percent of the entire relocated shelter population citywide on our one block. That is too much. It is a failure. What has occurred since they've moved in is that we've been deluged by drugs, 315 and 327, which are right outside of the doors of the doubletree, are an open- air drug bazaar. We all know it is shocking to me that DHS sits here and tells us how good they are managing this situation because they are not and that drug bazaar was not there prior to the shelter's arrival. Whether or not the shelter residents are involved, it was simply not there and I could tell you that they are preying on the shelter residents. Shelter residents are screened before they come into their shelters, they're searched so as a result, the shelter residents literally do the driving okay. They literally do the drugs on the street for entering the shelters. What has to happen is you must relocate at least one of the shelters from 36th street. We can not do this until 2021 and we can not wait until you have another committee meeting to address this. Thank you. Let's go to Lucy Lieberman 36Th Street Lucy yeah. Can you hear me? Yes, we can okay, great I'm a resident of 36 between 8th and 9th, so I'm in CB4, but right on the border of CB5. So this is definitely a high impact area. I can't express how suddenly the street state changed when the residents moved in at the end of May. Since then, I've been on tons of calls like this and repeatedly DHS has said that the safety of the of the shelter clients are their top priority with little no regard to the residents. There's been no information about what specific steps you are taking to map out how to remove a shelter. There's talk of we'll watch we're monitoring. What are the steps? What are the metrics? Do we need to assume the shelters will be here through the rest of 2020 into 2021. We are asking you to remove a shelter one at one or more of the 36:37 street shelters as soon as possible, like this month to manage the excess density. There are too many here. You must move one. We are scared to go out of our doors, it is noisy and drugs and chaos most of the time when people stop by it might be fine, but the majority of the time. It is chaos. It was never like this before. What are the steps? Are you taking, and how are you going to move at least one of the shelters now not necessarily back to their original shelter but to another location, another hotel location, to spread this out? This density can not be tolerated. Lucy. You did good. You had like 10 seconds left. Let's go to catherine Circle Nick off Catherine. Sorry, I just had the. I did not see the option until just then good afternoon, good evening, you're here. Thank you. Can you hear me now yeah I live on 36 between 8th and 9th, and the population is tremendously disruptive. It is a very disturbing experience. I have to look down the block if I'm approaching the locked door before I go and make a quick dash to get in. I have twice been body checked and nearly the ground by these people. I see people urinating and defecating on the street. I have seen people with needles hanging out of their arms and then I have dodged and gone around to the other side of the street. To return to my loft and the person is, on the other side staggering along and falls down flat. Now, I've taken in everything you've said and I'm wondering if we can't have the ideal of getting a full hotel is. Do you triage the people in a way that you could effectively remove people who are really out of control? I'm talking about people who are mumbling and screaming people who have charged at me. I have to tell people they simply can not come near a loft. I meet people in other places, just not tenable. My husband is 84, I'm 71.. We have a person who's 91 in our building. We have two disabled children in the building and people who have dogs and want to take a walk, and they tell me young people who are 40, who will not go out after dark with their dogs and it's going to be dark even earlier now, so we really need some help. I just do not know how you can continue to talk to us and offer band- Aids about meetings. We need something more effective and at least try to thin down and remove some of the 10 seconds to our most difficult there. You go okay, great! Thank you! So much for sharing, let's go to Alexander Zapparoli Alexander! You can speak now. Hi. Can you hear me? Yes, okay, hi good evening, I live on West 42Nd, so I'm going to be the first to admit that I am not experiencing the same issues that the people that live on West 36 live. So I want to start with that. What I do want to bring up is. I know that last week several homeless shelter residents of Harmonia, which is not part of our district. They were given a very unreasonable short notice to pack up and they were relocated to other shelters, far away from where they were, which is something similar to what happened at the skyline, and you know, then. The mayor's office basically just said that this was a miscommunication glitch after people got outraged over this. So what I do want to know is what is DHS going to do to ensure that such a glitch does not happen when the people that are staying at the hotels in our district are eventually moved back to either a more traditional shelter setup or to other hotels, so that we do not continue doing this shuffling around and just shuffling the problem from one place to the other, because otherwise this is not going to end, and that's all thank you, catherine Lafferty one. Second, sorry, I'm looking for Catherine's name hold on. I do not see Catherine's name, he just stepped out Sarah Silver, okay, Sarah hi! Thank you so much, I'm on West, 37Th Street and my biggest question about security. Is I and I really appreciate the idea of security in the shelters, but I've noticed that if you put security outside of a shelter, it just means that the problem shifts 30 feet and then it's you know, there's a again. I think somebody mentioned the word band- Aids, which is also not an effective long- term solution and security in and around the shelter does not necessarily mean security for the community and how do we? How do we live alongside new neighbors without compromising health and safety for old neighbors? That's my question. Okay, let's go to Owen sweeney owen yeah. Can you hear me? Yes, we can hear you, okay, hi everyone. My name is zone Sweden, I'm going to apologize. I in a place where it's raining a lot, I'm the former head of breaking ground and of HR and what I'm not hearing from DHS is how they're measuring success, I'm actually frankly, tired of hearing these false promises of safety to the residents, to not only the tenants of these hotels but to the residents of the community. There is no plan in place. I'm not hearing the number of case loads that each caseworker has nothing like that. All I'm hearing is another story stories of how they're being successful we're telling you they're not being successful in the rest as residents and business owners. What's the plan I mean I left the country because I'm so over, dealing with essentially being harassed and watching people being assaulted in my neighborhood. This is ridiculous. What are you going to do? What's the plan seriously? Thank you very much owen appreciate it. Hey we're going to get answers at the end, we're going to go to Katie Hamill Decker Katie. You can speak now hi. My name is Katie Hamill Decker. I live in Manhattan plaza on 43rd my question centers around registered sex offenders from the start when the men in cachet moved in. That was my first concern. I have all the empathy in the world and think that people should be allowed to live wherever they want, even people with criminal backgrounds outside of sex offenders. I want to know who is being responsible for overseeing the mandated registry for new addresses amongst the population where they're sex offenders and the answer I get whenever I reach out is there are not any. There are not any no there's none in here. I want to know who's actually going to say that on the record, because when you look at a population, just the BRC that runs double was running cachet. If you look at all of their permanent shelters and cross- reference, those addresses with the state registry, every single one of their permanent facilities has a minimum of 10 registered level 2 level 3, child sex, conviction, people in those residences. Now, when you are sourcing the hotel population from those shelters, the law of averages are that they're going to be part of the population. That goes to the hotels who is taking the lead and making sure that these mandates are being met so by the way, you're speaking careful. So I want to note that we're taking down the questions because we're going to ask DHS this in a follow- up letter and I'm pretty sure, they'll be able to answer a lot of our questions. Thank you. Katie we're going to go to Joanne Giolante Joanne. You can talk now: okay, hi, it's Joanne Violante, I'm a resident of West 37Th Street as well. I would like to know the number of the total population that's been placed south of 42Nd Street. I've been a resident of this neighborhood for the past 32 years, I've lived through the crack epidemic, the prostitution that we've had and never has the neighborhood been so deteriorated as it is, and you know, as a gentleman before me said that you know six to eight percent of the population has been placed in this neighborhood, but the unfortunate part is that we do not have the density in our neighborhood to fight this. It's a very lightly populated area and we are just overwhelmed. It is untenable. It is unsafe. People are afraid my neighbors are afraid to leave their apartments and we really need to see some action here. This is just you know: we've been such good neighbors for so many years and we're that we're in the glass farmhouse condominium- and it is just you know it's just heartbreaking- to see the tragedy. That's on these streets right now and nothing happening. You know it was mentioned earlier that, like there's daily outreach, I find that really hard to believe I mean the people that we are seeing acting out on the streets. They are not being looked at on a daily basis. It's totally impossible that it's they're, very violent, there's a lot of aggression and the neighborhood is terrorized. Thank you. Joanne go to Bernard Oliver Bernard! You can speak now. Okay, can you hear me? Yes, we can good evening. Everyone- and I want to- I want to thank Joe and the committee for their leadership. I just heard about this. Actually, yesterday from a neighbor, I live on voice 47th street I'm. Actually this is my second time in Hell's kitchen. I lived here back in the 90s and I actually felt safer in the 90s than I do now, and I want to agree with all that everyone else has said, because I I've seen the neighborhood deteriorate and I've seen it deteriorate further. I thought Skyline was fairly stable until most recently and now that's a huge mess. My citizen app goes off like a pup like microwave popcorn, because of all the issues that are going on at the skyline, and I think the other thing that's missing from all of this matt that I'd love to see you all begin to address. Nypd has to re- enter the picture. That's what's missing from all of this and, as Owen said, we need to con the other callers. We need a comprehensive plan that is going to address all of this, because we've I've seen published reports, I'm in the industry, I'm an event planner these the homeless pro could be in the could be in these hotels through October. They could also be in these hotels through January, and these hotels are being paid. Okay- and I agree with the caller before it's fun- to have security at the hotels, but what about the residents? We have a lot of senior citizens in Hell's kitchen who try to make their way to food emporium or wherever else that they're going and the streets are just. It feels like at times like a war zone, so NYPD has to re- enter the picture and what I want to hear what I want to see when I get the letters. If I'm added to the to the group that Joe and his team do, I want to see what is the comprehensive plan for October, November, December and January, because I think to get on calls and just have calls about you know, hearing people, then I'm not here to Vet. I believe in that homeless. People who are vulnerable should be careful. Okay should be cared for, but I want to see the plan going forward. That includes solutions. Thank you. Thank you. Bernard we're going to go to Becca Gottlieb. I do not see becca, he just disappeared. Let's go to. Let's go: oh species he's back becca. Can you hear me? Yes, we can hi. Thank you, I'm on 57th street and I am a young woman. I am very scared to go anywhere at night by myself, and but also I wanted to address a slightly on a tangent is affordable housing in community Board, for I have not seen any low income, housing and new construction being built in about a year. I've seen very high amis like in the 160 amis. Is there anything or has anything stopped because of Covid-19, or is there any up and coming to maybe help the situation? I think the board can report to you on that separately. But, yes, there is, and there is a pipeline for broad range of incomes. Yes, okay, is there someone I could email or speak to about it? You email the district manager, Jesse Beaudine. He can fill you in okay. Thank you. Let's go to Philip Pearlstein Philip hi. This is phillip and ellen pearlstein sitting together we're on West 8Th 36th street. Can you hear us? Yes, we can okay, so we live on West, 36Th street. Honestly. I think the situation here is worse than my neighbors are describing. I think everybody is understating the situation it is out of control. People are all over the street drunk high, obviously psychotic aggressive, there's public urination defecation masturbation. I do not know where that woman lives on 42nd street we've seen drug deals going down at 8:30 in the morning on 42Nd Street and 9Th Avenue we've seen a man on an unlicensed scooter driving on the sidewalk doing some kind of drug delivery. To somebody a you know, customer at a restaurant at 44Th, Street and 9Th Avenue we've witnessed a huge man intimidating, a teeny, tiny woman, obviously trying to pressure her into trading sex for drugs. We've had at least one murder. We've had a violent attack on a police officer. You know I just do not think DHS cares what's going on. I do not think you understand. What's going on. It is dangerous for the long- term residents. It is dangerous for the shelter residents. It is dangerous for the Shelter workers. I just do not think you understand or care. What on earth? Are you waiting for to De De-, stress the neighborhood and to undo the density of the newcomers? You know we are not opposed. We understand we're sympathetic to homeless people. We are talking about violence, aggression danger a dangerous situation, so many of these people are unstable and just waiting to explode. I just do not think you understand the dangerous situation with this density of the new newcomers to our community ten seconds. Okay. Thank you very much, Marcia hi good evening. Thank you Joe. Thank you all the committee. I appreciate this forum for us to speak. I could not echo the last person that just spoke. I too, my home is 36th street between 8th and 9th West 36Th Street, I'm actually the board president there in our building and we have seniors. We have people of high risks. We have people with children, we have terrified residents, you do not understand the state of our block. Our community board our community period. It is beyond severe it's beyond dangerous, it is terrorizing. People will not leave the building. My son was accosted trying to get simply to the car to put boxes in our own groceries in our own car. You have no understanding. Everybody is at danger, as the last person said, not just the individuals that have been relocated onto the block, but the people as well that live there. You raised that there was a concern about a public safety crisis. Yes, but it's a crisis too for the residents, and that is not being addressed we're we know what happened before and everybody blame does not matter at this point. It's that's done. We want to know the answer right now. Let's get it done, relocate the density. There are far more hotels than just this area in the whole New York city. I find it hard to believe you can't find other solutions that have more space, so these individuals can be treated properly for what they need. Thank you. Thank you. So much angela piccinini angela, can you hear me? Yes, we can. I my husband and I live on 37th between 9th and 10th, and I would like to first of all thank you for the forum, but echo everything that's been said before we too are in this community. We have no one to turn to and the keeping the homeless safe during this pandemic has been your priority and we need you to also focus on us who live here. It is our home, it is our business. The residents are fearing for their safety, it's dangerous. The businesses are being crippled despite the fact that there's a police precinct on 35Th street and a firehouse on 38Th street. The safety in this community is appalling and nobody is doing anything for us. Some focus needs to be redirected to us who live here, who have lived here for a long time and have invested, and this is our home. We need help Angela. Thank you very much. Let's go to Pamela Wolfe Pamela hi, I'm Pamela Wolfe. I live in Chelsea and I serve on the Community advisory committee for BRC. At the last meeting, we discussed the relocation from the Jack Ryan and just the dispersal of those people, I'm like question really and I'll be quick. Is there a plan for bringing some of that population say half of them back to the shelter. I think Muzzy actually expressed a desire to be able to serve his community again and I'm just wondering what's the story: what's the plan for bringing those people back to where they have services available today, take these questions we get them, get them entirely from DHS. In writing. Understand we have a number of speakers now Andrew stetterfer, to be our last speaker, I'm going to go to christine bertay next christine, yes, thank you Joe. Thank you, Maria very difficult. I live on West, 38Th, Street and, I have to say the neighborhood is really affected by this situation. What I do not understand is why DHS looks so helpless in the face of that situation. This is DHS. This is your job to figure how to fix this, and you are just telling us well. We are waiting to know when we can bring them back, but between here- and there is a lot of time- and this is your job- to figure for example, why do not somebody said that? Why do not we take the people which are the most unstable and the most violent etc, which are in the street all the time and attacking people? Why do not we take those people and move them to another place, because those people are really if they were not homeless, they would be arrested by the police. So, what's the difference? People are dealing drugs. Well, people would be arrested by the police if they were not homeless. So we need to have a working relationship with where, if people, whether they are homeless or not, they have 10 seconds. You know they must be behaving properly in public and that's your job DHS to figure how to get that done. Thank you, christine Bernard, Friedman, Bernard, sorry about that hear me. Yes, thanks yeah, I live on 36th street. Between eighth and ninth, I own a apartment. I've lived there for a year and yeah. I just want to reiterate what the other caller said. I actually you know I thank Matt Borton Leilani, I thank you Maria ortiz for speaking for us earlier. You know- and I thank you guys for being here, but something's got to change earlier. Person spoke about the situation not being tenable. It's not tenable. I'm a 37 year old, six foot, five man and there have been times where I honestly can't go outside of my apartment, pretty much not much more other than that needs to be said other than we are really begging at this point for a reduction in in the in the density here, specifically the former doubletree on the north side of 36th street. Please that's all! Thank you. Let's go to Sanjay Patel and then we'll be followed by Kevin Hatfield, and if everyone could make what their comments or questions even shorter, that would be great. So we can have more people speak. So my hell, can you hear me yeah? My name is Sanjay Patel I've been living on 35th street for over 15 years. Recently the streets have become very scary. I see drug dealers, drug deals handoffs almost twice a week three times a week twice. I've had to call 9- 1- 1, because I saw someone pass out with a needle in their arm. I know you guys are trying your hardest to get people here, but we really need some boots on the ground. We need people patrolling the streets. Even the cops won't come because they say it's not their issue. It's they're, looking for the security staff for a department of whatever homeless, so we just need some more boots on the ground at least right away, and that's all I have to say thank you. Oh Matt, Connie Bear, followed by Eva Hsu Matt. Yes, can you hear me? Okay, great yeah? I have actually two neighborhood or two apartments in the neighborhood, because I'm in the process of renovating- and so one of my apartments is on 39th right by port authority. This is traditionally a bad area, but believe it or not, 36 is far worse than it is over here by port authority. That's where my other apartment is, and people are not being hyperbolic when they're saying that 36 is seriously degraded in a very bad place. Right now, it's I mean between these two I'd, rather stay next to port authority. To be honest right now, because 36 is just it's quite bad. I do not need to repeat what other people have said. My personal experience is that I watched someone overdose on our street and die on the on the corner, and this is not something that should be happening these days so I'll keep it short, and you can move on to the next person. Thank you, Craig Lynn, all right get that oh and then we'll come back to Kevin Hatfield after Craig Lynn. Sorry, can you hear me yes yeah so good evening, and thank you so much for hosting this. You know I was on the last call as well, and this is very passionate about some of these topics as well, especially here in Midtown, so quickly I'll, give a experience and then followed by a question, a question as well. So, overall within the March time period today, things have gotten a little bit better, because we've had some relief as far as some relocations, but throughout the district definitely feeling it. I walk from my office on Fifth Avenue up multiple times, I'm in a nice way, I'm actually meeting a number of different single females and things like that because they are cl. They are asking for escorts to walk up the street up seventh and eighth avenue because they fear going by themselves. So I do see the nice positive of the community coming together, but it's also disheartening when individuals are coming up to blanket strangers to look for protection. As far as the 51st street perspective, you know, even to this day there is an encampment between 9th and 10th and in front of 450 west 51st street. There is individuals shooting up and exposing themselves they're shooting up on their private parts. This has been alerted to 3- 1- 1. They asked actually four supportive services. They've asked to be moved in, they were told a month or month and a half. So it's interesting that we are bringing individuals into the community yep okay. So the last thing I guess my question to to DHS is: what is your process for onboarding? Okay, especially understanding where people are locating and what's and what checklists do you get for supportive services and, more importantly, as well, for those that are coming back? Can I just ask: what are they? What are they? What are they going to do to transition it back? What cleaning schedules to actually bring these back, so anyone who's coming in? How do they know? This is a safe environment, because all these tourists may not know. Thank you. Let's go to Kevin, followed by Jessica Smith Kevin yeah. Can you hear me? Yes, okay, great, the you know I'll be very direct. We need details of the security plan. You know. I understand that this is a multifaceted situation. That's now happening, there's things that are in your control, things that are not in your control, they're, short term, there's long term. It sounds like short term. The best you can offer is additional security, and it should be very clear that the nucleus or the hot spot, is 36 and 37 streets and the surrounding areas. Those surrounding areas. You know like 37Th, Street, Walkway Bridge over the Lincoln tunnel. Those are perfect opportunities for encampments. For people who are now most likely permanent fixtures of the neighborhood, the Genie's out of the bottle, so I think if this is direct to the DHS, the best thing you could do for us right now is give us details of a security plan that includes the fringe areas of the nucleus, which is 36th and 37th street, so that plan within a few blocks, I think, is your first step. That's it sorry! Thank you. Jessica Smith, followed by Eva, Shu Jessica Smith disappeared. I do not see her name anymore. Sorry, Joe. What name did you say? Jessica Smith is back and then eva shoe after that Jessica Smith. You could speak yeah, I'm here. Can you hear me? Yes, I'm so sorry, the ubiquitous zoom call question. So I live on 54th street, I'm a former social worker, I'm an HR consultant and I have worked with a number of organizations doing homeless, Outreach, supportive housing etc. Those are I just want to share that. That's my perspective, offering a comment here. I won't repeat what my neighbors have said with regard to the state of the neighborhood different blocks, etc. But what I would say to DHS and to the community members is an additional pandemic that we are all experiencing, particularly as this goes on and on, and the complaints of many of my neighbors are repeated by. Experience is NIMBY- ism, and this is really something that I think we all need to be aware of. When we are fearful for our safety, when there is anotherism, I am not criticizing anybody's comments in any way. This is a real element of people's experience being afraid, because others around are in great distress and the situation overall is greatly out of control because of the density and much of what you all have shared. But this will have a lasting effect on our ability, as a community, on Dhs's ability on providers ability to have services, residential programming etc in the future, and I do think that, although the immediate concerns are what is most immediate, that the idea of also moving around very vulnerable people, as if they are pieces in a chest, came and need to be removed from where others are feeling threatened, as well as the availability of future proposals, etc. Where the community will welcome service providers into their neighborhoods, you have 10 seconds all of this. I just want to add. I think it's. I hope that it's a different perspective and it's very difficult, I appreciate what's being done, but we really need a broad view. Thank you, eva hi. Thank you first time at this kind of community meeting, I'm a little nervous to speak, but I live on West, 44Th, Street and really speaking about my experience near the skyline, I think the 36th street. That sounds like a very bad situation. That's going on, but you know I do seconding. The person who spoke before me think it's important that DHS and this community board hear from viewpoints of people who also have not been as negatively impacted because we do know. Sometimes the loudest voices are people who are experiencing immediate dangers and need help and want to figure out how to deal with bad situations, so I have walked by the Skyline hotel daily. Before and after the pandemic, I have not really had any negative interactions within the vicinity. Yes, I have noticed more people. Let's be honest: we're talking about black young men, most of the time hanging around near 49:50 51st street I've seen some more homeless. People could be because there's less tourists kind of hiding them. You know just within the mix of people, just the hospital, I think you're doing your best in. I think we've lost for that. If they're that they're being dealt sorry I'll just end and say there are people, sorry Eva! Thank you! Thank you. So we have time for one more person: let's go with Dan Simmons Dan. Yes, I'm here. Can everybody hear me fine, please! Yes, good evening everybody I live at 241, west 36th between eighth and eighth and 7th and 8th and first of all, the Doubletree hotel. This was identified earlier in the call that needs to close. I walked by there today to make sure I had up- to- date, information there is rampant drug use, drug dealing going on right from that hotel. The police substation is right, acrosss the street. So it's interesting that has not been dealt with. There is a brown Van, Brown Dodge Van that sits in the corner. It's the south side corner on the east side of 8th and 36th they're dealing drugs out there constantly. I have not bothered calling the cops because they're not closing down Doubletree. It is really bad on 36th street. It's terrible. It needs to change. I think the two previous callers by the way may not be property owners as a property owner or other property owners. Here, it's disgusting, the fact that we invest in the city- and I have to deal with this. Thank you so I'd like to like I know, DHS has a stop at eight o'clock. We're going to hit the board we'll hear from other members to speak, but DHS. I think one of the things I hope you have a takeaway here is first and foremost nonwithstanding the two prior callers. As you know, this is not a NIMBY community, it's not a theoretical community. We are a practical on the ground solve problems community you needed to hear from a lot of the people in the worst affected area, which is right now 36th and 37th streets, and I hope this has made an impression on you that it's not when we have spoken to you. For example, it's not as if we're speaking out of the blue people are much more stressed and much more freaked out, and I want to know fire Crawler mentioned property owners. This does not affect property owners, it affects property owners, renters passers- by business people who have leases it's the broad range. We need you to understand that the actions you've taken were not. We know that there was no malice or no intention to create this. We get it, but here we are today. We thank you for your earlier apology of no notice. Besides, as the callers have stated, a monthly meeting, we need a plan to get the density down on that block and it is not. Individuals are not chess pieces, but we as a city and agencies and community members can make bad decisions we need to own them say we made a bad decision. How do we fix it because truthfully, the hotel Association is driving this by saying these hotels are available. We need you to take charge to say how do you properly integrate people and manage difficult facilities in a community? Because, honestly, you can't tell us that the shelters were closed by October, November, December or March or April of next year. You do not know, and if we have to live with this you've got to figure out a way to manage it, not just while we're here but d getting reducing the density on certain blocks. You actually move people move the Washington Jefferson Block because of all the stuff around it, and you know something it made a difference now, the way it was done and where they would not have people have been batted around. That's a problem with the administration, not our problem. Please take the leadership. Please help us deal with this. We are very concerned- and I want to say this to the committee members and for all the people in the public. We are concerned that this is going to end up in a very bad violent incident. I have lived in this community for 40 years. I have never seen this level of random activity and violence at the worst of the crack at the epidemic when the westies were on the streets. I did not see this. There was going to be something that happened, and then we all have a price to play. Please Matt! I hear I hear I just want to say as a closing that look forward to the letter, I hear everything that you're saying Joe. I do not think that anyone on this call is being hyper hyperbolic and I appreciate it and I will take this information back. I appreciate you creating the space and I really respectfully thank everyone for their time and I and we'll be in touch as we continue to move forward. Hey leilani. We thank you two for hearing some of these very difficult things, because people are just beside themselves. That's what we really wanted you to hear to understand the depth and the fear going on right now. Thank you. Thank you, Joe. Thank you. Everyone on the call! Thank you Matt thanks Leilani. Thank you. Thank you so much so what I'd like to say is this is a public meeting. We have no problem at eight o'clock, we'd like to hear from everybody else, but keep it. Please try to go to one minute and we'll go down the list and I'm sorry you do not have DHS here for you to hear, but I believe your neighbors have served you pretty well Martha Warley, followed by Val Ferro and any questions you say about DHS. We will then transmit to them. Also Marta hello. Can you hear me? Yes thank you good evening and thank you for hosting this. What I would like to say is that DHS appears to be very binary. They've really got a two- pronged plan. One is to put people back in shelters one day in the distant future, and the other is to leave people where they are now and beef up with security in what did not sound. Like a very meaningful way, a third option has been put on the table and that is to reduce the density. That is a balanced and commonsensical suggestion that takes everybody's needs into consideration, and I really want to hear back from them that they are listening to that and that they have a plan to incorporate that third leg into their strategy. Thank you. Thank you. Next will be val Ferro, followed by Michelle Diaz hi. Can you hear me yeah? It's my favorite. I mean too bad the DHS, not hearing me right now, but I live on 36 between eight and nine and I have a kid I'm a single mom. I leave, I mean the other day on Sunday. I saw a horrific incident and my son had to see all this. There was a heron at it passed out on the street. We saw it from the window. My son ran to me said: oh, my god, somebody is dying on the street I had to. I had to watch it for five minutes to see. If anybody going to help this man, nobody did police right next to our building did not do anything. I had to call 9- 1- 1 for the ambulance to come and take him away because he was so badly like his condition. I can't even explain to you and unfortunately, my nine- year- old, had to see all this. Then. A week ago I saw another man arrested on my street the next day. I see him released in the same street, walking. How is it possible and Matt? Unfortunately, Matt did not hear me from DHS. He said he has two kids. I want to see how his kids, if his kids, would be in this position, how would they feel how would he feel as a parent? This is this is so not safe. I have to walk with a pepper spray. My son asked me: why are you carrying it? I'm like honey to protect you just in case, if somebody decides with a knife to Rob us, because they always also have a citizen app and it always says, somebody's Rob. At a night with a knife, you have five seconds yeah, I'm just begging. I really need somebody, I think 911 yeah 9- 1- 1 at least helped they arrived and took him away. Thank you very much yeah and if you ever need help for me to speak at another point, I will thank you we're going to go Michelle's and for our next speakers for the rest of the speakers. Moving forward, we're going to do one minute: Michelle, Diaz, hello, yes, you're on hi, Joe, hi Michelle, my family's been here for generations, I'm actually the executive director of the hell's heritage project, a lot of our old- timers. Here, look to me and say: what's going on in the neighborhood, it's the worst! It's ever been, so you know you've been here you're not from here, but you've been here a very long time. Okay and we've always had homeless people always to some degree or another you'll sleep in the street, they'll ask for change, etc, and I as well as many others will agree with me to say that this is the absolute most horrendous ever been in the 90s some odd years. That I know that people are still alive Michelle. You have 15 seconds remember so. My thing is that these people are it's not just the homeless, there's criminals that should be in jail and there's people with mental illness that should be in a hospital. You should not have thank you that going on all the time, all right. We need this out. Thank you, Michelle. If you can hear me, Alan Mark, followed by Randolph Barksdale, I'm sorry we're moving quickly, but we're hitting it a good period of time. Yes, Alan you're on you're, muted Allen. I live acrosss from the Doubletree Hotel. I can underscore everything that everyone is saying, but less than a minute today, when I was walking home from work, there was a little girl up. I guess about seven, eight or nine riding her scooter past the Doubletree hotel, while one of his residents was urinating in a tree pit with his pants down, we have to start complaining about that. Damn doubletree hotel, it's a menace to our community. There's drugs. There is public masturbation, urination defecation. We've got to get the hotel out of this neighborhood. Thank you. Thank you Alan. Also. This is recorded, so we're going to ask DHS to watch anyone that they did not see, so they can hear the rest of it. Randolph Bartsdale, Father, Andrew, Stetterfer you're on mute, Brandon, yeah hear me. Yes, I've lived here for 22 years and I work out of my apartment and I own my apartment. I face the double tree. I look at my window. I see the doubletree and, on the other side is the Hilton Fairfield. I can't work in my apartment. There's ambulances coming all day, people out there screaming whoa. I mean it's like non-. Stop it's like little chinese water torture, making you crazy have not heard all the time. This is not even the danger of walking out to the street and what I'm going to see when I'm going to fight. When I walk out my door, this is just trying to live in my apartment and not go mad with all the noise and ambulances and screaming that I hear constantly and on the weekends, all of their little radios. They have playing. You have something non- stop, so I'm just begging just reduce the density. Please, why do you put 800 people on one block? It's insane this, please reduce the distance, so we can live, I'm all for helping the homeless, but let's just do this correctly. Thank you, Randolph. Thank you. Andrew, followed by Kathy, Newcomb hello. I live on 36th between 8th and 9th I'd like to back up everything that the local residents have been saying, like my neighbors have been saying, do not agree about the NIMBY- ism one bit. What I, what I would say is I agree with those who've been saying we have to have a concrete plan and I think reduction of density is obviously where we want to go whilst being sympathetic to the plight of those who are who are here at the moment, but at the same time we have to have an impression of order in the street, because disorder breeds disorder and, as I walked down the 36th towards eighth in the middle of the day today, it looked like a shambles and there's no incentive for people to sort of start behaving themselves. Thank you. Thank you. Kathy Newcomb, followed by David Warren. So, yes, I would like to know: we've heard so many things tonight from you know: people shooting up. I live on 36th street. I have experienced this. I have had people wanting me to buy drugs. I've seen people shooting up. It is absolutely untenable. I've lived in this neighborhood since 1993. I have never seen anything like this. How much do I mean? How many stories does DHS and they're not stories? Sorry, how like what do they need from us like this? Is it is just not livable. We can't live here anymore. Paul earlier mentioned someone screaming. We hear that 24 7., the radios 24:7, the chatter non- stop on the streets. It's not just the quality of life. It's people shooting up it's drugs. It's prostitution! Someone got accosted on Ninth Avenue from a prostitute. You have five seconds 1993., I'm sorry! This is insane it's insane! Thank you, Kathy! Thank you for sharing that David Warren and then we'll end with esther toe hi good evening to the committee and Joe. Thank you very much for doing this. I have the luxury I live in the neighborhood, but I have a luxury of not living on those blocks, which is the hot zone. So I mean I'm thinking that maybe there could be some type of way to help these drug addicts they're there. Let's try to figure out a way for them to work with them to. We have no choice, but you know let's get them off the street, so people have to witness them but put them somewhere, even if it's in the hotel. The other thing is for those that are non- drug addicts, just regular homeless people without homes there needs to be some type of recreational activity. I mean 15 seconds David, any human would be bored without without activity. We need to somehow create some type of within the hotels they need to create records, creativity, so they're not out on the streets going crazy at boredom. Thank you, David, going on to esther told our last speaker for the public. Yesterday, yes, perfect, hi, I'm esther. I am a president of a co- op on 34th street and for a while we had it was similar to 36th street, where there were encampments on dyer. Now that that's cleaned up, they are coming over to our blocks as well. The drugs from 10 o'clock in the morning to late at night also walking around the streets. My I've heard everybody's complaints and what they feel is important and we need to take action. So what can we do to take action? We need to clean this up now we can't wait. Everyone is frustrated and before something else, horrific and horrific happens, we do as a community that all of us, esther- you have 10 seconds. Okay, lead, will go and petition. What can the community help? You facilitate this problem with DHS and the and the mayor or whatever we can do to petition this west side got a shelter out of their community. How can we decrease this problem here? Questions in the chat because you kept breaking up, so we could not hear everything that would be helpful. Okay. Thank you. Sorry, okay, no, thank you. Okay, so we are now we've gone through all of our public speakers. We still have 54 people attending and the question is: how do we proceed? I think we Jesse. Can. I ask you to speak a little bit first about what's been happening during the summer and this issue about the meeting, but really what the discussion has been. That would be helpful to sort of sum us up before we start discussing how to proceed. Sure, joe, I I'm sorry, I came in a little late, so just to clarify and talking about what the meeting is all of our all of our meetings. We've had the things we've asked where we're going all right, so I mean I hope this is what is what you're looking for so I mean basically once this process has started with DHS. You know we have held numerous meetings with each individual provider with members from this committee members from the board itself, stakeholders from the community from the block restaurant owners, and so it's a cumbersome task to continually have these meetings as we go on each with each individual provider. You know we originally had nine. I think we have eight now, plus the actual you know existing social services that we have in our area that we're still trying to manage. So you know one of the things that we have been really pushing for and advocating for which I think was actually communicated quite well through some of the members of the public. Is you know that DHS takes a much more of a leadership role in recognizing they put this many folks into our district and how to manage them and how to coordinate that response on handling the quality of life and the public safety issues that arise, because, as folks on this committee know folks that sit on other community advisory boards for other shelters that are in existing shelters that are in our district and and also supportive housing facilities in our district. These meetings they take time and they take effort, and you have to sort of work through each of the problems and they're going to the problems. Some of them will. The problems will be resolved and other problems will come back and it's sort of like a wave, and so we, you can't just walk away from it at once, and so we really needed Vhs. We were really advocating for DHS to take a leadership role, mat and hold a district- wide. You know service cabinet with each all of the providers with NYPD with homeless outreach. So when these problems come up issues, whether they be individual folks on the street, whether they be a narcotics issue, we have all of the stakeholders there and able to assess the best way to manage it and it gets resolved and all of the parties are talking with each other, and so that's what internally one of our biggest pushes has been to get that started. It sounds like DHS is finally coming to the table and saying yes they're going to start those meetings, and I think, hopefully that will help the public safety and quality of life issues. That does not solve the main issue here tonight, which I think was clearly communicated, which is just you can not have that many folks put implanted into a community into a block like that and and expect nothing to happen, and so, as you guys already know, you've written a letter and they've written back. But so you know we've been trying to doing handling it, one on one offs with all the providers we're trying to we're trying to get the city to do a much more coordinated, larger, top-, down kind of coordination with all of the stakeholders, including NYPD and homeless outreach, and obviously we're continuing to advocate strongly both to the agency and to our elected officials. The need that this is not about having a shelter in our district and not having a shelter in our district. This is about this particular site and this particular street and the density issue. So what I'd like to do is sort of what you were looking for. Joe, I'm sorry! I do not know yes very much. Okay, I want to frame some of the threads that we heard tonight. Okay, first DHS acknowledged that they had poor communication and that's the first time. I've heard that very clearly and it was actually authentic. We should acknowledge that the second thing is: we need to get all the stats and information they gave us. It was not quite clear how many shelter beds prior and then Jd's issue is not just shelter beds but other facilities for social services. So we give the full picture and lay it out, I'm going to put that over to Jesse to work with nelly, so we can sort of put that together. So we get the statistics clear, then they gave us here's the current number of shelter beds and then we get to get that clear from Matt Borden. So we know that we're laying the argument out very clearly but number one. It's clear that this there is no end, that's clear! No matter what the mayor has said. This could persist through 2020 and through 2021.. Therefore, DHS has to come up with a plan in general on how this process gets managed both to benefit the shelter residents and to provide ongoing public safety for the community, because it has created problems where none existed. Next, the 36th Street issue, 37Th Street issue- has to become center of our next letter saying we said it before this is clear and what I would like to do and we're lucky that we have this zoom that was recorded, that we can go through and pull out specific things that people I want to put in a letter here are the things that have been reported from our district, that people are dealing with every day. So it's not like, as if it's some vague, anecdotal issue, so our requests in a letter are here's. What it is come up with a plan communicate well come up with a plan, and you must reduce the density on 36 and 37 streets, because it's just not working, and it's not tenable. It's not that it's a quality of life issue. It's not tenable for those residents who live in those blocks. I also to the members of the public who are here. I think it's important that at this point you begin use and I put picture to one of our public members, Brian Webber. You need to form a block, Association 36 37th street, it's part of the broader structure, so you have a good, solid voice adding into these discussions. Otherwise you're just going to get a lot of people complaining, that's what's helped 47:48 and 49:54 and 44th street and 46th over the years, we're 55th always being able to have a clear voice so think about that as a as a help and when Erica Tell asked the question: how can you help? Let's get people in the Block Association? So there's a group to go to that could become part of this ongoing back and forth with DHS demanding things that need to be done. So as a general idea as a letter, let's go around the room starting with cake. So I really like a lot of what you just said: Joe, I'm all for I'm sorry what thank God it was recorded. So I can remember we got to write a letter exactly. I guess my only suggestion is I'm a little worried about when letters get long and I think they get sort of lost like I think that one of the most important things and maybe like there should maybe there should be two letters. Maybe there should be a letter that says we need one. At least we need de- densification on 36th and 37th street. We need you to tell us when, in the next few weeks you can move, one of you can relocate people from one of those places to another hotel so that we can get a specific answer and then separately. I think we need to say look we. You know we've heard from so many people tonight here. All the questions that came up here are the concerns generally about how things have been handled. This is what we want to hear in these monthly meetings and sort of go into more detail, but I really feel like maybe this De- densification thing should be its own letter just to really bring on the point and get a specific answer. Leslie. I think I think Joe. Your point before, which is very accurate, is that we need to make sure that DHS takes charge and does not leave it to the hotels to decide where people go. We need that kind of responsibility that overview to decide on community and what should be put in the community jd. Yes, excellent, all around Joe. I agree with everything I just want to say one thing: we should not let our elected representatives off the hook, DHS is a city agency. They have failed this community, but so have our elected officials and they need to be put on notice that they need to help us clear up the situation on 36Th Street, 37Th Street, and they need to push for a solution. Jesse, like Jesse, said they are also part of the solution and we need their backing. There might be something in the letter to say help us out josephine. Well, I'm concerned that there has not been any discussion on the fact that schools are reopening next week. Some of our schools are going to be utilizing outdoor spaces in order to adhere to social, distancing measures and in one of the schools they are using their yard and there was a homicide that took place a couple blocks from that school. Unfortunately, a homeless person was killed, and so what I wanted to ask DHS earlier is you know they talked about the extra security, but we actually need to know asap. What that looks like. Are they talking about NYPD? Are they talking about hourly patrols? We really need to get specifics on that and schools are, you know, for element. Students are opening next week, so we really need to know now what's happening with that. I'm very concerned about this dolores, thank you hi. I I'm echoing what Jd said. We had DHS as a focal point this evening because they were here but we've had a political vacuum. This district happens to have as our council member the speaker of the house, that should be the second most powerful, not the house. Oh sorry, another house, sorry of the City Council. Okay, sorry, I just gave Corey a a better job, but bottom line. That's the second most powerful position in New York City, and this is what's happening in his district and while his staff is working tirelessly, no one will say at for one moment that his staff has not been there alongside Maria and other members of this committee, as well as members of the community walking the streets. Assessing that walking around and assessing and saying I hear you I understand you has been useless. This is a failure of government. This is a failure of management and we need to ensure that folks actually take action. We've prescribed already some ways to help the focal point: the escalation of 36th street. It's not a pleas, a request to say: oh help us out a little bit. It needs to be demanded, which means we need political will, which means the speaker of the City Council needs to be focusing on his district and ensuring that residents that exist and that are here are safe, as well as the speaker for the whole city, recognizing that we've done a disservice to all of those relocated, shelter residents. So again, I agree with Jd 100 percent. The electeds need to be held accountable, DHS has been mismanaged, but without the pushing of our electeds they can simply ignore us. I think everything that's been said in the meeting by the board members. Have I echo I'm going to agree with what's going on. I am concerned about the number of schools that we have in this community and how the opening of schools is going to be affected by the number of homeless people out in the streets, especially those that are persons that have committed crimes in the past. Also, since we've received a great number of people in this community that are homeless, how is this considered? How is this counted in the sensors? I do not think any of that's coordinated, pete all right. Those are just my thoughts again, I'm going through what everybody's going through and I it's very difficult, and I it's a great undertaking and addressing this issue this problem we have and that's about it Joe. Can I just make a quick correction on that, just because I it's not the most important thing in the room, but Pete's concern about the census that is actually brought up much earlier at a we've had so many of these meetings. This was actually brought up much earlier and DHS does have an answer for that. They do have the numbers they get them from the providers it has been, it has been recorded, so they do have them. So thank you. Yeah Martin, Treat, followed by Paul ames, we juice dancing and in Greece Sick. Thank you, Martin Paul ames, all about I just wanted to touch on two things it's already been mentioned, but the school's reopening is going to be yet another social science experiment that we're all in whether we want to be or not, I hope for the best and fear the worst, I'm very interested in exactly sort of connected to that point. Exactly how our police, precincts and the school safety guys are going to coordinate? That's always a problem, I'm on West 50th. It's always been a problem, and you know in the face of this. It seems like such a quaint problem, but it is a problem and deciding who's got priority whose problem it is going to be tricky, especially in light of the police department, washing their hands of anything to do with the homeless the other month. It was not very well reported or remarked upon, and I have not had been able to get to a precinct meeting of late, but it's going to be very important, but anyway, as usual, what you said before Joe very good expect your fault, followed by Maria, then lowell as a long- standing tenant of housing. I've lived in la Chelsea and fulton for a long time, and we've had a constant relationship for lack of a better word with homeless here and a crime and drug situation where, as opposed to some of these communities now where they have the hotels populated by the homeless and that need they're. Basically, it's a new situation for folks and I respect that a lot we've had you're feeling what I've felt in my community for many years now, where DHS has not stepped up in a leadership role that they should. I echo what Joe's mentioned, and dolores and many of the others that DHS needs to really get a handle of this finally, and do something a little bit more permanent on a more broad basis than just dealing with these hotels. This is a city- wide situation where it's not just happening here. It's happening in other boroughs as well, but basically they're not doing that great, a job of controlling the situation and keeping residences of these communities safe and and welcome. Obviously, so honestly, I believe I agree with everybody else that DHS needs and must do their job properly, finally, and step up and take a proper leadership role and get control of this and not wait for the hotels or politicians to tell them what to do. They need to do their job. So I just want to note that comments on Betty Mcintosh about to leave she said, should be a comprehensive plan for these shelter residents. The plan should utilize former shelters with fewer people, plus more hotels, spread out, and then she feels that we should make some sort of documentary to show our problems to the mayor and the council and others for James Wallace. He said this is out of control. Dhs is out of its depth and they can. It appears they can't fix this alone. It has to be done with all of us together we're going to go to Maria and then lol, so just really quickly. I just want to mention the three letters that we got so one letter by artificial diva is basically saying that homelessness does not equal. It's a long email, I'm just going to the two things that stand out is homelessness, does not equal being addicted to drugs and another point this person made in their email is that, but to my, but that their point is. I do not believe that hotels should be closed to the homeless. I believe it will only enforce force them onto the streets and make them more make it more dangerous for everyone involved. The other letter is the other. Email is actually from Kathy who spoke earlier and just talked about that there needs to be you know. Dhs has had a lot of discussions and made promises, but it seems like nothing is happening. Donna wrote an email about the skyline and in several incidences that have happened there. We also had another email from catherine who actually spoke about her and her husband, who've lived in the community 40 years, they're, 71 and 84., and what else was I going to say the thing that I just wanted to share with everyone. I've had so many conversations about this, and just like all of you, especially like Jd Jesse Joe dolores, so the thing that stands out to me right now is that you know this is not about putting homeless people onto the streets right thinking about the letter that I just saw it's about what's occurring on 36 and 37, and for the people who have to live there and the density and the way that they are in fear of stepping out of their home even during the day to do normal kinds of things like go to the store and how they're being impacted and how they're being impacted in relation to their safety, their physical and their emotional and mental well- being, and it's not okay, and at this point I am, I totally feel and believe and agree with what dolores and Jd have to say about our electives. At this point, it is to me beyond DHS- and you know, DHS has impact here, but it is about our electives and about the administration, the mayor's office, and getting this to happen, it's not okay, what's occurring in this community, it was really upsetting to me. When I found out, I heard that people on 79th street were going to be relocating. I found out that was on pause that, but that was very upsetting to me, because I even read that the mayor said that that's not acceptable the way it is on 79th street. It's not acceptable. Has anybody I mean if anybody here walks along 79th Street and you see what's happening there versus what's happening on 36th and 37th street in this community. It's a very big difference, and if I lived on 36th and 37th street, I do not know what I would do. I would probably move to be to be quite frank and it's just not. It is untenable and this letter it needs to be stronger than our last letter, and we just got to work really hard on this and get this to happen. Something has to give something has to give oh for those of you who do not know me. I'm lowell current, I'm the chair of Community Board, for I first want to thank Joe and Maria for running a great meeting tonight and for all of their efforts on all of this Gail brewer's office has been working on a letter to DHS as well, and that letter has not come out yet because I'm going to be quite frank here, most of our electeds are too scared. Right now of the press to send a letter saying people need to be relocated. I've been going back and forth with Gail's office and Brian Lewis is on this call brian. If you can give us an update on that letter, that would be great, but it there up until yesterday, the letter said relocate and some of our electeds got cold feet and started pulling that out of the letter, and I do not know where it stands as of today, but I'm disgusted with the conduct of our elected officials and while I understand what dolores and Jd said about getting them involved, I really think that we have to keep putting the pressure on DHS directly, because our electeds are too scared of the press right now and the offices they're running, for you know next time around that they do not want the bad press. That happened on the upper West side and it's disgusting to me, and I really hope that this committee comes up with a letter, a very strong letter to DHS. That says. You've got to do this and if we want to put in a separate letter to our electeds to try and get them to move that'd be great, but I'm not holding my breath on that. So you know, I will note that there's a number of people attending the meeting from various elected official offices, they've heard a lot and some join early. Some join late they'll be able to look at the at the recording on Youtube. I think this meeting is very important, because we have gotten out a clear message that this is nothing to do except really had two speakers say this is a NIMBY issue. My lord, this is not about an india issue. There are people, it's a 96 year old world, famous artist trapped in his apartment, because he's scared to come out on 36th street. That's real! That's present! There are people who walk out of their homes and literally, are looking out their windows and seeing someone odin, I have looked out of my window on 35Th Street and for the first time seen prostitution since the 19 early 1980s. This is a different world, we're in and it all has happened all at once with the relocation of the shelters. It is not all shelter residents, it is not anything like that whatsoever, but the process has not been managed. I think we've made that very clear. We are at 8 40.. I think we've done a damn good job, but I want to get a quick vote on the bare bones of a letter we described. How do people feel about it? Are you yes, please raise your hand so nelly. No members raise your hand. Oh okay, so it looks like it's unanimous, great, okay and again we'll be working on it during the next week. It won't be done in a second because we have to think about to get through and we'll send it around to the committee members for your response and editing too. Okay Jesse. Can we possibly take up the budget issue at our executive committee meeting and just have the members add in if we email around to them the current budget items yeah, you can have that that's fine! I would still you still need to vote it out in October right. So if you want to have an intern, you want to have a conversation. Send stuff out. Get members of this committee. Send you what they think it should be pre- prioritized. However, that is, and then you have a re- discussion of that conversation in October. You can do so. We have we have another month and then it gets voted out at the November full board. So in terms of yeah I would remember I was actually yeah. I was going to ask so we need to work on the budget for the fiscal year, 2022., correct, yes, yeah, and so what I wanted to ask the committee was actually to email, Joe and I Jesse do you need to be included in the email? Natalie should be really included, but I'm fine with being included as well. But it's again it okay. So then, just to be clear folks should be emailing. People can be emailing, but it should not be a committee conversation on email right. So there's you know you can ask for submissions, but then the debate and that conversation about that priority right. So I was going to elaborate yeah. So yes, as Jesse said, there can't be a conversation in email because all of our meetings, all of our conversations and discussions, are supposed to be public. What I was going to ask is that each committee member send myself Joe and nelly an email indicating I need you guys to look at the budget. It's in the drop box. There's a budget for capital budget for expense requests, look it over. There are also some responses from the city agency and just put in your top. I was going to. I did not talk this over with you Joe, but I was going to ask if they could email the two top capital things that they think are priority and the two top capital expense requests that they think are priority, and I also wanted the committee to look over the Manhattan community board for community needs assessment. That was done. I think that would be helpful in helping to decide what we, as a committee, think, are the priorities I wanted. I would like, if that could be emailed to us by Monday evening, because I'm on the budget task force and we'll be discussing beginning our discussion on Tuesday and then in October. We can discuss it in more length right Jesse. If the needs assessment is not in the in the in the in the dropbox already, you can put that in tonight and it'll. I thought it was that's where I saw it, but it's also on the website. That's what I'm saying if you did not see it there we'll make sure it's in there, but it should have been in there. Okay. So again, all committee members will get the last year's budget with the capital, expense, capital and expense priorities. The community needs assessment. The district needs that the same in the district needs. You have all the information and then just start to nail back to nelly to nelly your concerns, thoughts about it so we'll be prepared to discuss it at our next meeting. All right, a lot of information coming at you once anything else for tonight's meeting. I have just one piece of quick good news that I do not know if we remember, but you know, Brad Hoyleman uh's office had actually provided with a new sort of a new funding advocation last year. If remember, he had state money that we he gave us the responsibility of suggesting, where that some of that state money should go and that's sort of slowly coming back around actually, and so it's moving to the next stage and the two items that we had made priorities. One was the infrastructure project for fulton houses, which has been on your capital list for years. Now is one of them and then there's an education there's an education request that was included in that as well, and so both of those are moving over moving to the next stage. It does they're, not it's not complete, but Brad's office. I believe, is you know, going to make something announce that shortly, but I just wanted to give you guys. Some good news have nellie give us the details of what those two are. So we understand what it is, so we get it we'll know. What's going on sure, we'll send the letter out that we sent out so people understand what we were advocating so for the for the public, the 39 of you who have hung in through this I want to. Thank you all. Wait a minute joe before you end no new business, yeah, old and new business. I just wanted you to give an update about the NYCHA working group. Oh sorry, quickly, the Nitro Working group was entirely put on pause due to Covid-19. It began to start to have some discussions really in July or so, and it is now reconvening. We've actually had one meeting of the finance subcommittee and it's unbelievable that we're starting to have these conversations again and I think the oddest part of this whole discussion is the fact that the economic situation is so much worse. That means interest rates have gone down. That means there's a greater ability to borrow because it's the money is cheaper to do some of the nicer repairs in the weirdest way. This disaster may be helping our whole plan for Chelsea night shift unbelievable, but we're just starting and I'll. Tell you that our meeting is going to really start in late September, early October and we'll be able to report back in a much better way after that at our October meeting. So do I hear a motion to Adjourn jd? All those in favor raise your hand, and I want to thank all the members of the public who stuck with us and very much. I appreciate your attendance for the community members and really engaging in this weirdo. Thank you. Thank you nelly. Thank you. You're welcome good job nelly. Thank you. Thank you great job, everybody. Thank you. Thanks all good night.",
            "summary": "Our issue with our district is at one point: We hit 2200 temporary shelter beds over a number of sites they and they were the watson on West 57Th Street, the skyline motoring, the Cashier hotel, the Washington Jefferson on West 51st, caches on 42nd west to 10Th avenue the hotel on 44th street.\nWe have had ongoing issues of public safety at every location and we've been working with DHS on a one by one basis, trying to come up with a solution.\nThat is simply not being managed well, while the initial thing had to happen in order to protect people and our most vulnerable new yorkers, we're now at a point where it's not being managed, and it's created a lot of difficulty and a lack of public safety on the streets.\nThey vote on writing a letter of support or to make recommendations, and if you need to comment or ask questions whether you're on the committee or you're part of the public.\nThe city began to act in a very expeditious fashion, moving almost a thousand people a week out of our permanent shelters, which they have been where they were located into hotels and with very little notice.\nI do not have the numbers as of yet, but I was informed that there will actually be additional security coming to the three sites on 36th street in the form of individuals whose job will solely be would be community engagement.\nYou know a host of other issues that we can get into as well in terms of within that within you know, within the city that we're all trying to deal with in a very difficult time, but ultimately I think that that's the That's, the 35,000 elevate site from a bird's eye, Oh in terms of I, think this is actually really important.\nObviously we're just waiting for the health guidelines to do so, but no one, no one, that's engaged in this work would like us to see it be in hotels for a second longer than we have to be just given the given the nature of these existing shelters.\nI think it's a little over 100 on a 52nd, street, okay, And, then the for the three hotels used for family with children.\nThink one of the things we need to understand as a community, then we're going to really ask open it up to the to the committee.\nSo the other issue we bring to is we've gotten many reports back the issue that the ability of these of these operators to provide social services is highly compromised, because the nature of the buildings are literally budget hotels ,, there's, no congregate, space , there's no ability to do things and we've got lots of reports back from people who are in the shelters that they just can't get the same kind of service, and in fact I was on one call.\nWe know that you did it for the right reason: we're now interested as a neighborhood to maintain public safety and get people services.\nAnd I have I, have two small children at home, The job that I have is going acrosss, New, York, City talking to individuals and communities regarding shelter.\nI would always whenever I can want to give as much time, because the one thing that I've heard again and again and before I started this job and for previous administrations, it was exactly what happened during Covid-19 was sort of the normal process for normal shelters It did not work, I dare I, say this was a once in a lifetime pandemic, especially at the beginning, as we were trying to scramble to do it, and so I understand that there's nothing that I can say.\nThese are situations in which clients are coming from and generally around sites that are, you know, usually around between 150 and 200 number that are dorm like settings that have shared meal space that were created to serve individuals in a temporary basis, as they find their way to permanent housing, and they were not created at all, as this is how we're going to be able to live while there's a highly contagious pandemic, and the city you know is obviously now in deep conversation trying to figure out Does that have to look like to actually move folks back into these settings in a safe way and it and the and the answer is a very vague answer, and so I share.\nI think we all are hoping and praying that these numbers remain low as we go through this next cold and flu season, and hopefully, as we can, you know, seeing as we can continue to take precautions as a city and continue to stay low as a state that will be able to figure out how to you know, transition people back from these hotels into appropriate shelters.\nWhat I like the fact that you want to have more conversation, every month, but what is happening on the ground day- To- day is affecting everybody every single moment that they're on the streets.\nIs there any possibility to look acrosss that entire list of contracts or can't the city leverage the fact that hotels have absolutely zero occupancy to find the right spaces that may have conference rooms that may have areas that are large enough for full staff to be able to spend that time during the time that they're supposed to be working with their clients to provide what is needed for our at- risk, population, even just more room to use as program space?\nIn fact, people are connected with something, as opposed to just ending up on the street decompensating And I think it's a very I'm- going to interrupt you because I'm not asking about the providers, I'm asking about leadership at DHS to actually manage the process for where folks are put where their sighting is for, where they're put so that it is appropriate for the population.\nIn that there's a lot of different ways that folks were trying to be creative in the beginning, with the pandemic, with the need to social distance, engaging clients, it was a challenge, but we're now at a place where you know lots of communities have been gracious and donated community space in the summer.\nI'm going to keep on moving through the committee members and be mindful another 10 minutes Max on committee members, because we have a lot of public who wants to be heard and DHS needs to hear them go to leslie.\nWhat happened to those people who were in family shelters who were whose lives were disrupted sure?\nIssues, and I want to again bring you back to when we bring in people from West 36Th Street, These community residents are out of their minds.\nI did not know until I started working for the agency that there was a unit solely dedicated to be dispatched to cater and support and offer resources and beds to our most vulnerable new yorkers betting down outside in the streets.\nOutreach support do not know if you're coming from a shelter or from the street and that's an ongoing issue.\nSo you already know the questions that I ask and what my thoughts are and the only thing I want to add Matt to something that you said something that katie said something that katie said when we talk about this situation, particularly I'm talking about 36 and 37th street.\nReally it's an untenable, situation, and I, hear you saying sorry, but sorry does not suffice and what I know that the community is looking for is going to be action.\nThat's great, but really you know that what we were looking for, because we put it in our letter- was looking for a reduction on 36th street or removing one of the one of the shelter sites, because 800 people on one block is really is really too much, and I.\nI worked in a homeless shelter, so I understand a lot of it and there was a New York Times article that recently came out really interesting.\nThat people shared with me It's about families, but the thing I wanted to say is that I am understanding of the situation as we all shared why this needed to happen.\n16 are raising their hands, I'm, going to call on people from West 36Th Street first, because those are the ones who are absolutely out of their minds and then Nellie will bring you in and bring you out.\nOn, West, 36Th street alone, no less the entire community promises of monthly committee meetings.\nI can't express how suddenly the street state changed when the residents moved in at the end of May. Dhs has said that the safety of the of the shelter clients are their top priority with little no regard to the residents.\nWhat I do want to know is what is DHS going to do to ensure that such a glitch does not happen when the people that are staying at the hotels in our district are eventually moved back to either a more traditional shelter setup or to other hotels, so that we do not continue doing this shuffling around and just shuffling the problem from one place to the other, because otherwise this is not going to end, and Thank, you so much, I'm on West, 37Th Street and my biggest question about security.\nSo I want to note that we're taking down the questions because we're going to ask DHS this in a follow- up letter , it's Joanne, Violante, I'm, a resident of West 37Th Street as well.\nI, would like to know the number of the total population that's been placed south of 42Nd Street.\nWe need a comprehensive plan that is going to address all of this, because we've I've seen published reports, I'm in the industry, I'm an event planner These, the homeless pro could be in the could be in these hotels through October.\nEverybody is at danger, as the last person said, not just the individuals that have been relocated onto the block, but the people as well that live there.\nWe discussed the relocation from the Jack Ryan and just the dispersal of those people, I'm like question Really Is there a plan for bringing some of that population Say half of them back to the shelter.\nWe need to have a working relationship with where, if people, whether they are homeless or not, they have 10 seconds.\nI walk from my office on Fifth Avenue, up multiple times, I'm in a nice way, I'm, actually meeting a number of different single females, and things like that because they are cl.\nFor people who are now most likely permanent fixtures of the neighborhood, the Genie's out of the bottle, so I think if this is direct to the DHS, the best thing you could do for us right now is give us details of a security plan that includes the fringe areas of the nucleus, which is 36th and 37th street, so that plan within a few blocks, I think, is your first step.\nSo I live on 54th street, I'm, A former social worker, I'm, an HR consultant and I have worked with a number of organizations, doing homeless, Outreach, supportive housing, etc.\nThank, you first time at this kind of community meeting, I'm a little nervous to speak, but I live on West, 44Th, Street and really speaking about my experience near the skyline, I.\nThe person who spoke before me think it's important that DHS and this community board hear from viewpoints of people Sometimes.\nThe loudest voices are people who are experiencing immediate dangers and need help and want to figure out how to deal with bad situations, so I have walked by the Skyline hotel, daily.\nWe are a practical on the ground, solve problems community you needed to hear from a lot of the people in the worst affected area, which is right now 36th and 37th, streets, and I hope.\nAnd I want to say this to the committee members and for all the people in the public.\nWe have no choice, but you know, let's get them off the street, so people have to witness them but put them somewhere, even if it's in the hotel.\nYou facilitate this problem with DHS and the and the mayor or whatever we can do to petition this west side got a shelter out of their community.\nYou know one of the things that we have been really pushing for and advocating for which I think was actually communicated quite well through some of the members of the public.\nYou know that DHS takes a much more of a leadership role in recognizing they put this many folks into our district and how to manage them and how to coordinate that response on handling the quality of life and the public safety issues that arise, because, as folks on this committee know folks that sit on other community advisory boards for other shelters that are in existing shelters that are in our district and and also supportive housing facilities in our district.\nIt sounds like DHS is finally coming to the table and saying yes they're, going to start those meetings, and I think.\nThat does not solve the main issue here, tonight, which I think was clearly communicated, which is just you can not have that many folks put implanted into a community into a block like that and and expect nothing to happen, and so, as you guys already know, you've written a letter and they've written back.\nTherefore, DHS has to come up with a plan in general on how this process gets managed both to benefit the shelter residents and to provide ongoing public safety for the community, because it has created problems where none existed.\nAnecdotal issue, So Our requests in a letter are here Well come up with a plan, and you must reduce the density on 36 and 37 streets, because it's just not working, and it's not tenable.\nWhat's helped 47:48 and 49:54, and 44th street and 46th Let's get people in the Block.\nYour point before, which is very accurate, is that we need to make sure that DHS takes charge and does not leave it to the hotels to decide where people go.\nUnfortunately, a homeless person was killed, and so what I wanted to ask DHS earlier You know they talked about the extra security, but we actually need to know asap.\nI am concerned about the number of schools that we have in this community and how the opening of schools is going to be affected by the number of homeless people out in the streets, especially those that are persons that have committed crimes in the past.\nSince we've received a great number of people in this community that are homeless, how is this considered?\nWe also had another email from catherine who actually spoke about her and her husband, who've lived in the community, 40 years, they're, 71 and 84., and what else was I going to say the thing that I just wanted to share with everyone.\nThe thing that stands out to me right now is that you know this is not about putting homeless people onto the streets right thinking about the letter that I just saw it's about what's occurring on 36 and 37, and for the people who have to live there and the density and the way that they are in fear of stepping out of their home even during the day to do normal kinds of things like go to the store And How they're being impacted and how they're being impacted in relation to their safety, their physical and their emotional and mental well- being, You know, DHS has impact here, but it is about our electives and about the administration.\nWhen I found out, I heard that people on 79th street were going to be relocating.\nI'm, the chair of Community Board, for I first want to thank Joe and Maria for running a great meeting tonight and for all of their efforts on all of this Gail brewer's office Has been working on a letter to DHS as well, and that letter has not come out yet because I'm going to be quite frank here, Right now of the press to send a letter saying people need to be relocated.\nWhat I was going to ask is that each committee member send myself Joe and nelly an email indicating I need you guys to look at the budget."
        }
    }
}