{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCab8cQO05yzQl4X29mejN2w",
            "title": "Housing (Advocacy) Committee meeting",
            "publishDate": "2020-11-11",
            "shortDescription": "HPD Presentation on Dean and Bergen Street lots",
            "lengthSeconds": "1:42:17"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "6ts93SdHCIw",
            "fillerWordCount": {
                "uh": 105,
                "um": 380
            },
            "readTimeFullTranscript": "55 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "housing": 71,
                "sites": 39,
                "project": 33,
                "land": 29,
                "zoning": 27,
                "units": 23,
                "buildings": 20,
                "neighborhood": 18,
                "building": 17,
                "program": 15
            },
            "wordCountSummary": {
                "housing": 15,
                "sites": 15,
                "units": 8,
                "zoning": 8,
                "land": 8,
                "neighborhood": 6,
                "envelope": 5,
                "need": 4,
                "space": 4,
                "buildings": 4
            },
            "fullTranscript": "Are really great for making the program affordable results in higher development costs, and so we tend to see that minimum threshold, that's 75 units, and so the development of one larger senior building could be built with less city subsidy than building on two smaller senior units, which would be more expensive and also result in inefficient buildings. So, therefore, HPD is proposing to fulfill the 80-100 unit, commitment on site b and that we're able to provide an opportunity for another affordable program on site, a which is helping us with the furthering fair housing goals. I think we've heard from numerous we've heard from numerous engagements, or rather materials and stakeholders that there is a need for affordable units in this community and so addressing the or fulfilling the senior commitment on site. B really opens up another opportunity on site so just to bring up these project goals and in order to in order for us to achieve these goals and optimize these sites, we've analyzed other zoning designations, and so we want to gather your feedback about the design elements like heights in bulk, which can vary to influence the look and feel of the building, and we look at different combinations of that to allow us to fit the minimum threshold of the units and the square footage that goes with these community facilities and open space that we want to achieve here in addition to delivering feasible projects. So we also heard from the kickoff meeting and from questions that have come in about what these minimum thresholds for feasibility are so again for the program, which is the senior program. We tend to see that number at 75 minutes. So, in addition to the square footage of all of those apartments, there's also square footage that goes with the residential service amenity and so in. Considering that the commitment is for 80 to 100 apartments, the corresponding square footage for those amenities, the goal of including the community facility and the goal of including open space for the Dean Street playground in needing basically a certain amount of square footage. And so here we excuse me yeah. So here we see the need for at least 75 units on one site and then similarly for site a where we do not have a program identified at the moment. We do also still want to optimize the site here, so our other HPD programs also have other minimum units at for financial feasibility. So we do not have programming the need for heights and bulks that are identified in the R7A zoning in order to optimize the site for all of these goals that we want to achieve, and so we also wanted to note that, in our analysis for this we notice that there's already several buildings in the media area that are taller than the Max heights for R7A. So here it feels appropriate to to propose that we also heard some questions about what the rezoning boundaries are, and here this is determined along with the rezoning district later in the process. So we can't really say at the moment what the district or the boundaries, what the final district and boundaries would be, because we do not have a defined project. So a decision about this at this point would not really be accurate, there's a lot of variables that need to be taken into account along with an actual project. We also heard some questions about atlantic yards and some updates on the affordability there and how that process, but there were a lot of questions with that process, so I wanted to clarify that the HPD process is a little different from that. These projects would be 100, affordable housing and we are also targeting deeper affordability levels. There's no market rate units involved here and our process includes community engagement ahead of building the building so such as we're doing now with our community engagement, but also coming back when there is a project designated and again for public review. These projects will also go through euler and udap, with a specific project that would be designated and with a defined program, and affordability and lynn can speak a little bit more about this. If there's something to add. But the last thing on this is that developers also documents such as a land disposition, agreement and regulatory agreements that hold them to specific the specified program and the affordability and then on the last thing before over, to Q&A statistics about vacancy rates in the area and New York, City, overall and sort of the concern about why we're proposing new construction house what seems to be vacancy rates. So some of the articles that have recently claimed high vacancy rates. We see that we rely on the New, York, City, Housing and vacancy survey, and which is sorry about that. So we rely on the New York City Housing vacancy survey, from which we know that different types of housing stocks have different levels of vacancy and I can go into a few stats here. So in 2017, that being survey, which is the most comprehensive and thorough analysis, showed that in 2016 in Manhattan, the rental vacancy rate in Manhattan was 4.73. While then Brooklyn was 3.28 and then for apartments where the rent was 2500, the vacancy rate was 8.74, but for apartments with asking rents below 800, the vacancy rate was just 1.15, so we do see start differences and we're still in the midst of the housing crisis, and it's going to take time for us to fully assess the impacts, especially of Covid-19, which has changed quite a number of things in the direction of exacerbating them. Mostly, so we'll have more accurate information about that on rental rates. When we get the newest housing vacancy here, where, for now it's pretty clear that we remain in a housing emergency, we have workers lose their jobs or portion of their inc. We continue to have tens of thousands of neighbors living in shelters and unable to find affordable homes. So we do see a money for the for the new construction, deeply affordable projects that we're proposing here. Well not leave, but I will leave this up on the screen as a contact information where you can reach. We thank you things. While we get back to you, it has been. We have been receiving comments and questions, and we are doing our best. I will ask for your patience and understanding. While we do that and invite you to our workshop on November 18 to talk more about the design features and again on December 18th back with you all in your general board meeting where we can really that we have learned from you all that dijks with what you are saying as well. Thank you very much. Mr Varus, your sound was a little spotty towards the end. Are we into the Q&A segment? Now? Yes, we are, and apologies for my network connection. It I do see that it is body on my end and will try to reach in case anything kicks me off here. Miss Granville, you have the ball. Yes, I wanted to know. Can you hear me yes, okay, I wanted to know. Is there anyone else, that's going to present after you or are you the only presenter? Excuse me: okay, all right so Adam, I'm going to need your help. Cause I really can't see the chat with the names on the side. So I know people were sending questions in as she was talking hold on a second yeah. Do you want me to read some of the questions? Yes, that would help. Let me this I'm just going to find the how they the first one and I'll just I, can either read the questions or name that we can. Let the people ask the question that they I do not okay. Well, you can. You can read the ones that you can understand. If you have any problems, then the actual person can ask the question themselves. Ms Granville I think we should let the person ask the question because I see in the chat. Some people ask multiple questions: okay, so Adam, if you can just call the name. The first question was Sarah Lazar hi there yeah, I'm a board member, and my question was I. Think you maybe answered this question, but it was whether the because you talked about the number of units that you're aiming to create in the building in site b. That would have the senior housing and I was wondering if 100 of that building is just going to be the senior affordable, section, 8 subsidized population or if there was also going to be other populations in there, but I think I think you said that site B was just going to be for that senior section 8 and then for site. A I understand that HPD has not yet figured out what population they're going to target for it, but I guess my concern would just be that if it's going to have I, my hope would be that it would be a hundred percent extremely affordable, because I mean it's just such a huge opportunity there with a piece of land that belongs to the city. I would hope that it's you know their for-profit housing is all over the city, but this is an opportunity to do completely deeply affordable housing I mean eventually I. Think people are going to I. Have questions about the zoning envelope, but I'm sure other people are going to ask it. So those were my first questions yeah, so we can confirm it is a hundred percent, affordable senior housing on site b, just senior population and for site a it would also be portable units. Is someone from my team, hi everybody, yeah I, guess for everybody from HPD to do a quick introduction. So if we want to jump in for questions, we can so I'm Lynn good to see everybody welcome to my kitchen and I'm with Brooklyn planning at HPD. I work with catherine, so I think I saw I saw Foma and Addison and Michael maybe Michael's on, but he foam is the director of pre-development. She works with Katherine Neighborhood planning, so that's HPD, but yeah on the second building. That's not the senior housing. It will be a hundred percent exactly for the same reason, Sarah that you brought up. It is really our only opportunity to 100 affordable housing in this neighborhood, and so certainly that's what we're going to ask for in the RFP and in terms of the type of affordable housing, whether it's another senior housing or you know, family building for family housing or homeownership. So those are the things that we're going to you know kind of like get people's ideas on for this RFP and that's what this community outreaches for, and certainly we just Wanna be able to take advantage of this opportunity to give as much affordable housing- and you know like we know how wonderful community is so we definitely want to open up that opportunity to others to have that opportunity to live here. Okay, I'm going to cue up the next question then, which was from daphne evatar hi. Sorry, I'm, okay, here's my camera thanks! So thanks for this presentation, so my question: it's really partly a it's a question and a concern. So I live right in the neighborhood right near the proposed construction sites and as everyone who lives in this neighborhood knows, we've been there's been construction going on for the last 10 years on the Atlantic Yards Project Pacific park barclay center, all of that, but 17 high-rises, and it's been really. It makes it really hard to live here. It makes it extremely loud and noisy and so I understand the need for affordable housing. My our concern is, there are two major concerns. One is changing. The zoning which would allow for extra I, encourage new construction in that entire block, and primarily the concern is that it's not clear to me, given the real estate conditions in New, York City right now. The vacancy rates, which are the 2017 vacancy rate you mentioned, is not relevant at this point and Covid-19 has completely changed the dynamic not only of where both of where people live and where people work and I think it's irresponsible to embark on a new construction project before determining first. Are there more efficient ways of creating affordable housing in this neighborhood and all sorts of places when there are so many vacant buildings there's so many vacant commercial buildings, office, space, residential buildings, I know some of that is temporary, but some of it is not, and if you it does not take a lot when you know you read predictions about the city, no one's expecting the kind of office work to go back to the way it was commercial spaces were already empty, even before Covid-19. So what I'm asking is, why has an HPD done a serious study into the feasibility of transforming some of those spaces into affordable housing which could be done much more quickly and would cost much less city money? And then you could use the HPD lots either for low-rise housing or for open space, which this community desperately needs because, as you know, there are 17 high-rises going up right here. So I really think it's important to take that into account. I do not mean to just complain. I really I would love to see more affordable housing here, but I want it to be done efficiently and effectively and not amid tons of vacant buildings. It seems really irresponsible and environmentally damaging. Thank you did HPD have any response to that or I mean I think that is definitely that's a really good idea in looking at you know converting commercial and vacant residential to affordable housing, and certainly you know we will take that idea back and we should probably start looking into that. But I think the truth is we are still in the housing crisis for sure and I think you know, and Covid-19 has definitely impacted those in need. So much more so I mean I know it's going to take time to see exactly what the impacts of Covid-19 is on the city, and that is changing every day. I mean, and you do not really know what the future holds for the city for this country, I mean there's so much uncertainty. That's for sure, but we do know this planning process is still it's a long-term process. So what we're talking about today is to plan for the ability to build a few years from now, and so we want to make sure that we have the ability to build to make sure that people, low income or middle income, those who can't afford to live in this community is able to especially for the low income seniors. So that's you know and I think those rates will change and it's really hard to verify exactly. What is you know? What is what is going to happen a year from now or a year and a half from now so, but we definitely want to open. You know, keep this dialogue open and- and you know, the idea of looking into converting commercial space into residential would definitely expand. Our housing stock and prices of housing would probably come down because of it, but but I think for now we have to kind of plan for these two sites that have been underutilized by the city for a really long time, and so, and so that's what this conversation is about today, all right. Thank you. Next, we had a question from I'm sorry: it's either. Louise Galdieri or Louis apologies, hi, I do not know. If can you hear me? Yes, go ahead, hi there, okay! Well! In a way daphne asked my question, but I more broadly. What I'd like to know is: why are we being presented with conclusions? You said that you spoke with stakeholders and you drew conclusions and the overall conclusion that you're going to go ahead with development, which is how you began. The presentation when there is so far as I can tell no publicly available analysis of the current housing situation. No publicly available. Now, no publicly available discussion of your findings from conversations with stakeholders. I'm a little confused here. I do not see any documentation. That would lead me to believe that HPD did its homework before making this decision, but rather it seems the decision was made and now you're backpedaling and looking for ways to justify it and you're going to issue an RFP. Now without any zoning parameters, that's a meaningless RFP. That's it's impossible to respond to that in any meaningful way. I want to build a 400 story tower or I want to build a one floor. Hut, there's just no way that RFP can mean anything. So I would like to see HPD do a little more preliminary work show the need in this neighborhood show the need to build on those specific sites and specify exactly what you plan to do before you issue an RFP I think this is bordering on arbitrary and capricious. So that's my comment. Okay, since that was a comment unless someone HPD wants to address that specifically I'll I can move on to the next question. It was a question. It was. Why have not you presented any analysis to the public? Why have not you made this analysis public? Why have not you shown how you came to your conclusions? Why have not you shown your work? That's the question. Thank you, Lewis for your question. I! Guess I'm not I'm not quite understanding. I mean this is. This is what we normally do from experience from the city-owned sites that we have across the city. We do not have that many anymore. Hpd does not have that much sights in our jurisdiction and I. Think you know: we've been tasked to try to create quality, affordable housing across the neighborhood and across the city on city-owned land and because of city-owned land, we're able to leverage that and we're able to get affordable housing we're able to get community facility uses for those housing. So this is an RFP calling for developers and non-profit developers to submit their ideas based on the things that catherine laid out in the presentation tonight. You know that we have a commitment for senior housing on one of the sites to and it you know, in order for it to be efficient to construct, it has to be. You know, hit a certain number of units, so that's one, and then we have an opportunity to build another 100, affordable housing on the other side and as this process go on and I really, you know I want to just re-emphasize and reiterate that this process is very long. But this is a very beginning, conversation of this process and we're coming to you and showing you these. We have two sites and the city has intention to build. Affordable housing, we're the housing agency. This is this is kind of what we do, and so once we put that feeler out, we get ideas back. We evaluate those plans and then you know, based on you, know, a bunch of stuff, including developer capacity experience in building. You know their designs of the site based on feedback we're hearing from community during this period amassing and such and also they're. You know we're looking to extend the existing playground on. Is it Dean Street on Dean Street slightly? You know to expand the passive open space there, so we're not building on the priority of the city-owned land. So with those parameters we want to see hey. What is your best shot? Give us a good project that we could bring back to the community and then once we have that because reason, because a city-owned land, we can't just sell it right. We have to come back to the community through the uniformly unused review process and I know because we do not have that much land cba. We do not come to you that often, but we did last year with Weeksville ncp. So that's an example of city-owned land HPD own land that we needed to go the community for euler for disposition and udap, and so it would be the case here as well, but in addition to the the Udaf and the disposition city of land, we're also coming back to the Community board for your review of approval and input on the rezoning that is being proposed. So I think you know like with a lot of rfps. You know we, our intention is building affordable housing. You know- and that is that is the fact. That's. You know, intention to build 100, affordable housing on these two sites and then we're asking people to come back with their ideas that you know the best idea and the best building that fits into this neighborhood and what we hear from individuals- and there definitely is a need for affordable housing, so so I think I mean I'm not sure that fully answered question. Probably it does not answer my question and it does not inspire confidence that Apd is taking the community seriously. I think what you're doing is you're presenting us with a Fed accompli and then you're telling us to just cope with it. I. That's not our intention, but we are here to listen to you. So I think you know any ideas you have for these two sides. We are, you know we are here to listen and to take notes. Okay, I'm going to just keep moving I know that there's a lot of people who've asked multiple questions. So what I'm going to try and do is just keep going and go to each person individually. So if I skip over a second question and then perhaps we can go back and people can ask additional questions, but this will give everyone the best opportunity. So there was a question from Leslie Dan that was nick hi I just wanted. Hopefully, two quick questions. It seemed like site a on bergen is only using half of the parking lot and I wanted to know why it's not using the full parking lot in its footprint and also just the practical question about the survey on the HPD website. What's the deadline, so everyone knows to fill out your survey and input on the map. Catherine, are you able to get that I think the the site? Okay? Is the one I'm working correctly so yeah, so we actually do not own. The other parking facility there. So what's being shown on the map is the one that is not kind of circled around is privately owned. So we're only talking about the property. Okay, I think Catherine's having some Mic issues, I think she maybe is trying to speak, but we can't hear her. Maybe catherine, if you want to add anything to the chat to respond and the other question I guess is the the survey. If there's a deadline, you have an answer to that. If you can just put the deadline on the website, that would be great because I do not see one. Thank you. Thank you all right, so I'm just keep going. I have a hard time reading the chat at the bottom, while I'm trying to keep track of the questions up top. So next we had a question from Amy Sumner and Dan Jacobson. If they're on the line to ask their question, yes, but I have to find the question: why do not you read it out? If you can so, the question was well that maybe this it was, how can you issue a meaningful RFP without specifying zoning parameters? Can someone answer that hey yeah? Can everyone here? Is that catherine again, we can hear you sorry, I'm having a lot of my connection. Okay, thank you. Having a lot of issues with my connection, it was. How can we issue the RFP without a district, so we are identifying a zoning district in order to give developers an idea of how to respond to that in order for us to get projects that we can compare in a meaningful way, and this is we will view the students that we receive. Okay, ask a follow-up, so it sounds like you're just assuming that zoning will be changed for both projects. Yes, I think we're here sorry go ahead. Catherine, we are assuming that, for because of the project goes out in order for us to see all of those project goals addressed, we do need to specify a zoning district and give developers an idea. Okay, we had a question from elaine Weinstein just need to okay good evening. Actually, I'd like to follow that last question. If you are submitting zoning goals- and you have an understanding of the zoning you're going to be requesting from developers, I think it's appropriate to share those with the community, so we can comment on it before you include it in an RFP by the way that was not the question I submitted, but I'd like to follow up so catherine. If you could answer that, we'd appreciate it yeah, so I think that it about zoning goals rather about the floor area and heights on both are needed in order to achieve all of these project goals. So there is a lot of different zoning districts that can achieve that. We are identifying one. We may see proposals that would propose within that district or something else and meet those goals, but I also want to reiterate that we would be back to the community with the project that is proposed for, or rather designated for. Your feedback I appreciate that. But there are many people on this call who have already stated their through writings to you. Letters and comments on last calls that R7A is not a zoning that we are supporting and therefore that's what you're putting into your RFP. We have real concerns and we think you need to reflect what a majority of the community would support yeah. So our community visioning report is a section of the feedback that we heard from the community. At this point, we can not say that the majority of community members have expressed that they do not support that right. Now, our data does not. We need to finish collecting data and I, hear that there's not support for the R7A among some people, but there is support from others and we're presenting a comprehensive picture of everyone's visions who are participating in this engagement. Okay, then, we'll make sure that you get a lot more feedback on that. Second question, however, is you mentioned open space, I'm just interested or we're interested in understanding where you see this open space being added sure, there's side of the Dean Street site closest to the playground itself is the area that we're looking at in order to square off the playground. Okay and then, lastly- and this is more a request- that we asked for HPD to put together a much more holistic, a broader holistic review of the entire area and including M crown, because right now m crown we understand- is on hold. Yet you are moving forward quite aggressively with these two sites. Now, as you know, many of us support deeply affordable senior housing, but we would like any kind of zoning change or a large construction to be looked at in a much more holistic way, and I'd like to comment on that yeah elaine. We appreciate that comment. I, think the good feedback for you to let us know on the website, through our map and through emails as well. I also wanted to clarify that this process is growing faster than our process in general or overall. This is the timeline for the rfps. This is an HPD project, and so we are following our process and with the timeline and milestone unless we that we just signed okay. Thank you very much. Okay. Moving on and I, you know, I appreciate people asking you know two questions that relate to each other. I just ask people be a little just thoughtful of how many people want to ask questions. So if you can limit it to one or maybe two, if it it's a two-parter just so we can keep moving and make sure everyone gets the time. There's a question from Jesse I do not have a last name. I do not know if Jesse is on the line. Still, if I do not hear from him, I could ask the question myself: okay, so Jesse's question I think it is pertinent, was: has there been any consideration to sell or trade the land and use the funds to purchase larger parcels with better zoning in less expensive neighborhoods? It seems you would be easier to achieve your goal of creating more affordable units. That way. No, we have not considered selling a city. Land I mean we're the housing agency, so that is that is their mission. You know it's the policy and also we actually do not have a lot of land in neighborhoods like this and I know. You know it's high value, but it is our opportunity to bring you know folks and give them the opportunity can live here. Otherwise. So, as catherine mentioned earlier, you know the question of fair housing is definitely in play. We want to further expand. You know, opportunities for people to have access to the same cultural amenities that a lot of people here enjoy in this community and- and we definitely want to do this and they in a you- know in a responsible way. Sorry, it's been a really long day. So thank you for joining definitely want to do this in a responsible way. So we are not. You know we are. We have not considered selling this property, you know for money, let's say: okay, Michael Richards, it's Michael, Rogers apologies. My question is: why is not there a more holistic look at this whole zoning question. Most worrisome thing I've heard tonight is that a zoning would be put into the RFP, which is basically going to bake it in based on our experience in this community, and then the size of this rezoning area would be designed decided later, and that has enormous impacts on the community you've already seen here in North Prospect heights. So we really think it's irresponsible, particularly to ask a community to support a proposal that is, at this point vague in terms of hey what the zoning is and b how broad that zoning would be. You could be opening up several new blocks in this neighborhood to redevelopment by other developers, who might well not be as nicely intentioned as the city is, and you know we have you know, rent stabilized tenants living in areas that could easily be affected by rezoning. Why not a broader look? Why not more details? So, as catherine said, we will be coming back after we have the zoning district. You know for the community and right now you know we are coming to community. You know not for an approval, because we have no project. We just have a project. We have two new pieces of land that we want to develop where we could evaluate our keys fairly across the board from multiple developers and multiple submissions. You know we have to have you know some sort of parameters, and so we do have. We would have that one district for the site and then once we have a project and through experience of other sites, what we was with the developer with the project sponsor, we would work with DCP in understanding how that proposed project at that site. What sort of you know how far the zoning district should stretch to make it make sense because, as you know, both of these sites are mid plot, so we need to discuss sort of the zoning rationale with Ccp. But again, as Catherine said, it is hard to give a you know a real answer to that question on what the zoning district and boundaries are at this point. When really we just, we do not have a project and I think that this conversation would be much easier, and we could answer these questions a lot better. Once we hear back, you know from developers, once we get actual proposals and messages and renderings that we could show the community, because we would definitely have to come back, we have to come back and once when the euler has started, we also have to do the environment. The developer has to do an environmental assessment statement which looks at the impact of not just the proposed buildings on the city sites, but depending on where the zoning boundary is how that rezoning would impact the sites are being included in the district. So you know it's a. We do not manage the zoning map, so that is something we need to work with DCP. You know when we have a project right now is so premature. We can't just you know: I mean it's irresponsible to say like yeah, the district is going to go to the avenues is roughly that, but because we do not really know we need to have that conversation. We actually have a project and you know to work out those issues, because some of them are like a little more technical. So when we come back to the Community board with a project we want to be able to be, you know actually point out where the district is and how it's being drawn. Without that we can't really say at that point, though, the general community input is I, I'm afraid that those of us living in the Atlantic Yards Impact area know that once the horse has left the stable things are kind of over for us in terms of having a voice. That's why I think so many of us are concerned now when we see what looks like a similar experience happening. That's just a comment. No thank you for that, and you know, and obviously you guys have gone through a lot of Atlanta yards and I could I could definitely see. You know where the city of landing the arts was through the state, and it does not matter right. It's just all city state government and so I could I could I could definitely understand. You know the you know sort of distrust in when we come to you with that, but it's not for our case, like the euler. The actual euler process is we're coming to Community Board cba for an approval for support, whereas I am not sure with Atlanta yards. It was the same process there, but in our case for the disposition of city land and for the rezoning that would be needed for the project that we're proposing, you know would require an environmental assessment statement and then it's a rezoning as a worst case scenario to study the impacts of you know on traffic on school seats on you know, if there's impacts on historical resources right, this is close to a landmark district. All of those things will be done and it would be disclosed to the community and it's a formal process. You learn as a formal process where we have to come back and you can the board then, with the project in the zone district, you could speak up just you could just vote it down. We hope you do not, because we're coming to you so early to talk about these projects and why it's so important for the city to build. You know the two and two affordable buildings on these two sites, so it you know and I hope you know you do not feel or for again it's this is. This is very early on. We will be coming back once we have a project before the certification of the project and definitely during the you know the whole process itself. So there are many touch points to speak up on this. Okay. Thank you. The next question was coming from alyssa keel, hi, it's Kyle, Alyssa Kyle, so I wanted to ask about. You mentioned that having one larger building is more efficient, financially than two smaller buildings, which makes sense for economies of scale and what not in affordable housing. But can you talk a little bit about how it is determined and what would need to happen on site a in order for two larger buildings to still be financially feasible and what the intended or desired relationship between the two sites is. So will it be? The same developer is site a expected to have higher AMI levels in order to make the overall project need less subsidy. Any details you have with that would be helpful and whether if an RFP will be issued for both sides separately or only will rp's will responses only be accepted if they include both sides together, yeah. Well, thanks for that question alyssa. So this would be one RFP, but we are evaluating the proposals for sites separately. So a developer could apply for both sites and if they do present, the best proposals could be awarded both sides. They could also be awarded only one site, so it is one site will not depend on the other for financial feasibility, we're really looking at financial feasibility on each site, so for site b, that Sarah program fully separate from the site a and the program there. We are seeing financial feasibility at that 75 unit threshold. So as long as we achieve that, that site is good to go for the site, a it would also undergo a similar could have the a similar depending on what program would be there. I will add. That also has demolition costs, and so that also increases the cost of development, and that could impact the budget and what programs are feasible there as well, so that site by itself is also considered separate, did I get through all your questions, yeah with that I think so, just one other question, so the quote-unquote commitment for 80-100 units on these specific sites. Where did that come from and if you, if you can talk a little bit about under the seniors first, you mentioned: there's commitments for preservation and new development. So what are their respective commitments under those I like overall, how many are supposed to be new construction versus preservation? And then, where did the commitment on these specific sites come from the 82,100 like which entities or agencies determined that I'd actually have to get back to you on the exact details of how that commitment came to be? Unless someone on my team has the details for that, but to answer the part about the other strategies, that is a overall a city-wide strategy, and so these sites were committed for new development. But there are other sites and buildings where we are pursuing those other strategies, such as the aging in place and preservation. I can I can try to follow up on an faq question to if you're, seeing how those play out on other sites I can try to look into that and try to update you, yeah that'd be great and I can like follow up an email too. So thank you. Okay, we had a there's a question from Peter Crashes, Peter. Hi. Sorry give me a second to unmute. I want to just first to just explain, because I think I also agree strongly with this notion that we need a holistic plan before this proceeds, but I have some zoning questions, but the zoning, the concern about a holistic plan comes from the interaction between new development. That's been approved here already in this immediate area, right on the same block and these sites media on the same block as Dean Street. We have so many different unresolved problems here and in your you're talking about open spaces being something that you could be addressing and that's really great, but there's something the community has asked for, especially with the potential that the park in Pacific park may not ever happen so and you're adding in you know, thousands and thousands of units of six thousand four thousand six thousand four hundred thirty units of housing, potentially and maybe a little less if some of the buildings are not completed and 2,250 of those affordable units plus a lot of empty. What we see now is empty retail space on the ground floors of the buildings that have been constructed. So we have. We have a lot of different issues that need to be addressed, and what we see here in with M Crown was a proposal to address these things with looking at zoning across the district, but also in looking at public realm potential public realm improvements, and these HPD sites were included in those. So we do not understand why this is moving forward and then I. You know I definitely appreciate the way you're describing interacting with the community moving forward, but the reality and I think Michael Rogers spilled this out. Pretty well is that once that RFP is issued, the zoning parameters are pretty well cooked in because of the baked in, because the building scales will be established and we're not convinced that. Actually this, we do not think that should be happening without addressing some of these larger issues that are assigned to our neighborhood already, because you called us a high opportunity. You know like a an area rich with amenities. This is not the neighborhood that we're in we're in. We have lots of wonderful things like good transit. We have a great you know for those who can afford it good shopping, but we do not have the open space. You can look at the ratios and you'll see that we do not have the space for pedestrians, that a lot of other areas have or the we have, and we have a bunch of like design flaws in the project atlantic yards which are going to directly even impact on these sites, like you have just at the dean and carlton intersection on Dean, Street, potentially very large, intersection delays that will impact these buildings and you have a parking garage. That's just open that that's going to have a one entrance right down the street that could be producing during arena events, really some pretty magnificent traffic jams, so I mean we need to be thinking about this holistically and really talking about what the community needs are in a different way than I. Think I hear you saying and because we are actually the neighborhood, the immediate area, that's carrying a lot of the weight of the new, affordable housing and the new development in this whole district. We already are that, so you know the city can't keep having the same idea over and over without addressing the things that we need addressed at the same time and I think there are plenty of people on this call who know what I'm talking about so I really implore this committee to say: whoa, wait a second there's, no rush. Let's talk this through. We I personally, are the North Prospect Heights Association. We support. We strongly support the use of these sites for senior, affordable housing. Actually, I would say that both sites should be used for senior affordable housing, but at the end of the day, what taking the time to do this right matters and what you're proposing is you know we do not even really quite know what we're doing on Bergen Street. We just want to hear what you want, but it will entail a zoning change. It changes the zoning Envelope and very likely a broader zoning district will come out of it and on the Dean Street side there is not the same kind of precedent in the R6B district for out of scale development, news, walk building may be across the street, but it's set back 100 feet from the site and it's in the c4 I think C4-4 c4-2 zoning district, it's not in the r6b. So when you break that R6B district you're, creating a precedent which will potentially set a just said, sit in way in underway some displacement so from indirect displacement. I think we we've worked really hard on that block to retain after a disaster with in terms of displacement with Atlantic yards with people, wrenching story, I mean I. Think we'd like to share with you some of the wrenching stories that families getting divided because of a displacement, not just direct but indirect displacement, and so, when you put it in a bigger building on that block, you're opening up an avenue to other you know, people who are not are who are for-profit property owners looking around and going. You know what I'm getting squeezed between. You know: atlantic yards here this build building there and I see that one is for senior affordable housing. But you know what I have a good argument to make that I'm my light is infringed upon or there's a precedent on this block for a bigger up zoning for myself and they will go for it. You everybody here knows they will go for it and that that's where the indirect displacement that direct displacement actually but I mean we will see it I promise you we will see it and I, so I want to go back also to even like just because I think hidden in all of this, and each one of even like the notion of an open space benefit. Is that what you're? Probably really talking about? Is that they're their rights right that the that you would be taking this as a specific zoning envelope? Moving? Are you because you can't say that you're going to fit 75 units of how senior housing in inside of the site on Dean Street, without without some of that, some of what's getting displaced going on the top? So I think, can we just be of the building that's being built. So can we be clear what we're looking at here and you know what kind of what kind of mechanisms do you already know are going to happen with the kind of things that you're proposing here? Ah so Peter, we hear your concerns. Thank you for that. It's definitely taking notes here on what you're saying I want to make sure that we are understanding your just because it we did hear a lot of concerns. So I'm not sure what the question is. The question: well, I'm going to have another follow-up observation which is related to process that, but the question here was it I want you to be providing much more detail about what you're thinking in terms of zoning, because I do not I think that you're it's you can't fit 70. We know that site on Dean Street you with in R6B. It says 58 units you're talking about 75 units, minimum I think with the senior housing. So what are you? What is the minimum zoning envelope for that? For that? Building that you need to put there and are you shifting your rights? So that's one question and I think it would be similar on bergen. It's actually like you're, just starting with the zoning envelope and saying, what's the what's the, what are you you're asking us how we want to fill it? That means you guys know what zoning envelope you want. I mean it's not like. So why do not you just be explicit here, so we can talk to you with. You know in the way that you want us to about how we're supposed to shape this neighborhood you're, just not you're, not being specific. You did the same thing during the kickoff meeting and you know we had to squeeze out of you that there was going to be extended. Zoning districts the DCP had to they basically said we do not know what it's going to be, but yeah there's likely to be extended. Zoning districts so come on. Let's get real here. You can't come to this committee and come to you know somebody who has been through what we've been through and knows what we're going through still on a daily basis, and everyone talks about construction. It's not construction, it's operation and implementation together with the city doing nothing, even though it has the power to do stuff and actually, frankly, the community board itself is responsible for some of this. Some of the members here know that, because this can be done much better, so we want you to tell us first off how we're going to get why this is proceeding without a holistic plan and why you are not I. Just want you to tell us specifically what you're doing with the zoning, because you know it. You can't tell us that you know you do not know what you're doing on Bergen Street when you're. Just you have a sketched out zoning envelope there for sure that you're filling the program into you're, just asking us for a program and in terms of the Dean Street, you have a specific unit minimum. So you know and you're talking about adding open space. So you can actually tell us what it is now. So why not tell us what it is? Please thank you Peter. That was a lot to unpack, but I, if I'm hearing correctly so the air rights you're talking about you're talking about what we discussed as like future open space on the very side right, so whether we're using floor area that's associated with that portion since we're not developing on it. Are we going to use that floor area on that building? That's one question, so I'm not sure we're going to have to get back to you on like how we calculated. You know whether that envelope to fit the minimum amount of senior units on the dean's side, so we would get back to you on that on the other stuff it's these are, you know, they're very small sites and I think you know I. Think I hear a lot of frustration with the community members here because of all the development that's going in the area, and you know so. This is another one, and so I totally appreciate that point and you know do not want to you know miss it in any way. So we will, you know, try to get you as much information as we can, but you know we I want to just go back to our earlier point, and you know I might be believing a little bit, but the amenities that we're talking about here is not just you know: it's transit, it's also a good school. It's also like I hope you know outcomes. So that's why we think it's so important to develop here and not to sell it and to use the money to buy into. You know a neighborhood that you know that real estate is cheaper, I mean so that's why we are coming here to try to develop it and then, and then I think catherine. Do you want to you want to speak a little bit on kind of the on the zoning zoning question at this time, or do you think it would be? It would be something that we could go more in depth in the during the urban design portion of these workshops. This is this. Is a committee? That's actually meant to be discussing the value of what you're proposing and what's what are you proposing? That's what I'm asking I'm on I'm on the I'm, a public member of the Land News Committee, I'm a committee member asking you that question. Please specify the zone I mean the zoning envelope. You do because I know you care. I really do we've spoken. I know you care, but I also know that you're not answering my. So I'm just asking you very clearly. You have to know what the options are, that you have for the Dean Street site and you have to sure, since you're asking for a program for the bergens site without any correct your you must know what you're roughly you know, roughly speaking, what you're talking about for the for the bergen site specified R7A in the in the on the website, just being what you're proposing there's one step down from that that's r6a, we all I mean those of us. We all know that and then it drops down to our S6B, which is what it already is, and you can we've already acknowledged you've acknowledged that you can do 58 units in each site, so you can do the you can fulfill wherever this 80 unit commitment comes from and clarify that those 58 you can, you can put those together and clear your units on both sides. So again, let's be clear what you're proposing, because it does matter on the ground for the for the community around it a hundred percent matters. So this is a housing committee date, but it's a joint housing and Lane News committee. So we could be asking you what is this proposal? It's not it's not a ghost proposal, it's a real thing, so you should be able to specify to us what the details of the zoning are here. Just ask you to do it again. It's the same question so I think to achieve you know the 75 on one site. We could not do it on the current zoning right. That is for sure you know, 50 58 I mean I, do not even know if we can get 58 on the site and that's you know I think that would that would just result in a financially and feasible project here and because we want to optimize and that's my the ability to provide housing on these sites. We are looking for a larger zoning envelope, but one that is not out of scale with the surrounding neighborhood and some of the buildings like right across the street and I mean to be honest, I think if catherine wanted to step in I know, we had talked about the we included the R7A and the talking points we did yeah. So we are specifying the r a on both sides and so to address a couple of your points. One us building it up between the two sites again leads to two small senior projects that are inexpensive, I mean inefficient and inexpensive and time when we also need to be mindful of the amount of public subsidy. That's going into these projects. We are looking for that efficiency as well. Both we're looking for that efficiency as well and for the site, a that is correct. We do not have a program specified, yet we really will communal engagement to inform what should be put there. What affordability is we want to see there, but again we have to take into consideration the project goals here. It's not just housing, it's community facility as well, and the square footage that comes with that and with the cost for developing that site. We are looking at financial feasibility as well, which is going to result in on proposing more use on that site than the current zoning allows for, and so we do not have a program for that. I do want to specify that will be informed by this community engagement process, but we are proposing the R7A as an example of what could be there and what could accommodate that project. I just wanted to say this is the second point that I wanted to make Mr catherine, because we've been a couple weeks ago. We approached you guys about a problem with the email address for the website and since then, I've heard gotten more feedback that there's a problem with the emails and actually the site of the app that you show for this site: B, Bergen, Street or site a site, the Bergen Street site. I've also heard that that's not accurate, that the it should include 520 bergen as part of the HPD site, and we looked on accuracy and it looks like that's all been merged 520 into one tax lot, so it makes sense. But what you're, showing on the map and what you showed during this powerpoint is actually a smaller site than it actually is so I just want to yeah am I correct. Yes, so we've been in contact with the community member who alerted that the email address has been corrected on the website. We do ask that if you see it incorrectly in other places to please let us know and we'll be more than happy to correct that and as for the maps, I believe that was corrected as well. I'm going to have to double check because it sounds like as of today. It was not, but you ask for your patience and understand. Yeah I appreciate that, but I think that, in terms of the email address issue, we raised that with you before the kickoff beating, and so if they were still having trouble with it sometime quite recently that took some time to get fixed so, and maybe that explains some of the input that you're getting might be limited in that respect. Just to let you know, yeah thanks Peter, we did address that quite a while ago and we seem to be in connection with community member who has alerted us who has been speaking with us for quite a while with the correct email address. So we are aware. Well, this has been truly exploratory. I see that we do have a quorum for the land use committee members. We have 10 of those folks on the line. So if we want to explore some business this evening, we can do a roll call and entertain motions if Miss Granville feels the same, and she has the same alignment and presence of the Housing committee, Mrs Granville there were can I just say there was like I, think three more people who I had not gotten to if that matters I know we're running Jordan time. Okay, thank you. Mr Sax, again, I do have a quorum of the land use committee. Members and I can run through that. If I can see enough hands to say we want to do business this evening and put an item on the table, especially related to the zoning, a question on the zoning and I'm pretty sure people can figure out where I'm going with that. So let me make sure it's apparent to everyone that we have a quorum for the land, Use Committee, Princess, Ben James, please unmute yourself and say aye that you're present okay, this is not going to work. Robert, Callahan, I, Nora, Daniel, President, I. Think I hear you. Thank you Mr Callahan! Thank you! Miss Daniel Miss Granville! Yes, I'm here! Thank you, Sir Zima, Jordan, okay, she was there. Oh she's raising her hand. Did you see her hand? She raised her hand. Thank you. Okay, call your name, please unmute yourself and announce your presence. Peter crassus I know you're here Peter. Where are you? Okay, Sarah Lazar present I see Robert Puka present. Thank you you're. So Weatherspoon, please unmute yourself and say: aye I see her panel, but no response and our itinerary present Sharon Webber, no okay. So we have lost our forum and miss Tyus Yes Kathy Island is here. You did not call my name, I'm sorry, Kathy! Let me mark you down. Okay, that's good! That's good! Let me go back and see. We do have a forum nope, sorry, next time, we'll advertise a business meeting rather than a discussion, because I would have loved to entertain a vote on the position on the R7A and, above whether or not that's something we want to encourage or discourage in this planning process. So I'll put that off for another meeting in the future near future, I hope and well. I see. There are some more questions, so I will ask Mr Sax to check in the chat for additional questions for the HPD representatives this evening. Thank you, apologies, okay, so I'll just keep going so the next questions. Oh, it was cut coming from Kathy, Island, Miss Island. Sorry I was unmuting myself I wanted to thank the city planners. You know the team, that's here, giving us this presentation. Thank you very much and I just want to reiterate that a number of us in the community have really had some very serious discussions over the past 10 days about this notion of holistic planning and we all in the immediate neighborhood, the three or four surrounding blocks as part of the North Prospect heights really support senior housing in our neighborhood, but it's being I think I. Think what we're seeing in your presentations is it's unrelated to what actually happens in our neighborhood and this and the notion of zoning first and talking later it seems such a backward process and Rath I'm trying to form this in a question. But it's a it's a question to you to please listen to what we're saying about the need for a closer look at the conditions in on in and around the sites that you've chosen and that you could make a commitment to this community and I understand you're gathering data, but there's a lot of data that I do not think you're hearing. So it's my question is: could you please consider the notion of holistic zoning as part of good city planning, rather than the process being backwards, because once it happens as we've seen in this neighborhood with grave consequences, you can't take it back and we would really like to be part of the project to offer senior housing and it would really be again I'd like to second what Peter's saying you I think it would really help if you tell us what you're thinking of doing, because it's very hard to imagine, you're asking proposals for a site on Dean Street site, I'm on Bergen, Street side a and you do not have some idea of what you're looking to build there. I do not think that's respecting our community, our land, Use Committee, our housing committee or the Community Board. Thank you very much. If there was a response, otherwise I think there were just two more people who I had not gotten to and I can at Sharon had a question, but she had to step away. So I can ask her a question, but let's go next to give for coney yep. Are you still here? Gibb might have left. So let me just go. I can ask their questions, but let's just keep it going because I got ta, find it so I think the last person who had not had a chance to ask any questions, I believe was hector. I'm trying to find it. I just wrote a question from Hector. Robinson, yes did do you can do a question just alerting you to the fact that hector wrote a question from yeah? No, oh you're, not hector yeah I think hector might have left. He might have gone to the CB9 meeting. Oh okay! Well, then, let me if it's if it's okay I, can ask Sharon's question she asked me to, and so let me find that just for a second it's hard to scroll the chat she wanted to ask. If you could talk a little bit about the subsidy mix that would allow for the commitment for site b, for example. How would you how would the subsidy mix support households between 60 and 100 of AMI to community members that have been displaced? Yes, oh, go ahead! Katherine! I'm sorry! My sound went for a second there, but to clarify Sarah buildings are limited to seniors in the income bans between zero percent and fifty percent AMI, so it will be limited to that population and I did not catch the second part of the question about wider community and people who have been displaced. So if you could, please repeat that, oh yeah sorry I got ta find the question again, so she was asking how the subsidy mix would support households between 60 to 100 percent of AMI. How would the subsidy mix I do not really get the question? I'm sorry I. Would the subsidy mix support households between 60 to 100 of AMI to community members that have been displaced, okay, yeah? So there's a couple of things in there, so I'm only zero percent of 50 percent amis and for these senior buildings it they do go through the lottery. The housing law so even might see a I'm not entirely sure how to answer the part about the displaced because the building is marketed through the housing lottery that would be open to New. York I understand, okay. So that concludes every questionnaire. So there were additional questions from people who have already spoken. So I'll just ask for the chair to direct beyond on how to proceed or move on Adam. Yes, you're, muted, Miss, Greenville, okay, yes, okay, Jeb had a couple of questions and I can't find him, but his questions were actually questions that other people had not brought up. I thought I thought I looked at gives and ever all of them seemed like they were responding to other people. I just want to say that I appreciate the people from the community bringing out certain points, because some of us who have been on the board have gotten so used to the way HPD does things. So I'm happy that you're questioning the process because I understand what your concerns are and when I chaired the committee some years ago, when the Atlantic Yards was being built, everybody had concerns with the way the process had gone and people were not happy about it. But at that time we had a broad president who loved it so it went through, but I'm hoping since this is going to be a euler process, that it would be a lot better for the community in terms of input and in terms of insight than Atlantic. Yards was because, basically, once the state took over, they just bulldozed everything and they paid you no attention. So I'm happy to hear differing viewpoints and I'm happy to hear new viewpoints on what we've been looking at for a long time. I thought you can make your remarks. That's why you still there she appears to be but she's on mute, oh trying to unmute myself, okay! Oh my gosh back on mute, miss ties, yeah, I'm having a problem, I'm stuck here! Okay! Now you can hear me now. I! Think! Yes, okay! So basically I think this was a repeat of what is on the website and if we had a forum opened with the idea of doing business with this item and the roll caller would have called for a motion on the zoning to provide HPD with true feedback from the community, because I'm hearing from HPD that people in the community say this that in the next thing, but we do not have a record of that and we do not have a record of HPD coming to either the housing committee or the land Use Committee on this item in the past. So that is a bit mystifying to me and going forward I think we should invite HPD again, I'm not sure exactly when. Maybe they consider us when they want to come back so that we provide some real guidance in a structured way after another discussion with some of these things have been cleared up and see if we can put something on the record so that HPD can point to factual feedback from the Community Board on this project on both projects, unless there's anything else old business, new business I would turn it back to the Housing committee chair to wrap up. Can you hear me? Can you hear me? I can hear you, okay, I'd like I want to thank all of you for your indulgence. I hope that everyone had a chance to express their views. I'm hoping, as ethel said, that the next time we meet, we can actually have a vote, and that way we can actually memorialize what people are thinking, because we will have some notes from this meeting, but it was the first time that HPD actually came to a joint meeting to either housing or to land use. To answer questions about this particular project. So I'm happy that so many people got to express their views and I'm happy to hear that people do not think about things all the same way when you have everybody saying the same thing at the same time, you really do not get appreciation for what other people think. So thank you all and if we have any veterans happy veterans day after, if you do not have anything else to say, I would take a motion to Adjourn. Oh I had some last questions yeah, so it I was so a couple things. So it's clear that everybody has a lot of thoughts about the rezoning question and you know I share in the desire for answers about the zoning envelope that it kind of seems like from what I understand from what you're saying. Hpd is not exactly in charge of that as much as DCP, so I was wondering if there could be I mean I know that everybody has tons of meetings, but I'm wondering if there could be another meeting where DCP could be here to answer questions about the zoning envelope. That's imagined, but I in terms of questions more about the HPD side of things. I was wondering about the ownership of the land, so you know it is I. Think a lot of people talked about what a tremendous asset it is to have city-owned land in our area that could be turned into affordable housing. I'm actually I'm actually kind of excited about the idea of producing truly affordable housing in on these sites. But the thing that I'm concerned about when and the reason the Envelope question is so interesting or concerning to me, is about the possibility that the rezoning would give you know free reign to the surrounding buildings, since their far is pretty low. Excuse me, Sarah Adam, could you close your Mic making noise? I'm sorry yeah? It would incentivize it would kind of give a free pass to the buildings right next to the sites to be able to go much higher and they would be producing no affordable housing so anyway, but that's the envelope question, but in terms of the sites themselves, it seems like, with these affordable housing projects. Usually, the practice is to sell the piece of land to an affordable housing developer, who then builds affordable, housing and there's a contract that establishes for how long the affordability is guaranteed and I was wondering if, if that's what's picture, that's what's imagined for these sites or if there's the possibility of the city retaining ownership of the of the land or if there is a community land. Trust who could be sought out for ownership of the land. I mean I. Think a lot of people in the tenant movement are talking about the need for social housing, something where there's tenant control and where the profit motive is removed from the picture and I know that that's not necessarily how the city has traditionally done things, but I'm wondering if these sites could be the possibility could be possible sites for truly social housing. Whoever has them Michael. Please close it thanks for the question, Sarah you're right, so I think the way we imagine this for most of our city sites. We convey it for a nominal fee to developer and then with it. We attach you know land disposition agreement as well as regulatory agreement to make sure that they keep units horrible for very for long term. In most cases, it's like a term and then, at the end of the 30-year term, there's enough teeth on that contract to make sure that they ended for another 30-year term and the way we imagine for a lot of the senior the senior developments, the senior housing developments is, you know we do it through a non-profit and their mission is usually to keep their housing affordable. So in those cases we see a very long-term affordability on those sites and then what you brought up with clts. That is something that the city is definitely exploring. I can't say we have a lot of successful examples up until this point, so in terms of how it works, we're still trying to figure out like how you know how best that works, and I'm not a lawyer and but we do have like lawyers looking into this question, because it is definitely something a lot of community groups across the city and non-profit developers are very interested in to keep to keep. You know the units and affordability in perpetuity, and you know, and so that they may feel down so but right now we just do not have like a you know, a standard model that we could apply here, but it's definitely something that we are the city is looking into, but for these two sides, I think what we imagine is what we've been doing before it's just. We will convey for a normal fee to get the affordability for a very long term. I mean in the in the chat somebody posted about the Interpro clt, but just as another option model, that's out there, the city of Rochester did you know, there's a community land trust up there with. You know hugely affordable housing that is actually controlled by the tenants and is actually quality. Housing I mean I, know it's another city, but it is possible to do things. Yeah. These are could be a great opportunity. Yeah I will definitely suggest that, but I think that the clt model and I could be wrong. I think it only applies to sort of homeownership model like that. That's what we're looking at now most likely affordable, co-ops and because it has to do with like ownership of the land. So I'm not sure if that would particularly work well with the senior housing. The senior affordable housing error on one site, but but we will, you know we're always to explore all those questions and on the envelope I think that's a good idea. You know we just should have a maybe a longer more in-depth conversation with Dcpa as well, but we do encourage folks to join our next urban design workshop where we will be talking more about the envelope and the messing and I think. Maybe after that, then we could come back at some point with the community and there's there'll be an actual. You know a shape for people to to talk about so right now everything is so it's so abstract right now, and so we're just trying to do this in steps so that it kind of makes sense to all of us before we go Miss Granville I just want to mention that catherine indicated to me in the chat that they're they are very eager to listen to any unquestioned questions or unanswered questions. So I just would encourage anyone who did not get to ask one of their questions. Although I do believe, we got to all the questioners that they can this email and I'm going to read it twice just so, everyone can have it. But if you wanted to send any additional questions to them, please send it to Mwb er Fp at Hpd.Nyc.Gov. So that's a lot of letters. So let me just go through that one more time that's mwberfp, HPD, DOT, NYC, DOT, gov, so I hope everyone got that. Otherwise, I'm sure we can get you can. You know email the board and we can get that to you. So that's all Mrs Granville I would ask that the HPD representatives send us a copy of tonight's presentation, which has that information with the phone number and some other gems in there is that possible. Liz, Zing or Mr Varus, yeah I believe so we can email the presentation over. Thank you very much. Thank you. Everyone, ethel did you have anything else. You wanted to say. No thank you for your hospitality on joining the two committees together for tonight and we'll explore a date to re-convene on this. Maybe we should try to do that now. Based on what HPD was saying earlier about the timeline, I'm open to suggestions, Workshop design, Workshop, we convention is the 18th. Can we look at something in between the 18th and December 10th? Another joint meeting may I ask that the timeline be revisited because it's way too aggressive to take the community's input in a responsible way. Who said that I did Louis Galduray, oh okay, all right so now, December 10th is the Thursday of the first full board meeting for December of the full board meeting for December. So I would ask HPD to work with us here on setting these dates and advertising that consultations are being had with the community, but not really saying it's with the community board. So it looks like a good date for the to reconvene on this. After the workshop design workshop November 18th would be sometime in early September, I mean you mean December and then to ask that the wrap-up report back not being on the same night as the community board, the district, the full board meeting I mean how are these things being done and yet HPD is advertising a consultative interface. I do not understand it. So I'm strongly representing something later in December for a reconvention and a wrap-up. Can we explore that? Please HPD? Yes, we're going to touch base again with the district manager. In order to finalize the scheduling here, Ms George had to leave for another meeting, which I should also be at the Economic Development Committee, which started about 7:15 7 30. So she had to leave so I will definitely as chair of the board. I will definitely be asking her to communicate with you to look at a date sometime between September, I'm sorry, December 14th and the 18th, where we could explore this. There is an in-crown meeting, yeah I, think that's city planning, yeah, that's city planning, so we've got four days in that week from the 14th 16Th, 18Th, 14Th, 16Th, 18th, 17th or 18th of December to have those two meetings. If, if you guys are willing, if Hpe is willing to work with us on that we're creeping up on the Christmas holiday. So if you would look at that, I think people would be more convinced that this is a sincere effort to communicate and understand the concerns of the people in North, Prospect, Heights Prospect heights and the western end of community district 8. Where there's been a lot of development, so much development that one could stand back and wait for the street to cave in, there's so much building going on. So what do you say? Hpd yeah? We will cut the video over email to make sure that we have the right dates and are including all necessary parties here. Okay, so we're trying to make sure we cover all of our bases. Everybody is free to come so we're looking at the 14th, 16th, 17th or 18th of December. If you would please for those two meetings, thank you. If that, if that's it, we also want to the community Board for for giving us this time to present to you all. Thank you, we're very grateful that you decided to come out and so that we can share what we feel and see with you being down here on the ground. So you guys know that the decisions you make affect real people and families. A lot of the work that's being done is pointing at the high rises that are going up in Atlanta, Yard specific park and attempting to harmonize with that and I think that is not the best way to plan to say look tall buildings over there. We can build tall too, so we want to take a closer look at that and we thank you for coming in and we look forward to hearing from you in the future. Unless there's anything else, I would ask the housing committee chair if she wants to close the navy. Can you hear me I can hear you. Okay, I, wanted to make sure that ethel had a chance to say what she needed to say and at this point I would like to close this meeting and thank everyone for their time and for their input. Second good night, everyone and try to enjoy your holiday tomorrow. Thank you all right. Thank you, Ms Granville! Thank you good night, good night. Okay, thank you. Hpd, take care.",
            "summary": "So, therefore, HPD is proposing to fulfill the 80-100 unit, commitment on site b and that we're able to provide an opportunity for another affordable program on site, a which is helping us with the furthering fair housing.\nI think we've heard from numerous we've heard from numerous engagements, or rather materials and stakeholders that there is a need for affordable units in this community and so addressing the or fulfilling the senior commitment on site.\nThese sites, we've analyzed other zoning designations, and so we want to gather your feedback about the design elements like heights in bulk, which can vary to influence the look and feel of the building.\nAnd we look at different combinations of that to allow us to fit the minimum threshold of the units and the square footage that goes with these community facilities and open space that we want to achieve here in addition to delivering feasible, projects.\nWe, do also still want to optimize the site here, so our other HPD programs also have other minimum units at for financial feasibility.\nWe do not have programming the need for heights and bulks that are identified in the R7A zoning in order to optimize the site for all of these goals that we want to achieve, and so we also wanted to note that, in our analysis.\nBut there were a lot of questions with that process, so I wanted to clarify that the HPD process is a little different from that.\nThe last thing on this is that developers also documents such as a land, disposition, agreement and regulatory agreements that hold them to specific the specified program and the affordability and then, on the last thing, before over, to Q&A statistics about vacancy rates in the area and New York, City, overall and sort of the concern about why we're proposing new construction house what seems to be vacancy rates.\nSo I know people were sending questions in as she was talking hold on a second.\nThink we should let the person ask the question because I see in the chat.\nYou maybe answered this question, but it was whether the because you talked about the number of units that you're aiming to create in the building in site.\nI understand that HPD has not yet figured out what population they're going to target for it, but I guess my concern would just be that if it's going to have I, my hope would be that it would be a hundred percent extremely affordable, because I mean it's just such a huge opportunity there with a piece of land that belongs to the city.\nHave questions about the zoning envelope, but I'm sure other people are going to ask it.\nKind of like get people's ideas on for this RFP and that's what this community outreaches for, and certainly we just Wanna, be able to take advantage of this opportunity to give as much affordable, housing.\nEveryone who lives in this neighborhood knows, we've been there's been construction going on for the last 10 years on the Atlantic Yards Project Pacific park, barclay center, all of that, but 17 high-rises, and it's been really.\nWhy has an HPD done a serious study into the feasibility of transforming some of those spaces into affordable housing which could be done much more quickly and would cost much less city money.\nThen you could use the HPD lots either for low-rise housing or for open space, which this community desperately needs.\nThat's, a really good idea in looking at you know: converting commercial and vacant residential to affordable, housing.\nThink for now we have to kind of plan for these two sites that have been underutilized by the city for a really long, time, and so.\nShow the need in this neighborhood show the need to build on those specific sites and specify exactly what you plan to do before you issue an RFP I think this is bordering on arbitrary and capricious.\nI. Think you know: we've been tasked to try to create quality, affordable housing across the neighborhood and across the city on city-owned land and because of city-owned land.\nYou know that we have a commitment for senior housing on one of the sites.\nYou know their designs of the site based on feedback we're hearing from community during this period amassing and such and also they're.\nYou know to expand the passive open space there, so we're not building on the priority of the city-owned land.\nSo I think you know like with a lot of rfps.\nYou, know, intention to build 100, affordable housing on these two sites.\nThen we're asking people to come back with their ideas that you know the best idea and the best building that fits into this neighborhood and what we hear from.\nI know that there's a lot of people who've asked multiple questions.\nAnd I wanted to know why it's not using the full parking lot in its footprint and also just the practical question about the survey on the HPD website.\nMany of us support deeply affordable senior housing, but we would like any kind of zoning change or a large construction to be looked at in a much more holistic, way, and I'd like to comment on that.\nYou know it's the policy and also we actually do not have a lot of land in neighborhoods like this.\nWe really think it's irresponsible, particularly to ask a community to support a proposal that is, at this point vague in terms of hey what the zoning is and b how broad that zoning would be.\nBoth of these sites are mid plot, so we need to discuss sort of the zoning rationale with Ccp. It is hard to give a you know a real answer to that question on what the zoning district and boundaries are at.\nThe developer has to do an environmental assessment statement which looks at the impact of not just the proposed buildings on the city sites, but depending on where the zoning boundary is how that rezoning would impact the sites are being included in the district.\nJust you know: I, mean it's irresponsible to say like yeah, the district is going to go to the avenues.\nIt was the same process there, but in our case for the disposition of city land and for the rezoning that would be needed for the project that we're proposing, you know would require an environmental assessment.\nYou know the two and two affordable buildings on these two sites.\nI think so, just one other question, so the quote-unquote commitment for 80-100 units on these specific sites.\nI want to just first to just explain, because I think I also agree strongly with this notion that we need a holistic plan before this proceeds, but I have some zoning questions, but the zoning.\nYou're, adding in you know, thousands and thousands of units of six thousand four thousand six thousand four hundred thirty units of housing, potentially and maybe a little less if some of the buildings are not completed and 2,250 of those affordable units plus a lot of empty.\nWe have a lot of different issues that need to be addressed, and what we see here in with M Crown was a proposal to address these things with looking at zoning across the district, but also in looking at public realm potential public realm improvements, and these HPD sites were included in those.\nYou can look at the ratios and you'll see that we do not have the space for pedestrians, that a lot of other areas have or the we have, and we have a bunch of like design flaws in the project atlantic yards which are going to directly even impact on these sites, like you have just at the dean and carlton intersection on Dean, Street.\nI mean we need to be thinking about this holistically and really talking about what the community needs are in a different way than I.\nI hear you saying and because we are actually the neighborhood, the immediate area, that's carrying a lot of the weight of the new, affordable housing and the new development.\nSo you know the city can't keep having the same idea over and over without addressing the things that we need addressed at the same time.\nWe strongly support the use of these sites for senior, affordable, housing.\nActually, I would say that both sites should be used for senior affordable housing, but at the end of the day.\nDefinitely taking notes here on what you're saying I want to make sure that we are understanding your just because it we did hear a lot of concerns.\nThat means you guys know what zoning envelope you want.\nYou know I, think that would that would just result in a financially and feasible project here and because we want to optimize.\nWe are looking for a larger zoning envelope, but one that is not out of scale with the surrounding neighborhood, and some of the buildings like right across the street.\nThink if catherine wanted to step in I know, we had talked about the.\nWe are looking at financial feasibility as well, which is going to result in on proposing more use on that site than the current zoning allows.\nYou know I share in the desire for answers about the zoning envelope that it kind of seems like from what I understand from what you're saying.\nI mean I know that everybody has tons of meetings, but I'm wondering if there could be another meeting where DCP could be here to answer questions about the zoning envelope.\nA lot of people talked about what a tremendous asset it is to have city-owned land in our area that could be turned into affordable, housing.\nSo I think the way we imagine this for most of our city, sites.\nAnd, but we do have like lawyers looking into this question, because it is definitely something a lot of community groups across the city and non-profit developers.\nThe senior, affordable, housing error on one site."
        }
    }
}