{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC_-DD7pj1DnRCaO2fN-HDbw",
            "title": "June 29th",
            "publishDate": "2020-06-29",
            "shortDescription": "",
            "lengthSeconds": "1:42:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "7huKVZkDCWM",
            "fillerWordCount": {
                "uh": 5,
                "um": 6
            },
            "readTimeFullTranscript": "59 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "parks": 32,
                "event": 25,
                "summer": 22,
                "days": 18,
                "distancing": 16,
                "line": 16,
                "kids": 15,
                "youth": 13,
                "years": 13,
                "plan": 13
            },
            "wordCountSummary": {
                "parks": 10,
                "event": 9,
                "summer": 7,
                "traffic": 6,
                "concerns": 5,
                "navigation": 5,
                "course": 4,
                "food": 4,
                "years": 4,
                "distancing": 4
            },
            "fullTranscript": "That you have already attended committee meetings and, of course, full board, but this is the first time that you've actually been here for parks and public spaces so for everyone's benefit. I'd love, the four of you to just briefly, introduce yourselves again and say hello. Let's begin with Mary Ann done new year! So now yeah, oh I thought I saw her okay, how about Kelly hi everybody, I'm, Kelly, Burton, I, work in CB5, I work at MIT, part- time and then I also when I'm not for load work in fashion at Times, Square and nice to meet you. Thank you and Noah you're on right. Yes, hi. My name is Noah Stern I have lived in CB 5 for my whole life and while I do not go to school. In CB, 5 I have worked in CB 5 at the at the farmers market in Union, Square and I have been involved with Gail with Gail Brewers youth committee last year, so I've been very involved in youth politics and it's very nice to meet you all. So thank you for having me here tonight. Thank you so much and is Mary on yet or no all right. Well, we will hear from her when she loves in and in the meantime, I think we have not been joined by Steve Simon, yet right, I'm looking at the attendees I, do not see him on there. Luke is on the phone with someone, so maybe he's trying to figure that out, but well we're going to. We will leapfrog that item and we will jump right to Madison Square Park Conservancy, who are joining us to discuss revised plans for the food market in Worth's square I believe it would probably be who've the new committee members to have a little bit of context around what we are hearing tonight in the thumbnail sketch of this long history is that for many years there was a food market twice a year in word, square called Madison Square eats you are probably familiar with it and we there was a lot of support in the community for this event, but there was also a lot of concerns around navigation issues and signage and other things, and over the course of many years we worked with the Conservancy to address those concerns and improve them year after year, at the time that the contract expired for that particular event, and it was time for a new one. The parks Department needed to issue a new RFP for operators for a new iteration. This event, which is one that brings in much-, needed revenue for the Conservancy which, as a reminder, Madison Square Park, receives zero dollars from New York City. So at the time of the RFP, that was when community board five formally weighed in on the best ways to shape the public conversation around. How a new iteration of this food market could better address the public benefit in response to that, not in response to that, but over the course of several months, working with the Conservancy and the Parks Department on the language for the RFP, a lot of community board five and the public's questions and concerns became baked into the text of the RFP itself, thereby ensuring that those concerns would be addressed since they would be required of any operator who would be ultimately selected as a part of the process. So those concerns included pedestrian navigation down, Fifth Avenue along the east side of Worth's square sight lines above the event congestion, so that there's a possibility for navigation through Worth's square and a lot of interest in the identity of the vendors. There was always an effort and an integrity on part of the event to have local, small businesses and restaurants, showcased, of course, but with a new iteration of the event. We wanted to prioritize that and have a deeper conversation around that and we were thrilled when last year we learned that Italy would be the partner that would be presenting this event in partnership with the Conservancy. So in a normal world we would have already seen the first iteration of this new event, as it normally happens every year in May and because of Covid-19. Obviously, plans have completely changed, and so the Conservancy asked to come in order to present an update on their plans and a revised layout and revised plans based on the new reality. So we are happy to have you here. We have. We have Keats here, although I see that you're called Robin on the I am you are, so do not be mistaken everyone? This is Keith's marker. If you Wanna, kick it off. No that happened. I've never had that happen before Robin might have four. Did you her link your you should be able to rename your yourself well or I can do its know that I'm Keats and Robins a fabulous person so I'm happy getting in this Robin, so Thank You Clayton for that introduction, I have to say that Rory who is supposed to be giving this presentation can't get completely on. He can hear us, but we can't see him I do not worry. I can I will promote him to panelists. That will help. Oh okay, that's the problem hold on. That would be great because I am was not prepared to give the presentation, but I would, if I had to there is your favorite worry so so yeah Thank You Clayton for the introduction, I'm sure you on the Madison Square Park, and we are the organization that funds a hundred percent of everything that happens in their pre Covid-19 days. That was sixty thousand people a day. I do not know what the number is now I think it may be a lot less because there's no workers in the park, but I would say that the people that come needed a lot more and so I do not know who have you have been going. It's been challenging with the dog, run, clothes and the kid the playground closed and the lawns all open, we're honoured and thrilled to be a special place for people that stayed open throughout all this, but it's been really challenging. Our workers have been I, think courageous to come in by his subway and I'm, proud of them all, and it's really means a lot to see all of you here who volunteer and do all this work. It's a lot we're going all going through a lot. The Eataly thing, I think I think Clayton laid the context I'm going to hand it over to Rory who's working with Eataly to kind of lay it all out for us, and so thank you for your time. You right! Yes, so I just go through it clean yeah and you can share it right. Could you do not even sure yeah thanks everybody for taking the time to look at this? There are a couple of requests. I know. One of them may not be pertinent to this, but Clayton can stop me or let me know, what's what we can share, what we can I'm going to share my screen. Now everybody see it yep. So this is the new socially distanced, mad squirt, Eataly, 2020, Clayton I know you gave an introduction. I was trying to join and rejoin this zoom meeting to get my video up and Keats I only heard half of your. So pardon me if I'm being redundant here. This is a brand new layout proposal that has passed muster with the Parks Department so far, pending some social distancing stuff like sign- in to that, and it's the first time we're presenting it here to the community board. This is a dynamic layout, but it is it's pretty put together, I'm going to show you first, the pure concept or what Matt square Eataly should be without Coronavirus. Oh, what's that would have been would have been, would have been and hopefully will be at some point. We had multiple points of service, all one vendor Eataly, but similar to Italy's model and Italy Flatiron and their properties elsewhere. There are kind of different restaurants and different places for you to buy, groceries and stuff like that, but underneath the hood, it's all Eataly, the pure concept had a pizza station, safer sandwiches and salad, a pasta station, a bar and escuela or school for interactive lessons and cooking lessons, and things like that, however- and this was supposed to take place in May of this year and again in September of this year following the RFP and the model that was lab4 by parks and by CB5 over the past years, May was cancelled due to coronavirus and we were looking at possibly adding October but frankly, with everything that's going on with coronavirus and then the pressure of the city from the city to activate something. We are now looking at a start date of the 30th of July and then going through the 56 days total to the 23rd of September. The other thing that's been changed from the pure concept is, at this time we're not preparing any food on site. So it's not really a restaurant and that's one hundred percent due to department of health complications and the fact that they can't even review a new plan, let alone vet it. So it's technically a retail operation. The revised concept is focusing on produce and packaged foods. The community highlighted points still some kind of interaction, although frankly we're not sure how exactly to do that in action with social distancing, but we can imagine that it would be people behind the glass behind the service counter explaining some of their products and Italy right now is working hard on getting those upstate farmers as partners for any kind of program starting the 30th. The beverage offer beer and wine is what we're looking to serve and again using ingredients that are local and Italian. The food offer, as I mentioned, is all prepared in Flatiron Italy, so nothing prepared on sight. Everything will be packaged and sold as a packaged product. So there's no food preparation on sight. You couple of pages of inspiration, I'm line. Originally again was May and September 28 days in May 28 days in September, Patty's been condensed to 56 days straight with the ideal start time of the 30th of July and the end date. 56 days later in the 23rd of September. Here is our social distancing plan. It creates a perimeter around Worth's square with a single entrance and single egress entrance from the Northwest and egress at the southeast. There are two types of patron: the first type would be those receipt in the inn within the confines of Wirth square and to maintain social distancing, we're working with the parks Corbin on what we can get approved in terms of floor markings in combination with active attendees or ambassadors. To help maintain social distancing. The idea is with a single line through the seating area: that's 12 feet in width. We can maintain that 6 foot, minimum social distancing and once people are sitting at their tables, of which this model calls for 32 top tables, that's 2 persons per table. The assumption is that you're in a quarantine or a pod with that person, once you sit down at your chair, you can take off your mask. Well, once you leave, you follow that single line so you're, maintaining your social distance from anybody else, who's seating and you exit alternately. You can take to go, and so you'd come through this flow and you would simply follow the what's shown here in green through to the exit. This is just a layout of what the kiosk looks like a hover over with my mouse. This is the Kiosk structure, roughly 28 feet by 10 feet, and then this is the back of house which really just holds three things, two of which are shown here. The generators a hand wash station and the third which is not shown in here would be any refuse or garbage and Wheelie Bin that goes back. The flat, Iron Italy's compost, garbage collection site back in flat iron Eataly. This is a layout of interior of the kiosk, it's very simple, given the fact that it's all prepared foods, we have the fridge, we have a freezer. We have a kegerator for beer and then we have what's called rack shelving just basically shelves for display of produce. This is an exploration of the social distancing that we're working on and now here's the first of two things. That is definitely germane to Community Board five, because it is an alteration from the original approved layout. One of the one of the points in the RFP was to maintain accessibility to general Worth into the worth monument and with the social distancing layout. It is impossible to maintain for the public accessibility to general Worth from the Parks Department point of view. They would like the community board to say: okay, we understand that during you know, Coronavirus times and social distancing, it's okay, to have this kind of setup. That technically does remove accessibility to general Worth and then the second one which I referenced at the top of this presentation. I'm, not exactly sure if it's totally germane to this committee is or work with the New York State Liquor Authority to get those beer and wine the ability to serve beer and wine on- site. The short a short on this is that we won't be able to get enough daily permits, which is the way Mets where it eats previously to this, iteration was able to serve beer and wine. We're not going to be able to get enough of those to cover the 56 day run, there's a chance for us to get the seasonal permit a seasonal license. But to do that, we need to have CB5 understand that they've already reviewed this plan or waived the 30-day and, frankly, even if we do all this, there's a chance that the State Liquor Authority, because they're working on reduced with reduced staff and they're overwhelmed. They may not be able to turn around that seasonal permit, but that's our only shot. Ultimately, when it comes down to it when we're not preparing food and we're serving a limited amount of packaged food that had to be packaged off- site before it was served really the only way for us to make enough to cover costs of production and to meet our revenue share with Madison Square Park Conservancy. It really is contingent on having as much beer and wine that we can serve safely over the 56 day, run I. Think that's the last line. Yes, okay, great! Thank you. So much I think what might be most useful is to tend to the two elements that you formerly need. Our input on. First, regarding the licensing issue, the psql Committee is the committee that formally weighs in on license issues so for Parks public Space committee members. Obviously we are. We are free to ask questions and comment, as we please tonight on this issue, but I believe that it is appropriate to leave it to the psql Committee to determine how to move forward, given that this particular seasonal license, we have never objected to. In fact, I do not believe we've ever even after initial years, even weighed in formally. We just had a no comment, because it happened twice a year and the issues that we had around the event were issues that this committee here is not issues regarding the alcohol license. I do not expect that our position on the alcohol license would have changed no matter what, if anything, if we approve of the improvements given to the layout of the event generally, then, if anything, there would be more support so I if, unless anyone objects and I'm Vicki chair of CB 5, is on the call as well and Craig, who is our Vice Chair is the vice chair of psql 2, so I do not know Craig. If you want to weigh in on that at all about procedurally moving forward, but I believe it seems appropriate to let psql take that up if they, if they deem it yes, yeah and just to read, are we playing that we we've never I do not even think we brought you in to the psql Committee on this issue ever in my recollection, I think that psql, you know, can take it up and it can I can discuss it this week and go forward and potentially move pretty quickly on that great. That said, as we move forward in a discussion, anybody who has any questions or concerns about this issue obviously feel free to raise that and that can that can go forward to Craig and Nick's conversations, as well as for the word square. Accessibility, I'm happy to hear people's opinions on that I think. Obviously, given the conditions on the ground I do not I can't imagine, there would be any objection to the nonpermanent alteration to our recommendations that went into the RFP about accessibility to the monument I. Do not see that as a really huge issue. It is but I'd love to hear from other committee members. If you have any questions or comments about that point, and if so, you can raise your hand and I am seeing none so I kind of feel like this is: oh, we have one from Chris Clark, Yeah right, yeah, I'm, sorry if this was already addressed, but I just wanted to confirm what I'm sort of assuming, which is that entrance into this seating area, is only for people who are going to be purchasing something here, it's not possible to sort of game the system. As someone who wants to check out the monument to sort of go into the seating area and not get anything, you know, that's funny, I think that we will let anybody in and there's some social distancing stuff that we're working on like we may require a mask. There's some liability issues right now that we're just working through. We may even do temperature check, but I. You know try not to go overboard here, but obviously we're going to have to do whatever is mandated and we're just a little too far out to be able to say what we can and can't do. We just have to be flexible, however. I would I, do not think we're going to do is say: hey. Are you going to buy something today or not I think there's a bit of self regulation, meaning I expect there to be a line. We can only service, so many people, and then you have to be six feet apart from each other. So I think that if you're not you know, if you do not want to be a patron I think you would self- regulate, that's what I think. But let's talk about the possible scenario, if not palpable of somebody wanted to see the worth monument, then yes, you could wait in line and see it, but I would not you know it's. We can't create a. We can't create a single line just to view general Worth's monument in this scenario I or if we could, we would be compromising a lot of other things. So that's my long- winded answer to you. Chris I think you could come in, ostensibly and to go, see the monument you would just be waiting online to do so got it yeah. Thank you for that answers. My question definitely Aaron, hey guys, just a question: clarification on the on the fly Ting or the end date right and in the original proposal. What was the this sort of seasonal window and then is the new proposal and I? Commend you guys, on figuring out a really tough challenge here. I think it was hard challenge, but is that is the Nd you know? Is this going to go a little bit later into the fall or what's the idea with you know how to sort of bridge the summer to fall, and is that a different I'm than the original proposal or of passes grades? So the original concept is it's specific and also a little big it's in places in the contract from the parks Department. It says the month of May the month of September in other places it's 28 days of operation per month. So what we did here was it's and also by the way they're set up and take down. So the one. The only good thing out of Coronavirus right now with this proposal is that we have one set up in one: take down not two setups and two takedowns, but we've maintained the 28 days of operation, we're conservative there, and so it's simply 28 plus 28, with a start date of the 30th of July. So it's 56 days from the 30th of July to the 23rd of September. You know the Parks Department has been very helpful and Troy has tried to be as flexible as they can. As you guys know, the concession process through the Parks Department is highly regulated as the controllers review and has the Law Review, and so, as we are trying to work and they're also, you know they're also saying: can you guys do something? Please, like it was the city director do things so you know we're trying to do something we're also. We also have to recognize the fact that the that every little change from the contract does add up, and so you know we picked and choose what was the most important to us and we left things that you know was not as important. I can tell you, though, from you know from Italy's perspective. More than 56 days would be preferable. You know we could run this for four months. It's just I do not think it's tenable and then, of course, weather gets in the way, forgetting anything about a second wave yeah and just add to that. For the part from the parks perspective. You know, we've lost something like at least 40 percent of our revenue and, as you know, we raised everything to run the part, so the revenues from this event are important and I think, additionally, the ability to shop outside to go and get food and things that you can then eat whether you take it to go and go sit in the park or you take it to go in the home or whether you sit in we're square I. Think it's really important to have access to outside services. As we all know, Karen did that answer question. Yes, thank you. Thank you. So can we would you mind putting up the seating layout again? I just wanted to ask a question about the two tops, because you mentioned 30 tables and I did not see. I did not count that many. Let me find the one, that's probably the best, let's see if I can zoom in as well, so it looks like the umbrellas or tables, but actually like the little table, guys there's two labels every umbrella right. These little guys are tables little Rolex watch yeah, but yes, little watches are the tables and each table has two chairs also just so, you can see it like. Where my little hand cursor is going up and down right now. Those are planters, so that's partition. So the walkway is here and then down here and then back here and where I show them. If you are just going to go, if you're just going you're going along the curb line here, I was not I was not seeing the six tables on the right side, yeah, yes and so, and then this would be markings on the ground, but it goes up like this and then around like that. There's an attendant over here. If this, if these seats are all taking your push this way, if these seats are all taken, you're taking it to go, and so the attendance role is basically to cue, manage and get the people in the seats, that's well yes, and also that and sanitize in between sittings and how many people do you have dedicated to that? I could not tell you right now, but we will have enough to be to do attending and to do sanitizing. This sanitizing is cleaning up after people if they leave their stuff on the table. We're still working out the operations of all this okay, there's three, basically three types of or four types of employee on- site. There are people who are serving from behind the counters. There's security- and that's you know, aside from being mandatory from the end from the SLA standpoint, it's just good to have and then attendees and then people who are keeping the whole place, sanitary, which is sanitizing surfaces, primarily okay. What other questions do we have from the committee? So I have a question. This is Kelly all right, I think I missed it and I'm. Sorry, if I did, but can you just explain about access into the area and then the queuing for the concession so you're going to have stations in front of all of the concessions like a station in front of Birra station in front of why wine, and is that what is going to be monitored in terms of how many people can queue for product? Yes, but let me just be clear: I think, maybe you maybe you hopped in when we were explaining the pure concepts, the concept that does not involve a pandemic, that what we're looking at right now is one kiosk that serves beer, wine and prepared foods which is most likely ice cream and then some farm products great. So how are you how what's the plan to keep the social distancing at that station so and I apologize cuz we're still working on this? But if you follow my cursor every six feet, there will be a floor marking and that's where you stand when you're waiting to get served over Claire yeah and we have a security position over here. That then directs you. Currently we have two points of sale. We might be able to create three points of sale. Obviously, the more points of sale we can create the faster we can put people to look, but at the same time you know getting people to sit down. How long do they say? It's a dynamic process right now. It's a there's, no one quick formula, but we are getting there Thank You other and then one just one other aspect that is being worked on because Italy has experimented with it in some of their other locations and that's online ordering and advanced ordering, so that you're not standing at the counter figuring out what you're going to eat, but that would be required or just an option. We do not know. Yeah I mean like right, as of yesterday was everything became cashless because we do not want to want to minimize. You know contact this morning. Cash, maybe coming back in you know it's a dynamic thing from an Operations standpoint, the more people you can service the better you're going to do from a revenue standpoint, but to do that safely and also for the first time in a new location like this, the more complicated you make these plans, the more these plans can go awry so we're trying to balance that out. We've got about four weeks to figure it out a question from NOAA. So what is the plan in terms of having the line go in a certain direction, either towards a 24th, Street or tour or kind of going along side on the outside of it west of Fifth Avenue? Has that been kind of thought out in terms of traffic and the bike lanes both on 25th Street and on Fifth Avenue yeah? So we pulled in our backup house. This is a fence line. These are 10 foot panel offense units. We pulled this in from this area here for exactly that reason are- and it's not it's not in this plan, but essentially the line continues down this way along the outside perimeter. Our goal is to not have a line that extends farther past that and then how many people do, you think, are how many pods would fit from the west to the east side of the square six feet. Apart from one another, I can run that math I'll show you. We have not run the math on the East West line. You can count back one two, three, four, five, six, seven, eight, nine ten, that's 20 people here figure another 20 people down this way and depending I mean I, know the General Assembly's canceled now so, hopefully we'll be able to get NYPD barricades. If we create another line, then maybe we can do another bent snake around, but you know from an experience standpoint. I know that we do not want people waiting that long to get into this. You know it's just not. That would not be cool from an Ele standpoint, so we're actually working harder on trying to get more service through to avoid a line you're. Absolutely right, though we do have to figure that in and we do have some real estate to be able to do that. Thanks question from Todd hi: there I'm just looking at your plan so if I'm a pedestrian walking south on Fifth Avenue. So how? If I want to continue walking south I'm going to see a series of boxes or planters that are going to prevent me from walking south? You know along the edge of worth Square. So is that I mean what is the plan? I have to walk. Well, I have to walk around yes, so you could walk. You can make a left and cross Fifth Avenue and go down on the east side of Fifth Avenue or you can make a right and go down on the west side of the Broadway. What I call a Broadway extension old Broadway going the wrong direction I mean. Would it be that much I mean really that's asking a lot of a pedestrian a lot of the pedestrians like to stroll down that part of Fifth Avenue and take in the views of the park, especially during the summer? Even when it was, you know the old concession you could more or less walk, North, South and South north along the edge of the place, and you know taking the sights. Would it be that big of a problem, if you just modified it so some take away, take away some of those tables and make some rooms so that there could be a pedestrian corridor along that part of set along that part of Fifth Avenue I can't wait. Can I chime in on that one I kind of feel that the importance of outdoor food consumption and purchasing is so enormous right now that the need to take in the park from a stroll down south? You can do that on the east side. You can still do it, but you can't do in so much of the city anymore as go inside a restaurant, and this offers the opportunity to sit with a friend and eat some food. So I think the trade- off is important, so Todd I'm, going to just piggyback on your question and in response to Rory and Keats I completely agree with you. I, do not think anyone would disagree with that, but the issue is just that: it's not an academic exercise, as we saw over many years with our concerns about 5th Avenue pedestrian navigation in the past, with eats they're just going to do it. It's not it's not about the trade- off I agree with you, but people just do not walk to Broadway I mean some people do, but many people just walk down the middle of Fifth Avenue, that's just what they do. New Yorkers are New Yorkers and right now in particular, I'm finding that pedestrians are more courageous than ever and so I guess that's really. The question is: how can we I do not know if this is all in rapid flux? Obviously, but if NYPD has weighed in on this or anything, but what will you do when people do walk outside of the planters down Fifth Avenue, because that's going to happen Rory there is a walkways there that go to the next picture. That's the old model! There is no walkway down fifth that then the west side of Fifth Avenue for the public unless you're coming through Italy, so Clayton and Todd to your point, and there is not a great plan to stop people from walking in traffic down Fifth Avenue. However, if the only solution is you just can't set up here, then will we have to take away all of the seating and then we'd have to take away enough seating here to allow the public where we can't control whether they're wearing a mask or not? We can't do a temperature check or anything like that, so we would have to just eat away a lot of the footprint which they're not. Is there not a way that the planters look lovely and it would certainly be the most elegant solution, but is not a barrier that would be more simple and narrow that could be on both sides of that narrow pedestrian lane, so that you just we achieved the best of both worlds so that there is basically a sidewalk that is demarcated only for pedestrian Thruway, which still keeps the outer perimeter of the event clearly marked. Well, we did look at that. Obviously, for the pure concept that was a major concern was ensuring that we had access north- south along the west side of Fifth Avenue, and we were able to do that and I'm not trying to segue into something else. But I'll come back to it. We were able to do that by pushing the infrastructure in floor farther of meaning pushing it west and we're able to maintain almost six feet of distance behind the behind the activation. If you will the problem with creating like an 18 inch width is the is the slimmest barrier, you can get. That's a water ballast like construction traffic barrier. Once you set that up, you really do not have a lot of space before the curb, so you need to create a more space to the west, and how do you create space to the west without creating another barrier within a socially distanced scenario? So we've got people coming in we're, checking them they're, maintaining their social distance they're, getting the signage they're speaking to an ambassador, and then we would have to create a chute we'd have to create a another perimeter to the west of this new lane to ensure that the people who are coming into the area, which is Italy's responsibility to keep safe, are kept safe from the unencumbered public and certainly the ones who had otherwise walk in the street, so I'm I mean I could throw it to you guys. We had looked at this. One of my main goals was to find the maximum amount of real estate that preserved safety within a social distancing, environment and really, no matter how we cut it. We had to avoid any random public member from coming into the site. Looking at your diagram, I mean I can't want there's no way. I mean I count, one two three, maybe four tables two top tables: there's no way that you could carve out even that minimal Lane and still achieve a lot of what you want. I mean it's so important to have people we're getting look. We all understand that you need the space and you have to run your event, but there's got to be some way that you can make a concession to the general public's will allow them to walk there. I know that, even when we had the former concessionaire there was I remember we used to complain that walkway was too narrow with bicycles and people crowded onto it, but at least we had that and in the pure, in the pure concept, we've extended that Lane I mean it's much better than the previous iteration, but the pure concept does not hold within the pandemic that we're in. Unfortunately, this is a temporary scenario if this is not for the next five years at all. This is literally a social distancing attempt to do this during the pandemic and Todd. If there were a way and I'm not saying there is not I, just can't just think of it, though, if we allow people down the right side of the perimeter of this venue, we'd have to create- two barriers now one to protect those people from vehicular traffic and another to protect those who are socially distanced from the public and I'm, and you know, I just came well Pete I can't see, and we only have thirty tables in this whole thing. So you take away a five of them. You've lost a sixth of your service and, if I could just say, one of the reasons Italy is even stepping up to this and I'm sort of is personally like the Parks Department and the Conservancy frankly put pressure on Italy to come up with a solution to provide outside access to food. We nobody's going to make any money on this. It's not a moneymaker already and taking away you know, whatever the number of tables or whatever. However, this works out it's iffy at best, if it's even going to happen and I just personally believe on a really fundamental level that we have to find a way to make it happen, because we have to find a way for people to socialize and gather and eat enjoy themselves, and that's what this can be well. I have an idea with the open restaurant plan that is now happening where, if the restaurant is entitled to use a lane of traffic for seating, they may self- certifying I mean how you know what is the degree of traffic right now at that spot like how unreasonable- and this is an open question- maybe my own committee members can shoot me down, but how unreasonable is it to use those 18-inch barriers and put it on the eastern side of the pedestrian walkway, even if that goes into the lane of traffic? So take the first each side, lane east of the sidewalk right I mean not that with the whole lane. But if you were to use to touch the D- O- T through barriers, you would go into that lane. You would not use the whole thing yeah, but you, if you go into it you're taking it I mean that would not there's no 50/50 there. I do not know I mean I would I was we did explore. Like can do t take that Lane away. We explore that before Coronavirus we have an exploit a post grown. We have not commit your absolutely right. You know all this is happening very quickly. I. That said, we can't believe the deities issue is that you know we're. That's a vehicular lane, it's not a parking Lane and we turn that into a no car. Then we have to cut the next lane over, which is a car lane up and down below. No one might be a terrible idea, but I just I'm. Like your idea, like your creative thinking, we have some hands up. If it's about this issue, I'd love to hear from people too. So, oh they all just went down. I guess anybody who still has a question, please Oh Barbara, yes, go ahead. I actually was going to suggest I'm looking into taking Elaine I mean you know it's worth asking the question. I also think that we have to just remember that this is for 56 days and I think that it's I do I, think that there is something about bringing back a little bit of spirit to the city that is so important right now, it's just a big bummer and you know some are supposed to be fun and people want to be outdoors, and so you know it's 56 days and I think that either maybe traffic patterns can be changed or pedestrian walking patterns can be changed. I mean we're in an extreme situation, and I can really appreciate that you do not want to take away any more space. What is relatively a pretty small footprint to begin with- and you know it just makes everything- is just so challenging right now. So that's my two cents so committee. So you know we. This is not really something that would be up for a vote since it's such a temporary revised iteration of something that we have long been on the record for four years. You know improving what the shape of this event and the process of that RFP so I believe that both procedurally and also for efficiency, so that our input can be incorporated immediately and these questions can start being addressed. I think it would behoove us to put our concerns and questions and support and all the things that we discussed today into a letter that can go out as soon as possible to the parks, Department and also do T to investigate this particular issue seems like it might be the one that we would have the most concern about, but also to pledge our public support generally for moving ahead with a revised, socially distant version of this event. If anyone disagrees with that, then please raise your hand and speak your piece. We can continue to ask questions, but I just want to let you know what I see is framing our conversation. Todd, yes, I completely agree after listening to what Keats at the said had to say in the fact that it's just a short- term solution. You know we can't obsess about perfection, especially since we've lived with all sorts of issues with that space and past years, I think we should simply state. You know my only other comment after thinking about it is. There has been such a reduction in traffic down Fifth Avenue. You know, given the reduction of general business activity in that district, that it might not be such a big deal for 50 days to take away that Lane. So you know people could walk down. Fifth Avenue, you know I. You know that I'm in the neighborhood and I see everything that's going on Brian, especially given what the whole idea of having we're trying to generate more street traffic and the most important thing is just people getting out and walking around so, but I would not make that you know I would not make that stumbling block to get this done right simply, we asked the department we express our concerns about the OT if it's possible what's possible if it is not in the future post pandemic. Obviously no. This is this is a concern horse, Thank, You, Todd and I do believe to that. In drafting the letter, I would just encourage us to use language so that this is not about like I was saying to Keats earlier. This is not about a debate about whether or not the event should have these tables it is. It is just a practical effect of New, Yorkers or New Yorkers, and they will walk down two avenues. So what are we going to do about that? So I think if we, if we frame it that way, you know we're trying to sleep solutions together. So hey, Miriam Berman is on the line and I think that since you're on the phone, you do not have the ability to raise your hand, so Miriam I just want to call on you, because you had a lot of input in the RFP process. For this event, so I wanted to call you out and see if you had any questions or comments at the moment, muted and Miriam I do not know how you unmute yourself on a phone I think she might be the attendee that has their hand raised I'll. Try that, oh sure, I see her in the panelist thing. I, do too I'm allowing six forces to talk okay, I'm well, unmuted. They just said hello, hi, Mary, hi, Mary, Ann, oh great hi, everyone I just was trying to chime in ever since Clayton said, because that's exactly what I was thinking about was opening you know is taking in that lane of traffic and because of the amount of time that it is, and you know, I think that if it can be done like as Todd was indicating to have that wonderful card, it would just be a plus all the way around if they will. You know if DoD will see this through, but I'm definitely an agreement in trying to grab that Lane as a as a special effort to the into Fifth Avenue great Thank, You Miriam, that's very helpful and Keats. How much the world has changed. That CB5 is advocating for an increased footprint for eats so many ways and Miriam did you have? Did you have any other questions or comments, and not really so the main kiosk is going to be the full width of the worst monument in front of it right, which is you know? Fine. You know I do not see another way for some reason: it has a much area and better feeling than it had in the past. May I make a note Miriam. Just a note. You can press star 9 to raise your hand. As you probably already know, okay I thought I did try that, but you know I did not know which combination okay, totally raised I just did not know it was you. Thank you so much for the end of it Miriam yep. Thank you. Thanks I'm here, you're still unable to talk but I'm just going to mute. You right you're still in the room. So do we have any other questions or comments and then I'm going to yes, John you're, unmute, okay, I just have a very general question about Kahn about cashless payments, I fully understand in for health, public health reasons and also pedestrian traffic reasons. That's preferable. I was just curious of what the law is on. That I was an impression that the City Council it passed a law a while back saying that people have the right to pay cash paper money and not just the use, credit cards or other. You know. Electronic means of payment I just want to get a clarification, I'm not objecting to it. I just want like to understand what that rule really is I believe you're right and there has been a flip- flop and the jury's still out I. Guess it's the only thing and I and I think it has to do with the legality of legal tender, we're still working it out. Okay, thank you from a safety standpoint. I think it's self- evident, but you're right, there's legalities as well I mean if we had to we figured out. You know, okay, but it's that I do not want you. You've got a contingency plan, you know a or B. If you have to do it, if you do not have to do it, that's on you yeah, it's all kind of weighing in the balance. If we have to do it, then we have to do it. Maybe we won't advertise it because we're trying to reduce contact as much as fun ways of managing it. That I mean at least you know that can make it pretty safe. Okay, thanks John other questions I'd like to ask members of the public in attendance. If anyone has any questions for the application, if so just raise your hands or comments all right, I'm, just seeing none but I'll keep my eye on that. We are entering last looks I! Think committee members: do you have any other questions or comments on this revised application, so seeing no further hands I? Will we're not going to take this to a vote, but I will just move informally that we put these comments and questions into a letter, the biggest one being the Fifth Avenue navigation, but, most importantly, being on record supporting the revised iteration of this event for two cycles in a row and I will wait to consult with the psql chairs and with the key chair of the board as to how we want to rope into alcohol portion of that visa. Be our letter so that we're on the up and up, but in whatever way, we'll make sure that the letter goes out in a procedurally sound way that it is as helpful for you right now and as rapid as we can manage. Thank you so I think that's it unless there's any further comments from anyone feel free to raise your hands. Just. Thank you all that you guys do it's really appreciated. Thank you. So much keeps you guys have been doing an incredible job in the middle of all this. So you have our support. Thank you all right, I! Guess! That's it! You are welcome to stay. We are next going to here. We have Steve Simon on. Are you still with us? Steve I know you've. Yes, there you are I, see Steve's here from the Department of Parks and Kim I wondered if you actually wanted to kind of kick off this item. This was something that had been tossed around and Beck's a little bit about summer programs for youth this summer in the parks, citywide and yeah Kim I, wonder if you wanted to just frame this conversation and with your specific questions as well sure things Clayton, so I had been thinking a lot about what youth will have to do this summer. Of course, we recognized the Summer Youth Employment, Program, being somewhat halted and, of course, programming in general being late to be released and so I had questions around how parks was creating a recreational calendar for youth this summer and just so fearful that there won't be things for kids to do, and you know without opportunities to either work or our skills or be physically active and engaged that they could turn to other behavior and so I think providing you know positive calendar of events and things like that would be really helpful. So I was curious to hear more about what the Parks Department was planning and doing and how that was being fast- tracked as we go into summer school is out what are kids to do. There were a lot of things that I think since my question first came up have since been clarified as part of either phase three or phase four around some things that we're kind of ancillary as far as Park usage regard regarding dog parks and girl, spaces and basketball, hoops and things like that and so I think. A lot of that has been clarified for Phase three already I also had questions about how we could better utilize community- based organizations that are experts at providing programming in our parks and how we could provide them with an expedited process for permitting for this summer and if that was being considered since they know how to do this really well already. So those are some of the questions that had been kind of kicking around in my head when I had, you know, brought it up to Clayton and to Renee with and hearing more from the parks about what the plans were right thanks so much Kim, Steve, I'd love to just hear your response and welcome. We have not seen you with this committee for a while, it's nice to have you yeah. Can you Amy? Yes all right well, first of all, if Keats and Rory is still on the call I'd like to say hello to them, having spoken to you, the one of them in quite a while have not spoken, irori and maybe 10 or more years, so it's good to at least see him through zoom I do not have a hell of a lot to report. Unfortunately, we, the box of Hartmann, is working on a limited schedule of youth activities which we're hoping we can. We can start in July, but we do not have a green light to do that. Yet, and it probably you know, won't be, as you know, won't be as robust is the word. People use I guess as we might have done in past years, but we are looking at doing programming in various parks and hopefully at least a couple of times a week, and we are, we are hoping that we're going to be able to fill the gap. It's just some extent. We are opening up all parks to a license to summer day camps. They can apply for a permit and we'll be able to use our parks again. You know they're going to have to practice social distancing. They can have to bring in smaller groups than they have in the past and they may not be able to use every feature of our parks or every field and every as they may have been accustomed to in the past, but we are going to try to accommodate the summer day camps at this point. Those are the only permits that we are issuing to community groups. Everything else for the summer is frozen and we are waiting. We are waiting to get a green light to see if we're going to be able to issue permits, or for the summer right now, the system that you can not it, you can not submit an application and we're not processing any applications. Everything is on hold, but we are hopeful that we will get the word any day now that you know so that we know what, when our situation is for the summer with respect to the permits connectivity, there are some activities going on at Bryant. Park I do not know if you're aware of them I believe I believe they had a puppet workshop. Today they have a chess, they have ping- pong, they had kids yoga online I think they also had that today, so Bryant Park is doing some stuff and but, as you probably know, both the Union Square Park, the Union Square partnership and the Madison Square Park Conservancy in response to the cogut crisis, had to cancel, though whatever programming they had planned. Steve. Just one quick question about the event permitting I know that you do not have a lot of answers about this yet, but is there? Is there a difference between small and large events? As part of the conversation? Is it possible the permitting would open up for events no matter what type of event if the number of people attending is expected to be smaller? Well, you know that you have to have a permit. If you have it, if you have an event with 20 or more people, we do not. There are as far as I know unless we hear. Otherwise, there is no distinction made between larger or smaller events, but obviously any larger event is going to create complications and is a going to require you know a further review in terms of how it complies with the social distancing requirements. So, but at this point, we're not even there yet because when we can't even accept any permits, permit applications whatsoever, all right Kim did you have any follow up questions or thoughts. Well, thank you for that update, of course, hope you'd be further longer. There would be lots and lots of good news shared to what I'm sorry. Could you perhaps just tell us a little more about the timeline for the potential recreational programming that will be offered? Well, it's a it's basically still being put together. The hope, I believe, is that it will begin in Mid- July and what would and what would the it would there be a plan how people know about this I mean if it's not even known yet what the programming is. What is the avenue for getting the word out to kids? Well, we well I mean we're going to be advertising it in the those respective parks. We're going to be putting up flyers will be doing email blasts, we'll be putting it on our website, we'll be you know, I'm sure, issuing press releases so and we'll be informing community boards and local elected officials. So we will. We will get the word out as best as we can and who are the people is there? Is there a department or people we already our contacts with parks who we could communicate with about this? That would be the most you know efficient and smart for us. Well, I guess: I do not count, but our Recreation Division is handling this. Our a chief of Recreation in Manhattan is a Kim MacNeil and she has two deputy chiefs: Malaika green and Ken Conyers. Okay, great, that's hopeful! Thank you and you certainly count they're much more on top of this than I am well that's! Yes, that's the point just that we could, with the direct questions as things move along I, think we would want to do our part to stay in touch with them and see what news we can get as it happened, because it is mid- July. It is pretty late and also it's just around the corner so right. Well, we are hoping to get this all put together very quickly very soon, but obviously, if you can't reach any of them, you should feel free to contact me directly. Thank you, I'm, sorry, permitting for community- based organizations. I was just curious if there was specific thought around like excluding sports based youth development nonprofits that are experts in doing this work. I know you specifically said only organizations that are that are running summer day camps, yeah that that's the only that's the only exclusion that's been made at this point in terms of the you know, acrosss- the- board freeze on permits, so that's the only opening right now is for summer day camps I mean we I mean not. This really answers your question, but we are. We are accepting applications for the Fall or for sports fields and facilities for the fall, but we're not processing them yet, but we have started to accept them for a September, October November, but not for the summer. Do you think that's something that parks would be open to given our questions around this well. First of all understand that these are decisions that are not being made entirely by the parks. Department, it's being done in concert with City, Hall and City. Hall is obviously you're looking closely at I think over 19 data, and so you know a decision was made. As you know a week ago that we that we could go into Phase three next Monday we could open up dog runs. We can open up basketball courts, tennis courts and ball courts, volleyball courts, boccie courts, so you know that's the extent to which decision was made as of last week, and this is a rolling situation. So you know it would not surprise me if we find out later this week that we have a green light to do some additional. We can open up some additional facilities and, as I said before, we're waiting to hear what the situation will be with respect to whether we can accept permits or special events which would incorporate I guess it was a Kim. What would she added money? Yeah, I'm, sorry Kim, so you know I mean it could very well be that we're going to be told any day now then we can start accepting permits for July and August, or we could be told it's not going to happen. I do not know, but you know we're waiting to hear wondering you know we can do whatever we want in a situation like this. Obviously, as we're the one who put this item on the agenda and I'm curious, if you are moved to propose a resolution to ask the parks, Department and City Hall, to look at these specific questions rapidly, obviously taking public health into consideration, but knowing that the community has the support to look into that and to and to seek some solutions. You're not talking to me now right, yeah I mean I'm wondering if it would in time, though, in a case, in a case like this witness Padma I love, having chaired the board on the call parliamentary procedure wise when it comes to something like this, where the sooner our input is given the better. Obviously a letter is always we can do that immediately without going to through full board, which is what we're doing, for example, for what we just heard with Eataly. But in this situation a resolution does tend to have more teeth. It is a little bit stronger and so I'm just thinking out loud here Viki, but one thing that we could do if the committee wants to go. This is to vote tonight in the resolution. So it's the position of the committee and either exec could endorse that committee vote on behalf of the board in shorter order, so that we did not have to wait another 10 days to be able to have that be the official position, but Viki I'm, not sure if that's an appropriate. Actually. What do you mean by another 10 days? We would do that at exact and the full board is two days later. What did you mean by waiting 10 days? Oh well, I meant if we were able for exec to act even sooner than that. Oh you mean by having the exec committee, but not wait until Tuesday right, that's tomorrow, right because, if that's not, if that's not appropriate than a letter, I think is just as good of a solution all right, but I think it would have to be. We would have to have exec approve it or you know, have it put its stamp on it before the full board, as usual yeah, but go over it again. Tell me what exactly you're having in mind you want to do a letter, well either a letter or a resolution, because if we write a letter, it can come from the committee as we've done before quickly and if it's a resolution, you're concerned that we would have to wait for the film or that's right and I think the most important thing right now is for City Hall. Just to hear that we are paying attention to this issue now yeah. My only concern and I've been thinking about this, so it's going to talk to you better privately, but our letters are usually items and issues that we've talked about before. That's the problem, I'm having and I kind of had it with the last the last issue that you talked about, because that's also brand- new, so just from a consistency, standpoint I'd rather see a reso and have it go to full board yeah. You know what I'm saying I certainly do and I mean I'm comfortable with that. I also think that Steve was here and heard our concerns and questions and hoping that he takes them I. This is Kim again I just wanted time in and say you know. One other point like I think this is part of a bigger conversation around. You know the systemic inequity that continues within marginalized populations and thinking about kids that do not have access to paid programming are the ones that take advantage of free Park Recreation. During the summer we've seen some what's happened with Summer Youth, Employment Program and now to think that they won't have any activity whatsoever. Of course, I recognize we're in the middle of a pandemic, health and safety, but I do think about. This is part of you know it's a larger issue of access and inequity for kids and communities that do not have as many resources. So, of course, Bryant Park is you know fantastic, but in the middle of a you know a district that has a lot of resources, and you know not. Everyone has access to that. To that part, of course, so I just have another thought. Clayton, yeah and I was checking my trusty little bylaws, which I just happen to have it my right outlaw yeah, but it may be in the addendum. We do have a clause for emergencies. I did not know that we do I'd have to look it up. This is going back a long ways. We have not done it for a very long time. Why do not we? How about if the committee acts on both ways of doing it, and then we can use the best one that will get it done: quickest, okay, I love. That idea, I think that and Kim. If you do not mind, I would I would love for you to make the motion, because I think that you've been a champion on this. Just this issue and it's yours to do. But I think that we should passed us as a resolution now and have that in our toolkit. If that ends up being or if we need a letter, we could change it to a letter, how's that great okay, absolutely I would just like to be able to say can I say one thing-, Kim yeah. We absolutely agree with you and I only mentioned Brian Park, because it's in your district, but the program that we are working on for youth recreation for the summer. Targets of parks that are in the high needs areas- and you know I- was reluctant to mention it before, but it does not include- does not include any parks in district 5, but it does include parks on the Lower East Side in Harlem Washington Heights. So we are focusing on those parks and I am confident that we are going to be able to get some of these programs off the ground and we are going to be able to provide them to kids during the summer, and you know we're going to do something because we're this is our job. This is our mission and we want to do something and we want to be able to plug that gap and serve people who need to our services. So we are not, if I left the impression that we're oblivious to that issue that, but that is please that is not. That is that's not the correct impression that I should be leaving and I appreciate that clarification. Thank you is there a side question. Obviously, parks are not experts in the digital space, but is there consideration of offering virtual programming on the technical devices that kids now have access to you? Someone I mean that's a whole host of other issues that we're seeing with school and such, but is that something being considered you know that's a good question. I'm not sure I think we may be working on stuff along those lines, but I'll have to get back to you. Okay, great, so I'm, happy to me to propose a resolution. I guess, I'm just curious from the rest of the committee, like their questions, comments, other thoughts that might help better shape it and hopefully I'm, not the only one that sees this is really urgent and important for our city's kids. Yes, let's have open the floor for committee members to add any finer points or questions or comments about our position. I cam, this is Kelly I, totally support. You I think that it's great that you brought it up and given the fact that Steve says that some of the other communities might have priority, I think that it makes your point even more prescient that we that we show that we want some attention and we want some rapidity for the community and for the kids in our community. So thank you so much for bringing it forward so we're resolving then to ask them to accept applications from community groups for park access utilization. I think the idea was to expand the exclusion of the restriction to include youth development organizations that already have a proven track record and some of this programming right, Kim, yeah, I, think that would make most sense and maybe need to do a little more digging and research on that I. Think perhaps you know, Brewers office might be working on this a little bit too. So maybe there's someone I can speak with, but I think it's. You know essentially creating urgency behind the development of summaries, recreational programming and consideration of other sports based youth developers. That, like you said, Clayton, have expertise and stellar track records and potentially be partners and also providing programming. I recognize. These are strange and unusual times and, of course, like Public, Safety and Health have to be top of mind as well, but with the risk you know an entire generation of kids being left even further behind because of this pandemic, and because of these long- standing systemic inequities. I just think this is like so vital and yeah I was just going to also give my support for what you're proposing Kim. It is so critical and I am a little concerned that you know. Wednesday is July 1st and there really is nothing in place. It's you know, I mean we've been living with this situation for, unfortunately, a little while now and I just I do not think you can stress the urgency enough. It's you know the for kids, particularly coming from remote learning, which may or may not have been all that successful, depending on the situation to really not have some structure for the summer. For so many kids and then, of course, you know there are a lot of parents who are working. Hopefully, who you know, then they can't they're not able to give those kids. You know full attention or be their playmate for the summer. It's I think this is super critical, I really do and I. Thank you for bringing this to our attention. Thank you, Burger. Anyone else. Are there any questions or comments for members of the public so Kim? Why do not you go ahead and make a motion? And let's take this to a vote? If the resolution is the way that we will end up moving forward, a fantastic things, Clayton, so I proposed a resolution to the parks Department that outlines that, as I had mentioned before, with an entire generation of kids being at risk of you know being left even further behind because of the Corona virus pandemic and because of long- standing systemic inequities, we urge the parks Department to expedite the planning of summer recreational programming for youth, as well as further consideration and I guess further consideration of other proven sports based youth developers to be applicable as service providers as well. Sometimes that's great. We have a second all right, Craig. Let's take it to a vote. Wait yes, Greg! Yes, Mirian! Yes, okay, Callie! Yes, Chris! Yes, Erin! Yes! John! Yes, will yes, Sam! Yes, Mike still on the mic is on no he's: muted, Mike, you're unmuted! Yes, okay, Kim, yes, Evan! Yes time! Yes, Barbara! Yes, Daniel! He still might have dropped off. He dropped off. Oh yes, would you pass these great Thank, You Craig, thanks, Kim and also tomorrow, Luke? Let's try to help facilitate getting Kim in touch with somebody at the Bro President's office. Perhaps who, like she says, would already have been working on this and might help her with some detail about this way. We do have somebody from the borough president's office on the call right now. I do not know if there would be able to speak Brian I'm going to allow you to talk if you're still with us I. Thank you great dude. Thank you and Brian just well. While we have you, is this something that you're aware of that someone in Gail's office is already working on or do you know yeah? We are aware yes Clayton. Yes, now that it's arezzo, we can get it out immediately. We can have the exec committee vote on it in an emergency and then have the full board ratify it, but the letter will be able to go out immediately. You know as soon as it's ready. Okay, great! Thank you. If it's arezzo, that's better excellent, that's great thanks! Vikki! Accordingly, dude are you. Do you believe that we should be taking a vote on a resolution for the prior item as well? For the same reason? Yeah it bothers me because is not it even though you've had input on each before or because of how they've operated you did not even have to you gave it a no comment, correct or so that's psql. That gives it the no comment the psql has given a no comment. We we've written letters about eats for years because it was such ongoing project and development. You know it got better year after year. I do not think we wanted to deny support for it, but we also did not want have unanimous support for an event where we felt like there was so much room for improvement. Okay, so it's a little bit of a tricky one, but now on this one is there a time element? There is on the on the Eataly one yeah there, because they want to get it going by the end of next month. Well, we can do the same thing if you do larezo. My concern is that there's new information in there wait and our letters are really reiterating things that committees have really already taken a position on that gone to the full board and then we're only you know, making further comments substantiating something that the board has already agreed to. But this is basically new because it's a new set up well I, suppose that is true and I a resolution be fine. We can totally do that. The main thing that I think our concern has been about this new iteration is that Fifth Avenue issue, which has been our historic issue with this event so and is now different, and it's the so. In that sense the letter absolutely reflects what we've been talking about for my God 10 years. Okay, that one issue- obviously we've never talked about social distancing before, but their plan seems so well thought out that we did not even really have that many questions for them about that yeah. So you know I'm open to whatever is the best thing to do procedure, there's no harm in voting. Obviously yeah. Well, you know better than I in terms of what the committee has done regularly regarding Fifth Avenue and if that's the case, if it is, if we're on record, then I do not see a problem. My concern was that there was something so new about what we were saying, but basically the part that you're concerned with is the 5th Avenue part of it yeah, that's what we spent the most time talking on. That's for sure, yeah, that's true, I'll leave it up to you I! Think it's good either way. If you feel that the letter we can send the letter out immediately, that might be the best way. Yeah I think. Let's stick with that. I think that also now, that Keats is not here, I feel more comfortable kind of doing that way. If that's okay, all right great, thank you so much Kim and everyone. Thank you Steve for joining us. If you're still here I'm here, thank you for hanging out with us all right pleasure. All right take care. You too you're welcome anytime. Thank you. Okay, bye. We did have a late arriving item and this was and again procedurally I'm a little bit unclear what we're doing, but this was a resolution that CB 10 passed to advocate for a statue and Central Park honoring, the exonerated five hold on I'm just getting my email and I cuz I want to show you guys this resolution here it is so they are seeking support from other community boards surrounding Central Park, since we definitely can't vote on this, since we did not notice it. We did not know about it until today, at the very least, I wanted to share it with you and make sure that we had support on the committee for lending our support for this project and if so, I ve mail. We were communicating about whether this might go to another committee who might have time to notice it so that if you go to full board in the proper way, but I think it probably still makes sense for this committee to review it. Do you agree? Definitely so let me just okay everyone's seeing this, so this is for an exhibit in Central Park to commemorate the exonerated five and the movement for Social justice. The details of the entire event, which I believe everyone here probably is very familiar with, but I will also happy to share this by email with the committee afterwards is outlined here from 1989, with the convictions of the five youth being vacated in 2002, the city being sued and finally reaching a settlement in 2014 and the experience of those young men and their families being something that in our country was such a flashpoint for so many critical issues that our city is still seeing. So the Parks and Recreation Committee on CB 10 has been advocating for the installation of an exhibit based on social justice, and that is dovetailed with a commemoration to the exonerated vibe in Central. Park they've been working on that for several months, but it's been formalized now in the resolution last month, so they are coming to us to ask for our support for their proposal to move forward with advocating for a permanent exhibit. We do not I. Do not we do not have any details about beyond that, what the exhibit would be or who would be fabricated by etc. It's far too soon for that, but I think this is just about lending our voice and our support to I think a worthy project, so I'm wondering if there are questions or comments to this I'm going to unsure my screen. Are there any questions or comments so I? We can't vote on this. So oh my car used, if you like, Mike, you have to unmute yourself, oh I, think he's talking to so this might be another situation where, if our opinion in the form of a letter with advocacy, can be helpful, we can do that I believe, but we can not vote at the moment. So that's really the extent of the activity that can happen on this item during this meeting, but I think in the coming days, we'll figure out if there's another committee that can formally hear this and if so it'll certainly be helpful for that committee to know that this committee reviewed it as well, unless there are any further thoughts on that I think. That's all that we can do at the moment about this. Do you want to take like a straw poll on how the committee, without any input from the public, which is what we need to make it official? Do you want to get feedback from the committee that I think that might be helpful? Oh yeah, mostly retraction. Absolutely anyone wants to raise your hand and chime in and yes, Chris yeah. My gut reaction without hearing any community feedback is that I think this is a great resolution. A great thing to support. One issue that comes up for me is whether the exonerated five would actually want this, so I would want there to be some language in there making sure that it does not happen without their consent and their support. But besides that, I have no problems with it. Nothing could be a great addition to Central Park. Thank you, Chris. That's duly noted anyone else. I am taking it, of course, to assume that a lack of raise hands means that you just agree with everything. I will also ask if there's anyone else, members of public who are here who have any questions or comments to this project, feel free also to raise your hand. It looks like we just simply have support so I guess from this point. We will. We will alert you as to what agenda this ends up on next, and this could be somewhat more formalized. I'll write everyone that is, that is the end of our formal agenda. I did put a kind of mini orientation on our agenda for tonight. I am noting, however, that we do not have Mary with us tonight and, given that we've already been, we've already had an hour and 40 minute meeting I'm wondering if we might want to schedule a separate zoom call just for the orientation so that we can have Mary and also given that we right now anyway, do not have a meeting cycle scheduled for August. We do have several stretch of several weeks ahead of us that it might be more wise to schedule that orientation. Does anyone have any objection to that? I will bring up, though, that one of the main reasons I thought to have this kind of quick orientation now was mostly to answer any of the new members questions. If you have anything that that's come up in this kind of dizzying array of conversations that we've had publicly with all these different city agencies and entities and NGOs and bids, and on and on and on so many acronyms populate our brains. If there's any way, we can answer any questions or clear anything up or anything along those lines. Obviously Parks related would make the most sense, but anything that's come. That's come up that you might have questions about is the main reason I wanted to kind of open the floor for an orientation tonight. So if you do have any thoughts or questions feel free to, let us know: hey Clayton I have an unrelated question to that, so I'll. Let anyone chime in sure go ahead, go ahead, so just in regards to New, York, City parks and monuments and statues, etc. You know I there's been a lot of challenges and controversies, all acrosss the city. Well, you know specifically the Teddy Roosevelt Statue in front of the National Museum and there's. I do not even know what the latest of that situation is. I know it's on Park property, so the museum is, you know it's basically telling people it's not their call. Do we know on any of our parks in our districts? You know. Obviously there are I've seen recent Columbus Circle conversations come up again with naming etc, but are there any other specific two statues or monuments in any of our parks that has been sort of spurred recent debate or anything worthy to talk about or I do not know if there are any, but I was just curious if you had heard anything or if anyone on the committee had heard any, you know updates on any specific conversations similar to the other ones. Personally, I have not heard anything about that. Aside from a little bit of grumbling over the years about the George Washington statue and Union Square, but nothing that rose to the level of the Teddy Roosevelt debate right now, I do not know if anyone else has any more intel on that in our district. But no Aaron I do not know specifically okay and we do not. We do not have. We have not taken a stance in a Columbus, Circle, conversation or debate. Have we no I do not know? This is appropriate for you need to mention, but according to the city's maps, that's in community board for Jeff. That's. We still weigh in huh yeah he's like he's like a block from us, Todd Toddy to unmute yourself, Todd Shapiro yeah intervene here. Can you guys hear me? Yes, so just say with all the statutes being torn down and all over the country- and you know that's. The mention of statues even with the city is more statues in our part than anyplace else, and I just hope that our community board will say something or have some influence to make sure they do not get torn down or taken down. Precipitously I'm, just remembering you know the discussions we've had on many statues, the ones in Central Park about the role of women. Our district is filled with statues that the historic aspect of them is less important than the fact that they've become critical pieces of our neighborhood and I just hope that we can exercise whatever influence. We have to make sure that if they're going to come down that they come down and a reasoned and careful way and not just torn down, you know in a moment of political expediency, I mean that's our parks Committee. Hopefully it will have some say or role in that. Well, the only experience that we had in this city of statues coming down took many months of De Blasio, putting a task force together and looking at it, and the removal of the J Marion Sims statue, in particular in Central Park, although not in our district, was certainly a great victory for all of New York and in any situation as Extreme as that, I would relish the opportunity for the Community Board to hear that publicly, so that we could take a position and hopefully unanimously take a position that we would support the removal of something that is such a scar on American history. That said, Todd to your concern about it being done in a reasonable manner. I do think that if there were a case like that in our district, we would have the opportunity to weigh in, and we would do that in an appropriate way. But thank you. Thank you for the point. All right. Everyone I think that's going to call it for tonight unless anyone has any last questions or comments. I think that we can adjourn and stay tuned for an updated date for an orientation, and we will do a proper orientation on a separate date, free of a committee meeting with many thanks in advance for your flexibility and for your reasoned input and collaboration tonight. It is always a pleasure to work with. All of you hope you all are healthy and safe and we will be in touch soon. This meeting is adjourned. Thank you all so much.",
            "summary": "That, you have already attended committee meetings, and, of course, full board, but this is the first time that you've actually been here for parks and public spaces, so for everyone's benefit.\nWe will leapfrog that item and we will jump right to Madison Square Park Conservancy, who are joining us to discuss revised plans for the food market in Worth's square I believe it would probably be who've the new committee members to have a little bit of context around what we are hearing tonight in the thumbnail sketch of this long.\nHistory is that for many years there was a food market twice a year in word, And. We there was a lot of support in the community for this event, but there was also a lot of concerns around navigation issues and signage and other things, and over the course of many years we worked with the Conservancy to address those concerns and improve them year after year, at the time that the contract expired for that particular event, and it was time for a new one.\nHow, a new iteration of this food market could better address the public benefit in response to that, not in response to that, but over the course of several months, working with the Conservancy and the Parks Department on the language.\nThose concerns included pedestrian navigation, down, Fifth Avenue along the east side of Worth's square sight lines above the event congestion, so that there's a possibility for navigation through Worth's square and a lot of interest in the identity of the vendors.\nI think it may be a lot less because there's no workers in the park, but I would say that the people that come needed a lot more and so I do not know who have.\nThink Clayton laid the context I'm going to hand it over to Rory who's working with Eataly, to kind of lay it all out for us, and so thank you for your time.\nThis is a brand new layout proposal that has passed muster with the Parks Department, so far, pending some social distancing stuff like sign- in to that, and it's the first time we're presenting it here to the community board.\nThe pure concept had a pizza, station, safer sandwiches and salad, a pasta station, a bar and escuela or school for interactive lessons and cooking lessons, and things like that, This was supposed to take place in May of this year and again in September of this year following the RFP and the model that was lab4 by parks and by CB5 over the past years , May was cancelled due to coronavirus and we were looking at possibly adding October but frankly, with everything that's going on with coronavirus and then the pressure of the city from the city to activate something.\nBut we can imagine that it would be people behind the glass behind the service counter explaining some of their products and Italy right now is working hard on getting those upstate farmers as partners for any kind of program starting the 30th.\nThere are two types of patron: The first type would be those receipt in the inn within the confines of Wirth square and to maintain social distancing, we're working with the parks Corbin on what we can get approved in terms of floor markings in combination with active attendees or ambassadors.\nThe idea is with a single line through the seating area: We can maintain that 6 foot, minimum social distancing and once people are sitting at their tables, of which this model calls for 32 top tables.\nWe are free to ask questions and comment, as we please tonight on this issue, but I believe that it is appropriate to leave it to the psql Committee to determine how to move forward, given that this particular seasonal license, we have never objected.\nIf we approve of the improvements given to the layout of the event generally, then, if anything, there would be more support, And just to read, are we playing that we Do not even think we brought you in to the psql Committee on this issue ever in my recollection, That said, as we move forward in a discussion.\nSo I think that if you're, not you know, if you do not want to be a patron, We can't create a single line just to view general Worth's monument.\nWe raised everything to run the part, so the revenues from this event are important: And, I, think, additionally, the ability to shop outside to go and get food and things that you can then eat whether you take it to go and go sit in the park or you take it to go in the home or It's really important to have access to outside services.\n: I think, maybe you maybe you hopped in when we were explaining the pure concepts, the concept that does not involve a pandemic, that what we're looking at right now is one kiosk that serves beer, wine and prepared foods, which is most likely ice cream and How are you how what's the plan to keep the social distancing at that station?\nIt's a dynamic thing from an Operations standpoint, the more people you can service the better you're going to do from a revenue standpoint, but to do that safely, and also for the first time in a new location like this, the more complicated you make, these plans, the more these plans can go awry What is the plan in terms of having the line go in a certain direction, either towards a 24th, Street or tour or kind of going along side on the outside of it west of Fifth Avenue?\nDo not think anyone would disagree with that, but the issue is just that, it's not an academic exercise, as we saw over many years with our concerns about 5th Avenue pedestrian navigation in the past, with eats they're just going to do.\nThere is no walkway down fifth, that then the west side of Fifth Avenue for the public unless you're coming through Italy, so Clayton and Todd to your point, and there is not a great plan to stop people from walking in traffic down Fifth Avenue.\nWe 're, checking them they're, maintaining their social distance they're, getting the signage they're speaking to an ambassador, And. Then we would have to create a chute we'd have to create a another perimeter to the west of this new lane to ensure that the people who are coming into the area, which is Italy's responsibility to keep safe, are kept safe from the unencumbered public and certainly the ones who had otherwise walk in the street.\nIf the restaurant is entitled to use a lane of traffic for seating, they may self, I mean how you know what is the degree of traffic right now at that spot, like how An open, question- Maybe.\nThink that there is something about bringing back a little bit of spirit to the city that is so important right now, And, you know some are supposed to be fun and people want to be outdoors, And I think that either maybe traffic patterns can be changed or pedestrian walking patterns can be changed.\nYou know improving what the shape of this event and the process of that RFP I think it would behoove us to put our concerns and questions and support and all the things that we discussed today into a letter that can go out as soon as possible to the parks, Department and also do T to investigate this particular issue seems like it might be the one that we would have the most concern about, but also to pledge our public support generally for moving ahead with a revised, socially distant version of this event.\nYou know that I'm in the neighborhood And I see everything that's going on Brian, especially given what the whole idea of having we're trying to generate more street traffic and the most important thing is just people getting out and walking around so, I would not make that stumbling block to get this done right simply.\nThis event, so I wanted to call you out and see if you had any questions or comments at the moment, muted and Miriam You know is taking in that lane of traffic and because of the amount of time that it is, and That CB5 is advocating for an increased footprint for eats so many ways and Miriam The main kiosk is going to be the full width of the worst monument in front of it.\nWill we're not going to take this to a vote, but I will just move informally that we put these comments and questions into a letter, the biggest one being the Fifth Avenue navigation, but, most importantly, being on record supporting the revised iteration of this event for two cycles in a row.\nThis was something that had been tossed around and Beck's a little bit about summer programs for youth this summer in the parks, citywide Kim. I, wonder if you wanted to just frame this conversation and with your specific questions as well sure things, so I had been thinking a lot about what youth will have to do this summer.\nWe recognized the Summer Youth Employment, Program, being somewhat halted, and, of course, programming in general being late to be released, and so I had questions around how parks was creating a recreational calendar for youth this summer and just so fearful that there won't be things for kids to do, and you know, without opportunities to either work or our skills or be physically active and engaged that they could turn to other behavior and so I think providing you know positive calendar of events and things like that would be really helpful.\nAs far as Park usage regard regarding dog parks and girl, spaces and basketball, hoops, and things like that, Already I also had questions about how we could better utilize community- based organizations that are experts at providing programming in our parks and how we could provide them with an expedited process for permitting for this summer and if that was being considered since they know how to do this really well.\nIf we're going to be able to issue permits, or for the summer right now, the system that you can not it, you can not submit an application So that we know what, when our situation is for the summer.\nThat's the point just that we could, with the direct questions as things move along I, think we would want to do our part to stay in touch with them and see what news we can get as it happened, because it is mid, July.\nAnd I'm curious, if you are moved to propose a resolution to ask the parks, Department and City Hall, to look at these specific questions, rapidly, obviously taking public health into consideration.\nYou want to do a letter, well, either a letter or a resolution, because if we write a letter, it can come from the committee as we've done before quickly If it's a resolution, you're concerned that we would have to wait for the film or that's right, And I think the most important thing right now is for City Hall.\nYou know the systemic inequity that continues within marginalized populations and thinking about kids that do not have access to paid programming are the ones that take advantage of free, Park, Recreation.\nThe resolution is the way that we will end up moving forward, a fantastic things, Clayton, so I proposed a resolution to the parks Department that outlines that, as I had mentioned, before, with an entire generation of kids being at risk of you know being left even further behind because of the Corona virus pandemic and because of long- standing systemic inequities.\nPark they've been working on that for several months, but it's been formalized now in the resolution last month, so they are coming to us to ask for our support for their proposal to move forward with advocating for a permanent exhibit."
        }
    }
}