{
    "YoutubeMetadata": {
        "author": "MCB10",
        "channelId": "https://www.youtube.com/channel/UCOkywXyXAPDP3E_aykq0XFQ",
        "title": "July 2020 Economic Development Technology \\u0026 Communication Committee Meeting",
        "publishDate": "2020-07-10",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB10",
        "normalizedName": "Manhattan Community Board 10",
        "twitterName": "Manhattan CB 10",
        "youtubeChannelName": "Manhattan CB10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
        "twitterHandle": "@mancb10",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": "changed live 9/13/2020"
    },
    "properties": {
        "fullTranscript": "See good evening, everyone I'm just trying to give a few minutes to allow folks on the call good evening, hmm few okay, good evening, everyone. So my good evening, my name is chanel washington. I am the chair of community board tent economic development technology and communications committee, so I am calling this meeting into order at 6 35. So are there any other committee? This committee echo dev committee members that are on a call that can introduce themselves really quick, michelle booker, charles johnson. Okay, thank you guys. I guess that's the only two! That's on the call at the moment, so we do not have quorum at the moment. However, I just want to go over the form, so those even if you're, not on this committee, I believe, there's a process for public members before I can even attempt to act for that process. I need to know that people are interested. So even members who may not be a part of the board or a part of this committee are welcome to submit that form. It does have the option where we will know whether you are it says it asks you if you are a committee member, if you are a board member or if you are a community member, so you just pick the option if you are not sitting on the board that you're a community member, so that is an option for you to participate in this committee, so I am asking folks to please fill out that form that would like to participate in the future. Now we have some presentations, one is from the frederick douglass boulevard alliance about open streets. I'm not sure if someone is on the call yet for them. Shati. Do you see anyone? I don't see john. I don't see anyone else from the alliance. If they are on the line, you can just unmute yourself yeah. I don't see anyone yeah. I don't see him either. So I'm gonna move along in the agenda for a new applicant sla applicant for neighborhood brulee coffee shop is the wayne chan sure. Are you this evening? Oh hello? How are you I'm good? Thank you for having me okay. So, basically, you are free to present at this moment. As you know, we ask for you to submit a form to submit the sla application to us while trying to not be a burden on small businesses in our district at this time, but actually trying to figure out ways to move this process along so yeah. We have submitted a an opinion form for committee members to vote whether they would like to see a business come before us and the vote. Obviously I believe you've seen the results is that you know we would like to see you present. So this is your time. Okay, well, good evening, everyone in committee community board 10.. I just wanted for those who don't know about nbhd brule. I am located at 2620, frederick douglas boulevard at 140th street just opened primarily for business, this past october 2019. Of course you know we had to close because the covert and now we reopened just this may 15th. So mbhd brulee, it's a coffee shop, but it's more than just a coffee shop. It's like you know the neighborhood was missing a gathering space for people. Now you know we get, we have people that come from everywhere. What drives this business is the sense of building powerful community. It's a space where people get to know one another where they kind of understand, just a little bit of the little piece of how we're all connected and what how we all you know, share, mbhd, belay sort of reflects on art and creativity. You know growth and history and sustainability. You know, we believe, like we believe in you know, working to meet the needs of the present without compromising the future. So you know with that. You know we offer as a cafe side of us. You know we offer you know healthy food choices. You know we, you know what's rooted in our business. Is this. You know this positive energy and positive networks that impact the community. You know even beyond our four walls, so we have involved into the destination hub for networking for exchanging information about resources. We try to work like just in the past. If we just opened back for juneteenth, we, you know sort of went in alliance with street corner resources. Try to give back community like free coffee, free iced tea day and just on the fact of why I was requesting you know the sla beer and wine is that you know people love the space as a hub and as a gathering space, and it just you know, will disconnect the community a little more to give them a little bit more offerings, and you know just so. Everyone sort of you know, evolve and and be purposeful. I think that's it. If anyone has any questions, I can gladly answer I'd like to get to know a little more about mbhd burleigh. So yes, so thank you very much for that presentation. At this time, I'm going to open the floor for committee members and board members to ask questions. Okay, no one has questions. Well, I have a question in terms of a little bit. How have you been? How has this process been, so you guys are already right to eat it again. I'm sorry, I'm sorry, you guys are open already right and I'm back open since of may 15th shorter hours than I previously started. We used to be open from seven days a week: seven a.m to seven p.m, but now I'm open only tuesday through sunday, so I'm close on monday 9 00 a.m to 4 p.m. Right now it used to be 3 p.m, and I extended it another hour to 4 p.m. And just you know, personnel issues, people wanting to come back to work, able to come back to work, that sort of thing and just the clientele the basis of people you know for me, was keen on people actually going to work. It was part of the clientele school across you was close by teachers will come in people going to work that from the neighborhood on the bus seems like there's a whole different. You know thing going on where people like you know, people who are getting up at seven a.m is now like the 9 a.m, like the new 7 a.m is what I call it like. You know so like the purpose and destination is not there, but you know, generally speaking the hours I opened, it has been a little rise and some clientele people, you know happy to see it open back, and you know very supportive in that way coming when they can. Okay got you, and so within that process, are you able to? Are you giving out a mask or anything like that? Do you have these materials? Are you able to take advantage of some of these opportunities that they have these loans and great? I took advantage of the eidl loan. I took advantage of the payroll protection plan from both from sba took advantage of gathering getting an advisor from as the columbia university's version of sba ssbdc. Just to you know, help guide and make sure everything I was doing was on the right track so that I've got a lot of help from that. I was lucky enough to be awarded a grant from hello alice, so I participated in that and they, you know, was kind enough to see. You know what I was doing very positive and very positive reflected to the community, and I was awarded a grant from them, which was a big help as well. So those are the things taking advantage of the part you asked about free mass. I wasn't sure what you meant by that. Do you have access to, like you, know a Covid-19 protection items, hand sanitizer, oh with that I purchase and have for my employees. You know we have signs at the door that you know friction that you must have wear masks when you come inside, because we do allow two three at a time to come in and place order and then have to go back outside. There's no eating inside ain't no consumption inside. So we have that through the door service we actually let people come in, but you know we just require mass and we try to sanitize and just even yesterday I just did like a whole, like sanitation, sanitization, with a company to sort of have this fox annotation to try to sanitize the whole store. Try to do that now, like at least every two three weeks. I just did that yesterday, things like that, you know we're trying to be very on top of it. You can't do it with me there, okay, so my last question is that there's some questions about community-based organizations have: did the staff send you some information on the community community-based organizations? I haven't seen anything the only the only other communication I saw was from yourself about the next meetings and joining, but that was it. I don't think I recall saying anything about community organizations, okay, cool, so I'll, make sure that we get that to you sure. Does anyone have any questions from the community? Okay. So thank you for your time, mr duane. We will get back to you. So, as you know, we don't take an official vote here in committee. It's like a reputation before the official vote and general board. So that's the process here. So thank you for coming. Okay, we'll report, your presentation, thank you. Thank you. Man. Thank you. Very much have a good evening. Thank you is fd is fdba on the line. Yet, okay, so are there any elected official representatives that would like to give a report at this time? Okay, so we are supposed to have a training tonight at 7 30. We will have mr albert wieber join the call from 7 30 to 8 30 on an open data training. Since a few people are not present for the presentations at schedule, I guess we can move along to community comments or concerns. Is there any community comments or concerns in regards economic development or technology in this district? Okay? So I'm going to move on hello now, yes, ma'am hi good afternoon. I just want to give a very brief summary about the ppp loans that came down through the heroes act and how it affected congressional district, new york 13 and the support that congressman espion gave to the district to make sure businesses and jobs were retained. So just overall there was a total of 5 673 pp loans approved in our district and jobs retained were 33 475 and as of june 30th, there was the total amount of money that came to our district. Via these ppp loans was 131 million 479 782 dollars the average amount of the loans given were twenty four thousand eight hundred eighty two dollars and sixty two cents. I also would like to let the community know that the ppp has been extended through august 8th and there is still 120 billion dollars still available for small businesses and eligible non-profits. Thank you. Thank you very much michelle for that update from congressman espion's office. Is there any other elected officials on the call that would like to make an announcement or present okay? Thank you. So I'm going to move on to old business and new business watch and now, oh sorry, this is sicily. Yes, so I did have one little update. I didn't know. I know fdba was supposed to be on here, but I can get a small update from the side of the community. But did you already talk about our walkthrough? No, I didn't talk about the walkthrough, because I was trying to give them a little bit of time to try to get on, but I guess we can go ahead and discuss that. That's fine! No! It doesn't matter. I know that I know they were trying to get on here, but I just didn't want to have to leave the call before we had a chance to at least talk to your committee about that and what we believe should be next steps, but it's fine whatever you would like to do. Well, no, madam chair feel free to vote. So just so everyone knows, I don't know. If chanel you talked about it at all, but we did do a walk through with fdba people who were there madame bro president gail brewer was present chanel was there jeff eaton from the naacp? Was there I think there was someone mr sean reinhardt or john reinhardt was? Who was that marvel yeah and arva rice? Was there as well and chris archer? Yes, so is there anyone else chanel, you seem to have a better memory. I believe. That's it that's. What, like, I believe, derek. Was there too from the end yeah derek perkinson. Was there also from the board? Dane brown blackman was present and I think that is about it. But what it was is we just walked up frederick douglas boulevard to see which restaurants were already in their alliance and their association, and then oh and michelle was there too thanks michelle to see which restaurants were already in their alliance and which restaurants they were thinking about. You know asking to be a part of the open street, so they are supposed to be putting in an application to extend what is now the curbside dining into the streets and that would totally shut down fd director douglas boulevard from 112 to 121st. That is their application. So all we did was walk around looked at the businesses to see how that would actually operate, how many businesses were on each block that would participate. So in some of the blocks there were no businesses or no restaurants. That would be eligible to participate. So we were also thinking about what made sense for them to even begin to think about shutting down that street, and we wanted to also talk about sanitation as well as public transportation and emergency vehicle egress to the area. So they're supposed to be getting back to us with a map of what that might look like, so how they would actually bring these the streets and the tables and chairs into the street, and they would be responsible for picking those things up every night and bringing them back out, so they, I think it would last friday night from five to nine. Then again, saturday and sunday from I think, was it 12 to 10 chanel yep. So we also thought that was a long time period for the m10 not to be running. I did have a conversation with d.o.t after that, so hopefully they'll be able to come to transportation and kind of talk about that next week, but DOT also needed to take time to assess whether it's even feasible to think about shutting down the m10 and where would the m10 run and what that might look like. So I know we don't even know if it's something that's actually going to happen, but since the open restaurants, open street concept has now is an application process, fdba is now free to apply so as soon as they get their application in. It's not a self-certification as such as how it is right now with all the restaurants, but it is something similar to that, so they do not have to have community board input. It's just that they have to give us notice. We don't have a chance to vote on it. We don't have a chance to have a real say, so I did talk to d.o.t about that concern because I think we do need to have input on it. So was there anything else that I missed michelle or chanel I mean I did request for at least our community-based organizations to have small booths for the purposes of social, distance and material. You understand that that is not an option. They said they can re visited the circumstance. After what phase four or something I'm not sure so, yeah we know community-based organizations spread out throughout the circumstance. I did, however, ask john about security and how they plan to have security in light of what happened on 7th avenue, because we are in the summertime and he said that he was speaking with NYPD. I don't know if it was the 20s. I believe I guess it's got to be the 28th precinct, so I'm not sure yeah. They haven't gotten back to us on that. Well, because they're going to need security, I mean if people are going to lose jobs, lose money and then we're gonna just put like nice restaurants in the middle of the street. I think that may be a concern, and especially no community-based organizations to interface in case there's any altercations and that's pretty much all I have in terms of fd ba. I'm not sure I guess no one is going. Oh, I see a message from john that he's not able to get on the call at the moment. Okay, so I believe that open data stacy garner is on the call at the moment. Thank you, madam chair, for that update for frederick douglass boulevard alliance about open street 112 to 120th. So I'm gonna, move on to stacy. Hello is stacy hi. Can you hear me yes good evening? Stacy? Do you have albert with you? I know we're running ahead of schedule. Yeah, I'm here! Oh you are here: hey y'all, okay. I have requested for open data to do a training for the community in terms of data and what data is available to help us try to understand, what's happening in our communities and to be able to use that data when creating resolutions for problems, so they are going to give us one of their short trainings. She is also extended an invite for us to provide, I guess, ideas around providing I data that they may not have yet. So, if there's some sort of data that we are looking for, that we think would we would be able to use to address an issue. She is asked for us to go on ahead and send it over to her and see if her team would be able to create something to provide that. So I just want to open the floor to stacy garner for this training. Okay, sorry yeah! So I guess I can kick it off al. Are you ready to go? You need a minute nope, I'm just gonna run through the portal live, so I'm good to go okay, so I was here I guess about a month ago I gave a brief overview of open data for everyone. It's basically just the one-stop shop portal for all city data in from the city agencies and albert, is going to show you exactly where you can find it, how you can use it to solve civic problems, just kind of the basics of navigating it filtering it down, exporting it all the beginner steps so that you can start poking around on your own and and then you can of course tell us if there are things that you want to learn more about. But albert's presentation is really thorough and should give you guys a really good beginner look at it and if you are all on your computers, you can actually follow along with him, because he'll be showing you the url to go to and basically showing. You live on the portal step by step. So if you'd like to do that, he will be showing you that very shortly and with that owl, if you'd like to kick it off, I will thank you I guess before I start, can everyone see my screen now? You should be seeing a web browser with the open data portal with the big slogan in the middle of the screen. This is open data for all new yorkers. Can everyone see my screen? I just want to be sure that I'm actually showing everyone something. No all right. Let's see I am there we go. Is it? Is it working now? Yes, good to go perfect. Thank you. So let me just sort of maximize this great. So let me just quickly introduce myself so my name's al weber and I'm the director of open data at doit, that's the department of information technology and telecommunications. I know that stacy stopped by well not in person but gave like a brief overview a few weeks ago. So I won't go into that much detail, but I think one of the best ways to sort of give people information is to walk through these things live. So my plan is to just go through the open data portal and touch on a few key topics: that's searching the open data website, creating maps creating visualizations and then just letting you know some of the intricate details that can be sort of tricky when navigating the website things like the different domains, you can see and then pointing out different resources that are available to you. So I know that I'll do this training I'll run through all of these things, but I want you to be able to go back and access this information for future reference to share it with folks and things of that sort. Please bear with me. I believe it's murphy's law that says, like anything that can go wrong, will go wrong. So I'm working on my home wi-fi it can be a little spotty sometimes so please forgive me if, like the speed, isn't working or if we're not downloading something as fast as you may have normally seen it, so I guess I just ask you to please bear with me all right so great. So, let's get started so right now, I'm on the homepage for the open data site. If you look up here in the address bar you're looking at our domain opendata.cityofnewyork.us, but honestly, the quicker way to get to the portal the quicker way to remember it is just to go to nyc.gov data, and it brings you right back to this same site. So nyc.gov data is the quick way to find the open data portal. What we're looking at here is our opening site and I'm not going to type in this search yet, but you can go here in the search tab and you can search for anything that you're looking for. We try to tag our data with as many keywords as possible so that you can find the information that you're looking for. So, if you're looking for something like 311, which is very popular for service requests, you can find that another one that I really like to look at and we will probably go through it today is restaurant inspection results I like to go well in and be prepared for this when you're going to you know, look up your favorite local restaurant or something like that. You can see the grades that they've gotten the reason. Why is they got those certain grades? Sometimes it's not the information that you want to hear. There are some things in restaurant inspection results that may be a little squeamish for some of us, but I think it's good information to know to make informed decisions. I'm going to scroll down on this page a little bit and then let me also just say if anyone has any questions at any point, if I'm moving too fast, if you can't hear me feel free to chime in I'm going to run through this at a certain pace. But if you have any questions, just stop me and let me know so when you're on this page, it sort of scrolls down pretty far. So there are a number of things that you can see and it may not be that intuitive, but to start so scrolling down here on the screen. What we did was we created sort of a path for different users of different skill sets. So if you're new to open data, you can click on this link right here and just get a quick overview of what data is and then we also have sort of a step-by-step road map for how you can filter in a data set and find other key information that I mentioned these additional resources. The knowledge base from the company called socrata is the company that actually powers the website with the information that you're looking at. So we maintain the information on it, but they provide that technology behind it and then what we also provided is resources that come from other organizations that are also big on open data, so from beta NYC NYC city map from github. So, while we're providing information, while we're sharing tools for using the open data portal, we acknowledge that there are other groups that are doing a great job as well, and you can always go here and find that similar information from those other groups. So I'm going to go right back to the home page also for folks that may be a little bit more advanced, which we've sort of tagged as our data veterans. So one thing that you'll notice, if you're using your smartphones, if you're on your computers, all of the applications that we're all using on a regular basis are powered by data. So a lot of times. We have folks that are application developers, data scientists, things like that. They want to access city data to create those sorts of applications, and that's usually done through what's called an application, programming, interface or api. So we have api documentation that you can use that you can get access to it's sort of a way. I guess the easiest way that I'd explain it for non-techies is with an application, programming interface. It's sort of a way that us as humans, can sort of talk to the computer and get the information that we're looking for back. So, if you're an application developer, and you want to quickly and easily download 100 million records of taxi trips that took place across the city, you can do that via an api as opposed to going into excel. Where you know you may have realized or a similar program. Once you start getting into the hundreds of thousands of roles, you might have your computer freeze or start making a whole lot of noise inventing and being very loud, so api sort of like streamline that process getting in touch with us. So one thing that stacy that was mentioned earlier on was that, if anyone's having any difficulty following finding any data that they're looking for one way is to reach out to us through our help desk hello, I'm sorry to interrupt you, but does someone have their phone on not on you other than mr weaver, because we're hearing like some background? So I just wanted to try to stop that really quick. So we can hear you better. Oh, please continue, mr webber. I just wanted to stop the background, got it no problem so yeah. So, if you're having any issues finding data that you're looking for anything very specific, you can do that by getting in touch with us here on this tab and I'll sort of recap this all again at the end or at the top of the page, through our contact us page and then last but not least, that's where you would sort of go into diving into the data. I'm gonna come touch on this project gallery a little bit later, because I think after I show you all of the interesting ways that you can filter and map data. That stuff will make a lot more sense, so for right now, what we're going to do and there's a number of ways to move forward to get to the data you're looking for you can go into this tab right here and you can type in whatever you're looking for or you can go to this tab up here with regards to data now the reason that I'm going to go here to this data tab is because there's more information that I want to show you we have this filtered here for new data sets, so you can see some of the data that's been published most recently. Currently, if you ever have the time we have about 2 800 data sets on the open data portal from about 80 different city agencies and offices, it would take you a long time to go through all of those, but you could always click on the new data sets or the most popular data sets to try to find what you're. Looking for. So I'm going to start right now by clicking on the most popular and popularity. Is that scores pretty much comes from an algorithm that sort of looks at downloads mixed with those sort of api calls that I mentioned earlier so before we dive into that. Just navigating this left-hand side of this screen data is broken down into different categories, so one way to search what you're looking for is by category. You may want to find something on education, on the environment, on public safety, so you can search for the data set that you're looking for by category. You can also search by different types. So, if you, if you know that you want a map, maybe you're, looking for a specific community board district or a council district or if you're, looking for some sort of a filter, whatever you're looking for you can find it here, more than likely you're going to be looking for a data set or you're going to be looking for a map, and then I'll only go through two more of these, we have what we call data collections. So a lot of times, city agencies make data available and there are a number of data sets that are all in relation to one thing. So what we did is group them together as a data collection. So here you know, I guess the big world issue right now is the coronavirus and cobit 19 that's going on, so you could click there and you could find any city data that you're looking for around covid19 information around the department of buildings and electrical permits things around motor vehicle collisions. So that's an easier way for you to find what you're looking for grouped into one bit. Also, you know vision, zero, the mayor's initiative to reduce and to eliminate traffic fatalities. So all of that can be found in a data collection and then, last but not least, you can search for data by the agency that you're looking for whether it's acs or children's services or by the different presidents. You can search through all of those different methods. So before I dive into the data and get to the more interesting parts, I guess of this training any questions at this point before I move forward and look into another data set great okay, so the most popular data set I'd say on the portal is probably- and it's already highlighted here- 311 service requests. So that's the data set that I'm going to look at it's the most. It has the most fields, the most interesting information, and I think it's a real reflection of a lot of what new yorkers are thinking so right now, when I click on this data set we're looking at what's called the landing page, it gives you some information on the data set itself, so this one is automatically updated. It updates every night at. I believe it's 9 30 p.m, so we haven't updated yet today, just yet, but you can see its last update was july 8th. So far to date there were 393 000 views and downloads, and this is a large data set. There's 23.3 million records in here. So if you were to try to just sort of navigate all this information, I guess I'd say good luck. You have 23.3 million records to go through. So that's going to take you some time, but I'm going to show you exactly how to filter that, how to make the data set a lot smaller and make it a lot easier to navigate. So what we're going to do is in this upper, I guess sort of center of the screen we're going to click on view data, and this brings us to the actual data set. So this data, when you're navigating it most of what you're gonna be looking for, is in this upper right hand corner on this utility bar over here and by default. We automatically go to this filter page then this filter layout- and this is where you're going to get the bulk of the information you want. Now. Here's where things get a little bit tricky, but I want to sort of differentiate and show you what we're looking at so say. For instance, you want to filter on the created date now over. Here I admit it's not the most intuitive way for you to see what you're looking for, but if you notice, where it says unique key here that aligns with unique key here, which is a column header. So when you click on this, you actually get the drop down of all of the different columns in the data set. So you have your new unique key. Your new key, your created date, your created date and that's basically, the core of how you're doing your filters you're going to find your column that you're looking for and then you're going to bring up your search clause, which is right next to it. So because we're looking at 23.3 million records, one of the things that I always like to do is make the data set a smaller subset. So it's easier for us to filter it's better performance on your computer. So we are going to take this second column here, which is create a date gonna hover over it and click it, and now we're gonna go into our search clause so to make it a little bit smaller to deal with I'm going to say the created date is after and I'm going to click in this little bar right here, and it prompts me with a calendar and I'm just going to say for the sake of this training after july 1st and then just sort of click off to the side. So now, if you look at the total down here at the bottom of the screen, we went from 23.3 million records to 72 861 records. That's a lot easier for a computer to process for a computer to sort through and now these are all of the records that the srs that took place in that time period and to continue filtering. We just keep going down on this little section over here and we can just add a new filter condition and we can repeat the same process, so I know we're looking, for instance, let's bring up community board. So if we scroll further down within the data set, we can bring up the compute community board and I'm just going to type in 10 Manhattan and again so we went from 23.3 million records down to about, I think 73 000 down to 1616.. So now we have all of the service requests in place from july 1st, on in community board 10 in Manhattan, and then just for the sake of this training, I'm just going to do one more filter. I guess I will choose. I guess we'll go by the complaint type, so the complaint type is where you see like the different things that people are calling in for noise fireworks different things. I know the new story that's been going around the city is the amount of fireworks that have been happening in the city, so I'm going to click on the complaint type again, just like we did for the earlier ones where it's unique, we're going to click on the complaint type. Now here's the thing. That is another thing to note earlier when I did this filter here I used. The search clause is because I knew that I could find 10 Manhattan, but sometimes, if you don't know the exact wording of something or if it's sort of like this noise space, hyphen space vehicle you're not going to find it so you're, usually better off going with the contains search. So what I'm going to do is say complaint I contains, and I'm just going to say fireworks. So what that's going to do is bring up anything fireworks related. So again we went from 23 million records to 73 to about 1600 and now we're down to 501 service requests. So this is just some quick basic filtering on how you can navigate a data set, choose the appropriate search that you're looking for to find the things that you're looking for so just a thing to remember, always unless you need that full value of a data set, take the created date, bring yourself down to a smaller size. Just so it's easier for your computer to handle. I know not. Everyone has like an eight core processor that can handle those large amounts of data, so bring it down to a smaller size and then vary your different searches. What is not starts with contains I'm not going to go through all of these, but what I would say is just play around with it right because if you were looking for say, for instance, we're looking at community port 10, if you just wanted everything but community boards- and you could have said- is not 10 Manhattan, so I would just say play around with it to get comfortable with it and again I'll point out the different videos that will go and sort of repeat the steps that I went through so before I move on to the next phase, any questions so far around filtering or anything that I did so far great all right. So what I'm going to move to next is a visualization, so there's two ways to go about visualizing data again here up in this upper tab or if we go back to the page that we started from. Oh yes, I'm sorry. I will do that right now so and again, thank you for pointing that out, stacy, so taking us back to the earlier home page to create an account in the upper right hand corner. You can go up here to the sign in page, so creating an account is not mandatory, but it's helpful. So I have my account here and there's some different sort of trainings that I've done in the past. But when you go up there, all you'll need is an email address where you can sort of verify your account. You'll create a password and you'll have that account in place and what the account does is it allows you a few things you see how I just created that filter you'd be able to save that filter, so you wouldn't have to come back every single time and recreate the filter. We're going to do some mapping the same for maps. You can save the map that you have in place and always be able to come back to it, and then I mentioned earlier for the developers and data scientists and people who like to do a little bit more advanced usages of data. You can get what's called an api key, so by default, people are given a certain amount of they call them calls for their apis. If you're a developer that registers for an api key, you can do a little bit more intense work, you'll be permitted to do more calls or requests for that information. So again, I just want to point out that creating an account is not mandatory. The resource is set to be available for anyone to use without registration requirements, but there are, you know, perks to if you want to save the filters, and you want to do some more advanced data analysis. Work signing in would be helpful, so I'm actually signed in at the moment, but the only thing that would prompt you to do is enter your email address and then to create a password. It's very simple, probably take about a minute of your time, and that way you can create an account for the open data portal. So I'm going to go back, I'm just hitting forward again going back to the data sets. Oh no. I went too far back already. I'm back to the data sets that we are looking at. So again we were in the data tab and then we clicked on the most popular data sets, give my wi-fi and then we were looking at the 311 data set. So we're going to move on to visual visualizing so right here, the first drop down that you'll see is for creating a visualization. So it brings you to this screen that can be a little bit intimidating at first, but it's really not that bad. So trust me, so you have within the three on one data set, so to start along the top of the page over here you have your different options for the visualization. You want to create bar charts, column, charts, pie, charts, I mean you know, charts galore, but what we're going to do for right now is this one over here that sort of looks like a globe. I guess you could say we're going to click on map, so this allows us to map the data that we're looking at and then we're going to work, we're going to apply a filter similar to how we did in the data set to get to where we're going. So for those of you who may have used the open data portal in the past, you'll notice that this visualization tool is a little bit different than before. It asks you for more information, but in the end, you get a better, more responsive, better, looking map. So after we chose map on this upper right hand corner, we are going to look at our filters also in the upper right hand corner. So you could just map all the data that we mentioned before, but again you're looking at 23.3 million records, so we're just going to recreate some of the similar filters that we did earlier so we'll go here. We'll click add filter and then we can choose the different columns. We're going to look at so again, I'm going to start with the created date column and I'm going to choose the range of what I'm looking to filter. This data goes back to January of 2010. That goes pretty far back. You can either free text the date that you'd like or you can scroll through it from the map for what you're looking for. I don't want to scroll to 2020, so I am going to pre-text type this in so again, I'm going to go from july, 1 2020 to today's date, and I can also just click on the date on the map and it registers and then I'm going to hit the apply button. So I just applied the date filter now, I'm just going to similarly add another filter, we're going to scroll down again to the community board, but the better thing that I actually like about this map is that it pre-selects so before we had to know exactly what we were looking for, but now we get common values, so that makes it a little bit easier for us to navigate so the filtering. The mapping is a little bit more intuitive, so I could type in, for instance, one and everything starts with a one. Will pop up? Excuse me string, so we are going to go again with 10 Manhattan and we're going to hit this register. Let me do this one more time again we're going to hit, apply and then we'll add one more filter around the complaint type and we are going to type in this time. Noise we're gonna hit apply. So now all of those filters are applied by default. I'm sorry. We are currently in philadelphia, let's roll over to new york, so at first glance it gives us a large cluster of the request that took place until we zoom in and as we zoom in you'll, see the points start to appear so the more we zoom in the more we can zoom in on the request it took place. So now we're going to go to how this stuff registers. So on this side, I'm going to jump down to so well I'll, go through each and each and every one of these points so location you'll leave this alone for the geo column it by default will take you to the location. You can only map data sets that have a location column. So if you go here and you're looking for the location and it doesn't pop up, that means enough information around addresses wasn't provided, so you won't be able to map it, but we try to include location as much as possible. You can also resize the different points, depending on the lat and the long, but it's not relevant in this data set. So I would actually leave that alone here. It doesn't always make sense, you have the option to do it, but in this data set it doesn't make the most sense and then you can style the data set based on the different values. So you might want to say for this one, the created date. We have a limited range, but you might want to say july is blue july. 1 is blue july. 2 is red july 3 is green, so these are all options that you can use they're more of a styling thing, they're, not core to the map functionality. But those are things that I would say you can play around with to see if you like them, but I just want to stick to the high level how you map so jumping down to point aggregation. You can choose different ranges, so you can have a point map where we're seeing each sr by a point, you can create a heat map, so it zooms out to give you sort of like the vision of what we're looking at. But when we zoom back in instead of seeing the surface request by point, we can look at them by heat. So we can the darker the density, the closer the red, the more we know took place in that particular area because we're just looking at a smaller subset, we're not seeing as much blue and red, but the heat map would allow you to just look at it from a distance and sort of look at clusters on the map and see where the service requests are taking place. And then, lastly, you can do a region map it always zooms out, which is a little bit annoying. I do admit that, but you would be able to break it down by region and you'd have different boundaries pop up. So you could choose your boundaries around boroughs and then you see like in Manhattan it becomes highlighted. You could break it down by a city council district and when we zoom in look we're just in this district right now. But if we were looking at more data sets you'd get those individual maps in those individual districts and the borders around them. So just another interesting feature that you could use, but for this one we're just going to stick with none and we're just going to let it stay for points and then scrolling down. This is just more customization that you could do so by default. We're looking at an orange point. You could make that sorry, let me scroll down, you could make it red. You could make it purple. You can change the different points in the different styles you're looking for fly out details, for instance, you could highlight what the complaint is, so we're looking at the complaint type. So now, when I click on a service request, it will let me zoom in a little bit more. It will show me it by the complaint type. So this one was for noise. This one was for noise. This one this is, there are two in that one little area they are both for noise. Just so you all know, noise is the most common service request that happens in three-on-one, so expect a lot of noise complaints, especially in july with all the fireworks that were going on and then scrolling down a little bit more. You can also add another fly out value, so we're looking at noise, but we can also just put emphasis on maybe like the agency that it was routed to so we see that this was a noise complaint, we'll zoom in a little bit more and it was routed to the department of environmental protection. So you can there's so many different customizations that you can do through these maps, so they look very intimidating at first, but once you just sort of click on everything and play around you're, not gonna break anything you'll realize the different tools that you have at your disposal, with colors with labels with heat maps with boundary maps, and these are all sorts of different things that you can do to paint the picture of what you're looking at before your visualization and then I'm already logged in. So I can at the lower right hand corner. I can save this, I'm just going to call it al's house map cv, and now I can come back at some point in the future and if you notice the url changed in the address bar. So this is my own personal map. I can share this url. I can email it to friends and they can see the same map that I put together so just sort of pretty powerful tools that you can use to help visualize and display data. So it's one thing to look at 23.3 million records and navigate through all those. It's another thing to put it on a map and paint a picture. So I guess before I move forward any questions with regards to mapping and again I'm going to point you all to the resources where you can recreate and also hear the steps to go through this again, so that detail that information will be always available to you any questions around mapping or visualizations all right. Well, this is stacy. I think there was a request in the chat to show the fireworks complaints as the visualization here. Can you add another filter just to show that maybe with like a different color or something like that sure will do so? I'm going back to the filter the date rate, I'm just going to keep the date range for now for july 1st, and I can and what I'll do for now, just to show a bigger picture on the city, I'm going to remove I'm going to remove this filter on community board 10. So now we'll get a little bit more of a city wide picture and I will add another filter, for you know I'm not going to add another filter, I'm just going to leave it. So we paint like a bigger picture of what happened in the city and then for fireworks. I know that it's going to be in the complaint type field, so I'm not going past. Oh I'm, sorry, the complaint type is already here, I'm blind so the in the firework, we're gonna type in fireworks and that's what pops up illegal fireworks. So that is the descriptor that it is under so clicking there for illegal fireworks. I'm gonna remove the complaint for noise and just sort of click off to the side and then zoom out a little bit. So this paints more of a picture of where illegal fireworks are taking place around the city, and I think here all right give me one. Second, I'm going to edit. I think here's where a heat map might actually make a little bit more sense, because we can look at the density of where those things are taking place. So in here where it says, point aggregation, I'm going to go to heat map and then zoom in so I think the heat map paints a little bit more of a picture. So it looks like the majority of the requests that came in for illegal fireworks were in Manhattan also over here. I guess in Queens over here in Brooklyn, but I guess city wide. The majority of the complaints came in Manhattan and I guess we can see by looking at it from afar over here, and I guess we can consider that midtown ish, I know upper east side. I guess you could say you can just see like those individual pockets of where legal fireworks complaints were happening. A lot throughout the city and again like so the darker. The red is the the heavier concentration of the illegal fireworks and the lighter colors is where you're not seeing as many I live in Brooklyn and I'd like to say that, like I'm, I don't know if I 100 agree with this. The reports, because Brooklyn was there were a lot of fireworks I'll just say that but yeah. So that's just that's one way to look at the illegal fireworks that took place in july. I think that might mean where you got the most complaints, not necessarily where there were the most fireworks exactly right. I guess I can, unless there were any other questions around the visualizations. I just wanted to point you all to the different resources that were available as well: okay, great so one quick shortcut to find some of the resources that I talked about. So if you remember earlier on to get to the open data portal, I mentioned, the easiest thing for you to do is go to nyc.gov data so to find these resources. The domain for the open data portal is data.cityofnewyork.us, that's harder to remember, but when you go to the nyc.gov site that I mentioned, you'll be redirected to the portal. So if you go here where theta DOT city of new york.us and after this slash you go to videos, yes, you'll find a number of different resources available for you for how to use the portal. So I went through some of the things here, but if but feel free to log on and watch these videos they range in time, but you can find more information on filtering. If you forget any of the information that I mentioned, creating a map creating a chart. Commenting like these are all features that are available on the open data site that you have access to, but going back to the home page. You can always do that by clicking on this at the upper right hand, corner left hand corner. You can always go to learn how to, and we have a number of places where we sort of walk you through the different options that you have so here, some quick filters that you can go through and again scrolling down additional resources. You can also go here the same thing that I mentioned: socrata, video, tutorials and it'll. Take you to that same page that I just mentioned. Additionally, there are like I mentioned videos from other resources, so we highlight certain things that give different perspectives on how to use the portal, how to filter how to map some interesting stories that people put together around the data. So all of that you can find in that learn, tab and how to and then I also just want to point out- I guess the rest of the things in the tabs up here. So we navigated the data tab earlier and that's where you can find the different data sets that you were looking for. You can search by category search by agency all of these quick ways to find the information you're. Looking for in the about tab, you can find some more information about the work that we've done so a lot of the data and the work around open data is legally mandated. So you can find information about the laws that are in place, and you can also see some of the reports that we put together every september 15th, we put out an open data report and we just talked about some interesting things that happened in open data. So last year we talked about our strategy for the next decade for open data the year before that we talked about data at work, so some interesting information where you can just sort of see how, when you're walking down the street, there's so much data that you're seeing so when you're. Looking at like that scaffolding that goes up, you can find information about all of that in the department of buildings for their sidewalk sheds. When you're walking down the street every street is canvassed by employees, that's called scout. It's the! I believe this, the street canvassing operation unit something along those lines, but there's someone that literally drives around every street in new york city and rates it. So you can find that information. You can find information on every fire hydrant in the city, so it just gives you perspective how every time that you're, locked you're walking around in our city. There are data points that you're, seeing that you're, probably going to find in a data set from the open data portal wrapping up a little bit. We were in the learn tab: how to how to find that different information to contact us. There are a number of common questions that we get, so you can find those over here and if you have any questions, you can always send us a note, so you can type in your name, your email, your organization, if you're affiliated with anyone and then anything that you're looking for so, if you're looking to request a data set, you found an error. If you want to request another training, I mean you have stacy's contact information. So that's always one route, but you can also do that through our help desk. We have about eight or nine people monitoring the inquiries that come in, so we will see it. We will respond to you yeah, so just all sorts of resources that are available. If anyone has any questions or comments or concerns, and then lastly, I guess the last thing I just wanted to point out and I can open it up for more questions- is I held on to this for last, but this is our project gallery, and this is just a few examples of different ways that people took the data that they found on the open data portal and they made use of it. So you can you're welcome to sort of navigate. All of these some folks took some data around stop and frisk that practice that's no longer in place, but and mapped it on the portal information about. You know communities in williamsburg about zoning maps, about renting apartments in new york city people have taken all sorts of information from the portal and created really interesting projects around them, and I think that they're just worth looking at, if you're, looking for any inspiration for how you can really maximize the use of open data, just some really interesting things that you all can look at. I know that was a lot of information to digest in one shot again any questions that I can, while I'm here, I can answer in terms of using the portal just anything generally about open data in new york city. What members have any questions? I have a few questions sure one of the questions, so the first question is in terms of social distance violations. Are you able to? Are we able to see that by just clicking when you, when you click actually on the complaints, you see how it popped up? Are we able to see that information it popped up? Which agency is there a way for us to know that how many social distance violations were made yeah? I believe that would be in the 311 data set and I believe, similar to the other ones in the complaint type. I'm gonna go to the complaint type I'm gonna go to contains, and I believe social distancing is a complaint that you can look up and you know what I'm actually gonna. Do. I'm breaking my own rule that I said to everyone. Social distancing wasn't the thing until probably about march, so I'm going to put the filter as of march of this year, which always after march of this year and then I'm going to go to the complaint type, that information is always going to be in either the complaint type or the descriptor, I'm not sure which one it is for this one. But we're going to take a look so we're going to go through social distance. So it's not in the complaint type. So it's more than likely in the descriptor there we go yeah. So the complaint type is, I guess in this case it was in these were in parks that came up so yeah they're here. So, where you look is in the descriptor and there's a descriptor for social distancing so well, we have a little bit of error at the bottom of the screen. Sorry about that, I'm going to redo that filter. So, yes, it is there. The descriptor would be social distancing. So I'm just going to recreate that one quick time create a date just to make it simpler. It's after I'm just going to pick march of this year and for the descriptor, I'm going to say descriptor, I'm going to say, contains I'm going to type in social, distancing, yep, so 60 0.43, distancing complaints since march 1st. The other thing is: would we be able to apply the so basically, we are applying the same method when we get on this site. To look for things like you know how many stabilized apartments do we have in the district? How many senior citizen apartments do we have? How many market rate apartments, how many condos? How many co-ops do we have? Is there some data sets that give us that information, so how many businesses you know own or are renting their spaces in the district? How do we is that something we request or that's already available, and we just need to go through this process to find that information yeah at first at first hearing those questions, I don't think all of that information exists as a city data set. You could. We could probably find some information and if you could, if you could send me those, I could probably do some digging and point to you where you can find some of that information. We wouldn't have all of that information for the city at large, but we would probably have it if you were to do a search on NYCHA or if we were to do a search on and again we can also search agencies over here for the department of housing, preservation and development. I'm sorry, I still have ninja in the search in there. So those are the agencies that I know deal with housing and rentals, and things like that. So I'm pretty sure that there's no information about like all of the the rentals for senior citizens versus for lease space and things like that. But I could do some research. So if you have like those particular questions, if you could, I guess maybe forward them to stacy I could I could do some research for you on those to be honest with you, I don't think a lot of that information exists in full, but we could probably find parts of it from data from the housing authority, the housing development right so and so that's in terms of housing. I will send you those in terms of finance. It's have. They figured out a way to get credit scores right, so they don't. If they're gonna be able to see who has who had Covid-19, who has covet, I'm still trying to figure out why we can't get data on credit reports so that we can get some sort of average number as to what credit report exists where in our district? Is that a possibility? Sorry about the background, yeah no worries I to my knowledge, I'm not sure if that information is captured city-wide by any city agency. My guess would be that there'd be a lot of privacy implications around releasing that data. I can look into it. My first guess, though, is I I've, never seen any data like that. I've been working with open data for about 11 years. I haven't seen that information, but it doesn't mean that it doesn't exist. So what I would say is if you have that request, I'll, take a look and then we can sort of formally submit it as a request for an agency. My first guest is, though, that it probably doesn't that's just me being completely honest and transparent, I'm willing to work with whomever to figure out how we can possibly get a hold of that information, and I'm not talking about knowing someone an individual's credit score, but to have an average. You understand. So it's not that you know just like we have an ami right. We have a annual medium average medium income. It doesn't show what people incomes are, but it gives an average. So if we can somehow get a hold of what that credit score, is in this district and just in certain pockets in this district, that would be great. I'm willing to work my last question in terms of civic engagement, so we do have our parties right, democrats and republicans, and they do have county committees. They do have a website that lists their district leaders at least the county committee members. Is there a way that there is open data reaching out to them in terms of us being able to see what district leaders cover, which and being able to do what you just did in terms of how you said you can break it up by city council. You can break it up by senate. Would we be able to do the same for district leaders and county committee members, four parties yeah, so our team at doit, and also from the mayor's office of data analytics. Those are the two groups that jointly oversee open data we aren't actively reaching out to any of those groups. So just for additional context. Open data is while we do go above and beyond. In many cases, it's a legally mandated thing. So the only folks that we, I guess, have the authority to go to agencies and say hey. We need to stay. There. Are those that fall under the under that law and then more than likely under the I guess, domain of the mayor so who I believe would be under there is maybe the board of elections as sort of a quasi-agency that would fall under the scope of that law. Those other groups, I don't believe they fall under the jurisdiction of the mayor, so we wouldn't have that information, but I mean like I think there could be room for collaboration there, but I think we have to have further discussions within. Do it with other agencies and how to go about that. But to answer your question: no, we have not actively reached out to any of those groups. We've primarily focused on the agencies that fall under the mayor's jurisdiction. Okay, perfect, so I will send my questions. Does anyone else have any questions in that case, I want to thank you, mr weber, that was a very good presentation and thank you stacy for coming and spending time with us this evening. Welcome and I'm going to hit the stop sharing button and yeah. Thank you for having us. Everyone have a good night. Any questions feel free to. I guess I guess it could go through stacy or through that contact us page that I pointed out at the top of the open data portal. Yeah you guys are free to channel. I know you have my email, my phone number, so if you want to send those questions over my way and we can try to get you as much information as possible, another thing to keep in mind too is that every single agency has what we call an open data coordinator who al and his team work with for them to provide their data to us. So we can make sure it's on the open data portal, so we're collaborating with all the agencies all the time on stuff like this. So a lot of those questions we work with agencies on you know what they do have, but they don't have what's doable from their end, which we're happy to do. Actually, I believe, michelle booker, put in the chat that she has a question. Are you able to unmute yourself, I'm still here, yeah sure, michelle? Okay, I don't know she said she has in a chat that she had a question: did she post it up top hold on? Let me see if it's a question that she asked. I don't see a question yeah the question in the chat hold on. Can you get data from non-profit hospitals? We can put so the hospitals that I know fall again. This goes back to the question of who falls under the open data law. So I believe the health and hospitals corporation falls under the jurisdiction of the mayor, so we could probably get information for anything. That's in the health and hospitals corporation or it would potentially be subject to being released, but for nonprofits my guess is no. Is there a way you can send over a list of the what's under open data law? I could send the list, but also it's on the open data site. So if I can, I share my screen again bring my screen back up, so this it's back in this section on where we have the. Can you all see my screen again? Maybe not so sorry about that. So it is when you're back on the open data home page and you click on that data tab and then you just scroll down these are all of the agencies. Okay, got it and wait. Michelle mentioned code idea now, if you want to show them the the data collection that the health department put out yep. So that goes. Excuse me back to the data collection and so there's a number of ways to get to it. But let me let me see if it comes up, it should just come up with the search, so I'm just going to type in Covid-19, so everything covet related would pop up over here, but also on the left hand, side. I'd mentioned that data collection earlier and you can navigate to the covate19 health data and yeah. Here's all the different information that you can find on Covid-19 some cases, hospitalizations deaths, things broken down by tabulation area, folks that were diagnosed with flu-like symptoms. So I'll click on this. I haven't clicked on these in a little bit and I'm also going to show you where else you can find this information too. You can find this information here so every day this information is updated, so the number of people tested the number of confirmed cases hospitalizations and things like that, and it can also be found on. Oh you say I was looking at this before on gip github. If you just probably did a google search with github and coronavirus data, and this would be more so for developers you can find the same information. It's so remember when we're dealing with open data. What we do is we put the information out in what we call a raw format, so people can have access to the data and then do with it as they please. But you could go and you can click on here and you can find, for instance, like the kovit data by boro, and these are all the same numbers that you'll hear in all of the daily briefings and press conferences, and things like that, so you can find them on the open data portal by searching Covid-19 and then for the more tech savvy group. You could go to github and you should be able to type in github and this these same terms you're seeing up here. Nyc health coronavirus data, and you should- and you can get access to all of that, all of that same github, that cova data and that data is all updated daily. So you can see like this stuff right here was updated seven hours ago. Is there any way, mr weaver, you can provide a summary. Is there a summary or something? Is that what you showed us on the website, those little trainings or do they summarize? Or will you be providing a summary of tonight? So I can probably I have so. I guess I purposely did this live to sort of walk through all of those points, but I can put something together. That summarizes all of those links where you can find things and then, like a high level, it would probably be in like a powerpoint format, the stuff that I went through and then maybe like a page with like an appendix that just gives you the links like the important links that I mentioned. I can do that. Okay, perfect because someone asked for a summary: okay are there any other questions for mr weber? Well, thank you, mr wieber, and thank you stacey again for coming to provide us with this presentation. Welcome everyone have a good night. No problem see you guys. Okay, so moving into the agenda, are any community comments or concerns at this moment? That's on anything that's happening in the district in terms of economic development or technology. Okay, moving on to old business, new business, so first we have the watch and discuss set sessions. The ratio wealth gap went well, I'm still working on a resolution. For that we I may do a part two for that we were not. We was not able to record that meeting because it was done on google and we found that we couldn't record so now. Those watch and discuss will be happening on zoom calls. The 5g was canceled. There was, I think, less than five people that joined the call for that. But verizon did get on the call to have that discussion. So we said that we would reschedule right now there is a watch and discuss that is scheduled for july 26 on mark one two, five and that will take place from eight o'clock to around 9 30 p.m. That will too have a resolution. Let me just try to see if I can bring something up while I'm talking about resolutions hold on shati. Can you allow me to show my screen? Thank you. Okay, hold on okay, so in terms of resolution, so this is an example of the resolution that you can find if you get a hold of the google site that I created for the committee that has the that holds the flyers in the newsletter. So this is the resolution form. This is for any problem. Also. So as we do these discussions, it would be nice if folks would fill one of these out, as you can see, ask for your basic information, then ask for the supporters who else you know is supporting this: that's any organizations, or you know, businesses or businesses or organizations, and after that is the resolution on so, for example, we have one mart one. Two five coming up, so in writing a resolution for that you would list your information, your place. You know supporters. If you have any supporters and then you would say resolution this is a resolution on mark one, two, five right, whereas you know you say whatever you want to say, we. I feel that vendors should be in one two, five right. I feel that you know this should be open to the community, whereas you know that's just examples and then once you put the, whereas every line that you have a, whereas should be a recommend, a recommendation, so at the end you would be it resolved and, for example, you said you would say that mark 125 is turned into a community center right and then you would say in the record, in the recommendations, how that can be possible right recommend that y25 incorporates you know vendors into new plans for construction. You understand you would have to write a record, a recommendation for the issue that you've identified and that's pretty much how you fill this out. The reason why we need it in these terms, because, even if we was to present to an elected official, almost everything comes in this basic format and then they create legislation if they want to do so from there, but it will be in a format that gives them the issues and then gives them the recommendations for a resolution. So I just wanted to just share that with you guys, so that people would have taken a look at that. How do I? Okay? Stop? Sharing okay, so there will be a resolution that will be written on mark one two: five, as we all know it's a little controversial. There is a video that, if you touch on the flyer screen it'll take you straight to the video that was created. I believe this american dream or something like that, it's about an hour and some change. I would suggest that folks view much of the video prior to coming, because I'm not going to show the whole video I'll, probably only show about you know 15 to 18 minutes of it, and then we will go in discussion about mark 125. What has happened? What and what is happening with mark one, two, five also committee member josh, when I viewed the economic committee forms that have been filled out by committee members josh mentioned that he was interested in doing an entrepreneur pitch when speaking with him, we talked about maybe having some sort of what's it having to do with covey like what entrepreneur, what occupations or what careers have come out of the covet. It's something that he said he would like to focus on. So anyone who would like to work with josh on that. Please email him on that initiative. I do know that miss harford mentioned that she would like to see something done around mwb and excuse me: women, minorities, businesses, so I just wanted to know if she's still willing to do that. Is she on the call okay? So I guess I will try to contact her offline and send her an email to see what exactly is her vision around what she wants to see around that and I'll shoot. You guys the email, letting you know if she does decide that she wants to do something. So you guys can partner up. There's also number five artificial intelligence and it's economic impact on harlem I'll, probably do that in august sometime, but I don't have a date as of yet because I'm not sure what will be happening around that time before that one. We have economics of legalization of marijuana scheduled for august 9th I'm trying to get regina from harlem business alliance to be on that call for questions, so anyone that would like to participate in that or help with that that'll be great. Just shoot me an email. Does anyone have any suggestions for watching discuss our sessions? Okay with that being said, this meeting is adjourned at 805. Oh I'm hold on I'm sorry before I adjourn, let me just see the messages that I'm being texts. Okay, so I'm sorry about that. So I am adjourning the meeting at 805 and if you guys look on the back, there's some information that I also put in the chat. Please check the newsletter out. We will be adding as committee members. Let me know what they want to see in the newsletter. I will be adding those things to the newsletter. Also, there was a google site that was created that has all the material in one space I'm. So that's all the links that you need and then there's just a general public announcement. If you do have any community concerns that you would like to discuss. Please submit it that monday before this meeting, so that it would be able to go on the agenda. We are trying to provide agendas earlier, but in order to do that, then we would need confirmations earlier. Sometimes we reach out to people and we don't get confirmation until two days before the day before. So that's I've realized that that's a part of why agendas come out so late, so we are working to get agendas in a little faster. So thank you guys for attending this meeting have a great night. Thank you guys have a good night. Take you there, hello, yeah there. You are yeah my bad, so I just wanted to tell you if you have the cc option at the bottom hold on.",
        "summary": "One is from the frederick douglass boulevard alliance about open streets, So I'm, gonna, move along in the agenda for a new applicant sla applicant for neighborhood brulee coffee shop You know we ask for you to submit a form to submit the sla application to us while trying to not be a burden on small businesses in our district at this time, but actually trying to figure out ways to move this process along We have submitted a an opinion form for committee members to vote whether they would like to see a business come before us and the vote Everyone in committee, community board 10 frederick douglas boulevard at 140th street just opened primarily for business.\nThank you, madam chair, for that update for frederick douglass boulevard alliance about open street 112 to 120th I have requested for open data to do a training for the community in terms of data and what data is available to help us try to understand, what's happening in our communities and to be able to use that data when creating resolutions for problems, so they are going to give us one of their short trainings.\nThis is open data for all new yorkers The director of open data at doit, So I, won't go into that much detail, but I think one of the best ways to sort of give people information is to walk through these things live My plan is to just go through the open data portal and touch on a few key topics: That's searching the open data website, creating maps creating visualizations and then just letting you know some of the intricate details that can be sort of tricky when navigating the website things like the different domains, you can see and then pointing out different resources that are available to you.\nThere are some things in restaurant inspection results that may be a little squeamish for some of us, but I think it's good information to know to make informed decisions There are a number of things that you can see, and it may not be that intuitive, but to start so scrolling down here on the screen So, if you're new to open data, you can click on this link right here and just get a quick overview of what data is.\nThat stuff will make a lot more sense, so for right now, what we're going to do and there's a number of ways to move forward to get to the data you're looking for you can go into this tab you can go to this tab up here with regards to data now the reason that I'm going to go here to this data tab is because there's more information that I want to show you we have this filtered here for new data sets, so you can see some of the data that's been published most recently Currently.\nSo you can search for the data set that you're looking for by category So, if you, if you know that you want a map, maybe you're, looking for a specific community board district or a council district or if you're, looking for some sort of a filter, whatever you're looking for you can find it here, more than likely you're going to be looking for a data set or you're going to be looking for a map, We have what we call data collections, So a lot of times.\nSo here you know, I guess the big world issue right now is the coronavirus and cobit 19 that's going on, so you could click there and you could find any city data that you're looking for around covid19 information around the department of buildings and electrical permits, things around motor vehicle collisions Also.\nSo, that's going to take you some time, but I'm going to show you exactly how to filter that, how to make the data set a lot smaller and make it a lot easier to navigate we're going to click on view data, and this brings us to the actual data set This data, when you're, navigating it most of what you're gonna be looking for, is in this upper right hand corner on this utility bar over here and by default When you click on this, you actually get the drop down of all of the different columns in the data One of the things that I always like to do is make the data set a smaller, subset We are going to take this second column here, which is create a date gonna hover over it and click it, and now we're gonna go into our search clause so to make it a little bit smaller to deal with I'm going to say.\nFor instance, let's bring up community board If we scroll further down within the data set, we can bring up the compute community board and I'm just going to type in 10 Manhattan and again so we went from 23.3 million records down to about Now we have all of the service requests in place from july 1st, on in community board 10 in Manhattan, and then just for the sake of this training I'm just going to do one more filter So the complaint type is where you see like the different things that people are calling in for noise fireworks different things, The search clause is because I knew that I could find 10 Manhattan.\nBut sometimes, if you don't know the exact wording of something or if it's sort of like this noise space, hyphen space vehicle you're not going to find it So again, we went from 23 million records to 73 to about 1600 and now we're down to 501 service requests This is just some quick basic filtering on how you can navigate a data set, choose the appropriate search that you're looking for to find the things that you're looking for.\nSo taking us back to the earlier home page to create an account in the upper right hand, corner You can save the map that you have in place and always be able to come back to it, and then I mentioned earlier for the developers and data scientists and people who like to do a little bit more advanced usages of data.\nIt's very simple, probably take about a minute of your time, and that way you can create an account for the open data portal I'm just hitting forward again going back to the data sets I'm back to the data sets that we are looking at So again, we were in the data tab and then we clicked on the most popular data sets, give my wi-fi, and then we were looking at the 311 data set So right here, the first drop down that you'll see is for creating a visualization So. It brings you to this screen that can be a little bit intimidating at first, but it's really not that bad So you have within the three on one data set.\nSo, to start along the top of the page over here, you have your different options for the visualization You want to create bar charts, column, charts, pie, charts So this allows us to map the data that we're looking at and then we're going to work, we're going to apply a filter similar to how we did in the data set to get to where we're going So for those of you who may have used the open data portal in the past, you'll notice that this visualization tool is a little bit different than before So you could just map all the data that we mentioned before, but again you're looking at 23.3 million records, so we're just going to recreate some of the similar filters that we did earlier.\nI can email it to friends and they can see the same map that I put together so just sort of pretty powerful tools that you can use to help visualize and display data I'm going to remove this filter on community board 10 It looks like the majority of the requests that came in for illegal fireworks were in Manhattan also over here, I guess in Queens over here in Brooklyn, but I guess, city wide The majority of the complaints came in Manhattan and I.\nBut going back to the home page Additionally there are like I mentioned videos from other resources, so we highlight certain things that give different perspectives on how to use the portal, how to filter how to map some interesting stories that people put together around the data We navigated the data tab earlier and that's where you can find the different data sets that you were looking for Looking for in the about tab.\nWrapping up a little bit We were in the learn tab: how to how to find that different information to contact us So you can find those over here and if you have any questions, you can always send us a note, so you can type in your name, your email, your organization, if you're affiliated with anyone and then anything that you're looking for so, if you're looking to request a data set, you found an error If, you want to request another training, I mean you have stacy's contact information , We have about eight or nine people monitoring the inquiries that come in."
    }
}