{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCjXB7nX8bL2U2sje8d212Yw",
            "title": "Community Board 10 Traffic and Transportation Committee Nov. 19, 2020",
            "publishDate": "2020-11-20",
            "shortDescription": "",
            "lengthSeconds": "0:56:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "7Q2L2bOq6OU",
            "fillerWordCount": {
                "uh": 78,
                "um": 123
            },
            "readTimeFullTranscript": "34 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "street": 56,
                "safety": 31,
                "proposal": 27,
                "traffic": 24,
                "streets": 24,
                "vehicles": 24,
                "avenue": 21,
                "corridors": 17,
                "pedestrians": 17,
                "sidewalk": 15
            },
            "wordCountSummary": {
                "street": 24,
                "safety": 12,
                "traffic": 7,
                "proposal": 6,
                "streets": 6,
                "vehicles": 6,
                "improvements": 5,
                "avenue": 5,
                "northbound": 5,
                "corridors": 4
            },
            "fullTranscript": "Okay, Jane, we are now live streaming, so, okay, thank you Josephine, and welcome to our traffic and transportation. Committee meeting I'm James Marie Kapitznakis, the chair of the traffic and transportation committee and I have some of our committee members that are here with us this evening. If I could ask the committee members to please introduce themselves, I'm Doris Cruz a long time. Member of Tnt hi, I'm Stephanie Mahany. I've been on community board 10 for about three and a half years and on the phone Joe I. Have you on mute, I'm going to unmute you Joe. Can you unmute yourself, I'm Joe Tsukowski, I'm on the committee I guess around seven years and we're very grateful for that as well, and we hope to be joined by a few other committee members that are running late, but we're happy to get started. We have one item on tonight's agenda and that is that the New York City Department of transportation will be in attendance to present its safety improvement proposal for 7th and 8th avenues in sunset, Park from 69th street to 65th street. This proposal area impacts three community districts, so our community board 10 plus 47-12. that goes from 39th to 65th right, correct, okay, thank you. So if I could ask the Department of Transportation Committee members to introduce themselves and we can get started with the presentation- okay, I'm Leroy branch, I work for the Brooklyn borough commissioner's office, and I'm your community coordinator hi. My name is Chris Brunson, I'm the director of safety projects and programs at New, York, City, Department of transportation just before Ben gets into the presentation. I just want to give a little background to what we're going to be talking about hold up. Chris yeah could Emily. You want to introduce yourself, I'm sorry Emily's on the call yeah hi, I'm going to be telling it I work for the brook. Did everybody understand what she was saying? No, let's also works for the Brooklyn borough commissioner's office and she's, the coordinator for CB7. Thank you and I'm Ben Schwaden, I'm the project manager with DOT with the research, implementation and safety. Okay, I guess! That's everybody yeah! So before Ben starts giving the presentation I could ask you all to mute. Your Mike's just so we don't background noise, but I just wanted to give a quick introduction. I'm the director of safety projects and programs at DOT and we're here today to discuss our preliminary findings and proposal for the safety improvements on 7Th Ave and 8Th Ave from 39th street to 65th, as was mentioned before, as you may or may not know, 8Th avenue in our 2019 vision, zero update was identified in Sunset Park as a vision, zero priority corridor. That means that it has a higher than normal rate of pedestrian, killed or severely injured crashes, and seventh Avenue is a very has a very similar crash history. When streets like this, these 44 foot wide streets, two-way in you know two-way, with parking on both sides surface on our vision, zero map, it's a real challenge for us, because what we have available in our safety toolbox is very limited. We can do lpis. We can do a parking lane strike. We could ask for speed cameras, but you know that's. We know there are very strict restrictions on those we can do very narrow and more often than not, ineffectual painted curb extensions. So leaving the streets as they are, we find you know it's not satisfying to us. So one-way. Conversions, however, can give us a lot more possibilities for safety improvements and, as you know, these corridors have been studied in the past in 2004, 2006 and 2016 all time. Every time DOT our agency rejected the proposal, but we this time we took a fresh look from a safety perspective and the opportunities that it could provide us if we did convert the the streets to one a one-way pair, and we believe that this is a good path forward for safety improvements, but not just safety improvements. Other mobility improvements in the neighborhood, so Ben Schwade will now take you through our current research on the project and highlight our rough proposal, and then we can answer any questions you may have. Thank you hi everyone, I'm going to try to share my screen. It looks like it's working, so I can walk you through this proposal that we have. Okay, sorry, there we go. Okay. Can everyone see this presentation great? So thanks for having us tonight, like Chris mentioned, my name is Ben Schwade, I'm the project manager for 7th and 8th avenue between 39th and 66th street, and, like Chris mentioned, I'm just going to I'm going to walk you all through through our proposal, our rough proposal for the corridors. So what we're talking about today is both 7th and 8th avenue, the parallel corridors and really we're looking at the stretch between 66th street and 39th street. On both of these. This is the really especially 8th. Avenue is the commercial heart of sunset parks. Chinatown, it's a busy corridor. The B-70 bus runs on eighth avenue in both directions and there's an existing two-way shared bike lane on seventh Avenue, as Chris mentioned in our most recent vision, zero update, eighth Avenue is listed as a vision, zero priority corridor due to the high rate of pedestrians that were severely injured along it. Seventh avenue, although not a priority corridor, especially in this portion, has a very comparable crash in injury data. These corridors are also located within the borough, Park senior, Pedestrian focus area and a vision, zero priority area due to the high rate of seniors pedestrians being injured in this area and pedestrians in general, in the kind of greater Sunset Park Community Eighth Avenue, is partially within, is within a bike priority district community Board 12 is considered a bike priority district and, as you know, it's overlaps three community boards Community board, seven, ten and twelve, so I'm going to kind of walk through the whole project, but then we'll focus in on the southern portion, where it is within community board 10. So, as Chris said, we started we kind of wanted to look anew at these corridors from really from a safety perspective once we once it was kind of listed as a priority corridor and I think what we ended up finding was that there were a lot of both mobility and safety concerns on these stretches. So it's really and especially 8Th Avenue is really the commercial heart of Sunset Park's Chinatown, and what we see in terms of vehicles is. That means that there's a lot of loading a lot of trucks, a lot of lane, blockages congestion, double parking. It results in a really kind of ineffective travel, really low bus speeds on the b70 and just hard to get through for all vehicles in terms of pedestrians. It's we also see extremely high pedestrian volumes here, overcrowded sidewalks pedestrians spilling out into the roadway just with all of the businesses and residences around. Here, it's filled with pedestrians. It's also a really busy cyclist corridor, both in terms of commercial and recreational cyclists. There are a lot of commercial cyclists working for all of the businesses and then lots of recreational cyclists connecting going back and forth between Bay Ridge and the waterfront, as well as going to connecting to points further north in Brooklyn like prospect park or going towards downtown Brooklyn a safety perspective. We wanted to look at how the crashes were happening and when we look at this, we really see that it's all of it is kind of a result of these congested unpredictable streets. When we look at crash issues and injuries that are happening to people in vehicles, we see that compared to Brooklyn on average sideswipes and head-on. Collisions were really disproportionately common on these corridors and it kind of makes sense right. You think of all the like double parked trucks and and I mean this photo on the bottom. Both of these photos kind of illustrate where cars are crossing over the double yellow lines, to continue going straight on these streets. That's the type of thing that leads to side swipes when you're trying to squeeze in or head on collisions when you're going over the double yellow. Well, we look at how pedestrians are getting injured on these streets again, it's kind of due to this unpredictability and the breakdown in street function with all of the kind of crossing over the double yellow line and the high number of pedestrians you kind of get these situations at a lot of the intersections where things aren't working like they're supposed to be cars are coming from the wrong direction. Pedestrians are crossing wherever they can and it leads to a lot of where, when there are turns when they're the there are all these points of conflicts and that's where we're seeing the pedestrian injuries come and they're a result of this unpredictability, and we look at how cyclists are getting injured on this corridors. Also, it's really due to the lack of a dedicated space. We see a lot of failure to fail to yield right turns to cyclists, which is often because they're trying to kind of squeeze in between moving vehicles and parked cars, as well as a lot of mid-block crashes again partially, due to them having to go around all the stopped vehicles and the breakdown and how the streets function. So Chris discussed this a little bit and when we're kind of looking at what we can do on these corridors, we find that we're really limited based off the current street geometry. Both streets are 44 feet, wide, they're two-way streets and they have parking on both sides of them, and so we really have limited corridor safety improvement possibilities for this. These vision, zero priority corridor and kind of to Chris's point in the introduction. The treatments that we do have here really are kind. Are they either minor things like llpis or kind of very small curve extensions, or they involve narrowing the moving lanes to address speeding which, as we see, is not the cause of the injuries on 7th and 8th avenue? In addition to the kind of geometry constraints here, there are also a lot of challenges with these corridors because of how busy they are and all of the curbside uses so just kind of running through these really quickly. There's a ton of loading going on at all times, especially in the 50s on 8Th Avenue. There are buses the b70 bus as well as charter buses, and the b70 is so ineffective that when we talked initially to the MTA about the idea of one-way pairs on this street, they were, they were actually quite supportive of that proposal. Their commuter vans, picking up and dropping out up, excuse me picking up and dropping off people. There are businesses that are expanding onto the sidewalk to sell their goods, their vendors on the at the curb they're, as I mentioned, extremely heavy pedestrian volumes. We counted over 5,000 pedestrians in one hour and just one intersection back in the fall and that's a number of years. More typical of you know: Midtown Manhattan than Brooklyn heavy cyclist volumes, 600 to 800 cyclists per day, and we've only seen cycling increase during the Covid-19 pandemic and there's also lots of desire air for parking, they're, dense corridors with lots of residential and commercial businesses, but always just kind of putting in perspective that about two-thirds of the households in these census tracts. Don't actually own cars according to the most recent census data. So, with kind of all of that said, we'll talk a little bit about the rough proposal that we have here and that we're trying working to flush out so as Chris mentioned and as I've alluded to the proposal is to make 7th and 8th avenue these one-way paired streets between 39th street and 65th street 7Th Avenue would be southbound between running from 39th to 65th street and 8th Avenue would be northbound. We're also looking to reduce congestion and improve safety at and around 65th street and 7Th Avenue, and we're going to look to further address the crash history on these corridors by implementing additional traffic calming elements, roadway organization, curbside controls and mobility, improvements that we're able to do because of the one-way conversions. So when we think about, let's talk about one-way conversions for these corridors, the reason that we're excited about them is because it's really a substantial safety improvement that directly addresses the crash history of 7th and 8th avenues by eliminating the two-way traffic on these streets. We'll be improving vehicle predictability, reducing the possible movements at intersections and reducing conflicts between vehicles and other vehicles, and pedestrians, and vehicles and cyclists when with one-way streets. If someone is double parked to go around them, you don't have to go into oncoming traffic to get by a stopped truck or a stopped car if you're a pedestrian crossing at an intersection. You know there's only one way that you have to look for oncoming traffic and really that predictability, and that reduction of conflict is really what we're looking for as the main kind of thing driving the safety improvements on these corridors. One-Way conversions also allow for the reallocation of roadway space that can provide safety and mobility benefits for additional users. So when we do these one-way conversions, we kind of get to look at the streets are new and think about how we can use all of this space to most of to most effectively get people safely and quick efficiently through the the neighborhood. So it allows for the addition of a safe, dedicated space for cyclists to connect to the 7Th Avenue South protected bike lane that was installed by DOT. Last year, it allows us to have expanded pedestrian space and safety improvements to give pedestrians more space on these congested corridors. It allows us to look at new load and right new loading regulations to address double parking and loading on the corridors, and again it's we're looking to with the elimination of two-way traffic. We also really are looking to improve bus operations on the corridors as by speeding up the buses and making them more reliable, in addition to just making travel on these corridors more reliable for everyone. So obviously, if one we're kind of looking to convert this long of a stretch of streets to one-way pairs, it's going to have effects on real on 65th street, which has always been a challenge and 65th between 7th and 8th avenue, as well as all the surrounding streets. 65Th and 7th avenue in particular, is a very congested intersection due to you know, there's the BQE exit nearby, there's congestion on 65th street. There's kind of this transition point between neighborhoods, it's a collect. It's a connector street. It's a truck route. It's there's a lot going on there and so we're looking in our proposal to minimize the impacts on the street network while making improvements to vehicle processing, and so one of the things that we like to point out is also with one-way conversions. It allows us to put in a signal progression on 7th and 8th Avenue, which can improve the vehicle processing so that we can time the lights so that, as you drive, you continue to get hit green lights on the streets and now I just kind of want to go through the Ben, especially focusing on this kind of congested area at the southern end of the corridor around 65th street and kind of talk about why this conversion helps it. So the proposed design with these one-way pairs is going to reduce the total northbound volumes at 65th street and 7Th avenue, because vehicles are no longer going to be able to go north at 7Th Avenue. We anticipate that vehicles are going to reroute over to 8Th avenue before they get to 65th street, so whether that's going over on 71St Bay, Ridge, Ave, 67Th, Street, or just going diverting right to 8Th Avenue, they're, multiple, convenient options for vehicles to divert and away from that intersection, reducing the total number of northbound vehicles. In addition, by having these one-way conversions, you're, removing Thr possible movements at the intersection, the northbound through the eastbound left and the westbound rights, and by doing that you're, reducing the total vehicle movements and reducing conflicts and therefore, every time you reduce conflicts at an intersection, you're going to be improving safety. So you have three fewer movements in the future and it's also minimizing the impact. We've got collected data for the intersection and found that two-thirds of the northbound vehicles currently are already turning at 65th street and 7Th Avenue. So for most of the vehicles using the intersection, it's not going to change how they're already approaching it. In addition, it also simplifies the northbound approach that we know is a challenge with only two possible northbound movements and two northbound lanes. It reduces conflicts and improved predictability for vehicles. You'll know that a vehicle in the right lane is turning right and a vehicle on the left lane is turning left. It also eliminates this conflict with northbound cyclists, because 7Th Avenue will be southbound. Northbound cyclists are no longer going to continue straight onto 7th Avenue and so you'll remove that conflict of northbound right turning vehicles crossing turning across the bike lane with these heavy volumes here. In addition, there are also some challenges with doing it in the other direction that we found in our investigation. It actually leads to additional congestion and safety concerns around 65th street and 7Th avenue. If we were to convert 7th avenue to be northbound. That would then require that all northbound vehicles would go through that intersection of 65th street and 7Th Avenue. So we would be actually increasing the vehicle volumes and conflicts at six at seventh, Avenue and 65th street, because we would be rerouting both northbound nor all northbound vehicles to that intersection, driving up the volumes and driving up the turn volumes considerably, especially as you can kind of see in this map, the purple arrows show the northbound detour that would have to occur, increasing that west bound to northbound right turn and the red arrow shows the kind of southbound increase. That would happen, bringing all the southbound vehicles here and then increasing this westbound to southbound left turn, and that especially kind of that would provide a real challenge as well. That westbound to southbound left turn would cause additional conflicts and that's the most dangerous vehicular movement at the intersection. Currently most the most common cause of vehicle crashes is are, is because of vehicles making that left turn. So we really didn't want to increase that volume. It also would require giving additional signal timing to that movement, which would then mean we'd have to take away signal timing from the northbound approach and that would further congest the northbound approach. So that's just kind of walking through why, when this is was talked about previously in the past, 7Th Avenue was always thought of, as southbound was always thought of as northbound excuse me, and so that's just why we actually now feel that the southbound approach for 7Th Avenue is a better one. So with that just kind of summing up this proposal, so we're really excited about the what this will do for safety and mobility on 7th and 8th avenue. It really directly addresses the crash history of a vision, zero priority corridor through the street conversion and design. By putting in these one-way conversions, it really allows us to kind of think of the streets from scratch and provide additional traffic calming elements that can benefit other street users who, in addition to the benefits to motorists and pedestrians that come from a one-way conversion. Here it reduces congestion and improves safety at 65th street and 7Th Avenue. We're going to it's going to improve the reliability of the b70 bus and really improve network mobility throughout Sunset Park. So that's where we're at with this presentation, I'm going to stop sharing my screen now and I'm happy to answer any questions that you all have about this proposal and kind of where we're at with that. Thank you, okay. Thank you, Ben all right, so do any of our committee members have any questions or comments that they'd like to share I have some questions. If I can I happen to drive out today and it's you know, I enjoyed your presentation. I have visual issues, sometimes because I can't even imagine redirecting traffic on 7Th Avenue heading northbound, because currently there's such a heavy volume, you know so for the board. Members on the call community, Board 10 is 7th avenue from about I, would say 66th street in this, and we go about to the railroad cut right of way. 62Nd Street, now a few things I observed on both 8th and 7th Avenue I know the bulk of which is in sunset park when you mention sidewalk congestion. A lot of that sidewalk congestion really forces pedestrians into the street. So I wonder if you thought about the sidewalk conditions, because it seems to me that, especially on 8th avenue, which is heavily more, you know commercial in nature, that the I mean I, don't know if it's stoop line permits, it seems like a lot of bad behavior that extends beyond the normal stoop line and creates such congestion on the sidewalk that almost forces pedestrians into the street. So I'm curious. If you looked at those some of those issues, you know, maybe loading zones would help. I didn't really see that as part of this I just feel like some of the underlying problems are not being addressed in this one-way conversion and may exist. If you do convert it, especially as it relates to pedestrian safety, because there's not adequate sidewalk space and I, don't know if you even looked at I know it's a big capital project and it's money. I look at Leroy when I say that, because most things come down to money here, but the sidewalk, you know, width of the sidewalk, the you know, extension and I know now where you know when covered and there's extensions of permits. But it seems as if you know the stoop line, there's just not enough adequate sidewalk space for the volume of pedestrians that you have and also the roadway condition, is horrible and I wonder. If you looked at that because thinking about even putting dedicated bicycle lanes, I mean it really was in bad condition, I mean it feels to me. There's several areas of undermining I, don't know if it's because of heavy traffic, but overall the roadway condition itself seems seem poor to me in certain areas, especially in the 50s. You know getting closer to our district and the overpasses as well, which I put in some complaints today, because there was some defects, so I just want to know if you could speak to that Ben yeah sure so, specifically with the idea of the pedestrians. So we have- and we continue to look into that so one of the things that where this proposal is at right now, is we're. We we're excited by the idea of the one-way conversions for these streets and what I was trying to allude to in the part of the presentation is. It gives us the opportunity to look at the streets kind of brand new and be like what's happening. How can we make it better and so we're still determining exactly what that looks like, but absolutely all the things that you talked about with the sidewalks being way too narrow that we're looking at? Can we expand the sidewalks? Where can we make them wider to accommodate more people? You know the loading is a massive issue, so yeah we're looking at. Where can we put in loading zones to allow the trucks to use to access the curbside we're looking at? Where can where could we put in dedicated bike lanes to accommodate cyclists? With this? It's kind of it's all this, these things we're still kind of figuring out the details at, but these, but yes, absolutely we're. Looking at that, and that's kind of the plan here is- was kind of to get your initial feedback here and then hopefully come back in a couple of months with a more flushed out finalized plan for the streets. The other quick thing I was concerned about was the north I right now. 7Th Avenue is the truck route, so in our ends of the district, making 8Th Avenue, northbound I think you're going to be pushing a lot of trucks onto 8th Avenue, which is a lot more residential in nature than is 7th avenue, at least in the CB10 side. So I'm concerned about that change, creating a backlog onto 8th avenue further into Diker heights. On your map on your slide, you had it going all the way back to 71st street I know that's not the project area, but I'm very familiar with that portion of 8Th Avenue, and it concerns me that, if we're going to have backups, especially at Ovington Avenue, which is the overpass of through streets and as you get to 65th street, if you're going to have a bottleneck at 8Th, Avenue and 65th street, which is in borton, is also a high crash corridor and you have a park there. You have a very large park, Asia restaurant and you have a lot of children there at that intersection. So my concern is putting more trucks onto eighth Avenue and have you thought about that and what those studied, what those impacts would be yeah, so we're so we've been doing pretty extensive modeling involved with this traffic modeling in order to make sure that we're looking at all of the impacts not only on 7th and 8Th Ave from 65th to 39th, but the surrounding network offhand, I'm not exactly sure what the predicted impact with trucks are. I would imagine that a lot of them are also coming from the Gowanus or from the BQE, where, if you're taking the BQE exit you're still going to have to go on 7th to 65th street. So that would keep those trucks at least off of eighth Avenue, but totally hear that I hear that concern and we can look into how we could minimize that also the truck route ends at 65Th street right, so the northbound, so seventh Avenue, is a truck route until 65th north of 65th. Neither seventh, eighth I believe, sixth, is the truck route from there north and it shimmies over to the third I believe right. So my concern is, if you're heading on seventh Avenue, northbound and you're heading from the higher streets in Zeiker heights, that's still one lane. It's still one way, I'm sorry in our portion of the district 7Th Avenue until 65Th street right, because that's when the change would occur yeah. So what I'm saying is that if now there's a backup, because now you're going to have really traffic coming southbound on 7th Avenue, which will converge on 65th street right, because the new 7th Avenue will be southbound Tiker heights in our district is northbound until 65th street. If there are backups there, my concern is: would that traffic then go to 8Th avenue to kind of come around? If that were to happen? I was just projecting potential issues, because right now that backs up when there's a one double parked car on 7Th Avenue. If there's an inability to make that left turn because traffic is now making a right from 7Th Avenue from Sunset Park and a left from Diker heights onto 65th street, if there were backups into Diker heights, we would expect most of the truck traffic to come off the highway, though right or I mean do you think a lot of it's coming up from the neighborhood on Seventh Avenue? Well, you know when there's in you know, when there's traffic on the Gowanus oftentimes trucks will exit from Staten Island on the Fort Hamilton Parkway exit, because trucks are not allowed, they shoot down to 7Th Avenue and they take seventh avenue up to kind of reconnect to 65th street or they'll go across town wherever they're headed and get off the highway, and unfortunately it seems that happens a lot more often than we would like. As of late too, with you know, if there's anything on the even in Covid-19, you know during the Covid-19 we've seen an increase in traffic when there's an incident on the Gowanus or on the bridge, for example that ties things up a bit okay. Well, we can keep that in mind as we develop this design for sure. Okay, thank you right and you did mention that, like your concerns with safety were about due to the unpredictability and the street function and really where there are some things that are out of our control, and you know the crowded conditions are still going to exist and the loading and unloading is still going to exist. So some of these things are, you know and, as Josephine said, the narrow sidewalks are still existing. So even though you're doing all of this, there are still these conditions that we're not able to change. That's totally understand I mean we hear you 100, and we understand that when we redesign any street I mean we can do as much to encourage good behavior as possible. We can't control people's behavior, but what we really like about the conversion of the one-way these one-way pairs is that it eliminates variables you know head-on, collisions and side swipes from vehicles be because of the then you got it you're, going through like an obstacle course when you're driving down in 8th avenue and because the vehicles are acting unpredictably, it just kind of breaks down it and there's so many users. It does break down things. So what? If we can eliminate as many variables as possible and try to reallocate space to accommodate the loading, the potential of double parking, not encourage double parking, but make sure that it doesn't completely. You know shut down the street as it kind of is now, and also expanding pedestrian space bicycle facilities we feel like we can. We can give it our best effort from a design perspective, and you know we also, because this is such a big project. We want to also invest resources with our street ambassador teams to help with education, because this is pretty big. I mean it's. This isn't an insignificant proposal, you're talking 25 blocks in each direction of a conversion, and so we take this very seriously. We want to do it in a responsible manner where it's not just throw it in see how it works. We want to once we get a design proposal and we've walked all the community boards. Through it. We get our implementation team, ready we're going to figure out a responsible and appropriate construction plan. We we've already discussed preliminarily with Pd about what we how this would have to work, because you start changing street directions, especially for this long there's. Major safety concerns because people have been traveling the same route for decades and Pd heard about the conversions they said. Listen, let up keep us posted, and so we have those connections so we're we hear you we want to we. This is a safety first kind of proposal, because on our little stretch of ninth Avenue, where Ps69 is located, we did a one-way conversion and daily that is violated daily still today, wow yeah, it's a problem, I mean it is every day and it's right near the school, and we've asked for enforcement and where's the precinct on that. Well, we've called them they've been out there. They can't assign staff there 24 7, and you know you have bad behavior and I. Guess that's a big concern and I mean it's. You know I had quite frankly, an incident just yesterday with the car and trying to hunk and get his attention to go the other way and he's facing my vehicle and just honking right back at me and going around me the wrong way. It happens daily with the high lows. It happens daily with trucks that are delivering it that they're going the wrong way. You know school is currently closed as of today, but our fire drills are always an issue in the neighborhood. That's a whole, you know just seeing the traffic and seeing how it's violated, as I said on a daily basis. So it's and we're just a little corner. We're not the big stretch that you're talking about and I, don't know if the fact that it goes for so many blocks means that it'll be easier to implement or means that there'll be more potential crash sites on those different corners as people go to turn in the way that they're accustomed to when they get to that corner. So that is still a an issue, and we did that well over a year ago. Okay, somebody else. Yes, it's Joe hi John, just to comment I'd like to know how did the sunset paw community accept this plan? They've been gone through this because I can't see the businesses along there going along with this. I'm sorry CB7 is that yeah CB7? How has they accepted this plan? Converting eighth avenue to one way we talked to Jeremy and Cesar I. Think he's a Tc chair is that correct Emily? Yes yeah we talked to them about a month ago about this proposal. Jeremy actually has supported the one-way conversions for a long time. I believe maybe the earliest proposals for this were from him or people that he worked with at the board. At the time, I mean back to 2004 he's been involved in the proposals. He does understand the safety benefits and he actually thanked us. I was surprised. He thanked us for finally coming around to the idea, because we have rejected it in the past and the reasons we rejected it in the past were actually because we were it's. My understanding I wasn't involved in any of those reviews, but talking to people who looked at those in the past, the reasons were the buses, the potential for high speeds. Those were two of the main ones and then also I think loading zones. But our thinking about all three of those at this point have changed quite a bit since 2004. When we mentioned this to MTA, they were they're very interested, because the bus goes bus averages under four miles an hour on eighth Avenue. That is I, believe it I've been on it. Believe me, that's Midtown Manhattan speeds, that's like as slow as 34th street. You know at the height of a busy Manhattan day, and so they are actually interested, especially with the reopening of that Seventh Avenue Subway. Stop that right can be a transfer there at seventh app now I would just wonder about how the community up there is going to adjust to it, because they've had their own way along eighth avenue for all of these years and with the double parking, the sidewalks completely cluttered, and oil and I think it's going to be a challenge to get people to adjust up there to a new normality. Yeah agreed. We welcome the challenge, we're going to put a lot of resources to this there's going to have to be a lot of resources yeah. We appreciate that warning. I do think, though yeah I did speak to both community groups, seven and twelve prior to our meeting. So this is at a preliminary stage and I guess as you progress, we may even come together at some point. I think would be helpful because you know at war 10 whenever we do a conversion, it's a very big public process. For us. We really like to let the public know what's happening. You know on our end, so we get feedback, sometimes things we may miss, but I think some of the challenges with this proposal is the complexity of the issues and I. Think may also I know you've reached out to the MTA. We may want to reach out to the department of consumer affairs, perhaps to talk a little about stoop lines, and maybe some education there and I know I'll reach I'll speak to Jeremy about it was just so pronounced today in my visit, Dan and I didn't realize it before and there's an awful lot of loading and unloading and I think yeah. It seems to be in greater capacity that what can be handled it just seems as if I don't know where all this inventory is going. There was just so much on the sidewalks and they were impassable. So if we don't solve that, no matter one way or two way if pedestrians are forced into the street, because there's no passable way for them to walk on the sidewalks I mean we need to really address that and if you're going to put a bike lane that to me, that complicates it, because where are you going to put all of this storage material you're still going to have your trucks? You know it's going to be in the bike lane, because right now it was in the street I mean when I was out there. Today there was inventory on the street. There was inventory on the sidewalk people couldn't pass. It was very in certain sections of the avenue, so I think that you know, involving other agencies, may also be helpful. That's another suggestion. I have for you Josephine, it's Judy! Is that a exacerbated because of the open, sidewalk issue now that they're allowed to sell on the restaurant I think it's always been? It's not exactly. It's not yeah I! Think it's a complex problem because, in addition to the stores, having wares on the sidewalk I mean there were, there are rules about it. Those rules have changed a little bit now with Covid-19 and retail. But you know from what I was seeing on the street level. It was beyond. What's permitted, you know on the stoop line, even within the Covenew regulations. You know they were those sidewalks were impassable. You know they were just impassable and when you see you know moms with carriages being forced into the street because they can't get down the sidewalk I. Just think that you know there needs to be some education and reorganization of the sidewalk space. You know on board 10 we have some streets of the zero visited, Visibility 86Th street, because it's such high. You know it's an intermodal connection, such high pedestrian travel, that we have zero visibility. I know that was done many years ago, but maybe something along those lines can be explored here, part and parcel. You know as an education and may not be DOT leading this, but we'll speak to sport, 7 and boards 12, because I think it's going to be an important part of the success. You know moving forward in the design of this or making the sidewalks wider, but that kind of shortens your you have a street space and that's a big capital project, Doris and then Larry is also waiting and the sidewalks are average sidewalks they're not set narrow, sidewalks they're viewed now as narrow, because of how they're used right. But my first thought, even before the presentation, the street Safety Group of New York City D.O.T, came to community board 10 with safety improvement for 7Th Avenue and have they reviewed this and their impact on 7th and 8th avenue in Community Board. 10. next question have, in your study, have you reviewed the impact of these traffic changes on Fort, Hamilton, Parkway and 6Th Avenue? So first question was: did we work with do what was the first question? It was about 7Th Avenue, the bike lane on 7Th Avenue. No, there was a school safe. Your school safety group came to us with safety improvements for 7Th Avenue. Have they reviewed this and what are their comments? Yeah? We work very closely with them: they're they're, supportive of the proposal yeah, and where would the b70 terms be on and off? We need to revisit that with the MTA. You know that's. This is like we said before you know it's a proposal. We've talked to them about it, they're interested in it. There are a couple different options when we first talked to them about it was when they were starting their conversation about the Brooklyn bus network redesign. Well, all those network redesigns have been put on pause because of funding issues, and so we're picking that conversation back up to figure out. You know what they find. What would what they think would be most appropriate, so you don't have an answer on the b70 route and do you have any input about the impact Doris if I could say what we're trying to do here this evening is just present this proposal, it's not vetted yet we're going to take somebody. Some of the comments that we hear today we're going to take that back, we're going to do these studies and we're going to come back with a proposal. The actual proposal of how we're going to do this so I hear you I understand what you're saying keep coming with those comments, but we don't have the answers to these questions tonight because we're just taking this as information and then we're going to go and put the proposal together the full proposal. So we come back to you. We will have the answers to some of these questions that you are asking and some of the issues that Josephine brought up this evening and as well as Jay Marie. Thank you Larry. I'm sorry, you had some questions you just have to unmute. Let me know yes. Thank you. Now years back, we had a problem with the b16 and that around 13Th Avenue in Barrow Park and then the oldest solution was to make 13Th avenue southbound on 14Th, Avenue, northbound I know this was all going to actually have you had look back and see what the results of that traffic reconfiguration was. As far as I know, it's impossible to get through that street, it's double and triple parked as it is with the one-way traffic I mean it's. You know how neighbors change, not only there was a time a few years back. The Trans authorities simply want to eliminate all weekend service on the b70, because there's so little traffic, that's changed, but it's really going to make that much of a traffic. As far as you know, we're just making more trouble yeah well around everybody on at the meeting. You know we have our experiences, you know, awarding you just avoid. Borough park was one-way avenue, a two-way Avenue, it's just impossible to get through the city wasn't designed for automobiles, and this is really just we're. Just making a sore spot I know people on the other side of the 16. They say they are this. They can never rely, it's so unreliable because there's one way traffic hasn't made it any more reliable. That's, okay, we'll take a look at that. Look back at what happened with that. It was a cure-all. The people I know people on the other. End of this 16 are just wait someday even one lady who lives she, the bus never came so she never came to the Bay Registrar's society. Meeting 16 didn't show up. Okay, we'll take a look at that thanks. Thank you, Larry! Is there anybody else with a comment or question Carmen you have to unmute yourself. Please I think your finger was too quick. It muted again nope! No, yes, now, okay, I'm sorry! I got to the meeting. Late I was up at Mount Sinai, but just in trying to catch up one thing that community board 10 does whenever it involves businesses or homes, they're, always good about sending out letters and just listening. It seems like a lot of these bill. You know businesses kind of just took it upon themselves. To say this is the space I need and I'm going to take it? Is it possible to tell that community board? Okay, you need to send them a letter and tell them what the rules and regulations and laws are concerning sidewalks. You know just a reminder because some may not even know or didn't even care, but this way they can't say they haven't been told you haven't seen the doctor. That's something I definitely will speak to CB7 about I'm sure they may have done it already. I do think that moving forward, it's a good idea to do some education out there because of the I mean the inability to traverse the the sidewalk obstructions are great in you know it's heavily traveled, it's very commercial, but it's I think there's room for improvement for sure. Okay, yeah Carmen Josephine had brought that up, but we're going to put a number of resources into this. So we're going to have our street ambassador team be out there doing education along the entire route. So that's definitely something that we will take on advisement, okay, anybody else with a comment or question all right. Stars I have one more question sure I forgot to unmute myself: do you have any statistics on the bicycle usage of that fibro? We had bike counts. That I believe showed around 600 to 800 cyclists per. We don't divide them up like that, but what's the vehicle account anyway on eighth avenue the vehicles yeah I? We have that number, but offhand I couldn't give it to you I. Can we can have that when we come back right, they had given a pedestrian count that I believe you were here for it Larry that there was a pedestrian count that rivals Midtown. It was in the thousands. You have five thousand over five thousand in one hour. Yeah and you know we don't have the vehicle accounts. Sorry go ahead. Motor vehicles, you don't have anything about not off hand, but we have all of those numbers. We've done. We we're doing extensive, modeling and analysis. It's just I, don't know the number off the top of my head, but we can for sure bring that the number next time we come to talk more about this okay Josephine. Any final word: I'm muted I keep forgetting that no I just want to thank D.O.T for coming out today as well and I. Think we have a lot to look at and you know maybe Jane will put some of these thoughts together. For you, initial feedback is that would that be helpful? Yes, very helpful, Josephine also, let me ask this question which Cd10 be accommodating and having a multi-community board meeting when we do our presentation? Yes, that's wonderful, you know. Do you have a sense of timing of when the next phase is it months away a year away months, yeah, hopefully we'll be able to meet at that point like that thinking, Josephine! That's what we need at this time see I, guess the issue that we struggle with or that you know out. You know we're, as you know, working with community board 10. We have a policy of doing extensive public outreach whenever we have major land use changes, including, and we consider a roadway directional change to be a major change so that you know we did a euler. We just did a big Euler where we had over 40 residents in attendance. Virtually I think that becomes a little bit more complicated when you do three community boards on a virtual platform, but we'll get we'll cross that bridge when we get to it. There are ways we you know we could work around it and Joe I would ask you already doing it, but that you Jeremy and absolutely and Jeremy right, get together and decide. What's the best way to to do that. Okay, I'll! Do okay, great! Thank you! Okay and Stephanie. You've been wonderful with us all night. Did you have anything that you wanted to ask or add I didn't want to leave you out of it. Oh thank you. The questions I had were already answered. Thank you and we will. We have we're doubly blessed. We have two stephanies, I'm sorry that wasn't directed at me. Sorry yeah! Oh, my Stephanie's point we're good, okay, good all right! Well! Thank you very much to all of our representatives who came tonight. Thank you for tonight's presentation. Thank you for the committee members for all of your input. We wish you all a very happy thanksgiving and healthy every single day. Yes, all right.",
            "summary": "We have one item on tonight's agenda and that is that the New York City Department of transportation will be in attendance to present its safety improvement proposal for 7th and 8th avenues in sunset, Park from 69th street to 65th street.\nAnd we're here today to discuss our preliminary findings and proposal for the safety improvements on 7Th Ave and 8Th Ave from 39th street to 65th, as was mentioned before, as you may, or may not know, 8Th avenue in our 2019 vision.\nOur agency rejected the proposal, but we this time we took a fresh look from a safety perspective and the opportunities that it could provide us if we did convert the the streets to one a one-way pair, and we believe that this is a good path forward for safety improvements, but not just safety.\nThese corridors are also located within the borough, Park senior, Pedestrian focus area and a vision, zero priority area due to the high rate of seniors pedestrians being injured in this area and pedestrians in general, in the kind of greater Sunset Park Community Eighth Avenue, is partially within, is within a bike.\nWe, see a lot of failure to fail to yield right turns to cyclists, which is often because they're trying to kind of squeeze in between moving vehicles and parked cars, as well as a lot of mid-block crashes, again partially, due to them having to go around all the stopped vehicles and the breakdown and how the streets function.\nThe b70 bus as well as charter buses, and the b70 is so ineffective that when we talked initially to the MTA about the idea of one-way pairs on this street, they were, they were actually quite supportive of that proposal.\nWe're, also looking to reduce congestion and improve safety at and around 65th street and 7Th Avenue, and we're going to look to further address the crash history on these corridors by implementing additional traffic calming elements, roadway, organization, curbside controls and mobility, improvements that we're able to do because of the one-way conversions.\nThe reason that we're excited about them is because it's really a substantial safety improvement that directly addresses the crash history of 7th and 8th avenues by eliminating the two-way traffic on these streets.\nAnd, really that predictability, and that reduction of conflict is really what we're looking for as the main kind of thing driving the safety improvements on these corridors.\nWhen we do these one-way conversions, we kind of get to look at the streets are new and think about how we can use all of this space to most of to most effectively get people safely and quick efficiently through the the neighborhood.\nIt allows for the addition of a safe, dedicated space for cyclists to connect to the 7Th Avenue South protected bike lane that was installed by DOT.\nIt allows us to look at new load and right new loading regulations to address double parking and loading on the corridors, and again it's we're looking to with the elimination of two-way traffic.\nIf one we're kind of looking to convert this long of a stretch of streets to one-way pairs, it's going to have effects on real on 65th street, which has always been a challenge and 65th between 7th and 8th avenue, as well as all the surrounding streets.\nSo we're looking in our proposal to minimize the impacts on the street network while making improvements to vehicle processing, and.\nAnd, now I just kind of want to go through the Ben, especially focusing on this kind of congested area at the southern end of the corridor, around 65th street, and kind of talk about why this conversion helps it.\nThe proposed design with these one-way pairs is going to reduce the total northbound volumes at 65th street and 7Th avenue, because vehicles are no longer going to be able to go north at 7Th. We anticipate that vehicles are going to reroute over to 8Th avenue before they get to 65th street, so whether that's going over on 71St Bay, Ridge, Ave, 67Th, Street, or just going diverting right to 8Th Avenue.\nIn addition, by having these one-way conversions, you're, removing Thr possible movements at the intersection, the northbound through the eastbound left and the westbound rights, and by doing that you're, reducing the total vehicle movements and reducing conflicts and therefore.\nWe've got collected data for the intersection and found that two-thirds of the northbound vehicles currently are already turning at 65th street and 7Th Avenue.\nIt actually leads to additional congestion and safety concerns around 65th street and 7Th avenue.\nWe would be actually increasing the vehicle volumes and conflicts at six at seventh, Avenue and 65th street, because we would be rerouting both northbound nor all northbound vehicles to that intersection, driving up the volumes and driving up the turn volumes considerably, especially as you can kind of see in this map.\nIt reduces congestion and improves safety at 65th street and 7Th Avenue.\nI have visual issues, sometimes because I can't even imagine redirecting traffic on 7Th Avenue heading northbound, because currently there's such a heavy volume, you know so for the board.\nMembers on the call community, Board 10 is 7th avenue from about I, would say 66th street in this, and we go about to the railroad cut right of way.\nI mean I, don't know if it's stoop line permits, it seems like a lot of bad behavior that extends beyond the normal stoop line and creates such congestion on the sidewalk that almost forces pedestrians into the street.\nThat would keep those trucks at least off of eighth Avenue, but totally hear that I hear that concern and we can look into how we could minimize that also the truck route ends at 65Th street right, so the northbound.\nIt's, still one way, I'm, sorry in our portion of the district 7Th Avenue until 65Th street right, because that's when the change would occur.\nWhat I'm saying is that if now there's a backup, because now you're going to have really traffic coming southbound on 7th Avenue, which will converge on 65th street right, because the new 7th Avenue will be southbound Tiker heights in our district is northbound until 65th street.\nMy concern is: Would that traffic then go to 8Th avenue to kind of come.\nIf, there's an inability to make that left turn because traffic is now making a right from 7Th Avenue from Sunset Park and a left from Diker heights onto 65th street.\nI mean do you think a lot of it's coming up from the neighborhood on Seventh Avenue.\nYou did mention that, like your concerns with safety, were about due to the unpredictability and the street function and really where there are some things that are out of our control, and you know the crowded conditions are still going to exist and the loading and unloading is still going to exist.\nYou, know shut down the street as it kind of is now, and also expanding pedestrian space bicycle facilities.\nThis is a safety first kind of proposal, because on our little stretch of ninth Avenue, where Ps69 is located, we did a one-way conversion and daily that is violated daily still, today, wow.\nI would just wonder about how the community up there is going to adjust to it, because they've had their own way along eighth avenue for all of these years and with the double parking, the sidewalks, completely cluttered, and oil.\nYou know it's going to be in the bike lane, because right now it was in the street."
        }
    }
}