{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCe59qUJndCWEr8XWpDWm6Jg",
            "title": "CB7 Parks \\u0026 Environment Committee",
            "publishDate": "2020-10-20",
            "shortDescription": "",
            "lengthSeconds": "1:41:10"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "7tFJhFx9Xr0",
            "fillerWordCount": {
                "uh": 193,
                "um": 424
            },
            "readTimeFullTranscript": "61 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "park": 51,
                "parks": 35,
                "street": 28,
                "chat": 21,
                "masks": 18,
                "trash": 16,
                "month": 14,
                "day": 14,
                "week": 13,
                "updates": 13
            },
            "wordCountSummary": {
                "park": 18,
                "parks": 8,
                "masks": 8,
                "street": 7,
                "trash": 6,
                "month": 4,
                "pond": 4,
                "bikes": 4,
                "steering": 3,
                "capital": 3
            },
            "fullTranscript": "Okay, hi Chloe, I just read Linda Rosenthal's letter on the yeah. You know it's supportive it. It's says this pea grab. The rice, gravel instead of pea gravel, is a problem yeah. I got a chance to glance at it after I sent it around, but I can juggling a few things. We are live streaming by the way. Okay, so no Jeffrey can you have a new tubins, or is that your real background? That's my real background. I got ta got a new camera, so I can never seen that one. I see you with those beautiful whatever you call those backdrops. Well, if you prefer, I can switch to that. Well, it's up to you. I think inside view of the Coughlin Home right. Yes, let's see who else we get? It is 6:27, so yeah Ken. Did you get any response today from Margaret about no, I did not. I was not sure whether she's still on vacation, I think not. I mean we had some reason a couple weeks ago to think she was back about a week and a half ago, maybe and John back last week, but I'm not sure, but at least you we're not injured yeah. Is that a change? Was that not that sign not there before? I do not remember it and I've gone by there a number of times. I would have stopped and moved to myself, but I was with somebody who was intent on forging ahead and I could not stop yeah. That's a that's a dangerous thing, because you, the folks, coming around the curve, often overshoot the the divided line. Yeah the southbound folks right has not it about been as long as they said. That project was going to be with that that particular detour. It's been a while, maybe twice as long yeah, these bro for any project. They said they were going to put signage for southbound cyclists, alerting people about it, and they have not done that. Let's see, we've lost cindy, although we have not lost her in our lives. Just to our committee to change teams, yeah we've changed teams right of all in some way, the same team and so we're looking for Doug, Natasha and Elizabeth as and Dude, and perhaps Barbara will join us and maybe some other board members we'll see, I'm going to start the webinar, which means that the attendees and we start recording, okay and let's see who the attendees are right. Now it's Barbara Adler, as you predicted excellent. Do you want to make her a participant, I sure will analyst rather Barbara hi everyone you've become a panelist. Thank you. I see that and Jeff Martin is with us and, let's see, attendees is now Ira, Gershon Hunter Paulie Spain. How do we? How do we do? Well, it's up to you mark how you do panelist versus attendee for other board members. Unless there's a unless we're running up against the limit, we would almost always promote fellow board members. So have you already promoted polly? I think she's been she's already been around welcome paulie. Where is clary, I'm a participant you're! Now a co- host. Oh hey, hi, Jeff we've got Jeff Martin, the guy. That runs Riverside park, hey guys how you doing hey good to see you am I late, no exact, okay, although as committee members we're still looking for Doug and Natasha and Elizabeth, oh, we got Elizabeth and you got Natasha. We got Natasha, so we shot. Let's start, I guess and is Van Num. Is I mean? Is it Matt Gambridge with us? Yet I do not think so. I sent him the link, but I do not see him yet yeah we got paid, it was jess 631. So I see our list of attendees. Okay, let's start so I'm going to go so so I'm for those- and I do not think there's anybody who's with us who does not know this, but this is the October meeting of the CB7 parks and Environment Committee, I'm clary Newell. At the moment, the only chair, but sooner or later we'll have another co-, chair and we'll have probably a relatively short meeting tonight and relatively few attendees, except for some really welcome loyal members of the community because we do not have a. We do not have a new specific agenda item tonight for new for for our action and discussion tonight. We're really mostly talking about our committee, and so the first thing I think, is to thank Elizabeth Elizabeth, we're seeing a picture of you Elizabeth, not you yourself at the moment, but I'm on. I just have a very large puppy. I want to thank Elizabeth whose last meeting as co- chair was last month for her collegiality, her knowledge, her everything that she's brought to our committee, where she's remaining as a committee member and as Elizabeth- and I said today- not only is she a true parky, but she and I invented the new world word she's, a true environment. Am I getting this right environment as well both important qualifications for our committee? So thanks Elizabeth and we're glad you're staying with us so you're here we really have only two things on the agenda tonight, oh, but by the way- and I do not think I've done this myself. Yet how do we wait a minute? How do we where's the chat? Everybody should type your name: everybody who's, a community member or board member type, your name in the chat addressed to all panelists, so that you'll be recorded for the minutes in case somehow that otherwise does not happen. I'm doing that right now, but as we've learned at least I learned recently, if you do anything in the chat and you're a panelist, and you want the members of the public or the otherwise known as the attendees to see it, you need to change the default on the chat box, so it says all panelists and attendees, and that way anybody who's with us tonight will see whatever you have put in the chat. So we really have two things tonight on our list, but they are basically all about committee business and they somewhat overlap each other. The first. The second item, as we always have, is updates on projects. We already have things: we've approved issues, we've discussed resolutions, we've passed so we'll get to that next. But the first thing is kind of just a brief discussion on what our committee's doing now thoughts for our committee, and I want to start it out and then hear from other people. Of course, the first most important thing tonight is that tomorrow is the steering committee meeting at which the steering committee ranks overall for CB7 our budget priorities both on the capital side and the expense site. That is an enormous. Well, it's a it's a it's a difficult meeting and it's not going to be any more easy on. Zoom it'll, probably be more difficult, as all of our meetings are probably more difficult to unzoom, as has been the case in past years because of the very large number of capital projects and even expense items that we have in our committee and because we are lucky enough to be able to get input back and forth with the Parks Department, which happened very recently, and the timing issue and all sorts of stuff. We can't, within our committee rank our own items to take them to the steering committee tomorrow. So what I had to do- and it was a very as mark knows- because he had to then deal with the product- I sent him. It was a very big deal to update the district needs statement that we talked about last month to reflect all of the issues and concerns and changes and problems we have from from Covid-19 that are still ongoing, and some of them are getting better we're getting some composting back we're getting some other stuff back, but the focus of the DNS itself. The text is large that the new material we have is largely the effects of the coving. We also learned just the end of last week that the Parks Department has handed us some new capital priorities that we did not realize that we were going to have to deal with and just to be really brief about that, specifically two comfort stations in Riverside park, south that were always since the beginning in the early 1990s, when the plans in general for the park were approved, comfort station down at 62nd street. That would serve not just recreational and commuting cyclists and others who were going up and down around the park, but would serve a huge multi- sport, multi- purpose playing field. That's the central feature of Riverside of phase six. The southernmost phase was always supposed to have a comfort station. We thought they that was in the plans it was designed, but apparently the developer is left it out of the of the plans. We do not know yet whether they've been bid, whether they have a contractor, but in any event that's something we had to put on our our list, and we had gradually learned that the other comfort station, that's always been essential to comfort stations. New York, Parks Department speak for bathrooms. If you do not know the other comfort station, that was also from 1992 essential to the plan for the park. It's up at the up at the Riverside boulevard level at 66th. Street also was designed, but never bid by the parks. Department. That's in phase five, which we'll talk about later, is maybe this time really about to open but minus the comfort station. So suddenly the Parks Department told us we got to put those on our list and try to help them find money. So there have been a number of changes on our list this year, but what I tried to do in ranking them- and I won't say much more about it- now- is to take into account the new things that the Parks Department has said are now. Priorities is to rank them to the extent possible, largely maintaining the relative ranks that had been our committee's judgment and rankings in prior years to the extent, which is mostly that they have not already been funded and graduated from our list and finally, in light of Covid-19 and in light of the use of our parks and primarily Riverside parks that we now see to try to rank them in a way that takes into account the needs and concerns of the greatest number of parks. Users park users. So tomorrow it's really important that all of our members attend the steering committee meeting and help me and Elizabeth Advocate for the parks items, because what happens is- and some of you have been at that meeting in the past and Ken certainly is familiar with it. I think maybe others are too there's a lot of horse trading that goes on among the chairs of the various committees. There's a lot of back and forth, but to keep us from getting creamed. We need. We need all of you there for to advocate for our items. You'll allow of course, exercise your own personal judgment and it's not to say that any of us would say all of our parks items should come before any other item. We've never said that and we'd never win with that, but it's important for all of you to be there tomorrow, 6 30. Mark will be the chair mark's. The champion marks the chair of that meeting as well as the board, so that's it for now on the DNS and the budget project. Unless anybody has a question yeah I do yeah. Is it possible for us to see the list? I have not got it yet, although Mark sent me mark did his best to take what I sent him and make it a list. I it came to me tonight so Mark. Why do not you answer that? How it's going to work for all the committees tomorrow mark it should be so distributed to the full board? We got a lot of this material late much later than the deadline. We asked for it's still in fact coming in, so I'm at the deadline. Okay, whatever you did, it was a big job, okay and it was a big job and translating what I got from you, which was helpful into the format that is useful for that meeting is also a bit of a trick that was done today. I can send it to the committee right now. If that would be useful. I was just talking about the parks and environment. That's what I mean. I can't send the whole thing, because I do not have the whole thing yet mark in the chat are a couple of things we need to look at. One Doug asks whether the invite has been sent to the steering committee yet, and I do not know whether the invitation goes out to all board members. It probably should for this meeting. It goes to the steering committee members and they have been invited anybody else who wants in I'm glad to add. There's plenty of room and polly Spain, says she's in the meeting. Her technology is not cooperating. She's hopeful she'll solve her problems. That's actually me on her behalf. Oh okay, oh and Elizabeth. Okay, I got this one. It's good job mark, which we all agree. So at least for now, that's get on the DNS, the budget priorities and tomorrow's steering committee meeting. There's nothing else. I think mark that's sort of directly relevant to anything. We're talking about tonight. That's coming up tomorrow! Is that right? I think so we will be talking a little bit about meeting management, a couple of different things for full board and including policing the chat when it gets pretty rough and tumble there'll be an update from a Block Association having to do with that super tall tower in the southern part of the district, but the big, the big items will be the expense and the capital budget priorities most of the as you'll see shortly. Most of the p e budget priorities are capital, although there are a few expense ones. I think one of the most of the and as you saw in my email over the weekend- or maybe it was the end of last week- the there are a couple of expense priorities that I'm going to propose outside of any committee because they do not neatly fit within to it. Within a committee we do not have a uniform services committee, for example no, but I think that the Trash pickup one actually, I've worked with you on that is within sort of our environmental purview in any event yeah. Well, I have, I have language for it, but if you like yours, better, I'm sure that's fine, you may choose between mine and yours. I sent you mine, you can do yours, it does not matter and then the other is adding back some funding to the police department for overtime, which I feel strongly about as a way to sort of balance out competing concerns. Hey there's, polly she's back, I think all right. Finally, okay, so the old, unplug and return and restart worked excellent. I love it. Yes, thank you all right. That's all! I got for right now, Penny Clark, okay, so you know I do not think we need to have a very long discussion on our first item, which is, I think, it's written generally as committee operations and plans or something I did want to remember, to say one thing that I said only at the end of last week's last month's meeting, which is our thanks to both Matt Genrich, who normally joins our our committee meetings, Matt being the manager for Dpr of District 7 and everything in our district other than them and in another district as well. Other than Riverside and central Park and Jeff Martin, who is with us tonight and is with us nearly every month and both of them as we conduct our meetings, are frequently very helpful and back and forth in dealing with the real world as it exists on any day that we are speaking with them. I think it's part of what they get paid for to join us, so they are paid slightly more than we are for being here, but not a whole nother whole lot more imperceptibly, I have a funny feeling yeah. Probably we probably should not inquire about the minimum wage because we might be challenging it. No, so I just wanted to start out on our first more general item by saying that and Elizabeth and I've worked together on this tried to continue to do so over the last part of a year on both two things that overlap. One is trying to increase our committee's environmental activities, focus on environmental issues, as from the point of view of CB7 and second, to work on really involving committee members other than the chairs on what we do day to day. A lot of what we do, there's no way to avoid a lot of work for the chairs. That's just how it is, but we've been very successful recently on at least two issues and we'll see how I hope they will continue in the in going in this direction. Both environmental issues, where members of our committee have agreed to sort of become our point. People on these issues, one is Natasha who first kind of brought us into focus on. This has been following issues of trash collection, garbage and I'm not sure, natasha, whether you're now our compost person as well, but that you know we started that a few months ago, because Natasha expressed an interest and having somebody who's specifically charged with and has undertaken to kind of, follow an issue and perhaps expand or contract the scope of the issue, but at least follow. The issue for us has been not only very helpful, but I think an accomplishment we've had in the last few months. Similarly, Ken has recently agreed to follow the helicopter noise issue and danger. I guess as well there's Ken yeah right. Look it up. I had not even remembered this, but community board. Seven in when was it can January, yes, passed a resolution supporting federal, proposed federal legislation that would limit to be a little bit concise about it. I guess with limit helicopter noise flying above us, our parks and our neighborhood, it's essentially a federal issue, efforts to control it through New, York, City, Law or even New York State law come up against some legal doctrines about federal, preemption and whatever. So what we're now looking at is federal proposed legislation, but my point is not so much the substance of it is that Ken has agreed to be our point person on that, and that is fully consistent with our having a position that full board has already taken. So Ken is in a position to not only follow the issue but to be representing the CB7 consistent with our position. So I'm trying to think what else sorry can I just say something of course, so thank you for making me in charge of composting and everything, sanitation related I'll I'll. Take that responsibility. If nobody else wants it is important to me, I'm not regretting it. Yet- and I just wanted to say that I attended Mark Levine's town Hall from 5 to 6 p.m. Today, on sanitation, recycling and composting, and if there's time I can update the committee on it, there was really nothing earth- shattering about. It was very educational for me, but you know I'm happy to share what they said on that meeting. Do you want to do that right now sure so, Mark Levine hosted this town hall today from 5 to 6 P.M, the title was sanitation, recycling and composting, and he had people from different agencies and non- profits on there. You know, obviously we're all aware of all the budget cuts and there's really nothing that they can do about it until the city or the mayor decides to roll those back, and there was actually very little information that they had on the future of certain programs. Like I think in our previous meeting I talked about e- waste recycling, and I asked that question in the meeting again in today's meeting and they basically had nothing to add to it. They just said that it's been sort of it's been halted for now and the best they could do was guide us to you know the duane reads or the best buys of the world. They did say that if you go to ecyclenyc.com where they have e- waste collection for entire buildings, that's a program that they just restarted just very recently, but you can only have your service resumed if you are a building that already was registered under this program for any building going forward. That wants to register for this program. I believe they come and they put a bin in your building. And then you know you put everything in there. I believe that's on hold for now, I'm not sure if buildings can register for it and get into some sort of a queue for that or not. But that was something. So it was a little bit disappointing that you know in like all of Manhattan. It seems like there's nothing except for the occasional drain read or best buy that you can go to for e- waste recycling they talked about. They talked about very interestingly. They talked a lot about street sanitation, and one thing that I was very surprised to learn was that last year was like a blockbuster year for the city in terms of street sanitation, Litter basket hiccups, it was the best year ever and that's why? Maybe you know the situation on the street seems so dire to us just visually this year, and somebody asked how much money it would take for the city to restore full service. The way it was pre- pandemic, which was litter, basket collection, seven days a week throughout the city, and it actually was not even a lot of money. It was seven million dollars only which is you know it's I mean it is a lot of money, but it's actually very little as compared to the entire budget of the city. So it should be something that can easily be prioritized for restoration once things you know, once we get more funding or you know things calm down a little bit, but everybody was in an agreement that that's a you know: it's not a huge expense. As far as cities, the city's expenses go- and you know that was you know. They talked about environmental justice, about how in NYCHA buildings, there's no composting and recycling is there, but it's very spotty and actually very inconvenient. So people have to go from their top floor of the building to the bottom and- and so you know it came up again at the end about what exactly the these agency agencies need to make their jobs easier, and one thing that came up was just to make the disposal of items by the public easier, whether it's you know in order to enable good behavior by people. So you know providing more bins and making them as accessible as possible by everyone, and there is a zero waste goal for 20 30.. I'm not sure if that will be achieved, but everybody wants to remain hopeful about that and they also talked about a lot of non- profit. Innovators like the lower East, Side, Ecology, Center, reclaim Organics, which I believe is within CB7, fabscrap, etc, who are doing they're coming in and filling the void left by other composting recycling city funded programs. They talked about food donation and how that should be prioritized also in order to prevent food waste, and they also talked about specific bills that are pending. I mean one specific bill which is Intro 1942, also called the core act which will mandate drop- off sites all over the city for composting, but the one thing that they need is a mandatory citywide composting directive, which we do not have right now, there's no bill for it in the city at all, so they were advocating for the introduction of such a bill, and that's basically in a nutshell. So, let's ask Natasha whatever questions we have on her report. Let me start out with I see your hand, but let me start off with a couple Natasha first, I want to say that, when, following up on our discussion last month, when we talked about the DNS and the impacts of Mr new statement, impacts of Covid-19, we did include some. You know general stronger support and remarks about the negative impacts of Covid-19. With regard to the things you're talking about. Some of these things are moving targets where things change every day. Last month, composting recycling had been restored to the green market at nine at 97th street, into a site on 107Th Street a couple weeks ago. It was also restored on sundays to the green market at at 80. It's on 77th street, with the Columbus avenue museum, the green market. So some of these things are gradually coming back to some degree, but I wondered whether- and I think at least I learned last month from Peter Arnstein- that there's a different we're focused on the difference between composting and organic recycling, which would include things like bones and paper and stuff like that yeah. The meeting today make any distinction or focus on any distinction between composting and a broader organic recycling. They talked about. The only distinction that they made was between curbside composting and drop of composting, which is the drop- off. Is the what happens at the green markets etc. Curbside is, I think, when you get those brown bins within your building, and then you know at the end of the week or whatever they get collected. The only thing they said was that curbside composting is suspended till I think July of next year they said to hold on to your brown bins, because hopefully it'll come back, but in general you know they did not talk about collecting things like bones and stuff. My understanding is that at most places that are city funded like at the green markets, you can only drop off vegetarian food scraps and then some non- veg, like eggshells, etc, but at some of the private like non- profit type areas like the reclaim center, they do take non- vegetarian food scraps and oil household oil right. So it really it's kind of a mishmash. You have to do your own research and, but I think at the city funded sites, it's really just vegetarian and I do not know about the curbside composting. But it's a it's a moot project moot point because it's suspended till July of next year. So we've seen some comments on this general topic that Natasha's talking about have shown up in the chat so Natasha you might have. We might all have a look at those, but particularly Natasha in case she has any more I'm trying to get to the chat. Barbara you've got your hand up you want to if you're, not on mute already on mute. Okay, thank you. I wanted to response and Tasha. I wanted to ask you a couple of questions and then I wanted to say something else. First of all, there's a my building has a bin for recycled clothes and it's run by housing works. I do not know if the program is currently up and running, but we certainly have not been in the basement and it seems to be mostly empty most of the time, so I know they collect things on a regular basis. So that's another option: is it accessible by non- building? No, it is not. They will only put it in your building. If you have so many units in the building. The other thing I wondered if in the conference you attended, if they, if anything was said about the big bellies and how helpful they have been, is the solar recycling and how they hold seven times as much as a city trash basket does, unfortunately, that did not come up, so no, it was not discussed. Barbara we do have in our budget priorities. Mark is that, on the I can't remember it's on the expense side. I think we have a budget a priority request for a whole lot of more big belly. We, you know we're aware of we've been aware for ever since the first ones were put in of how effective they can be in reducing waste in managing the volume of waste moved that to capital, because you were asking for a lot of them. One big belly would be expense, but a bunch of them would could qualify as capital. I think the last we heard they were around 3,500 each or something like that, and I think our current request is for some in Strauss Park and some in a variety of other places, so we're trying to get them trying to get more of them. Rather it's even more complicated right now, because they, the new newer program, is that you they service them or replace them in perpetuity, and you pay a certain amount of money, because what happens is that they do get bashed and smashed up and and then you're in a position of having to replace them again. But they are, you know we put 17 of them and around Theodore Roosevelt park yes ago and solved a very serious problem there. But we have two comments in just one second Natasha in the chat one, our regular public participant from the community Ira Gershon Horn, I can see in the chat, is not a fan of big bellies, considers them to be effective only for pr, but I think many disagree with that and Joyce Bialik and the public is asking what they are. These are these somewhat larger, enclosed trash, bins that work on solar power so that the trash goes in and solar power compacts the trash, and they can then collect and fit in these things way more than fit in a normal wire basket, and but then it eventually has to be the compacted contents do have to be taken away. The newer ones are kind of operated also, so you never have to talk yeah great. I do have a comment about the big bellies around Teddy Roosevelt Park. I've noticed four months now. Actually two of them at least two of them are no longer operational. They've been covered by black trash bags and with tape around them. So, and it's been like that for months, one of them is on 77th street, where the green market is and the other one is on. You know right by the entrance to the parking garage of the museum, and I was wondering if anybody on the call knows what's going on with that, because they you know for several months. It's been like that, and but again those were purchased just before the start of this program, where big belly company would have been responsible for fixing them right away and replacing them. So I can. I can get back to you on that yeah. But may I just say one other thing I and it has to do with last month when I made a little presentation about Theodore Roosevelt park and and the planting that we want to do in conjunction with the noise from the foreground. I'm not talking about that tonight, but there's a they put in a bioswale. I think it's a bioswale. There is actually a difference, a small difference between a bioswale and a rain garden, one of them purifies the water, and it would make more sense to put in a bioswale in that area because of all the urine from dogs. A rain garden is something that absorbs the water so that, if you have a flood area, it's a wonderful thing to have. But I thought you know. Since this is parks and environment, it would be really interesting and not that's not the only thing. But if we had a presentation on the difference between a bioswale and a rain garden, how important these things are, how easy they are to really install when we installed the one at you know, on the little streetscape we built between 76 and 77, it was the only one- and I believe, still is the only one on the upper West side and it solved a huge problem which I won't go into now, but I mean I'm happy to talk about it. If you, if you wanted to hear anyway, that's all right, let me suggest this. I mean one of the things I was planning to say in this section of the discussion tonight is and again two things that sort of overlap. One is that the some of the several of the items that we've considered and past resolutions on that have then been adopted by the full board in the past. Several months have been brought to us. I mean not that we did not know the issues but have been particularly pushed. We've been, we've been we've put on our agendas at the urging I would say, of various members of the Community Board or the committees as Susan, for instance, on in one case and last month, although we did not have resolution the theater, roosevelt and a couple of others too, when we talked about smoking in the parks and when we talked about and prohibiting smoking in the parks and also the enforcement in of traffic laws in central park. So so one thing we've been encouraging and pretty successfully recently is both items for our agenda being brought to the attention of the committee by members of the committee and sometimes members of the board. It's not automatic that when a committee member suggests an agenda item, there may be reasons why the chairs, in conjunction with consultation with Mark, may decide it's not an appropriate agenda item at any particular time, but in general it's a welcome development and it's been pretty successful lately and then the other sort of overlapping thing is just when there's something out there, not just, as I said at the beginning, having some of our members volunteer to be our point. Persons on specific issues but kind of the other side of that is when there's a specific issue that may not lead to a resolution or be asking for a policy decision or a recommendation, but simply something that would interest us. We've also been trying to, and I think somewhat successful in getting such issues brought to our attention by members of the committee so Barbara. I would say on that one by all means, if you have somebody other than yourself and you could probably do a good job of it yourself, but as somebody to make the kind of presentation that you saw who's a real expert, you know let us know, and I do not see why we would not want to have a you know, a 15-minute presentation on that issue or many other possible issues. I offhand I do not have anybody but I'll speak to the museum and see supply somebody who might be able to do that or or Bill Castro from parks or from maybe even dpr, because they were shocked when we asked for Bioswale on our city street, they said I was the first person ever to call them and say they wanted that, so they may be helpful too I'll. Try to line something up and let you know yeah susan, your hands up. I just want to say I think, that's a great idea. We might also want to build on that Barbara. I found out recently that in central Park the rumor has I'm not sure this is true that they do a lot of management to the water spaces in the park. Specifically, the pond was very low about a week and a half ago, which gave me the opportunity to get a spectacular picture of a duck eating a fish which is apparently not an unusual thing. I did not know this, but the reason the water was so low is somebody told me was another birder told me was because they knew that storms were coming over the next few days and they wanted to get out ahead of it and prevent flooding so, and they said that this is done throughout central Park. I assume it's probably done in Riverside park as well, but certainly in central park might be an interesting thing to weave into this kind of like water management and preventing flooding, especially in the pond in the southern part of the park. Where it's you know relatively low level, so it would take out a lot of paths and do a lot of damage if it flooded. So it's sort of an interesting thing: it's not particularly something you need a resolution on, but it might be interesting. Well, our community colleague Ira, who I referenced a little while ago now has a long entry in the chat generally, not keen on big ballets, for reasons that you can see in the chat, but Ira also mentions that DEP has a spec for installing rain gardens. So this really is an overlap between issue. I think between DEP and and Parks Department. He says, DEP Iris says anyway, he has 9,000 of them, so barbara, if you would be willing to undertake putting together. However, you do it some kind and it does not have to be for next month, but some kind of a presentation to us you might involve DEP and dpr, or at least come up with something I think we'd be thrilled to about rain, gardens versus Bios whales and even more broadly water management in our parks. That would be great. Well, I I'd love to involve Susan in this and lowering the levels of the ponds in the park. I think that's fascinating. You know, and so I'm sure somebody from parks could easily talk to us about that. You know not urgent but to see what you can come up with. I see Lisa Orman a panel. A attendee is talking about the Gowanus canal. Conservancy has some of them. Presumably rain gardeners. Oh, if we're up we've got six attendees. Let's see oh yeah barbara, just before we finish this part of the discussion, although it really is more an update on committee business, I know from communications we had, and this was really good news, and I see that Daniel Atha is with us tonight when you and Peter Wright presented the proposal that turned out not to be for a resolution, but it was for our. It was a discussion last month about planting both a row of plants at the back of the Bulmus Dog run, and then in the rain garden, Bios Whale area, you would propose boxwood for the latter area and Daniel Atha who's a horticulturist, I believe, with the botanical garden, talked about that plant suggested some alternates and I think you've made a little progress on that since then. If you want to just mention it and with thanks to Daniel for his participation, you know I have to apologize. Daniel I've tried to send you an email three times and for whatever reason, it will not leave my out box. But I wanted to thank you and we decided to go with presuming this moves forward because we're looking into some other ideas now that might be more effective or a combination of a few together, but the wax can't think of what they're called right now, but the those evergreen Wax berry bushes, whatever they're called, which make a dense edge and are easy to care, for we are definitely going with those instead of what we had proposed in the which was boxwood for the front fence and whereas you know we're still looking at the arborvitae for the back wall. But I know that the people on 81St street have been trying to get some kind of soundproofing blankets. For a long time. We were told that was out of the question, because landmarks and the our conservancy would never approve anything like that, but it turns out that may not be completely true if it's done in the right way and if the trees are there to screen it and it does not harm the brick wall of the garage. So all this is sort of up in the air right now and we'll get back to you. Barbara Daniel has put his email address in the chat. I thought I'd given it to you, perhaps not correctly, but anyway, Daniel's put it in the chat. So thank you. Thank you. So you know I welcome anybody else before we move on to our updates, and this will be a short meeting polly. Is that a hand up from Paulie? I see a hand. Yes, okay. I had put some comments in the chat and one of the questions I had. I do not know if the committee has discussed this already is the blue mask like have you seen an increase in black masks being discarded in the parks and throughout the neighborhood, since they are required? You know when you go in the store to go shopping and then my other question is: how is those masks being handled? You know, because some of those masks may be contaminated by someone who may not know that they have Covid-19. So that was a question that I wanted to present. Well, let's turn to Jeff Martin who's been sitting patiently, who manages Riverside, who manages Riverside park on a day- to- day basis to see whether he can tell us Jeff. We just throw them out. They we often find them on the ground. Sometimes they get picked up, they get thrown out with regular trash. We have no or anything that says we need to consider them as medical waste or anything like. So I do not know how long Covid-19 could possibly stick to the mask or not. I could try to find out, but again we're not being told that they need to be separated as medical waste. I do not know how hospitals do that either. Do hospitals just throw them out or they have to put them in a medical waste container Jeff, I'm in rivers, as you know, in Riverside park very frequently, I do not see a lot of masks on the ground. The far greater problem for me and for many of us who are wearing masks is the fact that most runners, many cyclists and some pedestrians are not wearing masks. That's more! The mask issue than discarded masks who are up to my observation in Riverside park. But do you do you see a lot of I mean? I understand you treat them like regular trash, but do you see a lot of discarded math on the paths and grass or whatever in the car? It's relative. I mean I see more now than since we've had this problem back in back in the spring, but there's not a whole lot of them. I mean you know there might be one or two lying around when I move the bike path every day from the length of 59th street. To maybe you know where I get to 135Th Street. I might see three or four masks along the bike path at any given time, but my staff will pick them up. So that's not a whole lot. When I go through the middle landscape areas along Riverside drive, I might see one or two here and there but, like I said it's not a whole lot of mass they're, not like everywhere, like literal or cigarette butts, or something like that, but here they're here and there holly. I think we do see a lot of them on the streets and sidewalks right. I've seen them on the sidewalks, but I guess my concern is. I wanted to know if those masks were separated from the regular trash, because when you talk about you know, recycling and you know certain types of waste matters separated. So I just wanted to know you know not just from the perspective of the parks Department, but just in general, you know how that waste matters being handled because playgrounds where you have children playing by schools. You know different park areas, you know how they throw things and take the mask off their face and just throw it on the ground. I mean I've seen it people shopping once they get out of the store they throw it on the sidewalk and keep going so you know my concern was: has the health department you know giving out a directive on how to handle? You know the mask, because you do not know if the person wearing it is contaminated or not and has the virus, and I just think that's a question. You know that needs to be responded to by the health department like how long does that spore stay on a mask, etc, since we're all required to wear them. I guess that's a little bit beyond the purview of this committee, but it's yeah, but it sounds like it's pretty believable for the whole city, which is you're lucky if somebody puts picks them up off the street and puts them in the trash. Yes exactly so in this section, where we're really talking about what we do, what we're trying to do, how it's been working in the last year. I have only one other question and then I would love to hear if anybody else says things they want to talk about before we just do some updates, and my question is really simple. We decided a few months ago, maybe just before Covid-19 hit to move our meetings, which had been at seven o'clock for years this committee to 6:30 it was a it was not. It was a problem for Doug, relatively speaking, which I remember and was concerned about, for the other. Everybody else was either indifferent or, as our committee was then constituted, or was in favor of 630, and it conforms to his market, conforms to all the other committees. Does not it or are there any that are seven. I think land use may be at seven. Well, although this month they're switching to six thirty, oh okay, oh it's hhs! I think Hhs is a seven. Am I right about that? Well, that might be right, I'm not suggesting that we revisit the 630 and I think, there's an advantage for members of the public. If all of our meetings are at 6:30, then they know what to expect and if anything, I'm not sure why Zoom would make a difference, but somehow it seems an even stronger argument with zoom, but unless we have and with all respect to Doug, because we certainly do not want to discommode him with his children and dinner, although it is probably three meals a day with the family every day now doug. So maybe it might be a good thing every once in a while, so we'll keep it at 6:30 unless there's, unless there's a reason to change that so Paul Fischer by the way are another board member joined us a little while ago, I'm just giving a fast look at the at the chat. It's a lot of stuff about water and rain, and rain gardens again Natasha in particular. If you can have a look at that before the chat disappears anything else in this sort of general topic area. Before we talk about updates mark, it looks like you want to say something I do. I just wanted to follow up on Paul who put a question in the chat as to why there are so few big bellies north of 96th street, and the answer I believe, is that big bellies, only big bellies can only be emptied by a person with a key, because you do not want people putting their hands into a trash compactor unless the thing is turned off which the key does as a result effectively. In order to have a big belly, you need a partner who's, going to hold the key, the key master of the big belly and to and to make sure that person is available when it's time to collect the trash from it. So Parks is a good use of it, because the parks employees can be the key masters. I believe, actually, that shake Shack has the key for the one near them, but other than that big bellies are, you know, and then bids of course can do it as well, but other than that it is a bit of an issue trying to make sure that the thing can be collected, and I think Barbara has a comment for the most part they're privately funded, except for when they are in parks and parks purchases them they are privately purchased and they are expensive. So that may be one reason why there on so many above 96, because nobody has stepped up to do that. I'm not sure. Also, if you have any kind of cleaning service Peter in the in the bid like we had on Columbus Avenue, the DOE fund had the key and and they can watch them and they can tell when they're about to be full, because the light changes on their computer from green to yellow to red, so they can be monitored and around Theodore Roosevelt park. They gave a key to fake shack as an additional key dpr also has a key, but they were slow in getting to them, so they gave them a key to shake since most of the trash they blame it on shake Shack anyway, thanks Barbara, I do not think I mentioned in the beginning that Susan is taking the minutes tonight. Susan. Is there anything you need to have clarified or anything for the minutes? It's okay, ken! I do not know whether I had some questions for Jeff, but I maybe it's part of updates. I do not know does not matter. You know it's all kind of part of the same big thing tonight or the same thing. Do you want to just ask Jeff your questions? Okay, these are all four of them relate to the updates on the Greenway Bike path. And can you speak up a bit sorry yeah how's, that is, that right that better Susan, that better, okay, the the narrowing of the construction, that's re requiring the narrowing of the bike path that between 59th and 70 61st. Very short. Do we have any idea when how long? How much longer that's going to be going on? Yes, it should be going on until about November first, so the construction should be it's. It was from October 1st to about November 1st. So that's our projected station date. I think Jeff Hannah's talking about a different area, we're not I mean the stuff at 59th street and that detour that put the pedestrians in the and the cyclists kind of back together. That's been way before October. First, the very bottom of Riverside south right. The day, oh you mentioned, are the 72nd street area. Okay, that's you know. The 72nd street area is what you wanted to know about 59 to 60. 59th street, I'm sorry, okay. So what we're waiting for with 59th street is just to go through a punch list and what I need to get done or what needs to get done is along the waterfront. There is a lot of riprap and we need to get a construction, the contractor to put more fill next to there, because it's there's no guard, there's no railing or board rail. That's on the side. There they completely it's very nice. They put a complete new wall, looks sort of like a sea wall right next to the riprap, but there's no guard result or anything, and it's not designed for it. So we would like them to put more fill inside there so that people can't step and then you know, fall into basically a four foot hole, surrounded by rocks to get legs caught and stuff like that. So you know it's one of the things on the punch list. That's the main thing that I noticed on is problematic, so we're getting the contractor to do some punchless titans. I do not think it's going to take too much longer to get that open, but everything did get complicated by the cobin thing. It should have been opened a while back, but it's like, I said, every everything on parks has been on hold since the spring on the Covid-19 and now since the contractors could start working a few months ago, yeah they're starting to get these jobs done, but it is taking a lot longer than than we wanted. But that's just the nature of the beast right now and I'm sorry about that. You know they're working on it should get done pretty soon. Have you had any incidents of collisions between cyclists or cyclists and pedestrians there? I know it seems odd. I have not heard anything about collisions there. I think one of the things that may be preventing it is the fact that people kind of realize they have to slow down and they have to go single file through there and you know first just I have not heard anything at that spot right at that point. So I think also you've got sanitation, not on my part but right there. They in the mornings during rush hour, the sanitation parks go in and out, and so they have flag people there and I think, honestly, that's kind of helping slow people down a little bit. You know they see the flag people there. You know they slow down a bit and then they go on the path and you know they're for some reason I just have not. I have not had any problems myself and I have not seen or heard anything at that location to indicate that there's any kind of collisions or anything going on there. I have not encountered anything good you're playing this a little subtly today, Ken sent an email and I was copy, but I do not know that Jeff was a to Margaret bracken about a problem with a protruding sign down there that may have been moved or maybe in a different may have moved itself. That seemed to create a danger, so it can. Maybe tomorrow you can just kind of get Jeff in on that conversation as well yeah, sorry, I should have copied you and I forgot, and meanwhile we have from Jeff who was just speaking. Our Riverside park manager in response to Paul Fisher's concern Jeff, is put in the chat. Riverside has quite a few big Riverside park has quite a few big bellies north of 96th street Paul. I can monitor them with a computer, says Jeff. So it's we are not totally bereft of them north of 96 it just we in general have fewer, I think so. Ken did you have other things. You want, I'm just sort of moving north, the new detour as a result of the 72nd street construction. I'm sorry, can you speak up a bit. It's really you're sort of fading. Again. Sorry are other people having that problem. Also less so. Okay, the the construction necessitating the detour at 72nd street, the signage for the detour for cyclists, who are going south where there's the fork in the road and cyclists who are not exiting at 72nd street, should go right that got better, but it's certainly not ideal. I know you're betting on people getting used to it, but a lot of people are tourists or they're. They take that route very infrequently. So I would encourage you to try to get even more prominent and larger lettering on the signage. So it's really clear what the decision point is, and maybe just even a greenway north sign to the right, because that's essentially, unless you're going to 72nd street, which very few people are, can you hear that Susan? Did you hear that yeah Jeff aside from, and I mean I agree with Ken- that the signage is much better than it was when it first went up, but it's still not great, but aside from the signage, I was pleased I think a few minutes ago to hear you say I think that you expect that whole detour to disappear or no longer be necessary on November 1st is that still is that right? I can't guarantee the date, but that's the projected date. I mean we'll see what happens, but I do not think it'll last much longer than that, but I guess who knows I mean you know. Sometimes you know they're doing they're digging anytime. You have a big job. Things can go wrong as you know so, but when I saw them marking around the ball fields, everything was really marked nicely. So I'm really hoping that this is going to be a good dig job encounter any problems and that they'll get the job done on time. So I was, I was really impressed with the marking that the contractor did all over there. I never saw anybody market so well, so really happy we'll see what happens and you know they're. They look like they're chugging along so we'll see, but you know they're doing even more work around the old basketball courts and the handball courts down there. So you know that's they're going to. I think they're going to continue to work on that for quite some time, but the you know the one around the ball field, the softball field, yeah we're hoping that'll be done pretty soon great and then just moving even further north. Any update on cherry walk. Look the success in getting subcontractors. I have no updates. I talked to Ben and don about that today. We're disappointed that did not happen when it happened. I just do not have anything else. I checked that there's nothing new developing on that right now, so that that's unfortunately, I have nothing to worry about that, and I talked last Thursday. I think it was with Steve Simon who's, the who's, the chief of staff, the parks Department in Manhattan and is kind of the center of all action in Manhattan on the parks Department about the vet that same question, ken where they had told us in good faith. I'm sure that detour that was going to take cyclists off of the Greenway and inland for a period of unclear how long a couple of months was going to start a several weeks ago and they started putting up the signs for the detour and then it did not happen. I inquired and learned from Steve Simon, as Ken mentioned here, that it's, the contractor somehow did not line up subcontractors and was not able did not start the job when they thought so. The detour signs apparently, are not there to confuse anybody any longer. They were just there just a short time with the anticipated detour that when I asked Steve on Thursday, hey, what's with the subcontractors, when does anybody know when that project is going to start? Steve's answer was no, they do not know the answer. It is just a few blocks. I mean it's sort of crazy because of the way the cherry walk is configured because you can only get on it at 100th and off it at 125Th and the whole cherry walk is going to be detoured, even though the work is just for a few blocks, and if this is work being paid for by Fema on damage to the Rip rap that is attributed to super storm, stupid, superstorm, Sandy, but anyway Ken the short answer from Steve Simon last week to the same question that Jeff does not know the answer to was nobody knows the answer. You got more, I had something on central park, but maybe I'll save that for the updates. Okay, anybody else Jeff, I mean Doug Kleinman. Yes, thank you. I'm glad Jeff's here, thank you and, if you've ever, if you've answered this stuff before I apologize, and so this is about Riverside park I'll, just a few items that I'll just sort of rattle off real quickly on a lot of the park benches. I've seen that there appears to be algae or mold or whatever on many of the benches, particularly in the area of let's say 73rd to 7th Street and a lot of the wood seems to be splintered, and I'm just wondering if there was a plan and why did they get that way? It seems like whatever some flaw in perhaps in the in the design. So that was one question. Other question, as I've noticed some really wonderful, happy people enjoying the park, but I saw a couple of things that were concerning to me some large group gatherings that I do not know if there is a policy for social distancing, but I saw a group of about 22 people together closely convened all drinking alcohol by the way and they unloaded all of their bottles of wine and beer in the garbage. You know pals right at 74th street on Riverside and at the same time, another group had these large tire, large knobby, Tired, E- bikes that were just going back and forth in the green area, which I think is not good for grass and was ripping up look. It could rip up the grass and lastly, I noticed, and then this may extend beyond your purview, but still some of the entrances to the park do not have curb cuts, particularly, I believe it's on the 70 south side of 74th, where there's a curb cut that needs to be repaired for handicap, excess, ADA accessibility, and that's it well. I think doug. The last thing you're probably right is the curb cuts, probably outside of Jeff's purview but Jeff. What can you tell about algae large groups- and I mean e- bikes or any any powered bike, whether it's on grass or on paved paths shared or not, are illegal right now, but they are rampant in the park and not and not just bikes, it's scooters and stuff. But Jeff can you say anything on the lawn just not even talking about the lawn yeah. Once, okay, so the first one with the benches at 73rd, the 77th, you know you're seeing green stuff on it. It's probably some kind of you know, maybe like a natural algae or fungus or something. But I've made a note of it. You can power watch, it should come right off. I've seen it when they hit it with the power washer for a little while just it just comes off pretty easily so so we can. We can power watch this, so I made a note that we can get to those and see how they look. They are. They are splintered too. It seems like there's a lack of a coding or something that I do not know. If there's a you know, a general plan for some of the benches are new and are very smooth. They seem to be coated and others are raw and now are splintering, so they concrete benches by the way. Do they have the concrete bases or they got the metal frame? Metal Frame, metal, okay down, oh down at the river or higher up, are not they all world's fair benches, with concrete base there they're iron, because when I've sanitized them from when my parents are sitting there, they're wrought iron. Okay, if they've got splintered slats, if you got any pictures, if you ever want to send me a picture, definitely send me a picture. I replace any splintered, splats I'd love to know from anybody. If I have any benches with splintered slats we'll. Definitely you know remove what we could. It's called a laceration hazard or a pinch hazard so definitely want to get those out of there. Benches are notorious for having them, and you know it's like trees like I try to check, trees and benches and I'll never see all there is to them when it comes to like little stuff like that. So if you see anything, definitely send it to me and we'll you know, try to take care of it as quickly as we can. So we do not want people getting injured on the benches. That's always a big problem throughout the city when that happens, and we never like it to happen. The group at 74Th, Street I'll let pep know what day was that by the way. Do you know if you have it? Was it on the weekend or was it a week? It was actually this past Saturday, but over the last preceding three or four weeks I just I, the question really was. Obviously alcohol is not allowed dewey. Is there a policy or is there a law, whether you know it with the city that there's a I do not like? I do not know if these people have been. You know. 22 people which I counted were are all family members and have been living in the same right, so they're all safe or they're, not and I, but I just could not help of observing it and it looked it looked a little scary to me again, reach out to me. Pd does not like to enforce this hard and neither does park enforcement. So the best thing for them do is to approach the group and hand out masks. Pd often groups know the rules and so they'll say we're all family members. They may not look nothing alike, but that's what they will say and they know that's. Those are the magic words to say. If you want to get away with this so, but mainly, we want people to be safe, so if we hand out masks and then, of course, if this is alcohol, they can issue oat summons for alcohol or ask people to remove it or both, but we definitely do not want to see alcohol in the parks to a lot of extent everything's. So that's those are the best, but you can reach out to me who's over large groups and I'll send someone right away Jeff. I would just interject personally that I think that having our people, our city workers, paid to stand there, some of them not wearing masks themselves, but handing out masks is, in my view, as a taxpayer, a waste of my money, because if people are down there without masks, it's not because they do not know they're supposed to wear masks and it's not because they can't get a mask, but Susan yeah. Doug, I know what you're talking about on Saturday night, we were walking acrosss the park and in central park at the turtle pond, just north of turtle pond below the great lawn was a rave of like a hundred young people who could not possibly have been related more than 100, perhaps, and they were dancing around no one wearing masks, alcohol everywhere and plumes of pot smoke. So it's not hard to see that there's a lack of control- and I know the pep officers are in short supply. It's hard to imagine. If I'm a pep officer, I would not have wanted to take on that crowd. That seems like a 911 yeah, but to your other point about the e- bike on the grass just this evening, during a walk between 5 and 6 P.M in Central park, our regular route down to the pond and back passed, I think five people smoking pot and then saw three or four bikes on the grass and then counted. I think 15 bicyclists on the paths, so not all of them e- bikes. So what can you do? As a question are bikes allowed- and I should know this really but are bikes allowed in the area of Riverside park, on the on the walk where on the pathway, where people are walking that this is right off of Riverside drive, you mean you mean at the high at the level of the park, the upper level right. Yes, the answer is yes, Jeff right, yeah, okay, yes yeah! I mean there are certain areas down at the river that the famous rosenthal bypass, if you've not been with us on that in the last year or so doug, but again Doug. I mean we put up signs recently, no motorized bikes or scooters periodically through the park along the bike path and then inside in certain areas where bikes maybe come into where we think they've come into along the promenades. So it's hard to enforce, though, but the first part of enforcement is putting up notifications like signs, and so you know, a motorized vehicle is a motorized vehicle, whether it's gas powered or electric. But there is some gray area as for assisted pedal bikes, and so they go pretty fast too, but they're not as heavy as a large e- scooter or one of those large. I do not know how to describe it. Unicycle things that people have those are very heavy and then I've even seen people go through now with basically like the rebel type scooters like large motor school scooters that are, electric they're, very heavy. Whenever I see people stop with these things and they're in an area, I ask them: please do not operate that in the park, but that's about all we can do. We can't chase them down. You know we can't put up roadblocks or anything like that, and it's a tough it's a tough issue to try and solve. I. We just have to keep asking people not to do it, and then pep officers have given some oath summonses when they find these in there. Now, if you see someone with a rebel scooter in the park, if you get the license plate number and report it to Revel they'll, at least they say they they're going to block that person from renting their scooters for some period of time or something like that. There's a penalty, that's associated yeah. You know. The thing is when- and this happens to me and my husband, all the time we're down there doing an exercise, walk and sometimes on a you know, fairly narrow path like on the riverwalk and wherever we are, and one of these things goes and there's some pretty bizarre motorized vehicles too Jeff mentioned the unicycle type. I mean there and there's a lot of different bizarre motorized vehicles. I mean they go by so fast that there's no point in calling 911, even if you thought that otherwise there might be for something like these large gatherings, where there might be time for the police to get down there. When one of these motorized things whizzes by you and nearly kills you, you know, what's the point of even calling 9- 1- 1 with Revel, though- and I was not really going to go into any big discussion about this, but Jeff mentioned it one of once, they started re opening operating again and they called it relaunch about. Maybe three weeks ago, one of their drivers driving the wrong way down. Sixth avenue, which is an uptown avenue, nearly killed, my husband who was biking up sixth avenue. I won't tell you any more details, so I personally submitted a very extensive complaint to rebel Revel and the community outreach person or whatever she's called me the next day, and we had a very big chat about how Revel supposedly operates and as Jeff's- and we have seen- and I know Marcus said- he's- seen: Revel scooters, motor scooters in Riverside park and my husband and I have seen them as well. What Revel says is that their GPS software? What's the word not blinks pings every seven seconds, and if somebody is driving in a park or wrong way on a street, they automatically know that and they claim that, even without regard to somebody making a complaint with, preferably if you do with the and of course you can't get. If somebody's going past, you a million miles an hour you're not going to get there you're not going to have time to take a photo or get their license number, but they claim that even if nobody makes a complaint, they automatically record this violation and of that type that is riding in a park or wrong way on a one- way street. They automatically permanently suspend their their membership. I take that with a huge grain of salt we had talked and Elizabeth is no longer on the meeting now Elizabeth and I had been talking off and on with our transportation committee chairs about having a joint meeting about Revel now that it's relaunched, that has not happened yet. I think we still would like to do that anything else before we segue into. What's really not all that much of a segue which is other update? Sorry, I just want to say I have also noticed a lot of bad behavior by cyclists and motorized vehicle riders in central park and they're, maybe four or four times a week, and I do not think I've seen anybody on grass, but I've definitely seen a lot more people recently on pathways, going every which way on CitiBikes or other their own vehicles, and it's really out of control, and so I just wanted to echo Susan on that and also I would say that I would really advocate for more signage in all our parks, specifically about trash, saying that this is a carry and carryout area. I do not know if officially it has to be, but I think it would be really helpful to it might go some way in preventing people from dumping a lot of their picnic crash into you know the limited trash bins that the parks have all parks around the city. You know Jeff Richard and I were in Riverside park this morning, and did I dream this somehow I'm under the impression that somewhere, I was today- and I was only there- had some new signs on carrier trash out. Do you have those in Riverside now? Did you put something I'll check? Maybe I'm wrong. I do not. Maybe it's a dream. I do not know, but when it comes when it comes to signage, there's seems to be like this there's different philosophies of signage. Some it's hard to get the right amount of signage. A lot of people feel like the more the more signage you have better, but sometimes other people point to a city street where you're trying to drive- and you have you know- maybe a dozen signs on a pole. No parking here do not look, no left turn here, no whatever and it's hard for people to get a sense of all this information all at once, and so suddenly you have people making left- hand turns where you know they say they'll look up and say I did not notice the sign and it's clearly there. But it's all. It's got a bunch of other signs right there, so there's a there's sort of a philosophy that maybe too much signage is you know, is detrimental sometimes to getting the message. But, as we've talked about when we talked about enforcement of traffic laws in Riverside park the next month we talked about and had a resolution on enforcement of dog related rules in central park. We've talked about a number of other similar issues. Tonight, it's always you may have, regardless of the number of signs you have, and whatever else, there's always 90 or 95 or 85, or whatever people who will obey the law and do the right thing, but there's some percentage that no matter what you do are going to do, the wrong thing and your the bad actors are really the ones we're talking about. You know Doug identified some with these big gatherings in the park. It's the people on the crazy motorized vehicles. It's lots of other examples, some that we've talked about tonight and I mean it's like. As I said, what's the point of trying to hand out masks to people who are in the park and know perfectly well, they should be wearing masks and may or may not have one in their pocket but anyway, but thank you for all your input on this Doug I mean Jeff, which is very helpful. So moving on oh wait. I just saw something: oh yeah, Barbara Adler says she's seen Revels recently around 72nd and Riverside park, not surprising, although Iris said he has not seen many recently on the cherry walk, but yes bizarre vehicles, but not Revel. So when you got one of these crazy fast- moving motorized things, it's pure chance that you happen to be there when it's going whizzing by and we all have different experiences that vary from day to day. I guess so, some more updates and then we're out of here so phase I've got one anyway. That is real and then a couple of them that are who knows phase five of Riverside south, which is the area from about 64th street, to 68Th Street Ish long history going back to 1992. But it's been under construction by New York City for complicated reasons, make it different from the other phases of the park of Riverside South. We were told about a month ago that it was going to open on September 30th. I happened to be down there that morning there was no sign of its opening, and so I think I checked with either Jeff and his colleague Ben Cramer or Steve Simon or both anyway. The short answer to that is, after all, these years and all of these months of it's about to open it's about to open a single cell, I've declined it. A single electric meter had yet to be installed and approved by Con Edison before the park could be open because the lights could not be employed until that was done. So that was three weeks ago, and when I spoke to Steve Simon on our budget priorities. Last Thursday, I said again: hey Steve. What's with phase five, he told me and I'll take this with a grain of salt as well, but he told me that meter, even as we spoke or the next day, which was last Friday, was going in and Con Edison was going to have a look at it and they expected to open phase 5 after 28 years this week, jeff. What's your version of that pretty much the same in fact we're preparing to get it open on Thursday if we can so that's sort of like our target date right now, is to open it up on Thursday we're having our maintenance guy put up signs, so we're picking up signs tomorrow, he's going to get wooden posts and put them up, but I'm hoping for Thursday. So if you know it's really exciting and everything I'm very excited to have this open to the public, just like everybody else is so we will see, like I said, just keep your fingers crossed. I said I can never guarantee that these things are going to happen when they're going to happen, but I know that what Steven's time is exactly right. There were. There were two issues: one was the water and the other one was the electricity, and so I'm hoping short answer, I'm hoping that we can have this open on Thursday Steve said: there's not going to be much of a ceremony or even a virtual ceremony, but what we should all remember- and I think we've talked about this before- is there's some really wonderful features in phase five there's a new playground. Maybe the single most important thing is: there's a dedicated bike ramp going down from 68th street. That makes a big curve down from Riverside boulevard to the river. So it's a fantastic new, dedicated cycling access point to the greenway and there's some other. You know some other features in this section of the park as well. What there is not, however, is the from the beginning mandated comfort station, which was designed, but not ever bid. So that's why that's on our budget priority list that we'll talk about tomorrow? Other updates, I I'll do a couple of sort of depressing ones, or at least non- ones have been unable to get any more specific information about the Rotunda project that we all know about or about the Marina project other than what Steve Simon said to me in a communication last week is that there has been a halt, if I think I'm getting this right on any bidding on capital projects, even if they have the money, even if they have the plans- and I do not know if this makes any sense. But anyway my understanding was they're, not letting them go out to bid, and so I do not think we can assume that, no matter how far advanced short of a contract, any capital project was, I do not think we can assume that it's necessarily going ahead. You know at any time we can identify or in to the degree of detail and amount of work and nature of the project that that we looked at a year ago, two years ago, three years ago, four years ago and whatever mark do you have anything you want to tell us about the three resolutions we passed. I think it was three yeah it was and we sent letters on all of these I mean Mark appropriately notified our electeds. One was rules of the road enforcement in Central Park one was dog enforcement in central park and the third was it's a different category, but the third was trying to expand the no smoking laws in the parks to be to cover the whole parks and the latter one. I think we I mark between and I between us know a little bit and it's not encouraging. But Mark do you know any more than I know, probably not the the in reverse order: the smoking and the parks verge. There is a bill being carried by Peter Coo who's, the chair of. Is it the Parks Committee City Council, Parks, Committee, Parks Committee, and it's broader than the Le than the build that you were asking for because ours was or our board was asking for, because ours was specific to parks and he was trying to ban smoking in a broader swath of public spaces than just parks, and so we were sort of. So we wrote specifically to him to try to urge him to nudge our bill forward or treat our bill separately as a more doable request and they wrote back essentially to say hey. Why do not you join us and advocate for our bill and that's kind of where we are? I have not heard from any other electeds. The only person who responded to either of the enforcement resolutions over the summer was captain gallagher, who is the commanding officer of the Central Park Precinct, who invited me to go talk to him and we were going to talk about having a meeting with other folks. That has never come together, because captain gallagher is the only person. Who's actually responded to the letter or the resolution. So I guess we can have another conversation with captain gallagher, or maybe we can invite captain gallagher to a future one of your meetings in between or around the time that happened. The parks enforcement patrol budget was slashed to within an inch of its life, so whether that impacts the ability to have enforcement on these things. I do not think it changed in central Park for 2021. I think the central park dedicated stages anyway. That's all I know. Listen, I'm going to have to run in about 10 or 15 minutes. So if we could wrap this, we'll be done by then very good. Just one thing on the smoking thing we were asking for, and I mean the board asked for, which is that Mark Levine seemed a council member Levine seemed enthusiastic about it and did the first step towards getting a bill drafted, but the council people do not draft them themselves. They have some kind of a staff group that does that and what they came up against was whoever made these you know seem to be making these decisions was your no smoking and parks bill is subsumed in this. Much greater p, a broader piece of legislation from council member coup and the problem with that is Ku's thing has been introduced and around there for years, but it has not gone anywhere. It's not going to go anywhere because it's much broader and he does not have support, but levine was not able to get around thus far as far as we know, but there may be some more news tomorrow, possibly because I never mind, but I, if there is I'll, let you know could not get them to write. It could not get the people that write the bill to write it to get it introduced. So there is no levine bill for what we're asking for, because of the stumbling block that some powers that be think, it's encompassed in Peter Kuh's bill as a smaller subset of that and that one is going nowhere. Anybody else got any kind of updates because we doug needs to go and mark needs to go and Ken does can't you're on okay. Can you hear me yeah? Okay, because I switched microphones, maybe that's a little better good, but back in February the board passed. The resolution calling for the city to look at creating more cross- park, routes for cyclists and better signage for the existing routes and the creation of a task force between the parts department, the conservancy DOT and the central park precinct to look at the issue and report back. I think in our resolution we said no later than April, then something happened in March. I'm not really sure what that was, but like a pandemic yeah. Maybe that might have been it and but still we've been asking at our transportation committee meetings off and on of our Dod liaison colleen for updates, and there have not been any updates and it's been pretty clear that there has been no task force meeting and nobody's talked about it and then, at the last meeting, sort of very surprisingly and saddeningly colleen even said she did not recall agreeing deforming to being part of a task force. I went back to the to our meeting, which was a joint meeting in January of the Parks Department E.O.T and on a couple of occasions she said a task force was a really great idea and it's in our resolution, where we say that D.O.T pledged to create a task force. So it's almost a year since Dr Cameron was killed using the 96th street transfers and you know nothing has happened. So I'm just I'm raising that because I think it's really. I think, if there's any way we can, as a committee, exert some pressure. Can I your? I know nothing different and I'm equally discouraged on that point, but I think there's a broader point here I mean the negative way to look at it. Is we knock ourselves out and we have these meetings and we have very thoughtful discussions and we hear our community and we carefully craft resolutions and we send them to the right people and we do everything right and nothing happens, and we've talked about four different resolutions that have come out of our committee in the last year that one being just before the pandemic and the other three much more recently where we do everything right and then nothing happens, and so that's pretty depressing, but I think the other side of it going back to how we started tonight is one of the things that I really hope we will all do going forward more than we have done so far. There may be nowhere to go, but is to really collectively try to think of and add how we can advocate more effectively when our board passes a resolution or takes a position has come out of our committee to make it happen. You know Mark's doing the right thing, we're all doing the right thing, but it's it all goes nowhere and I'm kind of hoping going forward that we can turn more of our resolutions that seek changes in one way or another in somebody's behavior in New York City into some kind of noticeable effectuation. I guess is the right word on that depressing note: does it we know Doug has to go, Mark has to go. Mark was probably up all night dealing with the document. I sent him on the DNS, but it was among others yeah among others. Anybody else anything tonight. Otherwise, we will convene in now wait a minute thanksgiving we're not in the way of thanksgiving. Are we not that anybody's doing thanksgiving this year either I'm not but can't, but for the third Monday 6:30. So that should not be a problem. I think that's the 16th you're a week and a half away from thanksgiving all right. As I started out saying everybody, please come virtually to the virtual steering committee to meeting tomorrow night and please advocate for high rankings for all of our committee's many projects. We're going to see the list soon, that's it I emailed it earlier tonight. Thank you all right.",
            "summary": "Teams, yeah we've changed teams right of all in some way, the same team That runs Riverside park,, hey guys how you doing hey good to see you am I late, no exact, okay, although, as committee members we're still looking for Doug and Natasha and Elizabeth We got Natasha, so we shot.\nAnd I, do not think there's anybody who's with us who does not know this, but this is the October meeting of the CB7 parks and Environment Committee Tonight and relatively few attendees, except for some really welcome loyal members of the community because we do not have a.\nThe first most important thing tonight is that tomorrow is the steering committee meeting at which the steering committee ranks overall for CB7 our budget priorities both on the capital side and the expense site.\nZoom it'll, probably be more difficult, as all of our meetings are probably more difficult to unzoom, as has been the case in past years because of the very large number of capital projects and even expense items that we have in our committee and because we are lucky enough to be able to get input back and forth with the Parks Department, which happened very recently, and the timing issue and all sorts of stuff.\nIt was a very big deal to update the district needs statement that we talked about last month to reflect all of the issues and concerns and changes and problems we have from from Covid-19 that are still ongoing, and some of them are getting better we're getting some composting back We're getting some other stuff back, but the focus of the DNS itself.\nWe also learned just the end of last week that the Parks Department has handed us some new capital priorities that we did not realize that we were going to have to deal with and just to be really brief about that, specifically two comfort stations in Riverside park, south that were always since the beginning in the early 1990s, when the plans in general for the park were approved, comfort station down at 62nd, street.\nThat had been our committee's judgment and rankings in prior years to the extent, which is mostly that they have not already been funded and graduated from our list and finally, in light of Covid-19 and in light of the use of our parks and primarily Riverside parks that we now see to try to rank them in a way that takes into account the needs and concerns of the greatest number of parks.\nIt's really important that all of our members attend the steering committee meeting and help me and Elizabeth Advocate for the parks items, because what happens is- and some of you have been at that meeting in the past and Ken certainly is familiar with it.\nSo you know I do not think we need to have a very long discussion on our first item, which is, I think , it's written generally as committee operations and plans or something I did want to remember, to say one thing that I said only at the end of last week's last month's meeting, which is our thanks to both Matt Genrich, who normally joins our our committee, meetings, Matt, being the manager for Dpr of District 7 and everything in our district other than them, and in another district as well.\nNo, so I just wanted to start out on our first more general item by saying that One is trying to increase our committee's environmental activities, focus on environmental issues.\nThis has been following issues of trash: collection, garbage, And I'm, not sure, natasha, whether you're now our compost person as well, but that you know We started that a few months ago, because Natasha expressed an interest and having somebody who's specifically charged with and has undertaken to kind, of, follow an issue and perhaps expand or contract the scope of the issue.\n, see your hand, but let me start off with a couple Natasha first, I want to say that, when, following up on our discussion last month, when we talked about the DNS and the impacts of Mr new statement, impacts of Covid-19, we did include some.\nThe other thing, I wondered if, in the conference you attended, if they, if anything was said about the big bellies and how helpful they have been, is the solar recycling and how they hold seven times as much as a city trash basket.\nBut may I just say one other thing I and it has to do with last month when I made a little presentation about Theodore Roosevelt park and and the planting that we want to do in conjunction with the noise from the foreground.\nWe've also been trying to, and I think somewhat successful in getting such issues brought to our attention by members of the committee, so And, you could probably do a good job of it yourself.\nI assume it's probably done in Riverside park as well, but certainly in central park might be an interesting thing to weave into this kind of like water management and preventing flooding, especially in the pond in the southern part of the park.\nYou would propose boxwood for the latter area and Daniel Atha who's a horticulturist, I believe, with the botanical garden, talked about that plant We decided to go with presuming this moves forward because we're looking into some other ideas now that might be more effective or a combination of a few together, but the wax can't think of what they're called right now, but the those evergreen Wax berry bushes, whatever they're called, which make a dense edge and are easy to care, for we are definitely going with those instead of what we had proposed in the which was boxwood for the front fence and whereas you know we're still looking at the arborvitae for the back wall.\nBut I know that the people on 81St street have been trying to get some kind of soundproofing.\nDo hospitals just throw them out or they have to put them in a medical waste container Jeff, I'm in rivers, as you know, in Riverside park, very frequently, The mask issue than discarded masks.\nI mean I've, seen it people shopping once they get out of the store they throw it on the sidewalk and keep going so You know my concern.\nGuess that's a little bit beyond the purview of this committee, but it's yeah, It sounds like it's pretty believable for the whole city, which is you're lucky, if somebody puts picks them up off the street and puts them in the trash.\nI, think Jeff Hannah's talking about a different area, we're not I, mean the stuff at 59th street and that detour that put the pedestrians in The That's been way before October.\nIt's really clear what the decision point is, and maybe just even a greenway north sign to the right, because that's essentially, unless you're going to 72nd street, which very few people are.\nYou know pals right at 74th street, on Riverside and at the same time.\nI would just interject personally that I think that having our people, our city workers, paid to stand there, some of them not wearing masks themselves, but handing out masks is, in my view, as a taxpayer, a waste of my money, because if people are down there without masks, it's not because they do not know they're supposed to wear, masks And, it's not because they can't get a mask, but We were walking acrosss the park and in central park at the turtle pond, just north of turtle pond below the great lawn was a rave of like a hundred young people who could not possibly have been related more than 100, perhaps, and they were dancing around no one wearing masks, alcohol everywhere and plumes of pot smoke.\nBut to your other point about the e- bike on the grass just this evening, during a walk between 5 and 6 P.M in Central park, our regular route down to the pond and back passed, I, think five people, smoking pot and then saw three or four bikes on the grass and then counted.\nAnd I, should know this really, but are bikes allowed in the area of Riverside park.\nI mean we put up signs, recently, no motorized, bikes or scooters periodically through the park along the bike path and then inside in certain areas where bikes maybe come into where we think they've come into along the promenades.\nIf you see someone with a rebel scooter in the park, if you get the license plate number and report it to Revel They'll, at least they say they they're going to block that person from renting their scooters for some period of time or something like that.\nSorry, I, just want to say I, have also noticed a lot of bad behavior by cyclists and motorized vehicle riders in central park and they're, maybe four or four times a week, and I do not think I've seen anybody on grass, but I've definitely seen a lot more people recently on pathways, going every which way on CitiBikes or other their own vehicles, and it's really out of control, and so I just wanted to echo Susan on that And also I would say that I would really advocate for more signage in all our parks, specifically about trash, saying that this is a carry and carryout area.\nIt might go some way in preventing people from dumping a lot of their picnic crash into you know the limited trash bins that the parks have all parks around the city.\nYou know: Jeff, Richard and I were in Riverside park this morning, and did I dream this Had some new signs on carrier trash, out.\nA lot of people feel like the more the more signage you have better, but sometimes other people point to a city street, where you're trying to drive- No parking here do not look, no left turn here, no, whatever And it's hard for people to get a sense of all this information, all at once, and so suddenly you have people making There's sort of a philosophy that maybe too much signage is you.\nWhat's the point of trying to hand out masks to people who are in the park and know perfectly well, they should be wearing masks and may or may not have one in their pocket.\nBut, it's been under construction by New York City for complicated reasons, make it different from the other phases of the park of Riverside South."
        }
    }
}