{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "2020.09.29 - CB2 Executive Committee Meeting",
            "publishDate": "2020-09-30",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nExecutive Committee\\nTuesday, September 29, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Roll Call\\n00:02:40 - Approval: Agenda\\n00:03:04 - Approval \\u0026 Discussion: August 2020 Committee Minutes\\n\\n00:04:12 - Health, Environment and Social Services Committee // Recommendation to the New York State Liquor Authority for New On Premise (Full) Liquor License Applications:\\n - 86 South Portland Avenue, It’s Ella\\n - 68 Bergen Street, Barbalu\\n\\n00:11:05 - Land Use Committee // Recommendation to the Landmarks Preservation Commission for Certificate of Appropriateness Applications:\\n - 241 Washington Avenue (Clinton Hill Historic District) — Application is to construct a rooftop terrace with planters, fencing and a hot tub.\\n - 405 Vanderbilt Avenue (Clinton Hill Historic District) — Application is to construct a one-story rooftop addition.\\n\\n00:16:30 - Board Survey Report\\n00:28:00 - Economic Development \\u0026 Employment Committee Report\\n00:29:20 - Finance \\u0026 Personnel Committee Report\\n00:29:40 - Parks \\u0026 Recreation Committee Report\\n00:33:15 - Transportation \\u0026 Public Safety Committee Report\\n00:41:30 - Youth, Education \\u0026 Cultural Affairs Committee Report\\n\\n00:46:15 - Chairperson's Report\\n00:54:40 - Atlantic Yards, Quality of Life Report\\n01:02:55 - District Manager's Report\\n01:06:35 - Office Software Discussion\\n01:15:32 - Board Nominating Committee Discussion\\n01:17:38 - Statement of District Needs Discussion\\n\\n01:34:52 - Other Business\\n01:41:57 - Community Forum\\n01:46:41 - Motion to Adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "10/1/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 215,
                "um": 246
            },
            "wordCountFullTranscript": {
                "information": 39,
                "report": 29,
                "chair": 20,
                "work": 18,
                "update": 16,
                "youth": 15,
                "body": 15,
                "chairs": 14,
                "agenda": 13,
                "budget": 13
            },
            "wordCountSummary": {
                "report": 5,
                "type": 4,
                "past": 4,
                "work": 4,
                "survey": 3,
                "information": 3,
                "body": 3,
                "needs": 3,
                "budget": 3,
                "day": 3
            },
            "fullTranscript": "So it's a little difficult to do this virtually, but I'm going to take a stab at. I know: we've done it once so I'll, try it again, but let's ask the executive officers and all the chairs and coaches if they would go around, go around the room and introduce themselves starting with the first vice chair. If he's on the mr jordan as to be excused from the meeting. Okay great second place here: barbara zoller gringer. Second vice chair and co-chair of the parks committee good evening, everybody else would do it alphabetical order, so who's next alphabetical by first or last name alphabetical by committee. Ah, okay, thank you sure, but I would let the secretary go. First: oh hi, jessica, thurston secretary bill floyd chair economic development, employment committee, brandon smith, chair of health, environment, social services; okay, I guess it will be me. Carlton gordon chair, landmark, land use, denise peterson economic development, employment committee. Vice chair, I is read. It's okay. I mean we heard you. Thank you. I, like the jimi hendrix feedback. I decided to hear anyone from youth, education and cultural affairs you're on hi. I'm betty fry bush, chair youth, education and cultural affairs. Thank you, thompson manning vice, chair youth, education, cultural affairs, transportation, juliette cullen, chung transportation and public safety committee, general gilbs coach, vice chair transportation and public safety. Okay great, so we didn't necessarily get alphabetical order, but we got everybody. Can I have an approval for the agenda? I'll move to approve the agenda. Go for the only second any objections, any discussion any need for anyone to have any edits or corrections to the agenda. Hearing none so move. Does anybody have any corrections for the minutes of august 24th? I just have one on age, four, the chairperson's report, the second bullet. It says it's taken a long time to get an office of four complimentary staff. I don't that complimentary is the right word. It's really to fill the four positions, but isn't that what was said? I believe that's what was said. So we can debate the grammatical appropriateness, but I believe you recorded what was stated all right. Then it's fine! Thank you any other edits or corrections to the minutes from august 24th. Okay, great! Let's move right into the agenda. Item. Number four committees for action: first up is health environment and social services, state liquor authority licensed applications good evening. Everybody got two license applications this evening, neither of which had any community opposition or concerns expressed about them. The first one is 86 south portland avenue. It's entitled it's ella. This application is going to be a all-day lounge open for coffee and full-on premise: liquor, it's a they're planning to be open from 7 a.m, to 1 a.m, monday through thursday and tuesday and 7 00 a.m to 2 a.m, wednesday, to sunday they previously come to our committee back in February, due to a plan back then to have a pretty much the exact same concept at a different location. It was going to be at 347 myrtle avenue, but the plans for that location had fallen through to the Covid-19 19 pandemic. So the revised plan worked out and this location is not going to have any dedicated outdoor space and they're. We had a discussion about ADA compliance with them, they're working on it, they're working on trying to change the grade to the to the slope to get into the to get into the to the to the place so that it would be ADA compliant upon full committee discussion. The motion to approve was granted by a margin of 701. second location that we heard at our committee meeting is 68 bergen street in location is entitled barbalou. This is another full-on premise and you may have recalled the locations. Previously. There was called numero 28. It's a pizzeria was a pizzeria-type place. This is going to be a full-service italian restaurant they're, going to have the sidewalk cafe the same footprint as the previous tenant. They will be open from 11 a.m, to 11 p.m every day and they agreed to close the outdoor area at 10 p.m. We had some discussion about their employment and they indicated they were planning to hire 20 people. We spoke about local hiring with them, so the motion for that one was passed by a margin of eight zero. Those are the two applications that we heard: okay, great I'll, entertain a motion to accept the committee's presentation. I'm also approved mr carlton jordan ii. Barbara's grinder is any discussion on the motion. Any questions for mr smith yeah. I have a question. I'm just curious in the current situation with restaurants and indoor, dining and etc, and new places are seeking to open up. I just wonder like what makes them think they'll be more successful than all the places that have closed just wondering. Was there any mention of their particular plan or why they think they'll be successful or we're just talking about the particulars, I think, are you talking about either of the particular ones in particular, or just both generally was generally because so many places have gone out of business and they are thinking of starting. I just wonder what their thoughts are about, how they're going to pivot in this environment. I don't think that specific question was posed to either applicant. There was a discussion with the initial, the first applicant, who had been with the before us previously about the fact that they were moving to a new location and they're actually operated as a non-profit, so they're apple their. They mentioned that this would be a better opportunity for them, but we didn't go into significant specifics about necessarily why they think that or their business plan, but they definitely seem to think that, in terms of the that location, the second location on bergen street, the stuff was more about the the the sidewalk cafe area, because not with numero 28, but with the prior provider. There had been some concerns in the neighborhood about the noise that was coming from that area. Thank you, smith. This is bill. Clinton. Just out of curiosity, the discussion- okay, you mentioned was only about the sidewalk cafe, sell outdoors outsource cafe. Was there anything else that came up from the public or for the committee that there was discussion about that? We should know about. You mean aside from these two applications. There was definitely nothing in regards to these two applications. That's why, when, as far as these two applications are concerned, there's no other discussion. No, there was no other discussion that came up about these two applications. We really tried to delve in to see if there was anything from numero 28 or if there was any recent cons noise from that for the outdoor cafe, but there was nothing that was recent in terms of that place. Thank you any additional questions. Hearing none all in favor. Yes, I, yes, I anyone opposed any abstentions. Okay, unanimous! Thank you. Moving on to the next agenda item- land use, landmark, preservation, commission, certificate of appropriateness applications. Mr gordon, all right, thank you. I have two. Both of them are in Clinton hill, historic district and both are heavily approved by our committee. The first one is 241 washington avenue. The application was to construct a rooftop terrace with planters, fencing and a hot tub, and to install a screening around the existing condenser. Basically, this one is pretty much what it says: it's a they're trying to against use their rooftop for recreation and relaxation. There will be work bits being done at the roof to support the additional weight of the items that they're putting up there and they kind of make it a slope so that it will they're dealing with it. So it'll be comfortable. We looked at it and found that it was, you know acceptable. It would be seen a little bit from parts of the area around cliffvale, but nothing that was particularly distracting and we proved it 10-0. The next one is 405 vanderbilt avenue also over in clintonville, and the application is to construct a new one-story rooftop edition. Now on this one it will be it's a building itself is an old brick sort of, like you know, light brown, big building on vanderbilt avenue and what the owners want to do was to build a like. It is sort of a like. I said a rooftop will be made of metal basically sort of a darkish colored metal and it will be a will, be an additional story for it, which will be supported by the building itself by the I guess, the by the sides of the building and it we looked at. It is a little on the darker side, the only problem I only even say problems. The only questions we had is like. Perhaps it should have been the metal that's going to be used to get the for. The additional rooftop edition will be some of us. That will be a little lighter. I thought it should be more to match to the light brown big face, but we found that it was. You know it would be again. This was good. We found that it. You will be definitely seen from the community, but it didn't- and we just proved this one 11 1 0., so we asked for your approval on both items. Thank you, mr gordon I'll. Let it say a motion to accept the committee's recommendation. Betty fibers may get a second julian conan chung any discussion on the motion. Any questions from mr gordon barbara did any of the neighbors at vanderbilt avenue time in about this edition. What we usually required- and I understand by memphis- I remember correctly- was that and they were, we asked that all the all applicants notified and notify their neighbors so that they know what's coming down on this one. I don't think it's going to be too much of a problem, but we still accept they notify it. Our biggest concern with these additions is: will it affect the buildings next door on this one? It wouldn't affect the buildings next door, they'll see it, but I don't it's not going to be something that would affect, let's say, foundations or extensions. What we get sometimes are extensions at the rear going into what we call the the donut, so it sometimes will affect the buildings next to each other. This one is right on top of it, they'll see it, but we still and we always ask that they approach their neighbors and say hey this isn't coming along. You have any problems, I don't believe we received. We did not receive any information or complaints from neighbors on this matter, but either matter any additional questions. For mr jordan any further discussion hearing, none all in favor anyone opposed any abstentions. Okay looks unanimous to me all right. Thank you very much. Thank you all right, close to class. I need you to go back on. You go back on you! Thank you. So if I just if I could for a minute, I need to just alter the agenda for a moment before we get committed get to committees to report. As part of the chairpersons report, I wanted gustavo to give a report on a project that he's undertaken that I fully support to help us get to know each other. I think at different periods throughout different leadership, either through the time of mr dune check mr dudes chairmanship, ms mcrae's chairmanship different portions different moments that I can recall where people have said. You know what are the expertise and the skills or what are the makeup of our respective community boards, and so the executive committee should have received a survey that gustavo put together to help us get to know each other and better understand the makeup of the skill set. Maybe some of the areas just different demographics, of the board, members that represent the various areas, and so with that. I want to turn it over to gustavo, to have him, give an update and maybe greater insight around that, because the young man needs to go to class and we want to make sure he can get to class on time so gustavo the floor is yours. Thank you, mr singletary you're. Welcome! I'm you. Can everyone hear me? Okay. So first I'd like to thank the executive committee for taking the time to fill the survey, and you know thank you, everyone for having a full response rate, and so this is the first executive committee survey for Brooklyn community board 2.. Some of the key findings from the survey were that you know the board. Leadership represents the diversity of the district neighborhoods and demographic changes, as well as education in the district in terms of neighborhood composition. As you can see, the executive committee represents the diversity of neighborhoods, there's no neighborhood overly representing in the district in terms of the interest in the district. Almost all of the members live in the district, except for one member who used to live in the district but still has still works in the district, and many have significant interest in the district as well. In terms of demographics, as you can see here, 75 percent of the board is 56 and up in terms of gender. It reflects the district and the city's trends where there's a slight female majority in terms of race and ethnic heritage. There is a slight majority of black and african-american representation same with residents type, there's just a majority of members who live in co-ops, but there is still some diversity in the type of residence members live in, and so as well as educational attainment. The board is very educated where about 75 percent of the members have a bachelor's degree or others, and so now the employment and professional background. Fifty percent of our members are retired, but the other fifty percent work in various other different sectors which bring which bring various perspective to the to the board, and these are some projects and topics that members highlighted that are important to them. Some are education, some are affordable, housing and some topics reflect the current situation we are facing and in terms of next steps I would like the the executive committee to you know, move into allowing the full board to answer this survey and kind of reflect the different diversities of the committee of the board gusavo. Thank you for that presentation. Some of the questions were, I thought insightful. As I was going through the survey. I guess it would be helpful at some point. We need to talk about how we can get this information to the executive committee only because I personally believe that some of the results are very insightful. I know that we gustavo went through this somewhat quickly, and so I did mention he's trying to get to class, but if we do have a moment- and I think decide if you have another two minutes or so to spare, let me just pause and ask if there are any members, any board members executive committee, members who have questions, could we look at the second page again the key findings? Gustavo, it's jessica. Will you be sharing this with us after or did it go at night yeah? I will be sharing this afterwards. That'll be great. Do you know if all the executive board members filled this out, because I don't remember filling it out I might have, but I don't. I don't remember it. Yes, I believe the executive committee has 14 members and I received 14 responses. May I make one suggestion it's jessica. I think my answer is represented, which will get to my suggestion, but just on the question about professional experience in our jobs, I would just if we do send this to the full board. I would just add, like the private sector as an option on there, because I don't think that it was so. I feel that other just a recommendation. Thank you sure any other questions or comments hi. First, I want to compliment you guys. I think it's a really good piece of work and and foundational and important for us moving forward. I'm wondering how we hope to use this information, but specifically, I think, since myself included, half the people are retired. I think a good sub question to that would be what fields we were in before we retired, because many of us continue up in our fields and have specific knowledge, space related to the field blue and before we were retired okay. I guess I could create another question where I ask of previous experiences or previous knowledge of if you have of a sector. I could include that as well. Yeah I mean this is great work. I really love it yeah. Thank you, thank you and I guess to the chair and everybody like how what is our thinking about how we're going to use the information? I mean it kind of shows what we know intuitively about our other colleagues. But how are we going to use this to catapult that work forward? Well, I would differ a little bit betty in the sense that I don't know that, there's any intuitive information that exists there when you think about it from a larger perspective, given that there are 50 board members, then we have a larger catchment and it becomes probably less intuitive. I'm not sure that in some cases you know looking at the educational attainment that just got with this novel. Just moved from that. I knew that any of the executive committee members had a series 7 or 63 right, so that there are things that you learn from it. What it does for me is: it gives a chance to really look at the composition of the exec committee and the board and maybe, in some cases, help to facilitate the type of interest that people have maybe a way to engage in the type of questioning that would lend to other projects that we want the office to take part of, but I think right now for me just to kind of get the ball rolling so to speak. The initial information that gustavo was able to share or capture through the questioning, was a good test population, because when I asked the scalpel to do is use us as kind of a qa for the research and then given the feedback that we're getting tonight, which is all valuable, then we can roll it out to the larger group on the rest of the body and I think that's where it becomes more resourceful and maybe a little bit more robust cool yeah. Thank you. I think lenny and gustav, I think, was a very nice idea. When I saw the inside come over. First, I was laughing to myself. I said with this, but after seeing what he put together from the responses good now, you're gonna know your members, that's the goal carlton! I just wanted to see the educational page again. If you can't bring it back up, don't worry, I'm just curious. So let me just say this gustavo before you try to bring it back up. Let's let that pass for a minute. I am going to work to have gustavo, send it out to executive committee, so rob and everybody will work with to have it so that way you have a chance to go over the information a little bit more. I do recognize that we somewhat breeze through the presentation and I think largely it's because gustavo needs to get to class. We don't want to stop him from getting the clock, but we will. We will get this done and cassava from me to you directly job well done. This is your first project and we're proud of you. So go to class, don't be late, don't cut class and we'll talk later. Thank you so much again, thank you. Everyone for allowing me to alter the agenda, to accommodate gustavo and for the feedback I'm looking forward to what this could, what kind of insight we get when we open this up to the general body, so in line with what we have on the agenda, because the scott gustavo's report was going to be part of the chairperson's report, so that took one less item off of my topic. Let's go back to the agenda as laid out item number five committees to report. Let's start with economic development and employment hi bill Florida here chair economic development, employment. I gave my committee report to the full board, but since then, I've been reaching out to the business improvement districts and small businesses in the area to find out where they are and what's going on as far as how they're handling the covit the lockdown and how business is doing in general, I'm probably going to be reporting that to the committee and I'll be discussing that during the next part of the discussion, which is the statement of district needs. Currently right now we have some additional things going on. As far as I want to do an update on the resource- fair, that's going to be happening at the Brooklyn navy yard. Right now, that's been on hold and I'm going to get a report on that and also another report. That's going to be coming tomorrow from the downtown Brooklyn partnership and I'll be reporting both those things to the the committee next week and that's my report. Thank you bill any questions from executive committee, members from mr flanoy, okay, great next committee to report finance and personnel. So I know mr jordan, it was excused from tonight's meeting rob do we have any written report or any representation from finance and personnel, not that I have received okay, no problem next committee to report parks and recreation, barbara zalagringer. Thank you, mr chair. Our committee met on monday, September 21st. I was pleased to report that parks are now open. Certain events are limited, but at our meeting at the beginning of the summer, where a while back you know it was all about parks being closed. So it's wonderful that we were now at this stage and I hope we can continue going forward. We had two presentations, both very interesting. One was on the photoville, exhibit we had one of the co-founders, laura romanos who presented on it and if you haven't seen this exhibit it opened a couple weeks ago and I believe will be on to the beginning of November. I recommend it part of it is in Brooklyn bridge park. I had gone to see the exhibit last weekend. I was in the park this weekend and there's still more that I hadn't seen a lot of it is in Dumbo, it's a fabulous exhibit that has a variety of themes. Obviously, some Covid-19 related some not, and it's really the perfect exhibit for this time. It's outdoors, you can walk around at your leisure, you can safely distance from people and it's a great exhibit probably seen photoville before this year. It's actually so far in four of the five boroughs and it's a great exhibit, so you really should get out to and look at it. We also had a presentation- I don't know if you're familiar with golconda skatepark, which is right near the navy yard boys and girls, club and sort of on the way to commodore barry park, and it's really wonderful how there is a group. There are volunteers through the new york city, skateboard coalition, their leader ian clark, spoke to us and suzanne quint, and I had met with him before at the park and they really look after everybody they're very much interested in the park's well-being in the skateboard park. Well being given that it's a skateboard park, it is open, year-round people use it all the time, one of their they're, also very interested in a number of improvements that the skateboard park needs and we included one of those in our suggestions for the district needs statement, and that is they have a bathroom there, but it needs to be winterized. I think the water freezes in the pipes in the winter- something of that, and so it can't be used. Bathrooms can't be used, but it's a wonderful resource and it'd be good if more skateboarders used it as their designated place, as opposed to some other places which are not really designated for skateboarders, and so it was a very robust meeting and that's the update. Thank you. Thank you, barbara. Any questions for barbara okay hearing none next committee is transportation and public safety, julia cullen, chung hi, good evening, everybody at our last committee meeting on the 20th we heard from rebel scooter. They have recently restarted operations after they shut down as a consequence of two fatalities. They had voluntarily shut down and they implemented various safety improvements to their interface, including mandatory training for everybody in order to restart their use of the rebel scooters and they went through what their operations were in terms of the improvements so that they could restart and they're doing a public outreach campaign to other community boards to let them know about this. We also discussed our statement of district needs, which we had previously discussed the month prior as a follow-up to that there were a couple questions about certain new york city, transit authority, capital requests that were on the prior year, but not the most recent year of budget priorities and caroline suggested that, because the mta is not a city agency that those had been removed, so we just wanted to follow up on whether those should be on our list of budget priorities or not, and that would include like capital improvements to york street station, for example, where we would be interested in getting better egress. We also had a couple of other ADA improvements on certain stations identified, so I guess that would be a question for maybe for rob or for lenny about just protocol rob what do you think? Well, a decision was made prior to the previous year's submission, based on the responses we had received in the past, as well as the follow-up with new york city transit. You know, transit is as carol and mentioned is not a city agency and their responses essentially said nothing at all. Well, they said contact us and when I did they the guy that they actually gave an actual phone number, apparently they never told the guy that they gave that phone number out that this was happening, and so you know, following that, a decision was made to not include them in the fiscal 21 report, but that's a policy decision that the board can discuss what you know. Whatever you see fit. I mean frankly, a lot of the answers without regard to whether it's a city agency or not, the agency responses are getting increasingly weak and non-responsive. Thank you rob so julia. I think you know we want to be a little bit more aggressive for lack of a better term and how we engage with mta. That's something the committee would like to do or if you and cheryl is chair and co-chair represent the committee in that fashion, I'm happy to support it. Okay, great thank you. You're, welcome any questions for juliet yes, bill. Flenoy chair economic development, julia in regards to the rebel okay scooter. I heard a couple things in regards to they were doing some safety protocols, also in which, if you were traveling along the wrong route, it would stop you or even slow you down if you're in a pedestrian area is that is that something that was with rebel or staff with another scooter company, so rebel does able is able to use gps to track its users and what it will do is if you're traveling down the wrong way down a one-way street, and that exceeds a couple of blocks. You know, if you do it, for one block: they're not going to do anything, but if you do it for a couple blocks, they're going to suspend you but they're not going to suspend you while you are in transit because that would be unsafe, they will suspend your ability to use revel after you park the vehicle they will also like. If it's raining, they would disable. If it's raining heavily, they will disable the vehicles so that they're not able to be used in the rain. They have a certain. They have different tiers of suspension levels depending on the egregiousness of the violation. If, if the violation is very egregious, then they will basically kick you off their system and you won't be able to use it anymore. Another safety improvement is that you have to take a picture of yourself with the helmet on in order to start the vehicle. So you know they're trying to address the the issues that cause the fatality in meaningful ways. I was going to ask you about the helmet, also about the photo. The other thing I was going to ask is apparently they're going to have live people also monitoring everything. Is that also something else they did encourage people to report on others? Basically, they do say that you know they don't have a way of tracking people using the rebels in the bike lane, but you can report that information without having to without being a rebel member. I did go to their website and I found it difficult to find that information, so one of the recommendations was to make that ability to report misuse a little bit simpler for just the regular public. Thank you very much appreciate that. Thank you. It was also mentioned in the committee meeting. Just as a report that councilman levin is requesting a bqe task force be established, and we thought that was a good idea. We didn't take any formal vote on it or anything, but you know we haven't gotten an update. We haven't gotten any information recently about the bqe and it's our top. It's one of the community board's top priorities, so you know we think that it would be a good idea to be engaging engaged about that. So before rob gives some context, neither has the board office. I've not received any updates about it either. So I'm not quite sure if there's been a lull in the communication about the project, I'm not sure if there are meetings taking place and we're just not being updated, but we're experiencing the same thing as the committee and so with that I'll just give you that from my perspective and then I'll turn over to rob to see if he may have some other insight to share, I will include that in my district manager's report. Okay, any other questions for transportation, public safety committee, juliette carlton here and not so much a question. I did hear back to revel of an accident. Well, it's not fatal. It was a serious enough accident. I heard it I'm trying to remember which I watched two channels. You know of news, as you know, and during the day, and it came up on either channel 4 or new york. One news I can't remember, but it did mention a another rebel accident, so you may want to keep an eye on that. Apparently, it's stuff's happening again with revel. I do want to say the transportation committee generally supports alternative means of transit. So if revel can get their stuff together and get and improve safety, we do support them and we do want to see them function as a as a viable alternative means of transit. Any other questions great. Thank you next committee to report youth, education and cultural affairs. Mr spybridge hi everyone we in our last meeting we heard from Brooklyn boatworks and gen vogt, so Brooklyn boatworks is cited in our community ward 2 area they're, not working with any of our schools in our cb2 area. However, they work throughout Brooklyn. They work with young people in grades five to nine, in after school programs, summer programs and so on. They teach young people to build boats, they teach them about safe boating, they teach them things like tying knots, which is an important nautical skill. Reading maps testing water and they were able to pivot during the Covid-19 to sending kids home to young people, so they could practice their knots and their other skills without actually being in a workshop and building boats. One of the young people, who was a participant in their summer program, talked about a four or five day trip on a boat with other young people and learning to sell and tie knots and read maps, and it sounded wonderful, but we do want to get them connected with schools in our district. We also heard from generation vote which not only helps to register young people in places that they are such as in parks and outside, but they work on, such as in certain type of elections to to lower the voting age, and they describe some of the recent problems that, during the cohort time that students who were registered in let's say some of the state universities who had to go home, they no longer could vote at home because they were registered at the address in their university. So they're working on these issues, they're a young group and very energetic and I'm sure, we'll hear more from them. So that's my report, any questions for youth, education and cultural affairs. I just have a question or a comment. Okay about the last part of what you said about students not being able to vote. The first thing that popped in my mind was can't. They still do a mailing vote. I don't know all the election rules, perhaps if they were like very motivated to check out things and to really push it. Maybe they could maybe the time that they came home was past. The time that they had to do the mail-in vote, as I said, I'm not certain, but they described some of those challenges for young people. Sorry, I don't have more information so betty this is this is let me I guess what I'm trying to understand is given the information that was shared and what was presented. What is the committee's desire? What's the committee's action item, to address that we didn't discuss an action item? Okay, so this is just what the report you just gave in this last point: is this more informational? Yes, okay got it got it: okay, any other questions for betty and youth, education and coastal affairs and darth dorothea. If you want to add to this, please do no, I'm good, nothing else. To add thanks. Okay, great thank you for all of the chairs and co-chairs for your participation in item number. Five: let's move on to item number six new business fiscal year, 2022, statement of community district needs and register of budget priorities. So, mr singletary, you and I spoke on friday and I think the schedule has changed a little bit and I don't want to step on any announcements that you're about to make. So maybe we should move this down to item nine other business and proceed to the chairs report. Okay, so we're gonna make that change to the agenda. Thank you for indulging us. The next item is chairperson's report. So a couple of things I want to just mention in consistence with the presentation that was given by taya during the last general body meeting and then the presentation that was given today by gustavo and some of the things that I know rob and the rest of the office is working on. What I hope everyone will see is that we're trying to take a different perspective for the information and the way we communicate and the transparency coming out of the district office. Like I said, I can't echo this enough that I'm really pleased the fact that we have a good staff and I'm starting to see- and I hope you see the same through the information- that's being shared the cohesiveness and the collegiality that is taking place and the type of information that's coming out of it and the fact that we're actually dedicated to working on projects I mean just today. Some of you would have received information from the office about a place to have a shared location, a shared drive to communicate information, hoping hopefully this will drive us to even more of a paperless environment, and so that we do our part from a sustained sustainability perspective in the other aspects of what a shared drive could bring to the office and to the entire board. In that same context, in that same vein, what I like to do is ask each of you that at your next committee meetings, advise all of your members, both board members and public members, and maybe anyone who's in the sound of your voice, that I've instructed the board office to not just accept and work on requests that are coming out of many different avenues. There are a lot of requests that are coming from board members, requests that are coming from the public and to keep the continuity and have the office run as efficient as possible. I'd like to make sure that requests only come from chairs and co-chairs. So if you would, please communicate that at your next committee meeting so that everyone understands that it is somewhat difficult when I, for example, as a chair asked to get something done, or even each of you as respected, chairs and co-chairs of your respective committees to get something done and the resources are being pulled for a request. That's coming from someone, that's not part of the executive committee, and so I'm I've made that decision. I want to communicate it with you. I'm happy to take a moment to discuss it. If anyone on the committee executive committee has a question or some suggestions, but that's the directive I'd like to communicate tonight, which I am doing so now and would ask that you communicated as well to your respective committee members. So let me take a pause there to see if there's any questions or anybody has a comment. Mr chair, this is bill right, just one question: for instance, over the summer we actually worked on the district needs and we sent that into the office to be actually presented to the exec committee and that came through my secretary. That's not an issue. Is it well it it's one thing to notify the office of information. That is what it is. What would be a problem is if somebody on your committee says: hey, do some research that I've done or something that I've I'm able to information I'm able to acquire because of my employment. Now I'm asking the board to go out and do a report on some information. I've uncovered or go out and create a survey for me. That's something I'm trying to manage. That's what I want to get control over if your secretary is submitting minutes or yes, the secretary is submitting information that is coming from an action that the committee took place. That's fine because I think today that's the normal channel for how information gets sent. I have no objection with that and, in essence, that's not really a request. So to speak, it's the type of information that we want. We do need feedback from all the committees for the statement of district needs. It's the things that are not normal protocol that I want to try to get a handle on was that good? Was that clear bill, beautiful clarification that I needed to hear from my committee? Okay, perfect! Okay, great! The next item I want to cover is we have representation on the board for people who represent the general body in the entire office for different committees such as atlantic yards 80 Flatbush? What I, what I need to ask is that each of you who do represent a committee or represent the community board on a committee that you submit a report. What I want to start doing as part of the district manager's report is having information and feedback for the members who represent us and if you're not submitting a report, if you're not submitting information, then that's an aspect of information. That's happening within the boundaries of cb2 that we're absent of, and so as you'll see in a minute as an example, mr smith always gives an update, and so I'm not looking for everyone to replicate, mr smith, but in your own way provide us with the information. So we can include it and make sure it's disseminated throughout the district, because it is important that we all have the information, and some of it may just shape the way we make decisions going forward, and I can't repeat enough absent of that information is challenging. Another example is miss galva. She represents us for a.d Flatbush. She doesn't take the time on the floor. The way we've allotted for mr smith, because once again, mr smith, is not a member of the executive committee, he does give his report on behalf of the chairperson's report, but she always gives an excellent update, sometimes in a short paragraph other times in a bulleted format. I'm not particular on how you give the update, I'm just particular that I receive and that the office receives an update, so we can share it with everyone. So, once again, I look forward to your support on that and I'll pause. Should anyone have any questions all right? Great? The last thing I want to mention before we move forward with the plan is that I mean with the agenda: is that from time to time we do have requests that come from very stakeholders in the community. Should you get approached by anyone either on your? You know travels throughout the district or directly as a response to your committee members and if it's something that is of importance- and you don't have necessarily feel comfortable- that it should wait until it shows up in some minutes or if it's something that you want to bring to the top of mind for both the chair and the district office, please by all means send an email into the office. Let us make sure that we can get back and respond to our stakeholders in a positive and hopefully an expeditious way, not that anybody has done anything wrong but, as I think about ways that we can be more inviting and engage with community. This is one of the things that I know has I've experienced in the past, where people will just approach you as you're traveling through the street, and they come to you with an issue, and I for one have been guilty in the sense that you know. If you approach me on a saturday- and I have some golf clubs on my back, I may not remember that until wednesday, when my brain is kind of oh I'm going back over what I just experienced. But what I'm starting to do now is take better notes and maybe put something on my phone as a reminder, and that way I can get it to the board office and possibly carol anne taylor. Someone can actually respond to the stakeholder constituents, so I just say that more as a reminder, not that there's anyone or anything has specifically happened, but using myself as an example. I just share that so with that. What I'll do is at this time I'll turn it over to mr smith, so that he can give his brief report and update accustomed to what he's done in the past. So, mr smith, once you want to mute yourself, the floor is yours. Oh hi, good afternoon, everybody we've had a few meetings at the quality of life committee, but the fact is we're on hold, that is to say, the four projects that are under construction are really the only things that are happening right now, for all the reasons that you can imagine, you know from the pandemic, but also from the from the real estate environment that we had gotten into even before the pandemic, and so there are just four buildings, all of which will be rentals. Two of them are actually in the ground or coming out of the ground. Rather the superstructures it is. I should have indicated the other two are in the foundation stage and should start to go up in the next in the next few months, or so. The we've talked about for a long time, the the issues with pc, richards and the site. Five development there's been no there's been nothing happening on that and there won't be anything even after the issue is resolved if there is no beginning of the construction of the platform on which site five will be built and although that's supposed to be should have been done earlier. Second quarter, you know the pandemic slowed everything down, and so we now know that there still isn't a isn't a contractor and really that's. Those are the most important issues where atlantic yards development is going to move much more slowly than we had hoped. The real question is: are we going to get to 2025 and have all of the 2250 affordable units done? That's the outstanding question. We've got several well 1500 or so to go and that's my report. Thank you, mr smith. Any questions from us this month. I have a quick question. It's just that kind of zooming out for a second. Sometimes I maybe this is just me in which case please ignore me. Sometimes I feel like I don't have a sense, a sense of the full project like that. You know I do hear these updates and where we are with things, but I don't always recall all of the different aspects of this project and I'm curious if we can either keep some sort of tracker or update on the website or in that shared folder, or there might be a time in the near future that we have like a 10-minute max presentation, just refreshing us on what we should be expecting and maybe how some of us can better advocate for you know where we see things falling behind or other challenges. I just don't feel like. I personally have enough of a grasp on the project as a whole to be useful, but if that's just anything so no that may not be just you. I think that's it's fair in other contexts, as new members come on board or new members, they may not have the context I mean mr smith has been representing city board's community for several years right now years, and so I'm sure- and you know, as prepared to see or has always been we may. We may already have something that gives you that context. So that's a good question to ask, but also he has a prepared statement, a prepared report that he was you know he's willing to share with community. So the board office has that we can get that out to you as well and then after looking over that and then, as mr smith goes through his archives of information. If once we communicate that out to you and everyone else, and you still have questions, we can definitely put the right presentation to bring everyone up to speed. But, mr smith, as I think through the question from our secretary, it might not be a bad idea and we can work with the board office to forget how we do this to give a general update just to the entire body, because the several members- and I believe it's been some time since you've had a chance to present to the entire body. It may be a good way to get everyone up to speed with the context of what the history is and then where we are today. So if we can, we can talk about that offline, but I think there's some good tasks that we can execute on. Based on the question from our secretary, okay, we'll circle back with rob and then we'll figure out a strategy. I think a lot of that. Well, we haven't had an update, you're right in a a while. It's just been sort of incremental stuff, but next round you'll have a an update of where we are where we got to go and we'll try to throw some visuals in of the projects that are completed where the ones that are going up are and so to give a more visual understanding of the project site and where we are, I mean I think, that's idea and we'll put that together. Fantastic. Thank you so much for that. Any other questions for mr smith yeah bill floyd again, just in context with or basically is it possible also to get an idea. What the original plan was? Okay from the very beginning and also the timeline they originally gave us for a completion just so we have an idea of just where we are that'll. That will be part of it. Yes, that was sort of what I was getting at the concept of showing the sites that are designated for development, those which have been and are going along. That way. So you know that's yes, that'll be done and to your question, rob I think, that's doable. I have a brief question is fiber. Thank you. As always, how is our school coming along? Is that in one of the buildings that's being built, you said two were being belt and foundation, we're calling b15? Yes, so that's moving along with excavation and that's, I know, I'm sorry we're a little further. Along than that, we've built out the superstructures topped out at 27 stories and the facade is underway, and so the school is moving along on the schedule that we've had and the real issue. There continues to be the fight with the community over the entrance to the school, which is going to be next to an apartment building and at an intersection where we've got. You know public services and there is no change in the and what the entrance to the school will be. That is an issue that the schools, the school's construction authority, is not changing, unfortunately, for the update, yeah and I'll make sure that in individual we'll make clear what what the school site is as well much appreciated. Thank you any other questions for mr smith. Great. Thank you, mr speaker. I appreciate it as always. Item number eight district manager's report, mr paris, so the big news since the general meeting is that the department of transportation is getting ready to repair the wall adjacent to the exit ramp from the eastbound bqe to hick street and old fulton street. If you ever take that exit down to the north heights, you'll have seen that the face brick has been gone for many years and they plan to they. The face brick has been gone for many years, but the structure is reportedly sound. They plan to repair that starting this fall in fact starting next week, and I will send out a notice about that. They will then pause during the worst of the winter weather and come back in the spring and complete the job. They did have a briefing for local stakeholders and it was a somewhat interesting experience in that. Unlike what your screens look like right now, if you went to the participant list, the only names that you would see were the people from DOT, so community members were unable to know what other community members had joined the briefing they also D.O.T seemed to be ignorant of the fact that ps8 plans to hold outdoor classes relatively close to where this work is going to be going on, including some jackhammering and community members use that to push for this request to have a bqe task force, something that juliette mentioned earlier. It was pretty obvious to me so then it's not obvious. It's an inference that whenever the com, the topic of the task force came up, DOT did not seem like they were ready to initiate that right away. The context of this work did get given me the opportunity to have a sidebar conversation with D.O.T about the larger project of what is going to happen with the triple cantilever, and this was an off the record unofficial conversation, but it was expressed to me that the agency has nothing that it is prepared to report publicly at this time. So I recognize what several people have said this evening that it's been a long time since the community, the community board and the committee have received an update on the triple cantilever and that fact is true, but it does not translate into a presentation being made in the near future. That's all that I have that is new, mr singletary, thank you rob any questions for the district manager. Okay, great! Let me go back for a moment. I just remembered something at our last general body meeting we saw a new colleague taya, give a presentation of the social media platform and some of the enhancements that we wanted to make, and I referenced that a minute ago at the conclusion of her presentation. There was a moment where I think the last page, or maybe the second to last page, talked about some expenses to cover for that it has turned out that as a result of some efficiency in the in the office that rob and caroline have, you know shepherd in the past that the final number, I believe and I'm going to bid on memory, was somewhere in the neighborhood of 1440. and as a result of the work that's been done. The only enhancement that we really need to make at this point would be the addition of a zoom license now in proper context. I believe when this was originally played out. This was at the point where we had some initial challenges with webex and, as you may recall, just as a refresher webex is the preferred platform of the department of information technology and telecommunication. Do it, however, in conversations I've had with the office, they are coming around that you know. Zoom is maybe the more user-friendly platform, but I believe from a safety and security perspective. Webex still becomes the preferred platform. In that context, the additional request that's coming from the office would be for 180 expense. That would cover the licenses for zoom. Now that we we're not quite sure if that is the platform that we're going to switch over to, I think, for all intents and purposes we remain committed to webex, but given that, from time to time the finance and personal committee struggles with ways to exhaust the budget for the for the fiscal year, this expense doesn't seem like the same thing. That's going to hurt. If anything it seems like it would help and being advantageous, and so at the most recent finance and personnel committee, there was a strong and, I would dare say, unanimous support to engage in acquiring the licensing for zoom, and so given that this executive committee is still acting on behalf of the entire board. From a voting perspective, I wanted to put forth this request for a motion and a second to give authorization for the office to purchase the licenses of 180 to go with the zoom platform. So at this time I'll entertain a motion bible second by mr gordon. Is there any discussion on the motion? Yes, mr p, thompson manning. Yes, I want to know the 180 of what period of time does it cover? Is it for a year or how does it work rob? Do you have that presentation in front of you? I don't recall the time period for that it's a one-year license. Okay, thank you! Ah lenny, since we didn't have I like the idea of having webex and zoom and it possibly, maybe the committees can use zoom, sometimes when, like we're having a meeting now on webex, but there could be another committee who would like to meet together for something can that be used. For that case, we will get in contact with rob and say it could be. Could we get together to have a discussion with something that we want to talk about? So if I understand you correctly in my own language, you'd like to be able to use zoom for an unofficial, get-together yeah, just in committee because sometimes juliet- and I would want to talk about something with our committee- we just want to meet. Is that possible so much where we have to make sure we request this time, thursday between one and two or whatever? It is yeah? My knee jerk reaction is, I don't have any you know. I don't have an objection to it right now. I guess what I'd like to do is just make sure that what you're suggesting is in accordance with the bylaws as it describes and that we work through some protocol. Where you know, obviously you would need to get the board's involvement, so you can get the license set up, but on the surface I don't have any objection yeah. Definitely we would definitely have caroline on with us, because she would set it up and we would join. You know it would always be with the board, but it's just it would be nice to have a platform where we can get together. Sometimes- and just you know, brainstorm some ideas. Any other comments. Any questions from executive committee members, victor executive committee, members, okay, mr chair: this is bill fenoy, again question. As far as the usage that's already been brought up already. I just wanted to know how it would be used by the executive committee or the board in general, and also the quest itself. It will be a reoccurring cost, or is this something that we're going to consider as we move forward and also currently right now? What's the surplus that we have to work with just in case something else comes up? So let me take the last question. First, we have more than a surplus. The 180 dollars for this year would be the equivalent of me asking for five dollars, so we're good financially. The second point to that is the general theme that was coming out of the finance and personnel committee and even from our own perspective is zoom has shown the tendency to be more user friendly, and so in anticipation of the way do it seems to be becoming more open and flexible to the idea of zoom, and once we can get to a point where, from a safety and security concern that they have, if we can switch over to zoom, then I think that would be something that would be widely appreciated by a majority of the exec committee and even the general body meeting a general body. I should say you know we become more comfortable with webex and webex. Is you know right now, not a then, of course, but therein lies one value added that we have with going to zoom and then the other thing is just a level of contingency right. If, for some reason we have issues with the webex platform itself, but everyone is having a fine, robust internet experience and we get into difficulties. This does lend for another alternative, and so those are the three primary reasons that came out of committee, but really expressed the view that I have from the seat that I hold did that answer my questions, sure any other questions from mr smith so sorry to circumvent. But mr victor had a point he wished me to raise and I wanted to make his voice heard because he's doing my commitment, absolutely yeah, so he wants to express the zoom platform is better than the webex platform in his opinion, because he feels it's ios friendly, as well as voice user friendly, a concept that I'm not entirely familiar with. But I want to express that. Well, the voice user friendly option is very helpful from an ADA compliant perspective. Oh that's what it is it's he didn't voice, but he said yeah. It came out nice in the in the text. I got it. I got it. However, there are moments where you get that, so you have to know how to really translate what's coming through, but it is once again use user friendly to tackle what was said earlier from all aspects of the user experience, and so I'm glad victor was able to communicate that to you and you can communicate that to us. But thank you any other comments or questions hearing, none all in favor, fine anyone opposed any abstentions. Thank you. Another thing I want to mention is we're coming close to the point in the year where we need to have a nominating committee where we need to go through our voting process, and so what I've asked the office to do was reach out to mr quint, who has served as our chairperson of the nominating committee and to mr smith, who served as the co-chair for the nominating committee in the past, as well as some a mixture of some existing and new board members, and so we're convening that committee. Now we are going to spend some time to figure out how we can utilize the environment that we're in today virtually and still be in accordance with our bylaws, and so with that I know we had a general body meeting last month. It was really just a touch base to make sure everybody was okay without what I was you know. Consider wait was that last month or this month I don't know time flies so much, but really it was just a wellness check. For me, I wanted to make sure we touched base. We wanted to know, make sure everybody was healthy and we could get a chance to engage with everyone. I am not going to extend a invitation to have a general body meeting in October so and those who are looking forward to having a meeting in October we're not going to have one but we're going to take the time throughout the month to explore what a virtual voting process would look like. So we can have the nomination and an opportunity to hear motions from the floor for any of the offices that require a vote. So once again, we're not going to have the October meeting, but we will have a November meeting and we'll take the time during the month of October to get back to the exec committee and to the general body on how we would proceed with having nominations. So those were the two items I forgot to mention moving right along. I will then now get this item back to mr paris. So we can speak on the fiscal year. 2022 statement of community district needs and register of budget priorities. A perfect segue, mr singletary, because the change in meeting schedule gives us an opportunity to re-examine how we want to proceed with the statement of needs and our budget priorities. Staff have been working with each of the committees on the narrative portions of the statement of needs and also their budget priorities, but we, as currently proposed the number of budget priorities has increased significantly, and so we need to sort of agree on a schedule and a process for determining what priorities to include how to rank the priorities from most important to least important, and to get some sort of approval for submission. The October 26th executive committee meeting is four days before the submission deadline, so that should be plenty of time to finalize, but we do need to have some sort of a process for deciding how to rank the priorities, decide what priorities to include or not include, and so that's what looking for committee guidance on. So thank you rob one of the things that I want to ask the office to explore. I don't know how many people, under the sound of my voice, have experienced this from exact committee perspective, but within webex they do have a component called webex event and within webex event it allows you to vote. So you can have a series of items in the radio but button format, and then you can on screen see the tally. That's one of the thoughts that have come to mind. That would allow us to have an interactive and engaging way of you know looking at consensus, as mr peres has laid out from the committee, and so you know we want to give a few more days to explore different options, but that potentially could be one way that we would be able to engage and look at a way to vote and make sure this consensus on the items and then still give us the platform to discuss and give feedback on the budget priority items. So one thing to consider and I'm happy to hear what others may feel, but there is an opportunity we think for us to make that work. I have a comparison. Well, I just want to add that taya has informed me that webex events are not permissible under the new york state. Open meetings law. Well, I'm sorry, I'm a little confused because we're on webex now- and this is as a result of the change for open meetings law- there's some distinction that she's making that I I'm not personally familiar with between meetings and events which are formatted slightly differently, but I don't have the technical. So, thank you for that. We'll discuss offline okay, we do like a survey monkey instead, then yeah we'll discuss offline. I understand the technicalities that prohibit one component of webex versus the other, but we'll come back with the suggestions of that. So is the whole board going to vote on this or just the executive committee. Right now, the executive committee is acting on behalf of the full board. That's what we voted on in March. Okay, I mean we one possibility is we can distribute digitally a spreadsheet that lists all of the budget priorities and people can rank them. We've done that in the past, with some success, but then last year we had a very low response rate and ended up just carrying over the rankings from the previous year. That's you know. That's one option. Yeah I mean barbara that you know right now. There's two ways: we you know we could possibly do this. We could possibly do it in a way that we get the information out to the respective committees. The committees can follow through with the ranking during their respective meetings. You know through a segmentation of the items that are germane to the respective committees, or we can go through the executive committee acting on behalf of the full board, which has been empowered to do, and you know communicate that way. My preference was to be with to be as transparent and as inclusive as possible. So maybe the committee approach might be the more ideal way to go, but once again we're still kind of feeling through what that will look like, and then we can come back with a definitive path to success. You know, I think the committee engagement this year has been stronger than it has been in a number of years, and I I'm appreciative of the effort that all of the committees have put into it. The step that we need to accomplish at this time is: how do we bring all that different committee information together and make it a single statement in a single submission right, and are we limited to 50 total priorities? We are list. We are limited to 40. Well, the system will allow you to put in more. The office of management and budget has asked us to limit ourselves to 40 capital, budget requests and 25 expense budget requests, and let me let me just add to that so before anyone goes away to your committees and discuss this I'd like to continue to adhere to that. So I want to make sure we keep it that concise. So the more that comes out of your committee, the more decision we have to make on what's going to stay in and what may not make it please, for all your respective committees have that robust discussion, but I'd like to adhere to that request. Anyone else with any comments or questions for I guess, I'm concerned about the time frame, the deadline. He said it kind of has to be by October 26 when the executive committee meets. I don't know how much time that gives us in committee betty. Do you feel like you're, you know the feedback I'm getting from the staff is that all of the committees have had detailed conversations about. So I'm not you know. Does your committee need additional time to discuss it was it was kind of mentioned that you want to keep, as our chair said, keep it very concise, 25, expense, 40 capital. You know not having so many priorities, so we might have to go back and say amongst our priorities. Maybe we wouldn't have all of them. I'm just wondering! Well wait! Let me let me just bring a little more clarity. The conversation that you're having at your respective committees and what comes out of those committees are fine. Okay, where we would trim the number down. Is this body? The executive committee would help trim those numbers down. Okay, thank you. I don't think that you necessarily need to go back to your committee and force them to or suggest to them that they need to alter change. What's come out, we just as a executive committee, need to figure out all right, fine collectively. What are we voting on and how we're going to rank the 40 and the 25 okay bill? Flinnoy question sure: okay, my question basically, is this very quickly, so we're just deciding just for clarification purposes, we're just deciding with our own within our own committee, our committee's priorities, not the board's priorities well or other commitments or other communities yeah. Here's the thing that the way you know we've always done it, and that doesn't mean that it has to be done. The same way is that the representation of the committees really would speak to the items that we submit as an entire board and so to break it down. So you can get the most robust list, the most robust discussion. We break it down within the purview of respective committees. If, for example, you need- or you would or any one of the chairs or co-chairs will request some support from the district office to be able to see how those items fit or not fit within what we've done in the past, I think we can offer that to help up, but once we get the feedback from your committee, then it becomes a question of how do we mesh it in to get it done to represent the entire community board? Historically, we've not had a problem with that. Historically, we've done well. We've been able to put information in there we've taken information that was probably from a previous conversation or a previous year's discussion, and it brought it back together. So we've not had any problems with that in the past. I think we can continue to do that successfully this year, but once again, I'm not. I don't want people or any other colleagues to walk away. Thinking that you have to go back to your committees and reduce your list. If you've already had the discussion- and you feel like what came out of the committee was appropriate, then you can consider yourself checked off and then now we move to the next phase of how does this body come away with the right listing to represent cb2? Okay. Thank you, mr parish. Already has my committee's suggestions. Okay, juliet it would be nice to get the list in advance, so we don't just do it live, but we have had it perhaps done ourselves prior to doing if it's the webex event or, however, it's going to be done in the October 26 committee meeting executive committee meeting yeah, absolutely that's what I'm, if you know just to be clear if we weren't clear but mr perez referenced, that we would compile this in excel spreadsheet and send it out. It would be well in advance so that there was time for everyone to read it themselves share with the committee and then, by the time we get to October 26th. Hopefully you know the heavy lift would be done and we would then be able to kind of you know, get to the finish line. So to speak, got it. Thank you. Sorry did someone else have a question: yes, yeah miss janner, oh perhaps the committees who have many items could put their rankings for the committee of which are the most important. So if anything gets dropped off it would be the one least important to them. Yeah, that's a good suggestion, irene! Maybe I'm you know this is me, maybe being a little presumptuous, but are the committee's not doing that now and if you don't want to you, don't want to say so you don't have to, but I would recommend that when we get the list out, each committee represents and rank your top priority versus your important priority, and that would help to make sure that at a minimum let's say we take the top five from every committee and then we negotiate, maybe the next. You know next tier, but everyone should really be looking to put what is your first tier in your second tier items? So thank you irene for that. Mr mr chair, I just want to make a note that the economic development committee will meet on the 6th, which is tuesday of next month, which is next tuesday. Okay. So if we're going to need that information to look at we're going to need it by that time frame, I think, given the size of the staff we have and where we've been moving, thus far, we should be able to make that deadline. Rob. Am I giving you too much pressure? Can we can we meet that challenge mission impossible? You have six seconds or this conversation will self-destruct. Well, I'm a little confused because I you know either the staff has been giving me too much of a overly positive report, but I'm I really question how much more discussion is required in individual committees. I think that work has been done and what we need now is a path for putting the information that we have together and before either the full board or the executive committee as the board leadership sees fit and then taking one last look at it on at the October executive committee meeting, and so let me that meeting's four weeks away, so you know split it in half two weeks and two weeks. So let me let me give this as a recommendation for those of you who are going to meet soon right and bill I'll start with you as an example of the priorities that you've submitted rank them for me, rank them from first to least, and then at least that will help us get to the path where we have what the top priorities are for the respective committees and then now that gives us a chance to try to put everything together. I need to make sure that, for the purposes of what I just agreed to juliette's suggestion the what the day you have your committee meeting and you come through with your ranks the very next day. I need that into the board office. Now your minutes may have to be in there the next day, but at least any conversation or topics that were discussed that are germaine to the ranking and the rankings have to be into the board office the next day to give us enough time to compile a list that we can share to the exec committee and be able to capture it that way. So, if I can ask everyone to do, that would be really important and helpful so betty before I come to you. Let me go to barbara, because she's been trying to jump in for two or three times and then I'll come back to you. So martin barbara, your mute bob, martin, your mute, I I've been having trouble hearing people keep freezing, so I went to my phone but anyway my committee kind of ranked thing when we went through the statement of needs, we looked at what should be changed or what should remain the same, and my guess is that what most people did and if there should be anything taken off or anything added. But what I will do now is before our meeting, hopefully by the weekend, send out our priorities back to my committee and have them look at them again and with the mindset if they need to remove anything, what would they remove? That's excellent! Thank you, yeah buddy yeah! I was going to ask the same thing because we aren't actually meeting before the October 26th executive, so I just wanted to make sure if it would be okay, if I send out a communication to my committee and ask them to respond accordingly. Yes, perfect! Thank you juliet! I think we did ours already, didn't we grant them. The previous rankings were on. I think it wouldn't hurt to for us to just connect and put them in the categories of top priority secondary priorities. [Applause]. I think we can do that. Thank you. Anyone else great. Thank you. Everyone in advance to your cooperation, I'm looking forward to making us get through the goal of having a full representation from cb2. So thank you next item on the agenda's. Other business. Is it any other business from exec committee members? I see betty it's fibers. You have a question or item, I have an item. It was communicated to me from one of the board members that we should have some type of mechanism to encourage students to attend meetings, since it's virtual on webex that there should be a process so that teachers and other youth leaders could let young people know about our meetings so that they could attend. It's like more practical for young people to actually attend online than when the meeting is in a place at night. So in general you know it's a potential idea and I responded that in the past we've always had students, like mostly community college, four-year college and graduate students. Let's say in journalism or education, have attended our meetings, but we didn't do anything special. We just you know, welcome them and so on so- and we toss this around in our committee a little bit should we have on the general announcement of meetings that teachers and other youth leaders, parents are encouraged to let their young people know about these meetings, so they could attend and maybe submit a report. Our committee does not want to be in the position of grading a report or analyzing it, because people come to meetings, maybe with different, essential questions or different things that they're looking at. So I don't believe we would be in any position to comment on their writing. I'm thinking of some type of statement that could go out when the meetings are announced that we encourage young people to attend and to register on webex and so on. So what do you all think? Can I speak first? This is dorothea when we discussed this. One of the things I said is that I'm not sure how we would get involved with asking students to do reports. That seems to me that's something that the educator would do now. I don't. I don't see a problem with maybe asking young people to advising them of our meetings asking them to participate if they would choose to do so, but I don't see us as a committee, as a community board going any further than that, because we're not teaching the children. What are we going to do with their reports? Why would who would they give them to? I just don't think. That's part of that should be something that we should do. That's just my opinion. I agree, and I think that came out in the meeting that we would not be asking for reports. Grading reports, analyzing reports totally agree, but that's up to the teacher, because in each class the students have a different type of focus on what they're learning from attending a virtual meeting, but my thinking was just to make it more obvious to anyone who reads our notice of meetings that students are welcome and leave it at that perhaps. But what do people think? So? I guess you know- and this is not going to be from the perspective of the chair- it's going to be the perspective from lenny right as a member I'm not going to, because I don't want to dictate this. But what I will say is I'm reminded of the old mantra that would come from my previous chair. I should say old. The mantra that came from the previous chair work is done at the committee. So if the committee wants to take on the work that is associated with engaging with the teachers and the youth leaders and the different youth committees that exist by all means, let's continue to do that as part of the open meeting law, our discussions and our meetings, particularly at the committee meeting level, because now the committee committees are meeting more frequently than the general body by all means. We definitely want to encourage participation from any aspect of the of the committee, and if there is language, that's being asked to accompany the general notice or the committee notices that amplifies the fact that you would want participation from educators, youth organizations and youth, that's fine. What I would caution or put out for discussion is when you have a topic or you have the agenda items, it is going to be incumbent upon the respective chairs and by nature of the co-chairs to ensure that there's an educational moment there, because, as you come into a committee code, you may not understand all of the items that are being discussed. So there's going to be that bit of refresher. But I think what you're suggesting is no different than what we've done and really is the foundation for how we push to get youth participation on the community board and as clearly as what you've had in the fact that you do now have a youth member. That is part of your committee. So if we need to make sure that I think the office already does this, but if not, we can check make sure that the surrounding schools, youth collectives, maybe even the fact that there may be a connection through some of the local churches and maybe even within the nicer developments that there's an opportunity for that information to be disseminated so that there is participation in this virtual environment. You know I, for one: don't have an objection to it, but how its structure and the way it works out. That's going to come from the committee, because that's where the work needs to be done, and then we can discuss it through the district office. So who would my next discussion be with? Because we do have some ideas and it would just be banette in the language of the notice. That goes out. You know the weekly update of which committee meeting so when our committee comes up, we could just have one or two more sentences in that blurb yeah. I would say just you know. Whatever your thoughts are, I would jot them down email them to the board office and copy me, and it will work through giving you know getting the right language to get out on your meeting notices yeah once we put that out I'll offer up to the respective the other chairs and co-chairs, if you'd like to adopt that same language for your respective meetings, we're happy to do so too. I appreciate it. Thank you. No problem. Anybody else, an executive committee with a other business item- okay, great community forum- so I am not clear on who is from the community and to be consistent with what we've done in the past. If you are from the community- and you do have a question or there's a topic that you'd like to have the community board respond to, I would ask that you engage through the chat feature within tonight's call. Please chat. Your name chat, the topic that you have and then we'll have our district manager call you to have the floor to speak. I remind everyone that you have two minutes once again. You have two minutes and the beauty I remind everyone of virtual is that we can mute you at any time. So at this point, anyone who has a question from the community, if you would identify yourself and the topic through the chat that would be greatly appreciated. Mr singletary pastor, zach martin has had a long desire to speak tonight. Pastor zach, how are you I'm good? I'm good most of mine are just announcements so just make it brief. So most of you will know if you've been in fort greene for the last few years that our community heroes project has been up and running in the park. It has been running continuously in fort greene park and it will be running again in commodore berry park. So I'm going to be getting information about how you can nominate a community hero because we're doing a project in partnership with fort greene conservancy as we work to honor our residents, who have stabilized strength and blessed and supported the fort greene neighborhood, especially as we think about what's happening with Covid-19. So there's a video option for you to video nominate someone looking for some brevity in that. But if you want to nominate we're, also continuing to do nominations in commodore berry park with the hope of having a spring project unveiled there and then I'll just make mention of as a pastor at recovery house of worship, with the weather. Changing we're always looking for ways for the community to support our efforts. We've seen our lines grow significantly with our food distribution, but we're also doing clothing distribution and we do showers for the community now in partnership with the bowery mission in Manhattan, and so we have community asks where people can check an amazon wish list to provide toiletry kits for folks in the neighborhood as we're doing about 30 showers a week for folks in the community, and we always need coats and shoes. So all that information is on our website. I'll have my I'll have my email in the chat, but you can also always support the work. We're doing we're serving about a hundred breakfasts on the sidewalk doing social distancing, masks, hand sanitizers all that stuff to protect our folks, but we're seeing those lines grow, and so we continue to do the work and recognize we have an opportunity to include others in supporting the work that we're doing in the community so just wanted to make a mention of those two things really grateful for this community board's commitment to continuing to do the important work in the midst of all this. So thank you, pastor, zach! What's your website again, okay, say it one more time, I'll put it in the chat. Okay. Thank you. So much of course, pastor zach. It's always a pleasure to hear from you. I'm sorry rob it's always a pleasure to hear from you. I want to thank you personally for all the work that you've done in the community. You're, not new to this line of service. God has called you to do a job and you do it. You do it well. So thank you for that. We appreciate it. Mr paris, before I tell you that there are no other hands raised, I did want to point out that back when you had to come to executive committee meetings in person. Often the only people we would see are oleg geyser and zack martin and they have continued to join us. Digitally and zach is the only person who has indicated a desire to speak. I'm pausing because I don't want to show my excitement and wanting to ask for a motion or something I'm a pause for a minute and just make sure I could take this in and that and mr guys are you sure you don't have anything to say and it's noah's acceptable answer. I believe he may have left the meeting by now. No, I think he's still here. Is he he's just a mute? Yes, I was unmute, I'm sorry now, I'm just happy to participate in the economic and development committee and I'm gonna bill I'll. Give you a call, send you an email regarding your list that you asked me for so. Thank you. We appreciate your participation. Thank you for being a consistent, familiar face with that I'll, entertain a motion to adjourn. So anyone oppose or abstain have a good night. Everyone good to see you we'll speak soon. Good night, good night.",
            "summary": "What are the makeup of our respective community boards, and so the executive committee should have received a survey that gustavo put together to help us get to know each other and better understand the makeup of the skill.\nSo first I'd like to thank the executive committee for taking the time to fill the survey, and you know thank you, everyone for having a full response.\nSome are education, some are affordable, housing and some topics reflect the current situation we are facing and in terms of next steps, I would like the the executive committee to you, know, move into allowing the full board to answer this survey and kind of reflect the different diversities of the committee of the board.\nWe need to talk about how we can get this information to the executive committee only because I personally believe that some of the results are very insightful.\nLet me just pause and ask if there are any members, any board members executive, committee, members who have questions, could we look at the second page again?\nIs: It gives a chance to really look at the composition of the exec committee and the board and maybe, in some cases, help to facilitate the type of interest that people have maybe a way to engage in the type of questioning that would lend to other projects that we want the office to take part of, but I think right now for me just to kind of get the ball rolling so to speak.\nLooking forward to what this could, what kind of insight we get when we open this up to the general body, so in line with what we have on the agenda, because the scott gustavo's report was going to be part of the chairperson's report, so that took one less item off of my topic.\nWe also discussed our statement of district needs, which we had previously discussed the month prior as a follow-up to that there were a couple questions about certain new york, city, transit, authority, capital requests that were on the prior year, but not the most recent year of budget priorities and caroline suggested that, because the mta is not a city agency that those had been removed.\nWe also had a couple of other ADA improvements on certain stations, identified, so I guess that would be a question for maybe for rob or for lenny about just protocol A decision was made prior to the previous year's submission, based on the responses we had received in the past, as well as the follow-up with new york city transit.\nSo I'm, not quite sure, if there's been a lull in the communication about the project, I'm, not sure if there are meetings taking place, And we're just not being updated, but we're experiencing the same thing as the committee, and so with that.\nWe also heard from generation vote, which not only helps to register young people in places that they are such as in parks and outside, but they work on, such as in certain type of elections to to lower the voting age, and they describe some of the recent problems that, during the cohort time that students who were registered in let's say some of the state universities who had to go home.\n: Let's move on to item number six new business, fiscal, year, 2022, statement of community district needs and register of budget priorities.\nA couple of things I want to just mention in consistence with the presentation that was given by taya during the last general body meeting and then the presentation that was given today by gustavo and some of the things that I know rob and the rest of the office is working.\nIs that we're trying to take a different perspective for the information and the way we communicate and the transparency coming out of the district, office.\nWhat I like to do is ask each of you that at your next committee, meetings, advise all of your members, both board members and public members, and maybe anyone who's in the sound of your voice.\nThat I've instructed the board office to not just accept and work on, requests that are coming out of many different avenues.\nWe actually worked on the district needs and we sent that into the office to be actually presented to the exec committee and that came through my secretary.\nI want to cover is we have representation on the board for people who represent the general body in the entire office for different committees such as atlantic yards 80, Flatbush?\nWhat I need to ask is that each of you who do represent a committee or represent the community board on a committee that you submit a report.\nIf you went to the participant list, the only names that you would see were the people from DOT, so community members were unable to know what other community members had joined the briefing they also D.O.T seemed to be ignorant of the fact that ps8 plans to hold outdoor classes relatively close to where this work is going to be going on, including some jackhammering and community members, use that to push for this request to have a bqe task, force, something that juliette mentioned.\nSo I recognize what several people have said this evening, that it's been a long time since the community, the community board and the committee have received an update on the triple cantilever and that fact is true.\nI just wanted to know how it would be used by the executive committee or the board in general, and also the quest itself.\nAnother thing I want to mention is we're coming close to the point in the year where we need to have a nominating committee where we need to go through our voting process, and so what I've asked the office to do was reach out to mr quint, who has served as our chairperson of the nominating committee and to mr smith, who served as the co-chair for the nominating committee in the past, as well as some a mixture of some existing and new board members, and so we're convening that committee.\nThat would allow us to have an interactive and engaging way of you know looking at consensus, as mr peres has laid out from the committee, and so you know we want to give a few more days to explore different options, but that potentially could be one way that we would be able to engage and look at a way to vote and make sure this consensus on the items and then still give us the platform to discuss and give feedback on the budget.\nSo is the whole board going to vote on this or just the executive committee.\nWill request some support from the district office to be able to see how those items fit or not fit within what we've done in the past, I think we can offer that to help up, but once we get the feedback from your committee, then it becomes a question of how do we mesh it in to get it done to represent the entire community?\nYou know either the staff has been giving me too much of a overly positive report, but I'm I think that work has been done and what we need now is a path for putting the information that we have together and before either the full board or the executive committee as the board leadership sees fit and then taking one last look at it on at the October executive committee meeting.\nWhat the day you have your committee meeting I need that into the board office.\nThe next day, but at least any conversation or topics that were discussed that are germaine to the ranking and the rankings have to be into the board office the next day to give us enough time to compile a list that we can share to the exec committee and be able to capture it that way.\nI was going to ask the same thing because we aren't actually meeting before the October 26th executive, so I just wanted to make sure if it would be okay.\nIt was communicated to me from one of the board members that we should have some type of mechanism to encourage students to attend meetings, since it's virtual on webex that there should be a process so that teachers and other youth leaders could let young people know about our meetings so that they could attend.\nOur committee does not want to be in the position of grading a report or analyzing it, because people come to meetings, maybe with different, essential questions or different things that they're looking at.\nI, don't see a problem with maybe asking young people to advising them of our meetings asking them to participate if they would choose to do so, but I, don't see us as a committee, as a community board going any further than that, because we're not teaching the children.\nThat's going to come from the committee, because that's where the work needs to be done, and then we can discuss it through the district.\nYour thoughts, are, I, would jot them down email them to the board office and copy me, and it will work through giving you know getting the right language to get out on your meeting notices, Anybody else, an executive committee with a other business Okay, great community So I, am not clear on who is from the community and to be consistent with what we've done in the past.\nSo just wanted to make a mention of those two things really grateful for this community board's commitment to continuing to do the important work in the midst of all this.\nRaised, I did want to point out that back when you had to come to executive committee meetings in person."
        }
    }
}