{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "JOINT Committee Meeting",
            "publishDate": "2020-12-16",
            "shortDescription": "",
            "lengthSeconds": "1:32:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "8EcepN02T4U",
            "fillerWordCount": {
                "uh": 328,
                "um": 315
            },
            "readTimeFullTranscript": "53 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "bid": 57,
                "street": 51,
                "expansion": 47,
                "services": 31,
                "businesses": 30,
                "buildings": 29,
                "business": 28,
                "assessment": 24,
                "property": 22,
                "neighborhood": 21
            },
            "wordCountSummary": {
                "bid": 18,
                "expansion": 15,
                "street": 13,
                "business": 12,
                "services": 11,
                "neighborhood": 7,
                "businesses": 7,
                "property": 7,
                "day": 7,
                "department": 5
            },
            "fullTranscript": "Hello: everyone, it's 602, I'm just going to hold on for two more minutes, and then we will start just waiting for a few more people to join, to see if we can get quorum here. My apologies for the delay just hold on for two more minutes. Okay, at least for Bex I- am seeing that we don't have quorum. Yet I'm going to start the meeting. Nonetheless, if we do not have quorum as we go forward or if we lose it any vote that we have will be ratified by the executive committee, so I will start now, because we are at 603, and this is a special meeting of both backs and the land use Committee Rene. There are a few members in as attendees. You may want to make them that or that may help your qualm what they say. Well, I'm not sure if they're on this commitment, I don't see anybody in the attendee Nick that are on the committee and I would. If anybody is on the committee that they turn on their video if they can and join as a panelist. Okay, as I said, I will start and if we don't have quorum moving forward, we will ratify it at the executive committee and I will give you the dates of that executive committee. I want to thank everyone for attending tonight. This special meeting, particularly during the holiday season, I, know everyone's really busy, so your attendance is really appreciated. I just want to explain why we're here and why we're having a special meeting Bex with the land use Committee and why James, Matthem and Kirk Cavanaugh are here from the Flatiron bid again to talk about the Flatiron bit extension. What we're doing is we're here to vote on the application for the extension of the Flatiron bid expansion, which is a process that follows the you look review procedure. It doesn't have any zoning or land use implications, but it follows that process so just to go over the process of how one extends a bid. The bid first had to get approval of the idea, define the boundaries speak with the stakeholders. Conduct needs assessments, determine the services to provide the budget figure out an assessment formula draft the summary of the district and get final approval by the city, small business service agency. They then reach out and James will detail this to all the stakeholders, and Flatironvid has done that in a number of ways to assess and gather public support for the expansion. So that piece is done and we were part of that process back in February and March the Vex Committee, and now the flattering bid has filed the formal plans with the department of City planning DCP for the bid, expansion and DCP have referred this out for community Board review like the Euler process. So that's where we are. We at CB5 have 30 days to review the Flatiron amended district plan. I believe everybody has a copy of that. So that is this application here. Our input is due by January 4th, which is why we're having this special meeting now that why the timing is what it is, our commentary and our vote will go to DCP. Who then has 60 days to issue a report on the application, and that report then goes to the city Council and the city Council? Is the one who'll make the final decision regarding the flat iron bid? Expansion just briefly you're gonna, wonder why we didn't do this. James was with us at Bex, and we also heard this back in February. We were talking that was the stakeholder period where they were getting the support from stakeholders. We are at a different stage at this point. This also had a little bit of a change, so there's a new aid to assessment rate, which is a change from when we offered our support of the Flatiron bid expansion the last time so I've shared the district plan with you, I am going to turn it over to Layla. Now who's going to speak on the land use piece of this. Thank you very much Renee good evening. Everyone, I'm Laila Logisico, I'm the chair of the land, use housing and Zoning Committee of Community Board 5. So, as Renee explained, this is a an application that basically follows the Euler review process. So this is why it is a joint meeting of the backs and the land use housing and zoning committee meetings of Cd5. But what's interesting is that there is really no direct land use or zoning component to the application. It is just that you know when the local law was voted on to permit bids in New York. It was decided that Euler was the proper review process to actually evaluate the bid creation and bid expansion. So it is one of those you know like non-euler puller type of applications, so it follows the steps and the process, but we certainly appreciate that you know the land use and zoning component is not really what is in front of us. Nonetheless, once we issue a recommendation, we have 30 days to do that. It will go to the city, Planning Commission and the commissioners will have an opportunity to review and they will issue a report, and this report will be forwarded to the city council and then the city Council would take a vote. What's interesting is that Euler is very codified. So there are, you know specific amounts of time for each entity, whether it's the community board, the board president and the city Planning Commission, to actually weigh in and comment on this one. It's almost the same with the major difference that the city council does not have a deadline to weigh in on the application. So you know this is for the land use portion of things. I also want to disclose at the very beginning of this meeting that Al, although I am sitting here and I presented, my myself as the chair of the land use housing and zoning committee I want everybody to know that I am present but not entitled tonight, because the building where I reside is actually within the extension boundaries. So I will be addressing any technical questions on land use, but I will not be sharing the meeting that will that honor will fall on Renee's shoulders entirely. I will, as I said, you know, I will provide any technical. You know comments and you know like if there are any technical questions that need to be addressed on the land use portion. I will do that, but I will certainly shy away from you know, guiding the conversation in any way, shape or form and any comments and questions that I make will be, as a member of this committee being present, but not entitled to vote. So with all of that being said, Renee I'm turning it back to you. Thank you. Leila on the process. Piece I would ask people to use the raised hand function if they have any questions. I just want to see. If we have any ques questions from anyone here on the process, I'm seeing no hands raised, seeing none I'm going to ask any of the attendees if they have any questions on the process and seeing none there, I'm going to turn the meeting over to James and Kurt to go through their presentation on the expansion, welcome to James and Carter hi thanks Renee. Thank you, Laila very happy to be here this evening. I know it's busy time of the year, but want to make sure everyone's fully up to date on what we propose. As a steering committee for the expansion of the Flatiron 23rd street partnership. Again, I'm joined this evening by my colleague, Kirk Kavanagh, who's, our director of streetscape and planning, and I'm James Matham, I'm executive director of the Flatiron 23rd street partnership. So in a moment I'm gonna, if you don't mind, I'm gonna share a presentation. I know our friends in the Bex. Committee have gone through this as recently as a few weeks ago, but I figured just kind of get everyone up to speed to on who we are and what we've been working on for the past few years to get us to this moment that we're very excited about in terms of proposing our expansion of our service area in the nomad and 6th Avenue and 20th street corridor. Let me pull this up right now and I'm going to pull this up and present from it. I might have trouble seeing people's faces in hand. So just please stop me at any point. You have a direct question or we can hold it until after the presentation. It's up to you, oh and one other thing, Luke or Marisa. It might make sense to if you can I think Lamell Lindsey from SBS is in the attendees list might make sense to pull him up to panelists. If you don't mind, if the committees are okay with that he's the representative from the department of small business services who oversees this for us. Thank you. Okay, can everyone see that okay, I'm gonna make this slide? Show okay, so yeah, just we'll give you the lay of the land of who we are some facts on the expansion, the some of the needs of services that we've explored with the community over the past number of years in terms of pushing to move on this expansion of our services, a look at the assessment budget and formulas that are required to underwrite the services and programs, as well as the outreach, engagement and support that we've been working on over the past year, both pre and post Covid-19 outbreak. So just up to familiarize everyone. We are one of the city's 76 business improvement districts we've been around, we were formed in 2006 and again we represent property owners, businesses, residents and other stakeholders in the greater Flatiron neighborhood we're a non-profit. We work, we focus on community improvements and economic development, doing what we can to make sure that the Flatiron and nomad neighborhoods are as vital and exciting and vibrant as possible, and so yeah we've been a an institution here in the neighborhood for nearly 15 years and we're proud of the work that we do in the neighborhood. Currently we're kind of a blob around Fl Madison, Square Park. These are the boundaries that were ultimately approved back in 2005 2006 through the legislative process, roughly from about 21st street on the south bits and pieces of 6th avenue up to 23rd street, and then we taper in as you can see towards Broadway up until about 28th street, and then we taper out on the east side from Park Avenue south over to Lexington, to include the Baruch college campus and these you know this neighborhood. You know in our relationships with the institutions here, whether it's Madison Square Park, Conservancy, Baruch college, the businesses, property owners and residents has been a constant and we think we've done a lot to make a big difference in terms of both the quality of life, the look and feel and the economic vibrancy of the neighborhood over the past decade plus. So you know just a few items that many of you who have been in this community for quite some time, pre and post bid probably have witnessed and notice over time before the bid. You know one, there wasn't a flat iron plaza, the North and South Plaza, that's something we take great pride and joy in managing activating cultivating and making it a community living room for the neighborhood and then just like I've said all the time. It's just some just genuine tender love and care throughout the neighborhood, whether it's the Park Avenue medians or just the regular daily upkeep of trash collection, public safety, beautification and just activating public spaces in a way that people feel good about lingering in so just moving into the proposal. This is you know, it's a pretty ambitious proposal and we've been working on it for quite some time. I've been with the bid for just about two years just under two years, but this is something that's been in the works for nearly three to four years in terms of thinking about, and some have said, even going back to its formation. That's as the map had changed, but this is nearly doubling the size, the of the current business improvement district. It's really concentrated on kind of an upward thrust, along sixth avenue, as a gateway to Midtown into Penn, Plaza and Harold Square. It includes the greater swath of nomad that has obviously changed dramatically over the past decade, and it also includes a southern corridor. 20Th Street, given the contextual, look and feel and character of that corridor, similar to that of 21st and 22nd. So this is a hundred plus block faces that that's in the blue air Blue shaded area, there's some 1300 plus properties that includes individual condo, residential condo units, many tenants, commercial, tenants, both ground floor and, of course, upper floor, hospitality in hotels, 3000 plus residential units, a workforce of thirty. Forty thousand, of course, we're hoping we return to that number as we recover over the coming year and the way we underwrite our assessment formula, we'll talk about a little bit more shortly, is using square footage of buildings of properties to determine how we apply an assessment rate. So that's roughly the map that we've. You know we took a while to settle on it that 6th Avenue, 31St Street there's a lot of debate as to whether or not we you know stay at 6th Avenue. Do we go to 7th Avenue? Do we include 6th avenue at all? 31St street we've had iterations of this over the number of the past few years, starting at 29 ending at 29th street we've. We got a lot of good feedback from property owners and businesses further north, that they'd like to be included. So we've tried to be as inclusive as possible, while also factoring in you know the matter of us being able to provide the necessary services that we'll talk about shortly so yeah again back to that tender, love and care aspect. You know over the past two years since I've been here and Kurt's been with the partnership for three years. You know: we've been logging and inventorying issues both in and around the bid, and just you know certain things that the partnership pays very close attention to in terms of the services that we deliver on a daily basis, certainly noticeable on our periphery right outside the bid or in between our bid and the northern the 34th Street partnership, just north of us or the Union Square Partnership south of us, along 17th 14th to 17th street. So these are items that you know. We work on every day, whether it's beautification or graffiti remote removal, derelict bike, maintenance and management. Those things that are just need a watchful eye on, in terms of making sure that we can make sure this is a vibrant place for people to live, work and play in. So here's just a few of those that are particularly along sixth avenue and nomad and then recent conditions I mean things obviously, for everyone turned on a dime and on its head, come March. We've certainly noticed that we've had an uptick in street homelessness that we've been working closely with our city partners on addressing in the neighborhood, welcoming them as their neighbors, but also making sure that you know we're also managing certain streets street conditions as they arise as well, so we're working there with our partners. We obviously had some of the impacts of the social unrest come through 5th Avenue 6th Avenue the adverse impacts of that 6th, Avenue 5th Avenue Broadway. During the summer. Our teams were there to help our property owners and businesses pick up the pieces, those tough nights, whether or not you know. We worked with artists to make sure that when there were boards being put up that we could try to at least add some light to them, some levity to them for hope, and then just you know certain streets here and there we've. You know. We've certainly noticed that need some attention, as there have been less people in the district and then you know on the bright side, we've been really you know. We've worked very closely with the business community in both on 20th street and on Broadway and 29th street to help maintain and introduce open streets and out and outdoor dining, it's been really successful. You know we think they've done their best and worked with us to try to be good neighbors during this. Obviously, some issues here and there that we've worked to mitigate, but that was something that, as a management park partner in close relationship with department of transportation, we lent ourselves too so very difficult times everyone's struggling, especially our businesses, but some really good things also coming out of this- that we're happy we're hoping to help advance in the years to come. So again what? When, as we went through this over the past few years, we've done a number of needs, assessments and outreach to kind of gauge what were the core needs of the dish of the expansion area? Many of those came back being similar to what the services that we've been providing and working day in and day out, to provide to the current bid boundaries, whether it's around cleanliness, public safety, ambassadors, homeless, outreach and service provisions. You know a touch of streetscape improvements and in horticulture and urban design, enhancements around safety and transit access and then particularly lately, business support, district-wide marketing to try to draw as many eyeballs and dollars to our ground floor businesses and regulate and navigate regulatory burdens. You know acting again as a liaison and an advocate to civity agencies similar to the community board and, of course, in this case, with a lens towards the business vitality in the district and again so what we are, you know we serve as a community resource for our co-workers, our businesses, residents and institutions, and you know we're clearing house for economic, local, economic trends and information, retail recruitment and attraction is going to become much more important in the days ahead. Unfortunately, we fear, but that's something that a bid like ourselves can will be diving into promoting the neighborhood as a vibrant place to live work and play access to government, emergency management and relief efforts. That's been a big part of the past nine plus months. It was a big part of our role of the steam pipe explosion in 2018 and again prioritizing local business needs during economic recovery. So what we've proposed to the expansion area again? This is building on these things. District-Wide horticultural program. That starts with you know our hanging baskets and installing those across the district making sure that tree beds and tree guards are implemented are installed throughout the district and that our horticultural contractor is paint is doing seasonal plantings there making sure the Park, Avenue medians are extended in terms of their maintenance and seasonal plantings throughout the year. Currently we stop at just about 27 28th street we'd go up to 30 nearly 32nd street, in this case our trash receptacles that are out there too, making sure those are maintained and installed, and then just streetscaping design and safety measures. There's been a lot of issues, particularly along the sixth Avenue corridor over the past year. We think this is an important time to address those and bring those forth for consideration and again open streets, open dining, Broadway vision, there's a lot of things that the expansion of the bid will enable us to take on in earnest we're excited about doing that. Public realm work, envisioning with the community, our sanitation, safety and social services, the bread and butter, the meat and potatoes. However, the foundation, however, you want to call it. You know our clean streets, our cleaning crews are out there at minimum 7 A.M to 7 p.m. Every day, extended hours during peak months, they've been true bureaus this past nine months out working in the community, helping to keep it clean and safe throughout this they'll be right, they're getting ready as we speak for the snowstorm, that's coming in a day, so you know they'll be out there they're the eyes and ears and the crew. That really makes a huge difference in our neighborhood and you see them and if you do see them even regardless of expansion, please give them a nod and a vote of support. They've been terrific and our public safety officers and ambassadors are out there. They, like I, said they we treat them. They address quality of life issues, they're ambassadors for the neighborhood. They provide a friendly face both for visitors of co workers, residents alike and they'll, be in the expansion area as well from you know, somewhere in that nine to seven range as well, and then also our homeless outreach teams. We contract with a terrific non-profit, called urban pathways. They work across the city they're out working building relationships with individuals without shelter or homeless, neighbors panhandlers street homeless every day during the week, typically from seven in the morning through the early afternoon, and you know trying to build that trust and help people access services if they choose to access them through safe haven, shelters and so on. And, of course, that's also working closely with the department of Homeless, Social, Services and Department of Homeland services to provide that support and then, in terms of marketing and program, business support I touched on this a little bit, but you know we spent a lot of time telling folks what we're up to making sure that people feel that Flatiron nomad the greater neighborhood is a place that they want to shop in work in and take a stroll through. So that's whether that's our weekly newsletter or email blast, getting information out, that's been more important than ever over the past nine months as a kind of a resource for our particularly our business community, on relief efforts and important, timely information. That seems to be swirling every moment. You know in good times programming events are critical in terms of activating our public spaces in a responsible manner. That's community oriented. We do that. We hold community events district branding. This is something that we'll be looking closely at. Hopefully, as we move forward with the expansion, as we, you know, become a greater community, a larger community beyond just flat iron and 23rd street, and again business support working closely with the department of small business services, our state, federal and local partners here on relief efforts and advocating for much needed support now more than ever. So those are major cogs of the bid now in terms of the nuts and bolts of how we do those things on a daily basis. Bids are underwritten by assessments that are levied on property owners. This is how it's been done since the late 70s, when the bid pro the first bids were created and it almost acts kind of like a cam, a community assessment kind of like how malls would work where there'd be a common fee, that a fee that's paid by each vendor in that case, to make sure that there's common area support throughout the district, so we're currently a 3. 3.25 million dollar bid assessment bid our budget's right around 3.25. As of 2020. As of this fiscal year and again, we break those that 303.25 million across our key programs- sanitation, public, Safety, Marketing, Social, Services, homeless, outreach, public improvements, Beautification Admin, General Administration and making sure that we have a reserve in place as well. What we're proposing here with the expansion nearly doubling in size, we do have some economies of scale, particularly in terms of administration and reserve, is going up to about a six million dollar operation, so the expansion area would roughly generate 2.75 million dollars from the property owners in that area. 3.25 million coming from the current bid, and how do we get to that because there's different types of properties so per the bid assessment formula that we use each benefited property owner's annual contribution is based on as I mentioned earlier square footage, and we do that through the following classes: retail, commercial, professional classes is your typical commercial building in space we generate a formula taking that budget and dividing it through the total amount of assessed commercial square footage that comes out to about 16 cents, a square foot, that's what the bid property owners currently pay. It's been very important that we, you know we felt going into this as a steering committee that we kind of pegged that amount, particularly in the initial years, so that no one you know current bid prop bid paying properties are not assessed. Anything greater and new ones are not as well. So it's at 16 cents per square foot. That's the bulk of the assessment. We do have a special class that was created at the onset of the bid for large, very large commercial buildings that take up one full block. These are the buildings around Madison Square Park that you're probably familiar with the New York Life building, where met and life used to be, there's really two buildings. Now that fit this class, they are assessed that eighty percent of that commercial assessment obviously had a much higher amount of square footage and that roughly comes out to 13 cents, a square foot. The item- that's the new proposed piece here- is this large mixed use: a2 large mixed use buildings over 200,000 square feet, and this is also the item that has been tweaked. Since we met Renee and Bex, we discussed. We did discuss this a couple weeks ago, but this is the item, the one item that has changed since we met in the pre-pandemic in late February. Prior to this, we were just narrowly looking at sixth avenue buildings. Now we've applied this across the district and essentially what it is. These are the largest mixed-use properties. These are the residential towers, the rental residential towers across the neighborhood of which nearly all are located on 6th avenue from 23rd street up to 31st street, both East and West sides of the street. And what we're proposing here is that the commercial portions pretty much the pedestals of these buildings, especially if you're familiar with the sixth Avenue ones, they're commercial, pedestals and then towers above that were permitted by rezoning in the late 90s to make that a c6, 4x district. But we're saying what we're asking to do here is assess the commercial portions of those buildings at the same rate as class a so that's 16 cents a square feet, and then the non-commercial portions, primarily the residential rental spaces above it would be assessed at a reduced rate of 40 percent, the commercial rate which is approximately six and a half cents per square foot. This is important for us just because of the changing nature of the district. There's a lot of unknowns, particularly now going into you know the world in the post pandemic, but it's important that we can provide the lar the maintain the level of service, particularly the cleanliness around these particular nodes, where there's just a higher concentration of 24, 7 presence generated by the sheer number of units that are in these buildings and I'll get into this in a second, but just quickly, the rest of the assessment class, individual, residential co-ops and condos. This is being maintained. They will be. They are technically not assessed. It's a one dollar per year, assessment on co-op buildings, non-commercial portions and residential condos. That remains the same, both in the current district and in the expansion district nonprofits in government are exempt per the law that Layla mentioned earlier vacant parcels are assessed, are given a break. That's the current. The existing plan of a dollar per year, as well until they are developed, but parking lots, surface parking lots are assessed at the full commercial rate of 16 cents. So let me just there might be questions here and I'm happy to pause here, but so this is the large mix use buildings class map. These are the a2 properties that are subject to this new assessment class. There are ten of them in the full district, eight of them. The first eight that you see from a to h. Those are in the proposed expansion district that lines 6th, Avenue, they're, all rental towers above 200,000 square feet. Nearly all of them were built pre-2017 in the new, affordable, New York program. So most their subjects are part were part of the 421a program. They are not allowed this. The assessment goes to the property owner. They are not allowed to pass that through to the resident, whether it's through 421a, in the fact that they're restricted by the rent guidelines, laws or if they, if there are some income, restricted buildings as well. This is not intended at all to reach any tenant. It is to the property owners themselves. So that's the first aid and then there are two buildings that are in the current district. One is the on the eastern side of southeastern corner of 23rd and sixth avenue. That's the Caroline Building and the other is the recently rebranded anagram nomad, that is between the full lot through lot between 28th and 29th street, between Fifth Avenue and Madison Avenue in each of the we've reached out over the both in terms of the first eight over the course of the past year and a half we've received letters of support from half of the buildings. In support of this, the other half we've talked with, we've made our pitch. They haven't opposed it they're. Okay, with the idea they haven't put pen to paper in terms of our support, ballads and then in terms of the existing bit area. The Caroline has provided us with a support letter and we're currently we're still. We are still in dialogue now with the anagram nomad as well on this, and in each case you know, we think that you know the services being provided and offered up are worth the reduce rate. Any questions on that before I move on. We can come back to it as well. Okay, so, on the topic of community outreach, engagement and support, this is a very important thing that the steering committee seriously took and that the department of small business services who's the kind of the guardian of this effort throughout the city instills in every expansion and formation initiative. So this included flooring forming a steering committee of businesses, property owners, residents, resident organizations, creating a statement of need for the expansion, doing a needs assessment over the past two years, developing a modified district plan that met this met, those needs holding public meetings, conducting ongoing outreach and documenting support and then submitting a proposal to the city department, small business services and then, as the next chapter here, is what we're doing tonight. Is this public review the formal public review and legislative approval phase of this, which is yeah somewhat of a modified Euler? So the Steering committee has been in place since 2016 we've had people, we've had organizations and stakeholders come in and out, but as I mentioned before, it's been a suite of property owners, residential buildings and associations. Small businesses, big businesses, runs the real gamut here and they've been at the table, helping to steer this throughout the past four years and welcomed me a couple years ago to help get it to this point. So what that's looked like as I mentioned, needs assessments. We spent a lot of time, particularly in the first half of 2019, debating what the boundaries would be in the budget would be. You know, working with our elected officials too there and we came to this set by the summer of 2019 and that's what we then directed our outreach and support gathering focus on so we've been, we've done, direct mailings of brochures and our statements of support to thousands of residents and businesses. We've been weekly newsletter, e-blasts out ground floor business, canvassing upper floor, tenant letter distributions, we've met and mailed information too, with various condo and co-op associations. Again, we've met, we've really focused on those sixth avenue rental towers through direct mailings and conversations local press. We held two public information meetings on in October of last year and January of this year. Again, we reengaged things again once we came out of the initial freeze through the pandemic, and we've been really doing what we can to provide various levels of Covid-19 relief and recovery efforts in the expanded area for the businesses and, of course, all that you know has helped yield an additional amount of support over the fall. You know we did take a pause like most people over the spring to really focus on the recovery, but we have you know we have received support over the past few months of this. Here's just some. You know you may have seen you may have come across this, especially if you live in the neighborhood in the expansion area, some of our mailings that we've done multiple times over the past year. You know some of the public information meetings, both in person and zoom in recent months. We did those both in the lower part of the district and in the northern expansion area and then in terms of what we've been doing as I mentioned pandemic business support. You know that starts with just general advocacy working with the rest of the bids and the chambers of Commerce and our economic development partners to advocate for relief at every level. That's needed particularly right now we're working with the chamber on the New, York City, small business resource network and we've provided commercial tenant legal guidance through our friends at the legal aid society. As a you know, as we represent interest both on the property owner and the business side of this, we've provided direct promotional campaigns from the all in flat iron and all in nomad to drum up some business for our restaurants and dry good retail over the fall we've distributed, masks to businesses, I think it ended up being somewhere between 50 and 60,000 mass that we distributed on behalf of the city to businesses across the bid of expansion area and beyond, and then a couple of this important giving back efforts both the current. Our current gifts for the greater good drive, where we're fundraising and using bids resources to purchase gifts from local retailers and provide them to individuals and families of need, both at the Harmonia Shelter and through the hearts of gold non-profit in our district and then back in the spring. We did a feeding, Flatiron first initiative, which again provided meals purchased at local retail restaurants and we fed our local Ems, Fire, Department and police precinct for 30 straight days and then, but looking ahead, I mean again. I mentioned this before this is everything there's a lot of there's opportunity throughout the tragedy here. It's I hate to say it like that, but you know whether it's through the open restaurants and open streets can't work that we've been working with the businesses and community on or just a vision for a safer and more accessible public realm for all sorts of for everyone. We want to make sure that the that we're helping to provide resources and guidance and support in that so we're excited about the possibility of Broadway and the Broadway vision that I know the department of transportation. You know it's kicked off prior to the pandemic and was looking to get back rolling. We met with them recently and we're also excited about some vision, planning that we've done for open streets and perhaps that we might think about working. We might work on over the spring and summer as we get to some the warmer seasons, so yeah that ongoing entrance has been continuous throughout the past few months. Again, 6,000 postcards were mailed as recently as a couple months ago to everyone saying that this was still up in the air and that we're still looking to move forward with it. We've had a number of conversations with businesses and property owners looking to get them their support and help them through this and yeah. We're excited that we've gotten to a point here over the past six months, where we can say that we have over 50 percent. 56 percent of the total amount of commercial assessed value has registered their support through signed statements in support of this. The residential community has been out just outstanding in their and their desire to see this come to fruition. 36 percent of the total residential Avs has come through about 21 of the total commercial properties and, as I mentioned there's nearly this between 350 and 400 properties. We're close to 100 there residential properties have well have been great and we've. You know: we've pushed really hard on our commercial tenants where appropriate and feasible. It's like I said: there's nearly a thousand of them in the district, and you know: we've taken a lot of we've gone to many extents to try to get them information talk with as many of them as we can and we do feel we have a good number there. We continue to work on that to this day and in each case you know they're, just fortunately I think partially because of I think the great work and trust that this particular bid and my predecessor and its board have instilled in the community over the past 15 years. It's been just really just support that we've received. We always have people that have been hesitant to sign. Not everyone believes entirely in the bid concept and that understand that entirely, but we haven't received we've seen less than one percent of statements of support that check the no box. So we feel like it's time to move this into the public review process and allow for the hearings and testimonies over the course of the next few months, and we look forward to that. I will stop there. Thank you for letting me go through all that. I know for many of you. It's been a couple times but happy to talk through any questions. Thank you thanks. So much James I think we should turn it over and look for questions from committee members I'm going to unshare for the time being, I can pull it up and I would ask people to use the raise hand. Function. I, see Clayton thanks. So much I just have a quick question, which is that if this was never meant to reach residents and if residential buildings in the co-ops and Congress have never been assessed, I mean aside from the nominal dollar, I'm a little unclear about the rationale about why property owners should be assessed on the residential square footage of their mixed-use buildings. Can you just address that? Why are they being? Is that square footage being assessed at all? Yeah I mean it's a good question. It's one that we've grappled with from the get-go and I'd be I can be honest and tell you that initially, it was one that we you know had not we weren't entertaining. It really came down to an issue with really bringing sixth avenue in particular into the fold. Here we were getting a lot of calls for servicing it, and just the sheer amount of density and conditions required that we had an ample enough budget to do a good job there without letting that corridor down. So how this initially started was that yeah, it was a sixth avenue kind of special assessment on those properties is actually at a higher rate. When we met with Renee in Bex in the spring, he was actually at 60 55 percent of the residential square footage, but we felt you know in terms of sustainability and the ability to treat this corridor. That is different. I mean there's a it's interesting that the original bid kind of does taper intentionally away from sixth avenue, as we've been in existence for the past 15 or so years. It was important that we made sure that these buildings that were adding an extra layer of both pedestrians and service levels that we could to cover that. So that was the genesis honestly that was agenda and then, over this over the fall. We had conversations with the city with department, small business services, city planning, and would it was advised that we take a look and not just keep, have a narrow scope of sixth avenue but perhaps consider a district-wide one, and you know. Fortunately it is two to it's only two additional buildings. You know that, obviously, that's not to say things change in the future, but it's also just a matter of kind of equity in that regard and why do just four five blocks and not the whole area? So that's what we've amended the proposal to. Thank you, Sam Johnson, you have a question yeah. You indicated that one percent of the buildings oppose the proposal. Can you give me some idea of what their major sources of objection to the proposal were? Yeah we had a couple of com, a few conversations with those that submitted ballots, I'm saying that they were uninterested in this. We had we've had a couple of property down on 20th street that felt that there wasn't. You know that great of a need for the bid services, some of there's some spillover- benefit on 20th street. To be honest, just given our map currently because we do cover particularly on Broadway, we almost cover the entire block down to 20th street. So it was a matter of just. Is this worth the financial commitment through the assessment that it was really down to just like? Is this really worth it? Do we want those services, the supplemental services provided versus? Do we feel like it's already being covered substantially again? This is it's a it's meant to it's supplemental in nature right. This is on top of what the city is and should be providing in terms of its sanitation, public safety beautification here and there. So it you know it's a matter of that. We've heard thanks: James Kim, yes, hello, friends! Thank you so much for this robust overview. This has been extremely helpful. I had a quick question and was hoping you could maybe do a bit of a deeper dive into the alignment and location at the 34th street partnership, and if your new northern border will abut with that or if you could just go into a little more detail, sure yeah. Thank you. Let me do you mind if I pull up the screen again, I'm going to share this again and pull up a map for everyone hold on one Sec. Sorry, I've got a lot of maps. Okay, so here's a map of the jigsaw puzzle that our Midtown south bids- you can see us smack in the middle and the light gray. The purple's our expansion area, as proposed the shaded area to the north, is the 34th Street partnership bid running primarily 34th street and over, but it does dip down, as you can see, at different parts down to 32nd street on certain corners 33rd street pretty substantially. This was something that you know we wanted to help fill the gap we decided like I, said at various versions. The various iterations of this 29th Street 30th Street was our northern kind of boundary. We did get asked by property owners, businesses and electeds to consider 31st street to try to bring it closer. So we did that. We honored that and then 32nd street just poses some issues. I mean it's. You know it just in terms of character. If you want to go with whatever character's worth, you know, it does have more of a herald. Square Midtown feel to it. The you can, the other bid kind of zigzags in and out of it already Koreatown, of course, is there too and have their own particular interests and needs. So we decided to say that 31st street would be the cut off. Of course, and again there is the one spur on 32nd to 33rd on Park Avenue South. On the east side. We acknowledge that that's a that's NYU Langone's there and we worked closely with them, and so we did include that in the proposal, but otherwise it's you know this is not meant to I hope it doesn't see. It may seem, like it's kind of cherry picked, because there's a number of lots that are full block through lots. So the idea here is that we're not intending to service 32nd street. So if your building line is a through block wheel, Service 31St, Street, North and south sides sidewalks, but we're not going to be servicing the 32nd street side between Park Avenue and Bar and Broadway I hope that helps to answer it. Thanks, James, Nick I, see you have your hand up. James on that subject, I seem to recall hearing that the 34th street partnership had plans of expanding south. If that happens, what? Where would they? What gaps? Would they fill in? The 34th street partnership over the years has definitely talked about it. I think they even had kicked off a formal effort, five six seven eight years ago, that I think even would have included a portion of this proposed expansion area. I, don't know if you know, as recently as earlier this year. I know they had no immediate intentions to expand, but I mean we would hope if this could move forward, as is that they would fill the gaps that formally fill, and you know, abut us contiguously. That makes sense. We've kind of left it in that way, so that, if they did that, it wouldn't be. You know zigzagging in and out that's why we, the 31st street, was kind of like that squaring of the northern Boundary Thanks James Layla. Thank you, Renee. Thank you. James, for a very thorough presentation. I have a couple of questions, so I'm gonna start with the first one and Renee feel free to interrupt me if I'm getting too greedy. My first question is regarding the assessment rates, so currently I understand what you presented, but can you walk us through the process to actually amend those assessment rates? Yes, absolutely good question so for any bid to there's a couple facets to that, so one any bid if they want to increase their assessment. Just the sheer budget right that, let's just say that six million dollar amount if there was a need to increase the assessment. For you know, cost of living cost of inflation service increases special projects whatever it is that piece just to go up a dollar from six million to six million one would require requires legislation that requires city council to pass a local law to allow that. So that's the that's one to the crux of your question, though, in terms of amending the formulas and the rates, the formulas that generate that also requires legislation, and it would require it's a technically an amendment to the district plan. So it's similar to what we're doing now, we're kind of going into our magna Carta of sorts, our Gover, our document of existence, the district plan to expand our boundaries and add properties to it. To add that special class that we talked about and then it triggers this public review and legislative process, a similar thing would be required to make any changes to the formula down the road. Regardless. If we change the boundaries, it would still require legislation yeah. So currently you are. You have introduced or you're seeking legislation to amend the district plan. That's correct! It's is that what this Euler application is or is there an additional action in front of the city council? That's! That is that's what this is you're, absolutely right: that's user, the Ulr, the amending of the district plan to expand the boundaries and amend the formula, the formulas that we walk through. That's right. Okay, so technically, if you were to decide to amend the boundaries again, let's say you want to expand a little further south and include maybe 19th street. Then you would have the opportunity to fold in a amendment to the formula. That's correct, oh and that's exactly right. We could do that there or I mean we have no intentions of doing this. At all, I mean this has taken years to just get to this point, but any amendment to the plan, whether it's the map, the budget or the formulas, require legislation. It can't just be done. We can't just vote as a board unilaterally to do it. It's got to go through legislation, okay and I. Think I understood your the breakdown of the different building categories, I'm just a little unclear on mixed-use small buildings that would have retail on the ground floor and then residential above, which is, you know very typical of buildings, south of 23rd street. Can you actually clarify which class each space would be? You know qualified and also is it per building or per individual unit? What is the formula there right? So, let's just take we'll do two examples: a condo building that has a commercial retail condo at the ground floor. Each of those properties are they're. Each considered individual property lots so the ground floor, commercial condo, would be assessed at the commercial rate, the 16 cents and the individual residential condos would be assessed at the dollar per year. So that's one type, the let's take a co-op building with a commercial grounds. That's one lot right! It's just one lot and how it works in that case is that the commercial portion of that of the lot would be assessed at the commercial rate. So, let's just say it's a thousand. Let's say it's a ten thousand I'll just say ten 000 square foot, building I know it's probably too small and a thousand square foot commercial, that's commercial, and then the 9,000 of residential is it's just the is the dollar yeah and the way it's destructured is to really maintain the current status. Here is that you know if you're under 200,000 square feet, total and there's only as I said, there's only these 10 current buildings that fit into this 2000 plus mixed use. Category then you're basically broken out into your residential and commercial breakdowns, based on how you're structured as a co-op or a condo yeah. Okay and currently do you don't have any plans in the near or even further future of amending the tax that you levy on residential properties. We have no intention yep, okay, I, have more questions Renee, but I don't want to hog the space. So let me know if I'm allowed absolutely go ahead. Thank you, a question that is more land use related. So when you're going to you know, take over you know jurisdiction over those extended blocks. You know I, you know it looks likely that the city Council would support your action. You would have the ability to sponsor a land use action such as rezoning. Is it something that has been discussed? Is it something that you're considering it I, don't know? If we, it has not been discussed fully I but I. You know, especially with the conversations let's just say, going on right now, it's one that we would certainly be you know: I've studied up on and kind of worked with the community, our stakeholders, of course, which are a wide array of them, whether it's on the property side, the business side, the residential side, I mean we're in the business, is making sure that this neighborhood gets back up on its feet as best as it possibly can and we're thoroughly excited about. Where hat where had come to where we were and where we were going. But yeah I mean it's really it's a matter of. You know, opening that debate. Yeah I mean we wouldn't be if you're, meaning more like nuts and bolts Layla like if we would be an actual like applicant. No, but of course, in terms of the community, either a private or a city sponsored rezoning, we'd certainly be involved. Yeah. Let me ask you a more focused question. I believe that some blogs, some yeah some blocks on the northern boundary of your of the extended bid, are currently zoned manufacturing, meaning that no residential building, no residential development can happen or conversion can happen. As of right. Is it something that you have discussed internally, the specific use in a use change? We have not discussed it internally to this at this point. Okay, thank you. I have more questions Renee. If you still allow it, I'm sorry, I know I'm greedy, no, absolutely ask away you mentioned in the presentation that you have you're planning to work on a public realm work envisioning session. Can you actually elaborate on that? And specifically do you have any plans for sixth avenue? That is, you know both in I mean in the extended section. You know, obviously it's not yours yet, but even on sixth avenue, where the bid is already operating, it certainly looks and feels very different from Fifth, Avenue and Broadway. That seem to be. You know more favored in terms of the bid action, and you know I would be interested to hear what kind of services you're planning to provide yeah. You know what let me Kurt are you there do you wanna say a couple words on the street: the public realm piece I. Just so, I'm not too long-winded here sure hi, everyone, I'm Kirk Kavanagh with the flat iron partnership of the director of planning and streetscape and capital projects, so lily you're right. We do have a very different feel around sixth avenue and the current bid boundaries 24th, Street and south than we do up in the expansion area. Part of that is due to the fact that it's as ladies my historic district, they have a different feel and different building stock down there, but you know going up into the expansion in our visioning for the future. You know we have not yet begun working on any kind of vision plan yet other than an RFP that we were in the middle of releasing right until Covid-19 Hit, and so we haven't really pushed play on any of that. Yet so we're planning to do is really work with the community on what the future of 6th avenue with the future of Fifth Avenue Broadway. What it all looks like we like the idea of a more pedestrian focused district, so we'll combine some of that work with what we've already done in the streetscape. For you know, hanging baskets and beautification, and such yeah and I'll just quickly add Kurtz right I mean so a lot of when the bid was formed. The original flat iron bit was formed that one of the first things they did over the first two years was put out a streetscape kind of master plan and vision, and a lot of those things like Kurt mentioned whether the kind of palette that you see across the neighborhood have been implemented. The plaza the plazas were a vision at that point too, and we think it's the right time with the expansion and that's where we had kicked off to run parallel with the expansion before Covid-19 Hit was this kind of community visioning opportunity to help steer us in to the work we did in the public realm, and so we're excited to do that, and hopefully, 2021 will offer us that opportunity to work with everyone on that and one of the things we look forward to with working with the community on the visioning plan and next steps is we don't want to just you know, copy and paste what we've done in the current bid, we'd like to look at things a little bit differently. Not have you know the goal is not a set piece, that's homogenous throughout, but really it's a different look and feel up in the nomad section. For sure you want to keep that in mind and I would look forward to those conversations and really just you know, providing the services that we're used to providing, but in a way that's appropriate for both the current and the expansion areas. Okay, thank you. Lela, do you have more questions? I do but I feel really embarrassed that I have so many questions. I have a question I'll, throw it on I'll shoot in I. Think it's my last I! You know I'm going to disclose fully why I'm present, but not entitled I live in a building that is on 20th street 2-0. That is currently not in within the bid but would become if this expansion is approved. A lot of concern that I have heard from my neighbors- and you know in my building and other buildings on our block- is that the bid doesn't do much for side streets. What is your response to that comment? Well, I. Don't like to hear it. No I think you know, look obviously there's a lot of attention that does get paid on the major corridors just because the sheer number of pedestrian volume, but with that said I mean you know there are the side streets are part of the true charm and especially with the retail and the mixed-use nature of them. So we absolutely do service the side streets day in and day out when it comes to just you know, cleanliness and public safety. We try to do a lot with a little I can also say that you know compared to many of our other neighboring bids. We probably have one of the lower assessments and certainly one of the lower assessment rates. So we don't want to you know we're not trying to bang. You know knocking on the head with our presents, but absolutely I mean. If that's the k, we want to make sure that those streets are as vibrant as possible and whether it's tree guards and tree pits and banners as a presence and then making sure that there's opportunity for public realm of you know whether it's additional greening. That's another thing. That's come out of the public kind of public realm thinking using the extending the park as it's like central lung. Further out into the side streets, yeah I, you know, I know we work closely with a number, particularly mixed use, residential buildings too. Our office we've been on. We were on 24th street between sixth and Broadway for the last 14 years, and certainly worked very closely with our residential associations there. So yeah- and one thing I'd like to add with one street in particular- is that it isn't in the expansion area right now, but we did work hand-in-hand with a lot of restaurants along the block between Broadway and Park Avenue South for their very successful outdoor dining setups that have expanded into the road bed worked them on outreach on developing that plan, for them maintenance and working kind of liaison being a liaison between them in the city with D.O.T, and that is one of the more I mean, admittedly unbiased, but one of the most impressive restaurant streets that have come out of this in the last. You know, since July thanks, Nick I see your hand thanks, Renee James, on Layla's last comment about side streets, I, live on a side street in the current district and on my street. The bid created tree pits they plant the flowers in the tree, pits they have hanging baskets, say the and the clean streets they come and they sweep in front of my building is that the same service, those the same services that you'll provide to side streets in the expansion district yeah, that's at the minimum yep would be all about it. Yes, okay, thank you. I have no more questions. Thank you. So much. Thank you. Let me see if any other members of the committee have any questions raise you use the raise hand function, I'm wondering if we could take off the can we take off the screen sharing because I'm not oh, I'm sorry, yeah I just can't see anyone there. You go. I have one question: while I'm waiting to make sure there's no more, how are you going to embrace the new membership? Is the board going to expand or how are you going to get the people that are now joining? Who will be part of the Flatiron bid to have their voices heard yeah? We certainly are willing and open to both expanding the board. We're currently about 30 35 board members made up of property owners, businesses, residents, local institutions, community boards and elected officials. We want to make sure that it's as diverse as possible in terms of uses and people, so there's an opportunity, absolutely we'll, be extending and looking to either fill vacancies with expansion, members or possibly increasing as well as long as it's not unwieldy. The other opportunities, too is we do have a pretty robust committee structure too, which is open to public members, regardless of formal affiliation as a board member. We have a social services committee that works with us in our homeless outreach provider. We have a streetscape committee. That's focused on these issues around public realm that we've been discussing. We have a marketing committee, marketing and branding, which will be very important with the expansion and we've recently instituted a retail and hospitality. Working Group Committee focused primarily on small businesses and hospitality, obviously with an immediate lens on recovery and resiliency, and but one that we're going to continue. Regardless of the circumstances so- and you know I imagine there'll be a task force or Working group added to that, as we kind of implement a prepare and then implement for the launch of services in the initial year or two yeah thanks James all right, I'm looking at the panelists any more questions. Please use the raise hand, function, you're, not seeing anything from our panelists. I'm going to move to the attendees for questions and I. See two Todd Shapiro has a question Todd. Can you hear us? Okay, we don't have Todd, so I'm going to Todd. Can you hear us? Can you hear me now? Yes, okay, so my question, as you all know, I'm a big supporter of the bid, but I'm speaking in my capacity as a small businessman in the district, I'm the owner operator of New, York, City, Seminar, Conference, Center sixth avenue in the 20th 23rd street and I've been involved with commerce in the neighborhood for almost 20 years. I guess I have a couple of questions getting some sense of this during the meeting. Is you know what kind of feedback are you getting from? The other small businessmen in the neighborhood, as you attempt this expansion- and you know that's because really the things that you're talking about that you bring to the district- are city services that, unfortunately, our city can't even deliver anymore, but from the point of view of small businessmen, the things that you're doing in terms of the internet, social media and your website to promote the district is so far advanced and so incredibly powerful. I use that in my own business I, just wonder when I talk to small, I'm always out talking to restaurants and new businesses and news new people in the neighborhood- and they don't know anything about this right. So I'm just wondering you know what your plan is to get the word out about the services that you're adding so that they come to see the benefit of these things. Thanks Todd yeah I mean we work very hard to both. You know to make sure that we're broedcasting the terrific small businesses and businesses that are out in Flatiron, nomad and just the greater community. You know we lend ourselves as a resource on both the marketing side of things. As well as the on the technical assistance side as well, you know we continue every day to try to update folks on why this is beneficial. It's tough with many businesses just to get them they're underwater, especially right now to even think about you know, just the public realm maintenance responsibility that we're providing and taking off their minds to try to make sure that their workers and their customers feel good about coming into the neighborhood and shopping here. But yeah with any. You know any new business that comes in here and this will go for every single business. That's in the expansion areas, particularly the ground floor. We reach out to them as soon as we know that they're, you know that a lease is signed and they're already contemplating setting up shops. So that's going to be an extensive campaign over the coming year to say not only these are the services that we bring in terms of cleanliness, homeless, outreach and beautification, but also these are the services that we can help provide you with in terms of district marketing, getting your wares out there and also connecting you with resources and technical assistance and other businesses to help make you thrive, and you know it's difficult right now, but that's a role that we play great. Thank you Jay now, do you have another question? I could still raise. The only other question I have is as an adult as an observer of the business districts. I know the reason I'm asking this question is I know that some of the small businesses have the attitude you know what is this going to do for me right? So I'm just wondering you know, have you gotten any pushback to the expansion of the bid? And if so, you know, how are you addressing it? I mean what you said earlier: Todd we've heard a lot too I guess I didn't and I guess. I mentioned a little bit when I was I, think it was Layla's question you know, there's an explanation that has to go into saying, like what we are who we are differentiating ourselves from the city. These are, you know we're PA, we're providing a level of service, above and beyond what the city on a good day provides, and perhaps much more on a day on a rough day that the city can provide. You know we work hand in hand with the city's Department of Transportation Sanitation police, homeless services, economic development, small business, you name it just like this board does and we need them to perform and we need them to be a resource so that our services can shine above and beyond, and you know, hopefully in a time of difficulty like now. Our services are more visible and helpful and can at least allow the businesses to focus on what's going to allow them to stay afloat. But you know it's honestly, it's we have to make the we make the argument all the time with businesses as like. This is an assessment. This is an investment in your neighborhood in the surroundings around you that are going to help make you thrive. It is not a tax that can go off in any direction. It's here, it's invested in this community. That's something that we'll you know we continue to do. We've been doing it for the past two years too. So it's an ongoing effort that answers my question. Good luck, guys with your expansion. Thank you. Thanks James, we have Michael, Reef I, hope, I'm pronouncing that correctly. Maybe you can clarify the value in charging residences one dollar a year relative to the funds received and the administration involved in dealing with that yeah I mean look. It's the one dollar is something that this bid has been charged with and feels strongly about. Maintaining you know we're, first and foremost, a business district, we're excited and really fortunate to have the mixed-use nature of it and the vibrancy that residents have continued to bring to the area, but, first and foremost, it's providing value to our businesses, that's goal and mission number one, and which is why we're we do feel like it's important, that we maintain that the one dollar individual residential assessments- you know, that's just that's where we are on that. We know that there's still over benefit and we've been so really happy and grateful for the just. The outpouring of support that residents in particular have come to us with for the expansion both the current boundaries as proposed and up beyond I guess. You know it is easier to do that when it's a dollar assessment, but right now, that's where we are that's what we're proposing thanks James. We have one more attendee question from Victoria Watkins Victoria. Thank you, James. Thanks for the presentation, my name is Victoria Watkins, I'm a resident in CB5 I live near the proposed district expansion on Madison Avenue near 32nd, Street, and my question is one I: don't I'm trying to understand why they're on the southeast corner of 32nd, Street of Madison and Southwest corner of 32nd, Street and Madison are excluded from the proposed boundary expansion I would not consider those corners part of Koreatown or the 34th street partnership they're, not like tourist districts and they're, not part of Korea town. In fact, you know there are two buildings that are excluded on Madison Avenue on the West side, going up to the southwest corner, one is a large commercial, a decent sized commercial building class a and another one is like a commercial building that has a furniture, store, luxury store, Lizoni, that's on the southwest side, and then I mean the southeast side, part of me and then on the South Southwest side, there's a commercial building, so you know again, it's it seems like this boundary should extend the 34 to 32nd street southeast and southwest sides to make it inclusive of the community. The neighborhood for supplemental sanitation and horticulture support, you know consistent what you're doing on Park Avenue I like that you're extending the boundary all the way up to 33rd street on the southeast side. That makes sense, but the proposed boundary for Madison. It looks like you have orphan buildings, small businesses, three small, smaller commercial buildings that are excluded thanks. Thank you, Victoria and I. You know, I know we you just you sent a letter on this to everyone too, and I appreciate that again, the Ryman. The reason behind the map as drawn is that we set a 31st street north and South boundary with the one exception of the northeast corner of 32nd and Park Avenue South there's. No. There was no intention of cutting out anyone. The lots that kind of it's just basically drawn by property lot. So some of those lots go up right. They go up to the further up the street. Others are cut at the corner. We can't carve out individual businesses, it's all tied to property. Lots! That's why you see on the West side of Park, Avenue South between 31 and 32. It's the whole side of the block, because it's one build it's one lot, that's why on Madison Avenue, it's half of the block on the east side and three quarters of the block on the west side. That's that was the driving force here. Knowing that yeah there's a gap that still exists, but one that we felt might be a step too far in terms of this bids capacity to do a good job of maintaining and sustaining. But you know, I hear you loud and clear. I mean we've heard from like residents and buildings between 6th Avenue and 7th Avenue between Park Avenue and in Lexington, even 19th street, asking for inclusion, and we just we had to draw the line somewhere. Then I know it's not probably the answer you want, but that's where we are right now all right. Thank you. James I shared my comments, also with council members, Powers and Rivera thanks so much. Thank you. Victoria Thanks Victoria. Thank you, James, muted, okay, sorry about that. Just doing really quick sweep to see if there's any more questions and seeing none, I'm going to turn it to the committee for comments and just to remind people. We are here we're voting on the application for the extension, the Flatiron bid, expansion under the Euler process, so comments to that any comments by either committee facts, land use, okay, Clayton I will just make a simple comment of support for this, because I know that they have I. Remember the first meeting we had talking about this was probably four years ago when they first came to us in consultation. I know they have done very broad and considerable work with outreach. I, don't love the percentage of support letters that you've gotten I know it's really hard and I. Don't feel great about that. But I, that's my one concern you know and I'd love to hear what other people think about that, but I am in support of this proposal. I'll leave it at that. Thank you, Clayton. Let me see Ej yeah I'll just say as well. You know I have not been through one of these bid, expansion or definition processes myself before, but you know this proposal seems like it's been in the hopper for a very long time that it's well considered that it's being done in consultation with the community and that the boundaries are not arbitrary or ad hoc they're well considered for a lot of the rationale that we've heard tonight and you know I simply, you know, don't see any reason to oppose this at this time. Thank you, Ej other comments. I know that the Bex Committee has heard this plan many times does anyone want to share. Are thinking on that are comments that they have about the process I'm seeing Layla so once again, I want to preface that I am present, but not entitled. I would just like to suggest that maybe the bid can come back to us. You know six months after this has been approved so that we can, you know, continue to engage and I would also like to suggest that sixth avenue in every possible aspect of what the bid does, whether it's sanitation, homeless, outreach marketing or any other aspect become a priority. I know it is a priority, but maybe a heightened priority I think would be valuable. So those are my two suggestions. Thank you, Laila James. Would you be willing to come back to us in six months? Absolutely, okay, weird! Whenever you invite me or if you want me to pop in I'm more than happy. Yes, absolutely that would I would appreciate that and we have a lot of work ahead of us both with this process and then just getting going. If we get to that point, so yes, count me in fabulous Layla do I, see your hand is raised again. No I will unraise it. Thank you. Okay. Any other comments by the committee. Okay, I, I'm seeing none. So I'm going to what I've heard from the committee is that we are generally in support. We've heard that from Bex previously prior to this presentation, I'm hearing support from many of the committee members. I'm not hearing any other comments, so I'm going to ask for a motion in favor of the expansion of the Flatiron bid under this process. Second, and if I could ask that, the motion also includes that they would come back to us within six months of having been approved by the city council and that sixth avenue be a priority. Absolutely thank you so much. Thank you. It's Chuck Miller! So that's an invitation to them to come back. It's not a conditional approval or any other contingency. My suggestion would be that it would be just a suggestion, and you know in good spirits that you know they would agree to come back to us. It would not be a condition. Thank you right. So what we have on the table is the approval of this expansion of the Flatiron bid. We've extended an invitation which the Flatiron bid has accepted to come back to us in six months time. I had a motion and a second so we're going to move to the vote. I. Shall we do land use first Layla or Orbex? Four? Let's do line juice, Dave Achilles? Yes, Nick not entitled Mike, yes, Tristan! Yes, Matt I, don't know if he's still with us Ej. Yes, oh sorry, I was on mute. Yes, oh yeah, okay, Matt is a yes John, yes, Clayton, yes, Rachel yeah, Ryan, yes and Laila. I am a present, but not entitled. Okay! Thank you! So much Lando's committee. Thank you. We're going to move to Bex and I. Just will reiterate. I believe we do have quorum now on both committees. If we do not, it will be ratified by the exec committee and we will post one that when the date and when that meeting will happen confirming that we have quorum for the land, use, Committee, fabulous, okay and I'm going to turn to Bex for Voting Zach. Yes, Joseph Peru Laura, yes, Sam! Yes, thank you! Kim yeah chuck! Yes, p! Yes, Rachel! Yes, do we vote twice for each penny? Yes, you do like you and Dex has quorum as well. So thank you very much everyone for coming tonight. Thank you very much to the Flatiron bid for their presentation, and this will now go because of the timing. This is the timing of why we had this meeting on this date. This will now move to the exact for ratification, because our opinion must be submitted to I'm sorry under the Euler at January 4th. So with that I will say good night, everybody. Thank you very much and we will see the flat iron bit in six months time. Thank you. Everyone thanks everyone! Thank you! Happy holidays. Thank you! Happy holidays.",
            "summary": "Nonetheless, If we do not have quorum as we go forward or if we lose it any vote that we have will be ratified by the executive committee, so I will start now, because we are at 603, and this is a special meeting of both backs and the land use.\nI just want to explain why we're here and why we're having a special meeting Bex with the land use Committee and why James, Matthem and Kirk Cavanaugh are here from the Flatiron bid again to talk about the Flatiron bit extension.\nIs we're here to vote on the application for the extension of the Flatiron bid expansion, which is a process that follows the you look review.\nThat piece is done and we were part of that process back in February and March the Vex Committee, and now the flattering bid has filed the formal plans with the department of City planning DCP for the bid, expansion and DCP have referred this out for community Board review like the Euler process.\nThis also had a little bit of a change, so there's a new aid to assessment rate, which is a change from when we offered our support of the Flatiron bid expansion.\nYou know like if there are any technical questions that need to be addressed on the land use.\nI will do that, but I will certainly shy away from you, know, guiding the conversation in any way, shape or form, and any comments and questions that I make will be, as a member of this committee being present, but not entitled to vote.\nI know our friends in the Bex. Committee have gone through this as recently as a few weeks ago, but I figured just kind of get everyone up to speed to on who we are and what we've been working on for the past few years to get us to this moment that we're very excited about in terms of proposing our expansion of our service area in the nomad and 6th Avenue and 20th street corridor.\nIn terms of pushing to move on this expansion of our services, a look at the assessment budget and formulas that are required to underwrite the services and programs, as well as the outreach, engagement and support that we've been working on over the past year, both pre and post, Covid-19 outbreak.\nThese, are the boundaries that were ultimately approved back in 2005 2006 through the legislative process, roughly from about 21st street on the south bits and pieces of 6th avenue up to 23rd street, and then we taper in as you can see towards Broadway up until about 28th street, and then we taper out on the east side from Park Avenue south over to Lexington, to include the Baruch college campus and these you know this neighborhood.\nYou know in our relationships with the institutions here, whether it's Madison Square Park, Conservancy, Baruch college, the businesses, property owners and residents has been a constant and we think we've done a lot to make a big difference in terms of both the quality of life, the look and feel and the economic vibrancy of the neighborhood.\nWe've certainly noticed that we've had an uptick in street homelessness that we've been working closely with our city partners on addressing in the neighborhood, welcoming them as their neighbors, but also making sure that you know we're also managing certain streets street conditions as they arise as well, so we're working there with our partners.\nMany of those came back being similar to what the services that we've been providing and working day in and day out, to provide to the current bid boundaries, whether it's around cleanliness, public, safety, ambassadors, homeless, outreach and service provisions.\nYou, know a touch of streetscape improvements and in horticulture and urban design, enhancements around safety and transit access and then particularly lately, business, support, district-wide marketing to try to draw as many eyeballs and dollars to our ground floor businesses and regulate and navigate regulatory burdens.\nWe think this is an important time to address those and bring those forth for consideration and again open streets, open, dining, Broadway vision, There's a lot of things that the expansion of the bid will enable us to take on in earnest.\nYou know our clean streets, Our cleaning crews are out there at minimum 7 A.M to 7 p.m. Every day, extended hours during peak months, They've been true bureaus this past nine months out working in the community, helping to keep it clean and safe throughout this.\nThey're out working building relationships with individuals without shelter or homeless, neighbors panhandlers street homeless, every day during the week, typically from seven in the morning through the early afternoon, and you know trying to build that trust and help people access services if they choose to access them through safe haven, shelters and so on.\nA little bit, but you know we spent a lot of time, telling folks what we're up to making sure that people feel that Flatiron nomad the greater neighborhood is a place that they want to shop in work in and take a stroll.\nHopefully, As we move forward with the expansion, as we, you know, become a greater community, a larger community beyond just flat iron and 23rd street, and again business support working closely with the department of small business services, our state, federal and local partners here on relief efforts and advocating for much needed support now more than ever.\nThis is how it's been done since the late 70s, when the bid pro the first bids were created and it almost acts kind of like a cam, a community assessment kind of like how malls would work where there'd be a common fee, that a fee that's paid by each vendor in that case, to make sure that there's common area support throughout the district, so we're currently a 3.\nSo per the bid assessment formula that we use each benefited property owner's annual contribution is based on as I mentioned earlier square footage, and we do that through the following classes.\nRetail, commercial, professional classes is your typical commercial building in space we generate a formula taking that budget and dividing it through the total amount of assessed commercial square footage that comes out to about 16 cents, a square foot, That's what the bid property owners currently pay.\nIt's been very important that we, You know we felt going into this as a steering committee that we kind of pegged that amount, particularly in the initial years, so that no one you know current bid prop bid paying properties are not assessed.\nAny questions on that before I move, on, Okay, so, on the topic of community outreach, engagement and support, This is a very important thing that the steering committee seriously took and that the department of small business services who's the kind of the guardian of this effort throughout the city instills in every expansion and formation initiative.\nThis included flooring forming a steering committee of businesses, property, owners, residents, resident organizations, creating a statement of need for the expansion, doing a needs assessment over the past two years, developing a modified district plan that met this.\nMet, Those needs holding public meetings, conducting ongoing outreach and documenting support and then submitting a proposal to the city, department, small business services and then.\nAgain, We reengaged things again once we came out of the initial freeze through the pandemic, and we've been really doing what we can to provide various levels of Covid-19 relief and recovery efforts in the expanded area for the businesses and, of course, All that you know has helped yield an additional amount of support over the fall.\nYou know you may have seen you may have come across this, especially if you live in the neighborhood in the expansion area, some of our mailings that we've done multiple times over the past year.\nWe did those both in the lower part of the district and in the northern expansion area and then in terms of what we've been doing as I mentioned pandemic business support.\nAs a you know, as we represent interest both on the property owner and the business side of this, we've provided direct promotional campaigns from the all in flat iron and all in nomad to drum up some business for our restaurants and dry good retail over the fall, we've distributed, masks to businesses, I think it ended up being somewhere between 50 and 60,000 mass that we distributed on behalf of the city to businesses across the bid of expansion area and beyond.\nBut you know whether it's through the open restaurants and open streets can't work that we've been working with the businesses and community on or just a vision for a safer and more accessible public realm for all sorts of for everyone.\nWe continue to work on that to this day, and in each case you know they're, just fortunately, I think partially because of I think the great work and trust that this particular bid and my predecessor and its board have instilled in the community over the past 15 years.\nI think we should turn it over and look for questions from committee members I'm going to unshare for the time being.\nJust have a quick question, which is that if this was never meant to reach residents and if residential buildings in the co-ops and Congress have never been assessed, I mean, aside from the nominal dollar, I'm a little unclear about the rationale about why property owners should be assessed on the residential square footage of their mixed-use buildings.\nWe had conversations with the city with department, small business, services, city planning, and would it was advised that we take a look and not just keep, have a narrow scope of sixth avenue, but perhaps consider a district-wide one, and you know.\nYou know that great of a need for the bid services, some of there's some spillover- benefit on 20th street.\nAnd, I, Think I understood your the breakdown of the different building, categories, I'm, just a little unclear on mixed-use small buildings that would have retail on the ground floor and then residential above, which is, you know very typical of buildings, south of 23rd street.\nI've studied up on and kind of worked with the community, our stakeholders, of course, which are a wide array of them, whether it's on the property side, the business side, the residential side, I mean we're in the business, is making sure that this neighborhood gets back up on its feet as best as it possibly can.\nWe do have a very different feel around sixth avenue and the current bid boundaries 24th, Street and south than we do up in the expansion area.\nOne of the things we look forward to with working with the community on the visioning plan and next steps is we don't want to just you know, copy and paste what we've done in the current bid, we'd like to look at things a little bit differently.\nAnd I would look forward to those conversations and really just you know, providing the services that we're used to providing, but in a way that's appropriate for both the current and the expansion.\nYou know I'm going to disclose fully why I'm present, but not entitled I live in a building that is on 20th street 2-0.\nWe absolutely do service the side streets day in and day out when it comes to just you, know, cleanliness and public safety.\nI, you know, I, know we work closely with a number, particularly mixed use, residential buildings, too.\nSo yeah- and one thing I'd like to add with one street in particular, is that it isn't in the expansion area right now, But we did work hand-in-hand with a lot of restaurants along the block between Broadway and Park.\nSo my question, as you all know, I'm, a big supporter of the bid, but I'm speaking in my capacity as a small businessman in the district, I'm, the owner operator of New, York, City, Seminar, Conference, Center sixth avenue in the 20th 23rd street.\nTo, even think about you, know, just the public realm maintenance responsibility that we're providing and taking off their minds to try to make sure that their workers and their customers feel good about coming into the neighborhood and shopping here.\nYou know we work hand in hand with the city's Department of Transportation Sanitation police, homeless, services, economic development, small business, you name it just like this board."
        }
    }
}