{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UCaXkIU1QidjPwiAYu6GcHjg",
            "title": "CB 3 Manhattan -NYCHA and Section 8 Subcommittee - Oct 21",
            "publishDate": "2020-10-22",
            "shortDescription": "Agenda\\n1.    Roll call\\n2.    NYCHA: Update on Recovery and Resiliency\\n3.    NYCHA: Update on COVID programs and services\\n4.    Vote to adjourn",
            "lengthSeconds": "2:11:04"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "8kuj8416-6E",
            "fillerWordCount": {
                "uh": 176,
                "um": 480
            },
            "readTimeFullTranscript": "79 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "construction": 38,
                "work": 33,
                "residents": 31,
                "water": 30,
                "development": 27,
                "building": 25,
                "nature": 22,
                "member": 20,
                "project": 19,
                "recovery": 18
            },
            "wordCountSummary": {
                "construction": 11,
                "residents": 7,
                "flood": 6,
                "development": 6,
                "work": 6,
                "emergency": 6,
                "program": 6,
                "protection": 5,
                "water": 5,
                "resident": 5
            },
            "fullTranscript": "Okay, so we have a okay, so do we have a quorum? I just want to see at least we need to have we jackie. We do not right one two, three, four, five, six: seven. We need to have at least four members excluding me. So I see Alicia Sandra Troy, so we need at least one more member to start yeah. Let me let me see where Eric is. Let me text Eric. Now I'll text, Felicia, okay, I just admitted to reek. Oh wait, hi you in the meeting, yet we're waiting for you. I do not see you, okay. I think we do have to the people and Felicia's on our way. Tariq is here yep. We have enough people if Felicia is joining us very soon, because I'm going to do the roll calling later. So I do not want to miss her. If she's joining us in a little bit, then we should just wait a couple more minutes. Mm- Hmm is eric. Coming to the meeting I texted him. I do not see him. Okay, we actually have enough people, but if I start the role calling it's just that yeah they're going to be marked after that, first attempt yeah they're going to be marked absent for the first part of the attendance yeah. Okay. I think we should go ahead and get started Jackie, because I do not want to keep people long. Oh there's troy, hey, troy, you're at work; okay, all right, okay, cool, no problem, so we're going to go ahead and get started because Troy is here. Tariq is here Sandra's here I'm here, that's four of us out of six seven Michael resigned today due to work issues, so he won't be joining us, but he wishes to come back when he has time. He'll join back again. That's what he wishes to do. Okay, so I just want to make that announcement now. Thank you. Lhs go ahead, I'm going to mute myself, so it's 6:36! So let's start a meeting good evening. Everyone welcome to CB3 NYCHA and session 8 subcommittee meeting for Wednesday October 21st 2020, and we are conducting the meeting through soon tonight and and we have a volunteer cbp member Linda to help us manage the platform. Thank you Linda, for that. Linda is not a member of the subcommittee, but she's just being nice. Thank you. I want to let everybody know that we have a chat box here in the chat box. You can use the checkbox for checking in and also ask technical questions. You can put your name title and affiliation in the chat box. Can you Mil Sandra, please Sandra Central. Can you milk yourself please for a little bit? Thank you. So please use the chat box to sign in put your name title affiliation in that and then also you can use the Chat box to ask some technical questions. However, please do not use the Chat box to share your point of views or discuss issues with other attendants. I understand it can be tempting to do so, but please do not do it because otherwise you'll be removed from the meeting. This is a cd- free policy and I also want to emphasize that everyone who wants to speak during the public session or even at the committee session, please raise your hands first and get recognized by the chairperson first, because this is just to maintain the order of the meeting. So we can move it better and let me see- and the first item on the agenda is roll calling. So I'm going to do the roll call Eric? Yes, okay, not here Alicia Louis, Coleman President. Yes, thank you and Felicia Alicia, not here yet Sandra Center! Yes, thank you. Five Ellis and Camille Napoleon, no she's, not here great and then the second item on our agenda is the nature update on the recovery and resilience and we have a brian hornan. He is the Vp of the office of a inter governmental relationship for nature confirmed for tonight, but I do not see a brian is here: Hi, Brian Jackie. I do not think you called oh Tariq. Thank you so much tariq. Thank you for reminding me. It's update your name to the to the website. I do not have your name with me because it's not on the website yet and now make sure it should he updated it. Oh already, okay, thank you. Thank you. Tariq Brian, Hi, Brian, Brian's, still mute, so maybe I'll introduce myself yeah, so I'm Joey Cinderbrand, I'm the vice president for the recovery and Resilience department, and if not, if Brian is able to unmute. I will certainly let him speak first, but I really appreciate you having me here, and I also appreciate you sharing your meeting forum and style. I think one of the challenges that we've had during this process sort of beyond construction and the challenge of actually building in this context is how to do things like this, and this is very new for NYCHA to have these kinds of meetings and exchanges, and so we're also trying to use the technologies as best we can to get word out and information out with the same challenges. I think that you're having in terms of making sure everybody can access information for our part. One thing I want to say is: whenever we do public presentations, we also try to post them on our website so that, if somebody could not be there, they can always get them later and certainly the same way. You're re in your meeting. We try to record our meetings so that we can also make them available for people who were not able to participate. So I'm here tonight to give an update on the work, that's going on the lower East side and it's actually an extraordinarily incredible time to talk about resilience we're in October. You know we're right near the anniversary of Sandy, and so it's in particular on people's minds. You know the number of storms this year is at a record high and so we're very cognizant not just of the construction program, but actually the opera operationalization of that program and I'll talk a little bit more about what that means kind of as we go through. So I'm going to share my screen. If I'm allowed to on your system, no, you have disabled screen sharing. Are you able to enable it for me Linda? Could you share I'm going to make you a co- host thanks, just temporarily? Okay, all right I'll, try again here we go all right and folks, just let me know for sure when you can see it. So I can. I do not get ahead of you. Okay, it looks like Brian's in the waiting room. I do not know if somebody else should admit him I'll. Let him in thank you. They got close up on my he was here and then he was gone. He's here he's gone. If let me just see when he comes back, if you can speak, he might want to say something before I start. Is he here, okay, ask if we can see, I can see it, you can see it. Terrific, okay, well I'll start talking, and then you guys can you guys can tell me if there's any problems on your end, so I was. I was talking about how this is a pretty exciting year for us, and one of the things I want to talk about you know before I deep dive into louie's side is the program as a whole, because this is really setting precedent all over New York City and we're getting a lot of interest from the other agencies, because we've awarded every major contract, we've spent almost two billion dollars, acrosss the five boroughs, and this investment has meant that we actually now have sites that have both passive and deployable flood protection for the season. This season we have seven sites, acrosss the city that are protected and that could be protected in case of a storm and we have other sites that are have passive protections for critical infrastructure, and so there are. This is really kind of the the model for private property owners and for other city agencies, and, as you can see, some of this is really specific to resilience. But other parts of this program are really broader than resilience: Roof replacement, heat and hot water system, replacement security, amenities and ground improvements. So I you know we have a whole set of developments, some of which are complete or have been complete and have backup power, generators and new boilers, some which are practically complete. We use the term substantially completed laguardia houses, but effectively all major work is done and, as you can see, and you probably see as you walk around the neighborhood, these projects look different at every development, so in this case the mechanical electrical plumbing equipment, the generators they're in external buildings, but you've probably seen other developments where they're on rooftops Smith houses, as it is substantially complete for phase one. There is a trench of work phase, two that we will be starting as soon as we have coordination with the Ta in terms of structural reinforcement, so the great majority of the benefits have been incorporated this year. That development is being protected by the interim flood protection program from the city, but we have the backup generators are there and can provide emergency power if needed, and the new play area is, you know, complete and awaiting some punchless work with Dad's knee to to open both play areas. At the same time, two bridges is a smaller site, but again really just under completion. There. The boiler system has been has been turned over, which means that effectively is operational. The development is benefiting from this new system and not on the temp boilers, Campos Plaza, again 19 complete, but ready to go this season. Campus plaza is a small development, but even here with just two buildings, we have some flood protection, that's passive and we have some flood protection that requires logs to be deployed, and so we worked with other departments in NYCHA emergency services, emergency management operations to come up with the strategy for how we would do that this year, and this may not be a permanent strategy, but we are trying to build the cohort of subject matter. Experts in NYCHA to take this program forward. Reece houses was broken into two projects. We would raise. One reese two is farther along and closer to completion. You've probably seen some of the prefab modular buildings if you've walked past that site and the new site lighting is effectively up in lighting most that site and sorry in baruch, Lavenburg less far along, but also a very large site and a very large project over 200 million dollars. It's one of our largest projects and it's also a project where we're doing, in collaboration with Con Edison, to provide new high pressure steam to that development. That development has several sources of funding in place to protect both passively using the flood wall and also for buildings that are closer to the water. There will be automatic flood panels that rise up and walled houses. You know some of the work that you guys saw completed earlier, like the ramps and the entrances that the first picture on this presentation were the first phase there, and now we're really full bore into the major work at world houses, and you know really. Is it really is challenging to keep the work moving and be as sensitive as possible to the disruptions we are definitely causing to people's lives? And I did want to mention that when we plan when we have planned outages- so certainly not you know, emergencies is not what I'm talking about here, but for planned outages. If we electrical or water or heat there are criteria. We have to follow just acrosss the board in terms of notifications, and maybe some of you are on our lists and get the emails that we send out, get see the flyers. But beyond that you know, our department and the agency is in as a whole has been very sensitive to trying to as much as we can do them at times that are less inconvenient. There's never a convenient time to have no electricity but but trying to kind of work around when when people you know would be less inconvenienced trying to tranche those times. So, instead of doing long outages like an eight eight- hour, water outage, maybe doing two four- hour, water outages we're working with Rit Department to make sure we have the Nitro Digital Van and my five cards available, so that if we do an electric outage, we can help kids or people who have to have to log in for work, stay on the internet during that time, and while the weather was nice, we had both indoor and outdoor areas. If we did a crane hoist and needed people to evacuate temporarily we're moving toward the point of the year, where we're really just to provide indoor areas, interheated areas for people who need to relocate, but we are cognizant of it and certainly want to collaborate with anybody who has other ideas or resources they want to bring to these events. Reese one again broken up from these two so less far along, but starting to move pretty quickly, and you might have seen some of the generator dunnage lifts. We have a series of these lifts planned over the next few months weather permitting again. These lifts DOB requires us to empty the top two floors of the apart of the building, and so we will be providing indoor spaces for people if they do not have a friend's apartment or another place to go where they can rest have water or snack and stay safe until we can let them back in their apartment, whoops, and that was essentially the short version, but I assume there are some questions and I'm I know some people have knowledge of specific developments and issues so feel free to throw those out now and and I'd, be happy to either answer them or get the information and circle back with you guys. Brian is your mic broken, I'm not sure. If you wanted to say anything also, can you hear me? I can brian great okay. Well, okay, I can turn on my camera too. Look at this wow. Okay, only six months into this, I figured it out. No thank you. Thank you Joey for that presentation. It was really informative, a lot of work, but I also know that it's been really inconvenient for many residents. You know on you know in these developments and but there's just no other way that you could do work of this scale without inconveniencing me. I think in any of the city. They would probably relocate people to do this type of work, but New York City, that's not possible. There's nowhere to put people and also people want to stay in their neighborhoods. So we have that balance between you know doing improvements that everybody does want deserve, but at the same time it is disruptive but but- and we acknowledge that and want to hear- and if people have ideas too of things that we can be doing better, please you know that's what tonight's for and let us know so. Thank you so much joy. I appreciate that Brian and I will say there were moratorium. I do not know if anybody noticed for a period of time on utility outages, we waited several for several months. We did none at all, except for emergencies. Now we're phasing back in again. This is really about making sure that the beneficial use of all this investment, you know, really can be used by the residents. If we put in the new electrical equipment, you know we want people to be able to get the benefit of it. If we have a new generator, we want to be able to turn it on so that people can, you know, can have use of it, and so that's why we're trying to forge ahead here. The there's there again are the standard ways of communicating, but in this new world we are open to all ideas of better and more ways of communicating to make sure that you know if the robocalls or the flyers or the emails you know are not getting. Try people is it. You know, if there's other ideas, if your groups can amplify our messaging so that everybody gets the information you know we we'd like to make sure we're connected. I know Michaela's here also, and I know she works with a lot of you for very specific issues and I'm very impressed with her. Her reception live from the street. I I dare not make these calls from the street. My my bandwidth does not work out. That way. I saw hands up, but I'm not sure if I'm supposed to call on people or if the facilitator does that. Yes, this is the so we're going to open up for the committee session, and I see Alicia has a hand yeah good evening. Everyone and thank you, joy and Brian for coming out tonight and explaining some of the things that are happening. I just wanted to make sure that the residents in the NYCHA developments are getting proper notification and, as you just explained, joy that you've been sending out emails and flyers and and text messages to the residents. Am I correct joy and I I'll let Michaela talk about literally the step- by- step. I said text messages, but actually that technology is still, I think in the pilot stage. So we have not used that yet, okay, so Michaela I'll. Let you speak to the standard notification requirements before an outage unless you're on streaming hear me? Yes, Michaela, we can hear you go ahead and use this technology. Yes, not only is the notification important, but timing of notification. We really strive to 72 hours before an electrical or a water shutdown, minor, George door of the building impacted, as well as to phone calling to the residents. We figure between two methods that they will know. What's going on. We do these flyers in four languages as well, so we also keep in contact with the Ta once a week. That is critical. I will tell you today the Ta we had a. I did a lift and the Ta lent me her wheelchair, because someone could not leave her apartment, and that is the rapport building, that community outreach works on building. We help each other out. So we dialogue not only with the Ta with residents that have questions, they call our phone, our hotline and we get back to them as soon as possible. That's really what we do so I want to just say that there are three members that were are present right now that live in nature developments and I'd like to really hear from them as far as how notifications are working for them. If I may, jackie, okay, let's start with tyrique tariq, can you tell us if you get the notifications, if there's an outage or if there's like a shutdown of anything, and how does it show up for you and your development, because I know you do not live in the same development as Damaris and Troy do yeah? What is the do? You know the separation between rhys, one and rhys, two you mean which numbers yeah like what is research for the street, I'm on H Street. So is that reese, two yeah, that's true! It's like right on the line. Okay, yeah! I mean I literally woke up this morning and found out. I would not have water like I'm closing. Are you in the moon, I'm in 108 avenue g all right. One thing I want to clarify is NYCHA. Nitrogen management has adjustable work as well. This week they were doing. They were cleaning a lot of the water towers and some of that involved water shutdowns and had larger impact than the superintendent realized and residents get confused who's doing. What and it's something I deal with all the time explaining where strictly the recovering resilience work and some of the[ _ _] down to ours, but some of them are niches and it's not a passive butt thing. What I try to do and what we do is if a resident feels like she has not been notified as we let our nature conduct know right away, and I was I was on your webinar, the presentation that you did about a few days ago and things that are happening right, the recovery resilience anything that's happening on the roof right now. That's a part of the recovery resilience project yeah, so the water I looked, I found out about the water shut down, but it was related to the construction. That's happening on the roof which is related to your project. I do think that why that shut down be related, what I will say is, depending on what's happening with construction around the building. I think postage is fine. I think when it comes down to outages that are truly going to impact the resident right that, like my daily life, is going to be impacted. When I get up, I think that needs to be door- to- door. Outreach like I need to you need to ensure that you put a flyer in my hand, that explains that outage for many residents, but if it's but I, but I also know you know- and it's I do not think the onus of the residents to know who's doing what outreach. That's not you know you guys have to find a way to work together and be clear with one another, because it's not our job to know whose job is who and who's supposed to give me. This information y' all are all under a NYCHA umbrella right, and so you have to be able to work as a collective in any organization. If you want us to feel safe or feel happy with the work that you're doing, and I work with both with all the teams in nature, and I think I think you're 100 right. That's saying that, oh, it's a it's! An operations outage or it's a recovery, resiliency outage, there's a capital project outage. All you know is that you went on and turned on. You tried to turn on your water did not have any who caused it or who's responsible for it does not matter it. It inconveniences you and that's what does not matter and going to door- to- door, I'm not sure. If that's that is physically possible, I'm just going to be honest with you one of the things we should be doing and we can find out why it was not done is at least you know, having a robocall or making sure that things are posted. You know at least more. You know prominently. Sometimes I you know I ask about postings and I see them and it's either it's like one flyer by the management office and if you did not pass by it and there's nothing about it, that looks you know very unique. You know to the 10 other flyers that are up, so we need to do a better job in that area. So I 100 agree with you. Thank you for your honesty, Brian. I appreciate that. I'd like to hear Troy and then Damaris and oh and then I see some other members from the public go ahead, Troy. Well, I have a big concern because I live in baruch houses, one of the largest construction plants going on the city and we've just been bombarded by construction for a couple of years now and construction is going all through each and every building of Peru all at once, instead of in sections, because there's asthmatic children there with a pandemic happening the air quality myself, I have a problem with breathing from Covid-19, so I want to know why all the construction is going on at once and the tenants were not really notified like what's going on. You know, that's one question that I have so I do not know if you, if you already know Michaela. I know she attended any any potential opportunity to speak with tenants through countless in their birthday meetings, and I know that was an issue. We certainly want to make sure we get the word out and that's part of why we're here tonight and that's part of where we try to take advantage of these opportunities. The project at brooke houses again is one of our largest it's over 200 million dollars worth of investment. It includes a completely new heat and hot water system. Site- wide distribution of that system, full backup power for several buildings, which also means they'll, have to run electrical conduit to buy that power to those buildings, distribution for new site lighting and so that kind of infrastructure. In some ways it's very difficult to phase, because there are interdependencies when you do the distribution, but even more than that as it stands, that project is a three and a half year project, and so, if we had phased it more, it might have extended well past that money was expected to be spent so we're we are. Actually you know lamenting being this long since sandy and not having the project done. We certainly do not want to extend it longer. That said, the top priority is really the safety of the residents, and so when it comes to dust, I know I've done walk- throughs with several of the elected and some of the folks on this call. I know that dust and dirt was a real concern for residents and we work really hard with that contractor and we still do a lot of responsive, a responsive feedback contractor whenever they are not doing the appropriate dust mitigation. So what that means is, if you see a pile of dirt at the end of the day, not covered if they're excavating and they're not wetting the ground, if they're not using the vac truck, please make sure please call my number you can notify us and we'll follow up in addition to our team in oversight, we have a third party oversight that we're paying for through the Department of Investigation, to make visits and NYCHA has its own safety and quality team. That's not part of my department, so they do not report to me and they make an outside visits, but residents who are there every day all day, you're definitely going to see things we're going to miss, and so we want to hear about those. So we can respond to them. I know Michaela has responded to a lot of those things. Hello, yeah Michaela is that are you available? I guess nothing to the gentleman that complained about residents do not want to hear who's him, but one thing we do is there is a number a hotline number. If it's not us, we forward it on to the person or the group that is doing it and bring it to their attention. I mean that's what I can say. Okay, I have one more question. Go ahead. I know during your presentation you mentioned that that there was a certain amount of money distributed between NYCHA and in certain areas. You did certain things like playgrounds with Smith houses and things like that, the routes being one of the largest or the largest nitro buildings in New York. Have you guys thought about putting a community center back for them because we have over 6,000 residents here? And you know we have nothing really. We have a park, that's under construction with the things that you guys are doing there and there's no outlet for the kids, especially during pandemic, is you know we have to have some type of outfit for them? Who wants to answer that so yeah joey? If you can talk about how the funding came about for things like playgrounds at Smith, I could talk about. You know the bigger picture for nature funding too. So I'm going to put in the chat, I hope it says: okay, the link to the scope of work at baruch houses, and I realize you're on your phone. So you might not be able to see right now, but you know each development was each development, had a scope of work negotiated with FEMA on a side-, by- side and a building by building basis, and I say this because the reason this two- pager has so many bullet points and all the two pages for all the sites of so many bullet points is because there were certain things that FEMA explicitly funded at particular sites due to the visible or recordable damage from the storm. What NYCHA tried to do was take the funding was given for those things whenever possible. You know solve two problems with the with the solution for one. So if we put in backup power generators, they do not just work in a flood. They also work in a blackout a hot summer day, but when it comes to some of the grounds, restoration and some of the improvements like community centers, they were either explicitly funded by FEMA or not as part of this program, which is not to say that there is not future funding. That will also still come to baruch and I'll. Let Brian talk to what that might look like I'm sure. So when I look at baruch houses and, quite frankly, all of the developments on the lower East side, the need for a community center is there how nature made decisions on where community centers went in the past is is beyond me. Believe me, there was a you believe it or not. There was a time when I was not at nature, but but there certainly is a need for it, but right now the limited funds that we do get. We are just investing in the infrastructure of the building sometime in the near future, though, I would like to be invited back to the board and we do have a plan in place to which would allow us to get additional capital money and would allow us to do things, invest in community centers and stuff like that and maybe even construct them, but there's a very new deal plan which I would need about 45 minutes to explain right now. There is no plan in the near future. There is no plans to invest and if we had more money I would not even say that we would put it in there. Baruch has just a tremendous amount of needs for their infrastructure and that's really where we need to be investing in okay. I thank you. I see thank you Brian. I see Sandra who's, a member of the committee and then we'll discuss public members. Okay, so Sandra, please unmute yourself! Alicia did not you say you were calling on me next, oh yeah, sorry Damaris! I got Ta call on the committee members first and then I'll call you okay you're next in line right after Sandra, because I thought that you had all right, never mind. I'm sorry, I'm sorry Damaris! I'm not sure why I'm on this call, then, because I do not know- do not go anywhere. I just wanted to make sure that I got oh all of the residents hold on. I'm sorry. I do not know what's going on here, hello, okay, so I do not know what's happening with this stuff here. Okay, Sandra! Do you mind allowing Damaris to speak first because she is a resident? She can speak, that's fine, because normally what happens is we allow the committee members to speak first and then we open up to the public, I'm sorry Damaris, I should have I'm aware I was. I was one of the founding members of this committee initially, but I thought I was also on the committee. That's what I'm expressing to you now. Oh okay, we're waiting too much time with all of this go ahead. Go ahead! Really Sandra! Please where'd! She go where did Sandra go. I do not know if she got booted off Okay Damaris. While we waiting for sandra, please go ahead all right! Well, first, hello, Brian! How are you nice to see you? I know that always nice to see you. Yes, always nice, to see you Dubai! Also! I you know, I did not see the presentation, so I just before I speak. I just want to make sure that I'm giving that I'm speaking to the right issue here. Are we asking for feedback on sort of nature's response to Covid-19 or just in general. You know any measures related to Covid-19 or you know, what's happening, development- wide. I think right now, right now, Damaris were talking about recoverancy resiliency, so the sandy work and then you know one disaster at a time. I guess that one and then right so yes, so I asked because I know we were asking about like how Nike was notifying tenants about outages, etc. So the first thing I'll say is that yeah, I'm going to agree with everyone else that you know it's really overwhelming as much construction as there is, and it also feels relatively unsafe because there's so much fencing and covering and these new you know, walls that are being put up. You know there's a lot of blind spots here and I'm very concerned not only about this moment in time, but what the future is going to look like, as I walk through the development which I try not to do alone, which you know my whole life. That's never been an issue for me, but, like I'm scared to walk around parts of the development at night. That's me, that's just my opinion there. So that's! You know one thing that I'll mention the second thing I want to talk about, and so you know what kind of mitigation is being done around. You know the rodent infestation, which was already problematic and happened for many years, and so you know I do not. I have not seen that necessarily reduced and in fact, I'm not going to say that I've seen like a whole lot more rats, but I've seen some crazy looking rats recently, like almost caricature kind of reno, like huge rats that you know one night I was almost freaking out on the you know, standing in the middle of the street, and I called my son and was like please come down and get me and he was like what am I supposed to do about the rats, and so you know like I do not know we can distract them like. This is how desperate the situation was with the rodent. The third thing I'd say is that with the construction and these issues on the racks, the garbage that is- and this is not necessarily a it's- not a sandy issue, but because there are these, there is this conclusion because of Sandy, because you know, I think that the construction has led to an increase in road in the road population. You we, I can only imagine that the trash and if you've come through baruch is just making that situation worse and then. The fourth point that I wanted to raise just to say is that you know I do appreciate that we get these calls to notify us about certain outages, though they're not always consistent, and so sometimes the water is getting turned off because of the construction, and I'm not getting a call for that. But I'll tell you what I am getting a call every time my elevator goes out, which is all the time. These days I get about. Five robo calls from NYCHA a day. It's so much that I'm almost ready to like send you all an email and say please stop calling me every time the elevator goes out. It's like your service was interrupted, your service is restored, your service is interrupted, but when my water went out for an entire day times during, so that's a lot of good points, and I want to. I want to speak to some of them because they're not they're, they are. There are challenges to us to do better. Like Brian said, we are not separate from our depart from our sister departments, but we do try to collaborate. Rodents and waste go together, and so you know you're right. There was a problem with rodents on the lower East side before construction and the construction exacerbates that problem by just disrupting the burrows that the rats live in. The reason I want to talk about collaboration is because we have requirements in our contract, our contractor to do certain things within the construction area, but we also work with other parts of NYCHA. There are kind of the rat experts, we call them and we make sure that if they have additional resources that we're strategically applying those resources, so we are not duplicating efforts and that we're you know we're poisoning at the same time collapsing boroughs at the same time and doing that the trash issue- I you know kind of straddles the different departments- and I know it's an ongoing issue, especially at baruch, and what I will say is if there is something that we can do within the construction project move a fence. I know at Reese we talked about shifting a fence so that a certain area could be available for trash. You then, please bring that up to community outreach. Let us know your idea and if it's possible, we certainly want to be supportive of anything that would reduce, reduce the rats for the outages. I you know I want to just make sure that I was explicit between the planned and the unplanned outages, so the subways Notice Michaela talked about the robocalls, the flyers, those are requirements for planned outages. If there's an emergency, if there's some unforeseen condition, NYCHA will certainly try to get the word out, but I do not. I can't claim that knight is meeting those requirements. The requirements we're talking about are explicit and they're very regimented. So when I go to do, let's say an electrical outage at this point, I'm literally going all the way up as high as the Gm's office to make sure that everyone is notified, and then it goes through a regimented process to ensure that flyers are posted. We have to take a picture of the flyer so that we have proof that the flyers are posted. We have the robocalls go through a system that that's automated. I can't speak to the elevator outages. I do not do those, but it may also be that there are requirements for elevator notifications that, basically, are not something the agency gets to pick. It may be that there has to be a notification. That's it. What you're talking about with the over inundation is something I'm really interested in, because it does not help us to tell you things tens of times so that as soon as you hear, it's a robot call from NYCHA. You hang up. That does not help anybody right and we, so we need to figure out how to consolidate this information so that you get a notification one. You know truncated text or I do not know, I'm not even sure what would be the best format. You tell me it hyperlink on your phone that goes to a website. Is it a an email? You know what is it that we should be thinking about blue sky thinking if we could communicate the best way possible? Would not that look like because I'm telling you my building does a flyer by the elevator and that you know like hey, so I'm trying to figure out what else we can do that you know is not manpower. Heavy, the knocking on every door is really manpower heavy and what we do not have is additional bodies, but we should be able to leverage technology. So again, if you know roboculture driving you crazy, maybe we shift to a different platform, but what would be the best way to get information to you? Do you think? Well I mean I'm not. I did not say that I did not appreciate robocalls. I just do not appreciate receiving so many, and I guess I hear you, which is that you know if I'm getting so many over elevator issues, but I'm not getting robocalls over the sandy related. You know con construction issues. I think that there's some problem there, I'm just raising that to you all those calls are not coming through. Do I do see. I mean and I've gotten a few, but I have not gotten a lot, not the way that I've gotten these elevator ones and they do post a flyer, I'm not going to say they do not post a flyer, at least in my building, but during Covid-19 most a lot of people were not going outside. So I had a lot of surprise: no water. No, you know no hot water that was being shut off due to construction because we were not going outside. So that's just something to think about. In these moments we have to operate slightly differently, and so I'm familiar, and I know that the departments are different, but much of what I've raised. I'm talking about how that has exacerbated or made the situation worse, so that you know- and I do want to say that so much construction on the development ground. So imagine what it must feel like for us that this construction is happening because of a disaster that occurred. We're in another disaster, that's related to a pandemic now, and so, while repairs are being made on one end for flood protection, we're trapped in our homes and there's nowhere on the development grounds that you can go to get air to sit down to be outside. There are no benches, there's nothing. So I have been working remotely from home and most people who know me know I probably come outside once a week because there's nowhere to be, I mean it's if you're depressed and feeling trapped at home and you walk out of your building and you are surrounded by construction and blind spots and garbage and rats. It's like it's. Like it's mental torment, you know it's crazy, so you know I do not know what we do. This is I'm just sharing an experience with you all so that you all can you know think about these moments as you move forward, if there's anything in the remaining time, since we do not know how much longer we're going to be dealing with this pandemic, you know, maybe there are some things that recovery and resilience, the kids. The department can do to make this time more bearable for us. I appreciate that back and I will say that it is not just the recovery resilience program if NYCHA is able to get the funding. It's trying to get this kind of investment would happen at every development right and so that question of do you work faster and more comprehensively over an entire development, or do you phase longer but make it less, you know less intrusive. These are the kind of the big questions that are important for the agency, so your feedback is really appreciated. Thank you. Okay. I see there were a few other hands. I just want to make sure I address everyone's hand. I see that Eric he's a member of the committee. Eric has his hand up and then Jackie you had your hand up so go ahead. Actually I just wanted to see if we can focus on this sandy recovery and resilience first and then, because later we have another topic, that's going to be talking about services and also and also Covid-19 response. So, let's, if we could finish the sandy recovery and resilience first, then we move to the next item. That would be really good. I think, okay, I thought that's what we were doing so. Thank you, eric you're there. Yes, I am. My question is not related to the sand recovery, so I will just you want to hold off. Okay, go ahead, hold off on that one. Anyone else has sandy related concerns, and I see that there is a member from the public that is on tonight. So what we normally do is we take members of the committee first just to let you know, and I see that Sandra is a member of the committee and then I see Tommy and John Belasco, who is our district leader in that area? And so, let's take let's take Sandra's question. First, go ahead, I'm sorry about before I got cut off, no problem go ahead. Sandra I just want to speak to. I was going to talk about the robocall. I thought that because Troy Tariq was saying she does not get the messages. So that's what I first wanted to talk about and Demaris. Thank you. So she brought that up, but you said that you communicate your agency communicates the resiliency issues and the construction issues to NYCHA, but it does not seem like Nige is really talking to you because with Tariq's, for example, Tariq's water outage today right now, can you answer why he does not have water today? Did they explain to you why he does not have water, so I I was trying to focus on this meeting, although I was tempted to use my other screen to look up. The outage, while we were talking, I do not know if Brian had time to do that while we were looking so there certainly are ways for information to pass acrosss, I'm managing a three billion dollar construction program. I would not know off the top of my head kind of every outage of every building, which is not to say that information is not available. So if he had called the hotline, even though it may not have been a recovering resilience outage, we would have found out what the information was and shared that so I do not want to make. It seem like there are walls up. It's just that. There's so much going on that. I you know it's a little hard to keep it all in in my head, but definitely you should always feel free to use our hotline if you, even if you're, not sure if it might be us if we might be impacting it if covering resilience, can help in some way. We would certainly want to be a resource as much as we can also would not. It just seems more of a common sense to focus on the most vulnerable verse and get it done like it seems like they're spreading so thin as opposed to just getting it done. We know the roots. The walls are very vulnerable, less vulnerable. I think 286 over there. Why is it more effort being done? You know to get rid of some of this construction and some of these hindrances right. I do not understand why they're just not trying to get it done in one place I mean I did not think this is the tension that we were talking about. I can't remember if you had lot come back in at that point, but you know I got a question a little earlier about. Why did not we spread construction out more so that it was less impactful on an entire development? And it's exactly that tension right? It's we already have massive products. We want to get these projects done so that you get the benefit at the same time. Getting it all done at the same time is really impactful to resident, and this is I mean if you would have focused, if you would have focused all your energy say, the balloon, it would have been done much quicker and it would have been impactful yes, but it would have been done by now. I mean now it's just spreading it over and they still can't walk. They still have an area, you know to sit or to breathe or the children to play walk. You know, and it's just bombarded. I do not understand why it has to look like this with so much so little being accomplished. So we really I'm sorry. I misunderstood the question. Each development has its own general chapter and its own construction manager focus on getting that project done. Okay, so I I'm sorry I misunderstood before we are pushing at each development with aggressive timelines to get projects done and one of those challenges is those timelines push contractors to try to do as much as possible. I would not be honest if I did not acknowledge the fact that they are working in a context where there are. There are issues that they can't that are not part of our scope of work. There are other issues that people are dealing with in the buildings that that we do not have the funds to fix right now. Voters also impact construction. So if we go to do work in a basement and it is flooded, then we can't do the condition either. So what we do is we have aligned incentives with you to get that flooding fixed. We want it fixed, so the residents do not have flooding and we want to fix the construction, and so, while there's impacts of schedules, we're working closely with the departments to keep the projects moving as fast as possible. I do not understand so they have each individual constructed construction companies right. Yes, I mean there are some that are our project. We had to bid each project individually and so the way that the requirements are for this kind of federal funding is you have to bid it out and then you, the lowest, responsive and responsible bidder, gets the project. So there are some contractors that have more than one project, but each one was bid separately. Thank you, Sandra. Okay, I see Camille Napoleon who's. Also, a member of this committee of the subcommittee go ahead. Napoleon, Miss Camille! What's your question good evening? Everybody I'm coming through. Basically at baruch houses we have a lot of safety issues and concerns and construction has started. I get a flood of calls on a daily basis from tenants regarding the minute we shift from one construction site to the other and they start a new break at any site at baruch. We are completely that side is completely in the dark for days. So if they remove the Exterior lighting because it was in the way and there's construction, the minute we break ground on any segment of brooch the come in, of course, that this building in that area is completely in the dark. 75:79 is a consistent issue where the lighting is always out. Tennis are calling a complaint. I do not know it takes her a day and then not fix 296,298 there's another building who's, always completely in the dark, the back of 50:60 Columbia, I mean I could go on and on and on. So that is a big issue with construction. Here, the minute you move from one area to the other at baruch houses. My residents are in the dark and it takes days before it is restored to it. As far as communication with service interruption outside of Covid-19, a flyer in the lobby is fine and 90 of the time. That is what you guys are doing. It's firing all our lobbies, but let's be realistic, we're covered. We still have plenty of residents that do not come out of their home. We need to do better and when we do a service interruption, we're not interrupting the whole development at any time. At the whole day, it might be a building or two what's the problem with going up and actually flying or knocking on doors or sliding a flyer into someone someone's door. The robocalls are not coming through outside of the elevator once like Damaris said, I got four of those elevator calls today, but for service interruption, I'm not getting those robocop, so those are really important and they're not coming through. So I do not understand why we can't take the time to come up. We're at Covid-19 times have changed. Many are not coming out. Why can't we come up and service these people and knock on each door and hand them a flyer. You know 42 hours in advance or 72 hours in advance. You guys plan these shutdowns. You know we deserve to know when we're not going to be able to have water, we need that water we're in Covid-19. You know I do not. I do not understand why we can say it feels like it's like we're on a merry- go- round and we got ta keep repeating the same things. It's not fair. Every time the light goes out. You increase the population of rats in the entrances of those buildings. People have to literally fight like the Maricedo call, husbands or wives, or whoever to come down and guide them into the building. So we have to deal with fences that we can't see through half these fences are changed so now. If you closed off, my residents are not sure they're crossing you want to cross to get to the one supermarket we have in the area. You fence that, but then the very next day you changed it, because now you have to dig there. Why were not? We notified the day before that particular site was going to be changed so now, residents who need to get to that one supermarket. We have catering of baruch houses are trying to cut through and cats. Do you know how many elderly live here? I think we need to do better. We need to step up our game about informing people when we're closing off areas and opening up new areas and when we start construction and we move it over to another end, lighting has to be a must. We're already battling rats to get in we're battling security issues, safety issues, and on top of that, you forget to give us light in the evening. It does not make sense we will watch. I appreciate both of those they both need. Some follow- up on my part, I'm going to circle back with my team and get a sense of what complaints have come through about lighting the contractor to just remove lighting and not replace it until we definitely want to be on top of that, and and certainly any complaints you get if you have not already been folding them to the hotline or through the disaster. Dot recovery address. Please do so. We can have a record of them on our site as well, and then your other issue about notifications. You know I'll just echo what Brian said I'll be honest. I have more bodies for notifications than any other department in NYCHA. I do not have enough bodies to do door-, to- door flyers for everything. So really is a question of how do we amplify these messages? I'm not sure what it would. Look like. I'm very concerned about the fact that people are saying they're not getting robo calls from one department, it's the same robocall system, so there that really could that does concern me, and I do not know how to test that, but I will call I.T tomorrow and find out how to figure out why people would not be getting those calls, because a single system essentially gets fed this building at this development needs this message and then it should be automatic, and so I would not be in the message, because I'm not living in that building that development, so I do not know how they are certain it goes through and I'm going to check with them about that and just one final thing before I go on the Fdr Drive 90 of the entrances are these wooden bridges they created to get tenants from the sidewalks into the actual building. Okay, half of those are secured, residents have tripped, have gotten caught in them. It's wood. It changes with the water moisture. It expands, I feel like they need to be better inspected and better secured, but you know just give back to the residents. You guys put them in, they need to be secure, they need to be safe. A lot of them are not secure and safe. A lot of them are so narrow. How do you get a wheelchair through, like? I do well to be certain all the time? Sometimes we can get cars around these bridges just to get the food up to deliver to our residents. There are things that need to be looked at. We have people here on wheelchairs powered chairs. What, if there's an emergency and an ambulance has to get through? There's things to be thought of here. These bridges announced a cure. I've had residents fall there. These are things that need to be looked at and I think they should be inspected weekly to make sure that they're proper and they're safe and that they meet the guidelines so that we can get through. I mean we struggled like I said in the meal delivery program, just to get some of our carts through and then that's me with a card and I'm walking. Imagine someone with a wheelchair. Some of the bridges you can't even get over people need to be pushed over like I do not think they were thought of before they were put in. So if so should not happen. If there's a if there's a ramp that you think does not meet ADA requirements, please actually any of those ramps on the Fdr Drive 577,59, 605, 595,549 521. All of those need to be inspected right and definitely if the condition has changed, please let us know. I know we had this to come up. I feel like it was maybe a year ago, and so I know we re checked those entrances at that time to ensure that they were all ADA compliant and DOB compliant. I just want to reassure you when it comes to emergency vehicles and fdny, we do run all of our site safe plans by them to make sure that it meets their requirements and we've had to make some accommodations for their very specific requirements. So I can tell you they have reviewed them and and approved that, but we want you to feel safe as well as being safe on paper. So so, if you see any conditions like this, sending us a picture, certainly helps or calling the hotline and Michaela is another way to get us. The information somebody man's the hotline in the email address every day, so you won't go more than you know. I guess a business day or two business days before response. Thank you Camille and thank you joy for your responses. I do not want to lose sight of the agenda, so I just want to make sure that I got everyone's hands. I still see that there was okay Sandra, you spoke Damaris, you spoke. Did you have something else to say and I see who else? Okay, we have a member from the public. If all the committee members have spoken, then I can now take a question from one of the members of the public and then I see that our district leader, John Blasco, is on as well. So I just wanted to see if John had anything he needed to say as well, so I will sandra, are you done? Did you have anything else you wanted to say about the you're resiliency honey? Okay, thank you. Okay, all right, thank you sandra okay, the public right. Yes, the I'm sorry! You are Hun you're, not on the member on the committee, but if you'd like to join the committee, I'm going to tell you again. I do not know why, after you all called me and asked me all about this, and I told you that I would be so excited yeah, you just got ta fill you just got ta fill out the proper paperwork. That's all! That's it we'll make sure you get it tomorrow, though. Okay, I promise you'll get it tomorrow, I'm not a public member son. I'm Alicia! You know I'm a full boy. No, I know you're a full board member, but on this subcommittee, you're, not a member, but we have to get the proper paperwork and we'll make sure you get that. Okay, Jackie, please, okay, we'll make sure she gets the proper paperwork. Okay. Now I will take one question from a member of the public. Mr Tommy Loeb you've been waiting online. Yes, thank you. Okay, Sir go ahead! First of all, I thank you. I do not live in NYCHA, but I am concerned about the flood plan for the entire community and I was a little concerned because I've been attending the Parks Committee meeting and the last time they presented a program on the interim flood protection plan. They said that they have no idea what's happening at NYCHA and I'm wondering first of all. My first question is: why is not there any coordination with the eastside coastal resiliency plan and what's going on with NYCHA and as related to that, I just want to make sure that everybody here understands and it's still clear that until there's flood protection with ESCR NYCHA will have to be totally evacuated during a sandy type event, and I want to make sure that still stands. So everybody understands that and lastly, when they presented the interim flood protection proposal, they said that the backflow would not be completed until ESCR was completed and therefore they could not do interim flood protection, because the sewers were not capped in the NYCHA projects and that should there be a sandy type event, the water for the East River will flood the NYCHA projects. Those are my three questions. Okay, I wanna, I think I remember all three, but just to just to assure you we are coordinating with Parks. Department eser actually needs a few easements minor easements from NYCHA to perform their constructions. We have been involved from day one on the design of that project. I do not know who specifically was doing the presentation you were you were seeing, so it might be that staff member is not part of the other, the teams that coordinate that was the mayor's office. That said these, all these projects are very large, involve a lot of people, and so, when it comes to these major construction projects, one of the challenges on and resilience is that effectively. We are each required to deliver on a project that can meet the criteria of its own goals, so the projects that I'm working on for NYCHA FEMA has indicated what level of protection buildings have in order for me to have met the requirements of brain and those that criteria can not be met by some future hypothetical project from another agency. So we have designed the projects that that NYCHA is working on to protect the buildings and the campuses that were funded by the female 428 program. Parks. Department is using a different versa funding to perform a different scope of work, and so, while we certainly collaborate, we are on our own timelines, doing our own designs and we are at this point a ham. So we would certainly not want to kind of slow down any of our work to wait for no, but your dessert could just confirm. Your designs still requires full evacuation of NYCHA projects. All all evacuations are well, first of all, NYCHA defers to New York, City, emergency management for all evacuation requirements like any other property owner in the city, so the city, the mayor's office, probably, but I'm not sure what levers will determine it this year will dictate what neighborhoods need to be evacuated, and so whether or not a structure or infrastructure has flood protection does not in any way change the fact that if a neighborhood is an evacuation zone, people should evacuate. I mean I want to be kind of as absolutely clear about that as possible if people think that the flood protection we're putting in is, is an indication that they should shelter in place. I want to kind of disappease anybody of that notion. We are not descending first- time play scenario and DOB does not allow us right now to design for the shelter- in- place scenario. Okay, thank you. Thank you joy and thank you Tommy for those remarks. So I I do have our district leader for the area. Mr John Belasco is on John. Do you have a question for NYCHA hi yeah? I just wanted to say a few things: I'm John Belasco, I'm district leader in the 74Th Assembly district part a representing reese, wald, baruch, gompers, alias five, and so on. I'm also a Jacob reese resident Jacob, Reese One, to be exact. I just wanted to echo what Camille Napoleon said from bridge houses is that this is a merry- go- round with NYCHA. We talked about the issue over and over and over again, I brought them to Brian Honan and, as a matter of fact, we had a race virtual webinar that I thought did not go well for several reasons that I can share with the community board at another time and I'm still waiting for joy and Brian to respond back to my email that I included with elected officials on it. There's so many issues, there's shutdowns all the time. Reece houses, one from 10th street to 13Th Street just had water shut down on its unexpected. We were told it was not related to recovery, but also a worker told a resident that we did not know that the water tank cleaning that we were doing in one building could turn off the water. For several buildings and by several I mean 11 buildings in the in the area where water was shut down. That's like it's just mind- boggling that something like that is happening and that different parts of NYCHA are not communicating with each other to prevent shutdowns and to prevent a mess, and I have to give a shout out to Council member Carlina Rivera's office who contacted NYCHA because NYCHA could not give me an answer about it. There's major issues, compost, Plaza 2 was mentioned. Congresswoman Carolyn, Maloney just went to compost, Plaza 2 and I joined her this past weekend and she wrote a letter to the CEO of NYCHA that was just released today about the ongoing issues at compost, Plaza 2 and I'm talking about issues related to rats in places that you do not want them to be and other and other issues right. Is it related to recovery and resiliency, I'm not sure, but back to what Brian Honan said it does not matter to a resident if it comes from recovery of resiliency. If it comes from general infrastructure problems, if it comes from wherever it does not matter, we do not see that right. We're not. The issue is that parts of NYCHA are not communicating to each other and one of my biggest points that I've given to NYCHA and specifically gave to Richard from the recovery and resiliency team today on a phone call was that we do not need to go through this merry- go- round. You can communicate with stakeholders in the community joy. You have mentioned that. You know you want this feedback. Why not hold a meeting with stakeholders in the community where we can tell you how to best do things? I'm not trying to be someone or trying to be a resident or an elected official? That constantly is attacking NYCHA, but NYCHA is not working with the stakeholders that can really help you get this messaging out in the best productive way. There's so many other things I could say. I do not want to take up too much time, but you know I and I think the community boy it's been a little while, since we had a public housing meeting in Community, Board three and I know, there's been some changes in cheering and all of that. So I thank you for holding this meeting, but I also urge the community board to maybe hold a public hearing specifically for NYCHA residents in community board 3, because it would be great for you to hear all of the concerns not just related to recovery and resiliency, and I more than help I'm more than happy to help you put that meeting on. Thank you for allowing me to share some words. I just wanted to respond quickly to the parts related to me and not because I do not think that I should be coordinated with other departments, but I wish I wish I could could fix complex issues, acrosss divisions and departments, and we certainly try communication though John you and I talked about the last time. I saw you at reece houses, which I guess was like two weeks ago now and and as I mentioned at the beginning of this meeting, this is really a learning experience for all city agencies and definitely for NYCHA in terms of taking advantage of this technology. After that reese town hall, we put out a survey, so there are about 50 attendees. We got 20 responses, which is like an extraordinary response rate to an online survey and I'm happy to say a lot of it was really positive. I'm not saying that the meeting can't be better. We are constantly trying to improve these meetings and we're constantly trying to improve our outreach, and so you know again, it's really it really. The feedback does help and we we chose a different format. Instead, you know we did a webinar format again, trying to sort of figure out the way to to communicate the most information but get but prevent you know, distractions for folks who had questions had wanted to get asked questions and did not want to be interrupted, and so we, you know we struggle with the same things your you know, this community board does in terms of having these public forums, and I can not necessarily speak to some of the other concerns you mentioned, but but do not stop bringing them up. We are trying- and I will say that I have counterparts that really are also trying very hard, and so so thank you for being the advocate that you are but joy J with all due respect. We do not want to continue bringing up these concerns. I was born and raised in public housing. I've lived in public housing for 31 years. I do not want to live in the conditions that I'm living in now. I do not want to go outside and see a pile of garbage and your contractor team Peter said you know what he said at a reese meeting. He said the garbage is not us, it's not michaela was there and Richard were there. The garbage is not recovery and resiliency. Well guess what? Where the garbage goes, there's now a parking lot and it has moved the garbage in front of 178 avenue d, which has exacerbated the problem. So whether or not recovery and resiliency is in control of garbage it's adding to the mess. I do not want to live for anyone who does not live in public housing. I do not know what your conditions are like when you go home, but they're, probably not the same as me, living next to a Con, Edisonison plant and also dealing with construction. As soon as I walk out my door, it's just unlivable conditions and no one should have to go through that and NYCHA just keeps saying, give us the feedback. Give us the feedback. We've been giving you the feedback since the inception of actually not since the inception of NYCHA, because I hear that it was pretty good when it first started, but we've been giving this feedback since I have been working in government it's just over and over again, and I really hope that NYCHA Brian and joy- maybe you can email me after this, and I can get you some community stakeholders and we can have a small meeting, not a giant public session, but a small meeting for those community stakeholders to give you some feedback on how we can proceed and how we think the les will be receptive to that and then Cv3. I really hope that you would take my recommendation of holding some sort of a public forum specifically for NYCHA residence in CB3 seriously. Thank you so John I John. I have to apologize. I woke up the other morning and you were on my mind and I emailed you first thing but did not follow through and and but you know we we've worked together for a long time, and I know that we can. We could continue to work together now, so I will email you as soon as this meeting is done. Send me some dates and we'll set up a small meeting and happy to start that, and it's just been there's no excuse, I'm not going to make an excuse, I'm just going to do it and we'll set it up. Okay, I thank you. Thank you John. I really appreciate the comment that you made and I think that is something for the committee to consider. I mean Community. Board three has all kinds of platforms, and I think that that's something that daki and myself will have to discuss further along with the committee members as to how that would look. If we decided to do a NYCHA platform, because we know that there is more more things coming down the pipeline than just the resiliency, we also have to tackle the fact that we have governance issues and a president that may be exiting or staying in office, and we need to prepare for what that's going to look like as well. No one is addressing the elephant in the room, but that's a big issue right now as it stands. So I want to thank you John for everything that you said tonight. It was awesome. I also want to acknowledge that tyrique has had his hand up and Damaris. I think you might have also had one more thing you wanted to say so Tariq I'm going to take you first and then demerits I'll. Take you thank you. Go ahead, tyrek! I'm mute yourself. Thank you. Let me just lower my hands. Do not forget Brian. I do Wanna, I Wanna. Thank you. I appreciate your transparency, appreciate your authenticity and wish that more meetings, we had more people like you doing that when they're talking to residents because you've called me a little bit, but I do Wanna, I do Wanna say joy to your point. You know any conversation, anything that I've joined. Anything that I do everybody that knows me in the community knows I'm all about being solution focused. I hate problems. It annoys me. Yes, so, coming to this meeting joining this committee John, I appreciate your recommendation for the Community Board to host a public hearing, and I will make sure that we do that, but I also want to you know I think, when coming to speak to different people and as John was saying the different stakeholders. I think it's crucial that your team prep and know who you're speaking to right, because this is a committee we're a body of people that live in this community right know our community right and we are a body of people that could support the work that you're doing right and so opposed to you know getting subject, come to us and say: hey. Here's! A few flyers that we need you to post right, we're not going to it's, not our job, it's we have other jobs right, and so you have work and you need support. I live in Reese, I'm happy to support and spend a day going, door- to- door and giving flyers to people. There's enough, I'm beyond happy to support that work right, because I want to ensure that our community is getting the information and the work is getting done right, but I do think that a lot of this is just going to be a cycle going because these issues are just they're, intertwined, they're, all intertwined right and when it comes down to your meeting, functions right hosting a webinar right in some way, when you're meeting with these developments and meeting with residents, it's that's kind of like a smack in your face right, it is kind of like closed door. Do not really want to deal with. You do not really want to hear from you, I'm just going to present and that's it right. Just like we have we're. Having this meeting, we have public members, we have board members, we have a protocol committee members speak first, then the public members. So what? However, whatever systems you need to put in play and zoom has those functions? If you need to mute everybody where we can unmute ourselves and you control that right and I get it because the community can come in. I know my community they're angry they're going to come in cursing people out. I get it right, but you have control on your end of how you control your zoom and your meeting to ensure that everything is moving smoothly and you can get people's opinions acrosss. You know, but the last meeting I was at John was very upset. It was a waste of my time because I really wanted to go to see the community members that were present right so that I know how who can I hold accountable right because I'm going, but if you're coming to me complaining but you're, not attending meetings? How am I supposed to hold you account? I can't hold you accountable if I do not know you're on the call right and so we're here to support that work, and so I think, moving forward if it's berut, if it's compost, reese Smith, whoever that those meetings are open, one to the public and they're able to see each other right, because also even the comments it was hard to understand. I might be echoing the same thing John's echoing right, which is just a lot for you, and the meeting just keeps it makes no sense right opposed to it. So now we're seeing each other said things that necessarily. I do not need to say, because I have the same sentiment. Sandra said things Camille said things John said things, but that's because I'm seeing them, I can hear them. I feel it. I feel the energy get it. You know, I'm feeling I'm an energy dude you get it. I appreciate that I actually reached out to it today about this very issue. I said okay, so who's going to be Nycha's, Zoom guru, because it's not me- and I you know that technology a sophistication you're talking about. We are building, but I I'm flattered that you think we have it already. I do not have it personally and so I've been on so many hundreds of meetings of all different kinds and all different sizes and some webinars and some some interactive like this, and I'm appreciate, and I appreciate your feedback and hearing how it made you feel and what was frustrating about it. I was on a meeting today where the chat function was not not accessible and it's fine. If you do not want me to talk, but it does not make sense that I can't chat with my fellow attendees. So I hear I I'm learning as we're going along what makes for a successful meeting. How can we have the meeting be administered by one person, so the content can be delivered by another, we're really working through that, and so I'm I do not I'm sorry. I did not mean to sound dismissive of John's feedback. I just meant to say we're hearing different opinions from different people and so we're trying to kind of take all that and be receptive to what makes different people feel comfortable and your and just sort of clear the projects that are happening. I know Sandra asks this question of like why I'm not focused on one and I know different bids and different contractors for each building and things who controls the schedule. Like does the schedule fit in your office, ing that this building is happening January to February, and it's about to overlay to the next like who controls that schedule? Is it your office? So the way a NYCHA construction project works for a lump sum bed, which is the type of RFP that we had to do for these federal federally funded projects is that the contractor essentially is awarded a contract that says you have to get this work done in this amount of time. How you're going to do it? You determine the means and methods, and certainly the means and methods have to follow code. They have to follow law, they have to meet regulation and we work with the contractor to ensure that they're doing that, and obviously, if there's an unforeseen condition, they have to work around it and we have to work with them on that, but but the contractor determines the means and methods within the kind of brackets of load, car call load, code, law, code and regulation. So we oversee that, but we can't dictate we're not allowed to dictate how they do it. Okay, thank you. Demaris. Sorry, I'm like talking too much tonight. Sorry go! Do your thing girl! I do not. I think that hand was raised from a previous time. Okay, thank you Damaris. I apprec. I appreciate that and so we're going to move on to our next agenda item and our actually our last agenda item, and that is the update on the Covid-19 programs and services. Thank you so much for that Brian we're going to cover that. Okay! Thank you! Yes, so before March, if you asked me the toughest time in nature, I probably would have said you know Jerry Sandy. So it's amazing that these two topics are both on the agenda tonight, but I think that Covid-19 has been rougher than sandy in a lot of ways just because it is hit NYCHA and the city in so many different ways. There is the health. There is the health emergency that we're all facing, but there is also an economic emergency. There is a an isolation that I think older and younger people are experiencing. That is a real crisis and it has hit us even on everyday. You know management, so we we're looking at this in different ways and we're also partnering. We also know that NYCHA can do everything and nature needs to look to partner where we can, and that means with other city agencies with other elected officials with you know with in you know, and many of the Tenant Association presidents include and- and you know, like Camille, for instance, has been amazing, with food distribution at baruch, and and without that I do not know what the residents of baruch would be doing now, but early on in the pandemic, even before the state, and even before the federal government declared a moratorium on eviction. We did that and that remains in place for all evictions and even though the federal government has lifted eviction moratoriums in New York state, we still have what is known as the safe Harbor act, which prevents any type of evictions for non- payment of rent, but other evictions could take place, but nature is not doing those. Our hearing office is still closed, so there are no tendency actions going on right now as well. So so you know that we want to make sure that people know that's in place now, just because of we're not taking tenancy actions. We also know that people are getting hit really hard economically and we want to make sure that they take advantage of a program that we also put in place and that the Fed is one of the few things that the federal government did right in. We have what is known as the rent hardship program and, if you've lost income during Covid-19, whether it's directly related to Covid-19 or not, but just lost income. During this time, and if and if or anybody in your family is contributing to the household income, you can apply and self- certify. So you do not have to provide documents to do this to get your rent adjusted, and you can do this in three different ways. You can do this. You could do this by phone, so you can go to the call center and do it so this way you do not even have to leave your apartment. You can do this on the mynychat or you can go to the management office and fill out a form if you'd rather do that, you know old- school way. Nature's always had you know, mechanisms in place to adjust for rent, but we always required a lot of paperwork. You had to show that you lost income for two months and then it also took a while to get that retroactive, rent credit, we're processing the paperwork, a lot faster, we're not requiring you to prove it. We will get that later on, and so it can be done quick and we are adjusting it and thousands of people are taking advantage of it. I you know sometimes worry, though, that people still do not know about it, even though we've really tried to get the word out there. But if you do not know about it, you really need to take advantage of it. As far as sanitizing, we have hired two companies to sanitize the touch point areas in the developments and by touch point areas I mean the entrance doors, the mailboxes, the panels on the elevators, the railways, on the staircases in senior buildings. Like Meltzer or the senior building at Laguardia, they're being done now we're going to increase those to seven times a week. It was five times so we're increasing the seven to non- senior buildings. It was three times a week. We've hired two outside vendors, so that's not nature workers doing that. The vendor for the senior buildings is a vendor. The company's name is Eastco the vendor for the non- senior buildings, their name is alliance. Both of these are being heavily monitored by our compliance department and the last thing around Covid-19, which I think is really important, but I also think it's something that is showing up too and I'm hearing I'm hearing this stuff about. It is around repairs. We continue only to do emergency repairs in apartments. If you have something you need a painting or something, that's not you know health or safety related. We will most likely reschedule that to another date, but even if somebody is going to do a repair in your apartment, they will ask. You know how you feeling the repair person should be wearing a mask and if they're not you should not let them in your apartment, and you should also to feel comfortable. That person is, you know, is safe and working safely to you should maintain social distance as well and and if you're not feeling well, you know at that time too, as a resident, you have every right to say. I know I have the schedule we're going to have to reschedule you know, and this is good for both of us and and those are what we're doing you know from a landlord perspective. We have partnered with many different groups. As I said, you know on food distribution, but you know that is really mostly what's happening. There is through the mayor's food czar program, but I also know many tas have been you know, partnered with groups like fresh direct. I think that might have stopped now, though, just recently, but you know that's something that is happening outside of Nigeria but nature cooperating with as well. So, in short, that's what we're doing, but you know I'd love to take questions and also hear if there's other things that we should be doing and or could be doing. You know I'd like to hear it and I'll you know, certainly bring it back. Okay, I see. Damaris has her hand up. Let's see, let's take Damaris, I do not see any committee members have their hands up. Let's see, can you see Jackie only Demerits, I thought Eric had a hand before yeah. I do not see Eric's hand go ahead Damaris. So I have a question about the addiction moratorium and the red hardship. So you know I've heard mixed reviews. Some people have said that the process went very smoothly. It was quick, some people said you know, and I and that may have to do with developments where there's already problems. You know problems. You know, administrative problems, that they've said you know I'm still waiting. I do not know you know they asked me for something or who knows what? But my real question is: if NYCHA, let's say you know, a resident does not pay their rent because they lost their job and they are not aware of the rent hardship program or by the time they apply for the rent hardship program. You know and get their rent reduced. It's now been several months. Can you speak a little bit brian to whether or not that's going to be considered? You know chronic rent delinquency and whether people after this is all said and done will have to you know, appear for some sort of you know administrative hearing because they were laid on their rent before you know asking for you know a rent reduction or anything like that sure, and it's a it's a good question and I think it is something that is actually happening because rent payments are down we're down, probably lower than we we normally are. Hud does not does not allow a mechanism for that yet. But one of the things that we've asked is that if somebody could show that I lost my job in March say I did not know anything about the rent reduction program but because maybe it was advertised, but it was not the first thing on my mind because I was really worried about you know. How am I going to take care of my family? I'm not really looking at twitter, I'm not looking, I'm not even looking at my mail, but I can prove I can show like. I got this letter or this is my last paycheck or something like that. Could we give that person a retroactive credit? You know- and you know forgive you know the months that have gone by and that's something that we have not been able to nail down. But it's something that where we're aware of is the situation and that we would we would love to be able to do because I think there are people who fall into that category and it is something that we are going to find. You know we are going to find people who are really trying to do what's right, and but this is, as I said, this is a crisis in many different ways, including economic, and if you can't pay what you do not have you know, and- and so I do not have a firm answer to that, but it is something that we're talking about and we're something that we're aware of is something we need to solve for. But what about the chronic rent delinquency issue right? So we're I mean right now and the safe Harbors Act is so, which is you know, a state law that you know that passed and it really is. It says that evictions, for economic reasons are, you know, are banned as long as the covent crisis remains in place, which could be a very long time. So I do not see evictions or tendency actions. You know starting on that for months and maybe into next year, but at the same time we want to make sure that when we do go back to normal that people start at a you know. You know you do not start that day. Thinking like I'm immediately going to be in in some danger of a tendency action, and am I going to get a letter saying I have to show up at a hearing or show up at housing court. So we have a little bit of time to figure that out, but we, you know we're not there yet, but it is something that we would like to. Unfortunately, Hud does not give you a way to forgive to give rent you know, but it is something that we want to figure out. Okay, thank you Brian, I see Tariq's hand and then Damaris so go ahead. Tariq&Ask your question, I'm very quick. We John Vlaska is in the waiting room. Can we let him in Linda? Can we let John in? Thank you. That's all I had okay Damaris. Oh, I mean I still my same hand. I do not think you took it down. Yeah you got Ta lower your hand. Your arm must be tired, but yeah your arm must be tired. I always have a lot of things to say. I just choose not to always say that Tamara's. I think this is. This is a question: that's not going to go away and I think that that I think we need to work it through and it's something that bring back and I'd be happy to meet with you and other members of the committee to discuss it further, because I would hate to get because I know a lot of people are going to find themselves in this situation, whether they lost their job or just the extra income from staying home, and you know feeding your kids when they're, usually at school- or you know you know- maybe even just doing some things that you do not normally do just to keep your sanity. I totally get it. I had a follow- up question about some other stuff, but I understand that it's going to be challenging and we'll probably have to cross that bridge when we get there, but I wanted to put it on your radar because that's how these sort of sneak up on us, but I guess the other point is, since you know the previous session, this comment belonged or at least have some feedback. You know what Kova has us more of a staying home and so the buildings, the garbage disposal, all of those things, are really creating. Quite the problem, and you know I do not know the last time that you took a walk through these developments, but I'm happy to share whatever photos I have, but it's really it's really problematic, and so I'm not sure if NYCHA is thinking about how to deal with this, because we do not know how much longer you know we're going to be in this situation. I know we're technically on like a phase of reopening the city, then we're also hearing from a lot of health issues that a second wave is coming and it's about to get worse. So if that is the case, you know, how are we going to deal with some of those issues like the garbage collection? And you know some of the marriage is muted yeah. I can't hear back tomorrow. Yes did somebody, I know that was you Linda trying to shut me down? No, I was asked to mute everybody who was not. This is a joke. It's a joke! Linda, I'm just playing around Alicia. Can you mute yourself? Okay, all right, so you know what about so. There's this big leak in the lobby. There's water coming out, there's been like a nature bucket, a car. You know one of those yellow caution signs for days. I think already two weeks, maybe- and I and like some of the residents- have been posting it like on facebook and other places, and so you know those kind of repair and cleanliness issues are pervasive and you know I'm worse than before, and so maybe you can. I do not know you know. I do not know if I'm telling you this so you know I you know, I'm not really sure what you can say to you know how you can speak to it, but I think it's important that you know we share our experience. I think I think so too, and I'm glad you did- and I do I do know it just from hearing complaints, but also when I go to developments. Unfortunately, a lot of times I go to developments with the chair of the general manager, and you know when the chair of the general manager show up. You know everything's clean and it looks like a brand new development. You know so I know so. Some spot check visit, you know, surprise visits. So what I usually do is you know in those times you know when it's time to break up I'll go to a development nearby. So if it's baruch, I will, you know, cross the street wall to see what it's really like. But no, I think that with more people staying home we are definitely seeing more garbage we're seeing and we've. Also too, you know remember to cover it really had a big impact on nature's staff too. A lot of nature staff got sick, a lot of nature staff because of child care issues had to take leave, and so we are not we're facing more work with fewer staffers. So it is an issue but it's, but if he could send me that the address with that bucket is I'll, look to get it addressed, but it is ongoing. Yeah, okay, okay, Eric! You had one question. You said yes right: okay at our last Nycha's subcommittee meeting with the waste management director for NYCHA, that was right before Covid-19 hit and there was a discussion about the NYCHA plan or budget the NYCHA budget for the year that it was supposed to be written up and then he said, they're going to look towards the end of June. For that final budget Covid-19 hit, I wanted to ask and follow up with you Brian about what's the status on that NYCHA budget and how has what was the thinking in the budget before Covid-19? What is the budget like now? We've come with Covid-19, and then I just have a suggestion that I would like you to take back one yep, so that seemed like a very long time ago. You know, let's put it that way in a very different budget ago, so the budget that we passed in January of last year added additional staff to the field in many different areas. This year we are down in in terms of especially in rent collection and so a lot of things that were possible this year. It looks like, as things go, it looks like we're going to be running a deficit now. Let's hope that you know when the election's over no matter who wins though they'll come, you know, Congress will come be able to come together and you know pass some sort of stimulus bill that will include funding for public housing that will make up for some of that loss. But right now you know it does not seem like they can agree on anything. So until we know what that happens, it will be difficult to determine what nature's final budget will look like, but as projected right now we will, it looks like we're going to. You know, anticipate a deficit. We will we run on the calendar year, so our next budget will be due by the end of the year and if you want, we could do a budget presentation. We'd be happy to do that and talk about that. But Eric I'd love to hear your ideas on the budget, though too, that would be great yeah and I'll. Just share one quick thing to take back, but before that is there was a report that was scheduled for June and if it was not the budget, because you're saying the budget was already passed, then that report that was supposed to be announced because it was not announced yeah, so there's a narrative to the budget, so that could be it and that definitely was good. That definitely was released because I remember we did our budget hearing before the City Council. So let me try to find that. Would it be okay, if I sent it to Eric, I could send it to you directly and I could also send it to the board you, okay, because in just context, Brian just figure out what report I'm referring to it had to do with giving us a picture of where the priorities were, that NYCHA was improving to spend money and investments in, and so that was the context for that report. Yeah the priorities, were, you know at that time to add more staff to the field right, because this is the biggest complaint I hear. Is that and there's the one thing? Well, there's a few things residents and staff can agree upon. No matter where I go. When I talk to you know staff they do not usually tell me, of course everybody would like more money. Everybody would like more time off, but that's not usually the things they tell me. They usually tell me like. We could do a lot more here. If I only had like five more caretakers or if I only had a few more minutes, people and residents tell me of the day when they remember when two or three people took care of a building, and now they say, like one person takes care of the building. Maybe they see them twice a week, so it is the understaffing I mean when I first started with NYCHA 14 years ago we had almost 16,000 staff and we're down we're just you know south of eleven thousand now and you can't take it but a hit like that in staff without feeling it. So we're certainly feeling it all right. Well, let's yeah you can find out, and you know what else I'll do I'll go into minutes, because I know I was chairing that meeting, and so I recall that meeting very vividly. So let me go back in those minutes. If you can send me an email, brian I'll, follow up with you. So I know exactly what report I'm asking for because it would be a good follow- up last thing and it's on staffing since you it's coincidental, my suggestion is perhaps consider staffing within the development as almost like a strategy for good groundskeeping and I'm sure there's cons to that approach. But I also see a positive because, as I understand it, growing up in nature, my whole life, you know very rarely- did you ever actually have a groundskeeper. That was actually from the development itself, but I think there's something to it. When the person is responsible for taking care of the grounds are represented by people who actually live in the grounds they put in that little extra effort they're putting that little they're, not just trying to clock out yeah, you know they might be invested to stay a little bit longer, even if it's unpaid, just to make sure that, where their thiefy lives, that ground is taken care of, where they're, where their friend who they've grown up with their whole life, that their park is taking a bit a little bit. Care of you know and can even recruit from within the developments on a kind of volunteer basis. It's a strategy. I think that I do not know if Nycha's thought about doing and if there's ever any discussions on targeting it that way, so I just wanted to throw that as a feedback to bring back NYCHA, and that was dovetails for my question on what were the priorities of NYCHA sure? No, it's! It is something right now we do have a policy where you can't work where you live and that's something that I do not know the origin of it. I have. To be honest, I mean there are some things that I hear about. You know like I hear in the hallway like, and then I and I try to repeat those things because I've done it before and then people say I do not know where you got that from so, but what I I'll you know. So what some people tell me is that they do not want to work where they live, because they feel like they're, never off then, and so when they're, when they're, not working people tell them like. Oh, you forgot to, you, know, take care of the elevator in this building, and and so they can't get separation, but I do not know if that's just an anecdote or if that's you know why the policy came in, but there's something I'll raise, because I do think that people think of pride in where they live, and you know that, would you know anytime, you have, you know pride in anything. It'll show up in the work, yeah and part of me being on community board three so that, instead of just eric a short puerto rican guy from the lower East side presenting this as an idea, I would like to present it as an idea that came from a community board three member Brian, so maybe that re, Jogs and retweets how nature would interpret that feedback. Among other things that they'll be good. So I appreciate you Brian. I know I think I always come back to give me board three, because I know I'm going to get tough questions, but I do not know. I'm also going to get a lot of really good ideas. So I appreciate the work to this board and I also appreciate how just the fact that you have a public housing committee. It's a rare thing and and it's important thing so thanks! Okay, at this time, I see that there were three hands that were raised. I saw Sandra's hand, I also saw John's hand and then let me see, I saw one more hand, so let's go ahead and start with Sandra, oh and Camille, I'm sorry Camille. I saw okay Sandra. Let's do this order, Sandra Camille and then John. Okay very quickly, excuse the mask. I have people in here all the time so excuse the mask. I do not live in NYCHA, but I know a lot of. I have a lot of family and friends that do. Could you possibly just send me links or information to the programs that you that NYCHA specifically offers? I know what the elected officials have available, but if you have anything separate, you did mention separate programs directly with NYCHA. If you could secure neat. Thank you. Okay. So also now we're going to have Camille. Are you there hi Brian? How are you come here? I'm good Brian! Thank you. I am actually it's more of a question like what is during Covid-19 NYCHA, considering an emergency and I'll. Tell you why. Just recently I had a resident Mr Royo lives in 50 Colombia on the 10th floor and she's. A bad diabetic takes care of small grandchildren from the ages of two to a few months, because their parents have been essential workers throughout Olokovic and she stood literally without a refrigerator for six days and as a bad diabetic. You must know that her medication needed to be refrigerated. We provided her with a small cooler and ice daily when her when her neighbors would not allow her to use their refrigerators, but is that not considered an emergency yeah? Of course, that should be an emergency, and I think that case actually even came my way which I sent I sent in, but it no even if she was not a diabetic being without an appliance. You know like your refrigerator or stove would be an emergency, and you know if you were told otherwise that's wrong. Okay, and can you just clearly state what is NYCHA, considering an emergency during Covid-19 as far as maintenance issues in an apartment per se might be sure, so anything that's a health or safety related. So if it's a leak, an active leak or if like even something like mold, would be considered a an issue. If there are things like holes in the walls, if there are pests in the apartment and by pests, I mean rats or anything like that. You know so anything that could cause you know could be considered health or safety related. If you had, you know what would be you know, a minor repair like you had schedules, a scheduled paint, job or even something that would be really important to you. Like your you know, your cabinets need to be put back on. That would not be considered an emergency, even though it's really important, but it would not be considered an emergency and probably have to wait, but it's more just health and safety. Yeah are the things that we're looking at right now. So, okay- and I have one fine, just one final thing. Obviously we're all home during Covid-19 trash is a big issue. Again, Damaris has brought it up several times. You got people home 24 hours a day. We have an increase in garbage. Why can't NYCHA increase our bulk containers at baruch houses stay full 24 hours a day. I feel like we. Never the minute. A bulk container arrives at baruch, it is immediately filled, is NYCHA not increasing, like the purchase of additional bulk containers coming into developments to kind of aid. In you know, we have a really serious trash issue yeah and why can't NYCHA assist in having additional sanitation pickups or you know I have to use usually when it's out of control like Damaris, is building 6064 lives in a sea of trash. I have to call elected officials to aid in helping sanitation and making calls to get that cleans up yeah. So I did look into because this came up to me recently too, and I did so one of the things that they told me that they started doing was taking the garbage from baruch and putting in compactors in walls and walls. I do not know if how that's how that's the answer, but, but I think additional pickups would be really helpful. Yeah, like I really do not understand now. We're sticking to our old pickup schedule times have changed an increase. I think they have cut down and they have cut down on pick up schedule and it's something it's something that I'll raise to the mayor's office. I speak to them daily and I'll. You know I'll remind I'll tell them that I was here and it's something that came up. Okay. Thank you sure. I'm done Alicia! Okay! Thank you. Camille. The next person that was supposed to speak was John. I believe yes, hi yeah. I just wanted to out echo the garbage stuff, but Brian, I wonder like do you have, and maybe NYCHA has this already like a digital ad or flyer that basically breaks down. This is what nycha's responding to right now, I'll give you an example, the New York City Board of elections right. We have a lot of major critiques about them, but they started doing this digital campaign where they put like little psas and like these, like really cool small square visuals, that people can see on social media and like for real. It's like really effective, really good. I talked to their communications team and I wonder if Nycha's communications team can do something similar to help get the word out, and I and I know other folks will spread those flyers so fast that when people ask what kind of repair can I call for they're, like oh look at the flyer, you know like something like that would yeah we do not. I mean what we have is really I'll be honest. It's kind of bulky like so there is something you can go to nature's page. It's you know, lists all the things that we do in Covid-19 and it's about 10 pages long. You know, and it's not flashy, and it's not like something that you could digest in a minute. It's something that you got Ta. Probably you know plan your lunch around. You know in order to read so I'd love, to look at what the board of elections and I'm always happy when a an embattled agency does something right. So I root for the board of elections. I know how they feel, so I would love to look at that. Look at that and and we're you know, I mean we're- certainly a lot better than we were a few years ago on social and we have a good social person now and- and maybe even when we have the conversation, I can even invite her and we can we talk about that because you know more and more. Everybody has a phone and more and more that's how everybody's getting information. So so it's something that we should talk about yeah and they emailed you too, by the way John Okay for accountability reasons. Everyone Brian did email me in the middle of this meeting. So I thank you for that, and the last thing I just wanted to say was: this is obviously not a long- term solution, but I know that a lot of community leaders, a lot of elected officials in various neighborhoods, have been holding a cleanup like community Cleanup days. I know people have been doing it at Tompkins square park in the East River park if NYCHA were to supply. I do not know a bulk of gloves and garbage bags and we could get some residents together to do some NYCHA clean up days. Obviously that's not long term, but is that something that NYCHA would be open to do you think yeah we've done that before and we I think we definitely could. You know, provide like supplies and stuff like that, and we really encouraged stuff like that. So I think it would be great. Thank you, yeah thanks. Okay, thank you! So much John and thank you Brian for your comments and your questions. So at this time, if there are no other committee members that wish to make a comment about the topic of covic programs and services, we're going to take a roll call vote to Adjourn tonight's meeting, and I want to just thank all the committee members that came out tonight and I want to thank Linda for helping us without zoom. Thank you, Linda, thank you and Jackie. Thank you. So much committee members. We will be in contact with you about the next meeting and looking for a committee chair for this particular committee and yeah, we'll keep you posted Jackie. Do you want to say anything? No, should I just do the road calling? Yes, please! Thank you very much. We need a motion to Adjourn and we'll do the roll call I'll make the motion to adjourn okay, Sandra. Thank you. Second. Is there another committee member to second it I second okay, thank you, Camille and so now Jackie. Please take a roll call vote. Eric. You asked yes, Alicia Louis Coleman, yes, Felicia crochet, Ramos, yes, Sandra, yes and good night, everybody good night try more less. Maybe we might have lost troy. He was still at work he's still here. Actually, oh there he is to give you a thumbs up: yep Camille Napoleon. Yes, thank you. I'm done with the road calling! Okay! Thank you just one last thing: damaris, if you're still interested in joining the subcommittee, please submit go on the CB3 website and get the form for the committee form and please fill it out and get it back to me and Jackie and we'll make sure you get added on because we did lose on one member today and as a member of NYCHA development, it would be very beneficial to the committee to have you on board. Okay, thank you. All have a good night, all right, good night, good night, good night, everyone good night, everyone! Thank you, Linda! Thank you! Linda.",
            "summary": "I. Think one of the challenges that we've had during this process sort of beyond construction and the challenge of actually building in this context is how to do things like this, and this is very new for NYCHA to have these kinds of meetings and exchanges, and so we're also trying to use the technologies as best we can to get word out and information out with the same challenges.\nAll over New York City And we're getting a lot of interest from the other agencies, because we've awarded every major contract, we've spent almost two billion dollars, acrosss, the five boroughs, and this investment has meant that we actually now have sites that have both passive and deployable flood protection for the season.\nThese projects look different at every development, so in this case the mechanical electrical plumbing equipment, the generators they're in external buildings, but you've probably seen other developments where they're on rooftops Smith houses, as it is substantially complete for phase one.\nIf needed, and the new play area is, you know, complete and awaiting some punchless work with Dad's knee to to open both play.\nCampus plaza is a small development, but even here with just two buildings, we have some flood protection, that's passive We have some flood protection that requires logs to be deployed, And. So we worked with other departments in NYCHA emergency services, emergency management operations to come up with the strategy for how we would do that.\nAlicia has a hand I just wanted to make sure that the residents in the NYCHA developments are getting proper notification and, as you just explained, joy that you've been sending out emails and flyers and and text messages to the residents.\nWe really strive to 72 hours before an electrical or a water, shutdown, minor, George door of the building impacted, as well as to phone calling to the residents.\nWhat and it's something I deal with all the time explaining where strictly the recovering resilience work and some of the[ _ _] down to ours, but some of them are niches, What I try to do and what we do is if a resident feels like she has not been notified as we let our nature conduct know right, away, and I was I was on your webinar.\nI think when it comes down to outages that are truly going to impact the resident right.\nWell, I have a big concern because I live in baruch houses, one of the largest construction plants going on the city.\nI, know that dust and dirt was a real concern for residents and we work really hard with that contractor and we still do a lot of responsive, a responsive feedback contractor whenever they are not doing the appropriate dust.\nYou might not be able to see right now, but you know each development was each development, had a scope of work negotiated with FEMA on a side, by- side and a building by building basis, and I say this, because the reason this two- pager has so many bullet points and all the two pages for all the sites of so many bullet points is because there were certain things that FEMA explicitly funded at particular sites due to the visible or recordable damage from the storm.\nThey also work in a blackout a hot summer day, but when it comes to some of the grounds, restoration and some of the improvements like community centers, they were either explicitly funded by FEMA or not as part of this program, which is not to say that there is not future funding.\nIs there how nature made decisions on where community centers went in the past We are just investing in the infrastructure of the building sometime in the near future, though, I would like to be invited back to the board We do have a plan in place to which would allow us to get additional capital money and would allow us to do things, invest in community centers and stuff like that and maybe even construct them, but there's a very new deal plan which I would need about 45 minutes to explain right.\nYou know any measures related to Covid-19 Now, right, now, Damaris were talking about recoverancy resiliency, so the sandy work The first thing I'll say, is that It's really overwhelming as much construction as there is, and it also feels relatively unsafe, because there's so much fencing and covering, and these new you know, walls that are being put up.\nAnd I'm very concerned not only about this moment in time, but what the future is going to look like, as I walk through the development which I try not to do alone, which you know my whole life.\nFourth point that I wanted to raise just to say is that you know I do appreciate that we get these calls to notify us about certain outages, though they're not always consistent, and so sometimes the water is getting turned off because of the construction, and I'm, not getting a call for that.\nThe reason I want to talk about collaboration is because we have requirements in our contract, our contractor to do certain things within the construction area, but we also work with other parts of NYCHA.\nYou know no hot water that was being shut off due to construction, because we were not going outside.\nI'm talking about how that has exacerbated or made the situation worse, so that you know- And I, do want to say that so much construction on the development, ground.\nSo I have been working remotely from home, and most people who know If you're depressed and feeling trapped at home And you walk out of your building and you are surrounded by construction and blind spots and garbage and rats.\nActually I, just wanted to see if we can focus on this sandy recovery and resilience first and then, because later we have another topic, that's going to be talking about services and also and also Covid-19 response.\nShe brought that up, but you said that you communicate your agency communicates the resiliency issues and the construction issues to NYCHA, but it does not seem like Nige is really talking to you because with Tariq's, for example, Tariq's water outage today, Right now, can you answer why he does not have water today?\nWe want it fixed, so the residents do not have flooding and we want to fix the construction, and so, while there's impacts of schedules, we're working closely with the departments to keep the projects moving as fast as possible.\nI do not live in NYCHA, but I am concerned about the flood plan for the entire community and I was a little concerned because I've been attending the Parks Committee meeting and the last time they presented a program on the interim flood protection.\nWe have designed the projects that that NYCHA is working on to protect the buildings and the campuses that were funded by the female 428 program.\nFirst of all, NYCHA defers to New York, City, emergency management for all evacuation requirements like any other property owner in the city, so The city, the mayor's office, probably, So, whether or not a structure or infrastructure has flood protection does not in any way change the fact that if a neighborhood is an evacuation, zone, people should evacuate.\nI do not know what your conditions are like when you go home, but they're, probably not the same as me, living next to a Con, Edisonison plant and also dealing with construction.\nIf, we decided to do a NYCHA platform, because we know that there is more more things coming down the pipeline than just the resiliency.\nWe also have to tackle the fact that we have governance issues and a president that may be exiting or staying in office, and we need to prepare for what that's going to look like as well.\nSo Tariq I'm, going to take you first And I appreciate your transparency, appreciate your authenticity and wish that more meetings, we had more people like you doing that when they're talking to residents because you've called me a little bit, but I do Wanna You know any conversation, anything that I've joined.\nComing to this meeting joining this committee, John, I appreciate your recommendation for the Community Board to host a public hearing, and I will make sure that we do that, but I also want to.\nI think it's crucial that your team prep and know who you're speaking to right, because this is a committee we're a body of people that live in this community Right know our community We are a body of people that could support the work that you're doing right and 's, not our job.\nIt was a waste of my time because I really wanted to go to see the community members that were present And, so we're here to support that work, And, so I think, moving forward if it's berut, if it's compost, reese Smith, whoever that those meetings are open, one to the public and they're able to see each other right, because also even the comments it was hard to understand.\nTonight, but I think that Covid-19 has been rougher than sandy in a lot of ways just because it is hit NYCHA and the city in so many different ways.\nWe also know that NYCHA can do everything and nature needs to look to partner where we can, and that means with other city agencies with other elected officials with you know with in you, know, and many of the Tenant Association presidents include and- And, you know, like Camille, for instance, has been amazing, with food distribution at baruch, and and without that, I do not know what the residents of baruch would be doing.\nWe also know that people are getting hit really hard economically and we want to make sure that they take advantage of a program that we also put in place and that the Fed is one of the few things that the federal government did right.\nIs, you know, is safe and working safely to you should maintain social distance as well You know at that time, too, as a resident, you have every right to say.\nBut my real question is: If NYCHA, let's say you know, a resident does not pay their rent because they lost their job and they are not aware of the rent hardship program or by the time they apply for the rent, hardship, program.\nIt's something that where we're aware of is the situation and that we would, we would love to be able to do because I think there are people who fall into that category and This is a crisis in many different ways, including economic, and if you can't pay what you do not have you know, The chronic rent delinquency, issue, right?\nA lot of people are going to find themselves in this situation, whether they lost their job or just the extra income from staying home, and you know, feeding your kids when they're, usually at school- And, we'll probably have to cross that bridge when we get there, but I wanted to put it on your radar, because that's how these sort of sneak up on us, but I guess the other point is.\nAnd, so I'm not sure if NYCHA is thinking about how to deal with this, because we do not know how much longer You know we're going to be in this situation.\nI know we're technically on like a phase of reopening the city, then we're also hearing from a lot of health issues that a second wave is coming So. If that is the case, you know, how are we going to deal with some of those issues like the garbage collection?\nUntil we know what that happens, it will be difficult to determine what nature's final budget will look like, but as projected right now we will We. Will we run on the calendar year, so our next budget will be due by the end of the year If you want, we could do a budget.\nI do not live in NYCHA, but I know a lot.\nMore of a question like what is during Covid-19 NYCHA, considering an emergency Just recently I had a resident Mr Royo lives in 50 Colombia on the 10th floor.\nThink that case actually even came my way, which I sent I sent in, but it You know like your refrigerator or stove would be an emergency, and Okay, and can you just clearly state what is NYCHA, considering an emergency during Covid-19 as far as maintenance issues in an apartment per se might be sure, so anything that's a health or safety related."
        }
    }
}