{
    "data": {
        "YoutubeMetadata": {
            "author": "QCB4",
            "channelId": "https://www.youtube.com/channel/UCOkywXyXAPDP3E_aykq0XFQ",
            "title": "CB4Q October 2020 Board meeting",
            "publishDate": "2020-10-14",
            "shortDescription": "Video from the virtual CB4Q October General Board meeting held on September 8, 2020.",
            "lengthSeconds": "1:44:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "QCB4",
            "normalizedName": "Queens Community Board 4",
            "twitterName": "Queens Community Board 4",
            "youtubeChannelName": "Community Board 4 Queens",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCax45Lao4YHsuBewj0H0hZQ",
            "twitterHandle": "@QueensCB4",
            "dateCheckLast": "10/8/2020",
            "status": "stale"
        },
        "properties": {
            "videoURL": "9AJtPKN8gWU",
            "fillerWordCount": {
                "uh": 227,
                "um": 236
            },
            "readTimeFullTranscript": "53 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "street": 28,
                "guys": 25,
                "evening": 22,
                "night": 22,
                "month": 20,
                "information": 13,
                "email": 12,
                "problem": 12,
                "work": 12,
                "parks": 12
            },
            "wordCountSummary": {
                "guys": 5,
                "street": 5,
                "month": 4,
                "avenue": 3,
                "voting": 3,
                "volunteers": 3,
                "masks": 3,
                "work": 3,
                "problem": 3,
                "names": 3
            },
            "fullTranscript": "Regarding the by the Nomination Committee, that deadline has already passed. It was October 7th and we do have several things which we will hopefully be selecting tonight who will be on the panel. The two people that I have selected is are Lucy Chalero and Ashley reed. Those are my two picks. The rest of the people will compete for the other three positions on the nominated committee. So having done that Christian if you're there, I guess you can give your report now yeah. I am here hey good evening, everybody, sorry about that. I'm I may put on video before the night. Unfortunately, I am out of state right now in some pretty pressing family business, but I'll do my best again. Thank you guys all for coming out. So look I mean the main. The main report that I want to give you guys is it's recurrent it's regarding our capital expense. Again, we all know we hear it all the time. As you guys know, our capital expense needs statement is due at the end of the month, but those who know our scheduling will know that October 31st is again the debt. Excuse me: October 30th is the deadline, but we will be getting an extension simply because it has to go via a public hearing, and the truth is that budget consultations have not even ended. Yet we have to end budget consultations first to be able to take all that data and then get it to the chair. So you guys can see what we asked any data that we can use to be able to formulate our capital expense. All the chairs on the board. You guys have received the link to be able to view the last couple of years need statements, so you do not have to. However, for sake of the social distancing that we have going on. It would be very helpful if the chairs could in fact access the document get in there. If you do not want to make, you know at least get a feel for it before you and your committee meet to formulate the final list. I could tell you this much that so far, several committees thus far have chosen that they won't be making many changes to it, because the truth is that this year has been somewhat of a difference from previous years, so rather with kovitch. So what we'll likely end up doing is many committees again have chosen, like I said to just keep it, as it has been in previous years, with a couple of minor changes and updated with the latest data. If all goes well, the way it's going to work out instead of us submitting it on October 30th, we will hold a public hearing at the November 9Th board meeting. I believe, which is it is a charter mandate we'll hold a public hearing and then on November 10th, we'll submit our final wish list. As far as the way the month is gone, I can give you a couple of events that we have somewhat been a part of. There was a community cleanup this past weekend conducted by the Assemblywoman Cruz. I have to admit that not many board members showed up if any at all the few that were there again. Let's just say it was not very many fyi we've also been commissioned, or rather asked. If we'd like to put your statement in the cleanup this coming Sunday. So in the next couple of days we will be getting a flyer and it is still a Sunday woman, cruises office, doing the cleanup and if anybody can see before would like to volunteer the time will come. You will receive a flyer, hopefully in the next 24 to 48 hours and to volunteer rsvp either by the office or by calling the number on the flyer. The hour other item, the mural project. You guys remember that last month I had announced that there was a mural project we were working on and that actually it's been it's been successful in that we already received several entries, and anybody to know that tonight would have would have been the deadline and we would have opened it to a full public process and the one that got the most vote is the one that won. Unfortunately, we did not get as many edges as we wanted, and I did receive a request from several artists saying that it just was not enough time. So what we're likely going to do is we'll extend it to or another now we're likely. We have already done it. We have already extended the line to the end of the month. I think again Christina. Maybe you can correct me if I'm wrong, October 30th will be the deadline and then we'll do 10 days or so of voting and we'll announce the meeting at the next Community Board meeting. The project will be funded by us. Assemblywoman, Cruz and Councilmember Danny Drummond is also supporting us. So please get the word out, send it to your artist groups. It's a really it's a very nice project and it gives us a chance to finally paint up some of the some of the walls that the NYPD has been covering that only get covered in Graffiti. It's our chance to be able to put something nice on them. So please spread the word. Get it out to your artist groups volunteer yourselves. If you want to, the prerequisites are very simple: all you need to do is submit a piece along with a small essay on what Elmhurst means to you. The theme is Elmhurst strong, and the only prerequisite is that it have the word elmer's on it and established in 1652. That's basically, all there is to it again. I will send you any flyers regarding this weekend's upcoming, cleanup and chairs you could expect by hopefully by first thing tomorrow morning. Hopefully we get all the data back from the consultations we've had thus far, and we can use that to start relating your capital expense and I think that's really it. I do not really have much more lu right now. You know me I'd rather report throughout the night as items pop up and that's it. Thank you. I appreciate it. Oh, I think you should mention to everyone how I can do it. They should have received a street naming document. I believe yes, okay, so let me let me this might this again. This is really down to the wire, so our apologies. There was a bit of a miscommunication to say the least over at the office and getting you guys, some pretty basic information, so there's a street code naming in effect, I won't get into all the details about it because you guys have received it for your email. Please check your emails, Daniel Drum's office reached out to us and he does have a letter of support that you should have received requesting that the board review and hopefully approve a street codenaming coming up for and again let me not get into details because I do not have the email directly in front of me, but please take a look at it, as you guys will know- and I mean right now only because we have to get this done by tonight. There have to have to be the landmarks of Preservation Commission, I believe, has to have the letter in by October 25th. That does not give us time to be able to vote on this at the November meeting. We are somewhat breaking protocol, I will admit, but the other fact of the matter is that the application will be submitted with or without us and it may get approved with or without us. So we may as well put our names on it. So lou. If I'm not mistaken, correct me if I'm wrong, we'll set it up where Lou goes around and checks for comments from every one of you and again, please review it now, if you can, it was just sent to you even in the last few minutes, were our apologies miscommunication at the office you'll get it just. You should have received it, ready, review it and then, as Lou calls your names one by one. He will ask you if you have any opposition questions or comments regarding the street codenaming. If the consensus is that we are perfectly okay with it and tomorrow the board office will write up a letter reflecting just that, while we did not have a quorum, there was no opposition on behalf of the board and that we have chosen to softly approve the street code naming so yes, please check the emails right now. You can do it during this meeting, just put it off to the side and again, if you have any questions, answers or comments, you may comment so while Lou does it? Excuse me when Blue calls your name all right, lou we're good to go on my side. Okay, I do not want to start calling the names quite yet I'm going to just allow you a couple of minutes to make sure that you guys have the documents was sent out to everyone about 10 minutes ago or so Lou. Can I ask a question about that? So the attachment stated that it that it was a you know a letter. They wanted to basically support for street co-. Naming was there anything associated with actually landmarking the house, because I know Marlena and her organization have been working to do that as well yeah, I think Christian mentioned Accent, landmark okay, but I mean the board. Support can also give a landmark. You know support letter as well. If the board wants to do that, but this right this, the email that you guys got just for the street code naming so okay, any other questions or comments, okay. Anyone as I call your name if you thank God that there's a problem. No, you have not committed sorry about that. I do not want to start I'll. Give you two more minutes so would like to comment about that or something good evening. I made it on. Thank you. I'm glad you're here, okay, another 30 seconds[ Applause], while we're waiting, I see a couple of elected representatives in the Attendee list. Gal could just send me a message in the chat just letting me know which elected you're representing. That would be great, so we can call on you later. Okay, all right, I will begin the roll call of board members asking them if they have anything. They'd like to say and assuming that you've been identified as who you are, you will be allowed to speak, I will start with Lucy Lorenzo scully, hey, I'm here, okay, no, I do not have any objection to the co- naming I'm sorry. I can't hear you would you like to say anything else? Actually, yes, well, hello, everybody hope you had a nice weekend. I've been working with well, I've been actually doing a book swap every month, once a month, the next one's coming up, attentively, October 29th and I do take book donations. So if you want to message me or talk to me, you know through email or something that would be great. If you had some book donations, usually do it for kids and teens, but you know any kind of other books will be acceptable as well. That's all thanks. Thank you. Lucy next chapter Mr Jim he's here Christina. Can you see him yeah he's unmuted Mr, Chan yeah, I'm here good evening, everyone. I wish everyone good okay, stay safe! Thank you. Would you like to comment on the street renaming at all? I have some like things to ask. Right now is about the transportation. Maybe there's two publication meetings coming, but now anyway, we still can ask about the like public safety, those things you remember last month not too long ago in Manhattan, Lexington avenue at 34 street, or something like that on the platform around the 10 A.M or 11 A.M. Sometime, like that openly one homeless people committed, they ripped a young lady on the platform and nobody tried to stop it. Some people even take a picture for that. I'm wondering if I saw that I go to stop what will happen to me. If I knocked out another knock that guy down kicked his head, what will happen because that's the reason it happened in some supermarket too and in disabled, the older chinese senior stopped from someone's store. The apple did not pay and he stopped him and the guy, the young men beat him up. The older chinese men then riding on his he's, laying down and he's riding on the top of him and keeping function and his friend go to help and keep that guy on the head. Then police come and his he tried to make a case, but the police say I have to arrest that your friend and post with that the attacker. Then he thought about he said in that case, then he dropped the case. He do not want to charge that attacker. So anything we could do about that. I do not think there's a lot. We can do anybody else like to speak today. Nothing like that. So that means that we only saw that innocent people getting harmed and we a citizen. We can not do anything about it. That said, we can write a letter to the mayor about it or we can write a letter to our local elected officials about it, but that would be the extent of what we can do. Mr Jim, unless you have another idea, so I said I go to I go to stop that guy. I keep that guy on the head and help that lady, that the poor, lady and I could not do it. I had to watch, take my iphone out and take a picture. That's what we're supposed to do so city could see every individual has to do what they feel is best at the time when they are confronted with that situation. There is no one correct answer here. I do not know. Is that, like everyone here on the picture, I saw you getting attacked I'm going to come to help you okay, so someone discourage me, do not do it otherwise, yeah. I have to go to jail, that's funny! Well, I'm not going to say you would not go. There is a chance that you would be taking, but you have to make that decision on your own there's no right and wrong here, Mr Chin, you have to make that decision. Okay, let's move on you're right. I wish I could tell you what to do. I'm not there yet! Okay! Thank you. Thank you, Christina! Is he there? I do not see. No any chad is not here. I saw him earlier sure yeah, but I do not see him now. Okay. Well, let's move on David Chung good evening. Everyone hope everyone is well. I see that you guys are doing good work. Just you know, taking care of the neighborhood just want to thank Michelle for sharing some of our stuff, I'm with Elm Church and we've been taking care of the neighborhood best we can and Michelle. Thank you for helping us. Do that. Listen guys! I'm just praying that everyone is safe, this season, as the numbers creep up and as for the street naming I'm all for it. Okay, let's move on Linda, Corral hi good evening hi good evening. I do not have any comment at this time. Thank you understanding or otherwise. That's right, I'm in a zoom meeting. Thank you, Reyna Diaz! No, I do not see her good evening, everyone. How is everyone doing good to see everyone? I'm for the street renaming and also I am. I thank Christian and all you guys for including me get. You know give me you know a chance to do some community work. I enjoy it and if you need me, let me know we got the voting coming up. So let's go have a good night and be safe. Thank you, arya hi, good evening, everyone. I hope everyone is safe. I'm okay with treat renaming, and would you like to say anything else? No, sir. Thank you. Thank you good evening. Everyone, I hope everyone's doing well and, of course, I'm for the street co- naming. I hope everyone has some time either now or later, to just read about these two individuals who did so much for society in general. I'm not going to talk all about it now, but if you read it, they're really amazing people, so I definitely for the street code naming and also just to piggyback what Christian was saying was a little confusion. Basically, we're also trying to landmark their house that they were that they you know they lived in, they owned it's still currently standing and because it is a big part of polish american history in the polish- american community, we are also trying to land market as well. You know me and the group numbers history, so if you guys have any questions, just let me know- and that's all for now. Thank you. Thank you. Kristen gonzalez, no vincent larcella, I'm on the phone Ma! Yes hi. Could you hear me? Okay? I want to thank everybody for all the work that they're doing in the community. I want to thank all the volunteers that came out to the two cleaning park, cleanings one at Joseph, Campanity Park and one at William, F Moore Park at the American Triangle Department of sanitation, the 110 precinct a couple of community board members. It was a wonderful turnout. We had a lot of children show up it's something that we could look forward to doing in the future, involving maybe students from the schools once everything goes back as the numbers creep up with Covid-19. I can't help but say in this neighborhood a lot of people with no masks. It's particularly the homeless, and a lot of these stores too, are a problem. We have an issue with the alcohol again being sold to visibly drunk people, specifically the store on 103Rd, Street and Corona Avenue. Anybody that lives around that area can tell you that this is an ongoing problem. I'm not going to elaborate any more into it. I'd like to speak with a couple of people after and see how we can attack the problem for the lack of better words. As for the street renaming, I think it's an honor I'm holding for it. I love to see when people get recognized for their hard work and anything that the community board needs a phone call away to help out. Thank you very much. Thank you. Vincent Lisa, yeah she's on phone. Give me one second and I will try to unmute her. I have no objection to the renaming of the street, and would you like to say something else yeah. I can hardly hear you Mr Walker. Can you would you like to say something else? No, I'm! Actually I'm waiting for my assignment to a committee well you'll be assigned very shortly. Well, remember: the committees are not meeting as they usually do so, while you'll get assigned you won't be going to a meeting like you normally would have by now in person, there'll be a virtual meeting of some kind soon, but obviously things are not as they once were. All right. I do not know. What's with my computer, because when I attended the meeting that Mr Casino held for new members to talk about the how the office functions, I did not have a problem, and this is the second time in a row for a monthly meeting that my computer does not function properly. Sorry about that, but it is what it is. It might be your computer, it might be the volume of people in the meeting. I do not know so carol and you look I'm sorry this is. This is christian speaking Carol look at yes, you are right, did work out with me and I do not recall it. We use the different app. Maybe we use zoom or web so, but regardless, what we'll do is that's what I thought too. I do not understand why, because I had absolutely no problem for that meeting. So what I'm proposing yes, instead of instead of you going through this every single month. What I can do is this and I will gladly offer even my services. What we'll do is either Christina or I and we can do it with you, maybe someday. That is not a board meeting. You know whether it's tomorrow or sometime next week, we'll maybe run through the whole thing, and maybe you know we're pretty tech savvy at the office and we'll run you some basic settings. Video audio settings stuff like that and we'll see if we can get you on because again, you're clearly logging in and whatever it is, it might be a very small technology. So maybe we can figure it out. So we'll pick a day sometime next week and we'll try to get you onto the next painting, it's easier for you thanks Carol, and I do not understand why geek Squad could not figure it out all right all right, then. Next week you have the CB4 geek squad on your side. We got you I'm paid good evening, everyone. I hope everyone is staying safe and please continue to stay safe as far as street co- naming. No, I do not have any objections. Also, I did not receive any files that you guys are talking about. What is that file about? Can I please have that fire also, not a problem, so we'll try to send it to you right away I'll see where the issue was. Thank you all right. Thank you. Got it Patricia J Martin, now yeah, okay, Sylvia Martin good evening, everyone. I hope you had a great weekend and I have no objection to the renaming up the street and everyone be safe. Thank you. Would you like to see anything else? No, I'm here to help whenever y' all need help whenever just call our email. Thank you. Okay, Matthew Mcelroy, guys it's good to hear everybody's voice, look forward at some point to seeing everybody, nothing particularly important to say. As always, and I have no comment on the street renaming. Thank you all night, hello, you're running it yep, oh good afternoon. I hope everybody's faith and you're wearing your mask and doing all the right things. I have had a very bad attack very good, but I'm feeling much better today. Thank you. Thank you. Please feel! Well, yes, okay! Next Edgar moyer! No, I do not see him. You just broke up. Who did you say, Ruby Muhammad now Sandra Munoz, yes, Sandra you're on yes, I almost could not mute myself, hi everyone, I just so happy to touch base with all of you and wishing everyone lots of health. I just wanted to let everyone know just because the numbers were going down does not mean this. This pandemic has gone away, is actually increasing in many areas around us. I'm very happy to report that Elmhurst is just a yellow zone, even in light of everything else. That's going on. That's actually not a bad thing, considering Rego Park and Forest hills and Kew gardens or red zones, and that means that we just need to continue to practice the the protocols, the social distancing, washing your hands wearing masks. I see a lot of people are very laid back about it, not wearing masks and that's actually what's going to protect us. If you watch the news, if you, if you follow the science, it tells us to wear the masks, it can avoid prevent a hundred thousand deaths by February they're, projecting a hundred thousand deaths more. If it are two hundred thousand deaths actually and it'll prevent a hundred thousand deaths. If we do our math for the street, naming I'm very pleased and supported a hundred percent. Thank you all right. Next, we have Kudup singh. No, I do not see him on Oliver, no alexandra Owens hi good, to see everybody regarding the feat naming I'm in support of it. Somebody posted on one of the or posted the landmarking about the house, and I got to read a little bit about the Bio and she seems like an important part of emperor's history. So I support it. Thank you anything else, you'd like to say no, that's it. Okay, that's a puns! Now: okay, repenter rise, no she's, not on hey either. I see Ashley. Yes, I'm here hi good evening. Everybody just want to say I'm in support of the street code Naming and I'm also in support of the preservation efforts. I was also wondering: is it possible if we can get? I know there was a petition. Circling? Is it possible if we can get the link to the position in the chat? And perhaps you know people are interested, they can find the petition and I'll say the rest of my comments for the my committee report. Thank you, okay. Thank you. Ashley yeah, that's a great idea, we'll I'll see. If you know between christine and I will see, we can get something going. Thank you yes ask for real Oscar you're unmuted. Yes, hi how's it going how's everything, guys, Hop, everybody's safe. I am support of the street the zoning code. That's all I have to say right now, I'll have my comments afterwards. Thank you. Thank you, theo Rahman, no he's not there on hi everyone. Thank you, Christina good, to see everybody. Thank you. Mr Chair. I am the support of the street renaming as well. Thank you have to say anything else. Oh that'll, be all thank you. Clara Salas Claria admitted. Thank you. Yes did you say anything else, Clara, no, all right! Next, Lucy Chalero, oh good, hi everyone. I mean very proud to say that I'm very much in favor of the street naming I think Marianne did a great job. So you have my support on that Christian. I may call on you for setting up something for public safety for the budget and do not be mad at me. I may want to add one thing, but I'll discuss that with you another time again, good work to everybody and be safe. Thank you Lucy. When am I ever mad at you come on now? Okay, thank you. Whatever you know, it's perfectly fine, you're good to go. Okay, you got it a red sevilla, oh Alton, Derek, Smith, Dalton you're on good evening. It's very interesting history and definitely supportive of it. In terms of any further comments, I will probably speak about them about Chase Bank. The real community is still closed at this time. No further comments at this time good evening, everyone I've already expressed to marlena and ehcps my support, not just for the the house, but now for the street co- naming, and I really feel like to what Ashley said about you know circulating that petition. I think we really need to preserve the historical homes that are left. They are very much fleeting in this neighborhood. I do not know if euler is going to cover this, but I brought to the attention of both Marlena and Christian that the site that we are also trying to landmark the african- american burial ground that we held a very successful screening. I guess it was last summer. I do not know I'm losing track of time, as you know had work being done there again. You know they're saying that it's archaeological work. I do not really believe that, and I do not. You know, feel that that's being transparent as they sued. So I really feel like that kind of speaks to why things need to be properly landmarked and have protections, and just as a side note, I really feel like for the street co- naming. This would be really impactful to me personally, because I had a very close friend who was polish. His father was also a painter and he passed away at a very young age, so I feel like this is sort of carrying on the polish history legacy. Thank you, Gregory Juan Tariq. I did see him, but I'm not seeing him anymore. Isaiah, no she's, not here either. Well, actually, I'm going to do this now. Well, you'll. Come back to me. Let's do the last couple of names behind me: First Rosa Wong! No, as I said regarding the nominating committee, my two picks are Lucy and Ashley. Everyone else's name is now going to go into this. It's not a hat, but it'll have to do I'm going to show you the names, as I put them in Matthew Rovina, Marilina, Sylvia, Georgina, Carrollton, so Lucy, C Clara, and that's it now. They shake things up they're all in here and I'm going to randomly pick out a name. We are here's. The is the hat. I can show you. Oh okay, Matthew! Are you on denominating Sandra Audio? So those are the three names, the rest of the names as I'll try to show you are still here in the hat, so we have to find people who will be on the nominating committee extremely randomly and what I want to say regarding that is just remember any one of you board members other than the new members who have not been here can put your name in for any office that you want, or actually I should not say, any single office. If you chose to run for, I guess more than one office, you could do that too. If you so like to do that, just remember, you can't be elected to more than one office, so that might not be a very good idea to have the need to play with this, because if it comes up as a winner, it could cause a bit of a problem, not really a serious problem. What would happen is the second place winner would then obviously get the slot, then can't be in more than one offense. As I said, so, anyone can run the nominated committee or ordinarily comes back to the board and says these are the slate of officers that are on the ballot that we thought best served the board and is there any nomination from the floor? If there was a nomination from the floor, we would simply add your name to that ballot. That night, we would know about it in advance. The only work that the nominating committee might ultimately have to do is they may have to. If enough people do not want to run for these various offices that are open. They may have to contact whoever is currently holding that position and ask them. If are they still interested in serving again yes or no, and if they say no, then they'll have to move on and see if they can find someone else who will be interested, but it can happen and there's at least more than one person, or at least one person for each office. Then their names will be on the ballot and it'll be a simply getting the ballot out to all the board members. The board members deciding who they want and sending it back to the office and the office will keep a count between now and the next board meeting, because there'll be deadlines and you'll get information regarding that as to you know where the votes end up, so I won't know until the next board meeting actually who has been elected to what office. I will announce it at that time and any questions any comments from anyone. You have to hold off. I guess to the second session. I guess for the most part to do this so now getting back. I believe the next item will be the electeds. Is that correct? Christina? Yes, that's correct, okay, I'll start off with Charles E Schumer, no Gillibrand, U.S Senate, no House of Representatives, brace me yeah! That's christian, Romero Shinron! Thank you! Christina hi, again, everyone. Thank you again. Mr chair on behalf of Congresswoman grace, Mang, no major updates, I'm sure everyone is anxiously waiting for and everyone is very attentive too. The administration tries to continue negotiations or attempts at negotiations with the house in regards to an additional heroes package. I wish I could update everyone with some good news, but it seems that it's still at a standstill and there is not anything worthy for me to update you on that end. We are fighting for a lot of things. It's been a long time. Everyone has been home for a long time and although some of the restrictions have lifted, as somebody else mentioned previously in the call we see cases going up and we have to continue to be proactive practice, social distancing and listen to the experts who know what they're saying so from that and nothing to report. I just want to make sure everyone has my contact information in case you need to reach out to me. I know a few board members have in the past. I have not forgotten about anybody, but again, if you, if you need to reach out whether it's for something legislative or an issue you're having or just to offer your thoughts about. You know the current state of our of our country. Any improvements, maybe at the federal level that you'd like to see those are all always welcome and very helpful to be honest, a lot of the ideas the congresswoman gets. She puts forth as a bill or she tries to add on to an existing package and it all comes from the ground from the community from all of you from your neighbors all of our neighbors, because I'm in the community as well and I've been in Elmer's for a long time. So again, if you just want to give me a call to tell me what your thoughts are, any ideas you have, they are always appreciated and my line is always open for anyone here. My work cell again is 202-, 420-, 8819 and I'll go ahead and I'll put that in the chat as well. Thank you, Mr Chair yield my time. Thank you. I would just like to ask a question which maybe Alton Smith would probably be commenting on. Was the congresswoman able to get any information about the Chase Bank here in Mufrac as to when they plan to reopen Lefrak is out of our district, but I have not spoken to you alton about it. I mean I'm happy to talk after the meeting and try to get more details and see. What's going on, okay, all right! Thank you! Okay Michelle! You should be able to speak now, Michelle Hernandez hi! Yes, can you hear me? Yes, hi everyone good evening? My name is Michelle Hernandez and I'm a field representative and caseworker for the Office of Congresswoman El Caso Cortez, some updates, some community updates from our office in September, the congresswoman hosted in all spanish Census Town Hall to target one of the most undercounted communities in our district. We partnered up with the National Association of Latino elected and appointed officials, also known as Naleo, and it was televised on de Le Mundo, the spanish news network we're currently working on a joint town hall for October with representative Earl boomenhour. This will be on Thursday October 15th at 7 pm. I believe our office has already shared the registration link with the board and as well as our mailing list. If you have not signed up to our mailing list, I'm going to add those to the top box so that you can have those links. A few legislative updates, late September congressional leaders reached an agreement to fund the government, approved December 11th, and the bill provides an additional 8 billion dollars for nutrition benefits, which extends the National School lunch program and also extends the pandemic ebt and that's providing 420 dollars to the case of New York City to all New York City Public school students. And so, if you have, or you know, of someone who has a child in a New York City Public school, they should be receiving a 420 per child through that program. All right, let's see one last legislative update last month, congressman Ocaso- Cortez and Senator Minority leader Chuck Schumer, urged Fema to release the funeral assistance for families of coba, 19 victims and basically they've reached out to female representatives. Assistants with the congresswoman requested back in the spring, be released to again the families of Covid-19 victims, and so they continue to put pressure to see if that funding can be allocated to those most in need. At the moment, one update the census. This was this happened today. If you have not had a chance to see, but the Supreme Court has approved a request to suspend a lower court order, so essentially the trump administration can now end the 2020 census. Count again that happened today. So we've been seeing how things turn out, but that decision was made by the Supreme Court this evening and the last two items that I will be sharing links with as well in the Chat box, is that our office is looking to honor those in our community who have been lost to the 19, as well as celebrate people in our neighborhood who are going above and beyond during this difficult time, and so, if you know the neighbor or someone in the district or lost to over 19 or who has been really going out of their way to help the community during this hard time, it's going to be two separate links. One called celebrating our community and the other honoring those lost I'll. Be sharing that with you all again on in the chat box and as always our office is available during these times via phone and email, and I'm happy to answer any questions you have. Thank you. Thank you, New York, State, Assembly and honorable now, Michael Dendeker, now Jeffrey on Aubry, no Katrina, Cruz, Alexandra yep come on so we're going to be hosting a group. Events coming up. This Friday will be hosting a you can come to our office between 10 and 2. on sundays. Yesterday, we're going to be cleaning up plaza and that will be between 11 and 2. So those who want to sign up we're going to be posting on our social media within the next day or so sign up through the event right. It would be great to see a number of community board members attending and then we continue to do food distribution, every Wednesday, starting at 12 30.. For those who are in need of vegetables, fresh vegetables and fruits, I suggest getting there around 10 o'clock, no sorry 11 o'clock, because the line gets long and the food goes really fast. Two weeks ago, or a couple weeks ago, we held a couple of backpack giveaways, helped with current and former board members. We did one with granite emblems and then the next week we worked with Lucy Chalero, oh sorry, scully, and we gave out about 500 book bags that day 250 before and as always, our office continues to be open by appointment. Only you can call our office 3:6, 718- 458- 55367, to make an appointment or you could stop by and make an appointment at 4140 junction Boulevard from the New York State Senate Christina. I do not see anybody from Ramos no from daenerys. This is generally snow, Jessica, Ramos or Ramos. No one checked in from her office, either: okay, Toby and Stavisky no from the mayor's office Jessica. Yes, she is on give me one second Jessica, you're unmuted hi folks, so we've been working on getting the word out both about getting tested for Covid-19, as well as to get your flu shot in, addressing, what's anticipated to possibly be a second wave, we're working to address the uptick in cases that we've seen in some parts of New York City by getting the word out about testing sites bringing out mobile sites, educating folks on wearing mass social distancing and just also encouraging people that you know you can't get your flu shot to protect your neighbors as well as to minimize symptoms. If you were to get Covid-19 at the same time that you might have the flu, so flu sites can be found at Nyc.Gov, Flu calling, 311 or texting Flu2877877 and again Covid-19 test sites can be found at nyc.gov covatest. We have reopened indoor dining as of the end of September, and the mayor announced that the city's open restaurants program will be extended year round and made permanent and that will include expanding seating to the frontage of adjacent properties, incorporating heating elements into their outdoor dining setups and permitting the use of tent enclosures to keep diners warm. And lastly, I just wanted to highlight that today the commissioner of NYPD, the mayor and the New York City Council, announced that well they'll be starting the reform and reinvention collaborative with eight listening sessions in each of Nypd's patrol boroughs. The one for northern Queens will be this Friday and pd is launching a reform and reinvention collaborative survey that I will be sending into the chat so that folks can take the survey. It's very brief. It takes all of two minutes to fill out and I encourage everyone to attend a listening session and if anybody has any questions, I'm happy to answer them as well. Okay from the New York City Council, Francisco Moya, yes, okay, Bernice, hello. There you go okay, hi good evening. My name is Berenice Everetty Paris, I'm with the Office of Council member Francisco Moya, who is unable able to participate tonight, but he sends his regards hope to find everyone in good health. So here are some of the things we've been up to since the last meeting. Last weekend, our office partnered with Elmer's hospital to provide flu shots to the lefrak community. Thank you to Michelle Denson, the president of the lefrak City, tenants, Association and all the volunteers who came out we have had. We will have several free flu shots events coming up throughout the district, so stay tuned for that last week we also had two food distributions, one with Corona ambulance and we distribute fresh produce at Plaza Del Sol through the healthy bucks, Program Council member Francisco, Moya funded we've had several community cleanups, where we roll up our sleeves with our basic volunteers, we'd like to thank ace alongside city agencies such as sanitation and parks department. The most recent event took place at William, Ethmoir, Park and up Corona avenue to I might say this wrong, it's committee park, so thank you, Vinnie who provided breakfast and ari as well as 100 presents for joining us as well as the Volunteers Council member Francisco Moya allocated 160 thousand dollars in funding for DSNY in the ace program. These additional servers have made a real difference within the district. Unfortunately, we do see a lot of illegal dumping. If you happen to come, acrosss any illegal dumping site feel free to reach out to our office, as we continue to work closely with the Sny and Ace to tackle these ongoing issues for people illegally dumping garbage a couple. A couple of funding highlights. We have our council member Francisco. Muy has allocated another round of funding to local restaurants in partnership with Hispanic Federation, to prepare and distribute thousands of cooking meals for families in need, so stay tuned for that as well. We have a frame drop, free, oops, sorry, we have free drive in movies at blush and meadows Corona park funded by Council member Francisco Moya, so there's so many great movies that are upcoming, including black panther, which is screening this weekend, as well as cocoa and night nightmare. Before Christmas and many more, you can visit rooftopfields.com for more information and to rsvp it's a great way to get outside and enjoy a movie while social distancing. So thank you and please feel free to call email me with any constituents or committee questions or concerns. If you would like to participate in one of our community cleanups or any of our upcoming events, I will be putting my information in the chat or you can feel free to call our office at 718-, 651- 1917. We can hear you kelly okay, good morning, good evening, everyone, I'm Kelly from councilman drums office, no major update from our office. We continue to work remotely just one thing to want to mention. We our office having the immigration current tomorrow from 3 P.M to 6 pm. We still have appointments available if anyone's need an appointment. What you need to speak with a immigration attorney, your face will call our office and special appointment. You can our office phone number is seven one, eight zero, three, six, three seven three and then and that's it and then, if you us and then we also will have the general immigrant general legal service later on, you can also call us to get more information. Now, that's it for me. I wish everyone have a good night. Okay, thank you from Queensborough, president from the President's office, no you're, unmuted! Okay, great! Thank you very much hello. Everyone, chair and district manager, a couple of quick items. If I may voting we're right up we're right there. Early voting starts October 24th, please. If you have not sent in a ballot, make it your mission to get out and vote it's a very important year for many positions. Movie night last free Monday night by Borough, President Sharon Lee is tomorrow night. Wall- E is the movie. You need to make a reservation on our website. If you would like to attend, the movie nights have been a huge hit. So if you would like this is the last one of her free movie nights and last but not least, veterans day event, it will be virtual and it will be November 10th. I will send christian a flyer to pass around to all of you and hopefully you will be able to attend good to see you all be safe, be well see you in November I'm around. If anybody needs questions answered. Thank you. I have a question. Okay, ask me something I can't answer well we'll find out a minute yeah there you go regarding the early voting. Yes, if your polling places in Rego park, which I believe is in the red zone, be moved or will you enter the Red zone? Okay, that's a great question. First of all, your regular polling place is not necessarily where you would go to early vote. Make sure you look and check online now, if you're asking me, because that is your early voting location. That's a very good question that I do not have the answer for, and I will get it to you first thing in the morning: if not now, I will try and text and get an answer for you, but if not I'll get a few in the morning, but that's a great a great question and again, if you want an early vote, do not assume, in fact it's probably not your regular polling place is probably not where you go for early voting so check before you leave and Lou I'll get to you with an answer with that. Sorry, thank you again. Good question: okay, okay, New York, City, Comptroller, Scott Springer or his representative. Yes, James aims. Can you hear me? Can you guys hear me? Yes, we can James, okay, sorry, my audio split, I'm getting community board nine and one headphone and then the other one, I'm getting four, I'm sorry, it's hard to concentrate okay, so hi everyone. This is James Montaluso from the office of the New York City comptroller. Here. To give you a few updates. One is that our comptroller's office education guide is online. It's been online for about a month. I can't recall if I showed it to you last time, but I'm going to put it into the chat for the panelists, and I guess Christian maybe can give it to everyone else, so I just put it in there now. So the guide has a lot of information about navigating the public school system, primarily, but also the catholic schools for the Brooklyn diocese and also the archdiocese of New York, depending on where you're you might have students or where your children are there's a little bit of other information about some other. You know information about private schools and so on, but it's mostly about the public schools. We just found out that about that 52, I believe of public school students have opted for completely remote learning. So if you have any questions about that, you can take a look at the guide. Additionally, the office has just released its 13th economic and fiscal outlook journal or newsletter. So again it has a lot of information about the fiscal condition of the city. So, if you're interested in getting just you know some facts about what the recovery is, looking like, what the unemployment numbers and what the prospects are for the city in the future I'll put that into the chat as well. So you can take a look at that all right, so yeah the fiscal outlook. Additionally, our office has also been advocating for a year- round open streets program that would include retail businesses to really help them out, because we feel, like they've, been somewhat forgotten with the open streets. A lot of it has been focused on restaurants, which are definitely more vulnerable, given that you're not allowed to eat indoors at beyond 25% capacity at present and that's a fairly recent update prior, you were not able to eat inside at all, so we're pushing that along with Senator Ramos. Who is the state senator and a significant portion of community Board of four? So please check that out as well I'll put that into the chat, and otherwise you do not have a great month of October and please reach out to me. If you have any controller related issues or any city government issues that maybe are not controller related but you're stuck with thank you from the New York City Public, Advocate, Germany Williams or his representative, no one checked in okay. So let's get back to the agenda reports, we will start with the sensors. So no krista, I'm sure I'm sorry Christina she's, not here right. I do not see her on the list. No she's, not here, okay, all right, so we did we. I do have well it's two parts. First off I have a message from John Wang who wants to thank us for joining again. Those who know this was a borough white event that was in conjunction with the queen's night market. The queen's museum, a bunch of city agencies and local organizations got together to do a worldwide census event. We happen to be one of the sponsors at least one of the participants. Basically, what happened? A lot of different informational tables with census, reps and volunteers, set up at different places on the district, to help people to sign up to the census and to you know, hopefully negate some of the stigmas out there. Our board was stationed at the Queen Center mall. We had, and I will name you guys out, because you know it's really difficult to come out during Covid-19 times, especially to the Queen, Center mall and especially on a weekend. So I want to thank you know Matt for coming out Kristen. You know she was there as well Michelle Dunstan we michelle this one is actually out there delivering food to all the different tables throughout the district. So thank you for that Michelle and again, for what it's worth the event was. Very you know it was very popular. Unfortunately, a lot of the people who were at the Queen Center mall were either waiting for a bus or about to get. You know about just got off the bus and did not really have the time to engage us, but we did manage to get. I want to say a reasonable amount of people signed up a lot of times. We got to the point that we were signing up and then bus would come so we would stop the application about three- quarters of the way through, but it was very successful on that day. Our numbers were considerably low. Overall, I think we were still in the 50 percentile. Maybe it's 51 percentile, elmers and Corona with the census. Members take the latest, but anyway, that is the report for the Census Committee chances are. We will be doing another similar thing. I do not think it's going to be to the magnitude of get Queens counted, but the truth is we have to the end of the month and we still have the means and resources to be able to do at least one more census event. So that's it for these thanks. Okay, consumers. Hey again, so we will be meeting Thursday at 7:00 P.M and we're going to be going over a couple things. The first we'll have a presentation marketing for small businesses. So if there's any small businesses that want to attend that might want to update how they're doing marketing or might want to improve their skills, we welcome you to join then we'll be going over capital and capital and expense to try to figure out what, where we want to allocate money funding this year. If you have any ideas, particularly because Covid-19 is, has really hit a lot of very small businesses bringing to the table so hopefully we'll see you on Thursday. Thank you, Alex. Thank you! Alex, environmental, yes, hi! Okay, hey guys, I know how much to report really I mean I think I said this before last time, but I still see you know I mean face, mask use, face mask on the floor and you know I mean it's great, that we use a face mask, but if you guys do not, I mean if we do not need it. No more just you know find a trash can and trash it. I mean it's just not really a good site when you see face mask on the blocks or like on the streets, so if you could dispose of it, it'd be great. That's all I have to say thank you lou if I may, if I may, just intercede for half a second go ahead. Okay, so and again I've been in somewhat contact with Oscar on this, but you guys already know that in the Corona area, or actually our only two real community gardens are in the coronal area. The first one is sparrow's nest and the second one is the Corona taxpayer's garden. Many of you remember that sometime, I want to say, maybe about a year and a half, maybe two years ago give or take. There was the potential of a third one coming up in the Corona area, around Van cleef, just off Corona avenue- and this was this- was a community garden that what to an extent, I guess you we could say- was started by a local community group called mujeres. This came to us several years back and they were looking for the Community Board support on something like this. So we disappointed, we just said that we were in favor of it is a city- owned property that you know, we did sign our names onto it and we would be wanting to support whatever we can, because our other two gardens are anybody who knows they're my pride and joy and if you have not visited them, you really should and I'm not exaggerating. When I tell you Corona, we are producing our own honey, we have hens, we have quails, it's an amazing garden and if you have not seen it yet, you really should take a look down the sparrow's nest over 100 seconds. I want to say Louis strong area, but you know it's something to look into so why I bring it up. Now is because the third community garden, the paperwork once Covid-19 began somewhat took a slow it kind of slowed down the life a little bit. I was with gregory last week when we had two weeks ago when we had our consultations with the parts Department, and I just in fact bring it up. As I speak to the main person with Mujeres Mourinho asking what was the status on the application, the first one did mention that they were looking for us to give us what the latest update is. So we can begin. The truth is that there are several places throughout the borough and throughout the city where community groups, much like most community gardens, have been taken over taking over gardens in many of these places. For sake of going and doing things properly, we are not going to do that, but I am certainly not opposed and I will go on record where we'll try to do things right. But the truth is that if we do not hear from the Parks Department soon I can, I can tell you that there will be a community group that is going to say very same community group is going to be working with me because I will work with them to go and at least begin you know, even if it's to put a show on the ground. The truth is that the property it is city- owned land. It has been approved as far as we know, to be up into the community garden, but there is no work being done on there. So if we can do a very small social, distancing, we'll say workshop or it's between Us Department of Sanitation and maybe some local volunteers to at least begin by leveling out the land over there before we get the approval, it's a possibility. It is not recommended. Of course parks wants us to follow the rules, but the truth is that I personally feel that parks has been dragging its feet. Despite you know, coming so you know stay in touch, you know everybody I'll stay in touch. You know, and you know, keep your head as close to the ground because you may be seeing and your potential sometime soon, hopefully before the spring, I'd love to have it done sometime before Earth day. Anybody knows that I take pride in those two gardens Earth day, which also happens to be the same day as my birthday. I take those very seriously and my birthday is usually at one of our gardens, so I would love to see a third one and maybe April 22nd of this week. Thank you, April 22nd earth day. Do not forget yes, Sir! Thank you all right, the health hello. So we plan to meet sometime this month. I have to work on a date to discuss our budget requests and the district needs. It's probably going to be similar to what we had last year. Not you know not incredibly much has changed, but I just want to give the new members an opportunity to review it also, so we should be meeting later on this month. I was also talking with Christian about possibly bringing self schwabbing Covid-19 self, swapping to Elmhurst Corona. I see they've done it in forest hills and Regal Park and I understand their red zone, but many parts of Elmhurst are orange, including left rock city, so I think it's important that we also offer that to our neighbors as well, so still waiting to hear what we can do about that, and also I just want to encourage everyone to take advantage of all the free screenings and testings that are available. You know, Elmer's is still doing free, walk- in testing no appointments required and also you can walk into any city md as well, so everyone should take advantage of that. Also October is breast cancer awareness month. So let's not forget about that as well to keep on top of our screenings and that's it. Thank you Fox. Thank you, Austin Sorry Luke. So the the news with parks, you know, is pretty grim and it's really disappointing because obviously they've been so much of a lifeline during this whole pandemic. I will you know not go into all the details, but basically 81 million dollars has been cut from the parks budget. So that's a 14 reduction. One of the things that was really alarming. That Christian- and I you know discussed- is the fact that they're cutting their tree pruning schedule, which basically means that you know our district does not have any tree pruning happening. We asked them, you know what is their contingency plan. They said they're going to rely on things like Fema and other federal. You know resources but, as we know from the recent storms that we had, you know these things happen and you know: trees fall on cars and other things and we're not being proactive. So you know we will continue to push in our in our capital, expense and needs statement that you know we need to still find ways to get these things done in the midst of this budget shortfall- and you know just just a comment overall on sort of the inequities of parks. During this whole pandemic, I've been sort of taking Austin my two and a half year old, now, two various parks all throughout the city and we've been spending some more time in Manhattan. Just for a change of pace which recently Hudson river park just opened, their pier 26, which is droid, draw droppingly beautiful, but is really a shame when you see what a park in similar size in acreage, Flushing meadows Corona park, you know which has a similar public private partnership that Hudson River Park Trust does have. So I definitely will be pushing upon the alliance and the Community Advisory Board to really have a concrete plan, because I feel there is not one and you know they're relying on you know some magic donor to appear and give money, and I think you know, as a community, we really need to sort of you know, show the elected officials and the mayor and Parks Department that more funding does need to go into parks. You know we can't be cutting the budget, that's large and then just saying oh well, you know that's going to mean you know, parks and deterioration and other things that are really bad. So that's a long window way of saying you know that I will continue to push for the needs of the community. As people have expressed to me like Ashley, I will consult with Christian about putting together a meeting and letting the Parks Committee members know about that. Thank you. Thank you. Transportation and you're unmuted. Okay. The transportation committee is meeting next week on the 21st at six pm to discuss the needs statement. We have nothing to report at this time. Thank you. Thank you, public safety and homeland security, okay, hi everyone. We had a long list of people from the liquor license, but I asked our officer to answer some questions from the community and he sent them to meet them, so I'm going to go through them, real, quick. But first I wanted to announce the cert program that we that we're part of serve throughout the city of New York, 66 million meals to New York City in need- and I think that's a great accomplishment. We are on Standby now for the second wave, so we're going to see how that works out. Hopefully we won't go through it. I asked for a crime stat from the 28 day period from last month. He did give me a Wwnyc.Gov website for crimestop, but it's always a week late and I want something more current. So this is the current of the crime. Stat rape, robbies, felony assault and Grand Larceny and burglaries are all down. The only thing that's up is grand largely of autos, so that seems to be still a problem with us, the homeless issue that was brought up for Whitney, Avenue and Broadway they're thinking of certain areas that keep coming back with the homeless of making like these mini task force, but they need the breaking ground and other not- for- profits to keep up with the situation they're working on this now with the NCO officer of a and B Graffiti, we asked about giving a 500 fine for those that commit the crime or 500 award, who can give us information who's doing the crime that is now being looked at by the police department, vendors at 11Th street in 44Th, Avenue and 51St avenue they're going to check some of them and complain that they have licenses to be there they're going to check on that to see, if that's true or not so far, they have not, they will summon them if they continue to be in those locations. Oh noise complaints was number one from Wisconsin I've gotten as a civic leader throughout, because the restaurants will close at 12, but they want they're competing with one another. So the volume is very loud they're, also not keeping up with social distancing, and I asked them are they being summoned? He says: yes, they have and they have brought the SLA inspectors with them. So they not. Everyone has been summoned. They have given some caution to some. So we'll see this. How this will work out as the weeks go on another problem, we're having as they close at 12 A.M, the patrons are leaving with glass bottles of beer, so they're sitting on private soups, occasionally leaving their bottles or breaking the bottles they're going to talk to some of the merchants about that. We did talk about a little bit of. We've talked about the mayor and the governor by closing the south end developments for the the shade of oranges that everyone was talking about, they're, going to be watching to see how our stores and restaurants are following the new closure at near 108Th, Street and left rock. So hopefully nothing. This won't expand any more than it is now. A problem from St James Church was brought to our attention from one of our members about a child's tricycle and a man who keeps breaking into a four- door. Blue hatchback, but no one has filed a complaint. So the officer asked if you could find a person who saw these people do it and to file a complaint, and then they will look into it so homeless, men that sits in front of the church now that's it now. As for the liquor license, we have 16 applicants that filed two. That did we one that did not need to come in. That was tomo restaurants. There were no violations whatsoever and one named 12 corazon restaurant at 86:22, roosevelt Avenue. He was not ready to come in everyone else. Was there we were there for two hours almost but- and I have to thank everyone that was at our committee for staying as long as they did. All of them had noise complaints. Many of them did not follow the Covid-19 rule. We asked them. I said you can't continue to do this because it's a very dangerous thing for our community. They did get summonses which I'm proud of the cops, stayed on top of that, at least so. Hopefully they won't continue to do this, and that is my report and I thank you all very much. Thank you, Lucy okay. I think Lou's going to fall asleep. Oh no! Ah thank you. Lucy okay, we have not met, but looking at the realities of a revised application for 80 Seconds-11 claims boulevard that have come into the office, a statement of needs that we need to meet also 110- 40 shuttle Avenue. That's also seem to be an application, that's going to be before us and we might need to discuss with the developers what their intentions are there. So with that being said, I'm thinking in terms of dates that maybe hopefully we can meet by the 29th of this month, if that's all possible, but I will touch bases with crystal and the office to see what we can do about at least having a meeting by the 29th of this month. That's on a Thursday and regarding Chase Bank. Obviously this is a situation that affecting the individuals in our community, as well as the agencies and businesses that does business with chase. So what I'm thinking that, since that is an issue that would come under Europe, which is the economics of the community that do a letter to chase or inquiry to basically invite them to the Europe committee or to say what their intentions are and then present that to the board in November, and that's basically about it. Thank you, alton. Okay, thank you hold on youth services. No, not okay! I guess this is the final round of the this is open session. Two, I guess, remember hold on nope, I'm good. I said everything earlier, so thank you. I hope everyone has a good night and stay safe problems and headaches. What was that Mr Chin? I said, storing more cameras on the street corners. We can solve more problems such as some like a dog walkers. They leave some poops on the street and we can trace to them. No. So if I, if I may intercede very quickly, Mr Chen as part of our capital expense needs statement every year there are. There have been instances where we have requested security cameras in our neighborhood, so it is a possibility for us to request them. It's not a guarantee. We can get them, but all we can do is ask so the request has been noted if you'd like to reach out to me or the board office that do not know where you'd like to see them. We will put the request through just for the sake of putting in the business, there's no guarantee we'll get them. So if we get identified as locations, we can certainly put them. Thank you. Do you know how much in store for the expenses? Absolutely no there's, no there's no way of knowing remember so. We use the term budget a lot as it, but if there is, there is no monetary value on all these items. It's just it's just the community wish list and then we'll put into whatever category it fits in whether it's capital or expense, but again just if we can identify the corridors that need the cameras. We can certainly report it to the city and just make it known. The community means it does not necessarily mean we'll get it it's just that we are advising that it is an actual need. So let's identify those locations and we can put it through. Thank you. Thank you. Okay, Andy Ching is here or not. Now David Chung yeah, Lou yeah. We can hear you yeah nothing here. Okay, thank you, Linda, nothing! Further! Yeah, Lorena, Diaz good evening. All no concerns nothing. Thank you! Michelle Dunstan! Well, it's! No! It's no concerns. I might my video went off, but I wanted to see because Saturday I'm going to have an event with the sensors and you know the voting and if you had any material, you know from the census or maybe you could have somebody that could get me some material. For my event, I appreciate it. Everyone be safe and have a good night, absolutely Michelle. So what I'll do is I I'm actually going to make the note right now, and not only will we get you materials, but we'll put you in contact with a representative from the census who would be willing to come out and even assist you guys to stop it. We can certainly throw them on it right away. Thank you, we'll get on the right away, hi good evening, everyone once again nothing further from this! Thank you! Okay, you are on the nominating committee. I do not know if you heard that yes, I did. I am ready for the job. Okay, hey everyone! Nothing further like I said: if there's any questions about this co- naming or the landmarking, let me know and have a good night everyone. Thank you Kristen gonzalez, no she's! Not here! Yes, could you hear me? Yes, I just want to say: teamwork makes the dream work like Michelle always says everybody on this community board is wonderful. Keep up the great work and God Bless have a blessed October and have a great night. Thank you. Vinnie hold on Carol you're unmuted. Okay, I do not have anything to add. You carol, I thank you, sanil, nothing for now. Thank you all have a good night. Thank you, matthew, hey everybody! Nothing to add happy Halloween, remember to vote, see you next month. Thank you, Matthew Rovina, Mcgowan, Fenia you're on I'm fine, I'm feeling a little better. Thank you. Thank you. It's taking time to mute, but anyway good night, everyone good to see you all and yes go out there and vote, and I know that we're all voting for this is like a really huge election, but remember that there are als, also local. You know people that are running locally, especially our judges. We have our latino judges. We need more diversity in the the court systems which we do not have, and so this is our opportunity to get those those diverse judges in the in our judicial system and have a good night. Everybody thank you. Sandra, okay, bye, Sandra, you're on the nominating committee. So do not forget. Oh no, and I'm so happy to see my co- nominating committee members. It's so it'll be fun. Thank you! No Mr Marula Christian Christina, Mr Nurula said he was in and he was calling for a 516 number, but I do not know I mean Lou. He may be here. I'm sorry, I do not see him. 516 number. Would that one six, four, five! Thirty, two! Fifty three! I yes try. Yes, that seems about right. That seems right. Yeah. Try that you're going to mute that Chris! Okay, thanks, give me a second okay, no yeah. He called me on my phone a minute ago telling me that you know he was in the meeting from that number. But that's fine! Let's keep it moving! Thank you! Okay, Oliver she's! Not here Alexandra, owens, hey, I'm here, Georgina is here Georgina hello. Can you hear me okay? So I have nothing to add, but thank you. Okay! Thank you. Thank you! Alexandra, okay. I owen nothing to add. I have a question for Alton, though real quick. What was the address of the development that you mentioned? Is that here right, alexa, no she's, not here right, no Ashley, reed, nothing further to add everyone have a good evening. Thank you. Oscar reels, Oscar you're on. Oh yes, I just want to add everybody. Stay safe, have a good night. Just vote and environment is in the bandits. So let's not forget that and have a good night. Thank you. Thank you. Neo Rahman looks like he left yeah. I think I think he left Chris yeah. I do not see him anymore. Fernando yeah just give us a second yeah Clara you're unmuted. Thank you, Clara Lucy you're unmuted Lucy. Thank you. Thank you very much, nothing to say, stay healthy and stay safe, hear from you all next month. Thank you. Thank you. Lucy Alt and Derek Smith stay safe, have a pleasant evening, just one quick thing that I forgot to mention with parks. Please know that just because you're outside does not make you immune to the virus, so I see a lot of mainly adults that are in parks and not wearing masks, please, for the sake of the children and the younger people that are using those parks, respect that rule and wear a mask at all times thanks and have a good night. Thank you, gregory yeah you're, absolutely right. I go to Flushing metal and a lot of people do not have enough, but then again it's hard to have a if you're eating and drinking that's the other anyway Dejuan Tariqa is not here. Marcelo tested his marcelo is not here, Isaiah, nothing else to say: Rosa Wong was not here and then one last thing: it's about this small. It's a small, tiny, little item I'll. Let you finish them, okay, so really quickly. If I could just jump in board members, just please look out for your emails, one of the one of the perks of using constant contact as our mail server main mail server. It shows us the emails that are being sent out and it turns out only 30 of board. Members are opening the emails. I understand that you know when you receive email from constant contact. It comes off as marketing and then it might get jumbled up in the rest of your email. Why? I say it is because it happens to me as well. So one thing that I can advise is, I want to say about. Maybe a third of you already have it, maybe even 50. If you have not done so yet maybe you do not have to it may help to create yourself. An email address exclusive to community Board for some first name last name CB4 at gmail at Yahoo or whatever. Maybe again, it's really they're being open is only 30 of you and that's very disappointing, and that covers everything. That's from minutes to meeting notices, and then we end up not having quorums and no people showing up to event. The truth is, if only 30 of you even opening it to begin with, then that's an even lower number. So if the issue is that you know it's getting mixed up and jumbled up with the rest of your email, if your emails rather please consider obviously, of course, look out for our emails, but above all else, please be sure to maybe possibly create a small email for yourself. They're free, gmail, Yahoo Hotmail, just create yourself an email exclusive for CB4. We do not send any spam. It's always just only community events that are happening within our area and every so often something outside the area thanks a lot. Okay, thank you. Everyone for coming good night and be safe thanks. Everybody upcoming information, bye- bye. Now you guys rock. Thank you. The.",
            "summary": "We will be getting a flyer and it is still a Sunday woman, cruises office, doing the cleanup If anybody can see before would like to volunteer the time will come.\nYou, guys remember that last month, I had announced that there was a mural project we were working on and that actually it's been It's been successful in that we already received several entries, and anybody to know that tonight would have would have been the deadline and we would have opened it to a full public process and the one that got the most vote is the one that won.\nPlease check your emails, Daniel Drum's office reached out to us, and he does have a letter of support that you should have received requesting that the board review and hopefully approve a street codenaming coming up for and again, let me not get into details because I do not have the email directly in front of me, but please take a look at it, as you guys will.\nThe board wants to do that, but this right this, the email that you guys got just for the street code, naming I've been working with well , I've been actually doing a book swap every month, Once a month, the next one's coming, up, attentively, October, 29th, And I do take book.\nMaybe there's two publication meetings coming, but now anyway, we still can ask about the like public safety, those things you remember last month not too long ago in Manhattan, Lexington avenue at 34 street, or something like that.\nI enjoy it, and if you need me, let me know we got the voting coming.\nI want to thank all the volunteers that came out to the two cleaning park, cleanings, one at Joseph, Campanity Park, and one at William, F Moore Park at the American Triangle Department of sanitation, The 110 precinct a couple of community board members.\nWe had a lot of children show up it's something that we could look forward to doing in the future, involving maybe students from the schools once everything goes back as the numbers creep up with Covid-19 I can't help but say in this neighborhood a lot of people with no masks.\nI love to see when people get recognized for their hard work and anything that the community board needs a phone call away to help.\nGive me one second I have no objection to the renaming of the street, and would you like to say something else: Actually I'm waiting for my assignment to a committee, So, while you'll get assigned you won't be going to a meeting like you normally would have by now in person What's with my computer, because when I attended the meeting that Mr Casino held for new members to talk about the how the office functions, I did not have a problem, and this is the second time in a row for a monthly meeting that my computer does not function.\nThat's, actually not a bad thing, considering Rego Park and Forest hills and Kew gardens or red zones, and that means that we just need to continue to practice the the protocols, the social distancing, washing your hands wearing masks.\nPerhaps you know people are interested, they can find the petition and I'll say the rest of my comments for the my committee report.\nI may want to add one thing, but I'll discuss that with you another time, again, good work to everybody and be safe.\nThose are the three names, the rest of the names as I'll try to show you are still here in the hat, so we have to find people who will be on the nominating committee extremely randomly and what I want to say regarding that is just remember any one of you board members other than the new members who have not been here can put your name in for any office that you want, or actually I should not say, any single office.\nYou can't be elected to more than one office, so that might not be a very good idea to have the need to play with this, because if it comes up as a winner, it could cause a bit of a problem.\nEveryone has been home for a long time and although some of the restrictions have lifted, as somebody else mentioned previously in the call we see cases going up And, we have to continue to be proactive, practice, social, distancing and listen to the experts who know what they're saying so from that, and nothing to report.\nSo we've been seeing how things turn out, but that decision was made by the Supreme Court this evening and the last two items that I will be sharing links with as well in the Chat box, is that our office is looking to honor those in our community who have been lost to the 19, as well as celebrate people in our neighborhood who are going above and beyond during this difficult time, and so.\nIf you know the neighbor or someone in the district or lost to over 19 or who has been really going out of their way to help the community during this hard time, it's going to be two separate links.\nIn, addressing, what's anticipated to possibly be a second wave, we're working to address the uptick in cases that we've seen in some parts of New York City by getting the word out about testing sites bringing out mobile sites, educating folks on wearing mass social distancing and just also encouraging people that you know you can't get your flu shot to protect your neighbors as well as to minimize symptoms.\nFor that last week we also had two food distributions, one with Corona ambulance We distribute fresh produce at Plaza Del Sol through the healthy bucks, Program Council member Francisco, Moya funded we've had several community cleanups, where we roll up our sleeves with our basic volunteers, we'd like to thank ace alongside city agencies such as sanitation and parks, department.\nThe, most recent event took place at William, Ethmoir, Park and up Corona avenue to I might say this wrong, it's committee park, so thank you, Vinnie, who provided breakfast and ari as well as 100, presents for joining us as well as The Volunteers Council member Francisco Moya allocated 160 thousand dollars in funding for DSNY in the ace program.\nAny illegal dumping site feel free to reach out to our office, as we continue to work closely with the Sny and Ace to tackle these ongoing issues for people illegally dumping garbage a couple.\nYou would like to participate in one of our community cleanups or any of our upcoming events, I will be putting my information in the chat or you can feel free to call our office at 718, 651, 1917.\nI will send christian a flyer to pass around to all of you, and hopefully you will be able to attend good to see you all be safe, be well see you in November You go regarding the early voting.\nIt's probably not your regular polling place is probably not where you go for early voting , I'm, getting community board nine and one headphone This is James Montaluso from the office of the New York City comptroller.\nIf you're interested in getting just you know some facts about what the recovery is, looking like, what the unemployment numbers and what the prospects are for the city in the future.\nA lot of different informational tables with census, reps and volunteers, set up at different places on the district, to help people to sign up to the census and to you, know, hopefully negate some of the stigmas out there.\nWe, had, and I will name you guys, out, because you know it's really difficult to come out during Covid-19 times, especially to the Queen, Center mall, and especially on a weekend.\nSo and again, I've been in somewhat contact with Oscar on this, but you guys already know that in the Corona area, or actually our only two real community gardens are in the coronal area.\nThey were looking for the Community Board support on something like this.\nWe did sign our names onto it and we would be wanting to support whatever we can, because our other two gardens are anybody who knows they're my pride and joy, When I tell you Corona, we are producing our own honey.\nAs people have expressed to me, like Ashley, I will consult with Christian about putting together a meeting and letting the Parks Committee members know about that.\nWe had a long list of people from the liquor license, but I asked our officer to answer some questions from the community and he sent them to meet them.\nThe only thing that's up is grand largely of autos, so that seems to be still a problem with us, the homeless issue that was brought up for Whitney, Avenue and Broadway They're thinking of certain areas that keep coming back with the homeless of making like these mini task force, but they need the breaking ground and other not- for- profits to keep up with the situation they're working on this now with the NCO officer of a and B Graffiti, we asked about giving a 500 fine for those that commit the crime or 500 award, who can give us information who's doing the crime that is now being looked at by the police, department, vendors at 11Th street in 44Th, Avenue and 51St avenue they're going to check some of them and complain that they have licenses to be there they're going to check on that to see.\nThe request has been noted if you'd like to reach out to me or the board office that do not know where you'd like to see them.\nYes, I just want to say: Teamwork makes the dream work like Michelle always says everybody on this community board is wonderful.\nPlease know that just because you're outside does not make you immune to the virus, so I see a lot of mainly adults that are in parks and not wearing masks, please, for the sake of the children and the younger people that are using those parks, respect that rule and wear a mask at all times thanks and have a good night."
        }
    }
}