{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCWbbRCqlmjlxoQMSqT_vDgQ",
            "title": "MCB4 July 2020 Full Board",
            "publishDate": "2020-08-18",
            "shortDescription": "PRESENTATION \\u0026 PUBLIC HEARINGS   \\n\\nPublic Hearing: Scoping Hearing on Draft Environmental Impact Statement on Empire Station Complex \\n \\nMEETING AGENDA\\n  \\nPublic Session  Jeffrey LeFrancois\\nAdoption of Agenda\\nAdoption of Last Month’s Minutes  Lowell D. Kern\\n\\nReports  \\nManhattan Borough President  Brian Lewis\\nLocal Elected Officials  Various \\nDistrict Manager’s Report  Jesse Bodine\\nChair Report/Committee Reports  Lowell D. Kern\\n\\n\\nArts, Culture, Education, and Street Life__________________________________________\\nItem 01: Letter to Mayor de Blasio and DOE re School Reopening  \\n\\nBusiness License \\u0026 Permits Committee (BLP)\\nItem \\n02: Letter to Chair \\u0026 CEO Chipotle Mexican Grill of Colorado re 885 10th Avenue - Chipotle Mexican Grill of Colorado LLC\\nItem \\n03: Letter to SLA re 885 10th Avenue (57/58) – Chipotle Mexican Grill of Colorado LLC\\nItem 04: Letter to SLA re 450 W 33rd Street  (9/10) – Citizens Manhattan West LLC\\nItem 05: Letter to SLA re 305 W 48th Street (8/9) - YYY Atlas 48 LLC, YYY Atlas Manager LLC and Civilian NYC LLC\\nItem 06: Letter to SLA re 599 10th Avenue – The Spot Bar NYC LLC \\nItem 07: Letter to SLA re 149 W 14th Street (6/7) – Chama Mama LLC\\nItem 08: Letter to SLA re 856 10th Avenue - The Jin Restaurant Corp.\\n\\n\\nClinton\\\\Hell’s Kitchen Land Use Committee (CHKLU)\\nItem 09: Letter to Mayor de Blasio and Speaker Johnson re Impact of Temporary Hotel Shelters\\n\\nWaterfront, Parks \\u0026 Environment Committee (WPE)\\nItem 10: Letter to Parks re Replacing Chelsea Park Track – Subject to Ratification\\nItem 11: Letter to HRPT re Chelsea Waterside Park Design\\nItem 12: Letter to Chelsea Piers re Roadway Access\\nItem 13: Letter to EDC and Electeds re Manhattan Cruise Terminal Access\\n\\nTransportation Planning Committee (TRANS) \\nItem 14: Letter to Electeds re Traffic Enforcement – Subject to Ratification\\nItem 15: Letter to NYPD Precincts re Precinct Barricading – Subject to Ratification \\nItem 16: Letter to DOT re Implementing Mitigation Measures for the 14th Street Busway\\nItem 17: Letter to DOT and DSNY re Containerized Collection in Parking Lanes\\nItem 18: Letter to DOT re Sidewalk Extension Maintenance\\nItem 19: Letter to DOT re Protected Bike Lanes on 38th and 39th Streets\\nItem 20: Letter to Council re Pedestrian Space in Relation to Electric Bikes and Scooters\\nItem 21: Letter to XX re Pedestrian Space in Relation to Open Dining\\n\\nJoint Transportation Planning (TRANS) and Chelsea Land Use Committee (CLU)\\nItem 22: Letter to ESD re: Response to Scoping Hearing on Empire Station Complex\\n\\nHousing Health and Human Services (HHHS)______________________________________\\nItem 23: HHHS Letter to Mayor and DHS re Temporary Hotel Shelters in Community Board 4 \\nItem 24: HHHS Letter to Speaker Johnson’s Office and HPD re Black Spruce Management LLC and W. 49th Street Article XI Project \\n\\nOld/New Business_____________________________________________________________",
            "lengthSeconds": "3:49:54"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "9c-9_bUta9Y",
            "fillerWordCount": {
                "uh": 354,
                "um": 488
            },
            "readTimeFullTranscript": "136 min read",
            "readTimeSummary": "17 min read",
            "wordCountFullTranscript": {
                "bar": 60,
                "spot": 47,
                "neighborhood": 43,
                "years": 42,
                "street": 37,
                "residents": 37,
                "space": 31,
                "block": 31,
                "plan": 28,
                "rise": 28
            },
            "wordCountSummary": {
                "bar": 17,
                "spot": 10,
                "street": 10,
                "residents": 8,
                "rise": 8,
                "neighborhood": 8,
                "business": 7,
                "kitchen": 7,
                "years": 7,
                "block": 7
            },
            "fullTranscript": "So I'm on hi everyone, Rob Walker, here hi Rob, we got you. Thank you Jesse! Yes, do you still think I need to do that whole intro. I mean I know we had 255, but they're only 35 right now. Yes, okay, do we have a quorum yet 5:10 15 20:25 26,23? No, we do not. Can you hear me it's Gwen hi Gwen hi. For some reason, my picture did not come up so when I'm here and I'll have to try and get it so that it recognizes me 9:10 11, 12:13, 14, 15:16, 17, 18:19, 20 21:22. Almost there 1919 all right. I count a Quorum Jesse. You ready are we live. We are live and recording okay good evening. Everyone welcome to Manhattan community board for full board meeting for this summer. In the summer we combine our July and August meetings into one meeting because for the most part everyone takes August off. My name is Lowell Kern, I'm the chair of Manhattan Community board 4., as per governor's executive order. 202.1. This meeting is being run remotely. It is being recorded and transcribed. A recording of the meeting will be posted on the board's youtube page that satisfies the public, open meetings, law. Here's how tonight works, everyone stays muted, the entire time. We have two groups of people here we have panelists and we have attendees. The panelists are the board members. The attendees are members of the public. Members of the public will be recognized to speak during the public session by our first Vice Chair Jesse Le Francois, our District manager, Jesse Beaudine, will then promote you and you'll become a panelist for all of your two minutes. You get to say you're two minutes peace and then you go back to being an attendee the agenda. Tonight we have our public session, as I mentioned. Actually we have a public hearing first on a draft Eis statement on the new empire station, complex, which you'll hear more about shortly. We do our public session. We hear reports from our local electeds and the borough president, including our borough, president, a district manager report. You get my report and then we go into our business session and we discuss the letters that have been voted on by the committees. For this month, when Jeffrey starts the public session, we'll talk about speakers list. If you have not signed up in advance, you can raise your hand I'm using the blue button on your screen and or if you're on the phone. I think it's star, 9 and you'll be added to the end of the list for the public session any questions relating to software or processes. Only please use the chat function. Questions we are not monitoring the Q&A function. That would be only for presentation. So if you have problems, please use the chat function. I think that covers all of the ground rules. We will be bundling all of our items when we vote into a roll call vote, basically looking for everyone to signal which letters they agree with or disagree with, and that's our process, so we're going to start with a presentation, a public hearing. This is a scoping hearing on a draft environmental impact statement on empire the empire station complex. We had four, it was four or five jeffrey members of the board testify. Yesterday, five members of the board testify yesterday at a public hearing on this. Jeffrey is our first vice chair was there. We were also represented by the Chelsea land use committee, Paul, Devlin and Betty Mcintosh, and the transportation committee christine Bertay and Dale Corvino. I would like to let everyone know that I got some really nice emails from the chair of CB5 Vicki barbaro complimenting all of the CB4 speakers, but with that who am I giving this to Jeffrey? Are you taking this? No can I was taking it. Paul is taking it. I see him raising his aunt Paul. Would you please take over our public hearing now Paul? Can you give me one second for them? Thank you for board members. You need to make sure you rename yourself if it just says CB4 member, please scroll over your tile or your or your name under the participants and rename yourself with your full name. Thank you, yeah Dale, that's you there's a couple more yep. I see him. Thank you. Okay, we're ready all yours, Mr Devlin! Thank you. So, as Lol pointed out, the New York State, Urban Development corporation, also known as empire state development or esd, is proposing a transit oriented development surrounding Penn station through a general project plan or gpp which supersedes the city's euler and overwrites current zoning we're at the stage in the process where esd is determining the scope of study for the environmental impact, study or eis. Their draft scope was presented to us on July 1st and they are seeking input on what should be studied and then included in the Eis comments on that draft scope are due by August 20th. So this is our community board full hearing on this project and to repeat, as wolves already pointed out, the governor's executive order, we're holding this public hearing remotely and it's being recorded and transcribed. So if there's anyone who wishes to speak on the strat scope, please use the raise hand feature so that you can be called on. We have requested that people submit their names by noon today and we did not receive any requests to speak at tonight's hearing, so we will call on the public. Now I see that Assemblymember Godfrey's hand is raised. I do not know if he wishes to speak on this issue or his wishing to speak on something else, but Jesse. If we could pull in go ahead. Dick, I'm sorry! No. I had my hand raised to do an elected official comment whenever you're ready for that. We will get to you as soon as we get through this okay. I wanted to do this one first, because I did not know if that we'd see before CB5 members joining us who were interested in one item, but I will I do see you there Dick go ahead, Paul yeah, so I see no hands raised. This is an issue item 22 on the rest of the agenda for the letter that was compiled, and I will be moderating that discussion so not seeing any further requests for comment. I'm going to call this hearing to a close and do I need to make a motion to close the hearing. Nope. You just tell me you want to close it and we're closed. Thank you very much Paul. Thank you all very much all right we're going to go into our public session. Now, as we've been doing on these zoom meetings, we have typically allowed our elected officials to jump the line and speak ahead of the public, but I think it better policy to let the public speak and let the elected officials hear what they have to say. So, with your indulgence, Mr gottfried, I'm going to turn this over to Mr Lefrancois Jeffrey Public session. Please hi everybody! Thank you! Mr Chair, my name is Jeffree Lafrancois, I'm the first vice chair of Manhattan community board for this evening I'll be running our public session as we do each meeting those that have signed up in advance. I have your names, I'm going to call three folks at a time so that way, janine and Jesse can bring you over from the attendees section I'll have a timer going I'll. Give you a brief warning and then, when your two minutes is up we'll be transferring over the next speaker, so with that first Speaker, Jacob Morris, followed by Caitlyn Moody and then George Henderson Jacob, Morris Jeffrey. Would you please give our standard admonition about repeating what the person in front of you said? Thank you. Yes, I was going to call those names, so we could bring them over and then do two more points. We received an advance of this evening's meetings. A number of letters of opposition and support to a particular liquor license on the agenda of a place called the spot. That will be talked about in detail during the business section of the meeting by the co- chairs of the BLP committee, and we also see the number of we're letters around concerns about the homeless issues we're facing in largely in Hell's kitchen, but in the district as a whole, and one of the things to Lowell's point is if somebody says something before you your time at the microphone. We strongly encourage not repeating everything the person said before you, but just echoing their sentiments and giving back your time. So with that, I'm going to, let's see is our first speaker so far. They are not the first two speakers are not here. The first three speakers are not here. Unless they have signed in a different name, got it so with that we'll go call Amir, Cot cobbed, all right. We have a mirror from okay from the New York public library, I probably pronounce their name incorrectly after that is Donna, may Dipola and then Lisa, Wager Amir. You should be able to unmute yourself at this point. Okay, I'm unmuted go for it. You have two minutes. Okay, great! Thank you! So much everybody. My name is Amir Kot. I am a government and community affairs staff member, the New York public library. I want to check, in with you all, with some updates on some new things going on the library I'm going to get right to it, because I only have two minutes so the first one is that we have reopened as of Monday July 13th we've reopened at just eight branches, acrosss, our three boroughs of service and right now we're just doing grab and go services, which means you can either call and place a hold or do a hole through our online catalog. It's a very restricted space. We have specific protocols in place for quarantining items that are being returned and cleaning them and so on, and this is a very incremental process. Ultimately, we do want to reopen all of our branches and we will, but it's going to be one step at a time and reevaluating as we go. The second thing I want to talk about is summer reading. We are still doing summer. Reading this year we launched that on June 8th, it's primarily a virtual program. However, we know that not everybody has internet access, and so one thing that my team has been doing is distributing physical book kits to students in different parts of the city. And now, while my team has concluded these efforts, we worked with a lot of elected officials. To make this happen, the education team at Nypl is going to be picking it up with the department of education at DOE meal hubs. So we're going to be announcing that sometime this week and you'll see all the different places that these book kits are going to be handed out and I'll stop there and see. If anybody has any questions, thank you very much. We're glad to have you open and you're doing all that great work for kids. It's our pleasure yeah, please feel free to reach out to me. If you have any questions about anything else in the future, great thanks, homer sure Donna may Dipola did we find her jessie? No, she is not there yet Lisa Wagner is next. There we go. Lisa. Are you here, I'm here yep, I'm here, Lisa Wager, director of government community relations at the Fashion Institute of Technology SUNY on 27th street. I just wanted to check in and it's so nice to see you even if it's in little boxes, I have a pretty sunny apartment, but it I'm we're really sick of it here fit News. We will be having classes in for the fall semester. It's going to be a mix of in- person and remote learning. We have about 100 classes that are going to be in person. You know, half of our school is a maker college. People need to make things, and we have a lot of advanced technology that people do not have at home, so those classes will be in person in some form. It's not entirely worked out, possibly half the class for half the semester and the other half for the other semester. Our business and technology school is almost going to be entirely remote. We will have some people in limited capacities in the residence halls, we're all looking forward to getting back to doing the fabulous public education which leads to terrific creative employment. In New, York, City and throughout the world, and also the black students union about a month ago, put up a really powerful and beautiful and very cool mural that they chalked on the outside of the buildings that face seventh Avenue. It's called chalk that talk and it's about civil rights issues and police brutality and a very broad array of civil rights issues, and it's really impressive. So if you can bear to be out in this heat, please walk over, take a look and have a great rest of the summer. Thank you, lisa nice, to hear your voice next set of suite of speakers, Owen, Sweeney, Anita, Mcdonough and then Sally Davidson. So Owen is here. I believe when he's moving, my name is Owen sweeney and I live in New York. I've been living in New, York and City for about 15 years. In the last four years I've been living here in Hell's kitchen and last year, and I think this is relevant and worth noting I was the head of HR for breaking ground, which is the largest supportive housing network, probably not only in the city but in the United States. So I've seen up close how to manage housing for the homeless and it's a cause that I feel very passionate about and in all that being said, I've noticed that there are three homeless shelters that have popped up on 36 and 37 and in this particular case the management does not seem to have control over the issues or the tenants, and it appears that the decision might have been a quality of life and a public health decision for the tenants of these shelters and they would say, without regard to the quality of life. Sorry about that quality of life and public health of the residents and the business owners. These are poorly managed, pop- up facilities appear, the quality of life has decreased overall, and I might add that the tenants are smoking and drinking in large groups in front of the hotels without masks without social distancing, and it's something that the governor has shut bars and restaurants down all over the city to the exact same violations. Some of the residents have been harassed, spin on assaulted, robbed by the tenants. I've been personally asked to give money to a tenant milwaukee in the street when I refused, he threatened to spit on me, as the residents no longer feel safe or comfortable going out to eat or shop. This is this is causing. I think mental and financial harm to our neighborhood. These are poorly managed, have no choice facilities to shut them down. Thank you very much. Next speaker is an anita mcdonough, followed by Sally, Davidson and then Elizabeth Carfioli. Is here great? Yes, I'm here, can you hear me hi Anita? We can hear you go ahead. The second to last page of John Blair's antenna, radiuses application for Lansdowne road space mentions four previous license belonging to the applicants. Club Xl out hotel, bartini and ryze bar the first properties were shut down by the SLA and rise was closed. Two years ago, when the department of buildings issued a June 2018 summons for jamming 600 people in his space permitted for only 75.. These operators, who claim to be good citizens, have historically been two of the worst operators in Hell's kitchen's history. Yet they speak to you and tell you for the fifth time that they are reformed and you believe them John and Ted have always been the rules misinterpreted the rules broke the rules or ignored the rules, and the Community board has proof of everything that I just said. This tips mention that the applicant will take all reasonable steps to ensure no cueing or loitering of patrons on the sidewalk, with a crowd, the possible crowd in front of 599 10th avenue, half waiting to get in and the other half smoking. There will be a constant crowd, despite best efforts to impose reasonable steps to disperse. I want to remind the board that Detective Mike Dugan, head of community affairs at Midtown North, told me that in two that in 2020 rise bar six, three one violations all happened in the beginning of the year. The slowest time of the year. Can you just imagine, with a space twice the size, a crowd twice the size on the sidewalk, what the noise and is going to be like, and you need to do better with the steps in managing the crowd on the sidewalk. Thank you to consider the neighborhood. Thank you. Next speaker is Sally Davidson, followed by Elizabeth, Carfioli and Marie. Ms is Sally here Jesse. I do not believe Sally's here is Elizabeth. No, I believe Marie Ems is the next all right. Maureen. Are you there? Yes, I'm here. Can you hear me? Yes, go right ahead. Great! Thank you. My name is Marie. I've lived in the piano factory at 45th and 10th for the past eight years and within Hell's kitchen for nearly 15 years now, as a community, we had many issues with martini previously in the neighborhood which, in my opinion, operated very much in the style of the proposed spotlight in the spot club. Sorry, in their later years, from my experience within the immediate vicinity of the proposed bar, my neighbors will have issues with noise pollution coming from the spot bar itself, as we have found living in an older building coupled with the spot guests who will congregate, as the previous speaker said, outside the bar, it was the latter that proved to be the biggest issue for us living through the martini years. If people are dancing in a space where they have to shout to be heard when they actually leave that space, they continue to speak at that volume. 10Th avenue, unfortunately, can not be sound proof, while security guards will either move guests along. So it becomes another blocks issue, or they will actually, as we've seen tell our guests, that neighbours have complained so neighbors end up having to listen to crowds below being very intimidating and abusive, but hearing that they've actually been asked just to pipe down. I've actually got copies of correspondence for about the past five year or the last five years of martini experience from the piano factory really describing how awful it is to live within an ear shot of such a similar establishment. While I appreciate that Mr arenas can not can commit to being the best neighbor, he won't actually be dancing alone on a Friday night in that bar. If people are out clubbing drinking and having a good time, how can he ensure that all his guests are as equally as respectful during the late night and early morning hours as an example? Obviously, I remember one painful summer in 2014 of not being able to fall asleep until 4:30 after the last guest had gone and bartini had closed up 15 seconds an hour later. My alarm went off because it was the start of my day. That would be the reality. Unfortunately, if spot is given a license respective members of Community Board 4. Previously, I've spoken in support of folks such as Charlie Marshall during one of his license hearings and also for lapis. There are, I have to move on to the next Speaker Sorry Elizabeth Carfield is next to me. Okay, but is she speaking on the same item yeah? Is there new information to be shared before, besides what you spoke about I'd like just to add very quickly that I agree with everything that's been said previously. I think that while I would appreciate having a new bar in that space and someone taking over, I think that myself and all of the residents here at the piano factory would be adamantly against having the spot there. Thank you. Thank you very much and thank you for your brevity. Let's see Tracy Choi, followed by I'm guessing it's elita, lafarg and then adrian no last name Jesse is tracy there. We have it tracy you're there a lot of new hands up as attendees. Also I'm here. Can you hear me? It's tracy. We can't hear you okay good evening, everyone. My name is Tracy Choi and I'm a manager of rise bar for about a year and a half. I've ran nightclubs for many years and I want to make clear that ryze ball operates as a local bar and far from a nightclub which requires a completely different business model like much larger capacity. At least eight hundred to a thousand plus, you know promoters production staff. In some cases it requires police detail to go back to Anita's comments about being shut down about two years ago for overcrowding. I can't speak on that because that was two years ago, but I will bring up last world pride. We had a police detail called the entire week for world pride from the beginning. Until closing- and there were zero issues and that's the entire week of world pride rises, capacity is 125 and the spot is 143.. Most of our guests are from Hell's kitchen and we actually know many of them by name most consider rise as their local cheers, because we do provide a safe environment for our guests staff members and our surrounding neighbors. We are proactive on reducing noise from the street, whether it is from smokers. Pedestrians walking by to idling cars security staff is very vocal regarding keeping our sidewalk clear and reminding guests to respect our neighbors by keeping noise to a minimum and to exit in an orderly fashion. We also do step in for our local business neighbors and help de- escalate any issues they may have with the help of our security team. Additionally, we sweep up not only our storefronts but also our neighbor storefront at the end of each business day. That is the front of 15 seconds. Okay, we have no disorderly contact verbally or physically grand Larceny or any type of incidents that calls for police assistance. I hope the board will be in support of the spot and we will continue to operate in good faith and be a positive impact for the good of. Thank you tracy. Thank you. Let's see here next Speaker Elita lafarg. I do not believe Elita's here. I think Adrian is an excellent speaker. Great Adrian are you here? Yes, I'm here hi everyone. How are you great? You have two minutes. Please begin great. Thank you. I just wanted to speak out in opposition of the spot bar. I know that at the time that Lansdowne received their liquor license, I believe it was in 2004. There were not three sort of additional schools in the mix. Ps51 has more than doubled in size, beacon. High school is now sitting on the same square block where Lansdowne was there's, also a success, academy, a block and a half away, and I know because of the 200 foot rule, because these are just barely around the corner- that it does not really affect the acceptability of applying for the liquor license. But I think that it speaks to the way the landscape of our neighborhood has changed, especially in the past five years or so there's a lot more families, and I just think that- and I can speak as somebody whose apartment faces the north side of 43Rd, Street and 10Th avenue that I'm even kept up at night, sometimes with customers from Mr Biggs who are in the street. I do not want to lose any more sleep. I can't afford to it's just not acceptable for my children to have to either or anybody else who lives in Manhattan plaza or acrosss the street or in any of the neighboring buildings. It's just. We do not need. I feel very strongly that we do not need any more like club- ish, like bars, that are open until four A.M that encourage large crowds. It's just does not fit in with the landscape of the neighborhood any longer, and I think we need to be mindful of that, and just in all the children walking to school every morning, there's going to be tons of garbage. It's just not really acceptable and the and, as the vice president, I'm glad the tenants Association. I speak for a voice larger than just my own. We have other tenants who feel the same way and we've signed petitions. Thank you Adrian. Thank you. Next speaker is Charles Kange, followed by Brian Webber and Bruce Mccaffer. Okay, quickly, chad, there's Jeffrey, they say Aletta is here, but I do not see her. I do not. I do not see her either. I also want to emphasize to people that we've got 20 plus new hands going up, and so, if you're speaking on the spot, I'm going to be limiting those comments to one minute. Other topics will continue to be at two minutes, but anything on the spot. Going forward is going to be a one minute cap on that, so is Charles around Jesse yeah. I'm here, can you hear me hi, okay, great hi, welcome everybody nice to see you hope, you're staying safe during this difficult time. I'm here talking to you both as a resident of West, 49Th, Street and also a member of the Lgbt community. I'm coming to you with a concern. I have about an award that I recently received notice of from the federal government. It's a 500,000 repeat: 500,000 award to investigate the long- term impacts of bullying on gay and bisexual men, looking particularly at sexual and health, mental health outcomes like trauma which has not really been studied very well in the past. As you may know, bullying is not generally there's really no good programs on bowling in the city victims, let's say in general anyway, so it's really kind of an innovative program and it's important to get this type of funding from the Feds Lehman college, where I work has declined this award they're claiming because their public health program is shutting down in six months. They do not have the capacity to to host it. There are solutions to this, such as extending programs and working out alternative solutions, and so I do not think this is the best interest of the student staff faculty or the lgbt community, which is very heavily represented in our community board, and that's why I'm also bringing it to you I feel like this is not fair to us. So I would like someone to help I reached out to different elected officials, and I have not really got a satisfactory response. I feel like when people are shrugging their shoulders. I know we have a lot of distractions right now. I know it's a very difficult time, but I just feel like to kind of let this slide by a half million dollars during an economic crisis is really irresponsible. I do not think it's a good way to manage public funds, particularly given that Cuny's public and it's facing 150 million budget shortfall, so this money would mean a lot to a lot of different people in the community, and so I would really like someone to reach out and we could figure out a way to go forward with additional support. Thank you and thank you for all your work. Thank you Charleston. If you want to send a note to our board office, this sounds like something we might be able to look at in one of our committees that relates to this type of stuff. So thank you. Brian Weber, Bruce, Mccaffer and then Sean Riley, hi, all it's Brian weber, I'm a public member of CB4 land, Houston, Zoning Committee, and I'm also a resident of West 36Th Street between eighth and Ninth Avenue, and I'm calling with regards to the temporary homeless shelters that have moved into West, 36Th, Street and West 37Th street. I want to echo what Owen sweeney said at the top of the call, and I also want to add some additional contacts. The two hotels that have moved into West 36Th Street are single men's shelters with a combined population of 515 residents. The additional shelter on West 37Th Street is a women's shelter with approximately 300 residents, that is a total of 800 new temporary shelter residents within a one block radius, which is 40 percent of the shelter population. That's been relocated to Hell's kitchen. The density is far too great for this one block radius. It's had an immediate negative impact on the health and safety of our residents of the business owners and the commercial tenants on our street, and it's spread to 8th and 9th avenue. We've seen a precipitous increase in crime. All of the residents on our street have experienced harassment. There have been a few physical assaults against residents. I've spent the past several afternoons, walking the streets with Eric Bocher from Corey Johnson's office and members of DHS, the shelter providers, and what is evident is that we have too many residents too little space. Two little resources and separate providers, and all we will be provided with is additional phone numbers and there's no way out of this. Until we reduce the density of the shelter population, either removing two or more of the shelters from this immediate vicinity. Thank you. Thank you. Brian thank you bruce, followed by Sean Riley and then David Serrano hi, all I'm Bruce Mccaffrey former member of CB4, I'm here to speak on on behalf of rise. I've actually spoken on behalf of them before I enjoy rise, clean, adult oriented, gay bar. I think it's a rare form in this neighborhood I'd like to speak. Actually, I live on 43rd and 10th, so I'm really thrilled about this. Coming to our block. It's right next door, next block next door. I want to speak about Lansdowne Road and I heard a lot of comments. This is a change of operation so understand this is an existing 4 am Le, 4 am permit and we're and Ted's just looking to move into the same space same size, not increasing size, as as pointed out in the BLP lan, you know, Ted has Dj's Lansdowne Road had ddjs. You know there was a lot of complaints about drag. Queens drag Queens are basically just comedians in a wig. I'm not sure. Why drag Queens are going to cause more noise than football games as entertainment? You know, Landsat Road was often full at night. It operated the same capacity. I do not think there's going to be crowds outside waiting to get into to to the spot and again and I'm kind of concerned, with some of the complaints about. I'm not sure why a sports boy, the host loud games, is acceptable to gay bar. The host drag artist is not that has been they spot. His spot and lansdowne road both have very professional security, always kept. The smokers and groups outside small and under control really make a lot of noise yep thanks, appreciate it Sean Riley, David, Serrano and then Daniel Kelly Great. Can folks hear me. Okay, yes, Sean go ahead great, so hi, my name is Sean Riley, I'm a researcher for service employees, International Union, local 32 bj. We represent many service workers, including more than 3,300, who either live or work here in Community board 4. for the last year and a half we've supported chipotle workers in New, York, City, struggling to better their working conditions. Chipotle is currently seeking community approval for a liquor license at 885 10th ave in June. I testified before the BLP committee opposing this application and I just like to share a little bit of that testimony with the full board tonight. The fast food industry disproportionately serves and employs underage youth chipotle appears to match these trends. The company targets teenagers with their marketing and was recently found to be the third favorite restaurant brand amongst teenagers. Unlike the rest of the fast food industry, Chipotle sells beer and liquor in various forms, although they hold far more liquor licenses than any other fast food company in New, York City over 80 in total chipotle can operate perfectly fine without alcohol in New Jersey, for instance, all their stores are dry. It is illegal in New York for miners under 18 to serve or handle alcohol in January, based on information provided to us by 30 chipotle employees. 32Bj filed complaints with the state liquor Authority, alleging that managers at four different chipotle locations in Manhattan knowingly had minors as young as 16 mixing drinks and serving beer and liquor at their restaurants. This is not the only law workers say: Chipotle has broken workers acrosss. The city have reported violations of New York City's paid sick law and fair work week law claims, which the city has either settled with chipotle or is still investigating. Over the last year we brought these concerns to Brooklyn CB2, queen CB4 and Manhattan CB12. All of those boards recommended against new liquor licenses Chipotle requested in their districts. Teodora. A chipotle worker testified alongside me in June about her concerns that just second so I'll just skip ahead at the June BLP meeting, the committee voted to recommend against an SLA license for chipotle, which is resolution three tonight. The committee also made the decision to go one step further and draft a letter to chipotle CEO Brian Nichol, expressing the committee's intent to oppose any new applications in CBS. That's resolution two. I just want to thank the BLP committee for their decision and encourage the full board to vote with them on resolutions. Two and three thank you. Thank you. David Serrano Daniel Kelly Aviva Wheeler hi. Can you hear me? Yes, okay? This is David Serrano. I just I live on. 46Th and 10th- and I have lived here since 2010.- I am in favor of the spot opening up. I am a regular at rise bar and I love ryze bar. It's definitely a an older, more sophisticated crowd, it's not a rowdy bar and I'm pretty sure the spot's going to be very similar to that. I also think that in this time, right now, when we're dealing with so much blight, that's happening in the city, because people are literally leaving the city in droves right now that we need to be as friendly as possible to businesses, especially businesses that have proven like rise bar has that they can operate like responsibly. Also after last meeting when I was also here in support of the spot, my friend and I walked her home right past, where the spot is, and there was literally the only thing open right now is the bodega on one corner and Mimi on the other. Everything else is empty. There was a mattress right in front of where the spot is, and there were homeless people camping out right. There was a difference all around I'm. Definitely in favor. It can only get better than what it is now. Thank you very much. Next Speaker Daniel Kelly Aviva Wheeler, followed by Marisa Radanti yeah hi, I'm Daniel Kelly I live in Manhattan, plaza. I've lived in the 9Th Avenue building. I also have lived in the 10Th Avenue Building resident here for 14 years and in the neighborhood for 22 years. I want to reiterate what everyone's talking about safety. I think the underlying issue that we're missing is how much safer it is when a block is lit up, especially a bar when I walk home at night and bars are lit up or dormant or outside and, let's just be honest, the whole neighborhood is outside right now and it's going to continue to be outside for quite some time. As far as rowdy bars, I do not think of rise bars, a rowdy bar. I could tell you bars that I know are rowdy, but that is not one of them. I tend it to be a more fun low- key place, which is why I like to go there. I will tell you, as of this week, three bars three queer spaces are closing and announced in the neighborhood, and I'm really shocked that people do not want that block to be lit up. If anything, this will bring safety to the area get the homeless out, and I will tell you that I helped to get letters and many people that I got letters from have small little children who live in my building. So there are people, definitely in favor who live in Manhattan plaza and the Manhattan Plaza board. It's not a co- op board. It does not speak for everyone, and no one's ever asked me my opinion once on how I feel or ever given me a letter. Thank you Daniel. Thank you thanks next Speaker Viva Wheeler, followed by Marisa Riddante and then David Beatty hi, I'm Aviva Wheeler. I also spoke at the last meeting and I want to echo, I think, everybody sort of touched on the points that I wanted to make, but in particular the safety of the neighborhood. I live on 43rd street between 9th and 10th Avenue, as David mentioned. You know we walk the neighborhood frequently that block. I pass that spot daily during the day and in the evening there are people camped out over there along my entire street as well. I just moved here from Chelsea, which is a similar neighborhood in terms of residential and commercial and entertainment, and all of that you're safer on the street. When there's a place, that's open has security and there are people around. I would feel safer with. You know the Patron second restaurant than the people that are currently wandering around, so I'm in total favor of this place. Opening up. Thank you, aviva appreciate it. Marisa Riddante, followed by David Beatty and Latoya Leflore hi, I'm Marisa Ridanti, I'm the district leader, I'm also President emeritus, for the Manhattan Plaza tenants association, which by law is the duly constituted voice of the tenants. Now, I'm so sorry that the young gentleman did not go to a meeting to be heard on this very important issue, but the fact of the matter is over the years the this community board has taken the plus Attendant Association's word that they represent the tenants and they do by law. There are 800 apartments right near the spot bar. There is no evidence that the homeless problem is going to disappear because one bar opens up. If it even does in time, we have recently gotten beat cops on the streets through the efforts of the House Kitchen, Neighborhood, Action, Committee and spot bar. The owners have a very bad record. The and the people that are getting letters are not from Manhattan plaza or the neighborhood. They are an army that has been hired by the operators to try to beef up their case. We have a record of doing hundreds of letters on our own. If we wanted this bar, we would have done it. Thank you very much. David Beattie Latoya Lafleur Brett Rubin David. Are you with us how about Latoya? Yes, Latoya here, hi Latoya go ahead, hi! Thank you. So much I had an opportunity to speak at the last meeting and, as I said as I said, then I have a unique perspective with rise bars help I have raised over and my team has raised over 25 thousand dollars that has gone to non- profit, charities that help lgbtq homeless youth and our non- profit, gotham cheer, we're very lucky to have a partner in rise Ted and his team are extremely giving of their space their staff their time. So my perspective is more from a like a community perspective, a perspective of a business being like present in the community and really helping to raise awareness and funds. Thank you so much. Thank you, Latoya David, sorry about that you're up! I do not know what happened. Can you? Can you guys hear him? Can you hear me? Yes, go right ahead, yeah, I'm! I came here well, two things as far as the homeless goes and just want to make a quick note. Something happened today that really surprised me. I went to drain read between 43rd and 44th on 9Th Avenue, I witnessed a gentleman, a homeless general walking into the establishment. Filling up this paper bag with all kinds of food and walking out without paying for it and I go to the tenant. You know the lady at the front desk and said: why do not you do anything? He said we're not allowed to the cops, do not come anyhow and management told us not to do anything just let them take the food and leave and he'd actually fill up his shopping bag with food, and I confronted the guy at the front. I said: are you going to pay for this? He said no, he says the manager knows me. I come here every day, and this is a this is a homeless person which basically goes to drain. Read go to drain read, I was shocked and I said: why do not you call the police? They want to call the police anyhow, that's just something I wanted to talk about all these homeless shelters going up in the area, they're not managed somebody's doing something wrong and I do not know who it is, but it's really start to destroy the neighborhood I've been in for 30 years. The other thing I want to talk about is the new spot bar I'm totally in favor of the spot bar, I do not know, does Melissa, you know acrosss the street. You know in this Manhattan plaza. She said by law she's in charge of this in charge of that there's no laws. I do not know of any law in New York City. That gives her any right to talk for other residents in Hell's kitchen that building there's only one building with tenants. Most of the tenants are over 60:70 years old. They do not go out anyhow. So to get such a voting block, you know, and I do not know where the Florida boss is coming from, but they're not 16 seconds, I'm just in favor of the bar, because it's going to light up that block, I jumped there at rise, he's it's an lgbt, I'm totally in favor of a gay bar in the area and as far as thank you David. Thank you. Thank you. This is close. Thank you, David, and so thank you. Next Speaker is Brett Rubin, followed by Timothy Guest and David Stewart, okay, hi, I'm Brett. I live on 10th avenue near the spot bar I'm a frequent customer of rise bar and I can say, with full confidence that is easily the cleanest most well- run bar I've been to in NYC. It's a place that I take my parents. Additionally, there are a number of lgbt bars in Hell's kitchen that have had to close because of Covid-19 therapy. Vodka Soda Barrage, Ninth Avenue, have all announced they're closing for good, and there are rumors of at least three more. These are not just businesses or jobs for people in our communities and at the last full board meeting when they were trying to get the spot at the location next door. The board repeatedly said they were good operators, but they needed to find a location that was previously licensed. They took your words to heart and found the perfect location. Second, now is the time to approve the spot and help restore Hell's kitchen they'll, make the block safer and provide jobs to those in our community. Thank you. Thank you. Brad Timothy Guest, followed by David Stewart and then John Mandel Timothy. Are you with us? Yes, sorry, hello. My name's timothy, I live above rise on the I guess when facing the building on the left side above the bar area. I'm here to talk about the noise outside I'm in support of the spot bar they've had the outdoor seating this whole entire time. I have not. I have no complaints. I do not hear anything. Unfortunately, it's raining outside right now or I would bring you to my window to show you that there's no noise for you guys to hear personally yourself. I also want to talk quickly about the other bars in the area. They are busy attacked loud Noisy on the street. You've seen it on 51st street you've seen it all around there, and we there's nothing around here. So I'm just here to say that if you're worried about the noise they're going to take care of the noise, there won't be noise. I do not hear no seconds and yeah that's it. Thank you. Thank you. Ah, let's see next Speaker David Stewart. Sorry, I just lost my spot. David Stewart, followed by John Mandel and Christopher Victor, hey everybody hi. Thanks for giving me an opportunity to speak. I've been a resident of the neighborhood for about 25 years and a community leader for about a decade, and you know I really appreciate hearing all the perspectives, so I just wanted to give one of the perspective on the spot bar. So I think one of the concerns that I'm hearing from the community is that the spot bar will have an outside impact. Outsized impact on the landscape of the neighborhood. At the BLP meeting, the I believe the attorney for the Spa park submitted a petition that was signed by dozens, maybe hundreds of people who apparently not only lived outside of Hell's kitchens. Many apparently lived outside of Manhattan, so landstown road was a quiet, local pub that had an exemplary operational record 15 seconds and one of the clear things that a petition like this tells me is that even the owners understand that spot bar is going to have an outsize impact on the on the community. So I submitted a letter to the vlp. I hope you guys will read. It goes into a little more detail. Thank you. Thank you very much. Next Speaker John Mandel, followed by Christopher, Victor and Owen Sweeney John. Are you with us about Christopher yep? Yes, hi Chris Christopher go ahead, hi there. I'm also here to talk about the spot. I have a different kind of perspective, I'm fairly new to Hell's kitchen as well as New York altogether I came to New York as an aspiring dancer and, as many of you have come to New York, to find your dream career as well, and I just like to say the management. I've just been very thankful to work for Tracy, Teddy and John as being one of my first managers and for one of my first jobs to make money in New York City, so that I continue so they can continue to work and live here, they're, incredibly responsible and strict when need to be, and with my time at rise. So far, we've never really had to deal with any drama, and all this talk of drama years ago have no has never surfaced ever I'm not sure if you've seen the building of the previous bar lands down. But I went there. It's a single level building, so there'd be no upstairs neighbor in the building itself, so and they've also spent over fifteen hundred dollars on soundproofing rise bar to begin with, and the managers are always proactive with noise control, we've always had the speed of security Christopher yeah. So I'm in support of thank you next speaker is Owen sweeney, followed by Thomas, Lapree and so sorry, Christopher John Mendel was I just put John Mandel In and Owen Sweetie actually already spoke at the public at the public session. Thank you. Sorry. That hand has gone up multiple times, so I had added it thanks for clarifying Jesse John. Are you with us? Yes, I am thank. You go right ahead: hey John, Mandel, 400, block of West 51st street between 9th and 10th. I just wanted to say that the open restaurants plan has been overall promising for our street from having like a couple hundred people on our street to smaller problems. Smaller gatherings, I just want to note, there's been a related problem and we could really use the help of the Community Board and our local officials, to kind of you know, put a little pressure for law enforcement to come together and visit the block a little. More often, we've had gatherings just come to 51st street. I think because people are so used to it now being kind of the place to go as opposed to any of the parallel streets. So people have been bringing portable sound systems stereos and playing music on their car to like really late hours of the night and like I do not want to blame any specific restaurant or bar but contacting 301 and 911 has not helped, and I've spoken to a lot of neighbors about the same issue. I know Councilmember consanity's brought a lot of attention to the issue in Astoria and there was a lot of attention about how big those parties were going and it really helped bring the SLA over and a lot more law enforcement attention to that area. And so I know, Carl from the speaker's office is out of town, but I'd love to do something with the neighborhood, as well as the Community Board and the speaker's office to maybe do a walk through to see just kind of some of the related problems that are still sort of manifesting, because we could really use some help in that area. So, thank you so much. Thank you. John Next Speaker is Thomas Lapree and then Zabian, Ramirez and Darren Major is Thomas with us. Yeah he's coming on now. Okay, sorry, do you hear me here? Yes, go right ahead, all right, sorry for the delay, yeah, I'm a resident on 36th right next to 8Th Avenue. I just want to talk quickly about the shelters that on 36th and 37th and echo what Owen, Sweeney and Brian Weber said about this. Is you know it's a huge amount of people? It's had a dramatic immediate transformation on the neighborhood residents are afraid to leave their buildings. You know not only during the night time, but during the daytime and it's everything you can imagine the residents in my building, I'm at 241 West 36th. We've been physically threatened, I've had people in my building, be sexually assaulted, open drug dealing right out the front door open heroin use it's not an aberration. It's you know it's daily. It's daily, my daughter came home one night to find you know blood all over the sidewalk turns out. It was a slashing 15 seconds. People won't go to the restaurants on nine dad because they're afraid to go. These contracts need to be canceled. Now it's the neighborhood can't handle the influx and Jeffrey Le Francois you're running this neighbor. This meeting really well, I got ta say it's like an iron fist and it's progressing well. Thank you very much. I appreciate that and thank you for your comments this evening. Next speaker is Xavier Ramirez, followed by Darren, Major and Faye Argentine Xavien. Are you with us yep great go right ahead. Hi everyone has Hell's Kitchen resident here for about four years soon to be a resident of 54th and 10th speaking out in favor of the spot. I'd like to basically echo everyone's statement in favor of the management there at rise, and the only thing I will add. In addition to that is throughout this pandemic and quarantine and bars, opening and shutting down, I've been to as many of them as I can to support businesses in the area, and I will say something I noticed, and what I came here to take today to say is that rise has been the only one that I've noticed definitively has been following all of the rules and all of the rule changes that happen on a daily basis. So yeah, that's all. I really wanted to say thank you in support of the spot. Thank you. Xavier next Speaker is Darren Major, followed by Faye Argentine and theodore arenas, hello, y'. All our major gab Joyce look sermon is outreach director for the New York Gay, Football League and we've been in partnership with ryze since day one even beyond, and I have nothing but the strongest support for the decision open of this new spot. A lot of people are mentioning community and family. That's what rise does I think my coach, like my peer, said with Gotham cheer rises up this race over thirty five thousand dollars for homeless Lgbt, youth at the ally, New York court coat Drives and trinity place shelters, but the larger piece is a as a black gay man going into Hell's kitchen, it's great to go into a bar. Where you see diversity, you feel safe. You feel supported, and I realize that security does that not just for rise, but for anyone passing by if security sees someone team second in need of distress, they actively jump in and assist strongly encouraging our communities more than just stroller families. It also includes gay couples, as well as their children will be going into those wonderful schools you mentioned earlier. Thank you so much. Thank you darren just so you know folks, the last speaker that I'll be acknowledging this evening, because hands just keep going up repeatedly is artists Cacklin. After that, I will not be getting any more names to the list for public speakers. Our next speaker is going to be faye argentine, followed by theodore arenas and then Alan Azarkin Faye. Are you with us how about theodore arenas? Hello? Can you hear me we can hear you go right ahead. I think everything cut out. I'm the applicant. I was wondering if I could get two minutes to speak. It's on a topic. I've committed one minute to right now, so if it's on the spot, that's what we're doing for everybody. Okay, I just want to make a point that I want to first think that the Lp committee and the hundreds of health pitching that has supported us. We had 140 residents from Manhattan Plaza who supported us as well. I wanted to take the two minutes to address some of the issues that were raised by the residents. First, my past involvement with bartini over the last 11 years. I want to let the people know that I was the reason why I closed and I was reported the business of the SLA and got the license cancelled. In short, I was one third owner that was pushed out of the business. I was in a litigation with my partners that prevented me from managing the business, so they had someone running it with no experience manage the venue with no respect to the community concerned about liability and having my names stuck on the license. I reported what was going on to the SLA and had it canceled. So some of these issues that people are talking about that happened in 2014 and 13.. I was not even there. I left in 2011., some of the other premium seconds that people were worried about is the sound outside first off, I'd like to say, ryzebar has only had five noise complaints in three and a half years, 33 out of 40 tenants that live above rise of our support, the rights application and due to living directly above in terms of noise, we are having the appropriately security guards bartenders certified to make sure that they are over seeing people are not drunk and I'm giving my daughter we're going to move on to the next speaker. Thank you, Alan Azarkin, yes hi. How are you Justin, Kell hi Alan go ahead hi. This is Alan Azarki and I I'm an architect at building violation services, and I truly want to put my support behind theodore he's been he's been a pleasure to work with, in the last couple of years, trying to make everything legal and the most safest for the health, safety and welfare of the public at rise bar, and I look forward to working with him on the spot. I mean a lot of our discussions is about going up and beyond, even just the minimum code requirements of making sure. Not only is it quiet and peaceful and the public is protected, but making sure everyone is safe and with the limited issues with the neighborhood and the community, I think he's one of the most upstanding individuals. I've worked with in the hospitality industry, so I do want to put our entire office's support behind him and his venture he's been a pleasure to work with him yes and he's an utmost standing citizen that would do right by the community in that area, beyond just keeping it safe and protected for the community. Thank you. Alan next Speaker is Justin Keller, followed by Kathleen, Treat and guy Crowl Justin. Are you with us Kathleen? Are you I see Kathleen, you need to turn off Martin's, either Martin's volume or yours just because you're going to get feedback. If you're, I do not know how to do that. All right. I think you've done good. Now, you're, good, okay Jesse. Can you mute everyone and then just unmute that one speaker would that work. Give me this. Give me one second see: should we try for guy yeah? Let me move on to guy and we'll get back to Kathleen. Okay, also, folks, just to just to clarify continue seeing new hands going up is guy with us nice to be with you. Can you hear me? Okay, yes, go right ahead! Oh hello, my name is Guy Crawl, my wife and I live in Manhattan plaza. I just want to say that I spoke at the last last meeting. Recently it was a Monday somebody in the building had asked us to sign some kind of a petition had nothing to do with the spot bar. It was about some past issue at bartini or something and the owners. I asked the person if they had ever been to bartini and they did not even know where it was. I asked them if they knew where rise bar was no idea where it was. I asked them if they knew who ted Arenas was. They said. No, they never met him. They were just told to get signatures by a group of people that are just anti- gay bar in the neighborhood. I've been to the rise bar with my wife. I was there for two fundraisers. I just can't tell you it's nicer than it was in it's going to be a much better place than lance down road which we already went to before it closed down, but we have thank you. Sir appreciate your comments. Next up is Xavier, do not have a last name there, but Xavier followed by Michael Guardino and Alita Lafarg Elita. We found you xavier. Are you with us? He was how about Michael is this? We could call this zoom roulette, I guess and then we'll go to elita all right. I'm moving over later. Now. Great hi, we hear you go ahead great, I'm the president of the Manhattan Plaza, tenants association, that's over 3,500 residents, so you know, 800 units in our building are acrosss the street from the proposed location of the spot. Keeping that in mind, our residents have directed me to speak for them against the proposal. The owners have shown an inability to control their patrons as they wait to enter or when they come out to smoke at the previous establishments and have demonstrated that they have no plan to control their crowd at this one, either they've sent people from outside our neighborhood to gather petitions from our tenants describing their program as including poetry, readings which is misleading at best, no matter what the description of the operators. If it looks like a nightclub, it's a nightclub. We do not wish to begin installing nightclubs on 10th avenue in seconds here. The reputation of the operators, as evidenced by their track record. We are not confident that we would be able to maintain the tone of our block if they are given this space. We would hope that the concerns of the residents most immediately affected would take priorities. Next, speaker is Amy. Fuselman apologies for my butchering this evening, Ann Miller and Ellen Pearlstein Amy. Are you with us yeah they're, coming over now great hi. Can you hear me go ahead? Amy hi! I'm just want to take a second to speak in support of the other people. Who've commented on the situation on 36th street, where I've been a resident since 2000, I'm raising three kids on that block and I can't really overemphasize the difference in the quality of life. Since the situation has come with the influx, the of of people to the neighborhood, it's really in sup. It can't be supportive with the with the resources that we have now I mean our sort of default. Setting now is that we do not take a left out our door and I it's painful to just normalize that behavior for my kids and we just write rather than left. I hope that we can find a way out of out of that situation. Thank you. Thank you. Amy Anne, Miller hi everybody. Thank you for the opportunity. I did write an extensive letter and hopefully you were able to read it, I'm echoing Owen, Brian, Thomas and Amy. I lived on 36th street, I've managed buildings on 36Th Street and I'm very upset about what's happening and the fact that the police and 9- 1- 1 are not dealing with the open drug use. Despite the phone calls because I manage buildings in the neighborhood, I get flooded with emails of what's happening: sexual assault, threatening of life. Some are doctors, they're moving out of the neighborhood. We work really hard. I've lived here since 2002 to clean up the neighborhood and to have doctors who dealt with cobin on the front lines leaving our neighborhood because they feel threatened walking. Their dog is crazy to me 15 seconds. We need to do something. We need to do something now if we need to get the police to actually take the open drug use and get it out of the neighborhood, we need someone to actually patrol the neighborhood and get the homeless, the ones that are not doing well there out of the out of the neighborhood. Thank you. Anne Ellen Perlstein, followed by Rashawn James and will Schwartz ellen. Are you with us here? I am hi. This is ellen pearlstein, I'm here with my father, phillip pearlstein. We live in the building with Ann. Excuse me with Amy and 36Th Street has become a terrible place. I think that moving eight over 800 people homeless people into two blocks overnight was an ill- conceived plan from the start, with no plan for security. I just need to say just from the bottom of my heart: it has become horrible here it is dangerous, it is horrible. I would like to remind everybody most. The majority of homeless people have mental illness and they are potentially unstable at any moment. I am afraid to go outside, I'm afraid to walk my dog, I'm afraid to let my teenage son walk the dog, I'm afraid to let my 96 year old father leave the building at all and I'm afraid my husband is going to get into a fight with somebody. This was an ill- conceived notion from the start. We need security. We need the contracts cancelled immediately. It is unsafe and untenable to live like this. Thank you, Alex. Just so folks know we are taking these this map. We have a letter on this topic this evening during the business session of the meeting. So people know that as well, rashaan James, followed by Will, Schwartz and Donald Bernstein Rashan. Are you with us? Can you hear me? Yes, can you hear me hey so I'm sitting in favor of the spot? I am a resident of Manhattan Plaza and I was also a very hardcore patron of Lansdowne Road and I would be very excited to have a gay bar in that space after Lansdowne has left us, but I also wanted to speak about being a Manhattan, plaza, resident and debunk the idea that the board speaks for all members who live here in all tenants who live here. That may have been true 10 years ago, maybe 15 years ago, but we have a new crop of people who live here who are not inundated with the things that people who are older than us? You believe that anyone who has said I speak for all tenants at Manhattan plaza is a person who has a voice. For me, a person does not speak for me and will never speak for me and unless you hear my voice, which you are hearing right now, I do not believe that. Thank you. Thank you. Jeffrey, I'm going to jump in here, I'm not going. I do not know who has me on I'm going to jump in for one second here. The Manhattan plaza has a tenants association that is elected by the residents of the building. It follows the laws that they are required to follow because of the subsidies and the housing laws that they're under there is a dually constituted. Tenants Association, they are authorized to speak, for the tenants can disagree with the tenants Association, but the tenants Association does speak officially on behalf of the building. Sorry about that Jeffrey! That's! Okay! Thank you for the clarification. Will schwarz followed by Donald Bernstein hi. Can you hear me? Yes, you're ready, I'm here hi. I just wanted to thanks for giving me some time. I just wanted to reiterate the state of crisis that exists on 36th street. Just a couple personal anecdotes, I've taken to carry around a maglite with me, mind you. I live right next door to a police station. The police have thrown their hands up and said: there's nothing we can do our neighborhood has been given over to addicts and vagrants. I could follow to the store. Every time I go to shop, our community, the people who moved here did not move here thinking they were moving to Greenwich Connecticut. This is not a situation where we can't handle the realities of living in New York. Honestly, I've lived here. My whole life and I've never seen a neighborhood destroyed overnight. The way that my block has been destroyed. It is unsafe, and I say that as a I say that as a fairly large man- and I can't imagine what it's like for the people in my building, how unsafe they may feel. If I feel unsafe, please do something. Please thank you, will Donald Bernstein and then a couple of folks who we called but were not present. Somehow back then, during this virtual meeting, I'm going to go back to Faye and Michael Donald. Are you with us? He is here. Yes, can you hear me? Yes, go right ahead. Thank you. Everyone, Donald Bernstein, I'm the attorney for the spot. I want to first thank the BLP committee for recommending approval of this application. They propose stipulations restrictions. We agree to all of them. I do want to speak on the petition because some comments were made about where they were from. We submitted a total of 759 signatures. These are local people. 420 of those are south of 48th street in Hell's, kitchen 329 are above 49th street 137 petition signatures are from Manhattan plaza in addition to that, we've obtained eight letters independently from residents of Manhattan Plaza 33 of the 40 residential tenants that live in the rise of our building are in support of this, including the two residents who live on the second floor above rise bar. That's extraordinary testament to the fact that they operate well. We originally applied for a building at 601 10th. The BLP committee was not very excited about that. They asked us to come back and find space that had a license or was licensed. We took their advice. We thank you for coming back to lansdowne space, that's been licensed for 15 years and we look forward to your support. Thank you very much. Michael Giordino Faye argentine and our last speaker will be Artisaum Cochlin, whose last name I just butchered. So I apologize for that Michael. Are you here they're all coming over now, Jeffrey? Okay, I saw them disappearing, so I wondered if they wanted to see their time Michael you're up no very distant. We can barely hear you so if you can fix your mic in the next two seconds or so otherwise, you can put your comments in the chat. Can we bring faye over Bay should be over faye? Are you with us? I do not know she got bounced back for some reason all done. Okay, I am not hearing from anybody else. All hands are down, and so with that I'm going to give Kathleen one more try if we do not get too big of an echo hello, I'm so sorry, something with the connection. I want to say hello. Can you hear me? Yes, thank you very much for your time. My name is, and I'm a resident of health kitchen I'd like to speak in favor of ride bar and televisions. I was passing by another long time ago by this place and it's actually a really nice and quiet spot today. I want to tell you that also add value to our community by hiring people that live in the neighborhood. I talked to Ted arenas yesterday and he told me that they got the homophobic people living in the Manhattan plaza and they do not want gay bar in our neighbors and they got 140 people from the Manhattan plaza who support gay bar and the neighbors, and I think it's really good for our community. I'd like to join with to everything what was said before about this about the rice bar and all the bars was operated by generally 15 seconds. I think it's going to be a really good opportunity for our neighbors, and I want to tell that television has created a really nice bar it's not loud and it's they do everything to keep everyone quiet and make do the streets safer. Thank you very much, our last and final speaker. If we can get her without an echo, is going to be Kathleen treat he's right about that. I do not like it that he's right, but he is. Can you hear me Jeffrey? I can without an echo marvelous? How are you good go right ahead? Spot is not rise. This is a bridge and tunnel crowd. If you knew that a consortium of reactionary homophobes wanted to open a club near you, would you try to stop them? Of course you would that's just what so many hell's kitchen residents are trying to do with spot, which again is not rise. There is ample evidence on public record of these gentlemen's blatant scofflaw attitude. They will not abide by stipulations repeat. They will not abide by steps and in any case who will enforce those steps. Why would you permit that there are decent law- abiding operators to compete for that space? Our neighborhood deserves that consideration 15 seconds our community board. Thank you thank you, Kathleen, and with that Mr Chair, I declare our public session closed. Thank you very much, Mr first Vice chair, I am going to now turn to. We have two elected officials with us and I'm going to give them the floor next in the order they showed up, which means Assembly, member Richard, Godfrey you're up first but you're on mute, sir okay, no, more! Okay! Thank you. First of all, yesterday we submitted testimony on the empire station issue and I just want to thank Board four and Board 5 for helping us frame those issues and I think we're all in agreement on what needs to be happening with the scoping, I'm a homeless in the hotels situation. We've been hearing a lot about it. It's a seems to be a very bad situation. We hear that there are 2,000 hotel residents that have been moved into the district, and I do not. I do not think it can sustain that and we look forward to working with board for with our fellow elected officials with the city to try to clear up this situation. Something's really got to be done. You know a related point. Is that part of the reason we have so much so much trouble in this city with housing and behavior that that stems from people with mental problems that are not getting assistance and a whole list of other things is that for a couple of decades, New York has been operating on an austerity budget, and we've got to break that and I'm not suggesting that people who live in this community, the vast majority, I'm not suggesting our taxes are too low, they're too high. But there are a lot of new yorkers with really huge gargantuan wealth who are under taxed and because of that, our city suffers as a result, whether you're talking Healthcare, Education, housing, transportation, we've got to remedy that, and I've been part of a large group of legislators. Who've been fighting to get taxes on ultra high wealth in New York increased last thing I want to say the Assembly Health committee, which I chair is going to be having public hearings in August on on the Covid-19 epidemic and its effect on nursing homes and adult homes and home care, and on our hospitals. If you're, if you are interested in getting details about the hearing or in testifying contact my office thanks, thank you so much Dick. We appreciate your brevity. I want to make a comment before I give the floor to Gail, I'm going to say right now that there are comments in the chat that are starting to border on inappropriate and if it continues we're going to shut down the chat function. Now the floor belongs to our beloved Manhattan borough. President Gail Brewer. Thank you very much. Mr Chair and I want to follow up 51st street to talk to John Mandel. I have been there once and I'll be glad to go back with the Community Board and other electives. I was there when it was a problem and I'm glad to work with you, and I think John has a positive attitude about it and we'll work on it number two regarding the Penn station and what we call the gpp, which is the way in which the governor does the eulip and we do not. It's not a eulop. It's a state mandated task force and we will be making our comments before August 20th. I want to say thank you to board 4 and Board 5, because you had wonderful hearings on this topic is really important because it's like the center of our city in many ways. So I look forward to working with that. I want the people on 36 and 37 this week. We agree. I know your chair has been bringing this up constantly, obviously we're trying to get rid of the kiosks in the area, but that's only a small part of this issue. You should know that other parts of Manhattan are having the same darn problem, because these, in my opinion, these non- profits are not doing their job, not to mention too many people. So we are going to be listing for department of homeless services, a whole bunch of situations and Owen sweeney I'd be glad to meet with you, but I am very aware of this situation, the small business. I thought it was great that you had such a good discussion today and we will be listening further about the specifics. I think. Generally. I know we've been up and down on 9Th avenue. I've been to many avenues, looking at the outdoor cafes and when these restaurants, I have to say many of them- are doing the right thing in terms of outdoor. So we look forward to continuing to work on this. I know you are sick of census, but August 11 people are going to knock on doors in terms of census, people who are hired to get you to fill it out, and I hope you do it before. Then we are really not doing well. I got to be honest with you. 420,000 new yorkers have left so those are hard to chase and for those of us who are here, we need to fill out the census, I'm not going to say more, except if you want us to come with an ipad and you have a group of people. You want to work with to fill out the census on your block. We're glad to do that because that's the level in which we're operating we just did one in Harlem we're doing one in Soho and we'd be glad to work with you, because people got ta fill it up garbage it's terrible, no Sunday pickup for litter, baskets, as you know, and there's a 63 cut in week, day service and there's no more organic. So this is not a problem we want. I know that the city council would have loved to keep sanitation. I can tell you on the organics, because we had it composting. Now it's gone in terms of pickup with an Nyu group and others there's a whole year- long study on organics, and hopefully you can bring it back so community board members or the public is interested in working with us. Please let us know, because I think we have to study how we can bring it back effectively: affordable housing. We know that there's been cuts in the budget. You know the issues as well as I do so. We are actually going to put together a task force. We've been talking to everybody who builds to banks and so on. Even though this discussion is an endless one, board, 4 has an amazing history of understanding, affordable, housing, perhaps more than any other board, and so we're going to try one more time to list, at least for the bar of Manhattan. What an affordable housing program should look like. I want to just say in terms of black lives matter, there's lots of discuss, but we did do a mural that I was part of on Foley, Square, Center Street, between Reed and and if you have a chance to see it, it's really gorgeous department of Cultural Affairs worked with us. We hired three young awesome, african- american artists, and we worked with a group out of the south Bronx and East Harlem all paid to put together something that is for the history books in terms of the quality. So if you have a chance to go see it, it's pretty extraordinary and black lives matter, greater New York also worked with us. I am concerned about the schools. I know that's not directly your issue, but I do not like this on off day care, not clear virtual. I have been talking to a lot of I'm not actually trying to call every school in the borough of man. I spent quite a bit of time with some high schools today, who are figuring out. They basically said we're going to be flexible. These are schools that are more less traditional and they said you know if a child has not learned in the past, and temporary housing is overcrowded and wants to come in five days a week. We're going to work that out now. Some parents do not want to go in at all, that's fine, but we have to be flexible. These kids are not learning. In my opinion, 36 of the kids of the 178,000 going to summer school have not opened their device, so I know it's not the number one issue, but if we can figure out open space for these schools, you have a lot in district. Four anything is needed. Our newsletter is fabulous. I think everybody gets it, but if there are people who are listening, who do not just know, it's really a fabulous newsletter. It's weekly used to be daily, but it's still fabulous and thank you very much. I know that you have a lot. If you know the ulip timetable is now going to be opening up again with the City Planning Commission and again we'll be working together on all those many issues. Thank you. Thank you. Madam Borough President. I'm going to stay with the elected officials reps now just to keep this moving neck. First up, you're going to be eric, bocher, the chief of staff for Council, Speaker, Corey, Johnson hi. Everyone hope all is well during this very tough time. It's a very tough time for the city and for the community I'll start with a couple pieces of good news. Therefore, the budget was really tough, but cory was able to allocate five million dollars in capital funding for NYCHA, elliot Chelsea and fulton houses. So I think that was a really great thing. We were able to allocate 450 thousand dollars to renovate Hell's Kitchen park, which was great and then also 150,000 for Ps11 to repair new closets and shelving in the classroom there and a few other things. So, although it was a very difficult budget, we were able to do some really important stuff, so I'm very happy about that. Our efforts to help mitigate the food insecurity that the community is going through are continuing. We've been working with many of you on this call. I want to give a shout out to elena lafarge the Manhattan plaza tenant, Association president and Guy crowl and others, because Manhattan plaza has really been helping us with our food bags and then to Community Board. Four Lowell Kern helped get a sizable contribution from the Hudson Yards House Kitchen Bid and we've been purchasing food from Trader Joe's and distributing at it at public housing and others. So I want to thank you all for that by far the most difficult issue that we've been working on and the most difficult issue that I've had to work on in my five years with the speaker has been the issue of homelessness, and this epidemic has just really laid bare. So many of the issues with homelessness with mental health there's in our community we've got the issue with the hotels that I'll talk about in a minute, but there's the closure of the subways and the libraries and other places that street homeless people spend their time. That's really forced them out into the community for us to see. There's the population of Rikers, which you know Rikers for many years, has been serving as de facto housing for people with mental illness. So we're really being forced to see in right in front of our eyes a lot of problems that were there for a long time and we've always struggled with these issues during the summer. But now it's just more acute than ever, and then you have the fact that many parts of town where people would panhandle for a living are no longer populated with people all the tourists that are gone. So we have people coming to neighborhoods where there's people, so we've had a lot of issue with panhandling, and particularly at the restaurants where people are sitting outside, which is an amazing thing. Restaurant row is an amazing thing that we pushed for very early on to make it to make it one of the first and so we've been doing walkthroughs to all the site visits all the businesses with breaking ground and homeless outreach providers. We had a call yesterday with a lot of non- profits in the neighborhood to really challenge all of us to how we can come together and help with this issue and the hotel program. We all recognize that where people were staying in congregate sites where people are sleeping in big rooms together and bunk beds and cots, and so on, that that's no longer safe for people to sleep in and that we have hundreds of thousands of empty hotel rooms, and it makes sense to use those to safely house people during this time, but it has to be done competently and they have to be cited appropriately, and many of these are neither- and we've been working very closely with many of you on here and DHS and others to try to get a handle on some of these operators that are not doing a good job. We have some that are doing a good job like on 57th and 9th. It's not perfect, but bvsj at that site at the Walton. We have not gotten complaints about that in weeks and we recognize that 95 of the folks in these hotels are just trying to survive, but you do have a percentage of people who are inappropriately housed and really are not up for this hotel living. So we have to work on getting these providers in line and then de- densifying these neighborhoods, where there's too many on one block, we had a meeting today on 36 with Brian Weber who lives on the block and christine bertay who lives a couple blocks away and the owners of Tovola and all the operators of these hotels, and it was very clear to us who was doing a good job and who was not so this is going to be that's a really big challenge. We've got to get it right and we're working very hard on that. It's been occupying the majority of our time, and I want to thank everyone on here. Who's been working with us on that and to all the residents on 36th street, who reached out we'd love to be in touch with each of you to work through this, because it's going to be a very difficult time. We know that will come out of this crisis as a city, but in the meantime we can't let things slide here locally. We have to do everything we can to get a handle on this, so I really want to thank everyone for their partnership in this. Thank you, Eric appreciate it. Next up from Congressman Jerry Nadler's office, Haley Burson hi everyone I'm going to keep it quick tonight. I just wanted to go over some of the things that the congressman has been working on today. Congressman adler spoke on the House floor in support of the no ban act. This act hr2214 seeks to undo some of the harmful implications of the Trump Administration's Muslim ban. One of the major issues with this ban was that it was depriving refugees and lawful permanent residents from the right council upon being detained in american airports, and I know that Jerry actually went to Jfk to see the chaos Firsthand and to understand really what it looked like. So this act is trying to protect these people's rights to so that they can have attorneys with them and be able to contact their family members during these inspections. Another thing worth noting that the congressman has successfully done is the George Floyd Policing act, which Jerry helped lead. The George, Floyd, Justice and policing act is one of the most sweeping pieces of police, policing, reform legislation to ever be enacted into law. The act effectively bans violent policing practices and institutes, systems of accountability such as banning chokeholds and no knock warrants reforming qualified immunity and ensuring that violent police officers can't simply move to another jurisdiction after being fired for bad behavior. The congressman is really open and would love to hear your guys insight. So please call our office whenever at 212- 367- 7350. If anyone has any questions or just wants to vent about, what's going on in the neighborhood, we are always available to listen and I'll. Put my information in the chat have a good night. Everyone. Thank you. Haley Lukewall from Controller Scott Stringer's office, hi, Everybody, Luke Wolf from the comptroller's office. I'm going to start by mentioning an upcoming event, we're having we're hosting a town hall on Monday, the 27th at 6 P.M with state Senator, Brad, Hoyleman, Assembly, member Linda Rosenthal, as well as Councilwoman Carleen Rivera. I just dropped the link in the chat you do need to register to rcp, and then you will receive a zoom link. Translation will be available in spanish Chinese as well as american Sign language. So I hope to see you all there. It's a chance to speak to your elected officials and ask them questions and kind of hear some of the stuff that they're working on two other quick things. I want to mention some of the work our office is doing. The first is on the economic side. We did an analysis of the payroll protection program and how that was rolled out in the city, and what we found was that, if New York City was a state we'd be 49th out of 50th in terms of the amount of businesses that were able to access and receive funds from the program in Manhattan in particular. Only two excuse me: 52 percent of employer- based businesses received it and those numbers are lower for our mwbes acrosss, the city and in Manhattan. So we need to make sure that we continue to get federal support and make sure that our businesses can access it so that some of the businesses that have already are struggling right now are able to stay afloat and regain their footing going forward. The second thing is on opening schools going into the fall, which I think some of the work we're doing dovetails well with the letter the committee for tonight. So we sent a letter to the mayor about his plan on school reopening and we have a number of concerns. The four specific concerns we raised were one on expanding child care, access for families. We know something that's necessary to make this plan work, number two, making sure there's clear expectations and communication around standards for remote learning, with the focus on having live synchronous instruction number three: what's the plan to increase staffing to make sure this plan is actually possible and four clear guidance about health care and really access to nurses for schools and the school community? So we'll, let you all know as soon as we hear more about the mayor's plan, I would appreciate any feedback you all have about how that's going to get rolled out over the next coming weeks and months. Thank you so much Luke. We appreciate it. We as frequent attendees of this meeting, know we rotate the elected officials again letting them speak on alternate months, but I do want to recognize that Maya Burlo from Senator Brad Hoyleman's office is here eric Overton from Assembly member Linda Rosenthal's office is here Philip Ellison from Public Advocate, Jumani, Williams Office is also with us, and if I missed the reps of any elected officials, I apologize all right now. We need to adopt the agenda which I've totally blown already do. I have a motion to well before I even ask for a motion. I've got an amendment to the agenda, letters, nine and what's the other number hang on, I have to find the agenda again. Letter number nine from the Clinton health kitchen, land, Use, Committee and number 23 from the housing, health and Human Services committee, which both address the temporary hotel shelters in our district will be combined into one letter by the two committed by the three committee chairs. So, with that amendment to the agenda, do I have a motion to adopt the agenda and I heard a second as well all those in favor say aye. Anyone opposed anyone opposed all right. The agenda's adopted last month's minutes. Does anyone have any comments on the minutes? Not hearing anything I'll address I'll, accept a motion to adopt the minutes. Second, all those in favor say aye. Anyone opposed the minutes are adopted. I'm now going to hand the floor to our district manager, Jesse Beaudeen good evening. Everybody I'll try to be as quick as possible. So some of the highlights and events that the district manager and staff attended or on behalf of the border involve themselves are the following. So we reconvene the Hudson yards construction task force with the support of the mayor's Community Affairs unit and Speaker Johnson's office, and we had got DOB and DEP to agree on a set of construction hours, acrosss for all the major developers in all Hudson yards, including Manhattan West, and those from my understanding. Those developers are agreeing to those hours and abiding which are in congruence with the West 34Th Street and Block Association there. As already mentioned previously, the district office has been responding to a very high number of complaints related to the increase in the temporary hotel, hotel, homeless, shelters and continues to advocate, with for the department of Homeless services, to lead a monthly service meeting with all providers and community stakeholders until the temporary health shelters are closed. The district office is also receiving a high number of complaints about homeless encampments and is working with department of homeless services and other stakeholders, such as the port authority, to hope to resolve some of these encampments, and I just want to highlight this is this- is something that I find particularly concerning, which is the result of the NYPD no longer involving themselves in homeless issues. And it's you know. The thing that really concerns me is that the encampment cleanup is a multi- agency effort, and so what the police were there to do are to support their sister agencies and they're not doing it, and I find that to be extremely concerning and that's down to the precinct level. That's not something coming from just simply one pp. What else? Sorry so, regarding the our office, space, we'll be happy to know, we are, was we're all still working remotely, but our office equipment and files have been moved to our new district office. We are still working out the finer details for the licensing agreement with the with the landlord, but we are going to be at 424,434 west 33rd street at some point and then I had the. Finally, on a light lighter note, I had the pleasure of being a guest presenter for a remote for two remote learning classes at Avenue School, and that was that was fun regarding August committees. So the only committee that to date we'll be meeting is the business license and permit committee and I'll be meeting on August on Tuesday August 11th at 6 30., and that is my report. Thank you, Jesse and thank you to Jessie and nelly and janine for keeping everything running. Could not do it without them. That's for damn sure chairs report all right. I've got a lot tonight, but I'm going to start, as many of you know. After all, the new appointees were appointed and Gavchenko resigned and became just a public member of the business licensing and permits committee. Thanks to Gail's office, we have her replacement. Kerry Kanan has joined us as the newest member of Community Board four and I'm going to let Kerry say hello to all of you and please give her a warm welcome. Carrie thank you. Hi, I'm Kerry, I'm 25 years in Chelsea on the 200 block of 21St street mom of two amazing public school daughters, ppas and 75 morton and super happy to be a part of this. Thank you. Thank you. Carrie we're happy to have you get. Kerry is going to be on BLP and Chelsea land use. It looks like the chairs have already been so advised all right. Cb4, executive committee members have attended and continue to attend multiple meetings with our elected reps and the department of Homeless services regarding all of the temporary hotel shelters in our district, including those on West 36Th, West, 37Th, West, 42Nd, West, 51St, West 57Th and the Aladdin hotel on West 45th. That work is ongoing. As I mentioned, we've got a letter coming out of two committees on that and you've all heard firsthand. What's going on those blocks, the NYPD on the spur of the moment basically announced that they were going to be holding meetings with the community following the protests that followed the death of George Floyd, I want to single out christine bertay, dolores Ruben, Katie, stokes and vieren brahma, who attended the four precinct meetings for the precincts that represent the cover community district for the 10th, the 13th Midtown north and Midtown South. So thank you to the four of you for doing that on very short notice. As we announced back at the June meeting, we formed a social justice working group that group met every Tuesday in June and July and have drafted both a letter to the mayor and a number of recommendations which we will be dealing with in the business session. I want to thank Katie, stokes and veren again for co- chairing that working group most effectively. I think they did a great job. There are a lot of things in those recommendations that we are going to pursue going further, one of which may be keeping that working group intact to address public safety issues going forward. The other group we announced at the June meeting was the balanced business task force chaired by Bert Lazarin, and they that task force is having a small business forum on the future of reopening the city, and that will be next Tuesday. I think right. Bert did I get that date right, yes, Tuesday, the 28th at 6:30. The registration link is on our website. So thank you again to burt and the members of that task force. The Port authority, bus terminal working group got an update with elected officials, and we are looking to have the port authority come back to the board in September to present on their current plan. Thank you to bert and the various committee chairs that make up that working group, Chelsea land use and transportation held a joint committee meeting and, as I mentioned earlier, provided testimony yesterday regarding the empire station Complex Eis. There was a letter about that for the business session. Chelsea land use continues to meet with terminal building and stare at lehigh for a possible expansion of the special west Chelsea district and then, finally, for my report. As you all know, the tow pound has been a pet issue of mine since I've been since I was chair of the Waterfront and Parks Committee. There are actually two facilities on pier 76. There is the tow pound itself and there is a NYPD repair shop and we have been authorized to announce that the repair shop will be moving to a former car dealer on 11Th avenue and that will take place before the end of the year. I think they're targeting October. As with the story with our office space, they are still working with dcas to get their license agreement done, but that is pretty much a done deal and we were authorized to announce that the repair shop will be moving off of Pier 76. So that's a partial accomplishment. We still got to get rid of the tow pound and turn the that pier over to the Hudson River park. Trust that is it for the chairs report and we are going to move to the business session and first up is the arts, culture, education and Street, Life, Committee, Allen or Kit. We have a letter to mayor De, Blasio who's, going to talk about this, I'm actually going to kick it off and then pass the Baton to leslie. So a letter is about the forum that we had recently and it has been a real moving target. As folks know, reopening schools has been a fluid situation month week to week, in some instances day to day and so big. Thank you to leslie for many revisions to this. As the situation evolved, there are a couple of initial changes that I'll share and then I'll. Let Leslie speak to the letter and entertain questions and potential suggestions. If folks have it in front of you. The first change is on page two specifically lines 39 to 40 used to read and those students whose different, diffidence and or inhibition prevent them from fully participating, that's being replaced with, and students who are not engaged by the large group, virtual learning experiences being provided to them. The rationale there is to try to shift the framing away from what might be perceived as putting it on a student that virtual learning is not working for them yet and then the second change on page three line, four we're inserting the word likely into the sentence. Sense apart, partly in school, partly at home model, is likely. The scenario for the fall rationale. There is that the health situation nationwide has evolved, which has made it potentially less likely that schools will be able to open, but also the governor has provided guidance statewide around what the health metrics are for schools to open in the 10 regions and then what would trigger a region to reclose its schools. So I will stop there and let Leslie take over Hi guys, I'm glad we're first. So kit was saying it's a moving target to say the least. Every time we would write this big long letter d.o.e would come out and give us a little a little piece of what was to come. They have yet to unveil a full plan and I think Luke actually touched upon it and we are going to touch upon a lot of what he said. In our letter we tried to get our arms around really. What is this a huge issue? If you break this letter up, we could probably do a million letters out of this one letter, but we we kind of collaborate on this one. I want to thank blake actually because without blake, probably this letter would not be half as good as what it was anyway. I'm just going to give you some highlights guys. You see the letter we wanted to concentrate on a few things. Obviously what the experts recommended we touched upon that, but what parents and residents in our district going back to school were most concerned about, and we gave recommendations off both of the experts and what parents and educators told us one was which is a big deal for if everyone knows is, live remote learning and the desperate need for it. The second the importance of special training for teachers, especially with that live remote learning. The third was communication. We understand this is a an immense topic and a lot of parents they're different. Some people want to go back to school. Some people do not. Some people are taking their kids out totally and doing just full distance learning. So we know it's a moving target with that, but we would like a little more communication on what the options are and the fourth which Luke also mentioned is one we have not learned yet from the DOE is to release a plan to parents and caregivers on what happens. If someone in the class, a teacher or student contracts Covid-19 or gets sick, what is the plan with the school? What is the plan with the class and how far reaching will that plan go? We also, you guys see, mentioned two particular vulnerable student populations and we stress the needs for them, and I think the tone of the letter is really we understand. You had no time. First go around. You cobbling things together this time we have about five to six months to prepare something. So that's what we are trying to actually advocate for. So if anyone has any suggestions we'll we will take them and we will go through the 105th number of this of this letter. Are there any questions for the ACES committee, because this seems like it was an entire committee effort? Yes, absolutely not seeing any hands go up, so I josephine your hand is up. Did you want to address this? Yes, I it has gone through so many revisions and thank you Leslie for continue to continue to work on this. I just wanted to on page three. I think it's about line 42 when we talk about the need for free, Wi- fi is really important and I think that could actually be its own paragraph. You could literally just hit the return key and make it its own paragraph, because that does not have to do with students in temporary housing. Actually, the kids in the shelter have the free, Wi- fi. It really has to do with needing. You know universal broadband for every kid in New, York City and you know our district three of our five elementary schools are title: one schools, which means that we receive federal funding in order to combat the poverty in those schools. So these families are already strapped, have lost jobs, lost income, so this is something that would really help them, and many community boards have already written letters on it. So I just want to make it pop out a little bit more. So if that could just be its own paragraph, that would be great. Thank you. Thank you. Josephine Betty you're on Mute still Betty. I thought you were leaning in to unmute yourself, so that's why I let you go anyway. I think it's a terrific letter and it shows your thoughtfulness and your thoroughness. I had one thought: having talked to some parents, that there's great concern about parents who need to work and irregular scheduling in terms of you know, days of the week or hours or like kids go in the morning, but then they come back home in the afternoon or something like that, and whether or not that's a factor that you came acrosss or not, it's just the effect on the schedule for parents. Thank you. Thank you. Betty all right, any anything you want to add in response to those comments, leslie quickly. No, but we'll take both and we can. We can add the okay all right. Thank you. I'm going to move on then to the business licensing and permits Committee, Frank and Bert hi everyone. We have a number of letters. I hope you read them all from June and from July. What I'd like to do is like to mention something about Chipotle and then bundle letters two through five and seven and eight. Well, I'm not we're going to vote them. The same way we've been doing here, we're going to do it at the end, we're going to people will call out if they want to vote against a certain letter. When we do the roll call they'll say I am voting. No. On item number 86, I always forget where I am in terms of what our technology is, that we're doing zoom, and so we have a different voting process. Thank you for reminding me the chipotle letter. We have two letters, one to the SLA and the committee thought we also needed to send a letter to corporate headquarters in chipotle, even though Chipotle is says Colorado I found out that they moved to California two years ago, so we're sending it to California, and we also are attaching one a letter from our state Senator, Brad, Holliman and one he wrote in November talking about all of chipotles and he wrote most recently a letter to the SLA specifically about this one asking that this one not be licensed. So we're going to be attaching both of those letters to what we send to the SLA any questions, any questions on the chipotle letters or anything other than item number six you want to okay, the spot. I will address the letter we've written about the spot. Yes, okay, you've heard tonight, people many people for many people against. We heard the same arguments. Basically at our committee, we were all of a sudden. The word came inundated. We were inundated with petitions from people for and inundated with petitions from people against everybody using their favorite phrases in their letters for and they'll. Let us against thinking that would sway us one way or another. I just it's really difficult. You have to evaluate. Where are we? What are we describing here? So the committee had a long discussion among ourselves with the applicant. We changed in our letter of denial with stipulations unless we change the hours our hours, if you notice, 2 A.M Sunday through Wednesday 3 A.M on Thursday, 4, A.M, Friday and Saturday and sundays that precede a federal, Monday holiday. Also gay pride and new year's eve. We limited any kind of live act to 12, has to end by 12 30.. Definitely that's all during the week, Saturdays weekends, whatever the day is 12 30., and we also as often we do in stipulations that phone numbers be readily available both of the security team and of the manager resident manager of the establishment, and we requested that a representative from the establishment attend all block associations, tenure and association meetings. When asked to and maintain communication on a monthly basis, the vote was not a unanimous vote. It was eight in favor three against questions. Anyone have any questions on this on this letter. To be clear, it is a standard CB4 deny unless the stipulations are adopted, which means, if you are voting for this letter, you are voting for the license to be granted with the stipulations Jean Danielle you're on mute, Sir. Sorry, the votes against the three votes against. Can you explain what their reasoning was for? I think they can speak for themselves. Jd, I'm one of them voted against it. So we actually had the co- chairs split on this. I find such a disconnect every time these operators come before us. They're, probably you know 50 percent of the toughest and most community involved applicants we've had since I've been doing this for eight years have been. You know these two operators and I do not know why that is. But there are people come and tell us what a great operators they are, what they are to work, how great they are to work for and etc. I voted the way I did because I lived through the bad past history with all three of the prior establishments from these two operators, all three of them, some of them you've heard about martini rise bar and perhaps most egregiously, the Xl nightclub in the basement of the Out hotel, 9th and 42nd, opened in deeply problematic ways we took years to try to straighten them out. I do not think Xl ever got straightened out and was ultimately closed down by the police and the SLA as things get out of control. So you know, I find it hard to weigh you know who in the community is more forward and more against it, but my opposition really came to what I've lived through with these operators and trying to work out their problems with their prior operations. Thank you. Frank thanks Frank Christine. Yes, I was also one. Can you hear me? Yes, okay. I was also one of the people against and exactly for the same reason as Frank, which is, we have had a horrendous history and with these applicants, where they have consistently misrepresented one part or another of their operation and or not executed what they were supposed to do, and you know whatever they are saying they are going to do at this point. I do not think it is reasonable to to trust them because we've been burned so many times, and I think when we look at the SLA and the sls is you know having a good operator? You know it's kind of qualifying the operators, I'm not trying to qualify the operators, I'm trying to say that their operation has been really sloppy, and very I mean people spend hours fighting that and people could not sleep etc, and that's not good. The second thing I want to point out is that generally I like to rely on the people who live right around an operation and our goal is to really make sure that those people coexist and cohabit with the operator in a good way and therefore, if the people right around the corner are not supportive, I would have a tendency to be to go with them. In this case, we have a lot of confusion about the numbers, etc, but even if I take you know the 800 petition and compare it with the 3200 people at Manhattan Plaza, who are representing by represented by their official board, I mean essentially tells me that 80 of the population in our district is not in favor of this operation being located at that location, and therefore I felt that it's we should deny it just a follow- up. I just want to say something and hang on one person at a time: Bert go ahead. I think we get in very dangerous territory when we start comparing numbers very dangerous territory who lives exactly on this corner or who's on that corner. When I talk about it, excuse me, I'm sorry, hang on Hang on Christine, hang on Christine. First go ahead. Okay in everybody had petitions okay, so there were 130 something seven petition people signed the petition from Manhattan Plaza in favor that undeniable okay. So but, like I said I do not want to get into the numbers this many that many we come up with our own decision from a whole wait a minute. This is I'm talking about what was explaining. My decision hang on a second hang on a second christine finish. What you were saying I'll come back to you christine and Jd, but I do not want to relitigate the commun the committee discussion here. Neither do I and I just want to say that I think that track record from those first two places was horrible and if they only came in with those two places behind them, I would not have voted for this, but the last operation, the most the current operation, that Ted is involved with rise, has had very little currently not saying when it started out. They've changed their security, they fired their old security people, they have a new security team in the last year or year and a half, and so I would go with their current operation. Yes, they have ten years ago, eight years ago, five years of their history, like I said, if they just had that history, I would not have voted for them, but they have a different history from their current operation. All right, I'm going back to Jd quickly, yeah quickly, always the nut of the situation is, if we vote against the letter of the stipulations, do not apply frank. How do you feel about that? I mean it's always a difficult thing, yeah, what I'm going to jump in here? What I will say, because I just checked this with Jesse: if we vote this letter down, we can entertain a motion for a straight denial tonight. But what happens is we voted down? It goes to the SLA, and none of our stipulations that we had considered can be considered right, but we can send all we can take a motion tonight. If there is such you know a ground swell of support to send a letter to the SLA with a recommend, a straight denial, so we will be still be on record lowell. Are you going yes christine? Yes, so, first of all, I want to say that you asked me to justify why I voted against it. So I was not birthed making a statement about how the whole committee voted it. I explained my approach and my approach. Yes, I think the numbers are important, because if you have 100 people at Manhattan plaza, you still have 3,200, which are represented by the block, as was the tenant association, and even if you have 800 number in the petition, you still have 3,200, so we're still like 80, not in favor. Now let me go back to the letter. We have written many letters or few letters where we have denied outright and then we went on to say if the SLA felt that they really wanted to approve it, then we would appreciate the following stipulation, so it's not an either or we have already done that and that works all right, blake yeah. Thank you. I just wanted to reiterate what I said the last time about this applicant since I happen to live pretty close to the rise bar and do patronize that establishment of pheromone. You know I found it to be an operation that is pretty clean inside as well as on the sidewalk. You know they do always have security personnel. I mean, as far as in my experience there, and you know, as far as I can tell it seems like a lot of the ordinances, including with the outdoor seating, have been followed. You know you always see places way later after rises, but they're, you know, put their tables away and you know I think it's also important to bring up the last discussion that we had around their last application. You know I'm just wondering what you know it seems like this is exactly a win for us relative to our last discussion, since this is a bar space with a liquor license established there. So I was wondering if you know there was any concern about things that were not followed as to what we had recommended last time, so you're asking if there have been complaints that, where they're not following the stipulations for ryze bar yeah, it's more of a question around. We had a discussion around this applicant in the adjacent space last time and we denied that one, because that was not a liquor license space, whereas it seems like this applicant has now followed our recommendation to get a liquor license space. So I'm wondering what the remaining concerns were. You know that we're not part of that sure. The prior one had two concerns. One which no longer applies was that, as you say, the place was not previously licensed. There was also some unresolved issue about whether it was even properly zoned for commercial space, but the other path that we heard at that time was that a place like the spot with its method of operation was unsuitable for this block and would likely change the character of the block, and that is still true and those arguments were made with respect to the prior location and took up about half the letter we ultimately sent to the SLA. But does the current location have those same issues? It seems like this was a bar space before going to be a bar space now yeah, but it's on the same block and I think the concerns. As I understand it are you know, large crowds entering and leaving hanging out on the sidewalk, maybe lines to get in and generally a more boisterous crowd, perhaps than frequented lands down road, and since these storefronts are side by side, the effect on the street would be the same from both locations. Thank you, Frank Dale, I'm sorry Bert, the boisterous crowds. Those are just projections that people have and putting on there's no evidence well. There can't be because there's no there's no establishment there, yet yeah, okay, it won't be for at least another year. I think really here should be arguing back on everybody all right. All right, Dale has his hand up yeah. I had it. Please question to those who objected to this and I had a question about process, but I think that's been answered. The applicant has made a case that he is no longer in an active relationship with his former partners and that he's his own operator now. So I'm wondering, if does that, speak to track record for those who objected? Is this a different operator, or do you see that as kind of a smoke screen, I'm not sure what to make of that? No, there are two operators. The gentleman who spoke Ted, Uranus and also John Blair- that they're both partners in rise bar and would be partners here. Ted was the one who originally ran: Martini John, Blair, Run, Rad, Xl and the out hotel and together they run rise bar we're not speaking. We want to do the chat, so I think I think both I think you know you got to look at both of them. They all opened with problems so martini, opened with problems when Ted was legitimately in charge, it was really badly soundproofed and you know all sorts of things. It is also, I think, a factual matter that Ted did leave and the problems continued. The problems in the early years of rise bar were when they were both on the scene and the problems that excel and out were when the other applicant here John Blair was involved all right. Thank you. Thank you. Everyone, Bert did you have a final comment since you presented the letter. No, that's right, you said all right, then we're going to move on. We will vote on this. The same way we vote on everything else. I'm moving on to the Chelsea health kitchen, Clinton health kitchen. I did it again: jd Clinton hell's, kitchen Land, Use Committee. This is the letter regarding the hotel, shelters, I'll jdlet you present and then, since we're going to fold this in with the HHHS letter I'll, let Joe and Maria add something if they need to sure. Can I be heard now a little better Joe. Can you hear me? Yes, you sound good this. This grew out of the land used the Clinton health kitchen, landing committee that we had a couple weeks ago. There were a number of concerns by committee members in the 30s 40s 50s about the the homeless being put into the hotels on the blocks. You've heard a lot about that tonight, so we thought we'd write a letter and we thought we tried to attach it to some kind of land use issue. Paul Devlin looked into, it seems a little difficult. One of our main concerns was that these hotels do not become permanent homeless residents without a full discussion community Board, so we thought we'd draft a letter, a general letter go to the executive committee. Let all the committee chairs everybody weigh in on it. There was no executive committee, so we thought we'd bring it to the board meeting. It's a bare bones letter because we figured everybody's going to add all kinds of things. Subsequently, there was a health and human services letter on the same topic, so I think it's a good idea to combine them. Maria had wonderful suggestions, I'm sure Joe does as well, and I that's what we should do and I think our main concern was to hold DHS to give them some specific. Ask that we'd like to have them fulfill. That's it Joe. Do you want to add something yeah? I just want to note that in combining these letters we need to update them because from the time we met to now, there have been additional homeless facilities open that we've not noted the letter, so we should list them as much as further as I spoke to Jesse today, there's yet a new hotel on West 48Th street that is now housing homeless, singles that was not disclosed to us at all. So I just want to say that in total we want to give a full picture and the last piece is. We really want to attach to this letter a series of pictures that have been sent to us by the local restaurants of what they are contending with in these blocks, because I actually did not believe it when I was on a zoom caller and have good connectivity. I went to the tavala. I saw the pictures and those pictures are a thousand words. It is unbelievable what is happening directly related to the shelters, being poorly managed and the degree of mentally ill chemically addicted singles that just can not in our last meeting with DHS, which was last week right last Thursday or something yes, the providers began to admit that. Maybe this was not a good idea that folks, with this degree of disability, could not be in independent rooms that they really benefited from a concrete setting and at the cachet hotel we learned that 12 people out of 103 were transferred and another 15 or 16 were hospitalized, since they have moved in. So that to me, says it all. As a long- term provider, this kind of housing, so we must do something that is very clear and very specific to DHS velasquez. I want to note in all of our meetings. Dhs has lectured us to let us know there is a pandemic and that Covid-19 exists. It has been infuriating to hear that from the Department of Homeland services and then they follow by saying how we, as a community, are not welcoming to homelessness or homeless individuals. It is just unbelievable that they are blind to the fact that community residents are have safety. Concerns are being followed home and have serious quality of life issues just to get out of their front door. So we need to do this in a very specific way, as I think we've mentioned here previously. Dhs at these meetings has basically been reading from the same script. Over and over again Maria did you want to add anything because I know you've been doing the walks. Can you hear me? I was having some technical difficulties. We can hear you now. Would you like me to share about sorry the letter or just give my two cents, because I do have some two cents I'd like to add your two cents, please, my two cents is basically this that yes, this has been a very trying issue. We all know it's related to the pandemic. It's extraordinary situation and circumstances. We've heard that several times we are all living it. So we all know that I want to be crystal clear. This is not a NIMBY situation, aka, not in my backyard. If you do feel that way, then maybe this is not the community for you to have. This is not the community with people with that kind of attitude. I want to make clear that we, as a committee and a community board, understand it's not a crime to be homeless. It's a fact that not all of the residents in each shelter are problematic. We all know that it's a fact that most people who are homeless are not mentally ill, and we know that we have a moral obligation to help others and in fact, in this particular community we have several shelters and we have several buildings of supportive housing, so we're open to helping others. That was my first point. The second point I wanted to mention is that Dhs's position seems to be that this is all going to be temporary and trying to figure out the street homeless versus residents from the shelter I you know. Personally, I understand I hear that I get it, but I think it really misses the main point from our local permanent residents. And the third point that I want to make is that this letter that we have number 23 is basically about density and safety from harassment and violence and, dare I say, common sense, there are some blocks in our community where they are inundated and overwhelmed and overburdened, and it's an untenable situation and in the letter there Brian Webber, actually emailed Joe, and I some amendments and some friendly amendments which I would like to put into the letter am I getting. Am I jumping the gun here? Mentioning them? No, that's fine! Okay, so Brian Webber mentioned we need to fix the number there's a paragraph that says how many residents there are on 36 and 37th street. We have 518 it's really about 800. and if you think about the entire community, as Brian Webber pointed out, that's about 35 to 40 percent of the entire resident shelter population on those two blocks. So what and he suggested- and I totally agree especially after all the meetings we've had- that if we could put in a letter relocating both shelters that are on 36th street. The other thing he mentioned. The other amendment was fixing a sentence saying that we strongly urge DHS to rectify the issues towards the end of the letter, which I think was a great suggestion. I know I went through that really quickly and I apologize basically, the letter is just saying that the solutions should be reduced density security and a safety plan for the nonprofit providers. That DHS should be setting guidelines for that and input and notification to the community board all right. Thank you, Maria. I want to add one thing: the photos that Joe referenced they would fall into the category of not safe for work. Just so everyone's aware Alan, you had a comment or question. Yes, thank you in terms of a some kind of a solution to reduce the density, could we request from DHS or the city? Are there any plans to retrofit the shelters that these folks came out of in order to perhaps move some of these folks back to these other shelters is that is that a viable ass alan? We should when we asked specifically what their plans were. A deputy commissioner told us that they will be moved when DHS is ready, just like that, as if it was nothing planning thinking anything. So I think our letter has to be very much. You come up with a solution. You figure out what to do, because our community simply can not bear this degree of difficulty and by the way, as Maria noted majority of people are homeless, are not mentally ill. However, the realtors have a predominance of mentally ill chemically addicted people in them that were relocated here, that's one of our problems, so we have density of people with serious social service problems and the setting they were in which gave them support is now totally not there, although some of them there's lots of staff at the same time, so that that's what's so disturbing here. This is a management issue. This is how it was done and how it's being managed now and they're, acting as if they're, not in a series of small rooms and people who are truly profoundly decompensating, meaning they're having mental, have a mental illness and they're breaking down that it does not work if you're not being connected with and talked to and engaged with by case management, all the time. So that's our problem here they got taken out of a certain location that was set up to treat and manage the circumstances and now they're in a hotel and thrown on a block, and I watch people just they are physically and mentally decompensated. I have never seen this as such a degree and they're all new people, they're, not our street homeless whatsoever, all right, there's a board member who is not identified, who raised their hand some, whoever that was. Can you identify yourself? Maybe it's me David Warren. I do not know you're David you're up next, but and I'm going to go to you. That might be me because I have the key. That is you Tina go ahead? Sorry, I did not. I had to keep rebooting myself, so I did not this time I neglected to. I do myself. I live on 26th street right behind my bedroom is the BRC, which is a homeless shelter. It houses probably around 350 people, some of which are you know, mentally ill and substance, abuse and so forth, and so for a while. I was on the advisory committee. Dhs would come in and you know I know we have 600 and 600,000 homeless people, but I can't help but believe that DHS is so much a part of the problem, at least in my interaction with them. Okay, so that's one we can go on for a while. There also has been a pattern of housing homeless, folks in at least two hotels right nearby. So so that is a that has been a pattern, and one of the things to keep in mind is when homeless folks are in hotels. They basically get food vouchers, they're not able to make their own food in the case with BRC. They make food at the you know facility and then bring it into the hotel and so forth, and so on. So you know there is this high level of dysfunction that when something like Covid-19 is, as you know, humongous as it is, let's face it. This is not going to go away and we need to find a way to work with DHS and to call them onto the carpet in terms of their inability to properly manage. You know the health and well- being of not only their folks but of folks in the neighborhood. I mean I've been living with this over saturated saturation for a very long time- and you know there is something called the homeless industrial complex and there are not to speak badly about nonprofits, but you know there are a lot of people making money off of the homeless, and you know I think that we need to take a holistic view. This is a this is a big issue that needs to be grappled with, but this is one of the offshoots. The problems that you guys are facing is one of the offshoots that has, you know, been consistently happening here, at least in my neighborhood for a good eight years or so, unfortunately, I'm not surprised because we still continue to suffer from from these sort of social ills. My overriding concern in having relatives that are homeless- and you know mentally ill and so forth and so on is the long- term care of these individuals. If you're living in hotels, how do you get the social services that you need? Tina, I'm going to Tina, I'm going to interrupt you for one. Second, we have met yeah, we have met with the providers and we've asked these questions and the issue is not so much. It is the prov some of the providers. Some of the providers are quite good. Some of them are not, but we've gotten no help from DHS at all. David Warren. Yes, thank you. This is a very it's a sad issue, as everyone knows, but Joe mentioned, and he know he knows the fields about the managing companies. Is there any way we could get the good managers to take over some of the buildings of the bad managers, because, I think, would be terrible to move these homeless people once again or these people without homes. I should say once again: move them again to another area and that and the same cycle happens again any way we can get mental health services more mental health services, social services- and I think the key would be is to work with the good actors and try to get rid of the bad management companies rather than move. I do not that's possible. Also. Someone mentioned earlier that the lack of ny, I think you did lowell lack of NYPD, backup and cooperation. That's a very serious issue. How do we get our local brand? This is a big thing. How do we get our local priesthoods to be not forceful but to be in the background to protect us and have social workers or mental health experts, and only maybe get rid of the really seriously mental ill and those that have moderate problems try to work with them and keep them as part of the community? I do not that's just my ideas, I do not know how I'm not a social worker, so I do not know how valuable majority of these hotels have full complements of staff. Caseworkers security managers in one case, there's 60 or 70 staff at the hotel. They are just trying to manage a situation that they're not set up to manage. So even a good operator like BRC is not horrible. They have a bad traffic in some things, but they are professional. They have not been able to manage it. That's the problem because their model is set up for this congregate, shelter with lots of activities, day rooms, all kinds of things happening. People are in individual rooms. These are all budget hotels, there's no place for people to gather, and in fact they could not. Because of coronavirus. You put all this together and then DHS just says. Oh it's the same thing. We asked DHS to fund more security for perimeter patrols. We asked for the security to be coordinated among the providers. Basically, there are just it's a social service fact there are. You do not put a lot of people with a lot of problems in this depth. In one location, it creates havoc for them lack of success and havoc for our community. All right. Some of these people relocate some of these facilities, relocated Joe. I want to keep this moving. I'm going to to the people who have their hand raised. I'm only looking for comments on the letter we've had these discussions multiple times at committee hearings in meetings with DHS, it's all been taken into an account, I'm looking for comments on the letter alone, not on the underlying problem. Katie. I have a question about the logistics. Are we I? We talked about combining the letters, but are we looking at nine being the main letter or 23.? You can't figure it out we're putting them together into one letter and pulling all the thoughts into one letter. It will be it'll, be a coordinated letter Kitty. I do not think there'll be one with the other pieces added. It will all be folded into one newly written letter to clarify, though, for everybody. That's voting on this. We've removed the ability to vote for item nine and it just states that it's been combined with the latter letter just because the latter letter has is a is a larger letter on it yeah, but it will come out of. This will be a new letter jointly written by Jd, Joe and Maria. Okay, great, that's, really helpful, then I would just say you know, obviously as a board member, not only of the Community Board for but also of BRC, that I thank people for acknowledging that they're really good providers out there doing their very best, but this is a really tricky situation thanks. Thank you, Katie James Wallace. Very briefly, I understand that we are combining the two letters and it's always hard writing these kinds of letters. There was not a hhs meeting for me to comment, so thank you for giving me the opportunity here. This is from the prior meeting James. It was from the meeting before Jesse held it when you were there. I understand the most recent cycle had a lot of information that occurred from the prior meeting to June in to July. In any case, a very simple comment: lowell number one. I would request that it be explicitly made clear- and I think the letters attempt this, but it just needs to be made explicitly clear that DHS is facing a mismanagement nightmare and there are too many times where we reference the pandemic and try to pit the homeless issue against the pandemic as if they're separate and competing the bottom line is the pandemic is not an excuse for mismanagement and in fact a pandemic is when you need your best management, and we should be doing your very best job, and I just hope that that's explicitly made clear you are channeling me James. I screamed them. It's been done that a week ago I said better, managing this not worse, exactly and the one other thing joe. If you would, please include something diplomatic about your comments about DHS. Taking this really, you know condescending cone. It's like that's, not helpful and it's not necessary. That's all! I have all right. Thank you, James Kit. I think this is a bit different than what James closed out with, but I want to emphasize. I think it's important that we try to take the tone that Maria was suggesting. I think, if I put on the hat of an objective third party and I read letter 23, my initial reaction is this feels like not in my backyard, and I do not think that's who we are as a community. I do not think that's who we want to be, and so I just encourage us to definitely. You know be clear that concentration is an issue. The management has been totally unacceptable and the issue needs to be resolved. At the same time, I think we also need to be clear that we are not a community. That's unfriendly to folks who are homeless folks who are struggling with substance abuse. I think it can be with both and all right thanks. I actually think what we could do is say that this, the mismanagement of DHS and the providers is not only hurting the community, it's hurting their very you know their clients, and if we do it that way, I think we cover that point. Can I just say something low: go ahead, Maria! Actually, if it's mentioned in a letter, I did not, I just did not mention it. When I was speaking about the letter, there is a bullet point. If you've read the letter about the absence of consideration to shelter residents, social service needs for well beyond the Coronavirus protection. So that is something that we considered, but maybe that needs to be highlighted and I'm writing down the suggestions you guys are mentioning to help enhance the letter. So thank you. Thank you Josephine. So I you know. I agree that the I thought the tone of the letter number nine was a little bit better. You know, for example, on letter 23. I can't find it right now, but there's some discussion about how the skyline hotel like shut down overnight our students were moved. I mean it was devastating, especially for me knowing a lot of the families that go to our schools, but then it's sort of counter that you know these families were pushed out for these males and it just sounded very anti- homeless male and you know I know that was not the intent, but that's sort of what it sounded like. So I liked the tone of letter number nine better. Thank you, okay! Thank you hector. Yes, jd. We know you wrote letter number nine upon reviewing the letters hi everybody upon reviewing the letters again, I do not know. Maybe I'm missing something, but there's been no mention, as one of the other panelists have mentioned, of prisons being released from Rikers island and putting put directly into some of these hotels, especially in Midtown. There are no people. None of these hotels have people released some Rikers in these hotels. Really, it's just absolutely that's been confirmed. Okay, it's and people are freaked out, leaving that trust me okay gone through this all right. If it were not, we would have included it. Clarified put it in trust me just to clarify what Joe was saying: hector he's talking about the hotels, the little hotels and the that are listed in our ladder. I do not want to start speaking for other situations outside of our history, but every letter, every hotel- that's been in our in our district- does not have anybody in that situation. They're all coming from DHS shelters that are, from other boroughs, relocated here, not from the jail okay, great, and can I just make one other point just since I'm speaking now, just to clarify something that Joe had spoken to. So we believe that there is another hotel on 40th Street. I did confirm with DHS that it is not theirs, so we have to find out what agency is and what population it is so just to clarify that it is not Dhs's, as reported by DHS, it's not theirs. I'm sorry! I dropped out in the middle of what hector was saying, so I missed that. I do not know who we're up to next we're on to marty all right. Thank you, Jeffrey Marty! This is a letter to DHS. It's a letter asking DHS to clean up its act seems to me. We need more help than just ehs. The letter should go to our electeds. It will yeah. I do not think we have an issue with that Paul Devlin yeah. I just want to add one thing: I've heard citywide there was a movement of a number of shelter residents. Two are about ten thousand acrosss the city and about two thousand have been assigned here, so I think, to put it in perspective in the non- mar not my backyard theme to say we're carrying 20 of the shifting of residents to our neighborhood and we're taking a big burden on in our neighborhood. So we'd ask for more support from DHS to support us in our support of them. Okay, thank you. Paul all right, I do not see any more hands so we're going to move on, I'm going to the Waterfront parks and Environment Committee Jeffrey and marty. Yes, there are four letters to the Parks Department requesting a replacement of the track at Chelsea park, one to Hudson River park, trust regarding the Chelsea waterside park, redesign of which we're all very excited about, but provided some important critiques and comments, a letter to the city's economic Development corporation and our elected officials regarding a lack of public space and a very dangerous situation around the Manhattan cruise terminal. Access way, I'm including extending the invitation to them at our September wpe meeting and finally, a letter to NYPD state, DOT and parks around on the Hudson river greenway and the placement of the what sugar cubes and how they pose overdue danger, an overdue burden and danger on cyclists that need to be permanently addressed. To be clear: that's not the sugar cubes. We use when we're doing zoning right exactly different type of sugar cube. The NYPD cement block is the is the sugar cube here not far? Example Alan. You got a question nope you're on mute Allen, perhaps a friendly amendment. If we're requesting an analysis for these cubes to be moved changed over to bollards or whatever. Could we also request a study on the possible changes or recommended safety concerns on the entrance crossways into the park where folks have to cross over the bikeway, sometimes having to scamper acrosss? There wait for a good period of time before someone actually stops, and I think some of the problems that occur on the bikeway is that some very nice and good bike riders do stop for the pedestrians. But then you've got people that just try to run right around them. So perhaps we can study those entrances maybe to something that can be done to provide a safer passage for people coming acrosss with you know: baby carriages, strollers dogs, all that kind of stuff yeah. I I agree with you on the need for that to be addressed. The issue is they've already moved forward with permanent replacement of the sugar cubes on big parts of the greenway, and so that's what needs to be done. Acrosss, the entire agreement. We need the metal bollards that are in with the cement blocks to be removed. I would take your letter as a separate. I would take your suggestion as a separate letter not to be folded to this one, because one is moving forward and one we have not even asked for yet. So you want to take that up at the next meeting or you want to just. I would be happy to take it up at the next video and it sounds like a an issue that we actually want to really drill in on what we're looking for on those intersections, because it's not just about the people and folks using it. It's also about the cars that have to go through at certain points too, and I think that can be tied to a really important ask about making the greenway safer for everybody, okay, cool. Thank you any other questions on the Wpe letters moving to transportation, christine and Dale letters 14 through 21. Please Dale! Are you taking that or not okay I'll take. Let me just pull them up. Sorry, one! Second, we're not bundling, because we're vote, we're bundling everything! So just anything or do any of these letters need commentary or are they self- explanatory 14, I'm going to I'm just going through 14 through 18:14 is a letter on traffic enforcement and the traffic, and the bureau itself. 15 is on the barricades around the police. Precincts in our district. 16 is traffic mitigation strategies north of 14th street 17 is a letter to the sanitation department, about curbside collection for buildings and 18 is about bulb outs and how they can how we can have a more equitable disposition of ball balance all right, 19:20 21, anything we need to add there. No, I just think we need probably a small amendment in 19, where I have received phone calls since our hearing requesting parking, no parking zones in front of residential buildings. So we will ask that in 19., okay, any questions on 14 through 21. all right hearing, none we're going to go to the joint transportation, Chelsea land use letter regarding the empire station, complex, Eis, who's. Taking that one Paul. That's you yeah, sorry Buddy, but because of the timeline on this, it's going to be a long discussion, and I know it's late. So I'll try to go quickly. But, as we've discussed, the esd is proposing a general project plan to override euler and current zoning, and the plan is to develop rights on eight sites and sell those development rights to fund improvements to the train stations and develop class. A office space in a transit oriented development area and the proposed project area runs from 6Th Avenue, 9Th, Avenue 34th to 30th, and this area includes Farley office building, Moynihan Train, Hall and Madison Square Garden. But this plan does not address any changes to any of those three buildings. The eight development sites of the proposed Project Surround Penn station that would be for commercial use and if all the sites are fully realized, as proposed, approximately 20 million square feet of new construction would result and that's approximately nine million square feet more than is permitted as of right under the current zoning. So they have that primary area is just those eight sites and the Moynihan stations and whatnot. But the secondary study area is proposed of approximately a quarter mile radius, which runs from about mid block between 10th and 11th to 5th and park, and then to about 39th to 25th. So keeping in mind that community board 4 represents the portion of this proposal. Just eighth Avenue. It technically only includes site one of the eight development sites, but we feel it's important for us to discuss the impacts on our community as a whole and we're now in the stage in the process where esd is determining the scope of study for the environmental impact study and they provided us. This draft of their scope on July, 1st and they're seeking input on what should be studied in their scoping and then that would be included in the eis and the comments on that draft scope are due by August 20th, so we're under a sort of a time crunch. That's why transportation Chelsea land use held a joint hearing on the 15th esd held their meeting last night on the 20th night. Before last on the 20th we had our hearing tonight and, in addition, Community Board five held their hearing on July 13th, which many of us attended to listen to. So from all those hearings. We've gathered this letter that you have in your in your dropbox that if some of you have read it I'd be glad to hear that. But this represents a collection of those points and there are three main themes to the letter. First is we have concerns with baseline issues in the primary scope, then we address some very specific issues with the proposed scope, and then we address some alternative plans. So in the first section on the baseline problems, we believe that the scope uses an outdated model of study Akin to a Robert Moses model of demolition and replacement, rather than a holistic and integrated approach, and we also note that there is a focus on having a mega developer, run the whole project rather than providing opportunities to minority owned development companies. So we provide six specific areas that should be changed about the primary scope. First, the underlying assumption should include the relocation of Madison, Square, Garden and through running of trains. Second, the primary study area that I described as the sites should be expanded to that quarter. Mile Radius of the secondary pros and the secondary area should be a quarter a half mile radius and should take into consideration the cumulative effects of the Hudson yards rezoning and the Port Authority bus replacement project. Third point is the floor. Area ratio proposed should be consistent with special districts in the project area are already approved by city planning. Fourth, is that residential development with affordable housing must be included in this project. Fifth, is that homelessness issues, as we just discussed, are not going away anytime soon, they must be studied and on- site mitigation must be proposed, and, sixth, the transportation and public realm plan envisioned in the project must be studied from a pedestrian, commuter and micro mobility. Point of view, rather than a car- centric perspective. So, given these baseline adjustments and for the second portion of the letter, we then went through and identified 23 specific tasks for the study that need to reflect concerns from our community and those include traffic, pedestrian use, community facilities, business and residential displacement, open space, historic resources, water insurances and energy issues, amongst others, as well as questioning we also unquestion the underlying funding mechanisms for the entire development and then in the third step. As part of the scoping process, seeker calls for alternative plans to be examined. Besides the proposed plan and a no action plan, and so we for the third part of the letter include recommendations for five different alternatives, which include one an alternative with decreased far two: an alternative with the relocation of Madison Square Garden, three, an alternative with residential components on site, one four: an alternative with a connection to Grand central station, using the New, East side, access or other Amtrak projects and five, an alternative implementing non- paired through service of lirr to see Caucus and New Jersey transit to Sunnyside. So that was the fastest recap of a 10-page lesson. It took three weeks to get together than I think I could have imagined, and I want to point out like the this was a joint work team effort. I mean Betty as co- chair of Clu, Christine and Dale with transportation and Jeffrey is our liaison to Community Board five and to the advisory council for Esd, so the without those guys. This would not have happened so and Dale, I said they'll do he said Dale. He got there, I'm keeping tabs so there's still some editing tweaks that need to happen in the letter. There's some. You know headlines that are not lined up or whatnot and some typos. So if people have comments other than minor typos and want to talk about substantive issues, I think we're going to work on some master plan. Paragraph Jeffrey. You know we interpretive christine. We talked about some of that. So, let's I do not know who wants to Joe and then Bert good job yep. So in the section about the Hudson yard zoning we need to include the point I brought up in our in our first call about it that, in the event that the plan proceeds that we need to study, they must do a companion action to Demap a subsection of subdistricts, B and C, which allow the Hudson yards development rights to be transferred to that block on 30th 29th 7th to 8th. If they do not de- map that they could add that on top of their far so it has to be a companion action if they proceed in that manner. That demands that section right point on that, though, does not apologize. The state, the Gpp Overrides local zoning, so that zoning would no longer apply no, not no longer they override over zoning, so they can go further, but there's an underlying zoning. It does not mean that some nice land use attorney could say it's a plus b. So that's why you should definitely note that up front, hey Joe. Could you do us a favor and just what you just said, just type it out in a sentence? Yeah, I know send it to me, so we can include it because you know what best compared to the rest of us and I'd have to send it back to you for review. Anyway, I had to look up those sub districts they're, not because they're not on our board, but I remember that okay yeah all right. Thank you, Joe! Thank you, Joe and we'll definitely accept that as friendly amendment all right, bert yeah, you got to do the mute thing too. Bert, yep, sorry about that counting how many times I say that tonight I think it's a really good letter well thought through many of the perspectives are important that we're bringing to this. There was a piece there that I thought when I read the letter I understood, but then somehow, when you just went over it Paul, I had a different image completely. So I just want to be clear when we talk about through running trains with direct service from Penn station to Grand Central, and then you said through wait through long island access. Oh, I had originally thought we're talking about a new deep tunnel from Penn station to Grand Central, but then, when you said long island access, I had this image of trains going out to sunny side and coming back and around into Grand Central. What are we talking about? Dale? You want to take this one yeah, the model that's often discussed and by the way there are a lot of transportation experts and engineers who advocated for a comprehensive study of through running service, but the model that is most discussed and that was referenced would be, and it would require some normal, like regularization of electrification and integration of long island railroad. I'm just going to talk about long island, railroad, New, Jersey Transit for a moment in table Amtrak. I understand it less anyway. Instead of Penn station being a terminus for both New Jersey, Transit and long island, railroad, some or many long island railroad branch services could continue through Penn station to secaucus and, conversely, some New Jersey transit lines could run through Penn station to Sunnyside. This would require investments. This would require construction and modifications, and it was estimated by one specialist on the order of five billion dollars, as opposed to the eight billion dollars that they're throwing at this specific iteration of the project, but it would also not require a lot of additional tracks and the southern expansion as outlined in this, so it seems like it's a worthwhile, it's worthwhile for them to look closely at these two based on where we are today and give us an assessment right. Can I can I jump in here for one second, the Eis one, second Bert one. Second, the eis is specifically about the development sites, not about Penn station and the trains so is dale. Is this really relevant to the to the current letter that we're writing? Yes, because the whole development is predicated on the need for how much money they need? Okay got it. I wanted to just clarify that they need to condemn the buildings on 30th street to build the tracks underground and build on top of it to fund that. So it's all predicated on track expansion. All right. I just wanted to clarify that. Go ahead. I'm sorry! I'm sorry! No could I understand the through running long island, road to New Jersey Transit back. You know. We've talked about that for years. You know having trains go from New brunswick to stamford. You know, that's not what I was referring to. I was referring to a connection from Penn station to Grand Central because years ago I do not know how many there was a talk of a direct tunnel and trains running directly. That's inside access, it's under construction, as I understand it, that's underway is from to bring long island, railroad trains into grand Central, but we're talking about what Paul was talking about trains from Penn station to Grand, Central and so hold on. Let me address this one person at a time. Please tonight, oh Paul go ahead! It's your letter go ahead. As I raise the point, that's causing confusion for Bert, let me see if I can clarify there are two issues that are going on here. One is the through the through running of the New Jersey Transit and long island railroad, and there is a second issue of the of the grand central connection through the east side access. There are two issues and if you look in the letter on page 10, we one of the alternatives we asked for is the study of that east access. So there are two requests in here, both of them your trains going to sunny side and coming through the 63rd Street tunnel back down Park Avenue Christine. Can you can you shed some light on this christine? Thank you christine. Yes, the access to Grand Central is the idea that a lot of people which are going to penn station really want to go to Grand central station, and we are not suggesting how to do it. We are just saying you are: you have to study an alternative where you find a way to bring all these people not to not just to penn station but to Grand Central, and we do not know whether they would reuse some amtrak tracks or they would reuse the east side access or they would do something else. We do not know, but we're presenting that as a problem that need to be resolved and I'd like to add that one of the big problems is there. They do not have the master plan set yet for Penn station. So what they do not know what they're going to be doing and they're putting this development on to fund something that they do not know. So it's sort of a complicated issue that way. Okay, thank you all for addressing that Jd had a question now, I'm going to say it again and James says I see James and Christine. Thank you good job, everybody Jeffrey and Paul, and Betty and Christina. My question was about Madison Square Garden Paul can hear you Madison Square Garden back in the past. We've had discussions about that. We do not want it moved over on top of Moynihan station or wherever they're going to move it have any of those issues come up. Are you aware of those prior discussions about moving it over here? The issue of moving Madison Square Garden is part of a study of where it would go. That's what we're asking them to do is to study where and include it in the consideration where it goes and that study in and of itself so art we're asking that they study that it get relocated. It's not a study of where it would be relocated to and Community Board five was very emphatic about having to move Madison, Square Garden and proposing an alternative for the use of that ground for better access for Penn station is that we had discussions it would we do not want. It moved over here, great agreed, great, all right, James, Wallace yeah briefly, three points. First point is epic letter of great epicness. Oh my god. What a great job second thing is. With regard to reference to trees, the trees are referenced in the open spaces section and the pedestrian section. I was just wondering unless this was structured in a particular way to address Eis, if maybe there could be a sustainability section to sort of bolster the point that we can really lead the way if we're doing this youth redevelopment and make it as sustainable as possible. So I do appreciate the trees are mentioned, but it might be. It might be something to consider as a friendly amendment, to have a section on sustainability as they're embarking on this and the last point you know putting on my old art hat, you know it would be nice if someone talked about art public art like if the sooner it's considered the more likely it is to actually be adopted and brought into being and done in a way that is, you know not going to offend Jd, who just turned his camera off. That's probably epic, Suggestions James, thank you and in terms of sustainability, there is a lot more in the energy section I mean I apologize that I ran through this letter very quickly, but there is some sustainability issues. There is some mention of trees. I think you're right. We do not necessarily mention public art space, but that I could see that falling into an open space category yeah. We could add that yes, agreed Jd has weighed in okay any other questions on this. Thank you, Paul Maria and Joe Letter 24.. What you forgot us never so this was a very complex matter about a tax exemption in exchange for grading permanent, affordable housing. You see there's a lot of items in there that were not filled in this had to be done very quickly and sent to the city Council because they voted on it as part of the budget, and they did approve this. I can honestly say that I've been playing tag with raju Man Head City Council Lane used to find out where it ended up. I know it's been approved, but a lot of our requests. Some have been in retail and some have not been so that's where we are on it and it actually preserved a great number of affordable housing units for a 40-year period. Any questions on the letter. Thank you, Joe. I know how Marty's got his hand up go ahead. Marty you're on Mew! I do want to say well Marty's finding his mute button that I know how much time Joe put in on this one it was it was. It was a bear. Somebody else marty. We can't hear you you're still on mute. All right marty gives up Josephine. I also appreciate all the work that was put into this, but I do have a couple of concerns and maybe Joe can answer them for me. The first thing is that this real estate deal does not include any new, affordable units. What they're basically doing are buying units that are already deemed affordable right because of the cost, their tenant buildings, where they're located and they're saying that they're going to keep them affordable for the next 40 years. Meanwhile, there's really no indication. They say that they're, some, a percentage of the units, will go to homeless or formerly homeless families, but they do not say whether they're going to take housing vouchers, which is what formerly homeless or homeless families use it's actually what a lot of low- income families use are vouchers, but there's no indication that they take the vouchers also they. You know, they've done this in the Bronx before they've bought property, they flip it in a couple of years. They make a lot of money off it and there's no real evidence that it's done anything to benefit those communities. So we're talking about a 30 million tax exemption when we're in the worst economic crisis, since the 70s and everything's being slashed and real estate revenue is really the only the only revenue coming into the city at all. So I'm you know I'm a little hesitant on this one. You know I want affordable housing as much as anybody else does, but the reality is that these apartments are already affordable. They meet the 120 AMI for affordable units acrosss the city. So I'm not sure what you know the reality of what they're doing really does not seem to me to be making a whole lot of a difference. All right, jeff, the majority of units are not affordable. They're. Almost all there are 29 units that are currently market rate, non- rent stabilized those are being returned to rent stabilization. So that's a net gain for us. The units have no income caps on them whatsoever and, in fact, this owner bought this property in order to continually either buy out or vacate rates that are in stabilized tenants and raise the rents. The entire project remains in rent stabilization and there are 10 units that are 30 of AMI, specifically for the homeless families at very low income. So it took us a while to figure this out because it was not. I would say this owner's presentation was our one of our problems. Well, they were not presenting very clearly or fully and as we got into it clearly, we understood in fact that we were actually preserving a total of 196 units, the majority of which are below 80 of AMI, but are they taking home? Are they taking vouchers housing vouchers? Yes, they're required by the regulatory agreement to take the vouchers, but there are 10 units, would not even require a voucher, we're talking rents that were in like 300 or 400 per month. Okay, because I do not see that in the plan they did not put that in there it's not in the letter, so their regulatory agreement always require vouchers, because by the way you are required now by law, you can not refuse a section 8 tenant if you're rent stabilized they do it all the time right. I work with the shelters all the time and nobody takes them all right. Well, whether or not people are enforcing the law is a different issue. Josephine I hear what you're saying I'm not questioning that and Marie is nodding along as well anything else on this marty. You want to try again yeah. I found I found the mute button. Thanks is this letter? One that's gone out already. I did not understand the introduction to this conversation. We were constrained by time marty because the City Council was acting when it approved the budget. So basically, this draft went to the City Council land Use division and they used that as the guide for negotiating our behalf. And what about all did it go with all the areas that were not filled into the city council? It actually did marty because we had to write it in a day and a half. I know I know you're doing good work, but I tried to read and understand this and from my dumb mind, I could not because of all the blanks I'm with you this was thrown on us. This was brought to us in the middle of Covid-19 disaster. I respect your work Joe. You know that, but I you and I've had this conversation a lot of times. All right did this one. This one was out of our hands. Marty yeah Corey's office came to us with this one with no lead time at all. No, that may be true when I commented earlier about the time I know Joe put in on this. It was very intense over a very short period of time. I understand your concerns marty. I do not even understand the letter. Okay, I do not know what to vote for I'm voting, because I love you guys not because I understand what I'm voting for we'll take it at 9:30, we'll take it morty. Okay, if you want to discuss it offline afterwards, I'm happy to I want to move on. We've got two items left, but they're important ones. It's the letter and the report from our social justice, Working Group, katie and veren, hey guys. So the letter is first, it's number 25 and then the recommendations are next number 26.. I will say that this letter is actually one of the recommendations so, but we might as well discuss the letter first, because it's attached first so and we apologize that it took us a little while to get it to you guys. But the letter is addressed to the mayor and Speaker Johnson, asking for the creation of a commission that would include a representative from each community board to provide input to our elected leaders, about feedback concerns and suggestions and best practices about policing in our communities, and we think that it's really important that we have something at that larger level at the higher level and with our elected officials, so that it's not just about you know at each at the precinct level, and so we've asked for the creation of this commission that would exist for six months to provide feedback, and so anyway. So our ask is the creation of this commission with a representative from each community board if we all approve this letter tonight, our plan is also to circulate this to other community boards to encourage them to think about asking for the same thing to get on board about it, and then we also explain: we've added a paragraph in there sort of explaining the work that we did for the last seven or eight weeks yep. So questions comments concerns all right. Let's move on to the recommendation. Oh well, hang on Jeffrey and Leslie. I saw your hand I'll take it off the recommendations. I apologize. Okay, Leslie, I'm with Jeffrey me too. Okay, all right, katie recommendations. Yes, so let me just get over to the recommendations on my computer, so the recommendation so the way our task force worked was that we invited everybody to just start, throwing out suggestions on any topic to advance this issue, and then we ended up with a really long list, and then we said okay, but let now we have to start thinking about you know what can we do in the short term and what can be most effective and we ended up sort of focusing in three areas. One is on our board on Community Board four. What can we do as a community board sort of internally and you'll see that there are three recommendations there which we can go through in a second next up, we focused on youth and community and you'll see that there are four specific recommendations there and then the third category was NYPD and then there are just four specific recommendations there. So that's how the task force decided to do it you'll see in the first group, which is the board, focused recommendations, and I think Lowell. You had mentioned this earlier- that one of the recommendations simply is that the work of this task force, whether it's a working group or becomes a full board committee, whatever that the work of this group continue in some way. One of the things that we added by the way most recently is that we agreed just last night as part of our task force, that we think it should actually be renamed to the anti- racist working group to really specifically identify what we're working on the very first thing we mentioned. There is having an anti- racism training program for all of us and then also share with each other, as well as on our website. Anti- racism resources and we've already put together an initial list of recommended books, movies and podcasts. So anyway, just the community, the board- focused ones. The three are the anti- racism training proposal that we could participate in voluntarily. The next one is to continue the work of this group, and the third one is to recommend that each of our committees expand explicitly our commitment to actively enhance racial justice, and then it gives some examples of how different committees could do that. So maybe we should get people's feedback on those before we go into the next ones. Is that right role do the whole? Do the whole thing I think it'll be faster if we go through it, we'll take them all at once. Okay, and then before you go on just to clarify it's not a task force, it's actually a working group yeah, that's true, and we are hoping that it will sort of translate into a more consistent working group or a task force or even a committee, and the second thing I just want to quickly point out is that, following what happened to George Freud and the events of the sort of movement that sort of followed that occurrence, thank you all for actually suggesting formation of this group and for actually 20 other people from within the Community Board four to have come together and really get this going. So that's actually one of the biggest impetus that we follow. That sort of made this happen very quickly. Yeah thanks, farin, that's very important, you're right. So the three suggestions, I'm sorry, four suggestions under youth and community focused the first one, as you can see, is sort of focusing on opportunities and physical space for black and brown youth to engage in positive ways with the NYPD. Frankly, specifically, we've heard that the police, Athletic League, has some great programs and some other boroughs and we'd really like to see if we can help replicate that by contacting some of our recreational spaces and maybe even some of the private spaces in our district to see if their gyms and things could be used for the police. Athletic league number two is to frankly replicate what Manhattan community board seven has done and to create a CB4. Nycha working group number three is to connect our workforce development organizations with local community groups and businesses to really focus on skills, Development, internship and employment opportunities for black and brown youth, and our last one is to frankly focus on access to capital for businesses that are black and latinx owned. So those are the four for youth and community focused and then very. Lastly, we have the four that are NYPD focused our first one is that the police precincts be coterminous with the community board districts and we go into a little more detail there. The next one is to sort of help collaborate with police, precincts and community organizations to foster better communication, and we have some specific ideas. There, third, is to ask for more training for the NYPD focused on de- escalation and implicit bias and, frankly, specifically for all officers, not just for new hires and number four under NYPD is to contact the mayor and City Council and request that a commission be formed with every community board. You know to focus on community policing practices, and so that's the letter that was number 25. all right, I'm going to take comments, but I want to preface it this way. This group has been working for seven or eight weeks once a week. We are not going to re- litigate the entire subject of social justice right now. If you have specific comments on the recommendations that have come out of this working group, now is the time to raise them, but I do not want to relitigate everything here, I'm going to start with Jeffrey. Thank you level, two things, one thank you to you for putting this working group into effect and katie and viren for sharing this. I think this is an excellent start to something that I would support becoming a more. I do not want to say permanent, but part of the board over x amount of time going forward. I think your proposals were smart, sensible and well thought through, and I look forward to seeing what comes next of them. Thank you. Thank you. James three things. Great letter, great start. The first thing I would suggest is workshops on mwbe certification. We could do that outreach. You know social justice making sure black and brown people are not killed in the street. Is a nice start, but show me the money. We do not get social justice if you keep people poor and homeless. The second thing, and by the way that's not directed at you, you guys did a great job. The second thing is developing more of an ownership society rather than a housing society really focusing on initiatives to increase the ability not just have access to capital, to build businesses, but have access to capital to own their own real estate. That's all! I have great start thanks guys, okay Leslie. This is this is wonderful. I know it's a really hard broad topic to get your hands around and you can probably go in a million different directions. So I think this is a good start. May I add some friendly amendments. Just to think about the ccrb is a really important organization. They are in danger of not getting funded. Now I think that the civilian for civilians to now oversee complaints on police officers- I think, is very important, and I think that should be in the letter. If you can add that would be great or at least look upon not pulling funding from it, which is now supposedly the rumor, I'm sorry Leslie just so I can be clear, so you're suggesting we put language in according to continued funding for the Ccrb. Yes, the Ccrb or I mean yeah, because that's really where the civilian that's where people get to. I guess if there's any complaints about any police officer actions and then it's pretty tran, that's a it's a mode of transparency and that's already. In effect, we just, I think, to support that. I think would be a good thing or to advocate, for the second thing is a little bit more. I guess precinct oriented, so our precinct and all precincts have NCOS and they also have build your blocks and I think that they do have avenues where communities, families, children, schools, everything can kind of have a voice and interact with their police officers, and I think if we helped strengthen these programs, the NCOS are a great start. I do not know if you know the NCO in your neighborhood, but they give out their personal phone numbers the same with the build your blocks. They have the build your block meetings, I'm not sure it's monthly, but I think it's maybe four times a year where there's a very healthy interaction, and I think we just need more people to come to those meetings to get face- to- face time with police officers, and I think it would hopefully help a lot a lot of this. But thank you so much. Thank you, leslie Jj. No, I'm not going to say it again. The mute, Button Sir. So sorry, Lowell Katie. I only got this letter this morning. Oh the updated one yeah. She is not significantly changed from the one a few days ago, but yeah we apologize for the timing. There are a number of things that I could support in this letter. The youth thing, I think, is excellent. There are other things I can not support. I think the intention is, of course something we all want, but my feeling is this is a community board. I did not see anything addressed specifically to us. Is there racism on our community board? Then that's something we should address. I did not see that if there's racism in our community, we certainly should address that, but addressing these larger issues is a worthwhile thing. I just do not understand how we are getting into it. I do not understand that and I'm sorry to say that what are we supposed to do the idea about having training on this community board about racism? Well, let's have training about bias against Lgbtq Let's have training about bias towards women, I mean: where does it stop? When did you become pure enough, and I understand Lowell, you do not want us to discuss any of these little items, so I won't, but unfortunately, without more understanding of the board's role in these larger issues. I can't support this letter as to having a representative on a larger thing. Well, there are four precincts. The hell's kitchen neighborhood up here with Midtown north seems to work pretty well. We fought with them for 20 years, we're working well now any racism or anti- gay that would come up. We would go crazy. We would go nuts, so who's going to represent the community board to represent our many different neighborhoods. We all do not agree, so I do not understand how that works. So, unfortunately, I can not support this, and I wish we had the chance to kind of muddle some of this through all right jd. These are set of recommendations for the board that we're going to you know, vote on to see to take forward. These are not carved in stone. This is what we are going to do. These are a set of recommendations. It will be taken up at an exact. It will be taken up further with the working group. All right, like I hear what you're saying, but this is the first step in the process. I did not understand that from the letter. Well, it all right. Well, the letter is one thing. The set of recommendations is something is just an internal document for us to work. It's a it's a it's a blueprint. It's probably the best way to say it. The working document is not a set of sort of fixed agenda items, so you can hear me yes, varying I'm saying. If it's instead of working, it's a working document set of recommendations. It is fluid. It's open to input. It come about through a number of sort of much longer list of recommendations, and just to your point, Jd CB4 is not insulated from rest of the city and the folks come in and out of CB4 as well, and they also actually form part of the community yeah schools in the neighborhood where people come and some schools, students come and study. Here we have nature population, we have streets where people get targeted because of X y and Z types of biases. So we're talking about implicit bias, we're also joining our voice. The Community board's voice with the rest of the city and that's what this working group is all about. That's what we thought it was. So it's not about pointing fingers at the community itself or the community board, but become part of a larger conversation, because we all agree in this role that we see the implicit bias acrosss every spectrum of life wanted us Maria wanted to weigh in Maria appears to be frozen. Yeah there you are. Can you hear me there? You are go ahead. Can you hear me? Yes, we can hear you, your screens appears to be all right. Hang on. We can hear you, oh you can hear me now. I just very briefly. I was going to say that okay, good, very briefly, I would just highlight what viren just said, because that was one of the three things I was going to. Mention is just about the fact that it's about implicit bias. I did hear Jd Mention, is anyone racist here and, if anyone's racist here we should address that. I agree with him, but I think it's a greater issue than that people do not walk around saying. I'm racist people do not want to also walk around saying. I have implicit bias, but we know it exists. I have it, everyone has it right, and I just want to mention that. I also hear you when you talk about the issues of injustice in terms of different groups. You mentioned women, you mentioned, we could include the disabled there. You mentioned the Lgbtq community. Those things are real. Those things exist, but the reason for the group that was put together as varian mentioned is about what is happening currently to people of color, particularly black people, and I just I needed to share that. Thank you, Maria Josephine. Yes, I definitely thank you Maria, for that. I hope I was heard you were yes thank you for starting that, but I also just want to mention that some of these recommendations are definitely community focused based in CB4. So one of the recommendations is to improve relations between the NYCHA residents and the NYPD. By hosting you know, fairs or games. Hector had talked about several initiatives that the police do in other parts of the city that we can bring here, because that's one of the big issues that we're having right the interaction of the police with specifically young black men and women. So that's something that we can work on in our own backyard. Another thing is, you know we had gotten a statement about CB4 and what some of the needs were for our community, and one of the large need was for our youth to have more support in terms of job training, and we have a significant amount of young black and brown youth who really need jobs and job training. So that is another thing that we could work on with partnerships throughout CB4 these many technology companies. So there's a lot of focus that we're doing specifically related to CB4, while also branching out and trying to work with other community boards and seeing what other folks are doing in the city. Thank you, Josephine. I said I supported that. I said I can support that. That's great, that's very specific! It's the other, broader things that I have not been able to digest yet and as Jd as Viren said, this is a living breathing document. It's a blueprint. It's a start! It will be a lot more discussion about that. I do not see James okay last one, I'm not taking anyone after James thanks lol Jd. I you know how much I appreciate your views on things and sometimes we end up on the opposite sides, but I still love you brother. I just want to say it regards the document I just read through it again and I could not see anything specifically that you were highlighting, except for the training you use the term purity test. First, I just want to echo what Viren and Marie have already said, but I want to add that they said identify implicit bias, training and request that people attend it. So you do not have to go right and it's not required. You know the community board has been offering like six or seven different kinds of trainings. I do not think I've gone to any of them and it shows in my performance, obviously, but I and oh, by the way. I totally agree with you. If there were Lgbtq bias, training, feminist bias, training, heck I'll teach a biracial bias, training like I would go to all of them, but I do not think there's a reason to oppose it per se. If you choose to vote against this, that's your right. I respect it, but I think this letter indicates that community board 4 has a commitment to supporting black and brown people of color and I think they have very specific proposals that are pretty inoffensive and again, if you do not want to attend the training, that's fine Dale I was, I said I was not going to take anyone else, you're going to kill me if I cut you off just to clarify other boards have implemented such trainings and also the borough president has one: has: a module has had a module in anti- racism, training in development or it's in development. What's been discussed, it's been discussed and it's there's a separate conversation going on at borough board to expand these kind of concepts. Acrosss all 12 Manhattan boards. At this point, I'm cutting off the discussion. Maria and Mike. Are you ready for a roll call? Can you all hear me? Please say: yes, all right we're going to here's. What we're doing we are doing. We are doing a roll call either going to call your name you're, going to say yes on all or yes on all except number 73 and Mike is going to I'm sorry. Lol Mike is going to track it and you're calling the names no Mike. I will track Michael call out the names I'm having a delay in my sound, I'm still having technical issues, so I will just I will fill in give me one. Second and Mike will call out the name all right. I may have the wrong call sheet. I may be able to help you here hang on. I can do that. Lol. Do not worry about it right in front of me. I have. I have the roll call sheet all right. This is Murray. I have the roll call sheet. I'm ready with my pen, I'm ready, Mike noble the floor is yours: okay, Sarah, Appleton, Sarah Next, christine birthday. Yes, all except number. Six, where I oppose Gwen Billing, move on I'll, come back to all of these folks, leslie, yes on everything, except for 14:15 17, and then what Lol said about number six. If we can, I think you said there could be a discussion about an outright another letter we have. This is just a roll call right now, just yes or no on six, then patricia not here. Next Jessica, yes, on everything Dale yesterday, okay, I'm one the president not eligible and noah number six Martin, no on six! Yes on everything, Paul! Yes, on everything; tina! Yes on everything! Now on sex, pete! Yes, on everything! No on six and 14, I'm abstaining from two and three yes and everything else: oh Zora, yes on all except 14:15, 17 and 6. Wendy, yes to all David Hawaka, yes to all except six Frank, yes to all except six, which is an l josephine. I know on sixth abstain on 24 and yes on everything else, Carrie Keenan! Sorry, yes to all no on six; okay, lol, yes to all now on six blake, yes to all burst, yes to all Christopher Noah, six, yes to all Jeffrey you with us Jeffrey! I am. I do not know, I'm an eye on all sorry about that. Excuse me eye on all. He said: oh good, Elizabeth Betty! Yes to all, except for six Morgan yep, yes to all Sarah mills, no on six, yes to the rest, Raksha, no on 2:3 and 23, and yes on the rest and for myself, yes to all Jd sean Danielle here, I'm so sorry, no on six! No on fourteen, no one fifteen and no on seventeen Maria. This is Maria, I'm going to say. Yes, I abstain on two and three and 19. yes to the rest. Okay rhonda is Rhonda here tonight: nope, okay, tweet on all! No on six, oh, very good! Thank you, joe you're, on mute, yes to all. No I'm sick! Okay! Sabrina! Are you here? I've not seen her tonight, no dolores, no one team! Yes to the rest! What which? What number? No was that? Dolores? I'm sorry, no one 15:1, 5., okay and yes to the rest. Okay, thank you! Okay, Brian soco, yes to all David Solnick, yes to all katie stokes, yes to all kid towers, yes to all marty, treat! Thank you! A hector, Vasquez yeah! That's no one! Six, and no one 15 and yes to all okay, Rob Walker, yes to all James wallace! No! On six, yes, the rest David Warren may on six yay to the rest, Dave Leslie Williams, no, on six, yes to all colin Wright, yes tall, please! Okay, now going back to Gwen Billig did we get Sarah? I was having trouble with my mute. I'm yes to all: that's gwen, that's Sarah, Appleton, okay, good and then Greg Gwen, Billing Gwen is on. He appears to be signed in, but on she's, not on video. No just raise your hand on the participants. No she's in I've got. I see her, but she's on mutant apparently has stepped away. Oh, I got you all right. Is that everyone? What about Patricia Patty? Not here, oh okay and then and then Sabrina, not here? Okay, so do you want to know the number for number six? We need to count on number six. Please we have okay, so 11, plus 10 plus 5 is 26, knows all right. Then that's going to fail! That's the majority! Yes Sir! Is there a substitute for that to get our noses right? I was going to. I was going to ask. I was going to give the floor to Frank. Would you like to make a motion yeah? I think the alternative would be a straight out denial and then the provision that says if the SLA were to disagree with us. We would ask that the following stipulations be terms of the license. That would be the stipulations that we agreed to with the applicant at the BLP meeting. Okay, does everyone understand that? But that's just what failed? What just failed is this is the vote to approve a license with stipulations right? No, that's what we'll deny it was that was we voted. We voted down a deny. Unless now we are saying deny, but otherwise it's a slight general, it's a slight variation jeffrey. All it's saying is that okay, you guys want to give it to them. Put these stipulations in. We do not want to be left out. We I think we just voted to be left out by the position we took on the letter and we we're introducing a new motion now as a replacement letter. I guess, is there a second on that motion? Well yeah! I have not gotten that far because you interrupted us you're right all right. There was the second point all right, so I asked did everyone understand the motion? Yes, is there a second on the motion back in all right, all those in favor say hi, wait what christine, what I wanted to do an amendment on that letter. Okay, just a suggestion, I think a lot of people were concerned about the four o'clock or whatever and whether we should you know change that end hour. In that alternate frank, it's your motion. Do you want to accept that as a friendly amendment sure christine? Would you go to three on the weekend Sir, it's four o'clock on Saturday and Friday clear to me later, all right, I'm not! I do not want to renegotiate. This is what you guys did in committee. There was a straight christine made a suggestion, frank accept it or deny it. Let's go with what what we agreed to the committee. Okay, now, all those in favor say aye, all those against say. No all right motion carries by voice vote I'll, entertain a motion to Adjourn, so wait. Watch it slow down, slow down, slow down. Look at that everybody needs to put into the vote sheet. Do you have the you guys got the digital vote sheet right? You need to put in what happened into the bottom vote. You have a you have to add item number 27.. Okay, add item number 27, it's the new letter on number six and you have to enter that in your vote sheet with everything else, because we still need a written record. Okay, so you're saying everyone got that, are you going to resend the link Jesse? Can you resend the link for the to the Digital vote sheet yeah in one? Second, thank you. Okay. Now, can I entertain a motion to adjourn? Yes, wait a minute. Wait, a minute wait a minute, I'm asking Jesse. If I can entertain that motion first, are you done this is Maria Jesse? Can you hear me I can hear you Maria quick question. Do I need to know who said no on number 27? Yes, no it'll come in on the on the digital sheet. Well, we need it now lowell. We need it now for the record by voice vote by voice voted past. We will have the written record and it will be there. It'll become part of the record, the written vote sheets it passed by voice vote. I'm sorry, lowell hi. This is Tweet. I guess what the question is for number 27. Do we say the motion is to Xyz, and I say yes, so I think that's the part that people are asking all right letter 27 is a motion. Is a letter to deny the application just add that to the vote sheet and if you voted yes by voice vote mark it. Yes on the sheet, we will have a written record Michael, because it'll come through on the written route on the written vote. We know that it passed by voice vote here, so we are done with our business. Any Hey Jesse do not forget to send me the link to the meeting. Now in the chat me too Rob. I will send you once I get it tonight. Mike thanks. Thank you, Maria, both all right. If you extend the voting sheet Jesse thanks yeah, I just said I just put it into the link I just put into the chat, but I will send it out separately. Thank you because I'm on the phone got it a good night.",
            "summary": "As Lol pointed out, the New York State, Urban, Development corporation, also known as empire state development or esd, is proposing a transit oriented development surrounding Penn station through a general project plan or gpp which supersedes the city's euler and overwrites Current zoning We're at the stage in the process where esd is determining the scope of study for the environmental, impact, study or eis.\nThis is our community board full hearing on this project and to repeat, as wolves already pointed out, the governor's executive order, we're holding this public hearing Remotely We have requested that people submit their names by noon.\nOne first, because I did not know if that we'd see before CB5 members joining us who were interested in one item, but I will I do see you there , Paul This is an issue item 22 on the rest of the agenda for the letter that was compiled, and I will be moderating that discussion so not seeing any further requests for comment.\n, I'm, the first vice chair of Manhattan community board for this evening, I'll be running our public session as we do each meeting those that have signed up in advance.\nA number of letters of opposition and support to a particular liquor license on the agenda of a place called the spot.\nThat will be talked about in detail during the business section of the meeting by the co- chairs of the BLP committee, and we also see the number of we're letters around concerns about the homeless issues we're facing in largely in Hell's kitchen, but in the district as a whole, and one of the things to Lowell's point is, if somebody says something before you your time at the microphone.\nThe last four years I've been living here in Hell's kitchen and last year, and I think this is relevant and worth Noting I was the head of HR for breaking ground, which is the largest supportive housing network, probably not only in the city, but in the United States.\nThese are poorly managed, pop- up facilities, appear, the quality of life has decreased, overall, and I might add that the tenants are smoking and drinking in large groups in front of the hotels without masks without social distancing, and it's something that the governor has shut bars and restaurants down all over the city.\nI've been personally asked to give money to a tenant milwaukee in the street when I refused, he threatened to spit on me, as the residents no longer feel safe or comfortable, going out to eat or shop.\nI want to remind the board that Detective Mike Dugan, head of community affairs at Midtown North, told me that in two that in 2020 rise bar six, three one violations all happened in the beginning of the year.\nSorry, in their later years, from my experience within the immediate vicinity of the proposed bar, my neighbors will have issues with noise pollution coming from the spot bar itself, as we have found living in an older building coupled with the spot guests who will congregate, as the previous speaker, said, outside the bar.\nI've ran nightclubs for many years, and I want to make clear that ryze ball operates as a local bar and far from a nightclub which requires a completely different business model like much larger capacity.\nMost of our guests are from Hell's kitchen and We actually know many of them by name most consider rise as their local cheers, because we do provide a safe environment for our guests staff members and our surrounding neighbors.\nDo not think this is the best interest of the student staff faculty or the lgbt community, which is very heavily represented in our community board, and that's why I'm also bringing it to you I feel like when people are shrugging their shoulders.\nI. Do not think it's a good way to manage public funds, particularly given that Cuny's public And it's facing 150 million budget shortfall, so This money would mean a lot to a lot of different people in the community, and so I would really like someone to reach out We could figure out a way to go forward with additional support.\nI'm, a public member of CB4, land, Houston, Zoning, Committee, and I'm, also a resident of West 36Th Street between eighth and Ninth Avenue, and I'm, calling with regards to the temporary homeless shelters that have moved into West, 36Th, Street and West 37Th street.\nI've spent the past several afternoons, walking the streets with Eric Bocher from Corey Johnson's office and members of DHS, the shelter providers, and what is evident is that we have too many residents too little space.\nWe represent many service workers, including more than 3,300, who either live or work here in Community board 4.\nFor the last year and a half we've supported chipotle workers in New, York, City, struggling to better their working conditions.\nI just want to thank the BLP committee for their decision and encourage the full board to vote with them on resolutions.\nIt's not a rowdy bar I also think that in this time, right now, when we're dealing with so much blight, that's happening in the city, because people are literally leaving the city in droves.\nThe whole neighborhood is outside right now, As far as rowdy bars, I do not think of rise.\nThree queer spaces are closing and announced in the neighborhood, and I'm really shocked that people do not want that block to be lit.\nGet the homeless, out, and I will tell you that I helped to get letters and many people that I got letters from have small little children who live in my building.\nWe have recently gotten beat cops on the streets through the efforts of the House Kitchen, Neighborhood, Action, Committee and spot bar.\nThe, and the people that are getting letters are not from Manhattan plaza or the neighborhood.\nI wanted to talk about all these homeless shelters going up in the area, It's really start to destroy the neighborhood I've been in for 30 years.\nTo get such a voting block, you know, And I, do not know where the Florida boss is coming from, but they're, not 16 seconds , I'm, just in favor of the bar, because it's going to light up that block, I jumped there at rise.\nThese are not just businesses or jobs for people in our communities and at the last full board meeting when they were trying to get the spot at the location.\nSecond, now is the time to approve the spot and help restore Hell's kitchen they'll, make the block safer and provide jobs to those in our community.\nSo I think one of the concerns that I'm hearing from the community is that the spot bar will have an outside impact.\nMany, apparently lived outside of Manhattan, so landstown road was a quiet, local pub that had an exemplary operational record 15 seconds and one of the clear things that a petition like this tells me Is that even the owners understand that spot bar is going to have an outsize impact on the on the community.\nI have a different kind of perspective, I'm, fairly new to Hell's kitchen as well as New York I've, just been very thankful to work for Tracy, Teddy and John as being one of my first managers and for one of my first jobs to make money in New York City.\nI just wanted to say that the open restaurants plan has been overall promising for our street from having like a couple hundred people on our street to smaller problems.\nSmaller, gatherings, I just want to note, there's been a related problem and we could really use the help of the Community Board and our local officials.\nSo people have been bringing portable sound systems stereos and playing music on their car to like really late hours of the night and like I, do not want to blame any specific restaurant or bar, but contacting 301 and 911 has not helped, and I've spoken to a lot of neighbors about the same issue.\nAnd, so I know, Carl from the speaker's office, is out of town, but I'd love to do something with the neighborhood, as well as the Community Board and the speaker's office to maybe do a walk through to see just kind of some of the related problems that are still sort of manifesting, because we could really use some help in that area.\nDoes I think my coach, like my peer, said with Gotham cheer rises up this race over thirty five thousand dollars for homeless Lgbt, youth at the ally, New York court coat Drives and trinity place shelters, but the larger piece is a as a black gay man going into Hell's kitchen , it's great to go into a bar.\nYou feel supported, and I realize that security does that not just for rise, but for anyone passing by if security sees someone team second in need of distress, they actively jump in and assist strongly encouraging our communities more than just stroller families.\nI, want to let the people know that I was the reason why I closed And I was reported the business of the SLA and got the license.\nFirst off, I'd, like to say, ryzebar, has only had five noise complaints in three and a half years, 33 out of 40 tenants that live above rise of our support, the rights application and due to living directly above in terms of noise, we are having the appropriately security guards bartenders certified to make sure that they are over seeing people are not drunk I'm, an architect at building violation, services, and I.\nTruly want to put my support behind theodore He's been he's been a pleasure to work with, in the last couple of years, trying to make everything legal and the most safest for the health, safety and welfare of the public at rise.\nNot only is it quiet and peaceful and The public is protected, but making sure everyone is safe and with the limited issues with the neighborhood and the community, I think he's one of the most upstanding individuals.\nI'm, the president of the Manhattan Plaza, tenants, association You know, 800 units in our building are acrosss the street from the proposed location of the spot.\nI did write an extensive letter and hopefully you were able to read it, I'm, echoing Owen, Brian, Thomas and Amy. I lived on 36th street, I've managed buildings on 36Th, Street, The fact that the police and 9- 1- 1 are not dealing with the open drug use.\n420 of those are south of 48th street in Hell's, kitchen 329 are above 49th street 137 petition signatures are from Manhattan plaza in addition to that , we've obtained eight letters independently from residents of Manhattan Plaza 33 of the 40 residential tenants that live in the rise of our building Are in support of this, including the two residents who live on the second floor above rise, bar.\nI, want to tell you that also add value to our community by hiring people that live in the neighborhood.\nI talked to Ted arenas yesterday, and he told me that they got the homophobic people living in the Manhattan plaza and they do not want gay bar in our neighbors They got 140 people from the Manhattan plaza who support gay bar and the neighbors, and I think it's really good for our community.\nI. Think it's going to be a really good opportunity for our neighbors, and I want to tell that television has created a really nice bar This is a bridge and tunnel crowd.\nWe look forward to working with board for with our fellow elected officials with the city to try to clear up this situation.\nIs that part of the reason we have so much so much trouble in this city with housing and behavior that that stems from people with mental problems that are not getting assistance and a whole list of other things is that for a couple of decades, New York has been operating on an austerity budget, and we've got to break that And I'm, not suggesting that people who live in this community.\nWho've been fighting to get taxes on ultra high wealth in New, York , I want to say the Assembly Health committee, which I chair is going to be having public hearings in August on on the Covid-19 epidemic and its effect on nursing homes and adult homes and home care, and on our hospitals.\nYou should know that other parts of Manhattan are having the same darn problem, because these, in my opinion, these non- profits are not doing their job, not to mention too many people.\nHope 420,000 new yorkers have left so those are hard to chase and for those of us who are here, we need to fill out the census, I'm, not going to say more, except if you want us to come with an ipad, and you have a group of people.\nNow, it's gone in terms of pickup with an Nyu group and others So community board members or the public is interested in working with us.\nBoard, 4 has an amazing history of understanding, affordable, housing, perhaps more than any other board, and so we're going to try one more time to list, at least for the bar of Manhattan.\nSo I know it's not the number one issue, but if we can figure out open space for these schools, you have a lot in district.\nYou know the ulip timetable is now going to be opening up again with the City Planning Commission and again we'll be working together on all those many issues.\nMany of the issues with homelessness with mental health There's in our community We've got the issue with the hotels that I'll talk about in a minute, but there's the closure of the subways and the libraries and other places that street homeless people spend their time.\nOne of the major issues with this ban was that it was depriving refugees and lawful permanent residents from the right council upon being detained in american, airports, and I know that Jerry actually went to Jfk to see the chaos Firsthand and to understand really what it looked.\nThe second thing is on opening schools going into the fall, which I think some of the work we're doing dovetails.\nWe reconvene the Hudson yards construction task force with the support of the mayor's Community Affairs unit and Speaker Johnson's office, and we had got DOB and DEP to agree on a set of construction, hours, Acrosss for all the major developers in all Hudson yards, including Manhattan West, and those from my understanding.\nThe district office has been responding to a very high number of complaints related to the increase in the temporary hotel, hotel, homeless, shelters and continues to advocate, with for the department of Homeless services, to lead a monthly service meeting with all providers and community stakeholders until the temporary health shelters are closed.\nAs I mentioned, we've got a letter coming out of two committees on that What's going on those blocks.\nThere are a lot of things in those recommendations that we are going to pursue going further, one of which may be keeping that working group intact to address public safety issues going forward.\nGroup, Chelsea land use and transportation held a joint committee meeting and, as I mentioned earlier, provided testimony yesterday regarding the empire station Complex Eis. There was a letter about that for the business session.\nTrust, that is it for the chairs report and We are going to move to the business session and first up Is the arts, culture, education and Street, Life, Committee, Allen or Kit. We have a letter to mayor De, Blasio who's, going to talk about this So a letter is about the forum that we had recently As folks know.\nWe touched upon that, but what parents and residents in our district going back to school were most concerned about, and we gave recommendations off both of the experts and What parents and educators told us one was which is a big deal for if everyone knows, is, live remote learning and the desperate need for it.\nI had one thought, having talked to some parents, that there's great concern about parents who need to work and irregular scheduling in terms of you know, days of the week or hours But, then they come back home in the afternoon or something like that, and whether or not that's a factor that you came acrosss or not I'm, going to move on then to the business licensing and permits Committee, Frank and Bert hi, everyone.\nWe're going to people will call out if they want to vote against a certain letter.\nIf you are voting for this letter, you are voting for the license to be granted with the stipulations Jean Danielle you're on mute, Sir. They're, probably you know, 50 percent of the toughest and most community involved applicants.\nI was also one of the people against and exactly for the same reason as Frank, which is, we have had a horrendous history and with these applicants, where they have consistently misrepresented one part or another of their operation and or not executed what they were supposed to do, and you know whatever they are saying they are going to do at this point.\nYes, I think the numbers are important, because if you have 100 people at Manhattan plaza, you still have 3,200, which are represented by the block, as was the tenant association, and even if you have 800 number in the petition, you still have 3,200, so we're still like 80, not in favor.\nThere was also some unresolved issue about whether it was even properly zoned for commercial space, but the other path that we heard at that time was that a place like the spot with its method of operation was unsuitable for this block and would likely change the character of the block, and that is still true and those arguments were made with respect to the prior location and took up about half the letter we ultimately sent to the SLA.\nSo we thought we'd write a letter One of our main concerns was that these hotels do not become permanent homeless residents without a full discussion community Board, so we thought we'd draft a letter, a general letter go to the executive committee.\nI. Just want to note that in combining these letters, we need to update them, because from the time we met to now, there have been additional homeless facilities open that we've not noted the letter, so we should list them as much as further as I spoke to Jesse today, there's yet a new hotel on West 48Th street that is now housing.\nHomeless, We really want to attach to this letter a series of pictures that have been sent to us by the local restaurants of what they are contending with in these blocks, because I actually did not believe it when I was on a zoom caller and have good connectivity.\nWe all know that it's a fact that most people who are homeless are not mentally ill, and we know that we have a moral obligation to help others and in fact, in this particular community we have several shelters We have several buildings of supportive housing, so we're open to helping others.\nThe second point I wanted to mention is that Dhs's position seems to be that this is all going to be temporary and trying to figure out the street homeless versus residents from the shelter Personally.\nIf you think about the entire community, as Brian Webber pointed out, that's about 35 to 40 percent of the entire resident shelter population on those two blocks.\nOther amendment was fixing a sentence saying that we strongly urge DHS to rectify the issues towards the end of the letter, which I think was a great suggestion.\nYou know there are a lot of people making money off of the homeless, and A.\nIt's a sad issue, as everyone knows, but Joe, mentioned, and Is there any way we could get the good managers to take over some of the buildings of the bad managers, because, I think, would be terrible to move these homeless people once again or these people without homes.\nOnly looking for comments on the letter we've had these discussions multiple times at committee hearings in meetings with DHS, it's all been taken into an account, I'm.\n, then I would just say you know, obviously as a board member, not only of the Community Board for but also of BRC, that I thank people for acknowledging that they're really good providers out there doing their very best.\nThink the letters attempt this, but it just needs to be made explicitly clear that DHS is facing a mismanagement nightmare and there are too many times where we reference the pandemic and try to pit the homeless issue against the pandemic as if they're separate and competing the bottom line.\nI would be happy to take it up at the next video and it sounds like a an issue that we actually want to really drill in on what we're looking for on those intersections, because it's not just about the people and folks using it.\nAll right hearing, none we're going to go to the joint transportation, Chelsea land use letter regarding the empire, station, complex, Eis, who's.\nGiven these baseline adjustments and for the second portion of the letter, we then went through and identified 23 specific tasks for the study that need to reflect concerns from our community and those include traffic, pedestrian, use, community facilities, business and residential displacement, open space, historic resources, water insurances and energy issues, amongst others, as well as questioning.\nI mean Betty as co- chair of Clu, Christine and Dale with transportation and Jeffrey is our liaison to Community Board five and to the advisory council for Esd. So, there's still some editing tweaks that need to happen in the letter.\nIf people have comments other than minor typos and want to talk about substantive issues, I think we're going to work on some master.\nI will say that this letter is actually one of the recommendations so, but we might as well discuss the letter first, because it's attached first The letter is addressed to the mayor and Speaker Johnson, asking for the creation of a commission that would include a representative from each community board to provide input to our elected leaders, about feedback concerns and suggestions and best practices about policing in our communities, and we think that it's really important that we have something at that larger level at the higher level and with our elected officials, so that it's not just about You know at each at the precinct, level, So we've asked for the creation of this commission that would exist for six months to provide feedback, and so anyway.\nOur plan is also to circulate this to other community boards to encourage them to think about asking for the same thing to get on board about it, and then we also explain: we've added a paragraph in there sort of explaining the work that we did for the last seven or eight weeks, The recommendation.\nSo the way our task force worked was that we invited everybody to just start, throwing out suggestions on any topic to advance this issue, and then we ended up with a really long list, and then we said okay, but let now we have to start thinking about you know.\nThank you all for actually suggesting formation of this group and for actually 20 other people from within the Community Board four to have come together and really get this going.\nYou know to focus on community policing, practices, and so that's the letter that was number 25.\nWe fought with them for 20 years, we're working well now any racism or anti- We would go nuts, so who's going to represent the community board to represent our many different neighborhoods.\nThese are set of recommendations for the board that we're going to you, know, vote on to see to take forward.\nIt, come about through a number of sort of much longer list of recommendations, and just to your point, Jd CB4 is not insulated from rest of the city and the folks come in and out of CB4 as well, and they also actually form part of the community Schools in the neighborhood.\nThe Community board's voice with the rest of the city That's what this working group is all about.\nSo, there's a lot of focus that we're doing specifically related to CB4, while also branching out and trying to work with other community boards and seeing what other folks are doing in the city.\nYou know the community board has been offering like six or seven different kinds of trainings.\nThink this letter indicates that community board 4 has a commitment to supporting black and brown people of color Again.\nOkay, just a suggestion, I, think a lot of people were concerned about the four o'clock or whatever, and whether we should you know change that end.\n, it's the new letter on number six and you have to enter that in your vote sheet with everything else, because we still need a written record.\n, so I think that's the part that people are asking all right letter , 27 Is a letter to deny the application."
        }
    }
}