{
    "YoutubeMetadata": {
        "author": "MCB5",
        "channelId": "https://www.youtube.com/channel/UCEXyH78eAd9JcCWmmI8GLzg",
        "title": "June 23rd",
        "publishDate": "2020-06-23",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB5",
        "normalizedName": "Manhattan Community Board 5",
        "twitterName": "Community Board Five",
        "youtubeChannelName": "Manhattan Community Board Five",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
        "twitterHandle": "@ManhattanCB5",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "Twelve hadrian, thanks for joining us just saw you know no problem and is on I here too, oh yeah, oh no! That's here! Okay, it's six o'clock and I am looking I believe we have a quorum here. One two three five Julie can I just confirm that we have our quorum here. I'm. Looking, yes, okay, perfect, all right, we'll start since it's six o'clock, hello! Everyone! Thank you for being here. My name is Renee Kinsella I'm, the chair of the budget, education and city services committee at CB, 5, Julie Chu, is the co-chair and Luke Zapdos. Is the man behind the curtain running the zoom just a few housekeeping members of the items, members of the public? They can see everyone, while committee members can only see their fellow board members and the meeting is being recorded. I would ask that if you're, not speaking, that you put yourself on you and if you'd like to speak, that you use the raise hand, function and I will acknowledge you and you can then unmute yourself and speak this evening. We have one very important item on the agenda and it's a conversation regarding the NYPD budget and consideration of alternative public safety strategies. I'm just going to give you a brief overview of how the committee works, we are going to discuss our issue, which is budget and alternative policing, Public Safety tonight the citizen budget Commission CBC, who is a nonpartisan I, always say that we're wrong nonpartisan nonprofit civic organization, whose mission is to achieve constructive change in the finances and services of New York City is here. Adrienne and Anna are going to provide some information for our consideration. We don't have any other presenters on either side this evening, so one CBC complete their presentation. The committee is going to be permitted to ask questions followed by the public and then we're going to move into our conversation mode now, while a resolution regarding our committees, you of alternating policing and potential areas where the city might explore new paradigms is the eventual goal, that's where we want to get here. These are very complicated issues, and so we need to absorb a lot of the information in order to draft a very clear policy position so that we can present it to our board for adoption. Therefore, tonight is going to be a forum to educate and discuss the issues amongst the committee get a sense of where we stand and then Joseph and the policing silo are going to begin a draft of a resolution that we can consider for adoption in our next meeting. I just want to give you a note on the New York City budget. It's gonna be finalized at the end of the month, and although there have been statements from the City Council and the mayor regarding what this budget is going to look like, we really don't know. Until it's formally adopted, we have already sent our electeds a letter which supports cuts to the NYPD and support for things like the Summer Youth, Employment Program, and so we are now as a committee looking to the next budget cycle, which begins on July 1st, the transportation and environment committee of CB 5, provided us with a set of principles that they have informally adopted regarding the enforcement of transportation violations, and that's really going to be helpful for our conversation this evening, and we should look at that. I've circulated that, amongst you all and some of the other things to think about. As we start, this conversation is what are the tasks that are currently handled by the NYPD that could be better handled by other agencies or other organizations even think about whether armed police are necessary for all functions, and we also need to think about enforcement, and how do we ensure enforcement is done in a non biased way, but also even thinking things like? How does enforcement provide findings to the city coffers like what percentage of the finds from enforcement do? We need to maintain with this I'm going to hand it over to Joseph who's, been working on this agenda item with people in the policing silo to provide an introduction and overview of CBC's presentation. Joseph can I hand it to you yeah. Thank you, yeah I, don't have much to say, but I do want to say thanks everyone for focusing on this conversation, something I'm very interested in, and I'm really excited to have two people from CBC here: I have to be transparent. I four years ago, I was an intern at CBC, so I got to know them well, and you know think that they're a great organization and they're very kind of neutral they are really nonpartisan. So that's one thing that I really appreciate about them from actually working. There is that you know they're a good place to go for the facts, about the budget to understand how the city budget works and I'm hoping that they'll give us the information that we need- and you know maybe stick around for the Q&A and maybe parted the last part of the discussion, if possible, to answer questions that come up about different budget lines. You know about how hiring works. You know I even have a question or two about you know the union contract with the city. I understand you might not know all of these things, but you know it's nice to have experts here, as we have this conversation so I know. Anna is the director of City studies for CBC and she offered to join us because she authored a recent report that wasn't totally focused on the NYPD but did examine my piece NYPD spending in the overall context of the city budget and then Adrienne is also joining us. Adrian I'm. Sorry, I didn't have your title, but I'll. Let you introduce yourself in a minute. That's all I have so I'll. Let you kick it off Adrian. Thanks for having me, my name is Adrian pizza, I'm, a researcher at CBC and I'm joined by a Chopin. A my colleague and I had a little presentation about the NYPD budget, just to get some basics, so I guess we can go through that. First, let me just pull it up. Can everyone see this? Yes, great, all right, so, first things first I think you know often we see sort of thrown around the news or on Twitter or whatever, that the NYPD's budget is about six billion dollars. One important fact to note is that this doesn't fully account for the entire expenses of the city pays on the NYPD and related costs, because it doesn't include what are known as central expenses, so in 2020 the NYPD's operating budget which funds it's like day-to-day operations, the costs of staff, the cost of programming or anything else that the agency might do is about five point six billion. But then there are another 5.3 billion dollars in central expenses which are managed centrally by the city, but then can be allocated back to the agency, for which you know those costs are responsible for, and this is things like pensions fringe benefits, which includes things like health, insurance and other welfare contributions to employees as well as there is spending for any capital projects that NYPD might have. So you could see when you add all these up. The total spending citywide is about ten point: nine billion dollars in 2020 putting this in context. This makes the NYPD the third largest budget out of all of the city agencies. So the five point, six billion dollar operating budget is the third largest behind the Department of Education and the Department of Social Services. If you add in those central expenses, it's still the third largest, but it's 11.1% of the city budget, instead of five point, seven percent of the city budget. One important thing to note is that the Department of Social Services budget does include a required six billion dollar Medicaid contribution and beat on the part of the city. So if you take that out than that, NYPD moves into second place and the breakdown of the NYPD budget is as follows. You can see on the left-hand side. These are some of the general categories that you know. Spending can be categorized into on the NYPD's operating budget, so not including those central expenses, and you can see the biggest one 27 percent about 1.6 billion dollars is on patrol. So this includes you know all of your cops that are on the beat. It also includes all the general emergency response and management that goes on in the agency, and this is where the bulk of your police officers that are uniformed sit in the agency next comes administration and communications, so this is all of the admin side for the agency, as well as their 911 response team, and the third is the chief of Department. So this is the department that's responsible, with coordinating between all of the different bureaus at the NYPD, but also the reason why their budget is so large is because that's where pretty much all of the agencies- overtime, as well as their other sorts of supplemental pay sit and they are budgeted out from that department and the NYPD has a particularly notable high over time which we'll go into later, and then you could see some of their other functions and bureaus. So you could see they did but detective bureau they do. They have their transit and transportation police there's school safety agents as well as spending on counterterrorism. A lot of that is federally funded, so you can see, on the right hand, side where their funding breaks to the funding breakdown about 92% is city funded, and then you have a six percent. That's federally funded, and this is mostly for counterterrorism as well as there's some security grants like reimbursement for the police officers at the UN. For example, if you look at how many people did NYPD employees, it's a bit, it's about 54,000 in 2020, about 36,000 of those or uniformed employees, and seventeen thousand of those are civilian employees, and the civilian employees include things like the school safety agents, as well as traffic enforcement agents that eat see in the street. And then, if you look at the average pay for these employees, you could see that the uniformed pay is higher than the civilian pay. So police officers are compensated by an average 90,000 dollars in 2019, and the breakdown of that is about sixty eight thousand dollars in like salaried pay. And then you have eleven thousand dollars in overtime and another 11 thousand dollars in other pay, which includes like assignment differentials at holiday, pay and other different types of supplemental pay that are provided. You could see that pay goes as high as one hundred and ninety thousand dollars for a captain and on the lower end for administrative aides or at least communication of technicians and, like I, said earlier. One of the reasons why police officers and uniformed employees at the NYPD are you know, have such high average pay is because of the overtime and the NYPD has a particularly high overtime budget, the uniformed overtime budget of about five hundred million dollars. It represents about 52 percent of what the city spends overall and uniformed over time. So that includes agencies like the fire department or the department Corrections or the Department of Sanitation, which also have uniformed employees. The city has also added a number of positions at the NYPD, so you could see they've added about 1749 civilians since 2010 and 1,500 uniformed employees since 2010 as well. The notable expansion was in 2015 when the City Council on the mayor agreed to hire a thousand three hundred police officers, and most of these were targeted at the community policing initiative, as well as some of them for the counterterrorism response and over the course of the entire period. That represents growth of 6.5%, and then you know, because most of the NYPD's budget is driven by personnel service costs. So you know labor related costs and such you can see that this would have an effect on their overall spending levels. So between the same period, 2010 and 2020, the operating budget grew by 1.2 billion dollars and those centrally allocated expenses by 1.6 billion dollars. So you could see the biggest change was for administration as well as patrol and then on the central side. Most of those were for fringe benefits, but also a substantial check for chunk for pensions, and that's all I have and I'm very willing to take questions that you may have about the budget, but I thought that would be a good overview, I'm happy to go through any of the slides again. If anyone has questions and then also I'll turn to on to see if she has anything else to add, but some of the budget Basics online way, PD thanks, Adrienne I, don't have very much to add I, think yeah I think he did an excellent job sort of discussing the general contours of the budget and how it fits into the city's overall spending. I had done a piece. It was really unrelated to the discussion that has been going on about police funding more recently, but was really focused on the city's fiscal crisis is probably well aware. Revenues have come in much more much lower than expected, given the economic crisis and the pandemic, and so we at CBC did a report looking at sort of what we would recommend as the way for the city to close the budget gap, and we have a framework that was developed by Charles pressure, a research staff. More generally, it says you really want like when you're making these choices, because these are big gaps to fill, and so you have to make choices between what are generally unpleasant options and so that what should be guiding those decisions is minimizing impacts, negative impacts on New Yorkers, especially on disadvantaged communities, that you want to preserve the city's competitiveness and its attractiveness as a place to live as a place to locate your business and that you don't want to burden future generations so that we really we've been very staunch in a position that any long-term borrowing could really be the last resort option. And so we put together a package called hard choices and it has a number of options. One of them was in fact related to the NYPD. He had started this prior to the discussions, partly because, as Adrian mentioned, there's been an increase in headcount across the city and something that we've been very concerned about that. You know you have a lot of new hiring. You have a lot of expansion of programs and services being provided and much less focused on improving the efficiency and effectiveness of government, and so the largest piece of the recommendation is the pot city count by nine thousand positions, and in that we identified the NYPD is one specific is where one specific agency were. It would be possible through attrition in terms of you know, police officers who retire and through reductions in the incoming academy, pass to reduce the police force and generate some budgetary savings. So it wasn't really in terms of but defunding the police discussion as much as it was in terms of fiscal management of the city and addressing the fiscal crisis, but for context. Each class is about like five hundred and seventy five cadets and we estimated what you would what the savings be. If the city did not hire. One class did not run one class next year in one class, the following year to 21 and 22, and the savings are about 57 million in the first year and then they hundred the second year- and they do increase over time. Because the things to know about police salaries is they start pretty low in year, one in the first five and a half years, and then there's a very substantial jump in the base in their base. Pay from five and a half years for a police officer, and so suspending a class saves you fifty seven, fifty seven million dollars in the first year, but by the time they reach full salary, you're looking at something that's substantially higher than that. So it wasn't actually a very large part of the savings in terms of dollar terms, but we thought, given the growth in headcount, specifically the decision growing, the de Blasio administration to expand the uniformed police force. This was one place where there could be a rollback of the size of the force without unduly impacting the service that they're providing yeah, but I think it would be best if we you know if there are questions and Adrienne can go for anything else, that he whenever we can explain anything else, that people have questions about. Thank you so much Anna and agent and those reports we can. We will circulate after to all the committee members I'm looking at everyone. Could you raise your hand if you have questions? Rachel sorry was on meeting and thanks for the presentation, I thought the stat you had on the distribution between city and federal / state funding was really helpful, so 92% of NYPD's funded by the city, wondering if you have the same kind of stats for the other agencies, you showed in one of the first few slides I. Don't have them offhand, but I could tell you that it depends agency by agency quite substantially. So, for example, the Department of Education relies a lot more on state funding. You know, for example, the expansion of universal pre-k was done largely through the help of state funding, because the city wouldn't be able to afford that on its own. So it definitely does vary by Department by agency quite substantially, with some agencies like the NYPD being mostly city funded, whereas others like dia, we relying more on state funding and then social services also, unlike us, the federal and state money as well yeah I'm, just wondering because obviously like Fenway PD is mostly funded by the city and I. Imagine that some other agencies may be seem smaller, because they're funded for from federal, phosphate funding, so I just think it's helpful. Thank you. So, overall about 68% of the city's budget comes from tax revenues it another five percent comes from the fees and fines. So it's about three quarters is from that and then the state contributes 15 percent of it. So they're really not a large part. They really are concentrated in very specific functional areas and services. So, as Adrian said, most of the state funding is for education, and then there is some for health and social services and similarly the federal social services and Community Development. So if you look at agencies that have substantial federal funding, it will be agencies like administration for Children Services, the Department of Social Services, the housing preservation and development agency, and other agencies like sanitation, fire police, tend to be primarily funded by City dollars. Thank you, I know. Zak. Do you have a question yeah thanks right in an Asian. Thank you for the presentation that was really helpful on just to Questor small question: do you know how the number of uniformed and civilian officers, as well as the New York City police budget, compared to that of other comparable cities, whether it be San, Francisco, LA, Chicago, on a per capita basis? You know so I looked at this I. Don't have the numbers in front of me generally. This New York City has a higher uniformed police force per capita than most other municipalities. I, don't know that it is true for everyone. Other cities, like DC, tend to have large, relatively high force as well. I can find a sources and send that around to you or I, think I have an internal I have a table internally that we could share in terms of funding. That's always a little bit harder to get, because you can look at per capita funding, which is probably the best way to do it. So what you're? Spending on police services per person and New York is high. I looked at I think maybe 10 or 15 large cities using some data set that allows for comparisons and New York was in the top third, but it wasn't. The highest cities, like you see in some of the cities in California, were a little bit higher, but New York City does have its expensive spending on the police force No. Thank you. Thank you. Anna Mary I saw you had your hand up Thanks. That was such a great presentation. Those of us who are old enough to remember back when the PBA really screwed incoming classes of cadets in terms of just slicing the entry-level salaries that these men and women get. Could you give us more data on that? Just that my worry is there's this push obviously, and I more than anyone want to see more investment in housing homelessness. So many other things. I worry that we're gonna lose if it's the sort of lastin first-out scenario that we're going to lose. What diversity has been built up over the last say, five or seven years so I, don't know if the budget Commission looks at that like there was a big push and lots of information came out about how much more diverse the more recent classes are, and my worry is that if we go all out and start cutting just into NYPD instead of just threatened and through easing back on the new classes, we're really gonna lose what diversity they've managed to build up recently. Well. I can definitely understand the concern because you're right that, if you are, if you are doing any kind of reduction, if you went to the point where you were actually trying to produce your current employment level, you would be required under union to really start with the most recent hires. And that's partly why, when we were thinking about our framework, we were trying to figure out what you could do just through attrition without doing any kind of layoffs. So in that case you're most likely relying you know in terms of the uniformed police force, they tend to have a slightly lower turnover rate and most in the city as a whole, especially in police. There's I think once you know they're past that first five years, most of them will stay and the rate of resignation is very low and most of your turnover is coming due to folks who are retiring at the end of the careers. So that would go in the opposite direction right because you would be if you're, relying on a church and you're gonna be relying on the outflow through retirements. Whether or not you know that the PBA often argues that other forces in the surrounding area pay better Nassau, County, Police, Suffolk County, the MTA, the Port Authority police is up in Westchester. So if there is some move by younger police officers to go to those areas as a result of all of the discussion could be a factor to keep in mind. But you are, if we're eliminating new classes, then you are in fact going to have some I don't have data on a breakdown. A city does publish some information through the Department of Administrative Services that describes the workforce, including gender and race and so forth. So that might have some information and you are definitely right. Even the most recent contract, where there was an additional neighborhood policing, included a reduction in the salary schedules for new employees as a way to do, you know not have to cut the benefits of the current staff, so those I have those somewhere here. If anyone is interested sort of at what their salary scale is and how it goes hire. A new police officer starts at forty two thousand five hundred and that stays at fifty one thousand unfilled air and about five just before five and a half years and after that is when it jumps to over eighty five thousand, it's very slow and any of this big dog, and that's done partly. For that reason, Thank You July, you had a question. Thank you. Yes, thank you for giving a presentation very informative, I'm wondering if you guys, you probably have much better angus than you than I. Do how much? First of all, how much does the city spent citywide pensions benefits? Is there a number for the 2020 and I guess the continuation of that question is if the city becomes bankrupt, what happens to the pension contributions? The city makes an annual contribution of roughly ten billion dollars for pensions, and it has it does meet, it's actually required contribution, so it contributes. The amount of the actuary says they need to the funds are between sixty and seventy five percent funded there. Five different pension funds in the city I think the overall is somewhere around. Seventy four percent and the city has been working towards increasing that and trying to reach full funding I think by 2034. It is a substantial investment. I, don't so I mean I, wouldn't think about I. Don't think that there's a particular risk of the city becoming bankrupt per se I think the city is in a much better. Position has had a lot of very stringent rules regarding how it manages its budgets and its finances following the crisis in the 1970s and so well. I think this is a really big crisis and there is no belt-tightening. That's going to be done in it is likely to be painful and it is likely to require reductions in services of programs that you know many people use I, don't think it's gonna go to that benefit, but the funds are, you know they are pretty well. I did not well as the state not as well as some other places, but not as poorly some of the funds that have suffered real. Thank you and another question. It's I can't seem to understand hoping that you can educate me. It seems that the state only found less than 2% towards the PD. So why was the governor saying about a week ago? If your city cannot figure out what kind of reform we want in our policing, then we won't get money from the state. What would be the significance of that? It was less than 2%. I believe that what the governor was referring to was not just state funding related the police, but all state funding, so I think the threat was an education aid, other aid as a way but general. It's not a large area of spending for the state. Most of the state aid to localities is right and thank you Tristan. You had your hand up hi there. Could you maybe speak a little bit about the methodology used to calculate the pensions and how you know uses the later years and options career or like the peak years and how overtime plays a role in establishing what the pension is and then, if you could also loop in, if you have any data, how over time usage changes from like a more junior officer to a more senior officer? If you're aware of any things like that, okay I mean I can talk about the pension side, I think Adrienne has been in the payroll data more recently. So maybe he can talk about the trends and overtime usage. It's so the pension is done based on the highest years and overturning earnings are pensionable for the NYPD. So the salary- that's used, it's a final average salary in New, York averaging it over a number of years. It does include that you're getting an overtime there is when the when the actuary does the estimate of how much funding is needed in order to set aside. Excuse me sufficient resources. They do include estimates, for you know what the salaries are. Salary increases are generally through collective bargaining and then also for over time and I think they assume they have a pretty high assumption there about the amount of overtime earnings, and so those are definitely contributing to the fact that NYPD pensions are more costly than many of the other, the civilian employees they do. Also NYPD officers can retire earlier in their careers and so forth. So the last set of pension reforms that the state implemented for themselves and for other localities I did put a cap on overtime. It can be that could be considered pensionable for police force outside of the city. So those are some of the types of reforms that we've called about the it without a doubt, New York, City benefits for uniform force are generally much more generous than those surrounding or in other forces in terms of providing health care benefits. So if you retire from the city with ten years of service, you get lifetime health insurance with at this point no premium sharing, and that has contributed to an incredibly large liability and expenditure from liability. That's not funded unlike pensions and an annual expenditure, and so those are some areas, and that was another part of our recommendation was that there should be some premium sharing on health insurance, both for active and retired he's it wasn't specific to the NYPD. This is, you know, would be done citywide. It is definitely a large cost. I haven't actually looked into the relationship between, say how long an officer has been working at the NYPD and how much overtime they get, but based on the data. That is something that I could definitely take a look at and share any results with you if I find any one thing that is I guess useful to know. Is that a lot of this like over time, another pay that the police officers do get. They are related to various like events that are going on in the city, such as the parades and stuff. Like that, a lot of the times the police department will be deployed to those and that's where they start accruing a lot of these other sorts of pay in addition to their salary, Thank You Jamie. Do you have your hand up? Yes, my question was twofold. First, you know has how many police officers are there? You know for a given population of 100 New Yorkers, and how is that change from 2010 to 2020 is not the same, because I'm wondering if this growth is largely because the population simply grew in the past 10 years and also. Secondly, budget-wise: is you know? As a you know, the New York City budget grows over times on an annual basis, like is this growth proportionate to the growth in the overall budget? Or is this thing of a queen like out of proportion to -? That's growth, I guess, on the per capita basis, there hasn't been much of a change, because the police force has increased by think it was about six percent, but the citywide population between 2010 and 2010 2020 hasn't changed very much at all. I think the three is something around 1% and you know both in 2010 and currently we're at about eight point: three million people so I think on the per capita rate. There hasn't been a whole lot of movement, so I'm not sure that that's the only thing that could explain the growth in the police force on the budget side, I think the growth rates have been pretty comparable when I, when I, remember and I was looking at them. If anything, the operating budget growth has been a slightly slower than the city wised overall growth rate, whereas the benefits the fringe benefits and the pensions have been growing at the same rate, so they haven't deviated substantially between overall growth rates, citywide Thank You Joseph. Did you have your hand? Yes, thank you. Yeah I want a second and third everybody Thank You Donna. This is incredibly, we couldn't have this conversation so well without you, I have a few questions. I guess the first one is I've been. You know, I know you're not really focused on the conversation about cutting the NYPD budget or looking at alternative sources, kind of alternative plans for Public Safety and trying to balance those priorities. But you know, but you know that's one of the things I'm thinking about and I'm looking at that, one of the biggest limiting factors for a lot of advocates seems to be union contracts. I know that, like Scott strainers office proposed just a 1 billion dollar cut over four years. Some advocates, including you know, the City Council Speaker I'm, called for 1 billion dollars per year in reductions to the budget. For the next four years, but if Scott stringer was saying that would be almost impossible without a significant reduction in headcount, you know even beyond reducing through attrition right and canceling the next class of Cadets. So I guess one thing that I don't really understand, and if you have some background on it, I'd love to hear is just you know: how does the negotiation process work between the city and the police union? Are there? Opportunities that come up to you know, make it easier for the city to make decisions about headcount just like they do with other agencies and I guess. A final question is that I've read that the NYPD budget compared with other city agencies, is significantly less transparent and that's been one of the challenges that advocates have cited and trying to oversee the NYPD and oversee their fiscal process. You know I wanted to put that to you, since you look at budgets from a lot of agencies. Is that is that true, that it's less transparent, it's more opaque? And what do you think about that I can handle transparency first yeah I mean the city provides a lot of it and when I started like every once and again, I need to find out about other cities and then I realized how much the city provides, but it is still really difficult to get in and really understand the spending. So, for example, when Adrian was talking about overtime, there's really there's like one line in the budget that holds almost all of the uniformed overtime and so looking at the won't. Let you see if the overtime spending is for events for counterterrorism for the detective bureau or which precincts are generating the most of that over time, etc. So that kind of really understanding is it's hard to do, and there is also I think there's have been some recent laws passed by the City Council on this, the dark certain things. If you like, look at not they're, the Comptroller provides all of the spending it on the city and you can get an incredible amount. It's not uncommon for NYPD information who have been suppressed or deemed confidential for security reasons and stuff. So sometimes that is also added, but you know it's because of the amount of detail the city doesn't really have program, but it's in the way that one might think about where it's easy to go and say you know, I want know how much you spend on neighborhood, policing or I want to know what you're spending on like it's. It can be sort of deep in the in the detail and you need someone who really knows it and the city is also they provide a lot of information about the upcoming, but the data on actual spending is a lot less granular, and so that's the other reason that can be somewhat difficult. So those are some of the challenges it's there's probably more than in most cities, but it's still very limiting for the kinds of questions. The answer in terms of headcount it usually the size of the forces generally determined through specifically through the accounts and negotiation in the budget adoption. So there was a specific agreement and I think 2015 to increase the force by a certain amount and the uniform force has been pretty steady since then. So the unlike other agencies, they're not really moving that number every single year. In most cases the city isn't engaging and the city isn't really engaging in layoffs. It's they're cutting headcount in many agencies or stuff, it's usually through attrition or moving people around, and so you know, I think that's just part of the general way that the city has worked has been through, and the separation rate is something like 7 percent. So there is a lot of turnover within the city's workforce. We might not think about. We know a lot of folks. There is a fair amount of churn and that's usually what the city has been relying on in terms of increasing or decreasing or by slowing hiring, even, for example, the reductions that are proposed Department of Corrections, as they start closing facilities on Rikers those have all been through attrition and so you're managing it by letting more people leave and you bring in and so forth. So that tends to be the way labor negotiations with the PBA in the city are difficult and generally a lot of times those end up in arbitration, which is where they are now I. Don't believe. That's where that's not where the discussion is about the size of the force. That's about all of the other work rules and salary and other benefits thanks Anna I have a quick question: are the overtime amounts consistent from year to year, or you know, if you're saying they're sparked by events or at certain circumstances, but are they consistent from year to year such that you know, you could plan for a certain amount that you see year on year of activity, I mean they're generally sort of in the same ballpark I mean you know, around 500 million dollars for uniform to overtime at the police department is sort of. You know how it has been for the past few years, but they definitely do fluctuate year to year, sometimes they're up there that higher than budgeted as I think they were last year. So you know there is some variability and I think ahna. You looked at the change from the budget last year and there was a decent change. I think what I remember and I, you're, muted, generally overtime costs, are underestimated and then adjusted over sorry adjusted overtime. So this isn't only in the NYPD, but it is pretty common that you know that they underestimate. We've been critical of them for that, because it makes spending look smaller and they know that it's going to be higher. They did try. The city started to implement caps on overtime at some of the uniformed agencies, which is really the majority like three quarters of the city's overtime, the four agencies that Adrian mentioned and the NYPD as if growth has been a little bit slower, I think and there's been definitely a little bit more control in the last year. The last couple years than there had been before, but the thing to know is every time there's a salary increase. That means the cost of each overtime. An hour goes up the same way. The cost of each hour goes out, and so that is part of what is going to drive. The increase from year to year is salaries thanks, Donna Joseph I see your have your hand up again. Yeah thanks, I realized I've got a question for the presenters. One of the things I noticed on the slide was that you know part of the overall picture. Spending is also I. Guess you would call it like city funded payouts from civil suits against police officers in the New York Police Department I was I was surprised that the money that the city pays out doesn't come from the NYPD budget, but I'm curious to hear whether that's just standard. You know an individual sues, the department transportation for some reason, is it the same. Like does the money that they win just come out of this general city fund rather than from the D-O-T budget, or is this something unique to NYPD? No that's standard across none of the cities make that I mean out of their budget. It is all done centrally it used to be. There used to be a point where that allocation that the central costs, including fringe and pensions, there used to be an allocation for judgments and claims. So you could see the city is not doing that. The controller doesn't annual claims reports about which agency ISM are generating, what kinds of pets etc and the except in the amount that the city budgets for that centrally thanks and does the budget for that come from? Is that like an operating expense, and is there an amount that the city designates for that, because it seems difficult to predict I guess like who's in charge of over overseeing that or approving pay outs? Is that just the legal department Department and the Comptroller I'm, not as yes, I me and the Comptroller instituted something at the beginning when he came into office and I think costs down I want to say the total is somewhere in the neighborhood of 700 million was released recently for festival, 19 and there's a budget line they're doing this based on friends, so I think you know they have an assumption based on what in most years and then, if they're, exceptionally large payouts coming it would make during the year, and sometimes that is what happens that you have like some long-standing litigation that gets just for some context. Like honest said, the claims report didn't come out because, a week ago, or something like that and in 2019 the NYPD paid out two hundred and twenty million dollars in claims and that's across about $6,000 six thousand. You said six, how many suits six thousand okay? Thank you. Thank you. So much just a quick question. You mentioned that 5% of the budget comes from fines. Is that NYPD fines do be fine and you're talking about the budget generally I think when you give us the overview on it, is that every agency's fines and enforcement, or it was that specifically NYPD? No, it's everything it's and it's not just all sorts of money that is coming in. You have interesting cities. You don't have interesting, but sometimes you know there used to be a little bit of that. One banks are paying such things, and so all of that is in one and that's the total I, don't know what amount NYPD generates. Thank you. Zack your hand is up thanks, Rene, just one question: I'm, not sure the extent to which you would know this, but so the City Council is obviously thrown out a 1 billion dollar annual cut from NYPD budget. If that goes through, how is that practically enacted like who decides? How does anyone stop the police union from cutting areas that shouldn't be cut just to preserve jobs, which are clearly the you know, the biggest reason for blow in the NYPD budget? So in a normal year this is not a normal year. The mayor and the council would come to an agreement and negotiate and I would include kutsu within each agency. You have what are called units of appropriation, and these are pretty large they're supposed to be somewhat programmatic, they're, not exactly they're, pretty large buckets of spending. That is the level at which the council appropriate, and so they can say you know this unit of appropriation, which might be something like administration or executive administration at NYPD is going to have this budget, and so the city can make some they can move up to like 5% within an agency across these different groupings, to make movement any greater than that they need to go back to the council. So the Charter and the budget process have some limitations on how much you could so like a school safety stuff, for example, is its own unit of appropriation. So if there was a decision made or an agreement made to move that funding out and move it to another agency, you would reduce that unit of appropriation and they couldn't then dust. You know it around or something so that there are some rules and limits on how much flexibility the mayor has he does have. There are other powers and abilities to manage the council appropriate, since that's the budget, the responsibility to administer and manage it during the year in the Charter is in the executive branch mariya. Thank you, I'm. Looking to see if we have any more hands raised for Anna and Adrian who I want to thank again, you have been phenomenal in helping us understand this issue. Does anyone else on the committee have any more questions for Adrian and Anna and looking for hands and I'm, seeing none I'm going to go to the attendees to see if we have any questions from the attendees if they could indicate via a raised hand, I just want to mention that if you're joining us from a phone, you can press star 9 to raise your hand, otherwise you'll find the raise hand button in the center of the screen. I don't see any raised hands from our attendees. Luke am I missing. Anyone I just want to be sure it sounds like you're, correct. Okay, any more questions for Anna and Adrian I have to thank the both of you very much for answering all of our questions. I know it was a lot and I really appreciate your patience and answering everything so fully. So thank you both. What we'll do now is turn to the committee for our two-hour conversation about the NYPD, using what we've learned tonight to think about the resolution that we want to put together for our next meeting about the principles for CB 5, so who would like to kick off with their thoughts their conversation, their comments? Okay, no one! No one has any thoughts about. Does anyone have any thoughts? I will I will start off the conversation? Are there any agencies that we think at this point might be better served? We've all received the tea any principles that tme informally adopted last night? Are there agencies like ta? Do we agree with those principles? Is you know? Is that something that we agree with, that there are agencies that might be better served outside to be put outside of the NYPD July I just noticed: oh yeah, sorry, okay, Thank, You, Renee, I, just I guess they want to start up the discussion by asking what would be the purpose of us getting a resolution together, because the city budget is going to be finalized by July 1? That is a week from today and seeing the trend of how things are evolving, how rapidly things are evolving I, don't know how much of our input can be appreciated. What we're talking about is a statement of principles and a resolution moving forward CBI's position on perhaps alternative policing and you're correct that the city budget is going to be decided in the next week and we've already weighed in we've, provided our position on cuts that we'd like to see made at the NYPD some of the programs that we would like to ensure continue. So for this budget period. You are correct, it's going to be finalized within the next week and the budget will come out, but we're moving forward, that the community board the budget process for the community board and our ability to weigh in on it doesn't stop once the budget is adopted. We are moving into the next year. 2022 right. Thank you. That's awesome. I have a comment in a response to your question. Yeah I did take a look at the statement released from the T&E committee and I thought. It was great I fully support. It. I mean it's obviously related to what we're talking about here. You know not exactly but I feel, like you know our committee in their committee. You know it seems like we don't have the same mindset overall about. You know how we see the in my tea in what you need, potentially changing and I. Guess some. You know my thoughts about the discussion about kind of like what we might want to fund instead of certain components of NYPD, because I know that's kind of where we're going in one way. I found I found the article useful from the city and state that Renee sent out. It was about alternative public safety strategies and it you know you don't have a good way now, but it kind of categorized these items and three buckets that I thought were helpful. You know one of them was mental health response, which is currently you know a major responsibility of the police department which I have to say they don't even really like the president of the PBA, has actually said like they don't feel like they can help New Yorkers experiencing mental health crises because of underfunding from other mental health, related programs and housing programs a second bucket with school safety. So there been a lot of advocates you know within and outside of the do-e talking about. You know potentially moving safety officers from NYPD to Department of Education, and then there was homeless outreach, which you know it's kind of related, obviously to the mental health bucket, but I think it's more talking about. You know: funding outreach teams and Department of homeless services programs and funding housing. You know at instead of increased patrols, especially in places where homeless individuals tend to congregate, like the transit system, kind of especially in parts of Midtown, Port Authority, so yeah just wanted to offer that Thank, You Joseph does anyone else have a view of this? Does anybody else think that those budgets should not be with the NYPD or they should be with the NYPD, and why Zach I completely agree? I've thought a lot of now. It kind of our last discussion and actually I've changed my position on whether I agree with a larger or smaller cuts of the NYPD Oh gentlemen sigh after reading. More and thinking more about it, I do agree with a larger cut and I completely agree that there's areas of there's areas of responsibility, this fall into the NYPD's lap that they are you know completely unfit for, and it's not necessarily their faults. You know they're not trained to be mental health professionals or to deal with the homeless or all sorts of other issues that they are forced to kind of handle on a day-to-day basis, and so I think all the areas that Joseph mentioned are some perfectly appropriate for increased funding. If you know, if that you know whatever as a replacement for whatever is cut from the NYPD budget, right I think that we need to recognize that what we're talking about and I think Anna would agree with me. We're talking about deficits, so it's more a question of cuts rather than actual adding to it to any budgets and I. Think all the issue of what belongs or what should be in the NYPD's buckets if you will is inextricably linked to budget, but it also can be divested of that. You know budget conversation and we talk and we can talk about what we think just philosophically, as T&E has done about where we think these things should be, and it could be almost divorced from the budget and then we can bring the budget back in as we look at it going forward through the year. Does that make sense to people I'm Tristan I saw you had your hand up all right, sorry that makes sense to me. My thoughts were more related to like the NYPD budget and areas to improve that. But that's a good path by word, I think talk about ideas and things that could be stripped away or reallocated. Does anybody else have Lukas hi? Can you hear me I can mm-hmm, okay, great, so I just have a question more generally about the actual document that we'll be producing on the principles, as you mentioned, because, like you said, we are talking about a deficit, so I just wanted a little bit more clarity in terms of you know, are we just saying we support cutting the NYPD budget, and these are ways that we could do it and sort of leaving it at that or are we saying you would like budgets be cut, and this is how we want that money that could have gone to them? My PD, you know what I mean right, so I think what I'm saying and we can we can debate this. But what I'm saying right now is, we should be talking. We are gonna, have the opportunity this full year now is we're gonna start the budget again. The budget conversations on July, 1st and the community board has a whole period of time an entire year where we are now going to do borough, consultations with different agencies and then we're gonna put in our budget request, and then we have agency consultations a whole bunch of times. We have the opportunity to weigh in on the budget very specifically what we're talking about now and it is linked, I understand to the budget and the deficits and the cuts, but we are talking about, is more in line with what T&E has done, which is principles guiding how we think about NYPD funding and NYPD responsibilities. So in other words, it's more about. Do we think that enforcement traffic enforcement and bicycle violations is that is that enforcement, something that belongs with the NYPD or, as a committee, do we believe that this is something that could be better served by another agency by perhaps the Department of Transportation who promulgates the rules that govern bicycling I want to have the conversation about that and see what you think about that. Does that answer your question? Lucas? Yes, I got it! Thank you! Okay! July! You your hand is up again, I want to say, I, agree in principle with what Joseph and the sack we're talking about in the three areas, its fullness mental illness and exclusivity, to have to NYPD the police officers, nothing loth, but have other more appropriate or relevant. We trained service providers to be logged now, I'm, not sure CI. I can only agree on that. Principal role provided that the overall had come for NYPD is not reduced in any meaningful way and I. Don't know if I, don't believe police officers are assigned permanently to do one type of job, meaning I, don't believe any given police officer is assigned to conduct outreach to illuminate old people or to the homeless population, or to do the specific control, so I think figuring. That part out would be very challenging. I think Public Safety. It is so important, I think more so important. Now then think of it, whether it has to do with people violating social distancing rules, the state law of a mask in public when you're, not it was maintained, so she did social distancing or when it relates to business, closed temporarily and opportunities present themselves for people who want to you know, take what don't belong to them, and just public safety as a female signifying resident I would not feel safe with you police officers in the street. So yes, I agree with the principle on the three areas that we can look into: transitioning them on to other. Better training personnel, but I cannot support any meaningful cut police. Thank you for that. July Joe, I, see your hand is raised. You have a comment. Yes, so I mean I, guess we're discussing the police department today and we're talking about taking out the certain enforcement actions that the police don't do well and they probably shouldn't be doing, but in terms of the budget I, don't think we're saying that these items should not have enforcement. They should be moved to an to another agency or another body. Therefore, is this a exists? A budget neutral we're not suggesting cuts to the budget, we're not testing less enforcement, we're just moving it from one agency to another. So on you in terms of the overall New York City budget, we're not recommending a cut. What I would say to that Joe is that we have recommended parodying cuts in our recent letter regarding the NYPD and then, but going forward. I think we need to figure out where we stand. Philosophically do we believe certain functions belong with the NYPD, and that is wrapped up right. That's part and parcel of what we think the budget may or may not be with NYPD, but I. Think first and foremost, we have to understand is the committee: what are you know as T&E put down what our guiding principles where we stand on the issue of policing? Are we? Oh, you know if we are okay with the police department being in charge of all the areas that they are in charge of all the buckets. As Joseph said. If we are happy that they continue to be in schools continue to handle mental health issues, then that's one thing and we might think that there should be a reduction if we don't believe that, then that would indicate a different reduction or recommendation right. So I think our principles need to be defined first and that's what this conversation is about and that sort of drives and they're bound up together is that well and overall, philosophically I would agree that certain things should be taken away from the police department, because they're probably not well equipped and they're inclined to use force and handcuffs versus. You know what's necessary in a circumstance, but it should not only be it. We should not limit it to teeny. We should. There are other enforcement things that should not be in the police department's ballot works such as social distancing, a lot of quality of life, stuff I would I would venture to guess it should not be in there Valley, which I would agree with you and I would say that we are not talking about lack of enforcement I'd. This conversation is not about abdicating any enforcement of things like social distancing or any of the things that the police provide right. Now, it's sort of figuring out where it would best lie. Those functions would best lie. Let me see who else has a position on this Sam yeah? So I guess you know I'm aware that there are a number of parts of the NYPD that consists of synthetic units. You know that put together mental health workers and police I think there's a group called the core response teams and there have been a number of efforts to try to soften the approach of the NYPD to emotionally disturbed people and folks of that of that ilk and I. Wonder if there's any information available on how effective that effort has been and whether some things that combine police enforcement with social services or mental health services are actually achieving any success currently in the current climate, because I guess, from my point of view, is the interface between NYPD and emotionally disturbed people or people that are in crisis. When folks make a decision about how much force they have to use to control the situation that we get into a lot of trouble and so I'm wondering if the efforts at providing a broader range of possible outcomes have had any success. I don't have the answer to that question and I. Think one of the things that this conversation is going to raise is both philosophically, where we stand, but also raise some of the questions that need to be answered before we can come to a definitive position, and that's certainly one of the questions right I mean because one of the things that you know that really struck me over the last few months is you know you know, you know my wife works runs. Mental health clinics and I know she's. Had some contact with these corresponds teams, but they still show up in NYPD, Blue right and so even emotionally disturbed people respond to the uniform more than they respond to the role you know. So, in other words, everybody shows up and they all look like police, but some of them may have different training and I guess for me, I'm curious to see how the PD has worked to provide a more you know, synthetic kind of service that might respond in more ways than just brute force to control the situation. Right, I think that's something that our police, our public safety silo, needs to. Research, as we start to draft a resolution to understand you know, is some of the community outreach that I think that I heard Anna stay. Some of the new recruits were community outreach personnel, how that's been effective or not effective and I think maybe the Comptroller's. But recent report speaks to this as well. So that's some of the research that obviously we need to know, as a committee I think, a good, a good question that needs to be answered. July two points that I want to add. One is that Renee I don't know the timing of this resolution that we're drafting I don't know if it's we're, gonna wait, and so we've got an opportunity to go through most other city agencies or it's the resolution just for the PD. If it's the letter just for the PD, then I want to emphasize that we're not calling if the comedian's of the green was reassigning some of the PDS responsibilities we're not calling to default. The police I think there's a lot of you know calling for that. Among some of our elected officials and I, don't want our efforts or you know actually carefully looking at where to see, spend taxpayer dollars and where the spending has been affected. Was it's not effective? I, don't want that effort to get lost in the political noise, so I think our resolution should be focused on how to best spend tax dollars rather than calling for a marketing LAPD right. My point number 122 is I would like to add a fourth category, to possibly move away from PD's responsibility to other person else, and that is security for our elected officials and your family members. Okay, thank you, I think, I. Think July I, don't think that we're talking about defunding I mean I. Think that could be very loaded. You know defunding suggests. Perhaps we don't want any funding at all for the NYPD and I. Don't think that's our conversation at all I think we're talking about cuts so and I think you're. We have a deficit, so we're talking about cuts across all agencies. So, to the extent that we're talking about this, it's not a defunding situation and I. Think as we talked about looking at other agencies that might take on tasks that are now being done by the NYPD it that's the resolution, we don't have to come up with all the solutions I mean if we could come up with all the solutions. We'd all be running multi-million dollar companies right. We. What we need to do is sort of think about where we stand and what potential solutions and what we believe is best for our community and those would be our principles, the details, the granular details can be worked out later. But if we, if you look at the tne proposal and their set of principles, if we could craft something similar to sort of guide our conversations and guide our budget considerations going forward, that would be most helpful. Looting. Oh yeah, Mary Brosnahan had her hand raised, there's some technical difficulties, so she's gonna raise her hand physically, okay, I'm, so sorry Mary go ahead. That's okay! I'm, not sure why my it's messed up on my side. I just want to say unequivocally that I just think the NYPD should get out of the business of homeless outreach, and it goes further than that. I just well. People were speaking. I was looking up. Bowery residents. Community has one of the largest contracts to do quote, unquote outreach. It has had two audits in a row, one by the State Controller and one by the MTA inspector and both were scathing, and yet the city just gave them an increased contract. Sixty-Eight million dollars to do outreach. It's just it's lunacy that we are throwing this much money at an approach that we know doesn't work. We have to look at the front end of the shelter system and what are we out reaching? What are we bringing people to when we say that we're doing outreach? The other point that I, just can't stress enough, is right. Before this pandemic hit, Andrew Cuomo announced that he was hiring 500 additional MTA officers to go on the trains essentially to roust homeless people, so I just feel that law enforcement has overreached on this and I have no trouble just putting it out there. That I think that, whether it's MTA Police or NYPD, they should not be in the business of doing outreach unless somebody is of imminent harm to themselves or the people around them. Thank you, Mary. A very good point and I think that as we as we develop our position, it will help us to look at other issues like the front end of the homeless outreach situation, I seeing anymore Rachel. Do you have your hand raised? I did and now I forget my question. So, can you give me a minute someone, okay, I'll write it down. I can Joseph I, think sternum, yeah, I, guess I wanted to I wanted to kind of add to what Mary was saying was something interesting I just learned about that topic, you know, I do think. I do think. I don't know if this is exactly how you meant to marry, but in terms of like Provo, focusing more on the front end and focusing more on prevention of the issues that are causing the crises on the street that make people feel unsafe and that cause armed officers to go and respond. I was just reading. This wasn't what I was gonna say, but I was just reading that 17 New Yorkers have been killed since 2015 during mental illness related in my PD responses. So like this is important. I mean people die because we have police officers with guns responding to mentally ill people on the street when there are better ways to prevent people from getting in that situation. In the first place, My partner is actually a psychiatrist in a public hospital, and he was telling me that there's a program, that's meant to basically maintain wellness for people who are at risk of having some sort of mental break in the street. It's called act, assertive community treatment and it's a great program. I think most of the funding is from Department of Health, and you know, basically, they have social workers, they have psychiatrist, they visit people in their homes, they make sure they're properly treated diagnosed medicated getting what they need in other ways and then doing that helps them prevent people from being on a street corner in a psychotic episode, and so my partner told me that actually there's a two-year waiting list right now for a new client to be added to the act caseload like someone who's identified as needing those services unless there's a court order, it takes two years. So that's just like one reason why I really agree with Mary. Why I think this is important? You know, I know we're not really getting into the money, but I think I think we can really say that. There's all of these programs out there that do amazing work and then there's housing, which is a whole different subject in terms of helping get people off the street. So we think these things are important and not only that doing more of those things in a lot of cases can help substitute for some things that NYPD does and then, as far as talking about principles, I guess. One thing you said earlier: Mary was about diversity, I hadn't, thought of that. Actually, but it's a good point, I was I was reading that the mayor of Chicago had actually given a statistic. She had looked at that you know for the chicago police force and found that you know the vast majority of their people of color. The work in the department were hired within the last five years. So I wonder if, in a statement of principles, we might factor that in right, you know we'd want if there is some reduction through attrition. If there's shifting of employees, we want the city to be thoughtful about not making sure that the people who are being shifted that functions that are shifted aren't just negatively affecting you know. People of color in the department Renee can I ask one more question: I'm sorry, I'm talking a lot so I guess I, don't know, I want to hear what you think about this. You know. We've talked about kind of functions that might be better served in different agencies, but I mean there are also some things that the City Council and advocates are recommended in terms of changes within NYPD that have budget implications, but that also have like Public Safety implications that, like I, don't know if that's appropriate for our principals. But let me give an example and see what you think like one of them is that it is so hard to fire abusive officers like officers where there have been multiple complaints about excessive use of force. I mean a lot of you have probably heard they don't get fired. They often just get shifted to another part of NYPD or put on like administrative duty they're still making six big years. They still get their pension they're costing the agency a lot of money. The officer who killed Eric Gardner back in 2015. He was on the NYPD pay line for five years, so I think if we're looking for ways to save money and avoid officers losing their jobs, they're doing a really good job. Let's I, don't know, I would support a statement of principles that allows changes like that to be made where we can actually take quick action to fire officers who hurt people, and you know, and then also there is concerns about overtime, that I think Zach and a few others raise that and I also agree with I. Think I think we should look at ways to rein that in and I think that's kind of an internal thing. Apart from you know, shifting functions good point: those are those are all very good points, Joseph and something that I think that we should look out and I'm not saying I just want to be clear, I'm not saying we're not looking at the budget, but that is not the focus given that it's tied up, but we're now moving into the next year. If that makes sense, Rachel, okay, I, remember my question so something that I've been struggling with is the transparency aspect of the actual budget lines, as our presenters were telling us before. So, especially the comment about like overtime pay- and you know- that's potentially kind of ineffective as a budget lines, but like it's hard to know, if you know, because of all of the effects, those coronavirus and everything going on, it's like that is something we can expect a lot less of etc. So I mean it means be kind of dumb to call for like I, don't think we have actual say and saying we want to know like what percent of this is spent on done versus counterterrorism activities, etc. But I think that, like there are probably just because, like activity has gone way down from businesses and concerts and sutter out like there's, probably just like pretty easy places to cut there, I don't know. If anyone knows it's something that the speaker or anyone else has identified specifically or if it's just not. If we just can't really see that in the budget line, as it's in I think is, I think is they indicated. We may not be able to see that, but that's something another question that our public safety silo should investigate before our next before there is any resolution is adopted. Kim there yeah, so I just wanted to chime in and add to you know my endorsement as well about the principles that have been discussed so I completely agree. I think that services like mental health response, school safety and homeless, outreach and support that you know Mary Joseph Sam that entire team here is been speaking adamantly about tonight like it makes sense to divest those activities from then, like you. Thank you, Zach, just a question for you Renee, for as a statement of principles. Can we propose you asking, for you know, proposed having greater transparency in the new and in the NYPD budget? I. Think that's a great idea, I think that's a great idea. I mean what we're moving to really is a resolution I'm calling it principles? What's it's a resolution, sort of outlining our position? So, yes, I, think that's a great idea. Dude does everyone agree, Sam, you're, still, muted yeah, all right there we go so Joseph mentioned the ACT teams and that's another one of those combined units that responds and I think you know you know if we're going to be looking at a deficit which means a budget reduction, perhaps one of the things that we might want to look at is trying to at least protect or continue to study these programs that sort of soft soften the impact of having the police show up for a mental health event or for an emotionally disturbed person, perhaps without uniforms or in other ways that would try to lessen the tension in the situation when the police show up on the scene. You know I can imagine situations with emotionally disturbed people that could go sideways in a pretty short amount of time and at which point there might have to be someone there that could use. You know, force I, guess if you will but I'm, not sure that in those instances, people that are sure that a that are given the authority to use force to control the situation are always the best people to show up. First. Thank you. Okay. Does anyone else, have a comment or any of our attendees have a comment about our conversation? Okay. So what I'm hearing from the committee is that we believe that and the NYPD should divest not be in the business of school safety, transit enforcement, homeless, outreach and potentially security for public officials. Is that generally, what I'm hearing from the committee Mary yeah I, don't know? Who else is going to secure the mayor? School safety I think that there needs to be input from the specific schools. I mean I had the luxury of sending my kid to PS 11, where there was no need to have armed guards there, but I think some of the parents in other neighborhoods may feel strongly one way or the other I. Don't think that there's a cookie cutter solution for that. Thank you, I think. When we're talking about school security I do not believe the majority of there are armed again. This is something that we need to delve in a little bit more closely. Let me see all right, so the security for public officials I have someone who is not in favor of that homeless outreach. We believe that the NYPD generally should not be in the business of that we're looking to ensure that diversity is maintained in any sort of transference and any sort of class reduction that the NYPD would be seeking in terms of budget ideas. What I'm hearing is that we want to remove overtime if we can and remove problematic officers quickly as quickly as possible. Is there any suggestions to start formulating our resolution that I've missed here? Sorry Renee! Yes, in terms of that overtime, I, don't think it's necessarily like removing overtime like I think that people in general, in any field should be entitled to no overtime pay for those extra hours, but I think from the ribs down see clearly in a person yeah, and we just don't know how to make it more efficient, because so the transparency goes to the overtime I understand I actually had that and I misspoke Tristan I would also say, like posting, on the composition of NYPD employees, I think like given the numbers we saw about how the discrepancy in salaries between some of those civilian employees versus the frontline officers, I think we should really drive home the need to hire civilians to do civilian work so wherever possible. If the work is going to be administrative in nature, then we really shouldn't be allocating that towards officers and hiring officers to do that, work which can also help drive down overall cost. Alright, just a question I have for the committee. If we talk about school safety, for example, are we talking about here? Are we happy with the idea of moving school safety and making them the school safety officers under the purview of the do-e unarmed school safety officers? The workers that we have now or is that what we're talking about I just want to be clear or are we talking about something else? In other words, is it just the chain of command or is it you know the people that are working in these positions? Now it's just a transfer of the management of these functions. Joseph, you know I, guess I'm, not I'm, not sure I like getting really granular on that. Okay, I guess my opinion, I guess, I, don't know the school is well enough to know what they want, but I guess my opinion would be that you know we have a shortage of I. Don't think you necessarily need a one-for-one transfer of current school safety officers from NYPD to you know similar officers that are just they just report to the do-e I would doubt that that's the case, because when I, when I heard from advocates is that they feel like there's too many officers in schools and not enough social workers counselors, you know that type of thing. So, in my mind, it's kind of both that's I could transfer. You know for the schools that still need some sort of personnel. That's just focused on security, but maybe also or reduction. Where you know, schools you know can actually use that money for social workers that they think that'll be more effective for the problems they have. Okay, July, just a general comment when Rene, he put all of the points together and read them out loud, transferring the duties and reducing the overtime, and they just think I forgot that it sounds a lot like we are unhide, policing or untie police and I understand we're not trying to say that so I'm, just I, guess asking out loud how we can make that clear. I think that we have said that we are absolutely not in favor of not enforcing there's a double, but we want enforcement of our laws to continue it's just the way in which we want to ensure that they're non-biased application of our laws and finding a way to avoid physical force in things like our schools, I. Think that's what I'm hearing from the committee can I hear some other voices did I, get that wrong or Zac. You know, I agree with Rachel's point: that's you know it's impractical to call for an elimination of overtime, I think it's calling for an elimination of excessive and abusive overtime, and so you know I, think July, I, think I, don't know the anyone's I think anyone's calling too you know eliminates police hours, it's just the abuse of it, which is probably covered up by the Union and also does one other point. I, don't know if this is redundant, but the New York State Legislature passed a law repealing section 50, a made which makes law enforcement, personal right personnel records exempt from the state's Information Law Act I. Don't and I personally support that, but it could be an idea to add the list of items that we are supporting as subcommittee. That's a good point. Thank you. Julie Renee yeah, so I wanted to piggyback on that. If we can out of lying about accountability, those with Joseph's comments, I think one of the articles mentioned uploading videos, certain actions to be taken so that okay I've learned that so what you're saying is you'd like additional body cams on police officers and you'd like that to be uploaded to the public and yeah. But it's more of a general comment. There were some suggestions in the articles. Different suggestions, clean quote policeman. That program wasn't working well hitting records published of cops who have records hiding guy in okay, Thank, You, Lucas hi, so I think that one thing that might be able to guide us and in this conversation, perhaps is just looking more at things like we have talked about in terms of details in their budget like in terms of overtime, I, don't know if it was one of the presenters that talked about it or if it was in the article, but about how overtime is fact factored into their pensions right into the NYPD pensions, in a way that not even other cities do and let alone other city agencies do right. So that is like a big increase in their budget. I think looking at their budget in that way, and in our call for transparency, could be helpful for us in a way that sort of avoids some of the concerns about. You know putting down explicit numbers on you know whatever reducing headcount or things like that. So I don't know if that makes sense, but that's what I'm thinking about. Thank you. Thank you for that point. Any other comments- Mary I know I mentioned it before, but this move by hire an additional five hundred officers. The MTA none of those officers are fired right now to wear body cams, so I think we should look at the possibility of saying any hot line. Person who's in law enforcement, including these new MTA officers that are gonna, be on city streets, should be required to have body cams and also follow the legislation that was just passed recently. That footage is supposed to be uploaded, I believe within a 30-day period. Does anyone else recall the exact language that was recently passed yeah if a woman, if a recognize new buyer and footage from body cam, has to be uploaded within 30 days? Just the fact that I feel like if it's either state officer or an MTA officer, they really should be wearing body. Cams I think that's a no-brainer okay! Thank you. I tend to agree with you. Mary I do want to point out, because I have experience working with low-income housing complexes, some of the community policing officers I think when they were added to the PD force. The intent was for these new recruits to build relationship in a community where they work and often times wearing a back body. Cam does not prevents people from you know, even wanting to have a conversation with the police officers. So I don't disagree with what you're advocating that these officers shoot you where your body cams, but it will make the community policing more challenging. Okay, any other comments, all right. What I want to do is I want to sum up the conversation that we've had and then the idea is that the policing silo that we have, which is July we have Rob Isaac's Joseph, has been working on this. They will draft a recommendation that we will then iterate amongst ourselves and then get it to a point where we feel confident that it embodies our principles and we can adopt a resolution at our next meeting. So I want to make sure I have everyone's position and that I'm, reflecting what the committee has said. So what I have is that we do not believe that police should be in the business of mental health response, school safety, homeless, outreach or transit. We're thinking that transparency is needed in terms of police overtime, their accountability in terms of body cams and the ease of firing. Those bad apples should be looked at any frontline law enforcement should have a body cam and should follow the legislation for uploading it within a 30-day period. We're also could be in support of the legislation that makes that we are in support of the legislation that makes PD records public apart separate, and apart from that, what I'm hearing is that we really want to look at budget inefficiencies. Mary raised some of the issues about homeless outreach organizations, and that would be for the homeless group the helpless silo to look at as part of the budget going forward. Jamie, you have a comment: yeah, no look to have the police be accountable, have body cams, you know be showing I largely agreed, but I just wanted to add one thing on at the beginning, where you don't want police to, you know, enforce safety for schools and I. Don't know if this was mentioned, but I've had a personal incident where I had an uber stop in the middle of a Queens Boulevard highway on the way to JFK I called the police. I asked them to pick me up at least dragged me to the exit, because I was stranded in the middle lane of a highway, and the police refused to help me saying it's not their job. So I almost think that sometimes it is actually necessary because I could have lost my life that day honestly cuz the car stopped in the middle of the road, and we're said they could help. I eventually have to order an uber. To pick me up in the middle of the Queens Boulevard highway and I think that I grew up in Boston I've had a similar incident. The Boston Police has driven me to the nearest McDonald's like that's, not something I've ever faced I mean my family members have faced here in Boston and I. Think that you know we. There are some certain safety things that I wish the police in New York would be able to cry such as that and I know. You know when there are a few. You know: attacks growing up in Massachusetts. You know in the schools on campus at my college, MIT like we had the police, you know be protective and you know make sure things are safe or for our community and I. Just hope that you don't we don't like dismiss the police as being not vital for things like that. They are some somewhat vital for those type of activities, so just want that to be communicated and know because there I've been incidences. Where you know there was a terrorist attack on my campus at MIT, yet a police officer lost his lights to state students and he saved students from being killed that day, so just want to be conscientious, that there are incidences where I personally seen police be very effective and almost essential. Thank you. Thank you for that and again to reiterate, we are not suggesting that we do. You know that we do not want the police at all. There are certain functions that the police will continue to perform and we're in support of that I think to frame the issue. Is that we're saying that there are certain things that they're just not good at so you know: they're not trained in mental health outreach, for example, right and that we're say suggesting that they're better. You know that these things would be better served by being provided by different agencies and different people, but we are not downplaying the importance of the police and we continue to support enforcement. Yeah I just wanted to mention that for the school point, cuz I personally went as a police officer who sacrifices life to protect students and the students. Their lives were saved. Right, like that's, I, just want to make sure that that's sort of a recurring theme across America, not just not just Massachusetts here you know so yeah. Thank you. Thank you when we frame our resolution for our principals as well. What I'm hearing is that we want to protect the diversity of the NYPD in any recommendation that we may have about reducing headcount and that we also, as you say, Jamie. We appreciate what the NYPD does and their core services is. There anything else that I missed that the police silos should be looking at as they start to draft this issue, yeah Renee. If the PD is no longer patrolling the transit again, we are suggesting. Now. If you looked at the T&E statement of principles, they are suggesting perhaps the Department of Transportation, those who are promulgating. The rules and the bike lanes might be best placed to enforce the bike lanes and the rules that they have created you know, is that I think is it just be above ground and underground I'm thinking of New York City subways I, don't know if the deil t right so I think what we're doing here is. We are suggesting what we think may be the path forward and the detail is getting very granular about the details and I understand. We want to be as clear as we possibly can be, but I think being very granular about the details. We would like to get our position on paper. First, you know. If what we're saying is in terms of enforcement, we may want to say just bike lane enforcement- and you know sidewalk enforcement- we're going to see a lot of situational things now, because the restaurants are on the sidewalks. So we may want to be very particular about we're, not talking about underground we're not talking about in the subway, but in terms of bike lanes they're. You know it may be that enforcement is better served by another agency or another unarmed group within the NYPD. Thank you. That's awesome is that I'm sort of reiterating the position of the committee when I said that Sam yeah so I mean I think it was just a little over a week ago that the governor challenged every community in New, York State to reimagine, policing and Public, Safety and I think that's part of our charge here as well, and so you know when you, when you think about enforcement, I guess from my point of view. Ultimately it comes down to how much force do you use and enforcement. You know, I mean I, don't know to what extent NYPD officers are trained in the escalation techniques or other ways of managing people, and you know I mean the default. I guess is to pull out your stick or your gun, because that has maximum impact. You know on the physical side, but there's ways to be persuasive and try to manage people that don't require a stick or a gun and I guess my concern is you know if we? If we look at the hard dichotomies between agencies and don't think about where those agencies can come together and provide collateral services or synchronized services, you know such as you know, with mental health, and you know, people that are in danger to themselves and others, and they talking with each other about how they actually be enforced. The law manage the dangerous situation. I mean there. I think that there are people with other skill sets. Besides sticks and guns, you know that can show up, as you know, collateral public safety agents with the police. You understand what I'm saying here, yes, you're saying to work, hand in hand, I think I think you're right to say that we are reimagining different roles for the NYPD I understand that you're talking about collateral, so maybe a mental health professional showing up with an NYPD officer, I. Think that's what I'm hearing you say: I think that what some of the other committee members have suggested is that maybe the NYPD should be the person of last resort in those circumstances, so it's less a collaborative effort than putting a mental health professional front and center in circumstances yeah it becomes a matter of policy as to who is the authority who's in control in those settings and I think all too often the default is with the guy to the stick in the gun, right and I. Think that you know, maybe if there's some guidance or some guidelines around you know, and what point you know we transition from the mental health worker to the guy with the stick in the gun. You know all the better but I, don't think those decisions should be made by you know necessarily police officer thanks Sam, that's a very good point and I think in the framing of coming to our position on all of this reimagine ation of the NYPD. That's a very good point. As we talk about you know, it's not about the stick of the gun. When you are dealing with sort of situations right and we can, we can look at that. I think that the police silo should use that as part of the framing of how we've gotten to our position I'm. Looking at any more comments, I'm looking for anyone who has anything further to add any of our attendees that want to speak, want to make another note. I know Kim you're joining us by phone. You can press star 9 to raise your hand if you're joining by phone Kim. Do you want it? Do you want to jump in if you're joining by phone, okay, Chuck, I'm gonna be really mean I? Haven't we haven't heard from you, so I thought I'd just love to get your view. I have no comments tonight. Rene. Thank you, okay, thank you. How about you Laura I, just want to make sure that we're hearing from everybody, you're, muted, Laura, yeah, no I just agree about the mental health personnel. I. Think there are more. You know. People who are the police should not be, or I shouldn't say, should with the police. We should leave the mental health and health healthcare issues to health care professionals. If that's what I'm trying to say so, you know we can relieve them of that matter. Thank you again. All of this is a huge issue. It's not just about policing because, as we talked about giving as Mary pointed out as we talk about giving certain responsibilities to other agencies and other you know, organizations that also brings up questions and that's part of the bex as well. So each of the silos as we move to say, maybe the do we should be responsible for school safety. Those in the do E's silo for schools should be doing their research so that we can talk about those issues further right here. This is a big ball of wax people and they're all interconnected, so it can seem overwhelming because we're talking about so many things but I think right now, if we frame our position, get our principles down and have a resolution that we can use as a touchstone as we move forward in doing all the budget requests and all of the agency requests and looking at all the different issues that come throughout the year, it'll be helpful for us overall, let me just see if anybody else has anything to say anybody else we haven't heard from Evan I, don't want to call on you untold, but I haven't heard from you. Do you is there anything you'd like to add? No okay or Robert I just want to make sure that we have missed anybody out who wants to say yeah I generally I've been following along I've had some connection issues on my end, but you know, as you've articulated kind of the statement of principles. I think you know I'm in support of them. As you said, it's a big ball of wax I. Think there's some sacred cows in terms of dealing with budget issues when you look at kind of the percentages that are really tough to tackle and I think we all need to be kind of mindful of our ability to you know, articulate perhaps a community position on things like pensions or you know kind of the disciplinary and firing process. For you know really anyone who's part of any public sector Union can be challenging. A lot of the focus is on police right now, but they're, not the only ones who come up over the years, and you know we can talk about those things, but I think we should also be mindful of the fact that those are big structural things that are gonna, be tough to do much more than an open on or at least kind of say, look. We think the community is focusing on this a lot and we want you know the city Grande's to know it so yeah generally on board of the statement of principles, and you know mindful of the fact that these are tough issues and aren't contained over night. Thank you. So much you'd make some good points all right with that I think the way forward is our police siren of who spearheaded tonight, Thank You Joseph. They will start to draft the set of principles and we will iterate them amongst the committee so that we're ready for our next meeting at our next meeting as well. The budget will have been announced. Joe Mafia has agreed to sort of break that down for us in manageable bits so that we can understand it. Thank you, Joe and Kim. A call is looking with her group at education and, what's going on, she's been following along with all the different things that are happening with education in the city, given the pandemic, so there's a lot of things for Becks to be looking at. Everybody should be talking to the members of their silo and doing you know the due diligence on those issues because, as I said, the budget process starts again on July 1st and we want to be ready. We have a lot to a pine about. Are there any other points before we say goodnight? Is everybody on the on the police? I wrote happy Joseph happy with where we stand, and you have all the information that you need to start that draft yeah on my part, I think yeah. Everyone get really great ideas, suggestions, input, I! Think in my mind, we're pretty clear and I think it's about being careful about how we craft a message. I, don't think we have to get specific about everything like Rob said, but you know we can. We can at least you know, make it known to the people in charge what we think so absolutely perfect, and so we shall expect those iterations and then we will have this for the next meeting. So thank you. Everybody who attended tonight very much appreciate everybody's input. It was great and I will see you at our full board, which is coming up. You can thank you.",
        "summary": "I'm just going to give you a brief overview of how the committee works, we are going to discuss our issue, which is budget and alternative policing, Public Safety tonight the citizen budget Commission CBC, who is a nonpartisan I, always say that we're wrong nonpartisan nonprofit civic organization, whose mission is to achieve constructive change in the finances and services of New York City is here.\nWe have already sent our electeds a letter which supports cuts to the NYPD and support for things like the Summer Youth Employment Program, and so we are now as a committee looking to the next budget cycle, which begins on July 1st, the transportation and environment committee of CB 5, provided us with a set of principles that they have informally adopted regarding the enforcement of transportation violations, and that's really going to be helpful for our conversation this evening, and we should look at that We start this conversation is what are the tasks that are currently handled by the NYPD that could be better handled by other agencies or other organizations even think about whether armed police are necessary for all functions, and we also need to think about enforcement, and how do we ensure enforcement is done in a non biased way, but also even thinking things like?\nI, don't have much to say, but I do want to say thanks everyone for focusing on this conversation, something I'm very interested in, and I'm really excited to have two people from CBC here, : I have to be transparent four years ago, I was an intern at CBC, so I got to know them well, and you know think that they're, a great organization and There is that you know they're a good place to go for the facts, about the budget to understand how the city budget works- The last part of the discussion, if possible, to answer questions that come up about different budget lines.\nOne important fact to note is that this doesn't fully account for the entire expenses of the city pays on the NYPD and related costs, because it doesn't include what are known as central expenses, so in 2020 the NYPD's operating budget which funds it's like day-to-day operations, the costs of staff, the cost of programming or anything else that the agency might do is about five point: six billion Then there are another 5.3 billion dollars in central expenses which are managed centrally by the city, but then can be allocated back to the agency, for which you know those costs are responsible for, and this is things like pensions fringe benefits, which includes things like health insurance and other welfare contributions to employees as well as there is spending for any capital projects that NYPD might have This makes the NYPD the third largest budget out of all of the city agencies The five point: six billion dollar operating budget is the third largest behind the Department of Education and the Department of Social Services If, you add in those central expenses, it's still the third largest, but it's 11.1% of the city budget instead of five point.\nNext comes administration and communications, so this is all of the admin side for the agency, as well as their 911 response team, and the third is the chief of Department This is the department, that's responsible, with coordinating between all of the different bureaus at the NYPD, but also the reason why their budget is so large is because that's where pretty much all of the agencies- overtime, as well as their other sorts of supplemental pay sit They have their transit and transportation police there's school safety agents as well as spending on counterterrorism.\nSo you can see, on the right hand, side where their funding breaks to the funding breakdown about 92% is city funded, and then you have a six percent That's federally funded, and this is mostly for counterterrorism as well as there's some security grants like reimbursement for the police officers at the UN If you look at how many people did NYPD employees, it's a bit, it's about 54,000 in 2020, about 36,000 of those or uniformed employees, and seventeen thousand of those are civilian employees, and the civilian employees include things like the school safety agents, as well as traffic enforcement agents that eat see in the street.\nOne of the reasons why police officers and uniformed employees at the NYPD are you know, have such high average pay is because of the overtime and the NYPD has a particularly high overtime budget, the uniformed overtime budget of about five hundred million dollars, That includes agencies like the fire department or the department Corrections or the Department of Sanitation, which also have uniformed employees The notable expansion was in 2015 when the City Council on the mayor agreed to hire a thousand three hundred police officers, and most of these were targeted at the community policing initiative, as well as some of them for the counterterrorism response and over the course of the entire period.\nRevenues have come in much more much lower than expected, given the economic crisis and the pandemic, and so we at CBC did a report looking at sort of what we would recommend as the way for the city to close the budget gap, and we have a framework that was developed by Charles pressure, a research staff, negative impacts on New Yorkers, especially on disadvantaged communities, that you want to preserve the city's competitiveness and its attractiveness as a place to live as a place to locate your business and that you don't want to burden future generations so that we really we've been very staunch in a position that any long-term borrowing could really be.\nI can definitely understand the concern, because you're right that, if you are, if you are doing any kind of reduction, if you went to the point where you were actually trying to produce your current employment level, you would be required under union to really start with the most recent hires So. In that case, you're, most likely relying you know in terms of the uniformed police force, they tend to have a slightly lower turnover rate and most in the city as a whole, especially in police, There's.\nI believe that what the governor was referring to was not just state funding related the police, but all state funding, so I think the threat was an education aid, other aid as a way but general It's, not a large area of spending for the state Most of the state aid to localities is right and thank you, Tristan Could, you maybe speak a little bit about the methodology used to calculate the pensions and how you know uses the later years and options career or like the peak years and how overtime plays a role in establishing what the pension is and then, if you could also loop in, if you have any data, how over time, usage changes from like a more junior officer to a more senior officer?\nThere is a fair amount of churn and that's usually what the city has been relying on in terms of increasing or decreasing or by slowing hiring, even, for example, the reductions that are proposed Department of Corrections, as they start closing facilities on Rikers those have all been through attrition and so you're managing it by letting more people leave I mean you know, around 500 million dollars for uniform to overtime at the police department is sort of You looked at the change from the budget last year, and there was a decent change.\nA second bucket with school safety You know potentially moving safety officers from NYPD to Department of Education, and then there was homeless outreach, which you know it's kind of related, obviously to the mental health bucket, but I think it's more talking about You know: funding, outreach teams and Department of homeless services, programs and funding housing.\nYou know they're not trained to be mental health professionals or to deal with the homeless or all sorts of other issues that they are forced to kind of handle on a day-to-day basis, and so I think all the areas that Joseph mentioned are some perfectly appropriate for increased funding You know, if that you know whatever, as a replacement for whatever is cut from the NYPD budget.\nI want to have the conversation about that and see what you think about that You, your hand is up again, I want to say, I, agree in principle with what Joseph and the sack we're talking about in the three areas, its fullness mental illness and exclusivity, to have to NYPD the police officers, nothing loth, but have other more appropriate or relevant We trained service providers to be logged now, I'm, not sure CI, Principal role, provided that the overall had come for.\nIt is so important , I think more so important, whether it has to do with people violating social distancing rules, the state law of a mask in public when you're, not it was maintained, so she did social distancing or when it relates to business, closed temporarily and opportunities present themselves for people who want to you know, take what don't belong to them, and just public safety as a female signifying resident Police officers in the street Better training personnel, but I cannot support any meaningful cut.\nSo I think our principles need to be defined first and that's what this conversation is about and that sort of drives is that well and overall, philosophically I would agree that certain things should be taken away from the police department, because they're, probably not well equipped and they're inclined to use force and handcuffs versus There are other enforcement things that should not be in the police department's ballot works such as social distancing, a lot of quality of life stuff and I would say that we are not talking about lack of enforcement.\nYou know that, put together mental health workers and police I think there's a group called the core response teams and there have been a number of efforts to try to soften the approach of the NYPD to emotionally disturbed people and folks of that of that ilk and I Wonder.\nMental health clinics Had. Some contact with these corresponds teams, but they still show up in NYPD, Blue right and so even emotionally disturbed people respond to the uniform more than they respond to the role you know In other words, everybody shows up and they all look like police, but some of them may have different training and I guess for me, I'm curious to see how the PD has worked to provide a more you know, synthetic kind of service that might respond in more ways than just brute force to control the situation.\nWe've talked about kind of functions that might be better served in different agencies, but I mean there are also some things that the City Council and advocates are recommended in terms of changes within NYPD that have budget implications, but that also have like Public Safety implications that, like I, don't know if that's appropriate for our principals They still get their pension they're costing the agency a lot of money.\nI would support a statement of principles that allows changes like that to be made where we can actually take quick action to fire officers who hurt people, and you know, and then also there is concerns about overtime, that I think Zach and a few others raise that I'm not saying we're not looking at the budget, but that is not the focus given that it's tied up, but we're now moving into the next year.\nI think that services like mental health response, school safety and homeless, outreach and support that you know Mary Joseph Sam, that entire team here is been speaking adamantly about tonight like it makes sense to divest those activities from then, like you Can, we propose you asking for you know proposed having greater transparency in the new and in the NYPD budget?\nSo I want to make sure I have everyone's position and that I'm, reflecting what the committee has said So what I have is that we do not believe that police should be in the business of mental health response, school safety, homeless, outreach or transit We're thinking that transparency is needed in terms of police overtime, their accountability in terms of body cams and the ease of firing Those bad apples should be looked at any frontline law enforcement should have a body cam and should follow the legislation for uploading it within a 30-day period.\nIs that I'm sort of reiterating the position of the committee when I said that Sam I mean I think it was just a little over a week ago that the governor challenged every community in New, York State to reimagine, policing and Public Safety?\nFurther right here, This is a big ball of wax people and they're all interconnected, so it can seem overwhelming because we're talking about so many things but I think right now, if we frame our position, get our principles down and have a resolution that we can use as a touchstone as we move forward in doing all the budget requests and all of the agency requests and looking at all the different issues that come throughout the year, it'll be helpful for us overall I think you know I'm in support of them."
    }
}