{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCYxRlFDqcWM4y7FfpiAN3KQ",
            "title": "Community Development \\u0026 Budget Priorities Committee 9/2020",
            "publishDate": "2020-09-21",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "9/13/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 41,
                "um": 126
            },
            "wordCountFullTranscript": {
                "board": 56,
                "number": 39,
                "money": 39,
                "budget": 36,
                "committee": 34,
                "community": 27,
                "parks": 26,
                "people": 26,
                "request": 25,
                "things": 25
            },
            "wordCountSummary": {
                "budget": 12,
                "community": 8,
                "committee": 8,
                "board": 7,
                "money": 7,
                "requests": 7,
                "people": 5,
                "year": 4,
                "things": 4,
                "right": 4
            },
            "fullTranscript": "Hold on that's recording, 6, 12 p.m. It's September, 9th 2020.. This is the bx cb11 community development and budget priorities committee. We have a quorum andrea. You want to take over okay daisy. Just to let you know we just we did receive an email from one of the schools we're going to forward that request to mark jonah, because we I feel, and so does jeremy- that they want that those goods immediately and not the next year. So besides putting it on the budget, we're also going to ask if they can take care of it at once, got it okay and now we're gonna start on page one of the preliminary budget register. So this is last year's request that we made officially okay, the first one is to reconstruct and upgrade a building in the park. Anyone have any objections to that or you want to keep it or get rid of it. I think anything, that's related to parks is okay. To keep on oh hold on this is this: is this memorial plaza right yeah? So this comes from a board member sylvia mazzella, and if you look at the details, they want a veterans memorial wall for all the Bronx who's falling missing in action personnel I mean, I don't know, I would keep it. I don't think they're gonna get it but keep it yeah. I don't think it's very realistic. I don't think it should be the number one priority, but I'm okay with it being kept on the okay. The next one is the reconstruct upgrade park or amenity to the pelham parkway park, yeah upon parking mall. So just to be clear on this, they did some of this. Some of this is being done now. Well, this is part of the construction. No, this is not. This is separate. This is what's happening to stillwell avenue. This is this. Is the park itself. This is not the streets surrounding it, it's not the sewers related to it. This is for the greenway, so they did do some of this right from. I think winds, ridge, road to to boston road. They did do some of this, but not all of it. So I mean it's up to you in my opinion, in light of the of what's going on in the world today and the finances that the parks department has, I would, I would get rid of this and put it on another time when there's money involved, I would hate to take money away from something more important than this. Do you agree natalie, yeah, daisy, so yeah unless they say this we'll get rid of it? Okay, the more we can whittle down the better. Absolutely the next one is to renovate or upgrade an existing healthcare facility to jacobi wait. I have before we move on to the next. If we are getting rid of this park amenity, wouldn't then the same logic apply to the peace memorial plaza. I think more so because the east memorial project is just an idea, whereas the other one's more concrete right, and so then, if that's the case, then we should probably then also remove the peace memorial from this priority. I think it I think it makes sense. I don't think, there's any realistic possibility of peace memorial being renovated in the foreseeable future. I would agree, however, in light of that it was sponsored by silvio. I would leave it on just to honor him all right, let's keep it on for now and then we can always revisit again. Nobody has any money to do any of these things. So unless you think, unless you get elected just to you, know fund it right, where are they getting the money from jeremy they're? Not printing? It never well at this point. Yes at this point with covenant 19 and the budget. Yes, it's not happening. No, none of these are gonna happen, but, prior to this, as you know, you know we have gotten dog parks and stuff, like that. I mean not the community but other people. What's that did that did not come through this? No, I know I circumvented the entire system to get that done. Yes, but the same route can be taken with this if there's money available yeah, if that's a big, f yeah at this point in time. Yes, this is another sort of rookie question that I have here just because this seems very arbitrary. The way we decide yes or no on these things does it matter to OMB I mean we're. I mean these are all different agencies, right that are dealing with these requests correct to OMB who how we rank these like. What exactly is the sort of the idea of ranking these requests and sort of? How are they really evaluating when we submit them? The ranking should be our priorities. How we, if we really care about this one thing more than 25 others that it's really up to us. It's really what you mean like us, five people who are and on this call right now. Well, this gets put remember, ideally this. The way this gets done well, this was always gets done, is whether it's three people, two people, one person, because this used to be a committee of one prior to andrea. This goes this gets submitted to the full board right, ultimately, yeah the board can say yay or nay to this. So that's this! That's how it should happen right, you guys. We do the work here, or we at least do the brainstorming and if anybody wants to submit a make a suggestion any day of the year like that, like the like the ms-144 she emailed us right, we can do it that way. We can discuss it at the full board, which has happened in the past burnett's made requests and like last year. I think I think you know she wanted something. He said: okay, unless name ajax I'll add to it. Nobody objected. I added it, we'll find that at some point on one of these requests. I can I make a suggestion. Of course, let's go through to remove or keep and then go back and decide which one should to be the priorities. One. Two and three. I agree I just it's. I just have a process in general, I just I feel comfortable with this process and so in general. I think we should just think in the future how we want to make it sort of more involved. I guess, but to be honest with you, I never even noticed that those was a ranking. I just thought that was the way they inputted it into the computer. Okay, to be honest with you as a former chair, can I explanation of this as a former budget chair who sat at budget negotiations with jeremy, can I just explain a little bit of this? No, not interesting. No as far as the ranking and all of that andrew okay. No, thank you. So remember, right now, oh, how about this I mean you're. We are supposed to have a public input. Can we wait till the end and then just go through this just okay, sure? Yes, thank you. Okay! So then we're back to number three correct, so keep it or get rid of it, I would say, get rid of it. They've had enough fixing up of their property in the last couple of years. Now do any of these agencies that says supported by do they like how do we know whether they still have this issue or not? Well, you reach out to them. I reach out to them. Generally, oh okay. I mean, as far as I remember, yeah jacoby still wants this okay, but I think I think it's okay to keep it because, when we're dealing with a medical facility and in the times that we're in if people need to get somewhere, I mean potholes can be very deteriorating. This is within their facility not leading to their facility within their facility right. Well, wouldn't that wouldn't that still affect their access. No that's for the nurses and the doctors and well. I know I drive through that facility. When I need to I mean my goal is to keep it so andrews get rid of natalie's, keep it daisy's a tie, breaker if daisy lisa's on two lisa. Are you on? I just I'm having internet problems right now, so I can't even pull the document up to see what you guys are talking about. Okay, so we're talking about our budget. Priority apple request number three, which is to repair the roadway for jacoby medical center within this the complex, and why would we object to that andrea thinks? They've had enough renovations. As of the last few years right correct, I mean I can't speak to that because I don't know the history, but I do know that I can. I can also reach out to jacoby that makes it easier and confirm or deny that they still want this. That's a good idea. Okay, we can come back to it. Then yeah. That's a good idea. Okay, number, four asking for a new library, so hvac system, okay, so the request just so we're clear the request, column or a row where it says create a new or renovate. That's just that's a boilerplate check. You have to that's a boilerplate selection, so yeah we put this in the bullets here. Yes, no, but I'm saying the create the request description. That's just yes is that, okay with everybody, yes keep! Okay! Now there is while we're on the topic of how this works. There is a training for thursday night for board members which I did send to the committee tomorrow. What's that tomorrow, night yeah, that is tomorrow night, isn't it yeah, I'm obviously a day behind, apparently so, all right, number, five, sorry, jeremy! Would you say a training for what so on how this works on? How these are inputted? There's a particular program, a computer program that we use to input these got it, and so you sent out an email to the general board for training. No, I send it out to the committee because, oh I didn't get anything yeah I didn't, I didn't see anything hold on. Maybe you didn't realize what it was about. Okay, let's continue, let's discuss everything else at the end, please yeah so number five yeah! You want to explain that one to me this comes from a former board member, but this is also in relation to metro north. I mean this might happen anyway, because the metro, if metronome, still comes in at morse park in bassette, so bassett avenue does not have any sidewalks. It's yeah. It's I don't know if anybody's ever been to bastion avenue. Does anybody know where baston avenue is. You know is that the street like behind where the starbucks is behind starbucks? Yes, yeah that yeah that street is terrible. I know that who's talking about yeah, okay, keep it or get rid of it. I say: keep okay, three, okay, number, six renovate an upgrade in elementary school yeah bathrooms for ps89. I can reach out to ps89. What's that? How many years has that been on there good question? But it says since 2010 the bathrooms are in poor condition. I mean it's on there. Yeah definitely keep and confirm with them that nothing has been done. If it was done it wouldn't be on here. I can confirm with the with 89, but it's still I can reach out to the principal yeah. That's actually a good point. Do we get confirmation of any of these priorities over the years? If they've been done and then go through and take them off the list? Yeah I mean okay or if I don't hear back from the principal in a timely fashion. I what andrea- and I did I think last year- is we cut them and we told the board that got it. Okay, so we'll keep that one yeah same with 105.. Okay, keep that also based on based on confirmation. Let's continue on confirming. I can confirm the bathrooms suck at ps105. I have a. I have a soft spot, that's my that's! Where I went to school and that's where I voted. So I used to vote since good. Okay, we're up to number eight. Oh okay, this yeah we're gonna have a bone of contention. This playground has been renovated numerous times since I've been on the board and, unfortunately, the residents of eastchester gardens keep demolishing it. It's like putting good money after bed. I still I'm having really bad computer problems and I can't access it. So would you just mind reading it for me? Okay, they want to reconstruct or upgrade the amenities, the playground, the outdoor athletic field from eastchester gardens got it well. Oh, that's just that. That's the boilerplate check it's just particularly the underground infrastructure there, as we've discussed recently with the parks department. Lisa. If you remember yeah, that's the thing that floods all the part that floods all the time the basketball courts yeah. I think what happened was. If I understand correctly, we they put all the money into, or somebody put all money into, renovating and making it nice, but they didn't fix, I guess the plumbing or the infrastructure underneath the basketball court that would just floods whenever they whenever it rains so yeah you're right. We did put money into it now, we're gonna put more money into it, but that's because nobody took the time to look at the infrastructure underneath before seeing it. So among all the places I think the parks department told me this is probably the playground that needs the most renovations, but how many times has that playground been renovated? I'm not talking about the under structure, but the part the playground itself. I don't know if you don't mind the if I go back to the training thing, that's happening tomorrow night. I saved it as a draft over the weekend and I just forgot to send it to you guys, so I just sent it now. Okay, thank you, okay, what do you want? What would you like to do about this okay or deny it I'm? Okay, yeah. I think any parks sort of structure should be well maintained because it's a public amenity- and I know that is priority because I'm on the parks committee. I know that is a priority of the parks committee. Okay, so we're keeping that one. The next one is a renovator upgrade public housing developments. They want to increase the lighting on the grounds of eastchester gardens. I thought that richie had did all that already all right for so for the lighting. I don't know about that. Well, maybe it was just pelham parkway houses. He put the lighting in yeah, it might have been there. I don't know I mean I can check with mr ramsay one of our board members, which I think this is primarily where this request comes from okay, so you want to keep it or get rid of it. I can you want me to confirm first, no just keep it with. Ladies keep it or get rid of it. I say: keep okay number 10, renovate public housing development. Again, east chester gardens wants us to replace all 16 entry lobby doors. Why don't we just build them a new development? Well, what happens a lot to my knowledge at these at public housing? Is people break they break the doors. I know that yeah and the problem, probably also, is that they're, not they meaning the city is probably not investing in the most secure. So it's probably very easy to break. I think public housing is federal. Okay, oh yeah, you're, right, you're, right, you're, absolutely right yeah, it is federal, but it's one, the city, it's yeah, it's an authority right yeah, but unfortunately, with no money, nothing is going to get done and if we have to pick and choose what's going to be done in east chester gardens because every one of these is for east chester gardens, I mean I thought like the idea was we're going to keep or remove right and then we'll go through priorities, or I mean we can do you want to keep these or get rid of them? I mean, I think anything that has like real consequences to people's security and I think it's a key yeah. Okay, so that's number ten. Okay, then going on to number 11. They want to repair the steps for the basement in the entranceways. Keep yep, keep it. Okay number 12, also east chester, gardens jeremy. Do you know how many NYCHA developments we have in our district three number 12? They want the roofs, fixed and east chester garden. Buildings keep yeah, keep it, they need it. Okay number 13 upgrade the restrooms at the matthews. Mulliner playground keep yes, I agree keith, so just to be clear, just to clarify it natalie. So we have east chester, gardens, parkside houses and pelham parkway houses at the whole fed houses that pretty sure got the roofs renovated. Thanks to richie, that was in his district. Okay number 14 playground would like upgrade a building. It's used by the kids from ps89, which is across the street. I thought this was maybe done already. I don't know, that's another playground that gets fixed every six months. Well, how about that then? That often, but I can close, I can reach out to parks department to confirm you know what I would say get rid of it and use the money. Well, you know what, if there's money, to use it for the other playgrounds that we're okay or yeah, get rid of all the other ones and just keep each chest or garden since that's the one that needs it, the most that's another way if you're looking at it. Oh well, I I'm for getting rid of this, since they have a lot of reconstruction in this playground over the years. So now I think natalie lisa, do you want to keep it or get rid of it? I thank you yeah to me. I mean again. I stand by the same logic that I use for evaluating the others like for now. Let's keep unless we're using some grounds as to like which one we decide to eliminate them. Well again, this might have been done say to get rid of it. Okay, then, maybe if it was done, then we don't need it here, obviously, and also over the years they get their playground redone almost every year. I would if there's x, amount of money. I would say: let's use that money elsewhere and not even give them any money this year. Let them put it back another time. Somebody else can the parks department provide a list of who and when they've renovated stuff I mean are we? Are we saying that we want to use the logic of like you know? Next person gets the money down the line like 2019. We gave it to this playground 2020. We give it to this one 2021, we'll you know prioritize this one. I think I think we should make a priority, make our priorities as goals to make happen so because the parks department has told me that east chester gardens is probably the most needed, repairs that and maybe parkside with their their station there. But I think if kapush comes to shove, is he said? If what we're saying is we so then can the logic be just because I have hard time making a cheaper next decision. I don't understand what our approach is, and so, if saying, are we saying in the parks right, like each agency, has a responsibility, so we're gonna pick one thing to focus on for each of the agencies that have requests and then, if that's the case, then out of all of the parks requests we're saying no to all of them for this budget and we're only going to focus on east chester garden, because the parks department has agreed that is the most needed. The parks committee has decided that that's a priority and therefore that's our number one priority with anything in regards to parks. Department, correct. Is that the line of thinking that you're proposing jeremy, so the other thing I would I would say, to qualify. That is that so you we can make all these requests we want, but if we whittle it down to like five, if we were to make five total priorities, I mean, I believe, in making things I believe in actualizing things and making them happen. So I think the focus on the other playgrounds is a waste of our time, because east chester gardens to get that to happen is probably no small task. Is I'm there's no question about? There's, that's no small task, so I think I tried. I want us to, I think, the more the less we have the better, so we can actually really focus in on it. Ideally, it's not going to be easy. We need to reach out to elected officials too, as you can see here, as you can see here on number 14., we recommend this project be brought to the attention of your elected officials, for the agency and number 16 tells you there's been sufficient funds last year for this yeah. It's it comes down to elected officials. For these things, yeah and so you're saying we would have a bigger chance of actually actualizing some of these projects. If we're focusing all the energy into one recommendation versus letting it amongst several, I think I think I think it's it makes more sense. It's just wait way too many requests. I mean in some in many ways I mean we can have. I think up to 50, then: okay, I'm okay with then east, chester, garden being the parks rec that we're focusing on this year in terms of priorities, and then we mix all other playgrounds, so we're getting rid of 14 and, against my better judgment, we're getting rid of 15. right and then the previous ones. We wanted that we media went after me. What's the up other parks, one was the war memorial and matthews mulliner right. You want to get rid of matthew's melanoma. What's up it's up to you guys you, ladies, that was number 13. yeah I mean that's, get rid of it or if we get rid of it, can we put it on next year's? When we know there might be money, we can always break so you know what happens and you know we can always bring it back and, as you know, we don't have to do. We don't have to do this to get these things accomplished. I know so, ladies: is it okay to get rid of number 13 yeah? Okay, so we go over to 13, 14 and 15., and we're still keeping silvio's thing is what you want to do right, yeah. I don't want to listen to his mouth. Okay, we're now. Do we I'm sorry? I just have a quick question. I definitely agree with you, jeremy, that probably less is better because it's not so overwhelming do we have- and I know this is a weird question, given the current budget situation, but in normal times do we have like a targeted budget or amount that we're looking to ask for this is this is what we're doing now? There's really no difference between what we're doing now and what we'll be doing with or without coping. We just know without govern, there's less money to right, but what I'm saying is like is the total amount of requests that we have on our list contingent upon a specific budget amount that we need to adhere to. These are recommendations they in reality they mean little to nothing to the city. Unless my experience, they mean something when the city wants to wants it to mean something because they want to do the project in and of itself. Basically, regardless of us right. I understand that. That's not my question. My question is: do we have a targeted budget? Are we looking to get budget to make our budget priorities list total a million dollars, let's say or two million dollars, or I'm just making up a number or does or is the number or is there no price tag too attached to any of these things? No well, there needs to be remember. Parks was going to put together something on us for east chester gardens in terms of a price tag right, which is probably a dramatic. The price tag for eastchester gardens is probably well above and beyond in some of these other ones, like matthews mueller, the bathrooms. Okay, it's probably going to allow money, but not as much as east chester gardens right. So there's no, except because we don't know that number right now we make sure we're not taking that into consideration in terms of what we're putting on and what we're taking off is that? Yes, if you look at the agency responses that we've had previously they're telling you before Covid-19 that they didn't have the money to do these projects, I understand that 15 and 17 they're telling you immediately there's no money, and that was beforehand right. I understand that I'm saying in terms of how we prioritize in terms of our ask, are we looking to fit these items yeah? I understand what you're saying I say: don't look at it. That way, I say. Look at us as based on need right, correct that that's all I wanted to know. That was the question. Okay, so also 16 and 17 under our thinking is going to be nixed against my judgment, but whatever okay jeremy, you take number 18, because this your baby, no, this is this is bernadette's, so you can see it's supported by van ness, neighbor alliance. Now, if you remember at our at the meeting we're getting rid of the drug treatment center that we had that huge meeting, natalya graciously said she was going to try and turn the old temple into a community center. You tell my esplanade. Yes, okay, do you remember that with what money and now he's not going to be in office much longer, so who knows what anything is going to get done, so this is bernat's request. I've had conversations with her. I've spoken with the a friend of mine works for the ymca, and he told me what the real steps are needed for this. I you know we can keep it, but I think a lot more is required. I know when I talked to bernadette about this. She basically complained to me: why did she have to do any leg work for it? I could be wrong, but I'm pretty sure that's how she took it. I mean I think, vegas knows how to go about this more than bernadette. Maybe there's something we can ask him about and again using the temple on esplanade for a community center would be wonderful if possible. I mean again, I have a friend who actually is a former board member who might answer this, so I can reach out to him again. We can maybe you and I can talk to him- you if you want andrea or any other board member. What's that? What are you talking about? Michael, yes, okay, the agency response was that the department of youth and community development does not distribute or receive capital funds. If this is something that we want to keep, then we need to figure out who the responsible agency is. Would that be elected officials at that meeting, sort of said they would take? They would take care of making that into a community center, but, like all elected officials, you got to take what they say with a very large grain of salt. I mean, I know, I know when carl hasty became speaker. His district got ymca yeah well yeah, but it comes down to elected officials, yeah mark natalia and ambiagi the ones. That said, oh, that's a great idea. Let's leave it on for now, since there's no money involved that doesn't make a difference about leaving it. Okay agree. Disagree yeah. I agree that makes sense number 19., install streetscape improvements from allenton to it's, a wonderful idea, but unfortunately, in this time there is no money for these type of things. Well, I think it's also a little too vague, okay, too vague or too big vague. I think it's too vague, I mean, and maybe big I mean it's a district-wide thing with out any I mean the city had money. I say it's wonderful, but well. The city there's some important priorities in this. The city responses they'll try to accommodate. I think one of the ways they were trying to accommodate is they had they replaced all the light poles or light they put in smart lamps, or something like that right, smart bulbs, yeah. So I think that was their that's. What that means. Okay, so get rid of it or keep it. I'm okay, getting rid of it. Okay, get rid of it. Okay 20 provide tech technology upgrade for ps121; they want 30, ipads and six smart boards. Well, I can reach out to the school again. If you want, I would keep it is. This was this put on here before or after school started going remote before this is all last year's. This is all last years. I would. I would check, because ever since school started, going remotely all of a sudden, every school had some kind of they all got like ipads, one of those things called smart ports, not smart boards. There's another word, I'm looking for the anyway laptops, but a certain kind of laptop. So all of DOE schools got all like special laptops to give to the kids yeah. Okay, the next one reconstruct streets past there. I don't know what they're doing but they're doing something yeah, that's the north's construction, yeah. Okay, so that is continued support. Basically we always so we leave it on until it's completed. Yes, that's why it says. Yes, I finally got the document as we're finished. No we're not finished. We got expense items, so capital items versus expense. So I forget what the threshold is, but capital is mucho del dolar versus expenses. I forget what the threshold is, but that's the difference. Oh wait hold on jeremy. The sheet that I have, I might be looking at the wrong one. That was it there was nothing else on that document, so I have page 10. If you go to that new page on the website, I created thanks to natalie. It's there, you can just click on it, it's a hyperlink. Why don't? We just read it to her, it's easier I'll, send it to her in the meantime I'll email it to her okay, I can look it up on the website. That's fine! I was just looking off of a document that you had emailed before. So I think so. If you go to about page profile tab- and it's like second to bottom district needs statement or register budget request. No, the budget request. The this or needs statement is something else we should be looking at and discussing, but link is broken right now got it okay, I got it. What page are we on 10 10.? It should any that it should say e at the at the end of the number index. Number tracking code should say got it I'm here, I'm with you guys, obviously that's not happening because they want to cut your money to begin with. Well, they are cutting our money. It's just a maritime okay because that's not happening. Okay. Oh man, you're right, okay, number, two discuss this additional police office- that's not happening, unfortunately, no, so we can get rid of that. Okay, I agree. Okay again, number three: is the parks department needs more pep offices. I think money can be better spent elsewhere. At this point like on barbecues, you should have seen me last night. I was on parkway south. You know the infamous street to nowhere on bronzer when you somebody set up a barbecue on the street on the sidewalk to nowhere. Well, it wasn't on the grass and it wasn't under a tree yeah. I forgot when I saw it last week, maybe tuesday there was a really big party in Bronx park. Unfortunately, you can't call anyone the police, don't come the parks, don't have any workers all right, so you want to get rid of it. Everybody else agreed yeah. Okay, I say: keep poor yeah. These trees need to be pruned in case there's. Another storm, hopefully agreed. Okay winter coming, increase enforcement of illegal dumping. If it doesn't cost money, it's okay. Oh it says this is not a budget request. Yeah I was gonna say I don't think it's pointless to keep it yeah, like I said, the reference name is self-explanatory. Okay, number, six yeah! Okay, yes, number, seven number seven! This is I'm pretty sure this is bernadette. Improvement upgrade existing green street. By the way I mean bryant has been working on this she's been emailing city planning department. I think they're trying to turn it back into a roadway okay, so the huma, how you want to keep it. I want to reach out to her see what she wants to do. Okay, I think she wants to try jeremy, just because similar requests were in part of the capital budget. Is this just because this would cost less? That is part of expense. Yeah again, I don't remember what the threshold is. Maybe, mr, mr bob, I forget his last name at the moment. Yeah mr press maybe knows the threshold. I forget what it is. I don't know if it's eight thousand dollars fifty thousand dollars- okay, number- eight, oh so, but we're okay with I reached out to vernon about seven right, maybe she'll want it going anyway. I put a question mark for seven okay. They wanted they wanted this done. Last year, remember we were at a meeting we were deciding if the community board was going to pay for half of it and the parts of home is going to pay for the other half oh yeah. This is a request from the parks department. Now agencies do it's always good to actually hear back from an agency about what we think. Should you know what do they want yeah? This is a request from them. So if you go along, if you get if you're driving north the Bronx zoo exit on the Bronx river parkway, you come off it and you hit what boston road did that fence all along like barn? What's the playground burns abrams yeah? So it's all that fencing which people cut holes in it. There are a lot of holes in it. It's like tilting in some places. I don't think for this to keep if they still need it yeah, and if it's something, I think that if something comes from an agency just to be like good partners, I think we should always try to support what they're. We should try to support what they're asking for. We ask them for stuff all the time right. Lisa yeah parks wanted the community board to pay the half of it since once a year we generally had our carnival there and since they, since they let us have the grounds and we get money, they wanted us to pay. For half of this got it hear me that was basically yeah, the that was yeah implication. So at this point I would keep it yeah. That makes sense. Oh, I missed that carnival. Yes, so number, two, okay number nine! This is a NYCHA. This is a NYCHA. We can't do anything about this. I don't know why this I think I said this is inputted correctly incorrectly. This is this came from a request. Well, this is so we got a resource request. What's that this was roxanne's request. Well, this originated as her request. She wanted the playground renovated and I met with the cornstrom. I met with the facility that runs operates the playground they said. Well, you know they've pointed out more serious minors as well as the I should have said that this was also by I don't. This is a attack on be taking care of these things yeah. So this is NYCHA. This is NYCHA. This is NYCHA property. So, but I think, because the requests came in so late and by the time I got it to the city, they didn't, they didn't know they didn't understand how to input it correctly. So that's why it's not exactly right, but I think so. We should keep it or get rid of it. Keep it because not only did the the daycare that operates the cornerstone program, but also the residence council was in favor of these things as well. Okay, what do you want to go back and revisit so I I'm gonna. Do some outreach, the staff and I'll do some outreach, and that way we can maybe eliminate some change that way or keep some. Once I hear back from schools, I speak to bernadette. I forget, if there's anyone else at this point, I think it's largely the schools and bernadette make outreaches to right and jacoby. Yes, yeah, I mean I'll go through it, I'll go through it. We'll figure it out in terms of minutes, though, is anybody any of the committee members willing to try to do a quick? Do a synopsis in writing? What we're keeping get rid of do we have like? Will we have the recording available yeah, but we do need some type of. I don't know I know, but to reference I mean I think I marked it all up, but you know just because I missed anything, but we have to walk over to actually present to the full board, so we don't have to present this to the footboard. Yet I mean it should probably be discussed though it should. If it is presentable, I mean it will be partially presentable. I should be able to have you know the cuts done. I should hopefully be able to confirm with people and then that way, but it doesn't have to be voted on yet on it. I'm sorry, I didn't hear you lisa. When do we vote on it, so I know we went over this before but just refreshing, remember let me let me look at the it was sent. It was stated in the training. I think we have a deadline of October 30th for simple. So if we make edits between now and then we inform the board, we should be able to vote on this October got it. Are we supposed to still have a public hearing about this? Is the publication? No? Well? No! It's a committee meeting. No it's! The public hearing is a little bit more formal, so we could do that in October. We could we could step in and what are we going to do? What we cut out again, yeah we could look at. We could we could look at it see how it looks after we can do a recap. So in the public hearing we're not we're just presenting. Well, that's not what we've cut we're presenting kind of like this is the final version that we're presenting and we're presenting it to the public for public hearing is really just to take input. I mean we could do both. We could. We could have the public hearing first and if nobody provides feedback while we can or submit anything we could discuss. We could recap thereafter. You're, saying recap for the board: I'm talking about public hearing public hearing is not it's. It doesn't have to be a committee meeting because you don't there's no there's no there's no attempt requirement, but it's generally, it's generally easier to just do one and one and two of the same have a public hearing and the committee meeting right, but I'm saying: should we do that before or after we vote on it as a board? They should do that before because somebody might provide got it sound reasons for why? No, you should not do each chester gardens or this or that got it. Okay, sorry about that and my window open and motorcycles going by. So if we need to vote on this at the October board meeting, then we need to set up that public hearing early in October. Yes, I mean ideally the board votes on it, but in the past you know you submit it to the board. If they don't have objections, you can submit it. That way, I mean we, don't it it's better. It looks better it. I think it's better to have them vote on it. I think the bar should vote on it yeah. So that's what I'm saying so if we need to vote, we need the board to vote on it at the October board meeting. Then we need to set up the public hearing in early October right. I that's my recommendation and a committee meeting okay, so you can formally recap and then vote on it to present to the full board in October. Okay, I think that's a good plan so in terms of statement of needs, know that I don't know anybody want to discuss that or look at that of course. Yes, the link jeremy is clicked on the link. It's not working. Yes, I know that's the problem. That's a problem. Let me find the link the download link. Let me find it yeah city hold on. Let me find I have I have it. You can share it. You can share it through here through the webex. I can start with that, so the people of the public have it as well. Okay, can you email it to me, though, because I had because I want to do both I'll do both yeah? Thank you. Sorry, don't mean to be a pain, blame my internet. So that's a downloadable link. Anybody else need to email to them. Jeremy, just I'm a hard copy. I have a hard copy here. What page are we talking about? I'm not there. Yet. I just wanted to make sure everybody gets it first. Well, if I know what page it is, I know if I have it or not. Well, can you are you able to click on the link I just shared in the chat yeah, it didn't work, jeremy. The link didn't work, no and my well. I think it's because it didn't hyperlink all of it, so you have to copy paste. No, that's not that's! It should only be that link hold on my email's, not working now. No, what I'm saying is the link that you've placed only hyperlink partially and therefore, when you click on it, I know, but that's not the. Why isn't this working? If I copy paste what you sent? It works? Okay, so oh yeah, you're saying did you do you need it since he emailed to you still lisa? Oh yeah? No, I still need it. I just understood what she was saying, because I've done that before I've only hyperlinked like part of a of an address, not the whole thing, anybody else need email to them. No one wants just me all right, I'm sending it now. Thank you. Okay, so statement of community district needs and community board budget requests fiscal year, 2021, there's a picture of the city with gaming board. 11 highlighted how to use this report. Disclaimer full of contents, community board information 1741.. You know my name, al's name profile which comes from city planning. Daisy's texting me. Her connection got lost so page number. Eight, that's the first thing to review. Thank you, age. Eight. I think this is something I drafted a long time ago and I don't think I've ever really had to change and afford. How did we draft this to begin with? What's that, okay, like how did we decide what what are the overall issues? Is it based on complaints that we get? Is it based on requests that we get? Is it like? How are these what's the criteria for saying like these are our pressing issues? We have no set criteria, I mean I can tell you in the past, I've gone to committee board, meeting or committee meetings and to discuss this stuff to try to get people invited board members. I have gotten some information that way. Some of it's just knowledge right, like the hutch metro center coming in or not the hedge, the marriott hotel using the census data, there's no real set criteria, I'm all for some standardizing. This is old. Obviously it's just it's it has. I think we should scrap all of these yeah. I agree, let's start fresh with them with a criteria. Whatever that criteria would be, I mean one thought I had for a way that we can create. This is if we're looking at what we're putting in our budget requests right. That should try to inform some of the things that we're saying are pressing to our community right and so yeah a lot of requests from parks. We had a lot of requests from schools. We had a lot of requests from nature. According to our district profile, we are 49 rent burden, and so you know these are quality of life issues that you know that to me, based on what else has been requested, are the things that we should be prioritizing. There could be other criteria by which we judge this. I had asked if we had a complaint locked to see what people are complaining about, which we don't. That may be something that we should look into, but I think we need a little bit more strategic and about the way that we're putting these statements forth and it's just to come out of nowhere like we should have a backing as to why they're requesting these things. So you made a great point about budget requests and I think we should take the budget request as the as the model for near putting so the idea of statement of needs is narrative form, so we can talk about you know. Community 11 has three NYCHA developments, but among the three right now our most pressing need is an east chester garden and it can be worded that way. I think that's the idea of this, in my experience, does that make sense to that. I think that should be a way that we approach this yeah. I have a question: is there and this might be too big or too broad? You can get like a list of the like three one complaints that relate to our district and are they categorized in any way, because that could help inform it. But I don't know if a that information is available and b if it's like broken down in a way that could be helpful. That information is available. In terms to my knowledge, there is like you can look up noise complaints per community board. I believe through open data NYC, I'm not sure how really how much that will really inform our narrative, though, got it well, you said, noise complaints is that the only complaint that people? No, you can look up. As far as I know you can look up. You know the number of three one com like pooper, scooper complaints. You can look up number of pothole complaints per communication. I mean that could help with our budget requests like we had that you know roadway general roadway request, I'm just saying like if there was a way to look at the three one data that complains that come in our district and there's an overwhelming amount of complaints about. I don't know street unauthorized street parties or something right, then that could inform one of our prior community one of our priorities, because this is a big complaint in our community or something like that exactly like street lighting. Right, like that, can be an issue for safety like if a lot of people are saying this street is really dark, and I can't you know, go through here and it's affecting my quality of life, and you know my mental health, because I'm scared all the time, and at least that's something we can point back to like it's not right. We're not just saying that this is our priority, because we've got five board members who live on a particular street and they're mad right, which is, I think, kind of sadly kind of how a lot of our things are like. It needs to be like really informed by actual data from the community, and if we can point to 3-1-1, that's really, you know kind of unbiased and something that we can point to something you're mentioning like lack of street lighting and lack of sanitation. We have committees for all of these issues and if a person has a complaint and they bring it to the community board, that committee is made aware of it and then it is taken care of almost immediately. I can't tell you how many times people have complained to me about likes being out on the street called up. D.O.T was taken care of. We needed a speed bump, because the traffic was, they were running. You know ramping down the street. It was taken care of those are not budget priorities. Those are individual committee issues. I understand what you're saying andrea and that's and it's that can probably be the case, but I don't think it hurts to understand what people are complaining about is the little things like that are taken care of right away, or there are bigger issues out there that we are not hearing, because not everyone is informed of the community board's existence and what their role is correct. I agree with you yeah and like little things that are getting fixed, piecemeal could point to a larger problem that we might not see until you look without see if other people are having similar issues right again to deal with these issues, yeah like, for instance, like fixing street lights, you know we might fix one or two, because we know about them because they're brought to our committee, but you know what, if they are it's a larger issue, that's happening across our district. That needs to be addressed on a larger scale, but nobody knows about the ones that are not fixed that need to be fixed. They can't be done. Somebody has to make a complaint, and once that complaint is made, it goes either chris or harry. It takes care of it or goes to the committee and it's taken care of these issues, don't sit and nothing gets done about them right, but three, one complaints don't come to our community board. Yes, they do. Oh, they do. Okay, if I make a complaint- and I call 3-1-1, I then call chris tell him like 3-1-1 complaint number and he follows up right, but not everybody. If I, if I have a cousin who lives down the block and knows nothing about community board 11 and they just made a complaint to 3-1-1, do we find out sometimes 3-1-1 will refer sometimes 3-1-1, sometimes 3-1 will refer a caller to us. I mean I don't know if you heard this earlier natalie, where my colleague at board 12 was complaining about how department of health basically hasn't been doing inspections, or something like that so 311 started routing calls not to the department of health but to the community board. Did you did you hear that no yeah, that's one of one of my complaints. My colleague was making earlier with bro budget consultations with the department. I have one other thing then that I want to add andrea. You brought up the fact that these complaints are brought up to our committees and our committee chairs. Can we be active about maybe reaching out to each of the committee chairs to see you know, sort of give them a call, send them an email and maybe we can split and we each take two people or something or one person, and then jeremy sent out emails to each committee to every board member asking them to if they had any prior budgets that anything they wanted to put in this? Not one person responded except for that school. So the problem with that is some of our board members. Don't really use email. Oh, come on jeremy out of 50 board members. What three don't use it? Okay, I'm not talking about the general board members I'm talking about because we were talking about that committee chairs are supposed to be like committees have certain things to them to follow, and so like, for instance, I don't know whoever has connections with like the chairs of libraries. We call them, we say: hey we're putting this budget together. Have you talked to the people at the library and see if there's anything that they need? You know like I, don't I don't see anything wrong with being proactive about reaching out, even if the email wasn't out but yeah, no there's nothing. I can't volunteer to reach out to everyone. I don't have that kind of time, but I think if we were to split it, maybe then we can get somewhere to get people a little bit more involved by just having a conversation and just to add to it. Even though a lot of our board members use email more often than not, I mean I probably with some of you I'd like hey. Did you see my email and you know we're all busy right? We all have our own lives, and so we don't always get a chance to read everything. So that's another reason for I think it's going to be critical to get any type of feedback from the rest of the board members is you got to reach out to him and I think also, I agree- and I think also you know no offense jeremy, but constantly getting emails from germany all the time. People might clean it out, but if they get an email, no offense jeremy, if they get an email from a different person, they might be more, it might stand out more and make them respond, or even a phone call from one of us so yeah. I like that approach and just the opposite. If I see an email from silvio, I might not, I might just say forget about it. I think jeremy's email would be more important than silvio's, so it works both ways. Yeah someone, but some of our chairs. You can send them 100 emails. You can tell them. Look, I'm dying. Please help me. They won't respond. You need to call them right, they're, not interesting. Yeah jeremy! Do we have? Is everyone, okay with have that been cleared with us, giving them a call for the most part every there are a few board members that basically don't want to be bothered, but I think yeah most of them are okay. You do you tell me who you want to talk to and I'll arrange it. If I can't give you their contact info, okay, yeah, I'm fine with reaching out. I mean because I'm on the committees anyway, so so I have the contact information for both parks and transportation, so I can check in with both of those committee chairs. But, as you said, you already know what the topic- the top parts I know, transportation. I I'd have to talk with daisy and friend to see like what our priorities are really but like. I can. I only have a few days and going out of town, but I can I can reach out to a couple of people. Can I make a suggestion? This is going to sound, really foolish, but I'm sorry I think it's a wonderful idea, but I think it will be a better idea after we all literally get back together, because if they find out all the things we cut, why would they want to be interested in giving us any more items to put on the budget priorities? Well, I or we can talk about the ones that aren't cut depending upon the committee, but wait we're not are we talking wait, I'm confused. Are we talking about adding to the budget priorities list? Are we talking about? The community needs statement. Well, if you're going to reach out to community board members, what are you going to ask them you're going to ask them what their needs are and then you're going to tell them? Well, we don't have there's no money for that. Sorry, there's no money! For that! Sorry! Well, my thought was more that again we are sort of making decisions and assumptions without a discussion with a broader public right and if these people have reached to more members of the community, we have said okay. We are cutting this because this because the budget is not going to allow this or there's no money for this. But if we speak to someone they're like wait, my community really wants this is really important to them. Then maybe we should reconsider and put it on the list right, because otherwise we would just I mean, I'm speaking for myself, I'm making these decisions for what we're cutting, but I don't see, put the idea of putting more items on when there is no money in this fiscal year. I would wait till everything gets back to normal and then we have a whole different interpretation on how to go about these things. Putting more items down, there's no money, it's fruitless. So let me just add to it. If you don't mind, so I don't, I don't want to say talking about the things that we're cutting. I would more talk to them about what we're not cutting and try to get them on board with like parks department. We only we have generally. We pretty much only have one request, but I think it would help talking to other members of the board whether it's the parks I mean, maybe even outside the parks community like this is a real priority for us, and this is why and get them to buy into it and maybe help with it like keith ramsey is not on the parks committee. Is he no? No he's not okay, but he's in that area. So I think I think it would help to any because again we're going to need elected officials for some of this we're going to need people to reach out to elected officials right the more people you can. Jeremy, there's no money, they want to cut your staff and your salary from the office. Where do you think they're going to get money? To put I understand, but we got to think about long term. That's why I'm saying long term, let's get through this pandemic and then rethink all of this and then go about our strategy totally different than what we're doing now to keep asking people to more ideas when there is no funding is scrutiny. I agree again, I thought we were. I lost the conversation. I thought we were talking about what this the statement. This needs statement and the three pressing issues. Overall, that's what I thought we were talking about, but what natalie I think is getting at is because we're going to try to base the statement off of the budget request that we want to make sure our budget requests are solid and we have maybe buy-in right. I mean especially the board's gonna vote on it right, so maybe it's a matter of calling the committees and not asking them to andrea's point not asking them for more stuff saying this is what we have. This is what we have we. Unfortunately, this is what we've had to cut. Are you okay with this? We can't add anything more at this time, but you know this is what we. This is. What we're keeping this is what we're taking out. Do you have any like major concerns? Are you okay with this? Well, okay, like the fox compartment parts committee, you contact edith and tell her that you're not fixing the playground, ben abram's playground, she's going to have us blow a gasket yeah, exactly she's, not gonna care that you're fixing east chester. She wants ben abrams fixed, which is why I think it needs to be said in the right way. If you were to call her and not say you're, cutting this you're saying look we're making only one real parks request this year. We want to make sure you're, okay with this and you you'll buy into. We understand she's, not the chair, though so we wouldn't be calling her. We would be calling pat, that's true and pat should be not answering herself I mean in theory. She should be taking it back to the committee discussing with the committee and then getting it getting it to us, which was my. If you saw my email, I recommended that the committee chairs, maybe some others and not one person, did that so I think it's all. This is all fruitless. Well, not yet I mean I'm sure. If I talk to some of them, they would probably go with it, but again it needs that individual outrage. Yeah I mean if you think this is fruitless. Fine, I just think whether we do it now or next year or whatever that the idea that we are being a little bit more inclusive and proactive in you know telling people like this is what is being done so that it's not just, but if they only, they don't want to bother, and they just want another community at the full board meeting. Then you know, then that's the way that we approach it. I just thought that maybe there's a different way that we can start today right here. I just think it should be done when all this pandemic nonsense is finished, so that we can really have a discussion about why we're cutting things as opposed to there's no money. Okay, should we go back to the public since we're running a little late, yeah, it's probably so. Well I mean what about the statement of needs, though I mean we can just start. We just. We can just scrap the whole what we have and start here, let's scrap what we have we're starting over based on what we are. You know what our priorities are. Yes, so then we'll scrap statement needs I mean if it doesn't, if we, if it's blank, it doesn't really matter. In my experience, yeah we'll focus on the budget priorities to use that, for the statement needs whether it's this year or next year. That sounds like a good plan. Okay, so you turn over to the public. Okay bob. Do you want to go first, yeah, please. I was a former budget chair of community board eight years ago, and what I'm seeing here is a problem that the borough president hasn't taught the community boards how to do this? Okay, I had no problem in this andrea. We did this at the executive board. It was handed out to the committee chairs that this is when you got to get it done. We have x done and then, when the request all came in, they did it at their committee. We then did it in the executive boarding again. How do we want to place these? Do we want this one that one this two that too okay? It has to be really done by the committee chairs themselves, otherwise, at the board meetings that one's number one and not my guy, my guy, my request is number 20.. You know you have to have it done before you have the public hearing. So bob brings up a really good point, because remember we were just talk. We just decided on what to keep and what to cut, but we didn't talk about priority, so that would be another reason to when we, after we have a public hearing, have a committee meeting to recap and then actually look at the priority order. I'm gonna tell you one thing: jeremy after I was off board eight. The next budget share just did it and put numbers next to it, and I went into the community board office the day before to look at the budget priorities and they weren't ready. They were just done quickly overnight and at the meeting which took me about five minutes to hold the meeting less than or the public hearing lasted an hour and a half, because the board members themselves were fighting. You have to be prepared for this at your board meeting. Otherwise this hearing is going to last a long time and you're going to have members fighting, also andrea, how come there's nothing in the effort difter, because nobody, because if they didn't put any but any requests in it, can't be anything. This is why it's considering the elderly population of this community- but this is this- is going back to natalie's point. Is that if we reach out to the individual chairs like, I can see hazel who's, that the housing chair say: hey, there's nothing in here for housing. She would she'd probably make a recommendation, so I think that's maybe where we could add is where we don't have a request for of an agency at all like HPD or DOB right, and these agents of germany should be attending the meetings before budget departments are done. The parks, the person in charge of parks or community board 11 should come to the meeting and say well. We need this and we need that like over by me. We I was told we need a new mower for van courtland park. You know things little things like that or sanitation will say: we need a new street sweeper. Can you put that in yeah right? This really goes. That really goes back to the committee. Ideally, the committee meets with these agencies and gets this information. All right go ahead. Budget priorities in November is basically committee chairs. All right upon me, community, board, chairs and district managers. I sat next to george torres and he said to me: what are you doing here? You're, not a board chair or committee chair at the end of the day he said. Oh, it's a good thing you're here you know what you're talking about. I received the new auxiliary police van. I got finally the funding through for redoing, a new library and a couple other things that I can't remember. But it's all determination you were there: jeremy, yeah, okay, germany was pushing the roads that year. So so we have one other member of the public in attendance. Miss diaz. Do you have any questions comments? No, I don't! Okay, all right! So then, in terms of our next committee meeting and our public hearing, I'm looking at the October calendar and I the only availabilities I'm seeing if all the other committees meet like they normally would see the 14th of October, which is a wednesday and the 19th of October, which is a monday. What was the first date, I have wednesday October 14th okay on monday, October 19th open, clearly open. Look the other committees may not meet education hasn't met since Covid-19, and the chair of the committee just stepped down, so it's possible that other dates are. Their dates are possible and when is the book, so the full board meeting would normally be on the 22nd, which is good because say the board doesn't easily vote for your budget. Priority request and changes have to be made because, like if the meeting where, as far back as the 29th and they have to be submitted by the 30th, there's not much time to play with, I say I recommend that we go with the 14th, then to that point like yeah, if there are changes that we want to implement based on the public input that gives us enough time to do that before the board vote on the 22nd and then any changes from there, we can implement and then submit it on time. So what time are we looking at? Six o'clock is fine with me. It's up to everybody else. Yeah six o'clock is fine. Yeah six is fine, great okay, so 14th and 6 o'clock yeah daisy fell off. She was going to try to jump back on when she got home, but I don't think she'd be able to do that I'll. Let her know so anything else: old, business, new business nope. I guess we're adjourned, then my promotion to your turn all right meeting at 7 35 pm. Thank you. Everybody bye good night, bye, thanks jeff. Thank you.",
            "summary": "Is this: Is this memorial plaza This comes from a board member sylvia mazzella, and if you look at the details, they want a veterans memorial wall for all the Bronx who's falling missing in action personnel Next one is the reconstruct upgrade park or amenity to the pelham parkway park, Upon parking, mall.\nIf there's money available Does it matter to OMB Agencies, right that are dealing with these requests correct to OMB who how we rank these like.\nWe do the work here, or we at least do the brainstorming and if anybody wants to submit a make a suggestion any day of the year, like that, like the like As a former budget chair who sat at budget negotiations with jeremy, can I just explain a little bit of this?\nThat often, but I can close, I can reach out to parks department to confirm you know what I would say, get rid of it and use the money.\nYou know what, if there's money, to use it for the other playgrounds that we're okay, Or yeah, get rid of all the other ones and just keep each chest or garden since that's the one that needs it, the most that's another way.\nIf saying, are we saying in the parks right, like each agency, has a responsibility, so we're gonna pick one thing to focus on for each of the agencies that have requests and then, For this budget And we're only going to focus on east chester garden, because the parks department has agreed that is the most needed.\nBut in normal times, do we have like a targeted budget or amount that we're looking to ask for this We just know without govern , there's less money to right, but what I'm saying is like Is, the total amount of requests that we have on our list contingent upon a specific budget amount that we need to adhere to.\nOkay, it's probably going to allow money, but not as much as east, chester, gardens right.\nI would check, because ever since school started, going remotely all of a sudden, every school had some kind of they all got like ipads, one of those things called smart ports, not smart, boards.\nRight, okay, number, two discuss this additional police, office- I think money can be better spent.\nOkay, I think she wants to try jeremy, just because similar requests were in part of the capital.\nParks wanted the community board to pay the half of it since once a year, we generally had our carnival there and since they, Since they let us have the grounds and we get money.\nIt doesn't have to be a committee meeting because you don't One and one and two of the same Have a public hearing and the committee meeting right, but I'm saying: Should we do that before or after we vote on it as a board?\nOkay, so statement of community district needs and community board budget requests fiscal year, 2021, there's a picture of the city with gaming.\n11 has three NYCHA developments, but among the three right now our most pressing need is an east chester garden and it can be worded that way.\nI mean that could help with our budget requests like we had that you know roadway general roadway request , I'm just saying like if there was a way to look at the three one data that complains that come in our district I, don't know street unauthorized street parties or something right, then that could inform one of our prior community one of our priorities, because this is a big complaint in our community or something like that.\nAnd, it's that can probably be the case, but I, don't think it hurts to understand what people are complaining about is the little things like that are taken care of right.\nAnd like little things that are getting fixed, piecemeal, could point to a larger problem that we might not see until you look without see if other people are having similar issues right again to deal with these issues, Like, for instance, like fixing street lights, you know we might fix one or two, because we know about them because they're brought to our committee, but you know what.\nWe be active about maybe reaching out to each of the committee chairs to see you know, sort of give them a call, send them an email, and maybe we can split We each take two people or something or one person, and then jeremy sent out emails to each committee to every board member asking them to if they had any prior budgets that anything they wanted to put in this?\nOkay, I'm, not talking about the general board members I'm talking about because we were talking about that committee chairs are supposed to be like committees have certain things to them to follow, and so like, for instance, I, don't know.\nWe are sort of making decisions and assumptions without a discussion with a broader public right and If. These people have reached to more members of the community.\nThat's what I thought we were talking about, but what natalie I think is getting at is because we're going to try to base the statement off of the budget request that we want to make sure our budget requests are solid and we have maybe buy-in right.\nYou saw my email, I recommended that the committee chairs, maybe some others, and not one person- did that Fine, I just think whether we do it now or next year or whatever that the idea that we are being a little bit more inclusive and proactive in you know telling people like this is what is being done so that it's not just, but if they only, they don't want to bother, and they just want another community at the full board.\nHave a committee meeting to recap: The next budget share: just did it and put numbers next to it, and I went into the community board office the day before to look at the budget priorities and they weren't ready.\nIs, where we don't have a request for of an agency at all like HPD or DOB right, and these agents of germany should be attending the meetings before budget departments are done.\nAll, right upon me, community, board, chairs and district managers."
        }
    }
}