{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB6",
            "channelId": "https://www.youtube.com/channel/UCvg75CSQZIZSjsIffVNosmA",
            "title": "CB 6 COMMUNITY CHECK IN MAY 6 2020",
            "publishDate": "2020-05-07",
            "shortDescription": "",
            "lengthSeconds": "1:42:02"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB6",
            "normalizedName": "Brooklyn Community Board 6",
            "twitterName": null,
            "youtubeChannelName": "Michael Racioppo",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCKaVsnwHRM6uXG-_rrWwHqA/videos",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "9WyiCFkYBrk",
            "fillerWordCount": {
                "uh": 2,
                "um": 7
            },
            "readTimeFullTranscript": "65 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "state": 51,
                "businesses": 30,
                "nursing": 26,
                "homes": 25,
                "work": 25,
                "program": 18,
                "streets": 17,
                "crisis": 15,
                "staff": 14,
                "business": 14
            },
            "wordCountSummary": {
                "state": 11,
                "budget": 7,
                "business": 6,
                "businesses": 6,
                "level": 6,
                "work": 6,
                "nursing": 6,
                "ways": 5,
                "relief": 4,
                "governor": 4
            },
            "fullTranscript": "A great turnout and it seemed like it, went pretty well last time the sorry I'm just getting it's weird. Do not worry ins I've, never felt so popular, so many people, just like emailing me and texting- and you know that's one thing: I still want that to end. Actually, so it's but anyway, thanks for signing up I think we're going to go so I'll toss it over to Peter who is host who's. Our chair on the dismantling CB6 my Gracia, but I, think my name is underneath me and then Brad, whose staff was really tremendous in helping us set this up for the second straight month, specifically Megan Flynn, but also his whole staff. That is helping out here so I'm, going to toss it over to Peter and then to Brad and then to our Attorney General, followed by Scott's our New York City Comptroller. Thank you all for joining us. We truly appreciate it. We're sorry that this is the way it has to be, but we're our goal here is to provide you with the best possible information we can. You know with a with an array of wonderful guests, Tish and Scott and others, so we're going to do that. I hope everyone is staying safe, keeping their family safe, at least taking an opportunity to go out for the occasional walk on Sunday I went to Greenwood Cemetery, which I recommend tremendously. If you've never walked through there, it is peaceful and wonderful and great greenery and flowers, and as long as you follow their rules, which are not really very burdensome, but do not let the children climb, trees do not steal flowers for mother graves and be respectful to the fact that this is a cemetery and not a park, although in its early days before the building of Prospect Park, that's where people in Brooklyn took their leisure. They went to picnics, and everything like that in you know, in the early and mid-1800s to prospect, excuse me to agreement cemetery. The Community board has been doing what it can to you know. To advocate for your interests. We sent an email to the Department of Education and to the mayor about making sure that the schools are cleaned appropriately, especially before students and staff than anyone else uses them. We've also made sure that we can have as much local input as possible into what streets are left are open for walking. So you know, if there's an issue, that you think that the community board should take a position on I, invite you to contact to contact, Mike and we'll discuss it, and you know we'll do the very best we can to advocate on your behalf. So again stay safe for everyone. You know, guess you know, try and get out and at least get some fresh air and exercise while remaining socially distant, and let us know if there's anything that we can do for you to help make your life easier and I'll come back on the at the end to say goodbye, but otherwise we're going to pass it off to Brad and some of our other special guests so good evening this is councilmember. Brad Lander I will save my City Council report for later. In the meeting we got a lot going on in the counts. We had our budget hearing and budget legislative hearings for small business and workers rights and that open streets program that Peter just mentioned, but that will come later in the meeting. We've got some amazing special guests, so I'm just saying a word of kind of welcome, as maybe like the host tonight. This is my zoom room, so it's like, if we were in one of Anita schools, that the principal was giving you the welcome to the school before the meeting started. I'm, honored and I just want to say thank you again to both Megan Flynn who's here and Naomi Dan, who has provided so much tech support as we're trying to move into this. You know so weird world and do democracy in ways we never ever thought we would have to do it before, but on the upside we rarely get the New York State Attorney General who's busy and running around the state, able to join us for a community board. Six meeting she's no stranger to Community Board six, but it's a big state and there's a lot of downsides to the pandemic and a lot of downsides to trying to do democracy on video conference. But at least one upside is. We got more people on this call than we often have people really recognize. What's important, we've got some amazing citywide leaders and folks, like Scott, stringer who's going to be joining us and obviously some amazed using truly amazing statewide leaders, and it is just a delight to have New York State, Attorney General, just James here with us. I was just mentioning that she's helped push zoom to improve its security and privacy protocols and have not quite gotten to her standards. Yet, but at least they're back in the New York City, Schools and I feel like good enough for Community Board six. So welcome to our zoom room. Thank you. Mike Thank, You Peter and thank you thank you. Peter. Thank you. Mike Thank, You, Brad, Thank, You Joanne. Thank you. Kevin I see Kevin Parker in there somewhere. Listen I really have not been running around the state. Just teleconferences everyday conversations with the governor every morning on different issues: crafting executive orders, defending executive orders going after businesses that are not essential that remain open and going after pranksters and scammers and bottom feeders. But the bottom line is that communities are stronger when they stick together, especially during these trying times and listen when the skies are the are the darkest as they are right now. That's when star shined, the brightest and clearly all of you all of us working together we're going to come out of this on the other side stronger and more United than ever before. But let me tell you a little bit about what our office has been doing. I'm just touch on a couple of areas, because you have a stellar lineup here this evening and again it really speaks to community boards six and to your strengths and to your power and to the fat and to your sense of community. We have been dealing with, obviously individuals who, unfortunately, are preying upon the anxiety and the fears of countless number of individuals who are engaging in price gouging, and what I've noticed is that, from the beginning of this scam, the price gouging primarily focused on you know: health products, the mass and the sanitizers. We saw a lot of complaints at the beginning of this pandemic, related to price gouging in that particular year area. Now what we are seeing is its transition somewhat, and what we are seeing is price gouging. As of ladies two food products, eggs in particular and we're seeing a scarcity of meat products, and that is primarily due to, as you know, the supply chain and the fact that meat packaging companies in this in the South a number of them have closed down. And so, if you know, price gouging is a subjective term. You know it when you see it when crisis unfortunately increase exorbitantly, and so it's important that you reach out to us. We are investigating again the food chain to determine whether or not individuals are in fact engaging in price gouging. In addition to that, what we are seeing both online and face- to- face are individuals with all kinds of fake products, medicines and cures, all of a sudden to Covid-19 and 1. All of you to know that the FDA has not approved any at- home tests, no treatment, no cure or nothing or cream for the Prevention of or the cure of Covid-19, and so I urge all of you to reach out to them to our office and it's the they're trying to again prey upon the anxiety and the fears of countless individuals who, unfortunately, are paralyzed by all that it's happening. We all know that small businesses are the backbone of our economy. We've been working with Congress and with regards to the Paycheck protection plan, making sure that small business women- owned business, minority- owned business, local businesses take advantage of this loan program as foes as opposed to large businesses, and particularly business, is with connections and business is with lobbyists and businesses with a conflict, and so we are working with congresswoman Nydia Velazquez, who sits on the subcommittee as well as congresswoman Maloney as we monitor and provide some sort of oversight with respect to this paycheck for protection program. We know that there have been many issues with this program and unfortunately, we know that fraudsters are taking advantage of the confusion, so we are also helping to protect small businesses. We also know that some small businesses are taking advantage which are unfortunately being taken advantage by these payday lenders, and so we urge small businesses not to take advantage too take advantage of these payday lenders who are charging exorbitant interest rates, but go to small credit unions and small banks federally chartered banks to take advantage of this program. We have been called upon to mortgage service providers to offer immediate and long- term relief to all New York homeowners, I'm happy to report that Democrats right now are in a discussion led by congresswoman Maxine Waters, to provide some relief to tenants, they're urging and they're coming together around the package. That would include some relief for tenants who, unfortunately, are not in a position to pay their rent and for small landlords, we're hoping and praying that they are successful, because we do know that you know again working with the governor of the state of New York. He issued an executive order and right now he has stayed evictions for 90 days when that executive order is lifted. My fear is that landlords will go to the court and will seek judgments of eviction, and so what we need to do is provide them with some financial assistance on the federal level and I'm, hoping that our congressional delegation I've spoken to all of them and most of the members of the congressional delegation here in New York, who support relief for tenants and for small homeowners. We hope that they're successful in this next iteration of stimulus funding, as most of you know, we've issued guidance letters to all creditors hands off the stimulus money. It can not be garnished. It's important that individuals understand that stimulus money can not be garnished by creditors, and so, if they attempt to garnish your funds, it is illegal. Please reach out to our office. We've issued an official guidance to New York State banking institution creditors. Debt collectors make it clear that stimulus payments can not be garnished. We've called again on mortgage service providers to provide relief to homeowners struggling to make payments in the midst of the pandemic. We have also in the Office of Attorney General. We have suspended the collection of state student loan, debt and state medical debt. When individuals heard this they reached out to me, and they thought it was all medical and all student loans. No, it's just state- owned student state- owned debt related to student loans, as well as to medical debt from our state facilities. We have suspended any collection, and so we just we just wanted to provide some relief to individuals during this time of our. In this time of crisis, we fielded thousands of complaints from employees about inadequate safety protections. As you know, we're looking at Amazon. Unfortunately, an Amazon worker died. Yesterday, a number of whistleblowers were fired. We are conducting an investigation into Amazon and two other businesses again about inadequate safety protections for essential workers and those who serve us each and every day on the front line. The Good News is that the vast majority of companies are cooperating with us. It's amazing when we call they cooperate, and so we've not had to go to court to get temporary restraining orders in that regard. We know we do know that. Unfortunately, what has what we all know is true is that this pandemic has revealed fault lines that fall along racial lines and economic lines, and that's why we've called for expanded treatment, expanded capacitive capacity and rapid testing and hopefully expanded treatment, and so all throughout the state of New York we've been working with a coalition of elected officials to expand testing and communities which unfortunately, have had a disparity em, who have been Distin impacted in a dramatic way along racial and economic lines. We've also urged them to expand language access along in those hotspots all throughout the state of New York Oh. Unfortunately, we've seen a lot of bias related incidents against our Asian brothers and sisters. Hate will not be tolerated not only in Brooklyn but anywhere throughout the state of New York. He has no place in our society and anyone who is being victimized by a bias incident has been victimized by a bias incident. Please reach out to our office for a full investigation. We must protect vulnerable communities during this period of time. We must stand up and stand with our Asian brothers sisters and let them know that they are not alone. We are also fight in court fighting to halt the implementation of the public charge rule which would deny immigrants I'm Assistant. It's basically a wealth tax, a wealth test that this administration has imposed upon immigrants which- and if immigrants rely upon some sort of public benefit, they would be denied a green card, and so well, we are. We are currently in federal court in District Court, urging the judge to halt the implementation of that public charge, rule which I view as nothing more than a wealth test. As you know, nursing homes, yeah, we've seen a lot of death and a lot of the infection rate continues to go up, and so the governor has appointed me as and with the Department of Health. We are investigating nursing homes, all throughout the state of New York. We will be issuing a report. We have one urge that all pee all nursing homes have access to PPE that everyone get tested, including residents and staff, that any positive coded patients be isolated from non COBIT. Positive individuals that we have disease infection, control measures in place and my battery is going low and we continue to ensure that they have adequate staffing, which is absolutely critically important. You know, prior to this focus on nursing homes, most nursing homes did not have adequate staff and it's unfortunate that the Department of Health was allowing positive Covid-19 patients to be transferred in certain nursing homes, and so nursing homes have become petri dishes, and you have these fragile individuals who, unfortunately, we're not with loved ones who, unfortunately, are dying and it just anyway. We will investigate we'll get to the bottom of this and we will be issuing the report but, most importantly, we're going to investigate nursing homes each and every day. I have an entire team of investigators and attorneys nursing- homes with the Department of Health. We have also issued guidance letters on funeral homes as well as crematories. As you know, we saw that horrible incident in Brooklyn the 60 bodies were piled up in a unfree on a unfree, refrigerated, U-, Haul truck, and so now individuals can have their loved ones. Funeral homes from outside the state of New York can now come into New York and individuals can funeral eyes their loved ones and have them cremated in a respectful in a timely matter manner. So, and then. Lastly, we've been working with online retail Amazon, Google, Facebook, eBay and others demanding that they remove items due to price gouging and items that, unfortunately, falsely marketed market are marketed as cures to Coronavirus. These are just some of the actions that we have been taking, even though we're working remotely from John we've got a full fledge focus on all of the issues in the state of New York I want to thank Community Board six for allowing me to say it's. The worst I appreciate all the work that you were doing. Thank you. So much for joining us I could be hurt. Okay, next question general Mike's going to MC but I'm watching the chat about the election and you know what's the decision on the primary and yeah. So, as you know, yesterday, individuals who were on the ballot to serve as delegates morning court, they argued that it was a violation of their constitutional right to associate and associate as well as their First Amendment right that case. As you know, I represent the state of New York. We are filing an appeal: will make go, there'll, be a determination at some point in time as to whether or not the presidential primary has been cancelled in the state of New York. We do know that there are other primaries scared for June 23rd I've, advocated that we go to an absentee ballot system with the governor of the state of New. York is mailing out absentee applications to all of us in the state of New York, but voting, but polls will be open on June 23rd for the local primary we've got a primary for state, Senate I believe in that covers community board six. But at this point in time the presidential primary is off. We will see whether or not the decision, the district court decision is overturned by a higher court and I have a responsibility to defend the state of New York and it is to defend the Board of Elections all right. Thank you. I think that we're going to go to before the claping starts our New York City comptroller Scott stringer. Thank you for joining us. This is your second appearance at CB6 during my tenure. The last time was in person, but I do not get clapping, no he's going to clap for you. It's always fun to follow the Attorney General, but, as somebody who follows, will work very closely I think we really have a where we need her and that's fighting for struggling in New, York or so. I definitely want to do a clapper, just James, and all of the elected officials who are on look I want to be I'm going to cut right to the chase, because I see all the people we're going to speak tonight and I do not want to take up too much time, but I did want to come on and just give everybody a sense where we are economically in the city about a month ago or so now. I said that we would lose some six seven billion dollars in tax revenue at the beginning of this epidemic and unfortunately, we have been fairly accurate in what we're facing both in budget year 2020 and also next year in 2021. We crunch some numbers just yesterday and we are now pretty sure that we're going to lose 900 and jobs and city many people who had jobs, pre Covid-19, who now will lose their jobs by, but by sometime in June. We calculate that, based on the number of unemployment claims filed, which right now is seven hundred twenty- five thousand. So we think looking at the numbers, it will be close to 900 thousand I. Also looked at where this virus has hit hardest and we have to own up to the fact that this virus is very discriminatory. It does not treat everybody equally, it goes after the elderly. It goes after people with pre- existing conditions, people who suffer from diabetes and other committees- and mostly this has impacted not totally, but this is impacted communities of color people in the Bronx and Brooklyn especially hard, and that's a real conversation we have to have now and in the future, because we could no longer budget to totality, but we have to start measuring the success we have trying to eradicate rather eradicate these health disparities. It's very clear. The governor has asked me to take a look at hospitals and we're doing that, but we're also looking at what the challenge is to make this City Hall. Some of you were around in the 1970s, some of you around in 2008 during the financial collapse. Some of you were around during Hurricane Sandy and the way we were able to fix our budget Hall was doing a number of different things and that all has to be on the table. As far as I'm concerned, the state has a thirteen billion dollar budget and to make matters worse, the Brian, cabin and Joe and Simon are not with this, but the governor's proposal to cut spending will impact New, York City, another three billion doubt so couple of things I just want to say to what a couple things like: what does they love you? One? We all still have to recognize that the federal the federal stimulus has not been equal across the board, New York as the highest number of cases, and yet we have been shortchanged with the stimulus package we get roughly from the feds$ 9,000 per on a case. The state of Montana gets 1.2 million dollars on a case, even though we're at the epicenter. Even though New York City centers 35 billion dollars more to the federal government, then we get back 35 billion, we have been shortchanged. So the way we're going to come out of this ultimately is with the stimulus package that reflects state aid. Local aid. A lot of people are rightly talking about the rights of frontline workers. The people who are struggling and I do think that we have to set aside billions of dollars in this multiple trillion dollar packages. The congressman is approving and we knew we do need to start a Victims Compensation Fund the same modeled after what happened after 9/11 for the cops and firefighters and first responders, we now have to include nurses and doctors, transit workers and teachers, all the people who sacrifice their lives to keep the rest of us safe, the delivery worker who comes to the door with a mask you'll, never even shake that person's hand. You can't even handle them a tip, so you have to include it and that individual some of them may not make it to the end of this, and we have to make sure their families are whole, and that is another part of this. That I think New York City should need on for the for now. I think we have to be careful that when we think about how we balance the budget, it can not be on the backs of the most vulnerable. We can't start with talking about furloughs and layoffs. We have to talk about outside contractors and efficiency in agencies, and we have to identify savings. I've said long to the my friends and council, you got ta save some money in good times, because you never know what comes our way so now we know it has hit us and we have to think strategically as a thinking about the budget. So there's going to be some tough choices, but I do believe that we have to make sure our frontline workers are protected. Our kids are protected and then I think that, as we open the economy, we also have to think about how we reimagine the city, and this is where brain power and community- based planning is really going to take. Hold. We've got to look at our streetscape and we have to look at how we used to do things realize maybe it's time to just do things differently. We talked about health and social services and our communities that have struggled, but we also have to reimagine how people going to get to work, how kids are going to get to school, how we're going to teach our children? How we going to protect people, how testing is going to become, in the short term, a critical part of society, so I'm throwing a lot out there from an economic perspective, because this is going to be probably the biggest challenge. Some people said well, this is a lot bigger than the 2008 recession and I could show you numbers where this Dwarfs the said the city's fiscal crisis in the 70s, and you could really do some parallel between the depression and where we are potentially, and this means that the way we used to think about governing, which is well throw money at something if it sticks it stinks. If it does not, you know we'll go, do something else. We have no room for error. We have no room anymore. Every dollar has to be accounted for, and by that I mean, if we're going to end homelessness and educate our children and command a presence in all zip codes, wealthy zip codes, but toward the zip code to struggling communities. We're going to have to look at this budget and we're going to have to gear it to neighborhoods most in need. So that's what I want to come and say to all of you. Many of you do not need to hear this from me. You've been fighting this fight both on this community level and each and every one of you in city government with mayor De Blasio with Tish James elected officials, who are the best in the city, so I do not mean to tell you what you that you already know, but I do think. If you need more numbers from me on the budget, we are crunching very heavily Gary, you know and others so that we're happy to provide it and because on the phone on the line and she'll stay for the meeting. Okay, thank you comptroller very much and take always does a very good job at these meetings. Yeah. Thank you. So much. That's a like he's back at his screen. Now we were going to go sticking with the state and city wide theme. So now we're going to move over to Lincoln Ressler from the mayor's office. Lincoln welcome to CB6 virtually Mic. Thank you so much and thank you Peter. It's an honor to follow two of our best elected officials, Tish James and Scott stringer. Thank you guys for joining us. As a former CB 2 member in Brooklyn, we've always felt the healthy competition on the better Brownstone Community Board, but it's an honor to be with you guys. Tonight. I was until earlier this year, deputy chief of staff to the mayor, I had I think his out, but you know famously said just when they you think you make it out. I had resigned, Kovach crisis happened and they pulled me back in so I've been happily trying to help wherever I can in the face of this crisis and had a chance to work with some of your great local elected officials like Joe and Simon, and Brian Kavanaugh and Nydia Velazquez Kevin Parker Bobby Carol, Brad Lander, you guys have some of the very best, so I just wanted to give a few quick updates from City Hall on some of the key items that we've been prioritizing and I know. I'm joined by a couple great colleagues from city government as well, who can plug in on some more specifics. David Nussbaum and Julie men and thank you for joining us. So a few quick items, one following up on an item that Tish mentioned, which are the tragedies that we've been facing in our nursing homes, mayor De Blasio, has made it a major priority to try to step in and provide support to nursing homes across New York City. This week alone we are distributing three million pieces of PPE to nursing homes and we are also providing staff to two nursing homes across the five boroughs. I think we were all shocked by the tragedy at Cobble, Hill, nursing, home and Assemblymember Simon and Congressman Velasquez have been following up with me regularly on, what's going on there and how we can help and I'm proud to report to two CB6 today that we've just signed a contract with a couple whole nursing home that will provide 40 additional clinical staff to that nursing home to fill all of their needs overnight, shifts, etc, to make sure that they have the support they need to weather this crisis. Some other key updates. The mayor announced we're distributing 7.5 million masks across the five boroughs, including distributing out of Prospect Park and other locations around CB6 check, NYC Gov for more details. I wanted to share some updates on the food front. We are now distributing approximately a million meals a day. You can go to 500 different schools in New, York City and pick up three meals for free, so almost every other school building in New York City. You can now go to get breakfast lunch and dinner child adult anybody, no cost and we're delivering almost 500,000 meals to people's homes, so for Homebound, seniors and others where we're making sure that they have what they need. You can call 3- 1- 1 to sign up if you need it and I'm really excited that locally. In Tv6, we've been partnering with CD 6, member Joe and Brown to distribute food directly to Warren Street houses and if folks in white call for Gowanus or red houses or other developments in need across CB 6 need large- scale deliveries of pantry bags. We can bring that to your doorstep and we'll work with you to hopefully get it distributed to the families in need for seniors in need in the developments, because it's Eric McClure world and we're just all living in it. I wanted to give some updates on open streets, so I think. As everybody hopefully knows, we have the mayor and has announced that we're going to be doing 100 miles of open streets across the five boroughs. Eventually, we started modestly, so I think we're at nine total miles that we've announced, including Prospect Park West, see you later comptroller stringer I got out of the meeting. Sorta, always good to see you thanks Lincoln, so Prospect Park West from Garfield to 3Rd is closed, and we just announced today a couple streets just outside of CB6 in downtown Brooklyn, Lawrence and Willoughby are going to be closed as well. If you have additional suggestions, we'd love to take them we're actively looking to identify additional streets for foreclosure for pedestrians and the last piece I just wanted to share. Is you know, as we look toward the next phase of fighting this virus? The key lens that the mayor has prioritized for all of us at City? Hall is how do we reduce the rate of transmission and to go further? We need to dramatically increase to further reduce the rate of transmission. We need to dramatically increase the availability of community testing now we're about 10,000 tests today that we're doing in the city we need to, and we have plans to increase that many times over in the weeks ahead and we're going to build out and the states doing the same large contact tracing operations so that when Mike were hopefully not Mic, test positive, we're reaching out to him the next day as the positive test comes through identifying all of his close contacts and then hopefully providing some meaningful opportunities to make it easier for him to quarantine or isolate at home and or even in a hotel. So that's the next phase for us testing, trace and providing the appropriate care is how we're going to get through this and reduce the rate of transmission sufficiently to be able to fully reopen our society. I'm happy to try and answer a couple questions. I've got a seven o'clock that I think I'm a little late for it too, but if I can follow up, I'll leave my contact information and make sure that the right city agencies get back to anybody with any questions and really want to thank my computer and the whole Cd16 for letting me join today. Thanks so much Lincoln appreciate it. I do not have any questions. There are because I've been feeling like eight million text messages in the last minute, but we're going to go over we're going to shift over to the state a little bit. I know: Bobby is a busy guy and my friend, Bobby is up next I know, there's some interesting stuff he's working on with legislation for insurance protections and not the I'm, sorry, not insurance protections. I phrase that incorrectly but you're. It's your floor Bobby good evening, CB6, Thank, You, Ma I. Thank you, Peter the whole board for bringing us back together. You know, I do not want to reiterate all of the smart good things that the mayor's office, the Attorney General, the controller are doing, and my other colleagues, one of the things I wanted to highlight tonight is something that we've been working on in the state legislature, which is business interruption insurance as we start to flatten this curve and hopefully look towards how do we reopen New York, one of the most important things that we're going to need to be is to assist our small businesses or nonprofits, and one of those ways is to get them working capital, even if it were safe to open these businesses tomorrow, many would not be able to because they do not have that capital. But of course, so many of these businesses for years have been paying business, interruption, insurance premiums, thousands and thousands of dollars every single year. Sometimes tens of thousands of dollars every single year and all of their claims for business interruption insurance across the entire country so far have been rejected. This is unconscionable and it must stop. The state legislature does have the authority to step in and look at these contracts and come out in favor of small businesses that did not have equal bargaining power when they entered into these contracts. Do not understand that in contracts that are two three hundred pages long, that two or three sentences were slipped in the year, 2004 that excluded viruses and that will be interpreted to exclude this pandemic. If we do not do this and we do not try to save our small businesses, the economic outlook that Controller Stringer was mentioning will become so much more grim because, of course, most New Yorkers are employed by small businesses, and these businesses are the bedrock of our communities and one of the reasons why we all want to live here in New York and makes our cities so great and so interesting. So it's something that we've spent a tremendous amount of time. The other thing that we spend a tremendous amount of time every single day is the Department of Labor. For whatever reason the governor refuses to say that it will take more than 72 hours to get a call back so I'll say it will take more than 72 hours for the Department of Labor to call you back, especially if you are looking for pandemic unemployment insurance, if you're a gig work or if you're, somebody that does not just have a straight w-2, please feel free to reach out to my office. I'm short, my other colleagues in state and city government are also constantly talking to their liaisons at the Department of Labor, their liaisons. With the governor's office, we are trying valiantly to get every person's claim filed completed, so you can start receiving those checks. Please do have patience, but please, if you are at your wits end, please feel free to reach out to my office at Carol or at my assembly. Gov- and the final note I want to just make- is that there is so much great work of so many places in my district that are doing work to help feed hungry families. I want to highlight just two of them here: I was there on Coney Island Avenue outside of CB6 at COPO, that is feeding thousands and thousands of families every single day, please feel free to reach out to my office. If you, if you have issues feeding your family, our public schools are great. We have some great nonprofits as well, so thank you. Everyone and hopefully we all get to be I, see everyone in person sooner rather than later, thanks Bobby I, think I know that Tremayne Assemblymember Tremaine right had jumped on just to say hello. Very briefly, is my understanding. She was decided as a panelist. I do not know if she's still on mute, oh yeah, oh I'm, sorry hi, everyone good evening. Six! This is Assemblymember Tremaine right, I, just wanted to pop and very briefly say good evening, reach out to everyone I'm glad to see such a wonderful showing for this community board. Meeting I too come from community board. I spent almost 14 well about 14 years on community board. Three, so I truly appreciate the value of community input in all the decisions that we make here in this city. I am my office similar to a member Carol is working on a lot of unemployment claims. We are available to assist any way possible, we're also working very diligently to make sure that our small businesses have a way to access the funds that are available, we're working on a grant program with one of our local natural profit. So please reach out. If you have any concerns and thank you very much. I hope that earned one has an opportunity to pause a little bit reflect and just take care of themselves, because these are really trying a stressful times and I invite you all to participate in our breathing meditation. It's 15 minutes every Friday at noon. It's just a moment to be very deliberate about taking care of ourselves. So thank you. Thank you see B-36. Thank you. Thank you, I think. Next we were going to go to another state. Officially, I know that I can't see everyone, but I know that Senator Cavanaugh is on the line. I have our housing chair, great I. Thank you very much. I'll try to be brief and I appreciate. I, know people a lot of people here to speak, but as well. Thank you for having this forum. It's terrific to see everybody we, you know our office has been. You know actively engaging and all the services people have been talking about. I do emphasize Bobby Carol's point. If you are having trouble with unemployment insurance, we do have a kind of more direct line to address that. We've also pushed for the state to make a lot of changes to the system to make it easier and more efficient and there's a couple of documents on our website that lay out our proposals to smooth that even further, but we also can integrate and try to get you the resources as soon as possible. We also been working on you know all the other sort of basic needs of people PPE and food, and you know the sanitizer and all the things. People I never understood the importance of until this crisis we were the Attorney General mentioned the nursing home on a situation. We were some of us at Kabul health center, both to discuss the situation there and to see what we could do to assist. We have been able to provide them additional PBP and other equipment PPE rather and other equipment and we're. You know, that's a continuing effort to make sure that the resources are there. Obviously I think there's also this inquiry, which is really nationwide and but certainly statewide about what has gone wrong in the nursing homes and what can be done differently. So we can, you know, reduce the horrible rate of fatality we've had in those particular places. I wanted. So I was mentioned on the housing charges. I do want to focus on that, in particular for a minute we have been working. You know we, the Attorney General mentioned, there's a 90-day moratorium on evictions. There is a similar provision in place, the federal and the state level for mortgages. You can't be yeah banks, lenders can't take adverse action against you because you failed to pay mortgage during a set period. It's actually a 90-day period in New, York and 120 day period at the federal level and the eviction moratorium was a complete moratorium. There. No people can't begin cases, they can't enforce fiction orders, but those periods will and eventually I would expect that they will be extended. The mortgage more attorneys, sorry, addiction moratorium is 90 days and will expire even mid. June I would expect that, given where we are in this crisis and the economic as well as the public health crisis that will get extended at some point, but to address the question of what happens next, we are working on to ensure that rent can get paid. That will depend on resources from the federal government. So I worked with colleagues money from around this phone today, and this was meeting today to get a request to the Congress to provide a hundred billion dollars nationally in the next stimulus package, Detroit housing, at least ten billion of that to New York several of our colleagues and at the Congressional level. I'm joined that and in fact some members of Congress are pushing for much larger amounts of money to be in the stenos, so I think it's important to get it's important to get that money, but it's also important to be prepared to spend it. So we've developed a program. It's ensconced in a bill called Senate bill as a t14 ta, and the goal is to create a program that will basically pay the rent that people can't pay during this period. With respect to mortgages, we have a proposal. Most mortgages are not within the jurisdiction of the state, so if a mortgage was either initiated by a state chartered bank or in some case of its servant, serviced by a state entity, we can address this, but we're working with members of Congress on this as well. The state proposal would be to take to extend the forbearance period to six months and then with an option to extend it another six months, if they're, at the request of the borrower or if there's continuing hardship and the mortgage payments that would be due during that period would be could be delayed to the end of the mortgage rather than to the end of that period. So if you fail to pay six months during this period and your mortgage expires in January in January 20:30, it would now be extended to July 20:30 without any penalties, or you know, interest occurring during this period. We've worked with. We announced that a few weeks ago with Kathleen rice, the Congress members in Long Island, who is proposing the same provisions of the federal level. So we think between those two measures we would get at all mortgages and we're hoping to move that forward legislatively I. Think we're so very cognizant that the homeless situation, which was already a crisis throughout our city, has been exacerbated by the pandemic. It in a world where you're trying to keep people distant, where you're trying to keep people be able to you, know wash their hands and do all the other things we're all try to do routinely. It's very problematic. Definitely so many people living in congregate, settings living in public spaces in some cases, so I think part of that package ought to be addressing much both additional services for people in Shelter, so that we can get people into places where they can be isolated and the city's already doing some work to expand the use of hotel rooms rather than congregate settings. So we need to do that and then we also need to have a much bigger commitment to permanent housing for homeless families. You think I will stop. There obviously I'm happy to take questions, but they never do the end of tonight as well. Sorry Center, minder Singh is there were some questions directed towards you. Megan I'm, trying to I have all the chat as well: oh yeah, something about in the Q&A for you and for Assemblymember Simon. Since you both passed, the herbal gun sense bill. If there's anything that can be done to further discourage COBIT, related gun, purchasing and hoarding ha I'll confess, that's a new one. Now Joanne and I work very hard on gun, violence prevention and you know I work on that attitude nationally. As chair of something called American state legislators forgotten violence, prevention, I was a 50-state organization working in every state I the gun was in New, York are, but we've strengthened them dramatically in the last couple of years. They are now among the strongest laws in the country we're liking. I. Think fourth, is the assessment and how strong are analyzed relative to other states, and we have the third lowest rate of gun, Milland death in America per cap, but I know. If people have people have a right to buy guns in New York, and they it is it is they have to have a permit specific to a handgun. That is also true of long guns of rifles and shotguns and other such things in New, York City, but not in other parts of the state. So I I'm not sure what a provision that says you know during a pandemic. You can't buy so many guns, I'm, not sure what that would look like, but I guess we'll I'll talk about it, some more and see. If folks are thinking about that either elsewhere in the country or in New York again, I would just note that in many parts of the country you can buy and sell unlimited guns with very few restrictions, including no background check still in most states. So we are a relatively restrictive state, but I have not heard anybody talking about a specific limitation because of the pandemic. Thank You senator so I think next we're going to go. Jo- Ann, followed by Brad and then sorry I'm still getting the list but yeah, so some of them were signing. Thank you, hi. Thank you. I just took a little frolic and detour to be on a zoom happy birthday with a colleague, so you know we're just juggling all the zooms here we just zoom in and everywhere so I want to. First of all, I want to thank you, Mike and Peter, for hosting this again and to all of my colleagues in government for participating and a tuition Scott for getting on the zoom call with us and just a you know, a couple things I do not want to repeat what's and said: I think all of us at the state level are overwhelmed with unemployment pandemic unemployment, the varying permutations of that. The fact that even people who have filed and their applications have been approved and they're logging in on a weekly basis to say that they're looking for a job doing what they need to do still have not to check, and it's been five six seven weeks of some of them, and that is really just untenable. And it's something certainly that I brought to the attention of the leadership in the assembly and I know. My colleagues have done the same. The nursing home issue, as Dan mentioned I've, been working very closely with Dan on Cobble Hill, and you know it's really brought into stark relief. Some of the inequities in the way that the nursing homes were treated Visa Vie, the hospitals. It was just much harder for them to get staffing much harder for them to get PPE, not a lot of people paying attention to that, because there was a lot of a lot of chatter in the ozone about. You know acute care all the people in hospitals on ventilators, which is clearly extremely important and clearly shocking to the conscience in a lot of ways. But the nursing homes were not getting some of the attention and I think they probably needed and I think that we'll see after the investigations that are done, that we will find that there are a lot of ways that we can improve the way we as New York works, work with and help our nursing homes who are caring for our most vulnerable citizens and make sure that you know we look at these congregate care settings if you've been watching Rachel Maddow she's been on a tear about this, and it is something that is not a problem unique to New, York or unique to pro Kleh nor to Kabul Hill. There are now several nursing homes with many more deaths, for example, as a result of Kovac 19, and so they all need some help and they all need our attention and we're looking to improve things as opposed to just being critical. You know we need to be critical of the things we need to be critical of. We also need to be supportive of the work that they do and make it easier for them to do the work that we as a society, as have asked them to do. I also want to just you know, mention you know. Obviously the small business issue is a big issue in my district as well. I think we're all struggling with ways to help small businesses, please that the Chamber of Commerce of Brooklyn Chamber has started a new fund that will give low- interest loans or no interest loans. That's supported by various donors, to small businesses and I think that will make a difference, but obviously what we need really is federal money coming into the system to support Scott was you know, Scott stringer was right, so it was the Attorney General. There's no way that we can allow our small businesses to go down. It's not only critical to our economy, it's critical to our quality of life and our safety. You know when we have businesses that are functioning are our streets of safer, more eyes on the street. They are part of our community and they really make a difference in the life of our community and we're just seeing a lot of difficulty for them and we're working on various ways. I know: Brian talked about one of the bills that he's been working on with regard to supporting both residential rents, as well as small businesses. So you know I support all of those efforts and we're working I'm working with a lot of my colleagues on that. I'm also hatching another idea, which is not ready for distribution. Business has not hatched yet that might be of help to our small businesses. Also and I just want to say one thing about student loans that Tish mentioned about the work her office has done in the last cares: Act there was a suspension of federal loan payments. If you have a federal federally guaranteed student loan, they will not make you pay that until September, so it's basically suspended through September, and one of my recent newsletters I had a lot of the links with the information about that, but I'm certainly happy to push that back out again, if that's helpful to people, because that's a really critical, critically important issue as well for so many people and just to say that if you, if you have questions, we really do want to hear from you, the staff is working extraordinarily hard, as is every elected official staff. It's Simon J@Ny assembly gov and my phone number is seven one, eight two four six, four, eight nine and we will be working on getting masks and sanity hand sanitizer to two more people. Now both the public housing has the hand sanitizer they have the masks, cleaning supplies our big issue so I brought that up to the leadership attention to is the way that we can get cleaning supplies because really nobody could get it's like a supply chain issue and people just can't get. You know the detergent to clean the floor is then I know that that's been an issue. That's been raised to me by public housing, as well as the food issues, so we're working on all of those issues. Please let us know what we can do to help you and also what, if you would have any ideas or any ways that you think we can be of greater help where we can help our neighbors in need. I'm, just incredibly grateful for all of the work that so many members of the community have done to help support our restaurants by providing foods to the hospital staff and to the emergency rooms and to each other, and so it's a really great way that the community has stepped up, and we have incredibly creative community in this district and I know that we put our heads together, roll up our sleeves, we'll, be able to find other ways that we can help make this time, which is so difficult easier for people. So thank you very much. Thank you very much. Joanne. The next person that we're going to hear from is Julie menin and she works with the census. That is such an important thing for this neighborhood and for the entire state to be with you all and I'm, really thrilled to be here with Cv6 I'd shared Stevie one in Manhattan for seven years. So it's great to be back with some of my fellow Community board members, so I am now running the census for New, York, City and I really want to emphasize it at this time. When Kovin, we obviously in New York City at the epicenter of Kovin. It's really a shock reminder of why census is so important. Its funding for our hospitals in 2010, only 62% of New Yorkers self responded to the census in Brooklyn, the numbers were even lower at 55% and I mentioned that, because if we had a better response rate, quite frankly in 2010, we would have had more funding for our hospitals right now during Kovac. So where are we right now? As a city I'll? Give you the numbers for Brooklyn we're at forty three point. Four percent of Brooklyn Heights have responded to the census that compares to nationwide fifty- seven point three percent, so we're still significantly behind in Brooklyn other parts of the city. I want to be honest, we're doing better than Brooklyn, and so we really need to increase these numbers. So that is why I wanted to join you tonight. We are doing many different things: we're phone banking, we're doing text at bonds with the fact that a third of New Yorkers lack access to Digital. That makes it obviously much more difficult, and so that is why we're doing a lot with phone banking I do want to say for all the elected officials that are on the call. Thank you so much. We really need your help. If you could, please continue to send glass emails about filling out the census for all the Community board, members that are on there there's a very simple way that you can help. First of all, if you've not filled your census out, you just go to my 2020 census job and while I'm speaking literally, you could be done in several minutes with it. Most importantly, if you can post on your social media, if you have social media, that would be really helpful as well so I know the time is short, so I will stop there and just urge everyone to please make sure to take the time to fill the census out. Thank you, Thank You, director, Menon or Commissioner Menon, I'm, sure, I, know the more the Commissioner previously yeah next up, I think we're going to go to Brad, then Kevin Parker, then remember Ortiz. There is text of who's there and I can't see the whole crowd, but those are the next three so we'll go to Brad thanks very much Mike and I appreciate these are challenging and I really want to appreciate everybody who's being so patient. We've got our superintendent and janja Rinku from NYP, Methodist and folks really want to hear from them. So but I was there's a lot of critical information and truly thank you. So much for the work you're doing to lead on the census and I would just urge everybody to go ahead and fill it out, but then maybe get involved in the text. Banking or the ways of getting other New Yorkers to do it is critical. I want to underline what our state electeds have said about supporting small businesses. A lot of you have reached out and I just feel like that is so utterly critical for saving our neighborhood. You have Dan Wylie on the call from Congressman Alaska's his office. She chairs the House Committee on small business, but unfortunately I know the GOP have really been holding hostage the small business support. We really need we're trying to do what we can at the state and local level. We've got some legislation that will suspend sidewalk, cafe fees and cap. Seemless fees and I see an idea. That's been in the chat and other people's have talked about. You know it's great to have. Prospect Park West opened finally for pedestrian access and we got to get more streets open, but from Wuhan to Atlanta, they're, opening up streets for restaurants to put some of their tables out on the streets, and when we get to that next phase, where we can't be in big numbers back in those restaurants. Finding a way to do that. Not only what helped us feel human in this summer, but could also actually be a way of providing some genuine revenue to those businesses. So that's something I'm going to be pushing for in the council on one set of very small businesses, freelancers and independent contractors, and folks who are self-, employed, we're having a town hall tomorrow night that I'm going to paste in the chat which is going to talk about how to apply for pandemic employment assistance. If you are going on to an independent contractor and provide some other special resources as well. So please feel free to join that Scott talked about how about the budget is, and we had our budget hearing today. I'm not going to do a long discourse on it. But we are fighting hard to figure out how we can minimize the pain and the cuts to our schools to our summer. Youth programs. You know, and one thing I'll say: I- really appreciate the NYPD officers out there risking their health, but you know: we've got a hiring freeze on teachers and social workers, and you know mental health, counselors and Parks workers, but so far the mayor has exempted the Mi PD from the hiring freeze, which means next year. We would hire twenty three hundred and police officers. Let's serve the ones we have well and make sure they have the PPE and support they need. We do not need to spend two hundred million dollars on twenty three hundred new officers. We could put that money into our schools and our summer youth programming instead there'll be other ways that we can do. Work in the budget. I see a bunch in the chat on safe streets and I'm going to stick around, so people would get that we have time at the end. To talk about that. I will be glad to talk a little more about it when we get to the end, but it could be a long conversation. I also think we've got some work to do on getting the balance right on social distancing compliance. I know. People on this call care a lot about it. I know you've seen the videos of differential, NYPD enforcement in different communities across the city personally, I do not think the NYPD are the best suited. I think what we really need is like a corps of public health outreach workers recruited from every community, so people that look like you and share your language share. Your values can communicate about why it's necessary to stay separate to save lives. You know probably the best place. I saw social, distancing compliance. All the last week was that the Grand Army Plaza Green Market, where you might have thought it was impossible to achieve it's. There's such a thing of crowds and yet with good design, with clear rules and with a common community of values, they've turned something: that's usually a crowd into something that's really pretty safe. So think, more with you guys about how we do that, because even once we start to be able to move out of our homes, we're still going to have a year when we have to do this social, distancing, compliance to more quick items and actually Theresa just dropped one in the chat about Organics collection suspension. You may have heard that Curbside Organics collection is something that has been suspended, yeah as a budget cut that like breaks, my heart and I know for many of us in this community were the best composters at all of New York City and we're reducing hundreds of thousands of tons of solid waste at a time when the climate crisis is affecting the planet. But unfortunately, that program has not yet had the citywide effectiveness that we needed to have. We do it great here, but because it's not mandatory or incentivized, it has not been cost- effective across the city. It should be saving us money, but instead it's costing us about twenty five million dollars a year, so I think we're going to have to suspend it. But we're trying to do two things to save the program going forward. One is to make sure that there are locations around our community where people can bring their organics kind of community compost facilities like at the green markets and other places. So we can stay in the habit, but then also some Antonio Reynoso is moving forward a bill that would make organics recycling mandatory, so people in every community would have to do it. That's not going to go into effect during the Coby crisis. But let's use this moment to say the only way to get a cost- effective program is to make sure it is genuinely citywide and that everybody's kind of participates but more on that to come. And then lastly, I save my big thing for then, because I'm very excited, as some of you know, I've been saying a lot that clapping for our essential workers and seven is great. But we've got to do better than that, because that does not provide them. The sick leave or PPE or replace protections or pay or dignity that they deserve, and so I'm one of the co- sponsors of a package of legislation in the City Council called the essential worker Bill of Rights. That would provide sick leave and workplace protections and I'm delighted to say the sponsor of that package of a similar package in Congress is none other than 700 Warren and tomorrow, at 1:00 p.m. she's going to be joining me and some New York City essential workers for a digital townhall standing with the central workers and if you guys want to join I've just dropped the chat in the box and I'll drop. It again when I can write what it is, we would love to have you there I think. We all know that after this is over and the cheering and clapping is done, we've got just such a collective debt to the people who are in our nursing homes and our ers, who are the one stock and food on the shelves who are doing the delivery, work who are doing the warehouse work and we can show up and do better for them. Those are jobs that we have not honored previously, with anything like what they you would. You would recognize essential work as and we can do better, so I hope, you'll join us tomorrow. It's really great to be here. I'll, stick around to the end, so on some of these other questions, I'm glad to weigh in people. Thank you thanks very much Brad we're next going to hear from state senator Kevin Parker. You senator make sure you're unmuted that there's no red slash through your microphone. You I'm not seeing the senator now. Okay, he must have left then I apologize, Mike who's. Next, then, with something remember. We're T's is still on the line, I. Think. Okay, no is he still I? Do not I can't not seeing him now, okay, so I guess we can move over to. As caslen Lander mentioned the chair of the Small Business Service Committee in the House of Representatives. What helix is here in the participants? I'll? Let him in well yeah! Sorry, there Felix. Can you hear us now? Can you hear me now we can hear you sorry I found you in you hear me now: yeah, okay! Thank you very much. Thank you, I'm Ike. Thank you to all the members of the community board. My colleague is going to be very brief and quickly. I would like to inform that we give masks, is going to be ordered directly to the National resident on Mass and Globe Bluff and I. We also continue to bill in very healthy and very sadness with people who passing away. We can have no resource. No financial at all. We've been working with HRA to ensure that they will be able to cover the cause, as well as with the state. I also would like to re- emphasize the unemployment issue. That is really one of the we're getting about product 24:40 phone calls a day in my office, leaving messages and we're returning and trying to help these people. We also distribute some mass for the EMS and the EMT. Last week, Friday we gave web cloth a mask to Crossing guards and also to the to some of the food workers services in our school people, trying to a tendency to forget them. It's important to recognize them as well. We also donated at order of 10,000 masks to my memories as well as to NYU hospital, and that in 5,000 mass that went directly to a double clinic so and we also work in a city council London mentioned it's a bit of right. We also worked in on a piece of legislation to secure the floor liners regarding about unemployment back 18 days, sick days and so on, to make sure that they will be protected as well, and that is a bill that just started working with 2 days ago and I'm going to be the sponsor of the bill and I will be able to be more detailed as soon as we finalize that legislation with that I would like to say thank you to everybody and just remember to remind people that the only way that we can reopen, if is everybody, will be part of the solution by wetting their mask they protecting their self, but they said in my family as well and theirs. Thank you very much. Thank You Felix. Thank you. As previewed, preemptively I was going to go to Dan Wylie from congresswoman Velasquez office. Next, so Congressman Velasquez has been working on oversight. As a lot of people know, the cares. Act had a 3.5, not 1/4 package working on the fourth package now, but the last. What was passed was 3.5, so there's kind of an interim replenishing funding for the Paycheck protection program and the disaster. The economic Injury disaster loan grant because we turned it into a grant which has been an overtaxed again that looks like that is frozen for now, because there's so many applications in and we're working on the fourth package to replenish it and also try to make fixes to it to make it work better for small businesses. There's a lot of restrictions on how you spend the money and really we need the most flexibility possible. So the congressman has been vigorously negotiating on that, as well as making sure that the next package includes assistance for states and local governments and in proportionate to those also that have been so impacted like New York. Obviously, in the last package she was able to get more funding for smaller banks, some of the CDFI, the Community Development financial institutions, credit unions, some of the smaller banks that are better able to push these loans out to forgivable loans out to smaller and micro businesses, and also more money dedicated to the economic injury disaster loan program, which you do not have to go through a bank and have a good relationship with Lee yet directly through SBA, and so fifty billion dollars earmarked specifically for economic injury. Disaster loan through SBA supports 350 billion in those loans and grants. Even so, it's now look like that. The SBA is frozen that application for an app we want to replenish it also. Of course, you know, the last version of the bill was held up, Democrats were holding out for including state and local aid and aid for hospitals and so seventy- five billion. So we were able to help hold out for a week and then actually we did not get the stay and local, but we did get seventy five billion for hospitals, and so again we want to make sure we get this state and local in the next. Also, the cars woman, you know, has led a bipartisan group of 24 members in Congress to get the Centers for Medicaid Medicare and Medicaid Services CMS, asking for additional funds and the cares Act to be allocated to nursing homes. There is some money that should be going, but we want to get more in there and you know just an editorial note on Cobble Hill is there's a lot of the news of like it had a high number of deaths from Covid-19, but those are presumed death. So if you look at the fifth two people who died, 50 of them for 53 three of them were confirmed with a test pad encoded. The other 50 were presumed coded, which shows the low rate of testing that nursing homes had I do know, they're getting testing coming in from the state. Finally, on Thursday- and it also does not tell the story of people who have recovered so they're people in news from the nursing home more than 50, had coded and recovered, and I think that side of story is not told so I think it's very important for the state and the governor's office in particular to recognize that they should be working with providers that are finding ways to manage this crisis, just like hospitals which have public and private ones, and work with them, and associations like leading age to actually figure out how to be better prepared and how to really support them and I applaud Lincoln in his work in the mayor's office to dedicate and have a contract to actually get staff there, which is what they've needed all along PPP and PPE. In stat other items, the councilman is velasca's. I has submitted the excluding pandemic unemployment compensation from income act on April 30th, which she wants to get in. The next cares Act, which would exempt the weekly$ 600 that Americans get in pandemic unemployment from being considered part of their income. That could disqualify them say for snap or Temporary. Assistance for Needy Families, so that would that's something that she's in is what's that the governor? Oh, yes, sorry, okay, so that and then the last thing is she did sign on to the and mortgaged cancellation Act of 2020, freeze, okay, I think we lost him all right. Well, so we're going to we'll go to end our you look to John Jericho from Methodist Hospital and then, if Dan comes back on, we'll hear the conclusion of his remarks. I could evening everyone. Can you hear me? Yes, thank you for having me once again: it's Jon Jory Caron, director of government affairs and grants for New, York Presbyterian and a Park Slope resident. So few things I just wanted to update you on tonight. First, it is National Nurses Week, so I wanted to thank all of our nurses want to thank all of our nurses for their efforts here. I apologize John if you're, not speaking, please make sure you're on Mute, otherwise things you play on your phone or coming across and interrupting the speaker. Thank you, Peter. Overall, our numbers for New York Presbyterian, including Brooklyn Methodist, of continue to decline at the surge height of the surge in Mid- April. We were about 2,500 in patients at our facilities and, right now we were about 13:49 in patients. As of this morning, our the patients in our intensive care unit beds, although is declining, but that decline is slower, which is to be expected. Those patients are sick, sicker. We have about four hundred and sixty across our system right now on the good news side, as we've discharged more than 8,000 patients who are back home and are healthy, be back at home, we have right now what we're working on is when we can be able to reopen and for those patients who have delayed their care. How can we bring them back in and have their care delivered safely and successfully? So we are talking to our Hospital partners around New York City and in Westchester talking to our Hospital associations, talking to the state about how we do this safely, so that our patients are protected and our workers are protected. We have programs for our workers who are experiencing either financial hardships or eat some mental health, counseling or services like that. So we have some programs for employees who may need additional services. One thing that, as someone who gets up and runs in the park, you see a lot of people up there and you know social distancing is still an issue. I know lots of people are good about wearing masks and maintaining distance, but as this concept of reopening comes back up, we want to make sure that we get the message across that people need to continue to observe social distancing. Please wear a mask: please wash your hands while you're out there. We do not want to see a rebound in the number of cases as they go up so with that I can conclude and answer any questions that folks may have. Are there any questions for John in the chat that I have not seen her John? Thank you so much for coming out the second straight month and for all the work that you guys, New, York, Brooklyn Presbyterian are doing right now. Thank you and I want to thank everybody on the community board and I also want to extend my thanks to our elected officials, whether the city level, state level or the federal level for all their support that they're giving New York Presbyterian right now. Thank you. So much thanks. Next I think we're going to go to the district 15 superintendent Anita stop who has joined us for the second three months and thank you and take it away. Thank you and good evening everybody. It's a real honor to be here. I'm going to be brief. I know you have such a packed agenda and you have so many people who have so many important things to say, but I am going to touch upon a couple of things, one of which Brad alluded to as we got on this morning this evening, and that is just today. It was announced that teachers and students will be able to return to using zou. They will be using it through a platform that it links it through the Department of Education, but Zoom was without question extremely popular, extremely comfortable for people, and we are delighted that they will be able to do that. They have gone through rigorous responses to ensure that there is security. Letitia James talked about that, and we are grateful for her support with. This was something that parents and teachers were really pushing, for. It is a comfortable platform. People are used to it, and so they will be returning to zoom shortly very shortly. That's one piece. The second piece that I would like to talk about is the grading policy. I know that this is a concern for many parents and if you will indulge me, I would like to just give you a very brief overview. So, starting with grades pre- k and three K, we have no pre- k in district 15, but pre- k, there are no grades for pre- k, so please do not worry about your little ones. Pre- k is a socialization and exposure to language and experience and even on distance learning. If you look at some of the work, that's being done without pre- k, it's astonishing and exciting, and our teachers have gone out of the way to do amazing things: kindergarten through grade five. There are two grades that are being given and which is needs, improvement and MT, which is meeting standards, does not mean that we are looking exclusively at remote learning. We are looking at a holistic approach of the whole gear that your child has had. Please remember that your children were in school for six months already, and so it is not just about the child who's having a hard time with remote learning. It is about the holistic view about mastery of standards, and it is, as the Chancellor has said, about flexibility and compassion and understanding. We want all of our children to succeed, and this is about defining what kids need to be successful so that when they return to school, we know immediately to hit the ground running with the supports they need in grades. Six through eight, there are three criteria and I'm going to call it in grades. Six through eight. There are three criteria. There is meet, standards, needs improvement and what is called course in progress course in progress simply means that the child has not handed in sufficient information for them for them to be given a grade as yet course in progress is not a successful grade. The other two are needs improvement and meets standards, and so I want to be clear about the needs improvement because it's fun fudgie excuse me it's vague to people, it does not mean the child is failing. It means that there is an area of growth that is needed, and so we will be talking to parents and families at the school level for children who get needs improvement now. I also want to add, because they think it's exceptionally important, that there has not been a defined summer school policy as yet so children who gave me improvement. This does not necessarily mean that they are going to go to summer school for kids, who get course in progress. They will have the opportunity, through projects and other work, to begin to complete that work before June for children who do not complete the work before June summer school may be an option for them in terms of the high school level piece. They also have the priority of doing the numerical grading that they would have been doing. However, it is a little more complex in that parents like they are doing in many of the universities and colleges, including CUNY, will have the opportunity to determine if they are not comfortable with the grade the numeric grade that their child will be getting, they will be able to reach out to the school and get basically the equivalent of a pass/ fail concept so that they can get credit, but not a numeric grade. This is a concern if you are worried about your child's GPA and getting into colleges, and things like that. This is an option for parents. It does not have to be determined by June. It will go into the next semester. So these are things that you can get more information about. Do not hesitate to reach out to your school and do not hesitate to reach out to my office, and the last thing I want to say to if I may be indulged very quickly. One is that it was announced today at the by the Chancellor to all of us, the teachers and principals and everybody are going to receive mental health support training. We are dealing with all children who are children of trauma. This is something that is very near and dear to my heart, and we want to make sure that everybody is prepared to provide support so guidance counselors teachers. Principals will be getting training and support for themselves and for children as we go forward with this and then the very last thing. If I can put in a plug tomorrow night at 4 o'clock tomorrow afternoon, at 4 o'clock, we will be holding the first of weekly soup with the soup forums in district 15, and if you would like to come and ask questions there, I'm happy to answer them for you. So again, 4 o'clock, please reach out to my office a S Kop at schools that Nyc.Gov. Thank you. Thank you very much. Anita we're also now going to hear from David non- spam from the Department of the buildings. It's trying to amuse that computer. Thank you, Mike Thank, You, councilman, and really thank you. Everyone I see 83 people still on after an hour and a half. That's a really great testament to this. To this board, I got to say so very briefly, because I know there's still more people to go. It's the Department of Buildings been working very hard to continue as many services as we can during this difficult time. We really made a great effort to put a lot of our available services online as best as possible. Of course, we're still out there in the field with our inspectors performing thousands and thousands of inspections, as you know, we're implementing what we need to do in terms of the governor's order under the paws 90 percent of construction sites have for us- and you know, we've done our part- also to make sure that sites that are closed are safe and certainly we're actively inspecting sites that are open to make sure that they're complying. We have, on our site a tremendous amount of information and, with regard to service changes with regard to specific things that contractors and others professionals need to do during this time in terms of alternative ways, interacting with the department, we have a map on our site, which lists what sites are deemed to be essential, so you can easily go on the site you can plug in a address. You can just click on. You know figure out. Basically what your geographic area is, and you can click on it and get the information with regard to the construction sites that are allowed construction sites. Also Mike gave me a couple of questions earlier that were brought up in terms of how we're you know: monitoring health and safety. We given out guidance that we've obtained from others with regard to best practices for keeping safe on job sites, including you know, social, distancing and ability to wash your hands and equipment and other things like that. So that's something we certainly passed along. You know again with regard to essential sites. We do have the map and everything else, but if people feel that there are that, there's work going on that should not be going on. They certainly could call 301. You could contact the board office and they can get in touch with myself or my staff and we'll check that out very quickly generally within 24 hours, we'll inspect that with those seismic conditions and I do not want to take up too much time. So if people have specific questions, please let me know now we're you know through the board and we'll definitely get back to you within you know by tomorrow. So sounds good. Thank you. David I appreciate it yeah. We might have a few more specific questions on thanks for looking over those I sent over earlier sticking with city agencies for think. T prey is on the call the Borough Commissioner for do. T, hello, okay, hear me: hey eighties, hey how you doing good. So thank you for allowing me to join this call and very happy to participate in it being both resident CB6 as well as obviously working with before closing for so many years. What I want to talk about very briefly in Lincoln wrestlers, spoke about a little bit at the beginning of the phone call is about the plan that the mayor and the City Council jointly announced to implement up 200 miles of open streets. Very briefly, the guidelines are opposed to organizations must have strong ties to the community, and that's basically we're asking for that. So you can demonstrate your capacity to manage an open street and provide a staffing plan if needed. Open streets should not be proposed on bus routes or truck routes or hospital corridors, and just to be clear, a hospital quarters- that's not a specific designation, but if it's a roadway where Emergency Services is going to a hospital that would be a street that we would not want you to be on so, for instance, obviously you safer methods, hospitals, Seventh Avenue between you know seventh and sixth Street. Would that be a good place for this concept, and even roads leading up to that would not be good either along 7Th Avenue, because I was emergency services or used to that, and it's same for AIDS Avenue behind it. Also, if you come up with a proposal which is in a link to the letter that was sent around to a lot of people, a lot of groups, you can propose any number of days to have this. You can have them seven days a week. You can have a recurring days like every other Saturday are like Tuesday Wednesday Thursday, whatever, however, you wanted to do it, and that is that what we will hold you for continuously. If for the duration of the program, the closure schedule should take place should take use of the street for deliveries, and so one of the signs is on the street is that it asks for five miles an hour, because, even though these open streets, they're sort of shared, is that we're not closing off completely, we are allowing local traffic to go on these streets. Obviously, you station only driving five miles an hour. That's what the sign is saying and so far for the streets we have that have been announced from what I've heard and from other boroughs as well I know seeing present progress and park site here at Brooklyn, but Mother borough that we seem to be getting good. Compliance with that and the barriers will also obviously have to be moved from emergency vehicles, essential delivery, the sex, the ride et cetera, so they need to be able to get on the Block when they're needed. So we did receive the letter from Camille or six to Commissioner trottenberg about the announcement and the plans again for administration, City Council to go this program, and so we are definitely happy again to get input from anyone about locations. The way the process works is that we study them initially DLT looks at them, then after we look at them there sort of an interagency process within the city that refused them as well. You know what he looks at it: a fire department. Look that I'm sure sanitation looks at some other agencies. Let's get it also, and one of they want to clarify with partners. If you do volunteer we're not we want the partners to help set up and take down barriers, as you may or Maynot ounce. Today, there's going to be some streets open in downtown Brooklyn, so I'm going to use the downtown Brooklyn partnership as an example, but this is for all our partners to move forward. Until we talk about Basel and I, ask you this meant, you know, keep looking at them all day. We just want you to periodic check on the barrier throughout the day to make sure they're maintained in place and that any vehicle in the exact sess that has to move the barriers or restoring them so live is just checking to make sure that the barriers are still up. You do not have to have someone there all the time for the duration of the program and the hours are right now, 8:00 to 8:00. This is a program that could change with feedback initiatives. So certainly that, though these are the standards. Now things can change when in any moment when it's happens and I'm sure again, because this was a joint announcement, I mean I'm sure the City Council, both of given suggestions, we've gotten suggestions for our City Council member and not left officials, I mean their feedback and we're getting back to them as well. So that's what I'll stay and just briefed on TLT issues. Again, most operations are still down not up, yet we are doing emergency and life- saving things to support our emergency services. We have the gun and very light touch resource and program, literally like we're doing just one Street in Brooklyn right now. But if you have any questions for DLT my office I know other member emileeh, Riquelme who's, the new city, 6A Rep I've, seen a board builder, a branch I'll see as well MIDI rates of each other DSP, and we are here to answer or help you with any questions or issues you may have at any time. Thank you. Thank you. Thank you. Keys I think he next up would be Terrence from coned, followed by Oscar and I. Think that will then Ben everybody sure. Well, thank you Mike and thank you. Everyone just wanted to check in just let everyone know where it kind of stands: we're not doing shut offs for non- payment, no late payment fees, we're also encouraging people to you know with our walk- in centers closed to certainly encourage people to use my account online and also to just make sure that you know in the event that the payment plan is necessary on the people know that they have financial assistance and resources on the Con- ed website, which I will right now just push into the chat. So my numbers on there as well. My email is Kelly teehee at Con, Ed comm, my cell phones on there as well we're here to help with constituent issues. Customers shoes want to. Let people know that you certainly have a line to a troubleshooter here. Energy savings going to be important from here on out. We also want to as the Attorney General as Tish mentioned. Scam awareness is also extremely important. In these times, people take advantage of a crisis, as Keith also said. Right then, a lot of our a lot of our regular electric operations in Brooklyn have come to a halt, so emergencies essential work and critical facilities and infrastructure work to make sure that in Reno in CB six, it's been working with the cruise terminal to make sure that they have the power. Are the possible house attempts hospital site, they're working with any of the affordable housing? That's required, but mostly doing network work, to make sure that we're prepared for the summer and I just want to thank everyone for having us if you need anything from Con Edison again, I just put my information in the chat and we're here to help. Thank you. Thank you. Thank you. Gents Oscar from Senator Montgomery, hey yeah! If you hear me yeah everyone hearing, okay, alright, you're, here right now, just a few quick statements. We number one senator mom, maybe move your district office. In the midst of this situation of beginning of April, we move. We are not only a Shirley Chisholm building at 55 Kansas and Street same phone number, but we want to make sure that you know safety of our staff and any constituents they come by this is it. We believe this is a better situation for us. Overall, those of you who may know read book is about to lose its last tank manager. A letter ordered a letter we sent to the head of the mistral credit union, asking them to look into what I took as a possible location to serve the residents, businesses and large nitrogens over there. So that's what six we want to make sure you guys are aware of that. I would like to share that letter than one who's interested in it. Also I'll share I'll, make sure to stare at tomorrow, no problem, my marine signed on to a letter asking for, unfortunately, the Summer Youth Employment Program, that SYEP was close numbers to come nature, urging the mayor eight boards badly slow being. Lastly, I guess, because, though you know anyone the Senator a please feel free I am a confident I am at bonus and my senate.gov and Sarah McDonald any wants to hurry. Everyone support your local businesses to make sure or that the individual flavor which make them agree, neighborhood reminder that a small business you're supporting a family not necessary a usual corporation. So please treat yourself the water you dinner to purchasing a gift card for future use or do not use it, consider a donation or, and also, if you're, going to water food. Please call the restaurant directly do not necessarily use one of these services on the app because they sometimes take use absorbing and fees, and that affects the small business as well. On behalf of the senator I, which ever one well right now, you're dealing with this I know we're all staring at our screens all day, long, very zoom meetings, other web sites etc and keeping ourselves up to date with the Internet, and hopefully we get through this together and hopefully soon we'll all see each other in the northern Elementary School Auditorium at a future Munich Stella, but I, guess that's it for me. Thank you for the opportunity to be thanks. Oscar Thanks I think that's. Basically, everyone right I'm am I missing. Anyone, no right I do not think so. You want to go Peter and Brad and yeah. Just thank everyone and I really think it was great information. You know I learned some things today and you know I like to think of myself as relatively connected from my almost daily email chat or text with Mike, but you know we're here to help counsel the Landers office any of the state assembly members that were that we're on the call today the Community Board office. If you have an issue that we think we can help with, you think we can help with contact us if we are not the right person, chances are that we know who is, and we will try and refer them you to them so that you know they can try and solve your problems. So I thank all of the speakers for coming on today, especially ashame Scott stringer and all of the other elected officials and I again urge you to stay well stay socially, just indent and we'll all come through this safely and happily and I'm. Thank my team who are working so hard through this crisis and I'm really grateful for it. Megan Clinton, who you all know, is just working with all of you and also Julia Urban is on this call, and they owe me Dan. So it's a pleasure, Peter and Mike to work with you and this soul team. You know it's it's a hard time for democracy, but maybe more important than ever. So thank you guys so much good night. Everyone thank you.",
            "summary": "I hope everyone is staying, safe, keeping their family safe, at least taking an opportunity to go out for the occasional walk on Sunday It is peaceful and wonderful and great greenery and flowers, and as long as you follow their rules, which are not really very burdensome, but do not let the children climb, trees, do not steal flowers for mother graves and be respectful to the fact that this is a cemetery and not a park, although in its early days before the building of Prospect Park, that's where people in Brooklyn took their leisure.\nWe, had our budget hearing and budget legislative hearings for small business and workers rights and that open streets program that Peter just mentioned, but that will come later in the meeting.\nYou, know so weird world and do democracy in ways we never ever thought we would have to do it before, but on the upside we rarely get the New York State Attorney General who's busy and running around the state, able to join us for a community board.\nYet, but at least they're back in the New York City, Schools and I feel like good enough for Community Board six.\nAll of you to know that the FDA has not approved any at- home tests, no treatment, no cure or nothing or cream for the Prevention of or the cure of Covid-19, and so I urge all of you to reach out to them to our office It's the they're trying to again prey upon the anxiety and the fears of countless individuals.\nWe've been working with Congress and with regards to the Paycheck protection plan, making sure that small business women- owned, business, minority, owned business, local businesses take advantage of this loan program as foes as opposed to large businesses, and particularly business, is with connections and business is with lobbyists and businesses with a conflict, and so we are working with congresswoman Nydia Velazquez, who sits on the subcommittee as well as congresswoman Maloney as we monitor and provide some sort of oversight with respect to this paycheck for protection.\nWe have been called upon to mortgage service providers to offer immediate and long- term relief to all New York homeowners, I'm happy to report that Democrats right now are in a discussion led by congresswoman Maxine Waters, to provide some relief to tenants, they're urging and they're coming together around the package.\nMy fear is that landlords will go to the court and will seek judgments of eviction, and so what we need to do is provide them with some financial assistance on the federal level, And I'm, hoping that our congressional delegation, I've spoken to all of them and most of the members of the congressional delegation here in New York, who support relief for tenants and for small homeowners.\nWhat has what we all know is true is that this pandemic has revealed fault lines that fall along racial lines and economic lines, and that's why we've called for expanded treatment, expanded capacitive capacity and rapid testing and hopefully expanded treatment, and so all throughout the state of New York We've been working with a coalition of elected officials to expand testing and communities which unfortunately, have had a disparity em, who have been Distin impacted in a dramatic way.\nWe do know that there are other primaries scared for June 23rd I've, advocated that we go to an absentee ballot system with the governor of the state of New. York is mailing out absentee applications to all of us in the state of New York, but voting, but polls will be open on June 23rd for the local primary we've got a primary for state, Senate I believe in that covers community board.\nI think that we're going to go to before the claping starts our New York City, comptroller Scott stringer.\nWe crunch some numbers just yesterday, and we are now pretty sure that we're going to lose 900 and jobs and city many people who had jobs, Pre Covid-19, who now will lose their jobs by, but by sometime in June.\nAs far as I'm concerned, the state has a thirteen billion dollar budget and to make matters worse, the Brian, cabin and Joe and Simon are not with this, but the governor's proposal to cut spending will impact New, York City, another three billion doubt We all still have to recognize that the federal the federal stimulus has not been equal across the board, New York as the highest number of cases.\nThat I think New York City should need on for the for now.\nYou got ta save some money in good times, because you never know what comes our way We have to think strategically as a thinking about the budget.\nWe talked about health and social services and our communities that have struggled, but we also have to reimagine how people going to get to work, how kids are going to get to school How we going to protect people, how testing is going to become, in the short term, a critical part of society, so I'm throwing a lot out there from an economic perspective, because this is going to be probably the biggest challenge.\nAnd I could show you numbers where this Dwarfs the said the city's fiscal crisis in the 70s, and you could really do some parallel between the depression and where we are potentially, and this means that the way we used to think about governing, which is well throw money at something if it sticks it.\nWe're going to have to look at this budget Both on this community level and each and every one of you in city government, with mayor De Blasio with Tish James elected officials, who are the best in the city, so I do not mean to tell you what you that you already know, You need more numbers from me on the budget.\nKovach crisis happened and they pulled me back in So I've been happily trying to help wherever I can in the face of this crisis and had a chance to work with some of your great local elected officials like Joe and Simon, and Brian Kavanaugh and Nydia Velazquez Kevin Parker Bobby, Carol, Brad, Lander I'm joined by a couple great colleagues from city government as well, who can plug in on some more specifics.\nA few quick items, one following up on an item that Tish mentioned, which are the tragedies that we've been facing in our nursing homes, mayor, De Blasio, has made it a major priority to try to step in and provide support to nursing homes across New York City.\nAnd we're going to build out and the states doing the same large contact tracing operations so that when Mike were hopefully not Mic, test positive, we're reaching out to him the next day as the positive test comes through identifying all of his close contacts and then hopefully providing some meaningful opportunities to make it easier for him to quarantine or isolate at home and or even in a hotel.\nI've got a seven o'clock that I think I'm a little late for it too, but if I can follow, up, I'll leave my contact information and make sure that the right city agencies get back to anybody with any questions and really want to.\nI know, there's some interesting stuff he's working on with legislation for insurance protections and Bobby good evening, CB6, Thank, You, You , know, I do not want to reiterate all of the smart good things that the mayor's office, the Attorney General, the controller are doing, and My other colleagues.\nOne of the most important things that we're going to need to be is to assist our small businesses or nonprofits, and one of those ways is to get them working capital.\nWhatever reason the governor refuses to say that it will take more than 72 hours to get a call back, So I'll say it will take more than 72 hours for the Department of Labor to call you back, especially if you are looking for pandemic unemployment insurance, if you're a gig work or if you're, somebody that does not just have a straight w-2, please feel free to reach out to my office.\nPossible, we're also working very diligently to make sure that our small businesses have a way to access the funds that are available, we're working on a grant program with one of our local natural profit.\nSo I worked with colleagues money from around this phone today, and this was meeting today to get a request to the Congress to provide a hundred billion dollars nationally in the next stimulus package, Detroit housing, at least ten billion of that to New York.\nSo many people living in congregate, settings living in public spaces in some cases, so I think part of that package ought to be addressing much both additional services for people in Shelter, so that we can get people into places where they can be isolated and the city's already doing some work to expand the use of hotel rooms rather than congregate, settings.\nThat is also true of long guns of rifles and shotguns and other such things in New, York City, but not in other parts of the state.\nSenator I just took a little frolic and detour to be on a zoom happy birthday with a colleague, so First of all, I want to thank you, Mike and Peter, for hosting this again and to all of my colleagues in government for participating and a tuition Scott for getting on the zoom call with us and just a you know, a couple things I do not want to repeat what's and said: I think all of us at the state level are overwhelmed with unemployment pandemic unemployment.\nThe nursing home issue, as Dan mentioned I've, been working very closely with Dan on Cobble Hill, and you know it's really brought into stark relief.\nAnd I think that we'll see after the investigations that are done, that we will find that there are a lot of ways that we can improve the way we as New York, works, work with and help our nursing homes who are caring for our most vulnerable citizens and make sure that you know we look at these congregate care settings if you've been watching Rachel Maddow There are now several nursing homes, with many more deaths, for example, as a result of Kovac 19, and so they all need some help.\nI think we're all struggling with ways to help small businesses, please that the Chamber of Commerce of Brooklyn Chamber has started a new fund that will give low- interest loans or no interest.\nJust want to say one thing about student loans that Tish mentioned about the work her office has done.\nAgain, if that's helpful, to people, because that's a really critical, critically important issue as well for so many people and just to say that if you, if you have questions, we really do want to hear from you, the staff is working, extraordinarily hard, as is every elected official staff.\nI'm, just incredibly grateful for all of the work that so many members of the community have done to help support our restaurants by providing foods to the hospital staff and to the emergency rooms and to each other, and so it's a really great way that the community has stepped up, and we have incredibly creative community in this district The next person that we're going to hear from is Julie menin and she works with the census.\nSo I am now running the census for New, York, City and I really want to emphasize it at this time.\nYou may have heard that Curbside Organics collection is something that has been suspended, As, a budget cut that like breaks, my heart and I know for many of us in this community were the best composters at all of New York City and we're reducing hundreds of thousands of tons of solid waste.\nThere is some money that should be going, but we want to get more in there You know just an editorial note on Cobble Hill is there's a lot of the news of Like.\nSo they're people in news from the nursing home more than 50, had coded and recovered , I think it's very important for the state and the governor's office in particular to recognize that they should be working with providers that are finding ways to manage this crisis, just like hospitals which have public and private ones, and work with them, and associations like leading age, to actually figure out how to be better prepared and how to really support them.\nThank you so much for coming out the second straight month and for all the work that you guys, New, York, Brooklyn Presbyterian are doing right.\nWhether the city, level, state level or the federal level for all their support that they're, giving New, York Presbyterian right, now.\nIf you have any questions for DLT, my office I know other member emileeh, Riquelme who's, the new city, 6A Rep MIDI rates of each other DSP, and we are here to answer or help you with any questions or issues you may have at any time.\nWe, are not only a Shirley Chisholm building at 55 Kansas and Street same phone number, but we want to make sure that you know safety of our staff and any constituents they come by.\nYou know we're here to help counsel the Landers office Any of the state assembly members that were that we're on the call today, The Community Board, office."
        }
    }
}