{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Top chat replay",
            "publishDate": "2020-08-04",
            "shortDescription": "",
            "lengthSeconds": "2:21:18"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "_7B6Bc20OsI",
            "fillerWordCount": {
                "uh": 405,
                "um": 332
            },
            "readTimeFullTranscript": "83 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "noise": 97,
                "police": 33,
                "complaints": 26,
                "night": 26,
                "parking": 23,
                "data": 22,
                "neighborhood": 22,
                "problem": 20,
                "street": 19,
                "solutions": 19
            },
            "wordCountSummary": {
                "noise": 30,
                "complaints": 12,
                "director": 7,
                "complaint": 7,
                "street": 7,
                "police": 6,
                "businesses": 5,
                "department": 4,
                "enforcement": 4,
                "years": 4
            },
            "fullTranscript": "Issues that we might encounter along the way, as I said, there's no power here in the office, so we are going to try to make it through it. So 6:35 steve, are you there with us? Hold it a second, yes, okay, good so six times are we going to be? Are we going to be able to keep track of of the of the board members who are part of this hearing? Is there any way to take attendance on a special hearing? I do not believe that we need attendance because we're not either voting or passing any message. No, but it was useful to know. Maybe if it's possible all right and again, I am extremely limited technologically limited to anything. I'm trying to use myself on there's no power here, built in so hey, Steven, snowballs I'll, be taking minutes report tonight and I can go through the zoom panelist list to try to pick out people. I can alright. Thank you. I would ask for CB12 members, if you could, please put your actual name in the zoom as your attendee name. That would help me out when it comes to getting the attendance. Thank you hey! Thank you noble and now that you're there I do not want to put extra an extra layer at work juke, because again I do not have any I'm trying to join in from my cell phone help me with the stacks help me with stacks. Yes, I do not understand that when people raise their hand support, oh, that might be a bit tougher from taking notes. Okay, so I have Jonathan you can help out with that right sure I can handle it too. Thank you all right, yeah same time. We are 100, live videos, okay, so it's 6:37 and I want to make sure that we get going. So I like to again, I'm extremely humbled and happy to share this platform with so many well- intentioned people who really and truly care about their community people who are willing and able to give up their time and effort and energy to make sure that we that we coming to a civil understanding as to how to bring city agencies the police department to come and sit down and discuss some of the issues that are affecting us directly and again. Thank you for those of you who are were willing to come and enjoy this opportunity. I'd like to also say before I pass the Baton to Steve Simon will be introducing the panelists that when we come and unite as one we can do wonders and I'm sure that all of you were participant and mindful of what the rebel scooter issue had been happening in our community in our voice and in the letter and the push by congressman Esparya helped our wonders. It helped us to resolve an issue that had been affecting us in all kinds of ways: Safety wise security, wise in all kinds of ways. So I think this should be a continuation of that effort. It should be a continuation of our togetherness, consider a continuation of putting our differences aside and collaboratively work and have one mission in one vision. So, having said that, I'm going to have see Simon, move along and and make the presentation and I'll be helping along the way, steve all right. Okay, I just want to outline the agenda because I'm not I'm not sure that we had a chance to send it out to people. So we have a lineup of a very good lineup of speakers, headed by deputy chief russell green from the patrol borough Manhattan north of the NYPD. He is joined by Deputy Inspector Peter Andrea from the 34th precinct and captain like Wong Chung from the 33rd precinct. They will be followed by Christian Klosner, the executive director of the mayor's office of special enforcement geraldine Kelpin, the director for air noise policy and enforcement for the Department of Environmental Protection Deputy Inspector, benny mccants, the director of city- wide operations for the Parks enforcement, Patrol, Emily Goldman, the deputy director of beta NYC and last, but certainly not least, Dr Arlene bronzaft a long- time board member of grow, NYC, formerly known as the council on the environment and recognized for years as a city-, wide expert on noise issues. Following the speakers we will go into the public session and and at that point I see that people have already asked whether or not they can ask questions. They should raise their hands at that point so that they can be recognized. I want to also acknowledge that we're joined by Jeremy Crim from the first Deputy mayor's office and Isaiah jenkins, the Manhattan borough director of the mayor's Community Affairs unit, and I want to thank Isaiah for helping the line up the speakers for us, and I also want to thank Natalie Espino from the Manhattan borough president's office for her assistance and advice. So look if we could now begin with a deputy chief, green deputy chief, you with us, you can Jonathan help. You help him with himself. Okay. There goes sorry about that. I was on mute so good evening, everybody good evening, Community Board 12. My name is deputy chief Russ green executive officer of Manhattan north happy to join the call. Unfortunately I do not ha. I had never received any agenda, so I do not really have any anything specific to comment on. We asked a few times, but nobody was able to provide that. So I'm happy to stand by and answer any questions that I may be of: assistance with and I'll we've deferred to the Co234 and the Exo. The three on the call anybody has any questions: yeah yeah. Let me just explain that you know we sort of was scrambling to put this hearing together on short notice. We had originally intended to do this later in August and and we were going to hold the hearing tonight about the Revel modus bikes and then when they withdrew. We then moved up our hearing, and I might I did send something late today, but I guess it did not make its way to you, but I'm sure there'll be a plenty of opportunity for you to provide input as we get to the public session, and I certainly appreciate your participation sure you're, very welcome the Deputy inspector Andrea Good afternoon, everybody Pete Andrea 34 Precinct. I got a little bit of an understanding that it might be about some noise complaints, but I'm just going to go over the status and the state of the 3- 4 precinct currently and some of the things we're experiencing. Currently a 3- 4 precinct, focusing on major crimes and violent crimes. We're actually doing very well compared to the stuff that you see going around the city. We've been able to make sure that kind of environment did not foster itself here in the 3- 4, currently overall crime in for the year- to- date in three poor priests and is down about eight percent 653 versus 7-eleven this time this year. So I feel very confident going halfway through the summer being, you know doing that well, overall, in crime, shooting incidents were slightly above in shooting incidents, we're 11 versus 9. we're not having a chaotic year as you've seen in Brooklyn and Bronx. We seem to be holding our own over here. Our overall calls, you know in the 3- 4 precinct is generally in a 20-day period. We have about 8,000 9-, 1- 1 calls and about 6,000 other 3- 1- 1 calls that's the amount of jobs that the 3- 4 precinct officers handle in a 28-day period, which we measure all of our crime. Stats is based on a 28-day period, which is our so- called month. So to speak, so we measure crime, how we're doing year- to- date as and also the 20-day period compared to last year. So that's our month of measurement as far as traffic conditions, you know we did have a slow in productivity and enforcement during the covered months, but now that we're a little bit back somewhat back to normal. Now that we're on the stages of opening up businesses, the officers are out there enforcing traffic conditions as best they can. So we're actually doing pretty. Well all right. Thank you. Deputy Inspector, Captain, Chung Hi good evening. Everyone I just want to start off. Follow up inspector andreas lead with the crime we're down for robberies this 28 day period, eight compared to ten last last year. I think the NCOS are doing a great job with that. We're really stressing you know what I think. Most majority of our robberies are delivery people. So I know I came from housing and when I used to patrol the housing development- and I see a delivery guy making deliveries, I would sit out front and wait till the guy comes out and make sure he leaves to see before I leave. You know anytime, it's my part of being proactive and trying to prevent something and we've been trying to stress that to the sectors and NCOS. If they see any people delivering, you know just hang around for a few minutes and see if that anyone's bothering them make sure they do what they got to do and then they leave- and I think, that's kind of helping us deter a lot of the robberies and bring our numbers down. Burglaries were up, unfortunately, 18 compared to 14 last year. Again it's those package deliveries- people are, you, know, breaking into the lobby, stealing the packages again like I said it's just the residents and the communities our eyes and ears. So if someone does not belong in the building or the super does not see someone in the video that they do not belong in the the building call 9- 1- 1 and that's the only way we could combat burglaries together is we can't be in every building. We can't see everything glas. We are down three compared to seven last year. Again these are delivery. People a lot of grubhub people now are using vehicles to deliver food, they're, leaving car keys in the car. It's not violent. Glas people are actually leaving cars. We have two incidents like that keys are in the car. People are just jumping in taking off we're in the highway, so a lot of people going over to the Bronx to Jersey, and I think that's the three major crimes for the 3- 3. As far as shootings were down for the year four compared to five last year, so we were doing really good this year compared to last year again thanks to community thanks to the NCOS and our sectors and precinct people working together. All right. Thank you. Thank you. Captain Christian Klausner from the office of special enforcement- and I guess I should mention- although you probably will that your office has a special role to play and is of special interest in our community, because you're monitoring the the restaurants and bars right now in during this Covid-19 period. Yeah. Thank you for the introduction and the opportunity to attend, and I look forward to hearing questions so I'll keep my remarks short. My name is Christian Klosner, I'm the executive director of the mayor's office of special enforcement. Not only were we assigned to deal with reopening around restaurants and bars, but in phased reopening in general, including all kinds of retail, any basically any place. That was not allowed to be open, and now is our office fields, complaints and coordinates with a number of different agencies, acrosss the city to get out and look at the conditions on the ground and make sure that as businesses reopen they're doing it in a way that's safe for both the community, the customers, the workers and the business itself. The main thing that we did was set up a 311 complaint line, and so residents of this community board should know that you can go to the 311 website or you can call 311 and make complaints about businesses that are opening, but not in compliance with guidelines. You can also make a complaint about a business that is not allowed to be open but has opened anyway. I mean there's information on that 311 website about what those different categories are. Once a complaint is filed, inspectors will go, the business will be contacted one way or another where, in the age of Covid-19, we're piloting all kinds of inspection techniques, we're doing outreach to ensure that they know what the rules are and how they comply. We're doing virtual inspections, we're sending people in person all with the goal of building compliance so that they can open safely and we can start to so we can continue to move forward under the New York forward reopening plan the for restaurants and bars in particular. There's there's a little bit of an overlap that I'll take a second to explain. The bars and restaurants that have outdoor dining are part of the D.O.T administered outdoor dining program, and so there are also restrictions for that about how late they are open. What the setup is what's happening on the what's happening, with passage on the sidewalk and there's a complaint page for that on 3- 1, it's 3-, 1- 1 as well under open restaurants, and both of those complaint pages have references to each other, and so you know you can should be able to easily navigate to the right place or the call taker if you're, calling by phone should be able to make sure you're in the right direction. A lot of folks want to know who will respond. We have people from all different agencies- Department of Health, Department of buildings, fire Deputy Sheriff's office and Department of Sanitation Department environmental protection. But the key point is that the city is going to respond and make sure that the place is operating in compliance. I know that the that the main subject for this evening is noise. We are definitely seeing that as restaurants open up that they can draw crowds, we're seeing two different permutations, we're seeing restaurants that are breaking the rules and we're also seeing restaurants that are following the rules. But large crowds are gathering outside and we have a sense that that's ongoing in this community board and we're making sure the resources are available to look into it. You know I welcome to hear any particular locations or concerns and if folks have questions about the three one complaint process, I'm here and happy to answer, I'm sorry I meant to- and I did mean to say there is also a complaint page for noise for street and sidewalk and those are handled by the police department. All right. Thank you. It's now my pleasure to introduce geraldine Kelpin, the director for air noise policy and enforcement for the Department of environmental Protection, and I should mention if anybody in the city government knows the noise code in and out it's geraldine or jerry she's been with DEP for quite a while a couple of decades, at least well more than that, so I'm so happy that you're still with DEP, and we can count on you to help us understand Dp's role, enforcing the noise code. Thank you for that introduction. Can you hear me? Yes, okay, I was not sure if I was still muted or not yeah, so I have been with cep for 35 years now, but we'll put that aside for the moment and let's talk about noise, the noise code and some of the issues that we're seeing, especially with so many people having to stay home and probably an increased sensitivity to normal. The noise code is enforced by with the staff that reports to me and the noise code can also be enforced by the police department. There are some sections that are easier for DEP to enforce, and then there are some where, since we do not have peace officer status, we do ask the police department to enforce it or join us on some of these inspect inspections. Should we need police backup? So I took a look at the complaint types that were coming in from Community Board 12. I just went back to from May to the present and there were about 370 complaints filed. A lot of them are about ice cream trucks which, as the season progresses they. I think one of the things that happened this year. Although we sent out the notice that they need to turn off when they're actually parked and serving customers, I think because so many people are within their dwelling units that the ice cream truck guys play so that people know that they're outside and maybe come out and you know buy from the truck it's a it's a difficult time for them, because they've lost a lot of street business. That being said, they still do not need to comply with the law. Some of the other issues in the community board are construction projects. There are sound limits. Well, there are two things that happen: construction companies need to include noise mitigation measures for their construction activities. It could be individually for their devices and it can also be for the insulating, like the sound blankets, the wall that surrounds most building construction sites. So the premise there is that, if the equipment is has some type of noise mitigation, the project is already starting out a little bit quieter than it would without any type of mitigation and then in terms of a mechanism for enforcing a noise level. The council, probably in the last two years, amended the code to include an absolute decibel level that could not be exceeded. So that's so our enforcement approach is twofold. One. We make sure that the construction noise is less than what is the maximum allowed by the code, and we also go through their noise mitigation plan to make sure that they've added mitigation measures to their devices as much as possible. Based on the situation- and you know, one of the difficult parts of construction in New York is when they are doing foundation excavating. A lot of New York is built on rock, and so they need to get through that rock, which is also always a loud endeavor, and we, you know, always encourage them to get through it as quickly as possible. You know I I've probably rambled on enough on and I'll just wait if there are specific questions I'll try to clarify during that time period. Thank you for listening jerry. We probably should make clear that that maybe most of the complaints that people have had in the community lately involving the late night parties and fireworks and cars racing up and down the streets, those probably do not go to you. So they probably they go to the police department. Yes, you're right. Yes, so they're not showing up on your on your list of complaints, but but it's helpful, but it's helpful to understand what it is that the EPA does do and our next speaker- and I guess in the interest of full disclosure. I have to mention that I work for the parks, Department and so does this gentleman Deputy inspector benny mccants, the director of city- wide operations for the Parks enforcement patrol he's very familiar with the Washington Heights Inwood area. He previously served as the captain in charge of all of the Manhattan pep officers, and then they promoted him to this job. Over my objections, since I wanted to keep him, he was such a good captain. So benny are you with us benny, that's a shame after that intro Steve yeah, my god yeah. Where is he all right? Let's move on maybe he'll be joining us later. That's a little okay. Our next speaker is emily Goldman, the deputy director for beta NYC and she has been analyzing and cataloging the three one complaints generated from our community and just yesterday she works in association with the borough president's office, and just yesterday the borough president's office released a report showing the various statistics broken down by community board, and there are like five different categories of noise complaints. I'm hoping emily can run through this for us hi everyone thanks for having me yeah, so I work for beta NYC. We work in partnership with the Manhattan borough president's office and we do a lot when it comes to analyzing the data. That's coming from communities in the hopes of allowing communities to make more informed decisions around issues coming up so 3-, 1- 1 is one of the main data sets that we continuously go back to and analyze on behalf of communities and community boards, because it's so representative of kind of the of the moment concerns among among residents. So we've created this tool called boardstat, which some of you may know about. It's a dashboard that updates daily with the full set of three on one data, that's available on the New York City Open data platform and it's broken down by community boards. So you can very easily in just a couple of clicks, get to a tool in your in your browser that you can explore on your own to look at the three one complaints broken down in like in numerous different ways that are actually specially tailored for community board purposes. So I would encourage you to take a look at boardstat.beta.nyc, where you yourself can kind of start digging into that 311 data as you see fit since there's so many different conversations around these issues. One thing to keep in mind is that boardstat is like Fed data directly from the open data platform. It usually there's a one day lag before the data populates into Boardstat. The other thing to keep in mind is that the New York City Open data platform itself right now and the 311 data specifically is experiencing some lags, and that is due to like the unprecedented volume of three- on-. One complaints coming through relating to the Covid-19 situation and also the fact that that 3- 1- 1 workers are working remotely, so you may notice some lags. I think that has come up in various conversations, but for the most part it's still. It is mostly accurate, especially if you give it a little bit of patience so yeah. With regard to the noise issues in 311, there are like, maybe almost a dozen. I could check real quick if need be, but different types of noise complaints. The main agencies that deal with noise complaints are the NYPD DEP and, I think also like EDC, has a couple of categories of noise complaints that go to them, but the majority of them go to the New York Police Department, but there are really are like almost a dozen different types of noise complaints, noise, commercial Noise, Residential, Noise, Street, Sidewalk, just building construction, noise, noise at places of worship, helicopter noise and then within each of those categories, there's subcategories so, depending on what exactly you want to look at, you want to be aware of those distinctions so that you can get your get your data in the most sort of relevant way to what you yourself are looking at and mainly today. I'm also here to just really listen and learn from this community discussion. We are going to be having a board stat and three on one data training early next week, and so for the purposes of today. I I'm going to really be listening so that I can. We can tailor that training to be responsive to the kinds of things that community members are looking to. Looking to understand through the data, did you have the stats that were released by the borough president's office yesterday, there were some very stark figures there for for the board, 12 area for residential complaints and commercial complaints and fireworks. There were at least five noise categories that must have been, maybe in that top 10 tier of complaints generated by people here in board, 12 yeah, so in board 12, I'm looking quickly at what Aldrin Bonilla came up with he just plugged this into boardstat and basically for the year 2020 for specifically for community board 12. So from January 1st to the present day, the top 10 noi, the top 10 complaint types within 311, Noise, street and sidewalk. This is again just for community Board, 12., North, Street and sidewalk is, by far the most there's like almost 18,000 complaints for Noyes, Street and sidewalk just for the year 2020. So far, that is followed by noise residential. The third is not a noise issue. The third is heat hot water. The fourth is noise related to vehicles. The fifth is illegal fireworks, which is its own complaint type. It's not an annoys per se: it's not an does, not say noise, but it that is what it's about, and it's called illegal fireworks and then the next is non- emergency police matter. That's the complaint type and that's probably so, populous, because social distancing and face mask issues are considered a non- emergency police matter. So that probably accounts for why that complaint type is the sixth highest in community Ward 12 over this past year of 2020, followed by illegal parking, unsanitary conditions, water issues and then finally, is is noise, commercial and I think the interesting thing to notice about that is that noise, commercial is often one of the highest complaint types of the fact that it's substantially less than Noise Street Sidewalk, Noise residential noise, vehicle non- emergency police matter and illegal fireworks even is clearly representing the fact that commercial businesses have been mostly shut down. So there's not going to be the same amount of noise generated from commercial establishments as we would expect in a non- um covered year. So, yes, so that that's just a quick sample of the top complaint types in Community board 12 this past year, there's a lot of different ways. We could cut this data, but that's kind of the most the most overview way we have of looking at it, and I said- and if I'm not mistaken, the number of street and the Noise Street Sidewalk complaint category. Did you say? Eighteen thousand, almost eight, seventeen point, eight thousand seventeen point eight. I think that may be the highest number for any district in Manhattan. Okay, all right! Thank you and our our last speaker and certainly not least, is a renowned expert on noise issues. Dr Arlene bronzaft, a board member for grow NYC used to be known as the council on the environment and she she probably launched her career in Inwood, working on behalf of the students at Ps98, in a groundbreaking study where she found that the students who had classrooms on the side of the building closest to the elevated subway tracks were suffering because their lessons were continually disrupted by the noise from the subway and the people on the other. The kids on the other side of the building did not did not have did not suffer as much and did better in school and her her work forced to the MTA to put soundproofing on those tracks. So as far as I'm concerned, there are generations of students at Ps98 and in the community as a whole, that Owe Dr bronzeff a huge debt of gratitude and we're so happy that she has continued a role in this issue and has agreed to help us once again. Dr Bronze left, I hope, you're still there, hello doctor, I see her, I think you're a mute doctor, she's, muted Steve, all right doctor. Could you unview yourself there we go. Do you hear me now all right? Yes, we can hear that. Okay, all right, so I do not know if I should thank it. Inwood for directing my career to noise. But yes, children exposed to elevated train noise by the sixth grade were nearly a year behind in learning compared to the children on the quiet side of the building, and that was a landmark study. But what made that study special is that it was the parents of the children of Ps98 that asked me to help them. Just as this community is meeting tonight. One of the mothers of a child at that school was a student of mine at Lehman College, and she said. Please can you help our children? The other wonderful person was the principal mark, Shapiro of Ps98 that provided me with all the reading scores and all the data. I have to complement the department of environmental protection because they came in and did all the measurements of the sound levels in those classrooms, and so I had the cooperation of Dp Board of education. Parents and I was able to conduct a study, and the findings were quite remarkable, though my eight- year- old child at that time could not understand why a mother had to do a study when it seemed so obvious that children's learning would be impeded by passing trains. Children and the teachers could not teach, but it was what followed that's important for this community. I, as an academic, got the paper published in a peer- reviewed journal, but I did not help the mothers of those children and the children if can go further, and so I had to do something to try to ameliorate the sound. The board of education agreed to put acoustical ceilings in the classroom, and the Transit authority came up with a method to quiet the tracks adjacent to the school. Now you're going to ask: how did these two agencies respond so quickly? I usually use the word miracles to explain that. But let me tell you what I did have I had the parents of the community. I had the community, we had the public officials, we had the media, the press and we had everyone saying we do not just have a problem. We have to come up with a solution and when the solution came up, it was immediately introduced and of course I had to go back to the school to find out if the children now were doing better after the noise had been lessened. And so let me tell you what the answer was. Yes, children on both sides of the building were reading at the same level, but the tta did not stop there. I worked with the Ta and they said they would ameliorate the noise at schools similarly located near tracks, but people also live near the tracks and so the Ta agreed to start quieting the tracks with the procedures that were developed in Inwood, we came up with solutions, that's the key thing. I've been listening and I know there are problems, but problems can also yield solutions and everything at that time came together. Yes, this is not the late 70s. This is 2020 and the Covid-19 situation has added another element, but I strongly believe that what we're talking about particularly 18,000 complaints about sidewalk noise, but I think if the people got together as they did, then they would be able to come up with a solution. Now remember: noise is a health issue. I do not want to just call it a quality of life issue. Noise, we now know creates stress, can lead to physical disorders and we have studies that have linked noise to cardiovascular, Disease, high blood pressure, and we know that children not only need quiet schools, but they need quiet homes. And if this sidewalk noise is that loud and if these children were going to school- and they were not getting the sleep, they would need to do well in school. Then we have problems. I believe in something else. Also we have a noise code, and that means we have laws that stipulate how people are to behave with respect to sound and imposing it on other people. I have to confess my husband was an attorney. My three children are attorneys, so I very much believe in the law. I also keep the constitution next to my bed, so I have a constitution which I refer to, but if we do not enforce the laws we pass, then what we are doing is we're saying they're not worth the paper they're written on and number two. If we do not enforce the noise code and those laws, it gives license to up for us to break other laws, and that's why it is important to enforce the code. It is a health issue when we talk about noise and we know that people need their sleep their rest. I understand the implications of the Covid-19 situation. I've been writing blogs about it every three or four days, so I know that we're going to have to sit down look at the particular problem and come up with solutions. I think the people in the community now the police, department, Dp and all the members of the board can very well do what we did all those years ago. We came up with ways of quieting the classrooms. This is not rocket science, but there has to be a will to do it, and I think this community can lead the way just as this community demonstrated, the noise was harmful to children's learning and other studies confirmed it was still in this community, but the first two studies were done. The problems that you've addressed tonight are similar to the ones I've heard from people in south Brooklyn from the Bronx from other parts of Manhattan, and so again you could sort of lead the way by coming up with recommendations of trying to lessen the din and recognize it's difficult. People want to let out more sounds. People are frustrated. I am a psychologist. I understand the stress of coed Covid-19, but I think that we can, if we work together, come up with solutions that will reduce the level of sound in the community and improve the health and the quality of life. Thank you. Thank you. Dr Bronze, after you're going to be our official advisor and cheerleader as we continue this effort in the coming months. Deputy inspector mccance. Are you now with us? Does anybody see Deputy Inspector, Mccann's name, you do not see it? Okay, all right. So before we go into the public session Jonathan. Do you have that video clip? Yes all right now! Okay, do you know where we're going to stop it at one point? And yes, we know that okay, great all right. So this is a bri. A short video about two minutes, or so put together by the Facebook group, Wahi and inward for respectful decimal levels. It's just a compilation highlighting the different noise, some of the different noise problems that have been in the community in the last few a few months and an out of respect for people's sensitivities and we've excised, a small portion which shows an incident where a woman was stripping in public among a whole crowd of people so is, does the does this clip? Have no sound with it that'd be fitting that there'd be no sound on the video. That's about sound yeah gosh! Oh, it's a counter- intuitive, so I think you know we had a fire where the fireworks began. I think many people feel that this was the worst year for fireworks. We've had in a very long time- and you know it began, I think- towards the end of may maybe early June and was just relentless. Almost every single night Jonathan might not be able to hear us for the sound because he's playing it so we'll see. Okay, that's it all right looks like we have a lot of people in in the chat who want to be able to speak is somebody keeping track of of the names yeah Jonathan? If you can just give us the names based on whoever raised their hand? First, I'm sorry that I just my battery lost the power outage where I live. So if you can just give us a list of names Jonathan, yes, we have tanya. We have something someone called mick right and then we have Julia Mayer and then I'm sorry, I said Jonathan who what was the second name Tanya Tanya's. First, you know Kenneth was the first one yeah. The second one was make m.I.g. Okay, all right. Well, let's all right: let's go with Tanya. Is a member of Community Board 12. Tanya go ahead! Hi. Can you hear me yes, okay, great. First of all, I want to to thank Dr Arlene bronzaf for that wonderful presentation and to Steve Simon for hosting this forum today. I am wanted to say that I think that we need to think about. What's going to happen next, we need to think about how we're going to hold each other accountable for addressing these issues, because I can say that I have been reaching out to people elected everybody about this issue begging for help, and I would like to know what is how we're going to address it, and I would propose that we think about starting a task force, and that would help us to move forward to address this. And hopefully you know I do not know if Miss Dr Bronzeff would be interested in being a part of that or even leading that. But I think that we need to find a way to not just talk about it tonight and then it just goes away, but that we actually have a mechanism in place in order to like make sure that we are addressing these specific issues and in really targeting solutions for different issues and that task force, you know, can be made up of other people a lot of people here, as well as of the community members who are directly impacted by it. I wanted to say something about the video. It's unfortunate that we could not hear that video, because the point of it was to hear it and to hear what we have endured in our communities. I was literally driven out of my own apartment and had to stay in another area of the community because I just you know was driven out and I want to say that there were parts of the video that we could not show. There was a stripper a naked stripper that actually performed in our community around a bunch of guys- and this is what the community had to look at, and I just thought that everybody here if this is what the community had to endure, everybody here should see it and have to see what we go through, and so you know I just want to pitch that and say that we should think about how we're going to be accountable, because I've been very disappointed in the response to what we've been enduring here, and I know I've been fighting as a community board member for years about this issue. I have a scroll of three one ones. I have met with people at the 33rd all the way up to lieutenants and about this issue, and I got no solutions, no response, and it's just unfortunate. So what I want to see is we have a lot of solutions that our group has come up with the Facebook group and I and others- and we will we'll be talking about that, but I want to make sure that there's a magnificent place to hold us all accountable to make sure we actually act on that. Thank you all right, thank you, Tanya, and I should mention that we certainly do not expect tonight to be the end. All in be all on having the Community board deal with this issue, and I expect the committee that I chair, which you're a member of, will continue to look into this and act on this issue. You've got our attention. You've hit us over the head with a sledgehammer and curtis Young is on this call he's the chair of the Public Safety committee. He he's also going to be giving his committees devoting his committee's attention to this issue as well, and maybe what we should do is what you've suggested to create a separate task force to deal with it. So we'll there'll be more discussion on that point. The next Jonathan who's. Next, the next one is Mig. Mid yeah go ahead. No, I well I wanted to talk about. I think, a couple of weeks ago I was on a call or public safety, I'm not sure of the guy who was talking. He had a haitian kind of sick accent, I'm not really sure his name, so I apologize for not knowing his name, so he was talking about culture in our community and I got very offended. I did not really. It did not grasp me right away what he was trying to explain, but he was trying to say that culturally, this is what happens in a community of hispanics and that's not true. I'm a hispanic woman been in the community for 33 years and that's not the way I run. You know that's not the way I act and that's not double parking and hanging out and drinking speed going. You know, riding on in the sidewalks all these things that you guys are claiming culture that needs to stop that culture. I want to say some other stuff, but I'm not, but it just really needs to stop. It's not culturally. It's a it's a bad behavior of folks that sit around here and do nothing all day, but hang out in the streets, and quite frankly, I see it every day. I do not see anything happening. I do not see nobody giving out tickets double parking, all the bad things that can make you hate this community I've seen. So I like to know what are we going to do from this moment on to get this fixed as a community we're ready to work, and I hope the 30, the 34 present Community board 12 is ready to work. We do not need to talk. We need to do action, it's about action and getting things done because I see it. I see people here looking a little bored right now, but we really need to get it done because we live here. Everybody gets in their car about time they get home and they're home in their quiet place. We have to suffer so I like to see things get done. I do not have a problem getting involved, but let's get it done. Let's stop talking, because we already know what the noise level is here. We already know it. We do not need stats, we do not need numbers, we know it because you see it every single day and especially on indictment. That's it that's all. I have to say. Thank you all right. Thank you. Next, okay, the next one is dog. Walker, a walker see there right, I think he's not. Okay, let's try with Domingo Davis yeah. I hear how everybody's feeling- and I think it it's important- to move beyond just understanding that this issue goes beyond a lot of us. You know where I see some people have been directly impacted. The woman that spoke prior living in this community. You understand this is nothing new, but I think what the times have is teaching us is that we have to go beyond just looking to be well a lot of these issues when you involve police- and you involve a lot of these different agencies- they disproportionately impact people of color. Always you know it's not about culture, it's the disproportionality and the negative impact that policing has. What I think is- and I think Tanya raises a good point with the whole developing a task force for this- is how do we go beyond just thinking of what we think when we think public safety and start holding people accountable? But we also have to look at the stats for what they are. A lot of the 311 calls we're talking about hot water and etc. Right we have to address people's conditions before we start laying expectations down on people that are just figuring out ways of engaging whatever they're going to engage in and Covid-19 has a lot to do with this. You know, but what I would say is, let's think, outside of the box and let's start thinking of ways of being able to redefine public safety where disproportionately people of color are not going to be impacted, because some people do not understand intersectionality. Thank you right. Next, the next one we have Janet Harman Janet. Is it Janet Harmon Janet? Can you immune to yourself right now? Okay, let's move on to the next one, the next one is wendy life wendy you wanna, do live all right, go ahead, hello, I'm speaking for the residents of chittenden avenue, which is for the 34th precinct, and we have had problems even before the Covid-19 of people parking on our street and hanging out and become unbearable and unlivable. Since Covid-19, we have had no help from the 34th precinct. We've been working with officer Brian poster who was our neighborhood precinct contact person no help at all and what's been happening. Is that now people have come, they take their chairs out of the back of their car. They set up all night, they do their hair, they picnic it's become like a restaurant and then it turns into a club and the problem that we all can't understand is that it's clearly marked on our street no parking, no standing. That alone should be enough for the 34th precinct to enforce ticketing and moving these cars out. Yet that never happens, never happens. The cars sit park stand. Are there 365, 24:7, 365, no matter what the weather is, so what I we are proposing is that if people are going to park there anyway, then change the parking signs to legal parking and let the residents of the neighborhood, because these people, who are parking and hanging out, do not live on the street, do not live in the neighborhood. So what we're proposing is to change the signs to legal parking so that residents of this area who are in desperate need of street parking, because we have a Con Edison project going on that's taken many parking spaces away. We have a two- year, plus parking castle. Village parking, that's taken parking away. We are desperately in need of street parking, so change the sign on the West side of Chittenden Avenue to let the residents legally park and that way we would get rid of the problem of people coming hanging out, and I mean we have all kinds of things you're talking about strippers. We have people using our flower beds and our street as a toilet. There are sex acts on the wall if any of you familiar with Kitten Avenue and that Wall I understand it's a nice place to come, look at the sunset, but we have people having sex on the wall with no in no impunity, nothing and they are there. They take their chairs and they're all night, it's unbearable, so we are asking is to have the street signs change. Yes! Well, maybe that's the answer. It is the answer but we're having. We can't seem to get through to got I'm working with Senator Jackson's office. I've approached them and I believe they are in touch with D.O.T and, I believe they're getting some pushback and we are trying to push this through, because this would be the answer to our problem. All right so ebenezer. Could you also take note of that and and talk to D.O.T about this suggestion sure Jonathan? How many more questions do we have lined up? We have zero Medina and then we have aisha all right Steve. If I could just make a comment on wendy, you know wendy, we know about the area. Nco boy is working been working very aggressively in that area. They in the last 28 days, they've written 20, double Parker center area. It was actually the NCO Brian pollster who actually brought up the idea to make that parking parking for residents over there. So we we're the ones who came up with the idea, and we we'd like to see that happen. That would help us out a lot dedicate the NCOS to be parked over there. You know they have to cover the whole NCO boys sector, so we will continue to do the enforcement over there. We'll continue to go down there and move people along. You know I'm sure that what wendy's seeing is something that is unbearable, but I'm it was a lot worse and we've done a lot of we've brought a lot back a lot back. We've actually pulled back a lot of the issues over there, but we are the ones who brought up that solution. That should be here where they do put them in parking yeah. Have you passed that on to a D.O.T? Do they know that you support the idea? Yes, we passed on, we did a walk- through we did an intel report on it and we're waiting to hear a response, but it also needs a little push from other people in the community right, not just the police department, so any help along anybody in this forum. They just pushed that along. That would be very helpful. That was an idea. We came up with that. If we had parking here that residents would have more parking yeah and it would not be an area where people could set up chairs and hopefully help with this with the situation over there. But it's been it's become a lot better than before. You know these things creep up on you and you have a lot of other burning fliers around the precinct, but right away when we got on it, we attacked it and you know Brian Pulsar, you know a great officer he's been in the neighborhood a long time. I'm sure wendy could tell you he's very knowledgeable and he has been attacking it aggressively. So, okay, we'll continue to do that and follow through with that plan, but anything to get that parking approved would definitely help us greatly all right. Well, hopefully, we can have the community board support you on that. Thank you who is okay. Sidrow is also a member of the community board. He's the chair of our licensing Committee. Thank you, Steve for putting this meeting together along with our chair, Lisa. Thank you. So much I've been leaving the community for 40 years really proud of this community, proud of the work that our prisoners are doing in the community, giving the circumstances I'm going to point out something that Miguelina or Miguel actually said about the misperception. That noise is closely related to latino culture, not acceptable, because that's being racist outright. I'm going also to point out something about perception that everywhere you go to a restaurant is most noisy and loud. That has to be addressed as well. We can not allow this community to be mislabeled in any way shape or form. We have struggled together we're going to keep fighting together, and I hope that the electoral officials that are listening to all of this are going to work in ways that will benefit us all. I must say that I have called 3- 1- 1 number of times in issues dealing with mountain bikes going around and from what I see on how barely I can see the plates. I do not see that they're from the neighborhood they come from abroad, because when I'm driving from the Bronx, I see them coming to my hand, so to say that from the community is not only misleading, but it's not acceptable. We have many cars that come by 180Th and one in the first to go like really fast disrespecting. The neighbors are really late at night, where we have also trucks that are completely parked and never moved 24:7, and that's something that I believe that one when he stated about needing parking spots. I counted it and I also documented over 20 trucks that are left overnight, and these are commercial trucks making loud noises that do not allow our neighbors to sleep. That's not fair, it's not fair and our community should not be in any way shape or form allowed to go through this problem. That has to be addressed. I that came on a press conference where the trucks were left on 24:7 and never moved. That is something that even our community board members have been affected by in the neighborhood. Because of the noise of of these trucks, that's not acceptable. We must also understand that when we go to our local restaurants and bars to spend our local money we're helping small businesses, if you see a problem, address it right and then with the management address right there and then, because you want to be part of the solution, you want to be part of the process. So I'm willing to work out with people that want to form a task force, and I think it's really a cool idea to do that, but really grateful for the work that NYPD is doing all along. Thank you, so much for your time. All right. Thank you. Who's! Next, yeah, aisha, is the next one. So Aisha please go ahead. Okay, aisha is also a member of the Community Board good evening. Everyone first of all, I Wanna highlight what Domingo said. I also agree with what Isidro just said in relation to some of the commercial activity and with the trucks and things like that, but I want to speak to the fact that some of this board's actions also contributes to some of the dynamics. When I say that I speak in regards to what DOT has continuously been allowed to do, which continues to restrict access to parking. We also have had discussions about the need for residential parking in the area of the district that I live in. Something that we face is noise from trucks idling three four five in the morning, and it's mostly Servicing Columbia University. We also have the Haven Plaza that has been implemented against community. Will we filled rooms with the amount of people that were against that project and still it was forced and pushed through. I do not even agree that it was proper process, the way that it was pushed through and what we have had is fire trucks that have been beeping their horn. We have had police cars as well as trucks that can't get through the normal way that they would have, and then we have honking all day long during the daytime when the traffic is the worst. The gate from university at night time is loud. There's the alarm on Haven Avenue as well. That goes off. I'm not really sure why, but it's like being in the middle of some type of drill, with an extremely loud alarm blaring through the community, I'm not sure who they're trying to reach with that, because I would assume if the alarm is going off, that there should also be a quiet system that they are able to alert the police. I'm not sure why the whole community needs to. I want to make sure that when we are having this discussion that we're also talking about the institutions, responsibility in that conversation as well giving light to the intersectionality, I want to be honest and say that growing up, I've known some of those guys that may be motorcyclists driving their cars around some of it. Quite frankly, them from boredom stems from lack of access to what I now know as I've gotten older is maybe if there were different types of programs. If our institutions that are in the community gave more access to those youth in the community to kinds of activity, then maybe we would not have that in regards to the fireworks. There are communities that actually have fireworks celebrations right and I'm looking at the people in my community, some who are just like. I want my child to celebrate the stupid. Why, like anyone else so then what do you do right? The point that I'm making is not to excuse the noise absolutely have a zero tolerance to what that allows our neighbors truthfully, but I think that we also need to be creative and smart about thinking about the problem. Thank you for your time. All right. Okay, we have after Bernard I'll like to have a shot. Unless someone else has another thing to say: okay, all right, yeah, I'm here, can you hear me right? Yes, okay, so I'm in I'm actually in the 33rd precinct and last Saturday night, there was a party along until four o'clock in the morning when, finally, after I would say, 20 calls to the switchboard at the 33rd and 311 complaints, most of the people were closed as unfounded or not necessary. Finally, a car showed up and the cops got out of the car and shut down this and shut down the party at four in the morning. I just moved to the neighborhood actually seen anything like this with people every weekend in front of these businesses. Excuse me bernard hold up for a moment. We seem to have some interference on this call. What happened is guys if you're not talking, please mute yourself and allow the other participants to speak. Can you hear me now? Yes, we can hear you, okay, okay, so from the there are businesses, there's a hair, two hair salons and some business that I can't even tell you what they actually do there and they're on there they're between 601 and 609, West, 161St, Street and every weekend has been a huge party loud fourth of July. It sounded like it was so loud. It was rumbling the windows in my apartment and rattling stuff in my apartment and and it's every weekend. And finally, I had my landlord actually call up the landlord of that building over there and Sunday was silent and Monday was silent, and I noticed a strange thing about the block was that there were there. Was nobody really dealing any drugs? Those days like the days where there's a party, it's like you would not believe some of the stuff that's going on the street plus my building was broken into for the first time. Apparently, in four years and the package room was robbed three times since these parties have started. So my point is that the noise creates a situation in which it must feel as though it's more comfortable to commit crime, because the noise is happening and there's no enforcement. Therefore there must be no enforcement for anything else. I mean that's my that's my layman's assumption of all of us all right yeah, please one more thing that we were talking about the subway noise in front of the train in front of the schools the subway still has to run. There is no reason to have a party at four o'clock in the morning. There's no amelioration there. It is illegal! Absolutely and that's it I mean, and we need we need help from. We need help. That's it all right. We hear you. Thank you. Scott. May I jump in with a real question for Dr Arlene, who wants who's asking the question this is nobles. I think I was after the next public member sorry about that. Thanks, Jonathan Dr, arlene a quick question for you because it seems like. Obviously, there is a very large theme here, which is completely understandable. It's the mix of socioeconomic systems with you know definitely a splash of you know segregation when it comes to real estate and things like that, there's a whole through line here. That being said, do you have any examples of cities that are doing it correctly through either zoning or you know, task force where we do come together and we can figure these things out like do you have any examples of any cities that are doing that we can learn from and try to apply Dr Arlene you're on news? By the way, can you hear me? Yes, we can yes, okay, I'd like to talk to the crime issue, because I have written papers on crime and noise and you're. The last speaker was correct, because if people are drinking and people are carrying on and then they walk out into the streets that crime could follow, so I would suggest that I'll forward the paper I think I may have to several people. I've also addressed the issue of crime and noise. Now, you're talking about other cities, I will also forward to you a blog that I just did because Paris has a situation, remember: Covid-19 changed things are worse, the parties have increased and the former speaker could address that. So I'm going to forward to you what programs they've been introducing to try to remedy the increase in the noise situation because of Kovic is that what you've asked? Yes, yeah, I'm going to forward that to you all right and we'll and we'll be in touch further. Okay. The second thing, let me tell you, New, York City, is quite good when it comes to the noise issue, because it has served as a leader in the past to other cities as to what you can do to lessen noise, and I think the people who have spoken have come up with excellent suggestions. Remember I said problems need solutions and we came up with the solutions. The last time we had the problem in Inwood, and I think the solutions that have been recommended could really be implemented all right. Thank you. We have to create a zip. We have to try to zip through this, because we were hoping to wrap things up at around 8 30.. So please try to keep your remarks as concise as possible who who's next. I who's the next Jonathan, because I'd like to make a comment angel baskets I'll, go after him all right. Thank you, Jonathan! Thank you Sir. So I think the statistics are out. The unemployment rate in New York City is around 20 you. We can probably safely assume that that's disproportionately affecting our community in upper Manhattan being a low income middle class community up here, and I'm not going to say that I can prove causation, but I'm sure that there's a strong correlation here- and so I understand that some of the elected officials have been proposing implementing some type of billionaires tax millionaires tax, taxing the rich. If- and I also understand that the governor is not a huge fan of that. However, if he is not, let's get creative there's a ton of do- gooders in our city that have plenty of money that they come in here and create programs to give people opportunities, because the reason why this is happening is because people are unemployed, they do not have jobs, they do not have places to go and they do not have other things to do, and so, if we do not provide opportunities for these individuals, we're going to continue to see the same problem. It's not going to be ameliorated by just looking at the micro level of this particular spot, or this particular restaurant, or that particular like corner. It's not going to solve the problem. We have to give people opportunity and we have plenty of do- gooders, as I mentioned in New York City and in New York state that can assist and provide funding for this neighborhood to create programs. If we, I understand that the city budget and the state budget is terrible at this moment, however, there are opportunities for public and private partnerships where we can bring in these do- gooders, come in and create programs job opportunities for people in this community all right. Thank you. I'm going to try and make a comment now pretty much on the opportunity, the window of opportunity that John Angel just created, I'm going to quote the story, because the data is there, just like angel said as to from NYC beta from the office of Borough President's office. The conclusion in his one two three, the fourth note, and I encourage each and every one of you that can assist to their training next week. So please go and understand what how 311 can either help you and not help you. So I'm going to I'm going to read a codex straight from the story. It says there might be a correlation between gentrification and increased noise complaints in New York City. If you notice, if you look at the data- and I and I encourage you guys to please download this data from NYC beta, the noisy, the bigger number of noise complaints are in man, I mean borrow Community, Board, 3, Community, board, 10, Community, board, 11 and Community Board, 12 and I'll repeat again: Community board 3:10, 11 and 12, which, if you know the data you'll understand that those are the community boards that have the largest concentration of minorities and with that I'll again encourage you guys to come and assist and participate and take advantage of this. Such wonderful research study. Okay, we have this one case: rim F, it's rain good evening, everybody catherine! I do want a second to acknowledge those here who also related to the Parks Department. I live right by the park. I have heard the trees go down today. We've got a tough week ahead and I thank you for the work that you're about to start and for taking care of our safety. I've lived in I've lived in inward for a long time. I've lived in different parts of the neighborhood and there's a couple of things that I want to say. I think that, and I'm it's taken me all of this meeting to calm down, because this is a psychological issue, as the doctors rightly said, and it is a form of violence perpetuated on the residents of this neighborhood with the level of noise and what happens here. I've lived here, like I said, a long time and what I think one of the causes are as to why people flock to this part of the city to do whatever they want to do is also linked with a permissiveness see the businesses in our area that serve alcohol and that had a club- like atmosphere have repeatedly broken their licensing agreements over time, and that also includes the issue with La Marina and La. Marina was closed down, but the perception of our neighborhood did not change with that, and so, whereas absolutely everything is exacerbated by Covid-19. This is not something that just happened these past few months. If you talk to long- term residents who live all throughout the neighborhood, this is something that's been going on for quite a few years and Covid-19 made it worse and yes for people like me, who've been unemployed for four and a half months, there's very little that I feel that I'm left able to take psychologically, but also to the frontline workers that are my neighbors. I live near a nurse who said to me three weeks in fireworks. I do not think I'm going to work safe and that's really upsetting and then there's the broader picture of how our neighborhood is so dismissed by the people that behave. The way that they do here, the drag racing, the bringing of these giant sound systems that I only have used to see in nightclubs and now, apparently, you can use with a bluetooth phone and they hang out and they party on the streets. Then they leave and they leave all of this garbage everywhere- that we now have to get together as a community, and we see on Facebook every Saturday morning come and help clean up, and part of me feels like why, because maybe you do not live here, but I'm the one who's not sleeping, and now I'm the one who's got to in a pandemic, go through the parks and pick up after you. This is a beautiful neighborhood with a very broad history, a complex history, a unique history to the to the island of Manhattan, never mind New York itself, and it has been given space to show up as like this, and I want to say something very clear and specific. I am a solutions orientated person, I've spoken to Senator Jackson, about coming together and reaching out to the community, and I've mentioned it in passing to our assembly member De La Rosa. I am a solutions, positive person. I do not see why an australian immigrant can't partner up with a dominican immigrant and a five generations new Yorker to elevate our neighborhood, I'm that person. However, I want to make it very clear and I'm speaking on behalf of a lot of people that live in this neighborhood who have just thrown the towel in. They do not want to be on this call because they do not see the point we feel fundamentally let down by our elected by the police and by the Community Board and I'm one of those people that believes wholeheartedly in divesting funds from the police into community resources and groups. I am all for that and considering a new way of developing law order, enforcement and community spirit. We keep us safe, but right now we are looking at a group of people here who are up for election and you have not been here. We talk on Facebook, we share our results and most of us have not had a reply to an email, a phone call, a facebook, a tweet and the only person I've seen out in Manhattan, to be quite frank, is Madame Burr, a president dealing with things on all levels and to the point where I almost went. I wanted her to come up here and I have a personal contact and I said, get her up here, because our direct elected officials are not walking the streets at night. I've politely so many times over years asked. Would you mind terribly turning your sound down. I use my poshmary poppins voice for that or I pretend I have a baby at home. That's trying to sleep. I've been threatened with sexual violence. I've been called epithets. You need me out in the streets that elected you and work hand in hand, no photo ops, no press, all of us together, and you can count on me and I will be the positive ray of sunshine that this will take. But you needed to hear this. You needed to hear that you failed us and you let us down and we are exhausted. So I too look forward to a very positive future moving forward and, as I said, you can count on me to be there and your partner in this action, but we need to hear you fundamentally take responsibility for the deaths it has gone to, such that we have to have an emergency hearing. I thank you for your time and I thank you for your patience. Thank you. Oh the next one is wendy hello. Can you yes great? So thank you so much for that speech. I feel like she just stated everything that was on my mind, but I also want to speak on another community. That oftentimes is not really heard of during these type of conversations is people with disabilities and students with disabilities in district 6, which is a district that primarily holds all of the schools within Washington Heights. We have over 4,000 students that have a disability making about 22 percent of the student population. These students have sensory and auditory issues. These noises outside are detrimental to their actual success, they're adversely affected by the environment that they're in we've. I work in an organization that helps students with disabilities. I was a teacher for seven years working with students with disabilities. Their environment is crucial for them to succeed. We have gone many phone calls in the last in during Covid-19 time, but also throughout the years in Washington Heights, about noise, affecting students with autism noise, affecting students with Adhd them, not getting sleep having to react to fireworks outside having to react to the parties happening all day all night. This is going to affect many communities and many subgroups of our communities. As we move towards reopening schools, I can only imagine how this noise pollution, how the parties, how the intensive group gatherings that I've seen all over my neighborhood are going to affect my students and I'm speaking in a very passionately way, because my kids are being affected like they literally can not sleep. It's not even about me at this point. They can not sleep, they can not do their work. The parents are stressed out with all this remote learning, it's just beyond levels where we think that our precincts are not really helping us, because we put in 311 calls all the time and they're being closed as unfounded, no evidence, even though we have videos, even though we have photographs that many of these parents share with me as well. One solution that I think would be imperative for spanish- speaking communities is that 3- 1- 1 is not accessible in spanish on mobile devices. They are on the website because there is a Google translate button, but on mobile devices they are not, and 311 is used mostly through phones, especially in spanish speaking communities. So one solution for that in order to keep actual tracking would be to make sure that student I mean people that speak spanish, have access to 311 on their mobile devices. So again, students with disabilities are going to have to be thought of. In this course, everything that has been said is true. Things are not being fixed. We need to move forward with solutions. Thank you. Thank you. Jonathan yeah, the next one is Andrea Arroyo hi. Everyone can you hear me? Yes, hi, thank you. So I live on 159 on the West side of Broadway, and I am part of this community. I'm also part of the latinx community, and I have to tell you: no culture condones noise pollution, I'm an artist- and I appreciate cultural expressions, and I know that music is culture when it's played live when it connects us in our humanity when it celebrates diversity and build bridges. But, most importantly, when is used to force foster a community building. Blasting music is not. Culture is noise, violence and that fosters anxiety and it fosters fear. We have to understand that even the United Nations recognizes sleep deprivation and noise, including loud music as actual forms of torture. So this is about creating a healthy environment. It's about protecting our children, it's about honoring, our elders and it's ultimately about taking care of each other. I am against criminalization of our community, of course, but why are we underserved when it comes to noise pollution? Why are not we protected the same way that wealthier neighborhoods are protected? You know this is way beyond quote-, unquote, quality of life. This is about social justice. We all deserve a healthy living environment. You know at night. Of course we need to sleep, and you know what sleep is a human right. So, let's think about you know the constant assault of loud noises on a baby trying to sleep on a teenager, trying to study on a norse trying to rest after a double shift on anyone with post-, traumatic stress disorder. We have a lot of veterans in our community, a lot of elderly people who have PTSD and anxiety a lot of people with health issues and, let's remember we're a lot of us are also breathing because of coughing. So, and you know, in general, all of us are trying to survive in the pandemic and really at any time, because New York City is a tough city and we need our homes to be a refuge. We need our homes to be safe and to be quiet. So let's understand that this is a poor public health issue and, ultimately, a social justice issue. So let's create an environment that you know is of respect and it's of solidarity. We are here. I think most of us to create change for everyone's benefit, and you remember, let's all remember that kindness and solidarity are transformative. So let's just work on it. Thank you. Thank you all right. We have Cheriel here we meet here, Cheryl, Miller, yeah, okay, hi. Can you hear me yes, hi good evening, everybody? Okay, so I'm just like I'm just like, I can't believe half of what I'm hearing, but I just in all it is what I'm not hearing. Really anybody mentioning and what to me is a big concern. If I remember, I think, Steve Simon last week at the Committee of the whole, I'm not sure if he had said that out of all the coded deaths in New, York City, there was something like 900 and somewhat people in this area that died of Covid-19, and you know, given everything that New York City went through. I think people have a short memory, people that are hanging out in large groups and everything I mean. What I'm seeing is people are not socially distanced, they're, not wearing masks. Do we really want to have like a blowout of Covid-19 in this area, and and on that note, I wanted to know whose responsibility is it to enforce when they see large groups, not social, distancing and wearing masks? Is that something that the police is supposed to enforce, or is it the NCOS whose responsibility is that and one more thing is that some of you know me and I live on 165Th Street in Broadway, I'm in a hospital zone? Okay, I live acrosss the street from Morgan Stanley children's hospital and three blocks from my house is Columbia: okay, the emergency room and the pardon the hospital and every single night, and sometimes, during the day, I'm hearing people blasting their car stereos that my windows are actually shaking and I live on low floor. What is the you know is: is not there a noise code law about people, blasting music, in a hospital zone? So can anybody answer that who's whose responsibility is it to enforce when they're, seeing large groups that are not socially distancing or wearing down? Okay, Mr Klausner? Is that a question you can respond to all right? I'm going to jump in for this, but cheryl, I'm sorry, I'm going to jump in and answer this. Okay, there is cheryl. I know thank you for calling detective stahl like two weeks ago, so I think that's really important that you kind of build a relationship with the police department and the community affairs officer, the NCOS. So you know what that's something that you should call 9- 1- 1 on and we will send a sector car over and respond. If we see the violation happening in front of us, we can probably summons them or most of the time these cars are just passing through this major through way that way through Colombia. I know this major street 175,179 going to the gw. So are these people passing by? Are they hanging out at their specific time? Is there something that you could talk to detective stoll about? Well what I'm here? Sometimes it sounds like they're like in passing, and sometimes it sounds like they're just hanging out over here. Okay, I have on occasion seeing cars just hanging out by the Chase Bank over here. Yeah, that's unacceptable. So what I would recommend is just call 9-, 1- 1 and sometimes just the mere presence of seeing an rmp driving by it'll kind of make them move along. If it's, if it's just something passing by obviously by the time you call 9-, 1-, 1 and a sector car responds they're gone. So please reach out to 9-, 1-, 1 and or detective stahl. I'm not. I did not know that 9- 1- 1 handles that kind of thing. I've called 9-, 1-, 1 and then they've sent me over to the police department. Well, it's a non- emergency, so you know what call the precinct do you have the number to the precinct? Yes, I do it's in my contacts. Great so just call just call us and we will send a sector car or the nc all over okay, so who's whose responsibility is it to enforce when they're, seeing large groups of people like partying now and everything else whose responsibility is that? Well, if there's a form, if there's a grouping disorderly then obviously the police department? Okay, because I heard that the mayor said that the police are not enforcing that anymore. Steve yeah, I'm sorry, I had to skip out. You know cheryl. My office has taken over most of the social distancing and face covering violation enforcement, and it is largely focused now on in stores, but the conditions that you're describing where there's a large group that is acting disorderly. As the previous speaker said, then that really does become a police matter right. It's not it's not just that. The concern is that people are gathering without masks is that they are also doing so in a disruptive way and that and that the police department still is being tasked with addressing the underlying conditions of the loud disruptive behavior. And so you know, I strongly suggest that people take advantage of the resource that was just offered all right. Thank you. Thank you, okay, which one is Ben Lopez, who is this Ben Lopez Ben Lopez, all right. We have 50 more minutes that we would like to get us as many questions as we can yeah. If you'd like, I can start a timer for two minutes. Please! Yes, can you hear me? Yes, perfect I'll, be short and brief. I brought up this subject to our local politicians, including Community board 12 about a kiosk, that's located at 450 West 162Nd Street. I brought it up to Gail Brewer's office. This has been three years that we've been fighting as a community where we have vagrants playing music being loud in the middle of the night, defecating urinating, depositing all their garbage as well, everything that they drink in terms of beer and liquor and so forth. I agree I agree with catherine. She says you bring it up to our local politicians and we've got no response as a community we're a historic just district. We are, if everyone see three organization and we take care of our own neighborhood. We have not asked anybody for help. Since we've gone to Community Board and asked for assistance, we got zero. You know what we got called elitist because we're homeowners were not given the time of day when it came to our request, our petition, our 911311 and calls to the precinct. The only politician that has responded to our area has been gilberto, so I say to you, when you're sitting here, having this meeting and you're listening to a lot of things coming your way, you need to be problem, solvers, that's what we do as a community. We take our own thing now we're not asking you guys for anything, but the one thing I am asking and I've had this conversation with captain bellow chief Prichardo. We want that Kiosk shut down and if you guys are not going to do it, the community will do it because we're not getting any help from anybody in this community, and I feel sorry for so many people who have complained tonight because their problems are not resolved. But I appreciate you at least you're listening. Thank you. Are you referring to one of the link NYC kiosks? That is correct and there are two in our area. Why do we need two one that I'm talking about is a little bit hidden, so what's happening? Is people hide there? In the middle night, we come to the community board with complaints, petitions, everything and nobody's listening to us. Our local college politicians the same thing so all right to you is we do not need to. We need this kiosk Shutdown, all right ebenezer. Can we talk about that tomorrow, all right who's? Next one is Barbara woods all right. Do we have claudia cher and Maggie Clark on coming up on the list? What was his name Claudia, Cher and Maggie Clark? What would you are you looking at whether they're, panelists or attendees? No, why did you raise their hands? No, I got messages from both of them that they've tried to yes, Maggie is on the stack, but glory is not on stack. Claudia, no he's not on the stack. My geek, yes I'll, be really fast. All right go ahead, go ahead, so Barbara woods. Thank you so much, I'm just thrilled that. So many of you are here to listen to our concerns and I feel very hopeful for the first time in ages that some things will get done with some patrols. Some enforcing of the illegal activities of you know summons, and things like that happen, and also I just want to bring up one thing with the parks, because there's these elaborate parties that have been going on that I know is so stressful for any of the parks. People as well and once you've had these. What amounts to like three thousand and five thousand dollar worth of parties with liquor bottles left all over. I mean it's just a huge mess. Silly string, I mean that's just part of the noise and then but, like I said we're here, to help we're going to keep the task force going, and I can actually give you a little taste of some of our fireworks. I'm an expert at this point between the high- pitched ones, the ones that sound like cannons. I've had 9- 1- 1 callers, worried about my safety when I called they thought I was being shot at, and I just want you to know that and thank you so much we're here to help and make sure none of this happens in the coming months. All right, that's true! Some of these fireworks can be mistaken for for gunshots, yes, who's. Next, okay, the next one is yeah Maggie, Eric Maddie Maggie clerk. Can you hear me? Yes, we can hear it great. I'm a member of the wahi and Inwood for respectful decibel levels. I've lived on Riverside drive for 41 years. By the way this group has 500 people in it and there's a whole bunch of us who have been waiting to get called on who signed up at 6:30 that you skipped over. I found a Din action, Dikeman Inward Noise action in 2008. For these same reasons that we're talking tonight we had hundreds of members. Then we got nowhere. People just drifted away because we got nowhere. We want some answers. Cb12 has 15 times the noise complaints of some other community boards. There are hundreds of noise complaints per night, and yet I have experienced and so have many others- that our tickets are closed out in as little as four minutes. How can you possibly come by, especially when I'm watching and you're, not coming by and you're closing these tickets out? That makes us infuriated. Do you not have enough police cars or police men to go out and look? Do you not have enough decibel meters? How many do you have or how many are trained to use these decibel meters? The complaints largely come between 10 pm and 2 am how many cars and officers do you have out at that time as compared to say Monday through Friday 9 to 5.? Are you instructed by downtown not to enforce fireworks laws, muffler noise, any other kind of party noise in the street? If so, who is telling you to slow pedal, the enforcement regarding board stat? You may have missed it in the in the video which did actually have audio with it, which somehow was not heard, and the board stat is missing a lot of the data. We went through our own data and we saw that it was not included in the board stat. So somehow Boardstat is got imperfections and we're. I can't tell you how many times I called three one and nine one over the last three months. It would be helpful for boardstat to not only show information on a 24-hour daily basis, but also be able to see smaller periods of time like overnight, because that's when a lot of the problems are occurring. Thank you all right. All right. We have Victor saldana hi good evening team. First of all, thank you for inviting me. I'm not really. I used to be part of the Community Board I used to live in Washington Heights. I grew up. I know there was a lot of noise, but we're I'm talking on behalf of Cedar Avenue Block Association. We live right, acrosss the river in the Bronx, and we hear the noise we call. We live right, Acrosss, University, Heights Bridge until 7Th Street and we take the bus, acrosss town and sometimes the streets are blocked by cars. We're trying to get to our jobs at the Allen hospital at Milstein and choney the children's hospital 168 bed. We have to call out sick, sometimes because we can't sleep at night, because the noise, just we hear it acrosss the river, which is shocking, because the water makes it amplifies the noise even more and we call 50s. We've worked with our precincts here in the Bronx and you know they have helped us, deter the noise by actually patrolling the streets, making sure they're, giving summons and taking speakers away, and I know recently they've been working with the 34th. So I just want to give thanks to 34th as well, because they've been closing streets down on 9th avenue, which is where most of the noise that gets the Bronx get hurt. I think a solution is to make sure that we continue patrolling like the speaker before mention if we can get cops out there, just to make sure the summons are given and taking speakers away. I think it's the best solution just to just get back on that and take away, because this will help deter most of these people from coming and, like many have mentioned before, we have license plates. We took down information and most of these people have like New, Jersey and Pennsylvania license plates they're not from around here. So we need to be make sure that we enforce the laws that the council has passed, as is the noise law to make sure that we put summons and take the speakers away and hopefully deter these people from being outside and putting loudspeakers on. Thank you, okay. Finally, we have aileen king hailing hello. Can you hear me now? Yes, hello? Thank you. I can repeat everything that everybody has said, but my question is: why is there an absence of police at all? If, as I go along, I live on Saint, Nicholas, Avenue and there is, I never see a police officer every Friday every day, every Sunday is there a problem? No, there is all this noise. We do not need statistics. If you just are there, you will hear it. You will see it. I do not understand why this goes on si all the time for years now, and there is no one there walking around addressing this. I'm really asking of the police department why there is no one there at all ever deputy inspector Andrea. Would you want to respond sure? I'm on the question that Mrs king has is why she do not see police officers. We turn out roughly six on the four to twelve shift, where I guess most of them, listening to where the sound begins. We turn out anywhere from six to eight vehicles with those six day vehicles. I also have NCOS they're acrosss Saint Nick they're up in Inwood they're over by Familia Post Sherman. We cover 179 to 220.. We are out in every location. What we were experienced was behind George Washington, High School. It looked like the fast and the furious as soon as Kovitz started going through phase one. I quickly closed that down from one night of lawlessness I closed it down. Only residents can go by. I had to use two of my police cars, one from 190 in Amsterdam to 19190 and and George Hill. Then we had the situation, I'm sorry did somebody say something so then I had the situation on dykman, which was growing out of control all the way to La Marina, and I had to dedicate another car to that location. To stop some of the parties going on. What we then start to experience is ninth Avenue, two old seventh street, where everybody saw with that one female who was stripping. I quickly shut that down the very next night. I could tell you that we're experiencing something we have not experienced before a lot of the clubs are closed. Throughout the city, people are still going to gather they're, not socially distancing. They are gathering they are. They have mobile speakers. As somebody mentioned, we are very aggressive in tackling these issues. We were able to stop George Washington, High School from being a problem that was one day of complete lawlessness by the time the cops could get there. One of my cops had to grab a guy who literally put one of those rebel scooters right into the police car and knocked himself to the ground, and then they were gathered by a large group. So we quickly saw that issue 207Th Street, I it was on a sat Sunday. I have not taken vacation a week. I happen to be on vacation. I quickly came up with a plan while I was on vacation and we stopped that issue from happening. So this popping up of these parties has become an issue, we're dedicating a lot of resources to stop it. We've been very successful. We'll continue to come up with a plan. I currently came up with a plan where I have taken two offers from everyone: every platoon, which I carry three platoons on one ship and they're, going to be dedicated to work from eight o'clock at night, so four in the morning to cover at least behind George, Washington, High, School and bikeman, and this way the NCOS and the other resources I have can dedicate themselves to 9th Avenue 207 the speedway and also we're seeing a little uptick. Now in the parks, I'm asking I'm sorry to Interrupt, but I'm really asking to say Avenue 193Rd Street, that is, I just explained: Nick Gavin 1093.. We have a car dedicated to that location. I know Mrs King. I know what you're saying, but we have to attack the biggest problematic locations. I did have a 193 officers. The scientists command I'm down to 153 officers. Every situation is a concern. The most dangerous conditions are going to get the biggest attention, of course, and we are going to continue to attack this, and hopefully we can start resolving the issue. The biggest problem we're having now is we're getting pushback we're getting people out in the street that want to challenge officers and try to get them on videotape, taking a proactive approach to things where they may have to end up, locking a person up, and so the officers have to be very careful on how they approach every situation, because we want to continue to foster a good relationship with the community by still addressing the noise complaints and the quality of life conditions. So I understand your concerns. I promise you, I am not asleep at the wheel. We will continue to address this situation. I will sit down my sol and try to come up with a more precise plan, maybe to help to zone in on 193 and say Nick, but I assure you, we've cleaned up a lot of other growing conditions, as one of the gentlemen was saying, I believe, is Mr King from from acrosss the river and cedar Avenue Cedar route used to be a location in the Bronx where it looked like the fast and furious that was going to go happen in front of behind g dubs. We got rid of it grew over there and I they had such a bad condition over there that they had shots fired and their officers shut down the location. So now this group of individuals are looking for another place to make home. We will not let that let that occur. No, it was not Mr King. It was a victory. Sorry to cut you off there, deputy Steve Simon. As my secretarial role, I want to give you a time check that is about a minute. I'm 30., yeah. Okay, if I could just ask the deputy inspector somebody has suggested on Facebook that we set up a dui checkpoint on Dykman Street to catch the people who are hanging out there drinking late at night. Does that make sense to you absolutely? If we can, we always set up checkpoints in the summer months to set up a checkpoint, does take a lot of resources, Mr Simon, so you know being of being with that be kept in mind. You know it's a little bit more problematic when you're handling we handle about eight thousand radio runs and six thousand three one jobs in a 28-day period. Everything that we measure is a 20-day period. I'll repeat so, with that being in mind to to do a checkpoint takes four units out of service. Oh, so that is what we're having to we'll juggle the manpower issues along with the most problematic locations. We can certainly pick a night, but on a Friday Saturday, a Thursday, Friday, Saturday and Sunday. I need those units really keeping an eye on the crowd, control issues on 9Th Avenue 207 by the Speedway George Washington, High, School or trying park. Inwood Hill Park or you know, by indian road up there and you know some of the other locations, but I will certainly take a look closer at Saint Nick, saying Nick. You know they do. It is loud, sometimes to say Nick. I will give you that we do not see the disorderly crowds as we do in these other locations, but we can certainly time to time make sure we check up on that for Mrs King all right. I appreciate that and maybe at least then we can feel as though we accomplished at least one thing tonight. We should have all right we're accomplishing a lot more things. Trust me when I tell we're moving in the right direction and the cops here care about this community. Thank you, Jonathan can we call claudia share. I thought he was 8:30 already well. I want to make sure that claudia share at least gets a chance to speak she's, not even the least she's, not on the list. No he's not on the list. Yes, I am yes, I am I'm here. Thank you very much. Thank you for unmuting me. I have been trying to speak. I put my name in the chat at 6 25.. What happened is thank you for listening to me. I felt I really appreciate this offer. First of all, I want to actually echo what Chairperson Bueno said at the beginning of the meeting, which is that we're all in this together and I really appreciate the opportunity of being able to come together to meet with all of you and to have met so many of my neighbors in the past, while so to introduce myself on May 17th. I founded thinking it was going to be a very small thing. I founded a Facebook group called Washington, Heights and Inwood for respectful decibel levels due to a very loud car playing music outside, and I could not hear I'm a music teacher and I was trying to teach online and I could not hear my students and it went on for eight hours. The three one request. This is new this year. I know this has never happened before the three- on-. One request got closed out within about five to ten minutes and I would like to know why that is it that the system was over flooded overpowered. I understand how difficult this time has been for everyone or why are they just being closed? Why are not they just left open until a problem is resolved? In any case, I founded the group. I had no idea that now we have, it would grow so quickly. We have over 600 members. We also have a spanish- speaking part of the group, and I've heard so many stories over these past months. From, I would say, the strongest one is there's a woman whose mother passed away after the fireworks. She suffered an anxiety attack on July 4th and it turned into a full- blown heart attack, and a week later, her mother had passed away. She actually wanted to speak, but we did not know her. English is not so strong, and so that was an issue whether she might be able to speak here, but she did want her story told, and so that is a story. I wanted to tell just of the effects of noise, but we've had many other stories as well. You've heard some of them tonight and I also want to say that you know we can we've been trying to come up with some solutions as well and some of these solutions. I they really need to be a collaborative effort, as everybody here has said, and so I'm very glad to see that we have so many people together, and I love the idea of having a group of us that all works together and it works together in two in two ways, and I think the one long- term way is: we try to find outlets for people now, because it's difficult now, when you do not have an outlet, we try to find programs. We try to create things together. We have a public, a public campaign over the effects of noise and how we can work together on that, and then we also have short- term questions. How can we tomorrow night? How can we sleep this weekend? I had two parties that began both of them began at 1 am and they ended at 3:30. A.M and you hear Dun, you know that song. You know, you know that song you've heard it now. I know the song, but you know that I'm just saying from 1 to 3:30 A.M. It was not possible to sleep, and so because we have 600 people in this group and we'd all like to work together and find some solutions. We've created a list of some ideas and if it's possible we'd like to know where we can direct all those ideas and work with you together in this task force, I'm sorry to interrupt claudia, we're at three minutes 30 seconds all right, but if you can, if you can, in the questions, chat, put up a link to your facebook page and any other url you'd like to direct people to because I think you were doing that in the end, but we do have to hurry this up. I apologize yeah. Thank you noble. Thank you for having me. Thank you, claudia great points, great comments and great suggestions. I really love it steve like how many how many people do we have left on the list. Jonathan well, actually we'll have like 15 people right yeah. I do not think we have the Indiana time yeah for the sake of our panel, this time that they've been extremely good at first coming and showing not right at 6:30 like all right can we can. We tell the people that we did not get to that. They should email their comments to us and we will make sure that we review them and invite them and give them a chance to speak at our next meeting. Also Steve also steve you. We should also say that we have you know community board meetings with public Safety transportation committee. Definitely look at the community board schedule when we're back in session and you we can talk about this all the time right. Yes, thank you. Do we have a commitment now to move forward with the task force, something that we're going to start looking into? And, yes, you have our commitment to take a serious approach as to the kind of issues that are affecting each and every one of us business community residents. All of us are being affected equally, so more than others. Some of us, some of the people that are being affected, may not have, like you said in the beginning that do not feel comfortable enough to present and articulate their thoughts in English, but they have also a saying into this. It is all of us, it's not just the voice of the few. It is the voice of the man, and I think that we all agree. We all agree that, yes, we need. We need a series of issues that need to be addressed, as you said, so Steve would like to wrap it up. So maybe one of our official elected ones all right say something. Yes, all right. We have Senator Robert. First, let me thank CB12 and for inviting all the elected public officials to be a part of this hearing to listen to constituents about the issues. The concerns that impact their quality of life. I say to you that my office has directly been involved with many of the constituents trying to address the issues even going back to before July 4th when all of the fireworks have gone off and the Deputy inspector held a meeting at the Y talking about the issues of concerns and my staff were attending the 33rd and other community precinct meetings. This is an ongoing problem that we have to address and coming together, as we talked about, is very important. I think that we need to look at what we can do collectively to communicate with our neighbors, how to be respectful of other people's rights regarding a quality of life issues that impact them. Obviously, de- escalation is very important. The deputy inspector said we do not want to get into a confrontation where something happens and the crowd gathers around and videotapes of this that and the other and people getting arrested. Obviously, de- escalation is the key in order to address this, but I think that we need to communicate with everyone that, while they may want to hang out some people hang out and party to one two three o'clock in the morning many individuals, majority of the people are sleeping at that time with their families and they need to have rest is very important in the process of staying up to date. What's going on, so I thank you for holiness. I think that you, we will continue to have meetings to discuss this and constantly refocusing about what we're doing and how we're doing it in order to make the quality of life better for everyone, and I thank you. Thank you. I also want to thank the board for allowing us the opportunity to be here today to listen. We have heard the concerns of our community. We've received the emails, the calls the tweets and yes, there are growing concerns about noise pollution. I think that we are in the middle of a perfect storm, which includes everything, that's been happening with cobit 19 and the uprisings against police brutality that have been happening in our communities and throughout really the nation, and so I think that in this moment it is an opportunity for us to come together to acknowledge some of the things that have been worrisome in our community. For example, the fireworks was something that all of us have been afflicted by. I live on Aisham Street Vermilia sounds like a war zone every single night, including last night, and there has to be more community oriented ways of dealing with that. I personally have gone out to speak to some of the folks that are using fireworks. We've also been visiting the small businesses to make sure that social distancing is happening, that masks are being worn and that people understand that there are people who are recovering from Covid-19 who have lost loved ones and that there is a trauma, that's inflicted on communities when noise is present and when they feel as though they can not get a reprieve from what is happening out in the streets. I would say that, as we go forward, the task force idea is a great idea. I also think it's important for us to take into account how policing affects our communities and communities of color and coming together with a proposal that is community driven. I personally have been working with some core violence organizations to try and develop some steps that I think we can take collectively I'd love to share that with the board and, in addition, also planning a local day of action where we can go out as a community using the community board as well to engage with some of the youth in our community and some of the other people that may be marginalized at this moment. I also want to bring up an issue that was brought up by angel Vasquez, which is what is a state we could be doing yes, we're in dire straits when it comes to a budget. I know that Robert and I on the state level, have been working tremendously hard to make sure that we're imposing a millionaire's tax. We both carry legislation around that we support that wholeheartedly. We understand that the only way to make an impact is by funding programming in our community, but at the end of the day, this is about going out and finding the solutions, and I look forward to doing that with you all and continuing the conversation. I see this as the beginning and certainly not the end. My office is open and available set up remote phone numbers, but our office is available now for constituent visits on a limited basis, because we're keeping to social distancing- and I am always available via email at carmen Carmendelarosa.Org. Please email me, I'm happy to continue the conversation. Thank you thank you carmen. Thank you so much I'd like to take on Steve before we close our meeting say. Thank you to each and every person who took their time and effort to make this happen. I think this is the kind of effort that makes our community go and makes our community productive and the dialogue. The kind of dialogue, this ability and the productive ideas that have come under our under the table here are tremendously helpful. Thank you to the police department, both the 34th and the 33rd. Thank you to all the agencies, city agencies. That came and gave such a such a group of insight and information. Thank you again for showing up elias said this is Congress Venezuela. I would like to say a couple of words go ahead. Yes, I want to thank everybody that called came into the zoo call and who also put the questions up in the chat. This is quality of life. It continues to be an issue in many in many areas, not just noise, but also the streets are very dirty. The cars are speeding and we must do something about it. For that reason, I confronted rebel. They now suspended their operations city- wide and they will come to the neighborhood and walk through the neighborhood to see the terrain here, because one of the very bad accidents occurred right on fairview and Westwood terrace, one of the steepest hills in the city, if not, the Steepest Hill in the city of New, York and pedestrians were in danger and in jeopardy, and for that reason and other reasons they stop their operations and they're willing to engage the community now. So I'm looking forward to the task force being put together, so they can come before the task force in the future and explain what are their plans to make their company safer for everybody in the city. In addition to that, I, and in the same tone that I heard tonight that people want action. I encourage everyone to come out this saturday at noon. We're going to have a major cleanup of the community is very dirty. I was in Washington for two weeks fighting on the budget and when I came back, I was really taken aback by the level of garbage in the streets, particularly in the commercial strips in the commercial arteries, and so we're going to have a major cleanup and if we need to do it every week, every saturday we'll do it and we'll push for the city agencies to provide more services for this neighborhood. With regards to the noise, I look forward to working with everybody to engage everyone, including the young people, are the folks that are making the noise. I do not think we're going to be able to arrest ourselves out of this issue. We're going to have to engage people educate them, build some level of consciousness to care for your neighbor and to be really cognizant of the kind of noise you're generating that impacts on others. Crime. Homicides, although too many there's only been three. We have the same rate as last year: three homicides for the years. That's amazing for community used to average over 100 homicides a year and we're far lower than the rest of the city and with regards to shootings, also we're far lower than other neighborhoods in the city, but we have this quality of life issue that I think we must not allow to define our neighborhood, and I think someone said that we're all in this together. I think that we are, you know whether you're hearing a conga, and I do not know how to necessarily play the percussion quietly or you're hearing a soprano vocalized and my brother is a lyric tenor for some. That may not know so. I grew up around someone vocalizing in the morning. I think that we need to be constant with each other and we need to take care of each other. So I thank you all for being part of this meeting all right. Thank you. A number of people mentioned the borough president tonight the borough president is with us. Can we allow her to speak as well? I just want to also echo that this has been a tremendous hearing. I go to a lot with community boards, as you know, and I really want to congratulate you- the chair, the chair of the health committee and all the members who spoke, how you treated the wonderful way in which you treated the public and how everybody got to speak. And there was not a sense of we're, not open for business. It was what a community board should be doing and congratulations and I look forward to the task force. I believe on this call. We did ask the center for court innovation to join us because they are a voice and perhaps a place where people could do something, local. That would be up to the Community Board, and we also asked the Peace Institute to join us, because this is what they do. They listen and try to come up in a non- judgmental way with solutions, and I think one of the other issues- and I want to thank beta NYC because their data is important, and I want to thank the chair for inviting them. But I also want to say to pick up on what the assembly member stated in terms of ways that the community could be involved because apparently in Harlem, where you do have as a congressman indicated, you have very low crime statistics. Congratulations, but that's not the case in parts of Harlem and so fridays. Sometimes in the early evening on a street corner, hundreds of people will show up to talk and basically with young people take over the corner, and we say this is our city. This is our community and young people get to talk about what their concerns are, and you find, of course, the most amazingly fabulous discussions taking place. So something like that, you know, might be also another way to deal with we're all in this together and then. Finally, I just want to say I'll certainly be joining the congressman for the trash pickup. But you know it is unfortunate and I know the City council members worked on it, but it's a 65 cut to Weekday service and 100 cut to weekend service. That's a that's a challenge that I think we could all agree on needs to change. Some way, I also want to say I get confused and I'm supposed to know this who's doing what in terms of city agencies, and I have great respect for the work that Christian is doing on the special enforcement. But now I've learned what the sheriff does and I have a better sense, but I think it's hard on the police to know what they're supposed to do. So as part of this task force, I think Washington Heights could perhaps be the leader in understanding who does what and then making it clear to a very fabulously informed community, because in today's postcode with post other issues, we need to make that clear, because you've had Steve some amazing city agencies, consent and each one is excellent. But I think when you're on the ground, sometimes it's hard to know what to do, and I think if we could make that clearer, then everybody would be more comfortable doing their job and perhaps some of these issues will be addressed. So I hope that's helpful. But, more importantly, congratulations. I go to a lot of freaking zooms and I have to say this is one of the best. Congratulations well Gail. Thank you for your support and whatever we do, we will only be possible with your continued support and assistance and thank you for Natalie for all she has done to help us out. I do feel bad about the fact that we were not able to reach everyone, and there are a number of people who wanted a chance to speak. I want them to contact our office, make sure we know who they are, so we can invite them and give them. You know first dibs on the next meeting, so they do have a chance to speak to us and Steve. I know it's late. Would it be possible for me to say just a few brief words? Well only if your name is Mark Levine, it is indeed thank you Steve. Thank you. Community board 12 for convening this I'll. Try and be brief, because I know we're over time. This really was an overwhelmingly respectful, solution- oriented conversation, and I want to thank everyone who spoke for that and, of course, our colleagues in the 33rd and 34 precinct in the agencies. I chair, the health Committee and I do see noise as a public health problem. I also live in southern Washington Heights, as I think many of you know on 163Rd street, where we've had a lot of challenges with noise so far this summer, and this is a problem that we all have to work together to solve. It does impact the mental health of our community, especially those who have to work those who are grieving, those who have health challenges and much more. I could not help but observing just how many of the problems described tonight are related to vehicles to cars, many of which are coming from outside the community and I'm pushing legislation in the city council that would institute residential parking permits in New York City in neighborhoods like ours. This is something being done successfully in other parts of the country, not in New York City, but it's an important way to ensure that limited spaces in our community are not taken up by folks coming from elsewhere, and I think it might have a secondary benefit of helping to alleviate some of the problems that are described here, and you know in the context in which we're all extremely sensitive to the need to avoid any kind of overly aggressive enforcement, particularly on young people of color. A focus on vehicles is something different. You can ticket a vehicle, you do not take a vehicle to jail, you can boot a vehicle there are. There are enforcement options we have at our disposal that are unique to going after the vehicles and I'd like to work with you in my capacity as a council member and chair of the health Committee to do that. And lastly, I know the royal president and others- and I really believe in data transparency, and I do not think we quite resolve the questions around calls to 3- 1-, 1 and the way in which those are being cleared very quickly. I'd like to flag that, as as a pending issue that we need to resolve, we need to make sure that 311 is a reliable way of reporting and tracking incidents and, of course, most importantly, getting a response, and so I'm committed to work with all of you in that capacity in the city Council on that issue, I'm going to wrap it up there. I look forward to a continued dialogue and work mutually respectfully to address these issues together, all of uptown and thanks again to all of you for participating tonight. Thank you and the keynote is respectful that that's the key word for the night. Thank you very much and you made some good points and we look forward to working with you. I believe I just want to thank again deputy chief green Deputy, Inspector Andrea Captain Chung Christian Klosner, Jerry Kelpin. I love the fact that you're still there after 35 years, emily Goldman Dr Bronzaft looking forward to working with you again and we're going to try to do whatever we can to come up with solutions. Thank you so much eliezer. Do you have a final word? Did we lose you all right? I think that brings our hearing to a close and please, if you did not get a chance to speak tonight, contact our office. Send us your comments, or at least let us know your information, so we can make sure that you're on the list or high up on the list, the next time we have one of these hearings. Thank you. So much thanks a lot. Steve have a great night. Thank you. Everyone have a great night. Thank you. Everyone.",
            "summary": "I'm extremely humbled and happy to share this platform with so many well- intentioned people who really and truly care about their community people who are willing and able to give up their time and effort and energy to make sure that we that we coming to a civil understanding as to how to bring city agencies the police department to come and sit down and discuss some of the issues that are affecting us directly and again.\nThe executive director of the mayor's office of special enforcement geraldine Kelpin, the director for air noise policy and enforcement for the Department of Environmental Protection Deputy Inspector, benny mccants, the director of city- wide operations for the Parks enforcement, Patrol, Emily Goldman, the deputy director of beta NYC and last, but certainly not least, Dr Arlene bronzaft a long- time board.\nMember of grow, NYC, formerly known as the council on the environment and recognized for years as a city, wide expert on noise, issues.\nI want to also acknowledge that we're joined by Jeremy Crim from the first Deputy mayor's office and Isaiah jenkins, the Manhattan borough director of the mayor's Community Affairs, unit, and I, want to thank Isaiah for helping the line up.\nAndrea Good afternoon I got a little bit of an understanding that it might be about some noise complaints, but I'm just going to go over the status and the state of the 3- 4 Currently, a 3- 4 precinct, focusing on major crimes and violent crimes.\nAs far as shootings were down for the year four compared to five last year, so we were doing really good this year compared to last year again thanks to community thanks to the NCOS and our sectors and precinct people working together.\nThat was not allowed to be open, and now is our office fields, complaints and coordinates with a number of different agencies, acrosss the city to get out and look at the conditions on the ground and make sure that as businesses reopen they're doing it in a way that's safe for both the community, the customers, the workers and the business itself.\nThe main thing that we did was set up a 311 complaint, line, and so residents of this community board should know that you can go to the 311 website or you can call 311 and make complaints about businesses that are opening, but not in compliance with guidelines.\nThe setup is what's happening on the what's happening, with passage on the sidewalk and there's a complaint page for that on 3- 1, 1- 1, as well, under open restaurants, and both of those complaint pages have references to each other, and so you know you can should be able to easily navigate to the right place or the call taker We have people from all different agencies- Department of Health, Department of buildings, fire, Deputy Sheriff's office and Department of Sanitation Department, environmental protection.\nIf anybody in the city government knows the noise code in and out She's been with DEP for quite a while a couple of decades, at least well more than that, so I'm so happy that you're still with DEP, and we can count on you to help us understand.\nSo I have been with cep for 35 years now, but we'll put that aside for the moment and let's talk about noise, the noise code and some of the issues that we're seeing, especially with so many people having to stay home and probably an increased sensitivity to normal.\nThink because so many people are within their dwelling units that the ice cream truck guys play so that people know that they're outside and maybe come out, It's a difficult time for them, because they've lost a lot of street business.\nWe probably should make clear that that maybe most of the complaints that people have had in the community lately involving the late night parties and fireworks and cars racing up and down the streets, those probably do not go to you.\nBut it's helpful to understand what it is that the EPA does do And I have to mention that I work for the parks, Department, and so does this gentleman Deputy inspector benny mccants, the director of city- wide operations for the Parks enforcement patrol He's very familiar with the Washington Heights Inwood area.\nOur next speaker is emily Goldman, the deputy director for beta NYC She has been analyzing and cataloging the three one complaints generated from our community and just yesterday she works in association with the borough president's office, and just yesterday the borough president's office released a report showing the various statistics broken down by community board, and there are like five different categories of noise: complaints.\nComplaints broken down in like in numerous different ways that are actually specially tailored for community board purposes.\nThink also, like EDC, has a couple of categories of noise: complaints that go to them, but the majority of them go to the New York Police Department, but there are really are like almost a dozen different types of noise: complaints, noise, commercial Noise, Residential, Noise, Street, Sidewalk, just building construction, noise, noise at places of worship, helicopter noise and then within each of those categories.\nThere were at least five noise categories that must have been, maybe in that top 10 tier of complaints generated by people here in board, 12 He just plugged this into boardstat and basically for the year 2020 for specifically for community board 12.\nThat probably accounts for why that complaint type is the sixth highest in community Ward 12 over this past year of 2020, followed by illegal parking, unsanitary, conditions, water issues and then finally, is is noise, commercial, And, I.\nThink the interesting thing to notice about that is that noise, commercial is often one of the highest complaint types of the fact that it's substantially less than Noise Street Sidewalk, Noise residential noise, vehicle non- emergency police matter and illegal fireworks even is clearly representing the fact that commercial businesses have been mostly shut.\nSo, there's not going to be the same amount of noise generated from commercial establishments as we would expect in a non- So that that's just a quick sample of the top complaint types in Community board.\nWe could cut this data, but that's kind of the most the most overview way we have of looking at it, and I said- If I'm not mistaken, the number of street and the Noise Street Sidewalk complaint, category.\nDr, Arlene bronzaft, a board member for grow NYC used to be known as the council on the environment She probably launched her career in Inwood, working on behalf of the students at Ps98, in a groundbreaking study where she found that the students who had classrooms on the side of the building closest to the elevated subway tracks were suffering because their lessons were continually disrupted by the noise from the subway and the people on the other.\nAnd, they said they would ameliorate the noise at schools, similarly located near tracks, but people also live near the tracks, and so the Ta agreed to start quieting.\nThe tracks with the procedures that were developed in Inwood This is 2020 and the Covid-19 situation has added another element, but I strongly believe that what we're talking about particularly 18,000 complaints about sidewalk, noise, but I, think if the people got together as they did, then they would be able to come up with a solution.\nWhen we talk about noise and we know that people need their sleep, their rest.\nI. Think the people in the community now the police, department, Dp and all the members of the board can very well do what we did all those years.\nI understand the stress of coed Covid-19, but I think that we can, if we work together, come up with solutions that will reduce the level of sound in the community and improve the health and the quality of life.\nAll right looks like we have a lot of people in in the chat who want to be able to speak.\nFirst, you know Kenneth was the first one We need to think about how we're going to hold each other accountable for addressing these issues, because I can say that I have been reaching out to people elected everybody about this issue, begging for help, and I.\nWould like to know what is how we're going to address it, and I would propose that we think about starting a task force, and that would help us to move forward to address this.\nThen it just goes away, but that we actually have a mechanism in place in order to like make sure that we are addressing these specific issues and in really targeting solutions for different issues and that task force, you know, can be made up of other people a lot of people here, as well as of the community members, who are directly impacted by it.\nAt, And I just thought that everybody here, if this is what the community had to endure , know I've been fighting as a community board member for years about this, issue.\nAll in be all on having the Community board deal with this issue, and I expect the committee that I chair, which you're a member of, will continue to look into this and act on this issue.\nSo I like to know what are we going to do from this moment on to get this fixed as a community We're ready to work, and I hope?\nYou know, but what I would say: is, let's think, outside of the box, and let's start thinking of ways of being able to redefine public safety where disproportionately people of color are not going to be impacted, because some people do not understand intersectionality.\n, the next one is wendy life wendy you wanna, do live all right, go ahead, hello, I'm speaking for the residents of chittenden avenue, which is for the 34th precinct, and we have had problems even before the Covid-19 of people parking on our street and hanging out and become unbearable and unlivable.\nWe are desperately in need of street parking, so change the sign on the West side of Chittenden Avenue to let the residents legally park and that way we would get rid of the problem of people coming hanging.\nWe did an intel report on it, And we're waiting to hear a response, but it also needs a little push from other people in the community right, not just the police department.\nWe must also understand that when we go to our local restaurants and bars to spend our local money we're helping small businesses, if you see a problem, address it right, So I'm willing to work out with people that want to form a task.\nDefinitely a splash of you know: segregation when it comes to real estate and things like that Do you have any examples of cities that are doing it correctly through either zoning Okay, I'd like to talk to the crime issue, because I have written papers on crime and noise and you're.\nLet's get creative there's a ton of do- gooders in our city that have plenty of money that they come in here and create programs to give people opportunities, because the reason why this is happening is People are unemployed, they do not have jobs, they do not have places to go and they do not have other things to do, and It's not going to be ameliorated by just looking at the micro level of this particular spot, or this particular restaurant, or that particular like corner.\nIf you know the data you'll understand that those are the community boards that have the largest concentration of minorities and with that I'll again encourage you guys to come and assist and participate and take advantage of this.\nI've lived here, like I said, a long time and what I think one of the causes are as to why people flock to this part of the city to do whatever they want to do is also linked with a permissiveness see the businesses in our area that serve alcohol and that had a club- Like atmosphere have repeatedly broken their licensing agreements over time, and that also includes the issue with La Marina and La. Marina was closed down, but the perception of our neighborhood did not change with that, and so, whereas absolutely everything is exacerbated by Covid-19.\nI, do not think I'm going to work safe, And, then there's the broader picture of how our neighborhood is so dismissed by the people that behave.\nWe feel fundamentally let down by our elected by the police and by the Community Board And I'm, one of those people that believes wholeheartedly.\nAs we move towards reopening schools, I, can only imagine how this noise pollution, how the parties, how the intensive group gatherings that I've seen all over my neighborhood are going to affect my students and I'm speaking in a very passionately way, because my kids are being affected like they literally can not sleep.\nIf I remember, I think, Steve Simon last week at the Committee of the whole, I'm, not sure if he had said that out of all the coded deaths in New, York City, there was something like 900 and somewhat people in this area that died of Covid-19, and you know.\nOkay, I live acrosss the street from Morgan Stanley children's hospital and three blocks from my house: Okay, the emergency room and the pardon the hospital and every single night, and sometimes, during the day, I'm hearing people blasting their car stereos that my windows are actually shaking You know: is: is not there.\nSo I think that's really important that you kind of build a relationship with the police department and the community affairs officer, the NCOS.\nWe want that Kiosk shut down and if you guys are not going to do it, the community will do it because we're not getting any help from anybody in this community, and I feel sorry for so many people who have complained tonight because their problems are not resolved.\nCb12 has 15 times the noise complaints of some other community boards.\nWe've worked with our precincts here in the Bronx Us, deter the noise by actually patrolling the streets, making sure they're, giving summons and taking speakers away, and I know recently.\nWe're getting people out in the street that want to challenge officers and try to get them on videotape, taking a proactive approach to things where they may have to end up, locking a person up, and so the officers have to be very careful on how they approach every situation, because we want to continue to foster a good relationship with the community by still addressing the noise complaints and the quality of life.\nI, say to you that my office has directly been involved with many of the constituents trying to address the issues even going back to before July 4th when all of the fireworks have gone off and the Deputy inspector held a meeting at the Y talking about the issues of concerns and my staff were attending the 33rd and other community precinct.\nI think that we need to look at what we can do collectively to communicate with our neighbors, how to be respectful of other people's rights regarding a quality of life issues that impact them.\nLook forward to working with everybody to engage everyone, including the young people, are the folks that are making the noise.\nWe're going to have to engage people educate, them, build some level of consciousness to care for your neighbor and to be really cognizant of the kind of noise you're generating that impacts on others.\nI, go to a lot with community boards, as you know, and I really want to congratulate you- The chair, the chair of the health committee and all the members who spoke, how you treated the wonderful way in which you treated the public and how everybody got to speak.\nThink many of you know on 163Rd street, where we've had a lot of challenges with noise."
        }
    }
}