{
    "YoutubeMetadata": {
        "author": "MCB10",
        "channelId": "https://www.youtube.com/channel/UCZ1-u3qX7AUUPzH9O_Peb-Q",
        "title": "June 2020 Public Safety Committee Meeting",
        "publishDate": "2020-06-29",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB10",
        "normalizedName": "Manhattan Community Board 10",
        "twitterName": "Manhattan CB 10",
        "youtubeChannelName": "Manhattan CB10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
        "twitterHandle": "@mancb10",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": "changed live 9/13/2020"
    },
    "properties": {
        "fullTranscript": "You Shiki, can you hear me yeah, hey yeah I got my audio on via my phone, but I have the video on too so I could see so she's gonna give it to about six. Thirty thousand six, forty to start John. Yes, how are you it's just? How are you doing I'm good? Thank you! Oh I'm. Sorry I thought we were the only two on here. Okay, sorry, a few of us on your mobile sorry, I just saw John on my screen. So sorry good evening. Everybody and we're just gonna wait on a few more minutes. You can let everybody kind of log on so probably start about 35 yeah, everybody's, probably getting up everybody's, probably getting off that last soon. Call you, okay, everyone we're going to go ahead and start I was wrong. I wanted to wait on 20th precinct and 32nd precinct and present of those sorts be joining the meeting when I'm good afternoon or good evening. Everyone. This is Charles Johnson chair for Public, Safety I just wanted to thank everyone who's here. You see not sure. If I see we had Barbara at askins on the line. I want to say hello, Yvette. Thank you. Donna Jones, Cicely I, see you John Melba, of course, so first I wanted to I guess I wanted to see, especially McGrady was on the on the line. I knows we wanted to follow up with her regarding her warm program. I don't see her on, but if she does get our world I heard it to speak about that I'm, probably going to be doing a few shiftings when it comes to the agenda since I'm singing one on here, I also wanted to address Barbara, see Barbara yeah I wanted to address the just I wanted to get some follow up on some of the community shootings. The things that I've heard from last month, I just wanted to see if 30, second or 20th precinct have any follow up. Regarding those I think there are about three or four shootings that were reported out so when they get on I'll, make sure that we definitely get some answers to that piece and then also I wanted them since to address and clarify just even some of the fireworks last shooting concerns over the past few. A few days I, don't know if you all noticed outside during the evening times it sounds like it's either. You know a combination of fireworks, there's a combination, gunshots I've seen it I know that there are fireworks on, but I've heard people come to me concerned whether or not it's expired. What's going on the town in downtown or if these are gunshots. So I just wanted to get. Excuse me, 28 to 30 32nd precinct to kind of get some clarity about. What's going on that part, but I see not here so we'll have to table that. Are there any? Are there any representatives from the city agencies or, for instance, from naturally interest bids that want to speak regarding any anything or any concerns that they have no I I'm good I'm here to listen? Okay, this will really not be shipped over some of the stuff from Cobra community updates and community shooting. So I want to go ahead and move over to the Frederick Douglass Business Alliance request very good streets letter of support for support, john lynch. You go ahead and it's before yours, okay, good evening. Everyone, it's good to see a lot of friendly faces, Thank You Charles for inviting us to present to the Public Safety Committee Thank You Chancellor Harris, for having us here. So we you have seen the a letter that we had written regarding a pending application that the Frederick Douglass Boulevard has in connection with an application to for an O participate in the open Street program. So things have been moving sort of hectically and people are trying to get information and find out. What's going on, you know every day, there's new information and things seem to be changing, but there are two programs now in the works that overlap. One is the open streets program, which is the New York City's program to designate a hundred blocks of open streets that could be, you know, designated for different things or they could be on. The dining could just be pedestrians closed the traffic. There were various aspects that open streets can take and that's a program, that's being overseen by the Department of Transportation. Now as I'm, probably as soon as tomorrow. We understand that they'll be announcing the Cote d'or dining program that will come into effect when York City goes into Phase. Two and again this you know, information is coming as we speak. It looks like phase two might start as soon as Monday, according to both now Governor Cuomo and mayor de Blasio. Today, so, like I said, we had made a proposal to designate Frederick Douglass Boulevard to be in the open Street program for a section between 112 Street and 120. Second Street, we had a conversation we finally were able to speak directly to the Department of Transportation. Yesterday we spoke to Kimberly I have her name here somewhere I keep miss stating her name, true court Kimberly at Department of Transportation about that application, and also she filled us in a where things look like they go in with the outdoor dining program. As far as the our open streets request, the one concern that Kimberly expressed on behalf of D of T was regarding any kind of closure of bus routes, and she expressed even the D-O-T is simply not you know has not been doing that and would likely not do that. So we kind of went- and you know that was just a statement on her part, but we discussed other aspects whether there would be potential closure of traffic lanes or parking lanes in one direction or either direction whether there could be closure of side streets, and we spoke about perhaps having closures of side streets on 114th and a hundred n170 919, but again overlaying. All of this will be the outdoor dining permits. It looks I as soon as tomorrow or Friday. Businesses will be able to go online and register for outdoor dining restaurant businesses and the deity's position was well. Let's you know. Maybe we should just see how that plays out, see what restaurants apply for that, what is permitted and how that works out and that program, apparently and again the details will come in a day or two, but apparently it would allow outdoor dining and a combination of perhaps sidewalks and parking lanes in addition to existing sidewalk cafes. As long as there are no bus stops block no fire hydrants blocked and as long as it doesn't interfere with intersections so Kimberly from DoD. Her few seem to be. You know, let's see how that goes, and then we could take a snapshot of in this case, Frederick Douglass Boulevard and see them if there are options to sort of expand to something more like it like an open street. So that seems to be you know what we're hearing from the department transportation we're here today, of course, to listen to the community board and to see how we can sort of partner in this effort to you know to welcome you back. You be the community. Has the community welcome the businesses back, restaurants on Frederick, Douglas, Boulevard and just one other point I wanted to make as far as the interplay between open streets and the proposed outdoor dining, we had been advised that by T of T that it would be good to make an application for open streets as an organization which is what we did as Frederick Douglass Boulevard lights. The outdoor dining applications, however, are as far as I can tell, will be done on an individual business of restaurant by restaurant basis. So it's not necessarily going to be under the auspices or control of the FD ba you know in a day or two any restaurant in New, York, City I assume, is going to be able to go online and make that application. We're also told that it's going to be a self-certification process, meeting that I guess as long as you look at the requirements and check the boxes, you're going to be good to go without a whole lot of and I assume there'll be thousands and thousands of these applications put in by the city. So, in any event, that's my understanding of where things seem to stand, but again we want to speak to the community board and find out what concerns you have our sources, though, as far as just the deserts, the designated areas that they that they identify as far as the town that's going to be blocked off, for you know, Thursday through Sunday for the you know for the top rate that they want. How would they be able to? You know just enforce to make sure that people are traffic or what that is not necessarily going through, that are blocked off area? Well, the organization that makes the application I understand will have to take on quite a bit of responsibility in you know for lack of a better word. You know, policing or overseeing. What's going on, we may end up with the situation again as Kimberly from DMT. It's suggested that there may be a grant of outdoor dining permits, if that's, if that's what they going to be called outdoor dining permits to individual restaurants. That may well have been before there's any designation one way or the other as to whether they'll be also an open, Street area, and that, as far as what the open street would look like, that will again depend on what Theo T decides to grant, and you know it could be. It could be, you know, just a parking lane and could be laying on one side of Lane on both sides. So at this point it's not really clear what it would look like, or what would there would be to enforce, but F TBA is prepared to you know, take on the you know the role of the of the organization with the application who would / see whenever DoD designates in terms of the terms of an open street I know if that answers your question, but yeah no I think it's kind of those things like that. The onus is gonna be on the restaurants. I just wanted to know if I'm pretty done with Business Alliance had any idea of how they were one to you know assist some of the businesses of restaurants. That may need help with that. Are you are looking at private security or you know off-duty police officers? You know- or you know just little things like that. The other thing I wanted to ask. You is I, know: I noticed that there was on. There was a letter that was included from Gale Brewer, so I didn't know if you wanted to just kind of add on what the what the perspective and even Sicily may be able to jump into just what al Brewer and our borough president's offices are viewpoints are when it comes to the designated feet area. Well, I just could say in general, from what Gail brewery has both stated in her testimony, which is what I copied you on and what she has stated to us, and we have I mean I know if we've had that many extensive conversations with her but she's been expressing support in the open Street concept in general and supportive and open to have some aspect of it take place in Harlem and again I. It's a little bit confusing this interplay between open streets and the outdoor dining program, because you know we may have this week a lot of restaurants, all over New York City applying for outdoor dining permits. You know without, and you know it wouldn't necessarily have anything to do with F DBA. So you know they're going to make an application they're going to represent whatever if they're required to represent and obviously if they are in, you know violating any of the restrictions. I assume complaints might be made, an action could be made. So in other words, you know we have sort of we. You know we put the open streets application in, but the individual restaurant open dining permits in you know in reality it's not be under FDA's control, yeah of course, now I'm. Just assuming that, if something happens, there's going to be restaurants, and if you look at you know, you guys forgot in Cerritos, Oh sugar court. We- and it sounds like this- is good yeah I think I saw I cut you off. I was agree. I, think that you know we'd be ready to provide that supportive. You know, if necessary and whatever information the guys that we have just put I just want to say you know, there's a couple of other people here from Frederick Oaks Boulevard lines that Lieber bueno the owner of Vinatieri she's, our the vice president of the organization I'm co-president along with Suzanna contine, who could not be here this evening because she had a conflict I see we have Melvin Wilson, who was a member of F DBA and also the current president of the New York City hospitality alliance, the first female and first person of color to hold that row and I see Rosario Louie, the from NYU's Mac, silver Institute, former deputy borough president and a founding member of ft ba. So you know at any point they may have some definitely wanna I want to turn them in after I discuss it's one of the insurance questions from one of board. Members are barbara gnosis, yes, that does the application supersede. The applications that come to the community board for outdoor seating is the other available to community I mean to board members yeah. Well, that's a that's a very good question and the answer is from I'm reading and from what I'm, seeing it again I'm. You know, I'm literally, you know ten minutes before the school reading articles about what's going on the open. Yes, the open, dining permits that are going to start soon and the open streets application, which are you know technically, have an open, do not formally require community board input. We of course copied you on our Leonard and you know the same time. We sent it to everyone else and obviously wants you to have this dialogue with the community board, but I think you know fortunately or unfortunately, some of these programs seem to be proceeding without calling for formal community board involvement. That's what I can see. Oh I guess one thing before you charge my rants wanted to see. Has there been any type of surveys? I know that we can't physically go to homes and things of that nature, but just even from an email subscriber list from the various people who go to the restaurants that are attached to Frederick Douglas Boulevard Alliance, to see what their sentiments are. As far as far as the blocking also goes of those areas because they'll be directly impacted, has there been anything like that done or claims they're, not to my knowledge, I, don't know if any of our members have had discussions or have had input of feedback in that regard, just I see Cicely asked a question about temporary. How long will the apartment last I don't know? I mean we're gonna all find out when I think the mayor is going to take a vote on it. So my question was specifically: is this process being superseded by restaurants that have not even Pacific's with how much space is on the sidewalk which allows for people to pass to and from, and that was my question I understand the open streets process. One of the reasons I'm sitting in this meeting is because the day of our meeting we received the letter from you. It's a transportation committee person that we vote on this a letter of support for the FD ba Alliance, and so it didn't come with any letters of support from the specific people. There was no presentation at all. Actually you guys weren't. Even there, if the letter presented itself, and so we asked that it was tabled until a full presentation can be brought back to our committee to fix in regards to located, so even if they supersede the process of who can have out the seating, we still would like to know who the participants are, and if the community basically supports this dis progress on this process, actually apologize. Okay, we have a lot of so Barbara do to try to address some of what you said it and it's good to see you by the way. Hope you well. So you know I'm sort of just telling you what I'm, seeing and hearing I'm, not you know, sort of taking a value judgment or, like I said, fortunately, or probably, unfortunately, some of these things are being are being proposed. You know, without the usual kind of process that we would have seen in for lack of a better word. You know normal times or back in the not too old days. You know we sent our letter to you know as soon as this all came up as soon as we sent it to anybody, and you know, there's no specific. You know there was no direction or requirement, but obviously we here to speak to this committee because we were invited. We are happy to speak to the Transportation Committee I know we're gonna speak to the Economic Development Committee at their next meeting. So we're you know we're open to all that. But it's a you know, weird shooting in the dark as well. Trying to figure out trying to you know, speak to DLT trying to find out what you know what the process is going to be and again as far as things like you know, sidewalk space and the usual concepts you have when you deal with the sidewalk cafe I think there are going to be requirements that the city's going to announce tomorrow, I, don't know exactly what they are, but I do know that you know you're not going to be able to. You know serve in the street. If there's a bus, stop you're not going to be able to block a fire, hydrant you're not gonna, be able to interfere with intersection in intersections, so those things that were mentioned by DLT, but you know they're, calling it a self-certification process which I don't means. You know that you check the boxes and you'll get your application. That's the transportation and Department of Consumer Affairs yeah! Do you know? Oh I saw just real quick. So since we have some representatives also from 30 days, those Business, Alliance, Melba and them I just want to see just kind of get their thoughts or just input as well. Regarding the program, I know that you're definitely more in favor, for but I just wanted to do something to get in perspective from the actual restaurant holders, our owners I'm. Sorry, thank you, our mutant over my apologies. This is probably only the seventh of the day. These I don't know how you go right, but yeah. So we definitely hear their concerns, but I also want to speak from the other side as a small business owner who's born bread and butter, and right here in the community, and also someone who saved up money literally to open up my business in this community that I'm born and raised in that I live in and that I love. If you look at where we are within a ten-block radius on Frederick Douglas, Boulevard I was the first restaurant to open up so as a Chinese spot down the block, the Chinese to go spot, but the first sit-down dining restaurant to open up here and I'm so happy to know that we're now considered the Uptown version of Restaurant Row. However, when you look at within a ten-block radius, we have eight businesses that have closed literally in the last three months. That's concerning to me, eight that have closed and that I personally know of four more that are thinking about closing that's devastating, that's devastating! For a myriad of reasons, it's devastating because one of the beauty, one of the beautiful things about this neighborhood is economic empowerment. The fact that we don't have to go outside of our community of Harlem for goods and services that we need when I first opened up Melba's a lot of the options that we have here were not here. We also know that business brings business. So when I look at the numbers 16 years ago of what we were making, those numbers have definitely multiplied because there are other businesses that are here and maybe someone will come and they'll go to Vina, tarea and they'll, say: oh, what's the restaurant across the street or down the block and then next time you know they may consider coming up to dine with us at Melba's. But, more importantly than all of that, we look at the people in our community that we employ. Those are people that, for the last three months have not been working and you take away that you take where you take away on a way for people to feed not just themselves but their families, and you take away the true economic development of Arlo's I know there definitely some concerns the guidelines. None of us know what they are. The mayor has not released them I'm on the mayor's Advisory, Committee and I. Don't know what they are. I know what people are talking about. However, we won't know for sure what the guidelines are and what the date will be until the mayor makes the announcement I was on a call with them. Today, they're saying the announcement could be made as early as tomorrow. That's what we're hoping for and that's a date John is right, but there's what they've speculated with we've been speculating and what we were told previously was June 22nd. However, that has not been confirmed as of yet I do know that we there needs to be a lifeline given these businesses to our businesses, if not we're not going to be able to last one of the things that we've asked for, as Johnna stated earlier, that there's a section of Frederick Douglass Boulevard that we can close with we're. Looking at 10 blocks for 20 weeks, closing those 10 blocks for 20 weeks, we'll keep a lot of our businesses a lot. If you look at even what we at Melba's are making now it's 30 percent of what I've ever made, that's a low number, that's a low number and we get a ton of publicity and we're still at 30%. You know we do. We do deliveries for frontline workers, those meals which are typically normally cost at anywhere between 19 and 26 dollars. We're now doing those for $10, so there's no profit margin in there, but what we are able to do is to keep some of our employees working. So when we're asking for a bus lane to be rerouted to Manhattan Avenue, where there, where there's a bus lane already, you know it, may sound like a lot but in actuality, it's ten blocks for 20 weeks and the mystics have shown that in businesses where the Avenue or the Street has been closed, that there's been an increase in revenue of up to 65%, so as a small business owner I sit here before you today and I asked for that lifeline, not just for myself, but for my brothers and sisters that are also restaurant tours and business owners. Thank you. Thank you. Thank you I, just before I get to any other members from all the credit Desert Business Alliance I just want to just let everyone know too I think we all have to be mindful of those factors too we're looking at just the collective public safety piece, but just know too that, from the community standpoint we just have to make sure ensure that there are certain parameters or certain things that are that are in a liner or planning to be in line, because one thing that I don't want to see happen is that you know community board gives the support letter for this and then a few weeks down the road. There's some incident with you know with a kid walking through that area, and then you know you know it's all types of stuff going on so I just want to make sure that their parameters set and that the communities involved with it as well, and they have the supporting, because I think that is a symbiotic relationship here in Harlem. So, like you know, Harlem can thrive without that without the community residents, but it also can't drive without the businesses. So I do think pressure doesn't Business Alliance for even being there to a system that symbiotic relationship, but I think it sounds like it's a lot of unknowns. Yet when it comes to this and we're still waiting on some further guidance from the city, that's what I'm hearing so far and I think that over the next you know a few days. Hopefully the next few days we'll have a little bit more guidance, but that's what that's? What I'm kind of gathering from this is there any? Are there any other restaurant owner? Yet they want to speak or share their thoughts before I was open. It back up to me told you already couple. You referred a couple of times to Frederick Douglass Business Alliance, so FTB is actually Frederick, Douglass Boulevard Alliance during the name know it's all so I emphasize that the membership is not just businesses, it is anyone who is Boulevard a resident, a renter and owner a business owner or stakeholders. So just okay. Thank you. Thank you for the quiz, my apologies, Rose rose. You want to go ahead. Thank you. Thank you good evening. Everybody good to see you and hope you and your families are doing well- is the founder of FDB a who served as the board president and on community board ten. You know the impetus for doing this really harkens back to the fact that FD ba as part of a historic rezoning was designated not only the Gateway to Harlem, but the restaurant row and one of the unique benefits that FDB has is extremely large sidewalks, as well as adjacent streets that also serve as transportation hubs. So, if you recall for I, know the community board marches in the African American Day Parade that is shut down both uptown in downtown, where there is a bus route, D-O-T does sign off on that and many times those bus routes are rerouted to either st. Nicholas or Manhattan Avenue, because we both so many restaurants like Chocolat, Zuma row, house, Harlem, tavern, levain, bakery Harlem, hop, house, Lido and so many other businesses that have been directly impacted that we also benefit from wide sidewalks, which could address some of the concerns about pedestrian walkways. And this is something that we have also given due deliberation. - I think what Melba and John have said for our businesses. One of the reasons why we needed to be proactive in this application is to ensure that neighborhoods, like Harlem, had the benefit of participating in initiatives such as this understanding that there is a disparate impact on businesses that are outside of the central business district. We know that in communities like Hell's Kitchen and in Brooklyn, there are streets that are shut down in areas where there are a number of restaurants, and there have been challenges with that. I do think, because the two eighth precinct is also located in our community. There are opportunities to work in collaboration to ensure that this is something that is enjoyable for the entire community that is safe for children that is safe for community residents. That is safe for our seniors and would be welcome, given that we have been shut in for the past three months and I know, there's a lot of energy to be out there, but what one of our major concerns is @f DBA along the boulevard is that we know that there are restaurants. That would greatly benefit from the injection of support into those businesses, because we are very fearful, as with the rest of the catchment of CB 10, then we're gonna lose a lot of historic businesses. So we think this is a great opportunity to showcase not only restaurant row but the gateway into Harlem in a way that it's safe. That is a incorporates perspectives of the community because we envision this organization very much like the downtown Alliance, which is an organization not only of merchants, but is an organization of community residents that we can do something that can be a way to come back out into the community that respects guidelines that have been set up by the city and state, but also is a way that I know that all of us are committed to in terms of showing support for small business organizations that helped to transform boulevards like Melba Mike 67 orange, like Chocolat, like mocha, like Bennett area, that invested and also live in the community, so I hope that the community board will give due consideration to this and understand that we are hoping to collaborate with everyone to ensure that this is as successful as possible. Thank you for your. Thank you. Thank you. Thank you. Is it or did you did you want to leave any comments regarding this I think you're still on you? Oh yes, thank you. So much I just wanted to say that I certainly concur with Melba's of overview of the current marketplace that it's really dwindled, Windell dwindle, don't do very little that we're making- and this truly would be an infusion of energy. I, also feel as though I have my ear to the ground in terms of speaking with other businesses. There's a tremendous amount of reciprocity between the various businesses. We are super close, which is something that maybe seems a bit foreign to other business Carter's, but I have the personal phone numbers of everyone, Melba Susannah from lead. Oh, we concur all the time we speak all the time and honestly I do feel that this restaurant community has had a tremendous amount restraint and that we've been complying with all of the rules that we want to do this. We want to do this very safely, but recognizing that this is truly the possibility of a lifeline for business that has been really ravaged by vyckhoven and I, just wanted to infuse that and that we are really truly a diverse community and that we're all working together and I have a very big hunch that the entirety of our community of our customer base would be absolutely delighted by the prospect of being able to enjoy a meal, enjoy a glass of wine outside on the cafe and into the streets and I hope that we can make this dream realized. Ok, I think Barbara is trying to say something where you have to. Let's just be clear, we are not. We are not I am not against myself. We use us to get to and from like the 10 bucks like when they read about it around other businesses, because there's no turning on to come north again. So what happens to people who live north of 140, 5th, Street or 130 5th Street I would like to frequent your businesses by public transportation. They don't want to take the subway. So my concern is not the reopening of ion's and spend my money in black businesses. My concern is when we talk about routing. That is really. We have a lot of a lot of people who are would love to restaurant is a great restaurant. Go visit them go see. So let's just be clear. I'm just concerned with when you talk about taking over the streets as opposed to utilizing space that you already have, because, as you say, you have a large sidewalks. Why do we need the street? Thank you, Thank You Barbara are there? Are there any other board members or public members that they want to chime in or have any comments? You want to type it into the chat and it can be right out before we move along. Can I ask a question? Oh yes, hi I, just wanted to say. I first feel like I. Am I just want to say that our businesses, our restaurants, are vital to the community and we can to support them so I think that's very significant and I am I, attended the Congress for New Urbanism conference last week and there's a lot of discussion open streets of that conference and I'm. Just wondering I noticed that some communities were much more proactive. They have been planning a to come back, and this is no we're just doing this now and there was a use of practices and we have some best practices here in the city. Maybe the after send the village districts but I think that's something that we need to look at. You know do our due diligence there and I also noticed that these some of these other neighborhoods or communities they did outreach to their community. They engage in the process. That was that was very significant, and so you get a buy-in from the community and I just wanted to ask another question as to how can we, in terms of all of our restaurants in be ten, because we do have quite a few, and you know how to make this work and just best practices enjoying the research hey, so yeah I think that that's something that definitely could be brought up with our Economic Development Committee. You know when it comes to that particular question: Karen I might be a little bit outside of Public Safety's pervy home, but yeah. That's the only thing. Infirm understand is they're, gonna, be doing a presentation or they're gonna, they're gonna be presenting and requesting for a letter support as well from economic development, so I think we would just have to tune in for that particular meeting to see exactly you know what their response would be to that. But I don't know if that was going to kind of fall under Public Safety right now. Are there any other public members or board members that are like this before we move on? Thank you, oh hi. Everyone! All right, John, Rose, everybody, first of all, I just like to say thank you all for coming today for week now, as I have always believed before I definitely do support our small businesses see if I need to put a head. I did have some concerns and I raised them in the meeting that I was invited with Curtis Archer and I've also raised them to Manhattan borough. President brewer, sorry, you were closer to the screen, is the echo stop? Is there he's helping? Yes, I'll be raising I just want to raise them again. Messaging is very outreach is very important program, so I am encouraged that you know we have two former Boardman on this team John in rows and the have reached out personally that I've different events and things so I appreciate that so I'm encouraged by the participation who's involved in this effort that they are familiar with our community, that they have always supported our community. They know what I've been needs and what we deserve. So with that, some of the things that I are sorry talk to John about our concerns were, of course, the transportation and I know that the subway runs up and down that corridor. But I myself do take the N I depend on the m10 and so and I know a lot of our seniors. So when you, the subway as being a real alternative to the enemy and if you've actually had to take that bus down, you know that the subway only starts at 1 2015, there's at least four bus stops in between that. You know, you're expecting folks to walk down or walk in between. So we need to think about. How do we, you know, be continue to provide that transportation as everyone's been talking about without rerouting it too far on either side to make it more difficult to people to get back to work or our seniors. Just to you know to go out bout. Their daily business. We also want to talk about sanitation in Harlem, has been an issue for a while. So we just want to make sure that, as we're increasing the presence outdoors because, yes, as you increase the hopefully the folks coming to your businesses, you're increasing just general traffic folks- that may not have any intention of dining but just want to be outside and have communion, which is which is great and have community, but there's also in that increased or just trash and just our streets to not be as clean. So we just want to make sure that we're thinking about that and how that will affect us and another thing that we were all been dealing with is this is basically this pandemic and the tale of two pandemics so with the racial inequality and Co vat19. If you look at our stats, we might not be as bad as some areas in Brooklyn and some day as areas in the Bronx, but we've been hit by Kovac 19 we've had this from : 19. So when we talk about getting people back out, we need to talk about social distancing and we need to make sure that that's happening. We need to make sure that if you, if these businesses are open, have some masks available for folks, not just folks that are dining the folks that are passing by because at that point they become a potential customer preaching to the choir about that. But at that point you know they become a potential. Customer or potential may be a potential hazard to some of your customers. So we want to make sure that we're able to social distance as we open these businesses and then we want to talk about security. So the last piece to kind of to echo what Charles Johnson our chair of Public Safety was talking about. This may be added security around because when we did have sidewalk cafes, there were some incidents and I can weave glad to say that those incidents have gone down, but there were instances where cell phones were being taken. Purses were being searched, so we wanted to make sure that is a thought process behind these open streets and I did have a question so- and this is just a basic question when you're looking at maybe shutting down those streets. Remember thank you. For giving that timeline of 20 weeks, so that's like five months so that looks like into November. Would it be the shutdown for from Thursday to Sunday 12 to 9 p.m. would that be something you'd be asking for or what would be the details of your ask. I know: I read the letter I'm just asking. If that's what we're talking about like five months four weeks, four for 20 weeks, excuse me Thursday to Sunday 12 to 9, if you all do get the permit for the open streets. Yes, that is the ask that we've made of do T in the application Thursday through Sunday 12 to 9, okay and I know. This is just your proposal right now and, of course, we're open to conversation, because we do want to come to a point where we're supporting. That is definitely the end-all goal for us. We want to support. We want to be able to say we are all in on this and gives you any support that you need. So, in that conversation, when we're talking about Thursday to Friday's, well, Denine folks will probably you know, hopefully getting be getting back to work, one in your businesses and other businesses. Other industries, that's quite a bit of time on that Thursday and Friday. When people are trying to get back and forth to work and such with, could there be maybe a reduction on Thursday for Friday, so maybe 5 to 9 Thursday's on Fridays and maybe Saturday and Sunday? Something else are you all to those type of conversations, and also with shutting the entire Street down? Would there be? Maybe chances like you were saying about maybe having passage on one side of the street and the business is out too. You know in one part of the street or something like that. Are those the options that you're looking at or are you open to those type of things? Well, like I said we had a long discussion with Tod yesterday and well. Firstly, the question about cutting back the time period. I assume that you are your concern is with transportation and well. You know, under the assumption that you know the closed Street would close off the bus and we you know, we just don't know that that's gonna happen. I'll tell you know deal T is first responses. No, we don't do that so I, you know, I, don't know if they're gonna, you know, move off of that or not. So it's a little hard to say. Yes, you know we well, you know, let's cut it back to avoid the transportation issue when that may end up being moot. She also did say that they haven't been kind of you know. Closing entire streets is also something that I don't know. I don't want to put words in her mind said it never happens, but yes that there's certainly a possibility that we would end up. Looking at you know just the parking lanes, you know one way, the other with sill. You know some limit of traffic or more buses going through the middle and, like I said before my sense of weird, where the woman from deity was going seem to be like. Well, you know, let's see what restaurants open up under the open dining policy, and then we could so take a snapshot and look at what kind of open street concepts might work. Then, in light of what we see with whatever restaurants have the ability to dine outside and then, of course, there's also the concept of just adding closing the side streets which would completely eliminate the whole bus issue. So you know it's all kind of moving parts, and you know some of which we'll know more when we see what the mayor comes out yesterday or tomorrow or Friday and says in terms of the restrictions but again I feel like in some extent we're talking in a little bit of a vacuum and we're probably gonna know more in two days or we're. Probably you know number yeah next week. You know we're probably gonna know more. You know if it when any restaurants gonna go ahead to and again and like I said before you know, the restaurants are gonna, go online and apply for these outdoor seating. It's gonna in a sense nothing to do with FDA. That's just gonna be independent people, you know whether they, you know pas dues or you know, give a hoot about FTP or not so did that extend and that's gonna be all over ha and all over New York City yeah all over the city without a doubt, but also keep in mind that even with phase two, that's only what's proposed of what will be proposed or projected to be proposed is that we can put tables and chairs on the sidewalk. People will still have to come into the restaurant and purchase your food to go so we won't be able to serve outside and we won't be able to serve it inside under phase 2 phase. 3 we're projecting is that restaurants will have 50% capacity inside and so to answer your question Barbara earlier as to. Why are we asking for the roadways, because when you can only serve what 50% of 50% capacity inside that there may be some additional space needed for some of the restaurants? Typically, restaurants make a profit at anything. That's at 75% over yeah. On that point I. It's my understand that the current rule is gonna remain in effect where, if you're taking drink outside you're required to take food outside as well and but again, you know we'll see what the what the final regulations say tomorrow so, like I, said we're looking for some further developments, but all I think this is, as you know, kind of rounded around. As far as I see, you didn't see, be tens perspective into some input on it, something once we get some more information and then I know that I said on economic development. Looking forward to that presentation with nothing and that dialogue as well, for you know for I, guess an overall decision and speaking to the rest of our committee members about it. But thank you all is there anything else that you all wanted to add before we move on I do yeah, it's actually ROS Pierluisi. So a couple of questions, although in mind, is why that the vitality of our small businesses, who, for example, I put this in the chat FDB businesses employ over 400 community residents, that if we do not provide the necessary support to businesses, what you're going to see is empty storefronts and from a public safety perspective. That is not something that we want to achieve, and so I would hope that, and we give due consideration in the same way that we gives consideration for the african-american Day Parade that shuts down a major thoroughfare for several hours. That know that our intention is to showcase what Harlem has to offer that to ensure that we are incorporated into any conversation regarding our small businesses and that we are invested in the safety of all community residents in the accessibility of all community residents, and one of the things that has been greatly beneficial to FD ba is to into Frederick Douglass Boulevard is to have the access of Manhattan Avenue, st. Nicholas, Adam, Clayton, Powell Boulevard, and a tremendous, east-west transportation network and subway network. So I hope you will support our proposal. That will be an opportunity to showcase what we have to offer uptown and that will allow us to begin to strategically think about how we do this across our community, so that the small businesses, particularly restaurants, that will not really be able to open until phase three. If we got there that if these restaurants, like Melba's, like Bennett area like 67 orange, like Chocolat like mocha, if they are not there, that is a loss for all of us. But, more importantly, it is a loss in terms of Workforce Development. So I hope you will give due consideration and thank you for the opportunity to present to your committee. May I suggest, since this lot of support really crosses over into three to four committees that and we're working with zoom. It would be helpful if the things that we've discussed tonight, if someone from TVA can just bullet point. So we don't have to keep asking the same questions and so that we're all on the same page with the answers or and there's so many unknowns right, because we're waiting to hear, as you said, from tamiya, so I'm, just suggesting that we don't you don't have to keep rehashing the same thing. We've already got it down. We know what questions may come forth in the economic committee, because I'm gonna, and we already have the answers that we've already participated and any additional information can be added as we move forward as opposed to just did you want to speak on that part yeah? That's. That sounds like a great idea. Of course. We always like live folks there to answer our questions, but I definitely believe in a fake use. So that would be great too I'd. Also just like to highlight. Madame borough, president Gale Brewer is hosting a uptown forum on Monday the 22nd. What we will be talking about this with and what I mean up sound form, it's all the uptown community, or so that's 9, 10, 11 and 12. That will be involved in the forum. So we're going to be talking about open streets, among other things as well, and this is reopening all of that will be in that forum and I just wanted to thank rose for putting in the chat about distributing masks, and that just goes to what we were talking about of making the appeal. So we can say this board, everybody can say we're in favor of all these restaurants, reopening an FDA closing down the streets, but what's important as well, you know is that we make the community feel comfortable about coming out. I'm confused me myself, like I'm, not a cook. My stove is like who are you like I'm, not a cook I, don't cook I'm, always in the restaurants, but even at this point, I am a little bit tentative about going out and, in my mind, I feel like I'm, relatively healthy. So even in these situations, I'm a little bit sensitive about going out. So I think where, if you suggestion, if your messaging includes the mass distribution and just more outreach- and they can, the community actually sees the efforts that you're doing to one make it safe. I. Think that is going to be a big game changer and how the community receives the reopening. So that's just my I thought about that all right. Thank you. We're kind of gonna try to circle back at some of the I guess the agenda I want I, see that we have now. We have some of the representatives from some of the city agencies, city and state agency. So if there is anything that any type of announcements that needed to be made a few Linda's on the phone I, don't know if one, if you wanted to make a quick announcement before I, go to the next portion. Linda I see your Michelle on mute or what is I, think yeah. Okay, hello, Jamie, I've, actually only precious little time. Alright, so I don't see anything from the new city. State and I, see that I don't see 32nd or 28th precinct on the call. I know that we received some reports, so I wanted to just get a switching your district managers office to err to circulate that within the community and then we'll have to circle back with them next month. I do know that, because of because of everything, that's going on a lot of the 22nd at 30 28, its 32nd precinct or on call for things so I mean this is this is probably a hectic crazy time so we'll try to get the reports circulated to the community via the via on the district manager's office. But to be honest with you that was really pretty much it. There was one last announcement I wanted to make. Let me see there's it was. It was an email sent out from the district manager's office at yesterday about ten o'clock in the morning, just a job pretty much announcing. Please join the n-double-a-cp hell's kitchen's Democrats in Manhattan Community of Orton on Juneteenth for an important conversation about police brutality, racism, discrimination in our city. We have invited New, York, City's elected officials to officially listen to our panel on black community leaders, moderated by Keith Wright, chair of the New York County Democratic Committee, discussing ways to combat the threat to our community the legislation, a resolution we can begin to make real change in honor of our ancestors. Let us come together on this special day to continue the work that they've begun, so this is going to be on June 9th 19th at 11:30 a.m. there's been correspondence circulated about it, but if you all, like I, said, need a copy of it or want me to, or once we send it out directly, we can do that. It's like I, said I'm looking forward to it. I'm actually going to be on the panel wearing two hats representing chair for public safety as well as I've just got appointed for vice-chair for criminal justice for n double acp, a Manhattan branch, so I'm, looking forward to having a dialogue and really trying to see if we can come to a collective effort of figuring some stuff out to combat this Linda I see that you are off from you. Do you want to say anything we're now yeah the press, any of the press star six to mute yourself, okay, well, Linda Simon can technical difficulties so anywhere you are I own. If there's nothing else. Thank you aware this that the testing site 118 yeah Donna protein, the up in the chat. Thank you aware of this, and the staff are on testing site. 118 is very appreciative. I want just reading out some of the comments and chats or whatnot. So if you all want to check inside the chat group, if you can't I'm just going to read this out to see local restaurants yeah now that was just about our previous conversation, so yeah. If there's nothing else, you all didn't that's pretty much it for the meeting. We don't really have anybody any other agenda items. So thank you all for calling in on this home day, Thank You, Charles, Thank, You, Cecily good to see you all we'll be in touch. Thank you. Thank you. Alright, y'all later, thank you again. John see you later barber and Melba. Thank you. - yeah hi Barbara bye. Everyone. Thank you.",
        "summary": "Any representatives from the city agencies or, for instance, from naturally interest bids that want to speak regarding any anything or any concerns that they have no This will really not be shipped over some of the stuff from Cobra community updates and community shooting So I want to go ahead and move over to the Frederick Douglass Business Alliance request very good streets letter of support for support john lynch We you have seen the a letter that we had written regarding a pending application, that the Frederick Douglass Boulevard has in connection with an application to for an O participate in the open Street program, and people are trying to get information and find out.\nAs far as the our open streets request, the one concern that Kimberly expressed on behalf of D of T was regarding any kind of closure of bus routes, and she expressed- and you know that was just a statement on her part, but we discussed other aspects whether there would be potential closure of traffic lanes or parking lanes in one direction or either direction whether there could be closure of side streets, and we spoke about perhaps having closures of side streets on 114th and a hundred n170 919, but again overlaying All of this will be the outdoor dining permits.\nWe should just see how that plays out, see what restaurants apply for that, what is permitted and how that works out and that program, apparently and again, the details will come in a day or two, but apparently it would allow outdoor dining and a combination of perhaps sidewalks and parking lanes in addition to existing sidewalk cafes As long as there are no bus stops block no fire hydrants blocked and as long as it doesn't interfere with intersections so Kimberly from DoD, and then we could take a snapshot of in this case, Frederick Douglass Boulevard and see them if there are options to sort of expand to something more like it like an open street You know what we're hearing from the department transportation we're here today, of course, to listen to the community board and to see how we can sort of partner in this effort to you know to welcome you back You, be the community Has. The community welcome the businesses back, restaurants on Frederick, Douglas, Boulevard and just one other point.\nSo, it's not necessarily going to be under the auspices or control of the FD ba you know in a day or two any restaurant in New, York, City I assume, is going to be able to go online and make that application In any event, that's my understanding of where things seem to stand, but again we want to speak to the community board and find out what concerns you have our sources, though, as far as just the deserts, the designated areas that they that they identify as far as the town, that's going to be blocked off.\nIf that's, if that's what they going to be called outdoor dining permits to individual restaurants, That may well have been before there's any designation one way or the other as to whether they'll be also an open, Street area, and that, as far as what the open street would look like, that will again depend on what Theo T decides to grant, and you know it could be.\nThere was a letter that was included from Gale Brewer, so I didn't know if you wanted to just kind of add on what the what the perspective and even Sicily may be able to jump into just what al Brewer and our borough president's offices are viewpoints are when it comes to the designated feet area, but she's been expressing support in the open Street concept in general and supportive and open to have some aspect of it take place in Harlem and again, I It's a little bit confusing this interplay between open streets and the outdoor dining program, because you know we may have this week a lot of restaurants, all over New York City applying for outdoor dining permits.\nWe put the open streets application in, but the individual restaurant open, dining permits in you know in reality it's not be under FDA's control, Just, assuming that, if something happens, there's going to be restaurants, and if you look at you know, you guys forgot in Cerritos, Oh sugar court, You know if necessary and whatever information the guys that we have just put , there's a couple of other people here from Frederick Oaks Boulevard lines that Lieber bueno the owner of Vinatieri she's, our the vice president of the organization I'm co-president along with Suzanna contine, who could not be here this evening because she had a conflict I see we have Melvin Wilson, who was a member of F DBA and also the current president of the New York City hospitality alliance, the first female and first person of color to hold that row and I see Rosario Louie, the from NYU's Mac, silver Institute, former deputy borough president and a founding member of ft ba You know at any point they may have some definitely wanna I want to turn them in after I.\nI think we all have to be mindful of those factors too we're looking at just the collective public safety piece, but just know too that, from the community standpoint we just have to make sure ensure that there are certain parameters or certain things that are that are in a liner or planning to be in line, because one thing that I don't want to see happen is that you know community board gives the support letter for this Some incident with you know with a kid walking through that area, So like you know, Harlem can thrive without that without the community residents, but it also can't drive without the businesses Are there, any other restaurant owner?\nThat would greatly benefit from the injection of support into those businesses, because we are very fearful, as with the rest of the catchment of CB 10, then we're gonna lose a lot of historic businesses We think this is a great opportunity to showcase not only restaurant row, but the gateway into Harlem in a way that it's safe That is a incorporates perspectives of the community, because we envision this organization very much like the downtown Alliance, which is an organization not only of merchants, but is an organization of community residents that we can do something that can be a way to come back out into the community that respects guidelines that have been set up by the city and state, but also is a way that I know that all of us are committed to in terms of showing support for small business organizations that helped to transform boulevards like Melba Mike 67 orange, like Chocolat, like mocha, like Bennett area, that invested and also live in the community.\nFirst of all, I just like to say thank you all for coming today for week now, as I have always believed before I definitely do support our small businesses see if I need to put a head and I've also raised them to Manhattan borough Messaging is very outreach, is very important program, so so I appreciate that so I'm encouraged by the participation who's involved in this effort that they are familiar with our community, that they have always supported our community So with that some of the things that I are sorry talk to John about our concerns were, of course, the transportation and I know that the subway runs up and down that corridor So when you the subway as being a real alternative to the enemy and if you've actually had to take that bus down."
    }
}