{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "November 12th",
            "publishDate": "2020-11-13",
            "shortDescription": "",
            "lengthSeconds": "1:40:50"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "_EnNMsxASUE",
            "fillerWordCount": {
                "uh": 300,
                "um": 301
            },
            "readTimeFullTranscript": "57 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "budget": 30,
                "requests": 19,
                "street": 18,
                "capital": 18,
                "building": 18,
                "voting": 16,
                "amendment": 16,
                "bill": 15,
                "services": 14,
                "housing": 14
            },
            "wordCountSummary": {
                "budget": 9,
                "voting": 8,
                "state": 8,
                "bill": 7,
                "capital": 7,
                "requests": 6,
                "building": 5,
                "absentee": 4,
                "money": 4,
                "expense": 4
            },
            "fullTranscript": "Chair as usual, we'll begin our meeting by hearing from those of our elected officials that are in attendance that wish to speak, and they should do that by using the raise hand feature after the elected officials they'll be followed by excuse me, representatives of other electeds, who may report to the board for two minutes each. We then enter the public session. This is the opportunity for anyone from the public to bring information to the board. Anyone wishing to speak, please sign up by 6:30, be sure to include the subject you will be addressing as well as contact information. Should we need to do so and remember, there's a time limit of two minutes. So please respect the time constraints that the board faces during each of our meetings. We then enter the business session and that's when the board opines. It consists of adoption of the minutes. The chairs report, the committee reports, the resolutions, questions and comments and voting questions and comments from either applicants or the public or if additional information is needed, are allowed only with the chair's approval. So we will start this evening. I will start this evening's meeting right now. Who do we have in attendance from the electeds? I know we're expecting Gail. Is she here? She is not here yet. Okay and brad I do not think he's here. Yet, okay, anyone else, I'm looking through the list. We have a few raised hands. I know that Jeremy Unger had requested to speak first yeah, but I'm just seeing if there are any other electeds first I do not see any right, correct, okay, all right and Jeremy. You are on thanks, vicky and thanks. Everybody. Apologies I have to jump between this meeting and another zoom, that's scheduled at the same time. So you know the wonders of the world we live in today. Obviously, it's been a crazy few weeks in New, York, City and around the country. You know right now the councilwoman is chair of the Council. The council's committee on hospitals is really focused on the rise of Covid-19 cases in New York City. Thankfully, a lot of parts of Manhattan are seeing lower rates than in other parts of the city, but it's still rising they're still seeing some neighborhoods on the West side in around two percent positivity, which is certainly concerning. We have been in discussions with hospitals around the city and we just held a hearing on lessons learned in the treatment of Covid-19 at the height of the first wave, heard a lot of interesting information about how hospitals are going to handle patient loads and moving patients earlier on. If we do see a wave start to emerge in hospitals, thankfully, we have not seen that yet, you know usually hospitalizations usually lag by about two weeks when you see a spike, so we'll be certainly monitoring that in the coming weeks, but right now we're still seeing pretty stable hospitalization rates in New York City. On other issues, the councilwoman recently introduced a piece of legislation to remove the term mental retardation from the city's laws and charter. It still, unfortunately, is in parts of the of the city's laws and we're going to be replacing it with intellectual and developmental disabilities. We're really excited about this I know. A lot of disability advocates have been working on this for a long time. It's kind of the last piece of the puzzle on this subject at the state and the federal level have already done this, so really excited to see that happen and then finally, two constituent issues in CB5 that we're working on a lot now. You know, obviously the situation at the Mave hotel, with the closure of that was concerning to us in terms of how quickly it was done with families in there who have kids, who are at local schools. So we are trying to continue to work with DHS, CB5 and everyone else on that issue, and also on the larger issue of transfers right now, during the pandemic, we think there should not be a. We think there should be a moratorium on hotel, shelter, transfers right now for the safety of folks and then finally, Luke and our team is working actively on the situation with the for some of you who are the Flatiron there's a drummer. There is causing quite a lot of noise and we've been trying to get every agency from the NYPD to parks, to those who DOT to get that situation solved and I want to just give Luke a personal thanks for all the work he's doing on that. So if anyone else has any questions happy to answer them. Okay, thank you, Jeremy. Anyone else from rept representatives of the electeds, please raise your hand good. We have Kate Theobald first hi good evening. Everyone I'm here from Councilman Powers office, I'm his chief of staff hope you all have been getting to enjoy the nice weather that we had the past few days. I just have a few quick updates. I want to share with you over the past month, or so with the election. Our office was pretty engaged in assisting BOE with some troubleshooting issues. You know we got a lot of questions about absentee ballots and pulse sites and I just want to thank Community Board five's committee on budget education and city services. For inviting me and a couple other of the elected offices to come speak about election law. Matters got an opportunity to talk about councilmember powers bill to support installing absentee ballot, drop-off boxes in New, York City. So like looking ahead, as Jeremy said, you know we're focused on monitoring and managing the recent uptick in Covid-19 cases. Councilmember powers has also been looking forward towards what we need to be doing to make sure Midtown is ready for economic recovery. When that time happens, he had an op-ed published last week in cranes about midterm recovery, focused on things such as like safe and reliable transportation. How that will be a key component like, for instance, more spaces for CitiBikes, and how the city should explore partnerships with private developers for new stations, increased accessibility at our subway stops and including that in any new development requiring investments from developers and just more pedestrians, pedestrianization, just like in the east Midtown rezoning how they've allocated funding to design a new shared street next to Grand Central, doing more types of projects like this on the l. Lastly, on a legislative front, beyond the councilman's bill to bring the ballot drop-off boxes to the city, he recently introduced a bill to remove the issuance and administration of press credentials from the NYPD to an independent agency to allow more transparency and accountability in that in that region. Well, that's it from me. Thank you very much. Okay, thank you. Kate next I see Justin Flagg thanks Justin Flagg from Senator Kruger's office on the Covid-19 Front Senator. Kruger's message is that you know we have to not only remain vigilant. We need to ramp our vigilance back up to levels that we had back in the first wave. We are on the cusp of a second wave. Some people are saying we're in a second wave and we need to take that very seriously. The governor has issued new restrictions that go into effect tomorrow. Night bars and restaurants have to close by 10 P.M, except for takeout gyms and fitness centers have to close by 10 P.M and no more than 10 people are allowed in private gatherings and Senator. Krueger's message is that she's advising people to avoid both indoor and outdoor dining at this point, if you want to support our restaurants or to take out tip your delivery person very well, it's a hardship for a lot of people, but it is a necessary one. Also, a lot of the spread that we're seeing around the country is coming from small private gatherings, not necessarily large events. So we can't let our guard down. We can't give into Covid-19 fatigue or quarantine fatigue. We know what the guidelines are and we have to follow them if we want to save lives, if we want to prevent more economic pain. As for the election, Senator Kruger is thankful that her constituents have sent her back to Albany for another term. We know there were big problems, of course, with the board of Elections Administration of the election, we're holding a round table in December on a bill that Senator Kruger carries to professionalize the board of elections in the city. The details on that are tbd, but if you sign up on our mailing list at lizkruger.com or follow our social media, we'll be announcing the details on that as soon as we have them thanks. Okay, thank you. Justin Lori, sorry, lori, you're, muted, again, not sure why I'm muted, now yeah yep, okay, great first I, want to thank CB5 for working with our office on issues regarding 23rd, 24th and 25Th street Sixth avenue. This location's been especially difficult due to a lot of issues from illegal vending to an increase in homeless individuals and drug use. This week we held a meeting with approximately 30 people and we're joined by Marisa and Luke. It was actually a follow-up to a September meeting with many of the stakeholders in the area plus city agencies. We're getting to see a lot of progress with property owners, adding lighting some of the empty lots have been secured. Flatiron bid, cleaned up a lot of the Kirkbitty and pd's been doing a lot of work around the vending issue. We were told by the mayor's office that they are still in the process of transitioning vending enforcement from pd to another agency, possibly DCA, though, that decision is not final quickly. Our office held a donation drive to assist people living in shelters. We are truly grateful for the outpouring of support from the district 3 community. We received hundreds of donations of everyday commodities like shampoos, soap to toothpaste, which are invaluable during such a challenging time. We also continue to deliver meals in district three. During the month of October, our office helped deliver 3500 free meals since Mid-September we have delivered 6130 meals in our community and we look forward to continuing to do that. And finally, our third annual toy drive is coming up even and possibly be especially because of Covid-19. We are continuing. Our annual toy drive asking people to consider donating new unwrapped toys suitable for children from three months to 17 years old, we're having two drop off days in our office at 2:24, West 30Th street. The two drop-off days are December 1st and December, 8th from 12 to 5 and I will send the flyer to Marisa and Luke to circulate, and that's it for us. Okay, thank you. Lori next would be Luke Wolf, Everyone, Luke, wolf, the other Luke. On these meetings from Controller Stringer's office. I'm going to just quickly update you on some of the work we've been doing. This fall first, I'm pushing the city to do everything it can to make sure students have internet access. We know that, with all students engaging in remote learning this year, access to technology is really a key factor in their ability to get an education. So first the comptroller sent a letter to the mayor and Chancellor Kuranza, urging the city to act immediately to close the digital divide, which we know leaves over a hundred thousand students each day without internet. So what the comptroller proposed that the city offers subsidized and redeemable what we're calling internet passports for low-income families to purchase broadband service from providers in their area. So this would help to ensure that students without internet do not fall further behind in their coursework and find themselves at a deeper disadvantage educationally this year. So second, the comptroller authored a op-ed with advocates for children, focusing on supporting the needs of over the 13,000 students living in family shelters in our city. The op-ed laid out a blueprint to provide students, families and shelter providers, the necessary technology and services to improve their remote learning experience. So once again, they do not fall either further. Behind educationally, we've also been at work, strengthening our city for the future. So this week, comptroller's trainer renewed us called the restart New York City's lagging capital program. So we know that every billion dollars of construction results in 5,000 direct jobs and many multiple thousand indirect jobs. So over the pandemic there have been two 4.2 billion in planned capital projects removed from fiscal years, 2020 and 2021 about a billion in affordable housing and almost 900 million in school construction projects. So we think that our infrastructure needs are so significant and so ongoing that we should continue spending on our capital budget to make sure we're making investments for our future. Lastly, the comptroller launched a survey with an organization called the better balance to measure how families are balancing work and life during the pandemic. I'll drop that survey in the chat and would like you all to take it only take a few minutes to do. Thank you, okay. Thank you. Luke Taylor, from Congresswoman Maloney's office, hello. Good evening, everybody I am filling in for Betsy tonight. She is out in staten island working as a poll watcher all week. I do not not jealous ever. The congresswoman is heading back to DC next week with what we can only expect to be a very happy plate of work with some of the issues we were seeing in the transition process. I am sure, in her role as chair of the Oversight committee, that she will be keeping a close eye on all aspects of this. In other news, the past this past month, the congresswoman fought and succeeded to get the administration to agree to pay back millions of dollars that it took from the fdny's 911 treatment program, certificate of appropriateness by the New York City Landmark, Preservation Commission. Sorry, if, if you have a speech in the background, can you no I do not know where that's coming from? That's? Why I just stopped I know some of you may be: okay thanks the census ended and though we will not know what happens in regards to accuracy and the time it gets to the data end for a little bit. Now we do know that New York City did pretty well given the circumstances and that the Census Bureau says that they are confident they were able to enumerate almost all of the households, even those who did not self-respond the congresswoman has continued her fight to protect the USPS, getting additional documents and information regarding the slowdowns and changes. She also introduced a bill. The saving the civil service Act to block the President's recent executive order to reclassify elements of the civil service to make it easier to hire and fire Federal employees, Congresswoman Maloney subpoenaed customs of border patrol over their lack of investigation into lewd and threatening social media posts by made by its agents. Her request for a report on latino representation in Hollywood was accepted by the gao she released documents following a department of justice settlement with purdue and sackler families. She called on the usgs director James Riley, to be removed after an inspector general investigation determined that he retaliated against a whistleblower she's, seeking information on the administration's efforts to withhold federal funds from cities deemed anarchisture additions jurisdictions and this week in light of the transition issues mentioned earlier, the congresswoman joined other House Committee chairs and sending dozens of letters directing White, House and federal agencies to preserve documents in accordance with the law. That is all the updates I have for now, though, I probably missed a few. As always, you can stay updated on the congresswoman's work by subscribing to our newsletter or visiting our website at Maloney.House.Gov or reaching out to a member of our staff. Thank you great. Thank you. Taylor next up will be Bryce from Assemblyman Gottfried's office thanks very much Vicky Phil Mary's is on vacation today, so I'm just filling in for him tonight. I'll be very brief. Senator Hoyleman and Assemblymember gottfried are co-hosting free flu shots next Tuesday from 10 A.M to 3 P.M, it's not actually in board 5, but it's relatively close that will be at the corner of Penn South Southwest Corner of 26Th Street and 8Th Avenue Tuesday from 10 to 3. You can rsvp online or by calling somebody number godfried's office at two one, two: zero. Seven. Nine hundred. Thank you! Okay! Thank you very much. I think that is it on the representatives of the electeds, correct, I, believe so, yes, okay, that moves us into hearing from anyone from the public for two minutes. Each may I make an interruption. I'm here, Senator Brad Holland, Brad, hi brad. How are you I'm? Well, sorry, I'm nice to see you vicky good to see you, oh what a world we're living in we're smiling, though we're smiling we're, smiling we're smiling through it and hopefully there's a break bright horizon. Thank you for the mention of flu shots, greece glad to be partnering with the civil member on that the governor signed a bill of mine into law which would protect new yorkers from strategic lawsuits against public participation vicki. Those are those are lawsuits that basically are being brought by wealthy folks, mostly many developers. Sometimes people like Harvey Weinstein, who have been trying to silence speech by passing by introducing lawsuits, often in the area of defamation and our new bill is going to make it harder for those lawsuits to move forward. In addition to Donald Trump passing introducing a lot of these types of lawsuits against everyone, ranging from Miss America pageant contestants to Bill maher one of our constituents, Michael Mckee, was sued by the real estate board. Excuse me: the not the real estate board, the rsa, the rent, Stabilization Association for 40 million dollars, because he spoke out in support of rent stabilization laws at city Hall. So this is going to put the onus back onto these powerful individuals and groups that are filing frivolous lawsuits and make them pay attorneys fees if it's determined that the lawsuit is meant to stifle public participation. I wanted to let you know also vicky that the governor signed a second bill of mine that will protect consumers against automatic renewals, whether you're say a member of a gym or you've signed up for something online, often described as a free trial. No longer were these automatic renewals be allowed to occur unless you intentionally opt into them previously. The system in New York had been. You had to opt out now. This new law is going to require you to opt in. If you want an automatic renewal, a lot of people during Covid-19 have been trying to get out of their gym. Memberships I had an 80 year old and a 92 year old couple who had were being asked by New York Sports Club, to walk down to the New York Sports Club office actually take a subway up to the New York Sports Club office during Covid-19 to personally try to get out of their gym membership. Moving forward you, if you signed up online you'll, be able to unenroll online. So that's going to be important and then finally, I've introduced bill. A bill called the pandemic self storage act. A lot of new yorkers have had their personal items, be put up for a lien sale because they were unable to pay their self storage fees during this pandemic. Many of them unemployed, like so many of us and this law. This new bill will prevent those lien sales from going forward and and protect a lot of personal possessions that are, you know up in the air as a lot of new yorkers are trying to get back up on their feet and get employed. So that's my my third item. I'd like to share with you thanks, so much good to see you good to see you good news, especially the automatic renewals I can personally attest to that. Oh good I know that's been a burning issue and I also like to thank Keith powers. Our colleague in the council he's been advocating for that at the city level, so he's been instrumental in getting that passed right. Thank you is gail on board. Okay, good, to see you Brad. Thank you all right now we'll go into public. Please use the raised hand. If you're joining us from a phone. You can press star 9 to indicate that you'd like to speak. Anyone there Luke I, think we had five speakers. Originally five people did indicate on the digital sign-in. Cheat that but I do see just one right now. Do you see that I do not have the name Lisa Wager, oh Lisa, okay, Lisa, Okay Lisa? Are you sure hi? My name is Lisa Wager, I'm director of government community relations at the Fashion Institute of Technology, I'm here to speak about a proposed CitiBike station. Fit has a significant and immediate problem with the new CitiBike station proposed for 8th Avenue at 27Th Street directly in front of one of the college's loading docks. As many of you know, for quite a while. We've been on the cusp of construction for the college's first new academic building in 40 years. Approval has come through and we're going to begin mobilizing for construction within weeks. The new building is going on an empty lot on 28th street, it's in the college's footprint and that's where our main loading dock and sanitation pickup area is they're, going to be closed, demolished and incorporated into the new building. But construction is taking three years. So all the loading dock and sanitation pickup activities have to move around onto our smaller Eighth Avenue loading Dock. It only has half the capacity of the 28th street facility and it's also supported by a third really small loading dock. Next to it that can take hand delivered packages. So everything's going to be on 8th avenue for the next three years. It's going to be very busy. The DOT station is supposed to go on the sidewalk and extend from the corner of 27Th street up to the southern edge of the main loading dock, which is exactly the stretch in the street where delivery vehicles and sanitation trucks will be lining up and pulling in so access for hand, truck and package delivery to the little hand, delivery dock will be fully blocked by this 50-foot station and of great significance. Bicycles will be backing out into a line of trucks and then be pushed out into the second traffic lane of the very congested eighth Avenue, because the parking lane is full of delivery vehicles. It's clear that installing a CitiBike station here will create a significant hardship for the college and the businesses that deliver to and support all of the facilities on campus, and it will create unsafe conditions for the bikers who would be using it the supposed the purported clients who should be able to use this in a safe and useful set of conditions. So we asked that CB5 ask the DOT to reconsider this plan. Thank you. Thank you. Lisa. Is there anyone else from the public? I am not seeing anyone if you are an attendee and would like to speak. Please press the raise hand button at the middle of your screen. We have just a second vicki. Do you see Larry yeah, okay, Larry I think you can speak okay, thank you, Luke and thank you. Chairwoman, barbaro I was concerned that going through the neighborhood, I'm on 20th between 5th and 6th I, see lots of in-street operations under the open restaurant program, starting to enclose their spaces, and I'm concerned that such spaces, without proper ventilation and enclosed and with heaters in it, are actually more dangerous than being inside. I'm pleased to see that the New York Times Editorial Board wrote about the situation with open restaurants and to hear that other things are happening from the mayor's office, so I would thank the community board. My questions are simply: is the community board involved, who is collecting data on the program and when can some information be made available to the public on its success or its problems? Thank you very much. Thank you. Larry. Is there anyone else who would like to speak? I do not see anyone indicating that they would like to speak okay, so we will now move into our business session of the board where, as I mentioned earlier, only board members are allowed to speak. I always ask that, since we're now in virtual board meetings to please try to have your videos on during the meeting, however, for those who are using phones in particular and have to temporarily leave the meeting for any reason and I emphasize any like a call from nature. Please turn off your phone and video, especially if you plan to take it with you. We had a bit of a mishap last month, so enough said, except to remind you that when you return be sure to turn your phone on and your video back on and rejoin the meeting. I think you all get the picture, or maybe you do not get the picture. Hopefully we do not get the picture okay, so we are now in business session and I need a motion to accept the October minutes of the board so moved and a second right. Okay, roll call craig cales, yes, athanal, yes, behar Weichmann Buzz. He was there: okay, we'll come back Brosnahan! Sorry, yes, okay, thanks I thought. I saw you brosnahan. Yes burton yes, Gefaro, yes, Chu! Yes, Clark! Yes, Dale! Yes, docent! Yes, board! Yes, Brewer! Yes, Garcia! Yes, Goldman! Yes, gosh! Now! Yes, us! Yes, Harris! Yes, Heyer! Yes, Isaacs! Yes, Johnson! Yes, kayback! Yes, valkorsky! Yes, kinsella! Yes, mafia! Yes, Mccall! Yes, Myerson, yes, miller! Yes, Pawson, yes, Raybar! Yes, shapiro I saw todd before okay shapiro, okay, Slutskin, yes, Smith! Yes, spandorff! Yes, stern! Yes, song! Yes, Shinko! Yes, verdi! Yes, webb! Yes, wine, trout, yes, waylon! Yes, Yang! Yes, todd I, see that you're unmuted, oh okay, either way motion passes. Okay. Thank you got todd on that. I did not hear him as he's todd. Can you is he there? Otherwise he'll be present apart? Yes, I'm here all right thumbs up. So that's a good yes, okay, good. Okay, that moves us into our committee reports, starting with landmarks, layla, hi good evening. Everyone we had one application this month. It is for the brill building, which is located at 1619 broadway at the corner of 49th street in Times Square, and this was an application for a new signage. So a little bit of history. If you look at your result package on page four, you will see that the building actually submitted a master plan that was approved by the Landmarks Preservation Commission, and this master plan is actually still in the process of you know being completed, and in this particular instance, the applicant is proposing to replace sign h of the existing master plan with a bracket sign. So a bracket sign is you know, as you know, it's a sign that basically anchors into the facade and has a a perpendicular face to to the facade. If you look at the reso package on the following page on page five, you will see a rendering of this. This blade sign the applicant is a TD bank and they are proposing a illuminated sign that would be in lieu of this previously approved sign age. The committee had no objection felt that the blade sign is appropriate for the building the size is appropriate. We had no issue with the interior illumination, it is in times Square, and it is you know, an illuminated sign is contextual. What we felt, though, was that it would be preferable, rather than simply approving this sign to which we do not object to actually fold it into the existing master plan, so that sign h that was previously approved would be replaced with this blade sign. The committee felt that it was the proper way to go. We had concerns about the way the blade sign is going to be anchored into the building, and we want to make sure that it will not cause any punctures through the terracotta that is covering the facade. The applicant also presented some door pulls that are going to be installed on the the the brass doors of the entrance to to the bank, and we felt that those were actually non-contextual, so we basically phrased our conditional approval and the conditions being that we want beside approved as part of an altered master plan. We want the anchoring to be mindful and non intrusive to the the facade, the historic material, especially the terracotta, and we want the the door pulls the existing door bolts to actually be stored so that they can be reinstalled when and if TD bank leaves the other premises, because we want to get the attention of LPC, we phrased our resolve as a denial unless those conditions are met. This is you know the semantics that the board uses with pretty much all of our agencies, so that our message is loud and clear. We know from experience that if we issue a conditional approval, it is very often read as an approval and our conditions are lost and the vote was unanimous. Okay, thank you. Layla. Does anyone have a conflict regarding this resolution? If you do raise your hand, okay, are there any questions? Are there any comments? Okay, seeing none. We will take this to a vote. Kayla's, yes, athanal. Yes, Behar, Bayer, zach, yes, okay, bitesman, yes, Rosnahan! Yes, burton yes, geffaro! Yes, true, yes, Goldman, yes, Gosham! Yes, Haas Harris, yes, higher! Yes, Isaac Johnson, yes, kbac! Yes, Kalafarsky, yes, Kang! I'm sorry she's, not here Kinsella, yes, Lagusico, yes, leaving. Yes, Lucy, yes, Mafia, yes, Mccall! Yes, Myerson, yes, miller! Yes, Pawson! Yes, Raybar! Yes, shapiro! Yes, Slutskin! Yes, Smith! Yes, spandorff, yes, stern! Yes, shinko! Yes, verdi! Yes, webb! Yes, weintraub! Yes, waylon! Yes, Yang yank, yes passes! Okay, you could call Webb, I'm sorry! I did not hear that webb. Yes, what was he? Yes, he did. Okay, that takes us now to land use, housing and zoning layla. Also okay, so we had two options for the land use, housing and Zoning Committee. The first one is an application, it's an application to the board of standards and appeals, and it was filed by h hotel for the renewal of a building permit at 58-60, West 39th street. So a little bit of background on this application, the the site is located, is in an M1 district. M1 District means that it is a manufacturing zoning as such before December 20th 2018 and a hotel was permissible. As of right. The Department of City planning introduced an amendment that would render a hotel use no longer conforming and would require a special permit. This amendment was introduced in April of 2018, and it was voted by the city Council in October, and it was promulgated in on December 20 2018. this particular site is, was purchased by a hotel developer in 2016. They sat and did not do anything for quite a while and then in July of 2018. They filed a DOB permit to build a hotel and the the permit was actually issued in so I'm sorry, they filed in April and the permit was issued in July the so they went on and started demolition of the building. That was on the on the sides and excavation. What happens when a an amendment comes into effect is that it basically voids any building permit, for which the use is no longer conforming so because the hotel use was no longer conforming automatically. The building permit was cancelled and the applicant is filing an appeal to the board of Standard and appeal to basically renew this permit and they're doing it. Pursuant to common law and the common law of New York says that if a owner has a vested interest, meaning that they have spent a lot of money and with this new zoning, it would render them that their investment useless and they can claim hardship and the BSA has the ability to renew this building permit for a use that is no longer conforming. So that's the background the applicant presented their you know made their case. They presented evidence that suggests that indeed, the demolition was 100 complete at the time of the the amendment coming into effect. It seems that the excavation was also one hundred percent complete, where the committee felt that we're not convinced is that the foundations we can not tell to which extent the foundations had been had been poured. We there was no photographic evidence, which is something fairly typical of these kinds of applications. We reviewed actually an exact same application in 2019. It's actually on the adjacent lot on the same block, a couple of buildings to the east and the applicant had a very thorough documentation with photographs really establishing where they were. You know sort of snapshot on December 20th 2018 when their permit lapsed. In that particular case, we did not have that the applicant did not have any photographic evidence they provided logs for concrete poor, which you know established that they had started from the foundation, but they were nowhere near complete, and so we had some question on that, but furthermore we felt that this proposed hotel is problematic. This amendment that was introduced by the Department of City planning that CB5 wholeheartedly supported, is exactly the reason why this amendment was introduced was exactly to deal with these kinds of hotel proliferation. There are already four hotels on this block, which is I mean just for one block, and you know when, on a 400 foot radius, the proliferation is simply, you know even more substantial. The committee felt in that you know. Overall, the timeline was also problematic. You know the fact that we have to deal with this particular appeal in 2020, when the permit lapsed in 2018 was also something problematic. We also had some issues with the the proposed design of the building. That would be a 34-storey building that would cantilever 25 feet above its neighbor to the west. You can see actually in your package on page a rendering of of the hotel. Very uncontextual would really you know not fit with you know the rest of the streetscape would be. You know, destruction to the streetscape and for all these reasons we voted unanimously to deny the application. Okay, are you going to bundle this, or is this going to be separate? I, yes, I can I can bundle, I can bundle okay. If anyone wants to vote differently, they can say so when we do the roll call yeah. If anyone has any conflict with this resolution, please raise your hand. I do not see anyone any questions to the resolution. Please raise your hand. Are there any comments? Okay, seeing none, we will move to the next resolution. Okay, great. So the next resolution was actually a started as a discussion item and we felt it was actually important that we that we take a position. So it's a statement of principle on design and reconstruction of the Park Avenue malls. As you know, the- and we have learned through the MTA- that the train shed that is located under you know, partially under the Park Avenue Malls, is in a state of grave disrepair. The MTA has announced that you know in the course of the next 20 to 30 years, which may you know in empty a time it may mean 50 years, but in any case in you know the future, the the repairs are going to have to be made and in order to do the repairs they're going to have to rip the the Park Avenue malls from 50 from 46 to 57 streets. As you know also recently, this part of Midtown was rezoned and you know part of the east Midtown Zoning and, as part of this rezoning, there's a mechanism to actually raise funds when air rights are transferred from a landmark into a development site, and these funds are dedicated to actually improve the public realm. So we felt that you know going forward, given that it's going to be a big topic, for you know the years and the decades to come. It is important that we do support. You know a reconstruction and design of the Park Avenue Malls in a way that is creative, and that is forward-thinking, and that is you know not just your standard. You know, let's slap, some asphalt and you know, put a couple of trees. So basically, this resolution states that basically community board five supports a you know. More creative design urges the various agencies whether it is D.O.T MTA. The design commission to actually you know, hire a team of independent designers, architects, urban designers, urban planners and with the goal of really activating the moles. As you see in this little historic photograph. This is how the moles looked like in the early 20th century. It was open to the public, it was a recreational area and it was actually larger than what it is today. What is important to note is that Jpmorgan Chase Headquarters are located on Park, Avenue and 47Th street as part of the reconstruction of their headquarters. They are going to undertake the restoration of the train shed as such. They are going to rip off the the malls in front of their building and they're, going to actually enlarge the malls or there are talks and considerations about enlarging the malls, which you know, we also think, is a good idea. So all of this resolution is really a statement of principle saying that you know the mall should be redesigned in a way. That is a thoughtful forward. Thinking that you know creates a a world-class open space that it is activated open to the public, there's a dire need for open space, and you know I want to say that you know going forward we're going to share the custody of of this. This advocacy with the Parks Committee and the transportation and Environment Committee. You know that this is going to keep us busy, but we felt it was important that we're on record saying this is the kind of vision we want for for the malls great thanks very important. If anyone has a conflict, kindly raise your hand, I do not see any. Are there any questions to this resolution? Clayton. Thank you. Thank you. Layla I was present for this committee. Deliberation and wholeheartedly agree with the position the committee took and I'm excited about this public conversation process happening. The one question that I have would be if you would be open to a friendly amendment on line 210 specifically. The word activation is a word that I do not want to risk anything being misconstrued. The Parks Committee members and some full board members might be used to how allergic we are to that word because we mean something different than others might and historically, that word has been hijacked by commercial event. Operators and permit application holders and activation means a food kiosk or a samsung product launch. So, in order to be as clear as possible, I'm wondering if you'd be open to not using the word activation, but simply to say, as you said, Community Board five is committed to being part of the Park Avenue Mall's redesign and the public process regarding their use or something along those lines. So it's a little more specific and does not risk misrepresenting our position. Yes, point very well taken. We did discuss that at committee. I want to find a way to say that you know we want it to be reopened to the public. We do not want something that is just you know pretty and cute and looks good, and you know we slap a couple of statues. You know twice a year and we you know call it hooray. I, think that it is important that some of them, not necessarily all of them, actually need to receive the same treatment, but some of them should become open to the public, should become recreational areas, so maybe there's a term that is not activation because I agree with you know activation in the mind of you know our city officials. It means commercial events and we do not want that, but maybe there's an another way of saying that you know we want humans to be able to use the space so that you know this intention is expressed in this resolution. Would that be? Okay with you sure, I think anything along the lines of opening for public use as long as you're talking about the public using it, then it's clear? Okay, so maybe you and I can you know like figure out some language now off via email, and then we can send this language for it for the result to be sure amended, but yeah friendly totally. Thank you. Okay, great thanks, Clayton, any other comments. Simon yeah, I'm not really sure I understand what would be the point of not allowing perhaps an appropriate commercial use. I mean if there's some way to occasionally monetize the space then does not new York City need that money. We are in comments, but Clayton do you want to answer it and then we really should stay with comments and I. Think maybe this conversation would be a good one to have at the Parks Department Committee to explain further the problems that have occurred along the way right, Clayton sure I mean really quickly, because we do not need to go into deep dive on this right now. But, generally speaking, over the course of years, we have seen that the city abhors a vacuum of unactivated public space, and so if there is no restriction and if there is no regulation- or at least not a public conversation about how that process occurs, then we end up. You know fighting corporate events and pedestrian plazas and all the things that have happened over the last 12 years, so I do not think. The argument is that this resolution specifically should say no commercial events, which is not what I suggested in my prior comment or the friendly amendment either, but simply that, like all of our public spaces, that process also be accountable to community boards and to the public so that we understand what is going on and how those things would be approved. We never had a say with that with the pedestrian plazas and that caused a decade of strife. So I just want to be careful about how we word things now, but that's not to say that we are right now taking a position about any particular use. That's why I wanted the language to be as kind of not encouraging. Not encouraging correct okay, great okay, Mary! Do you have a comment? Yeah I just wanted to flag for folks that at least from 14th street, the beginning of Park Avenue South well into the 80s there's no existing bike lanes and on Park Avenue and just either driving or myself on a bike. It's very perilous and so I hope that, as the process unfolds, the lack of existing bike lane on such a major thoroughfare could be put into the mix. Just for clarification, the the train shed is located between 46 and 57, so the work that we will be undertaken by the MTA is, you know restricted to this. To this area now understood I just thought, as the picture shows it's more. You know a nice rendering of what was with people being able to use the median there. I do not know how realistic that is now, since it's basically a traffic way, so I do not know if any of this could be used and also extended to help the bike passengers. It's just a just a thought. Okay, thank you. Okay, thanks Mary. Anyone else with a comment seeing none. We will take these two resolutions to a vote yang. Yes, waylon. Yes, wine trap; yes, webb, yes, birdie, yes, bingo! Yes, soon, yes, stern, spence, yes, Andorff! Yes, Matt! Yes, shapiro! Yes, Rebar! Yes, Boston! Yes, Myerson! Yes, Mccall, yes, mafia, yes, lucic! Yes, leaving leave me Sam! Okay, Logaseco! Yes, Kinsella! Yes, Kolaforsky! Yes, payback! Yes, Jonathan! Yes, Isaacs! Yes, higher! Yes, harris! Yes, Us Haas! Yes, not sure! Yes, Goldman! Yes, Garcia! Yes, Brewer! Yes, award! Yes, docent! Yes, Dale! Yes! Mark! Yes! Thank you! Yes burton yes, Brosnahan! Yes, heichmann! Yes, behar! Yes, ethanol, yes, Michaelis, yes and I. Just want to check Sam Levy did you vote? Are you there? I did I do not know what the problem is with the sound. But yes, I got you now. Motion passes, okay motion passes and we are on to budget education and city services. Renee. Thank you. Becky. We have two items from Beck's. First is a report on voting and elections, and the second is an action item on the budget. I'll start with the report. First and I'd like to thank Rachel Weintraub, she organized it has been following the board of elections and voting as an issue for the committee. At the meeting we heard from Justin Flagg from Senator Kruger's office, Kate Theobald from Councilmember power's office, laurie from the speaker's office and what they did is they briefed us on bills that have recently passed and affect elections and voting, and these are early voting, which we saw this year, the consolidation of federal and state primaries, which is going to save us time and money, the transfer of voter registration, which is streamlined now for people who move within the state of New, York and pre-registration for 16 and 17 year olds. So that's legislation, that's already out there and that's we're going seeing and are going to see. We also learned that there are two bills that were passed last year, that are constitutional amendments, so they need to pass into successive legislatures and then be voted on by referendum and those two issues are the same day: voter registrations, meaning you can vote register and vote on the same day and number two is no excuse absentee voting. Currently, we, you know, we were given the opportunity to exercise absentee voting using Covid-19 as a rationale, but this would allow no excuse absentee voting. You do not need a reason you can just ask for the absentee vote both require a constitutional amendment. So I said, as I said. So this is something that we're going to follow in order to talk about within the committee and perhaps support other issues that came up. We learned that more pull sites are needed and Senator Krugel is carrying a bill that we're going to look at, and it prohibits the use of schools for early voting, but also mandates that building that use state tax exemptions that are owned by an entity that gets more than a million dollars in state grant. Funding can be required to be used that building as an early voting site unless the owner can demonstrate hardship. Think about things like large cultural institutions like museums, like the met and then looking at the board of elections itself, there's a move to professionalize the board of elections, so that's currently staffed by patronage by the political parties. But you know everybody knows it's really becoming increasingly complex and important, so it really needs to be professionalized. It involves both the city and the state, because part of the makeup of the Board of Education is the New York State Constitution. So it may require an amendment. But this there is a bill that exists by Senator Kruger, that delineates the power of the executive director and the deputy director, and this would sort of lay out who's responsible for date of date, operations to create some more accountability. Ultimately, the state and city will have to come together on this, but this is again something that our committee will follow and look to support or have a view on. We also heard about council member powers, pre-considered resolution in support of the state bill to establish absentee drop-off ballot locations and then two more important city council items that we're following one is the voting Rights advancement bill, which would require federal oversight for states with a proven history of voter suppression, and it would protect all the eligible citizens constitutional right to vote, and then an oversight hearing was held on the election administration during Covid-19 and that the purpose of that was to lay out the challenges and plans for problems with absentee votes and ranked choice, voting which is going to come up and we're going to see it. So local changes that actually occurred out of that include the reactivation of the board of elections. Online application, Portal and the board of elections also launched an absentee ballot tracking system and designated some early voting sites. That hearing testimony is available on the council's website. If anybody here wants to hear about it, so we're going to continue to follow all these issues as I said big. Thank you to Rachel and we'll continue to work on those and then the second item is the budget report, but I do not know if anybody has any questions or do we want to stop there should I go right into budget, go right into budget. The other report and I'll just say thank you to Rachel as well. The second item we have is an is an action item and it's the adoption of our budget items which are made up of four budget documents. The district needs statement, the most pressing issue survey for each of the silo areas, the expense budget requests and the capital budget requests may I deem them red. Yes, may I bundle them I, think they're, bundled yeah as a okay right. Thank you. So the first that you have in front of you is the district needs statement and I want to thank Chuck and Joseph. They did a lot of drafting for this document. You see, there's a big emphasis on addressing the needs of the increased homelessness that we're seeing in the district there's. Obviously, the quality of life concerns the economic recovery and the needs around that. The need for sanitation- you know you all know. The department of sanitation's budget has been cut. Composting. Electronic recycling is needed, access to ipads and computers and Wi-fi for all of the students in the district that are learning remotely the need, obviously, for the enforcement of violations. Something we've been calling about out for forever anything from illegal vending to biking infractions and just to be clear. We're not asking for the NYPD to handle all the enforcement in these different areas, but are just asking that certain enforcement be transferred to other agencies in some instances we'll get to that. Affordable housing has always been an issue in the district, and that is addressed in our district needs statement, as well as traffic and safe public transportation, and we also highlight the need for a director of the public realm to make sense of how the public space is utilized and how our lightener can be protected, valued and considered when making decisions regarding our lightning and all the public spaces. I think all of the committees pretty much heard about create the creation of that office and then I do not know. If you want me to stop there for questions about the district statement or just keep on going through, maybe go through it and then we'll take all questions. Okay, second, you're going to look at the most pressing needs survey and that's a live document. So you're going to see it separate in your packet, you have a blank copy and then you also have the item that we checked and the language that goes underneath so you'll see that in each silo we had the opportunity to choose from a list of provided items about our most pressing needs. Not surprisingly, the three most pressing in the district have been identified as economic development, recovery, homelessness and quality of life issues that includes Noise Graffiti Petty crime. Those were chosen based upon the issues that have been raised most frequently. We look at what came into the board office as well as the 311 complaints and input from our own committee members, as they have been researching all these areas in the health care and human services silo. The services to prevent homelessness is number one in youth, education and child welfare. Remote learning and technology is currently the most important issue, particularly given so many kids are studying from home in public safety and emergency services, public nuisance, which encompasses noise and other sort of disturbances. It's been for years, based on our 311 calls the number one and core infrastructure and city services and resilience noise pollution again is number one and then in housing, economic and land use, small business services and support this year is number one. The economic recovery, particularly we have broadway you'll, see that we reference that small businesses have always been a concern in the district, but the pandemic has really heightened this particular need in transportation and mobility. Traffic safety and enforcement is number one, as per our transportation committee, with the caveat that they and we would like to see the enforcement shifted, so it becomes the work of DOT and not necessarily the NYPD and in parts cultural and other community facilities. We ranked we went off, we went off the the choices and we rank creation of the office of the public realm, along with appropriate staffing, is number one. I'm sure that you recall that at land use it was heard in parks and transportation. Everyone had heard and supported the creation of this office. So it's something our board cares deeply about. The pandemic obviously really impacted the selections this year, and so I will go into that the expense and the capital budgets themselves. These are requests, I won't read through them, one by one. You have them there, but you can see that they reflect the requests that support all of the needs. I just discussed I will say that, while the requests have been put in priority order, there's no clear formula of how to do that, and it really has not been the case that our number one item gets funded. One number two and number three do not. Instead, we've seen that the budget request much further down the list can get funded well before our top items and you're also going to see that some items have carried from year to year to year and that's true of almost all community boards. They keep the requests on there in the hope they eventually do get funded. You have the express expense request list, we're permitted to make 25 requests capital list, we're permitted to make 40. I'll just say as well. We do not have 40 requests and that's simply because we get a lot more expense requests than capital, and but we expect we're really grateful to marisa she's, going to help us strengthen relationships with our schools, because we should get a lot of capital going forward from our schools. Evan did the job this year of outreach to those in the district that you'll see on the list. We voted in favor of these budget requests unanimously incredible job. Thank you. Thank you to the committee. Does anyone have a conflict with the budget, information and requests and the district needs statement? I do not see any. Does anyone have a question hi vicki I do I, do not know if you see that I raised my hand in the chat, I'm sorry who's that will hire okay, well, I actually have a few, and one of them is a request for a friendly amendment. Is that this the appropriate time for that or no sure, I'm just looking at lines 431 in the document and noting renee what you were saying about enforcement of quality of life violations, and that is one of the biggest concerns in the district I would suggest that. Maybe we look at an all-of-the-above solution for enforcement right now, it says CB5 needs enforcement of quality of life violations. It does not believe that such enforcement lies with the NYPD I would suggest we insert the word solely with the NYPD, because I do believe that the NYPD does have a role to play, just as some of the other solutions like the D.O.T and cahoots certainly do as well and I know. There are many other programs in the city, so I do not know if you consider that friendly or not but okay. Thank you. Sorry Vicky tonight did I over speak. I'd, like clarification again, will you're asking to change line. 431 yeah I'd like to add the word solely on line 432 solely with the NYPD right, because it you have to read the whole sentence for the context. Not salty. Are you? Okay? With that is everyone, okay, with that. Actually I do see a raised hand by Mary. I do not know why I'm not getting them! I'm not getting raised hands. Oh wait! I do Mary, yeah I just wanted to second. What will said and renee. You recall my what I said during the committee meeting so I think that's an excellent addition. Okay, any other questions. I did have one or two other questions. If that's all right, okay go ahead, will and then we have Chris Clark. Okay, I'm just looking at line 520 in reference to the and I'll go two questions into one. One is in reference to the Bellevue Intake Center physical plant, which I believe is on First Avenue, ish close to the East River and then another question online 538. With regard to the Bleeker school site in Greenwich village, I'm curious. Why we're commenting on those sites because I feel like they're, not within the bounds of our district? I'm sure there's a reason I just like to understand it. Sure thanks for asking so the Bellevue intake site is the sole intake for if you're looking for shelter. That's where you go throughout the entire city and so all of the homeless. All the people seeking shelter who are homeless would go to that intake center and we have heard that people do not like the physical plant. The physical plant is unappealing, it's unwelcoming, and so we want people to go there. We want people to seek shelter there, so that's, of course, I was just curious about why geography. It was a geographic question yeah, and so that's why it's? You know it serves the people, the homeless, who are in our district as well. That would be their first point of contact in their way and in terms of the Bleaker Leaker Street School. The committee bex had a resolution in favor of this school. This school would be where the I believe it's Morton, Williams, there's a supermarket next to Nyu and the school would serve children on the autism spectrum. Primarily it would mimic the teacher the way the teachers work in places like the Churchill School, and so instead of having an iep in your school. If you have those issues, it would be a city-wide school for children who have those issues. It's a it's a great opportunity because Nyu gave that site in exchange for some variances and it's going to sunset soon and it's really difficult to try and locate schools. This would be the first of its kind serving children and there's a great need for this type of school. Not everyone is able to transfer or get gets approved, to go to specialized schools like the Churchill school. So this would just expand the seats and it would serve people in our district as well. Okay, great thank you. So much for clarifying is that it will. That's it yep. Sorry, okay, I do not mean to take so much time. No, that's! Okay! Chris Hey! Can you hear me? Yes, wonderful I just wanted to respond directly. If this is the appropriate time to the proposed amendment to line 432 vicky. Is that all right sure so I would I would personally be more inclined to vote no on this package if the line were amen amended, as suggested I. Think that currently- and I'm sure this was the result of of compromise and a lot of give and take at the meeting and I- was not personally able to attend. So I'm taking that on faith and I believe that, as this is currently worded, it does do a pretty good job of balancing the concerns of people who are worried about quality of life issues with the concerns of those who see over policing as a really major stain on the city and something that directly impacts. Many new Yorkers and I personally am of the conviction that quality of life enforcement does not lie with the NYPD it. It's not a an issue of them being partnered with other services, but entirely excluded, and so I would I would. Personally if we were to change that line, I would be inclined to vote now. Okay, I think we're yeah we're in con questions, although I understand what you wanted to address Chris. Thank you. Any other questions. Are there any comments? Chris hi, sorry I was too slow with the raised hand for the questions. Is it all right if I rewind the clock and pretend that this is the question? Okay, great, so I remember. This was during the very long conversations that we had about police funding and the police budget. There was a discussion of the way that the board would handle the police budget discussions going forward. So I wanted to ask how this budget request process relates to that discussion because I'm looking through and it does address, moving responsibilities over to DOT, which I personally really appreciate and I- think that's a great thing to include, but in terms of a full-scale discussion of the NYPD budget, it seems that this is not the medium for that. So I'm just would like to clarify how this fits into that broader discussion right. So this process is a little bit separate from that. This is a mandated process where we make we have to set out our district needs statement our needs and then make those budget requests, so they're, very concrete and very specific, and so we pull those from requests that we see 311 or, for instance, Evan spoke to the schools to find out. You know what they need, so these are very sp, specific and limited requests and funding to fill those needs rather than broader policy sort of ideas. If that makes sense, that does make sense, I, suppose my question: is there a mechanism or a process that we've used in the past that we would anticipate? You know when it comes up again in 2020 or 2021, that being really the forum for continuing that discussion about NYPD funding, sure we're going to go through this whole process again and we're going to keep looking at it. So while we do not have a schedule specifically for that, the budget process is ongoing, I will send you everything that we do so that you can be on board and when that specific issue comes up again and as it weaves through all our other issues, you could be part of that discussion. Great. Thank you, yeah that definitely that directly addresses it and renee have already been very helpful in sending me resources and information. So thank you for that. Thank you. Okay, Clayton thanks I just had a question. I did not realize noticed this until tonight, but renee when it comes to the item of the Flatiron plaza reconstruction I am assuming that, since this is such a multi-year proposal that putting this in our budget request does not preclude our participation in the details of how that money would get spent I mean the thing that brings this up specifically, is that we had concerns about some design stuff. But, more importantly, we had some concerns that they were not including the amount of money that will be required to put mandatory bollards all over the place, and that was something that, as of yet as far as I know, D.O.T knows we were concerned about it and for a year there has been no further conversation or details or discussion about that, and that would be you know. That would be 14 million dollars alone. So I'm just curious. If, given that we're, we are on board with the budget request for capital expense for this. If we still can trust, that does not mean that we're just right now saying like yeah, do what you're going to do with this project. That's a good question clayton, because I was not aware that there was an additional need for the bollards. This is something that has been carried over. As you know, this is a long and we carry it over until it's comes to fruition. So I did not know that there was a change with that about bollards that the committee had. Maybe we could add language to the budget request. Is there a line that you could make a friendly amendment to? Well honestly, it's really just the price tag of the project. I'm just cure I, just I'm not I'm not up to date about if they have revised the budget for this project. Given that it's changed a lot over the years and the whole bollard thing happened and we never really got a response from DOT about that, and so I would be comfortable. I would just be comfortable if the price tag of the project reflects is accurate and whether or not that does include if they have determined that those bollards must be included, and if that is in the price tag, and if it's not just revise the numbers accordingly and cite the bollards so that it's clear in the language, that's all I would ask. Okay and I will say to you that this we spoke to the flat iron bit about this. Is you know about this project, and this is the new revised number, so this is it increases, but I do not know the specifics of the increase of that amount. Whether it includes bollards, specifically so I will check that and I will check the number. Thank you thank you. Okay, Tristan hi renee, so apologies first for missing the meeting. I had a conflict, so I could not really get my opinion on any of these and they all looked tremendous. So great job of the committee for coming up with all these I did have one proposed amendment or addition to the capital, expense requests and basically it's just adding a 30th item. Reading identification of potential opportunities to utilize carbon, concrete, open parenthesis, I.E concrete produced in part via carbon capture process, used close parenthesis in capital, construction projects and purchase of carbon concrete for use in such projects. So I will say we considered I know that you wrote to me about that. What you're suggesting, though, is an expense item, not a capital. The purchase of the concrete after the fact would be capital if it was used, and it was over a certain amount of money. But what you're asking for is the consideration right of that which would be studying that which would be flip to expense sure so maybe nix the study part of it then, and just move right to the purchase of it for my proposed edition, at least and then for use in capital construction projects, I love the idea I. Just it's not a I, do not know how to flesh that out in terms of a very specific project. I understand that you want to study that and that it and I think it's fantastic. I know that we spoke about it I think it's really a good idea. I just do not understand how that fits in very specifically to the budget without a specific budget item. You know what I mean if you said in the school that we're suggesting you know as a capital that we request that money for this concrete, then I get it as a capital, expense and I get it as a study as an expense item, but I'm having a little trouble right now. Thinking of how we could realistically do that within the confines of what we have to do here and I'm not mixing it I think it's a great idea. I just do not know how to I think it. We need to flush it out a little bit more okay, all right! We can table it. Okay, thanks tristan anyone else. All right see! No other comments. We will take this whoops Chris again yeah, I'm sorry, I forgot! Where the raised hand button was and was looking at participants for far too long. I had a note about I, think really just the friendly amendments and then potentially a less friendly amendment and I'm seeing in the chat that Gail is now here. So I'm totally fine to yield the floor over to her. If you want is gail. Yes, she is thank you for that. Gail Gail's fine, keep talking Chris, you're, doing great, I'm fine, okay, thanks again, I'll turn it over to you as quickly as possible. I'm fine! Okay! Go ahead thanks Vicky, so I'm looking at line 278 so starting on 277 CB5 also continues to seek the removal of old phone booths, Street encampments and the location of link kiosks where they are redundant, unnecessary or an attractive nuisance. I sort of assume that there's a little bit of phrasing ambiguity there I would assume that it would maybe clarify things if it were changed to the removal of old phone booths, Street encampments and link kiosks where they're redundant. So instead of removal of X Y and the location of link kiosks am I, am I sort of guessing at the original intent of that sentence correctly. So the original intent of the sentence was link yes, so in some cases we have link kiosk next to link kiosks. So you know on a corner and then right around the corner. There's another one and it tends some of them are attractive. We call it an attractive nuisance where they tend to attract a lot of people who are not using them necessarily for you know the reason they were meant to be used, so I guess yes, redundant unnecessary. We can scrap that, if that's what you're saying that you want to take out unnecessary. Oh no, I'm speaking specifically to the phrase the location of Kiosks right, so we're saying the location yeah. So we can take the location out. What we mean is link kiosks right have too many of them clustered together or where we've just seen incredible. They're just reading words and the location of it would be the removal of linked Kiosks, yeah, Chris, yeah, perfect, okay, great and renee, as you were saying that I understand the other way of reading that sentence. That makes it a lot less redundant. So I apologize for that, and then also this is what I do not think. It's actually a proposed amendment to the text, but I did want to flag just as a comment. There's a bit of language in this line and then later on in another discussion of homeless services regarding street encampments, I, I'm sort of self-conscious about getting on a soapbox about very minor things. And this is not going to sway me against voting for this resolution. But I do want to put on the record that there is not a consensus from homeless services that clearing street encampments actually does move. Anyone closer to the goal of getting homeless people in shelter or providing safe shelter for them out on the street. So I think that, as we engage with the homeless services throughout the city, that we really emphasize as much as possible, the creation of affordable housing, as well as the provision of services and limits and I, would personally argue for get rid of the clearing of street encampments as much as possible, because those that action does not actually correlate to folks getting the shelter and the services they need. Because if your street encampment is cleared out and you do not have a shelter to go to you're just going to set up an encampment somewhere else, so that's my comment on that. Thank you. Vicki. Do you want me to respond? I, really appreciate it. Chris and I think that's more of a comment. I do not think from if I'm correct, I think he was saying. Is that Right Chris that you I would be very interested to hear your response tonight? If you want sure so, I really appreciate your point of view and I think that many of our you know our top requests go to affordable housing, homelessness. You know supportive housing. All of those issues making sure that the you know even Bellevue, you know, are one of our capital requests that bellevue. You know the lockers are okay, that they I think a lot of our requests. Go to that I. Do I do understand what you're saying that when an encampment is cleared, it does not necessarily mean that person is getting the care that they knew and I appreciate it, and they should be getting that a lot of our requests. Go to that. Having said that, there are some that do find that encampments are difficult as they become bigger and bigger and bigger, and so it's a balancing act right. I appreciate you I appreciate your view, but I think and balance you kind of have to have both right. That balance is absolutely what I was sort of imagined was happening behind the scenes. That makes a lot of sense. Renee yeah I just wanted to sort of put that out there as an objection, because I do not want to vote no on the whole thing. I just wanted to sort of flag. That specifically, thank you. Okay, thanks Chris, okay, Gail! Do you want us to continue, or would you like to still I think you should vote or continue I do not want you to stop mid-stream on a discussion. Go ahead. Okay! Are there any other comments? I think we may have none I do not see any. Is there? Is everyone okay with this, and we can vote on it and then hear from our borough? President I do not see any other raised hands. Okay, seeing none. We will vote on this vote on this craig yep Michaelis. Yes, half a nail! Yes bihar! Yes, eichmann! Yes, Rosnahan! Yes burton! Yes! True! Yes, mark! Yes, Dale! Yes, docent! Yes, word! Yes, Brewer! Yes, Garcia! Yes, Goldman! Yes, Gosham! Yes, us! Yes, Harris! Yes, higher! Yes, Isaacs! Yes, Johnson! Yes, payback! Yes, Kalafarsky! Yes, ella! Yes, Mccall! Yes, Myerson! Yes, miller! Yes, Swanson! Yes, raybar! Yes, shapiro! Yes, lutzkin! Yes, Smith! Yes, Bandor! Yes, Stern! Yes, yep birdie! Yes, webb! Yes, wine, trout! Yes, leland! Yes! Yang! Yes, wait! Sorry, craig I do not think I voted. This is Jamie Kang! Oh you just joined. Did you just point? Okay, yeah I want to vote yesterday. Thank you. Okay. Thank you passes, okay, so the district needs statement and budget priorities passes unanimously and I just want to say. Thank you to this committee for increasing. You know a wonderful report and work. That's been done on this. Thank you so much all right and we have our borough president with us Gail. Thank you very much. Vicki and I'll be quick. I love that discussion with my favorite topic, the budget, just a couple things when Tristan was talking. It occurred to me how helpful his discussion was. No, it's not capital, but you know something because, unfortunately, for board, five you're, usually ahead of the curve on other topics and if I hear about green new deal one more time without specifics, I'm going to throw up so one of the issues, because you know it's very nice, three new deal, what the hell does that mean in New, York, City, I, remember, I, spent years getting buildings to go from six to four to two and then try to get the electrical and that's the frackies go on and on so I. Think. What it says to me is a discussion about what green means and this concrete issue might be part of it, just something to think about, because today I was in a commercial building, that's being built and they have a new I'm going to call it an hbac system. But it's not what it is. It's the first one in New, York, City, Gail Brewer, asked a stupid question. Like can you open the windows? Because you know that's my notion of care and the answer was no, because we have blah well I do not really know what blah is, but it sounded very impressive and it is the only one in New York City and it's the first one in New, York City and you know, probably we need other ones like it, but since I do not know what it is, what I'm saying is what is green new deal for New York City, something to think about because it's what we want, but I've never heard specifics. So tristan. You got something to add to that list. So congratulations I, hope. So just a couple of things. We are writing a letter to the board of elections. They did a great job on the day of you know that there were long lines. I do not know if there were schools early voting in Europe, Community, Board and board five, but I think there were, and the issue is what I'm trying to say is: we've got to get away from these schools, so on the east side in general and Midtown was very light on places to vote in terms of early voting. People were complaining constantly, so I do not know something to think about. We have until next June, but just so you know, we've got to get away from these schools and there is a hearing coming up, I think on December 9th to talk generally about how the it's with the campaign finance board, how it went, but I think the fact that you might think about that issue would be helpful as well as topics that you might want to bring up as a community board. The second issue, of course, is we are working just in terms of topics. November 23rd it's right before thanksgiving on the Monday before we're doing it tenant virtual at six o'clock. You know the January 21 is coming around very quickly and at that point will be the end unless the governor extends it of the moratorium and there'll be lots of discussion about how to deal with tenant issues. I just want to mention. Also. You know this is the helicopter noise I do not know this mostly New Jersey. You may or may not get complaints, money board, four for any board. Seven! Oh my Goodness Education board, one endless complaints, I think there are 50 airports in New, Jersey I do not know how many of them are flying helicopters into New, York City, but we are totally in contact with those elected officials. Congressman Naga has been helping us and I believe that downtown heliport is the only one in New York City they're, not flying a lot of tourism, but there is something going on, because I can't deal with any more complaints. So just so you know we're trying to get that figured out we're also, you know very focused on it's mostly uptown. It's in northern Manhattan, where the percentage of tobit is rising very quickly, so I'm not saying it's in lower Manhattan, but we are going to get testing. The testing folks are in staten, island, Brooklyn and Queens, as you can imagine, so it's hard to get them back in Manhattan, but we have to at least in northern Manhattan and I just hope. You'll keep us up to date. If there is something that you think is needed, the tech devices and the schools of the ongoing discussion, the daily news has been running stories with our budget director. We, as you probably heard, had some money allocated a lot last year, Fy20 and the DOE and OMB would not let us spend it until like a month ago. So now we're trying to catch up with the hello with 15 million dollars there for technology and we were not able to spend it and this one's needed so we're working night and day with all the principals and the superintendents to try to get the remote learning needs of children, not just in temporary housing but in general and I want to thank you for again being the leader as I said, I know, you're talking about this issue of public space, public realm, director, etc. It has caught fire in terms of other community boards and the bids and Tim tompkins who's. Your best buddy I heard he's leaving at the end of the year. I do not know how we're going to live without his creativity, but anyway, that issue is something that your input would be very helpful. I think there's about 20 agencies. That's what I count, those that have public realm public street, something in their portfolio and I, do not think they talk too much. We get a lot of complaints, maybe not on board five about early childhood education slots going to other boroughs. You know the you know. This is the gentrification problem. You could be near low-income families, you can be in developments and then all of a sudden, particularly in Chinatown they're, really hurt no more slots. You simply just do not have head start. You do not have early childhood education and you I mean you can say: oh I can go to pre-k. Well, that's great, except there's, no after school. That goes with that and that screws everybody who's working. So we're working to try to change that for the borough of Manhattan I mean, though that's housing, which is your number one priority is ours. The only silver lining to any of this might be that there are hotels for sale. We are calling every hotel in the borough Manhattan literally every bid. That knows our hotel is and saying are you empty? Are you vacant? Are you available? Would you want to be for sale to see if we can find those that would, in fact could be run by very credible non-profits? It's always controversial nothing's, not controversial in this city, but I do think that would be a small silver lining in this God-awful pandemic. So, thank you very much for all of your resources and again, if there is, you know, today's papers are full of Brooklyn is expensive and Manhattan is not well. I do not know what they're smoking, because Manhattan is still expensive, but I was glad to see. Brooklyn is expensive. You do not know how happy that made me, but I will say that it is. You know if we have a silver lining and there is some property that could be used for quality, affordable housing. I'm a big believer. If you have a building, it should not be 100 homeless in terms of supportive housing or permanent housing. It should be a mixture. There are plenty of low-income new yorkers who need housing, it should be a mixture and that's what I would love to see in our city. Thank you very much for everything. Thank you, vicky. Okay, thank you. Gail very nice way for us to conclude our November meeting of the full board. So without further ado, I will adjourn this meeting and see you all next month and at committee meetings thanks again Gail. Thank you thanks Kim. Thank you thanks. Everyone.",
            "summary": "The chairs, report, the committee reports, the resolutions, questions and comments and voting questions and comments from either applicants or the public or if additional information is needed, are allowed.\nThe council's committee on hospitals is really focused on the rise of Covid-19 cases in New York City.\nYou know usually hospitalizations usually lag by about two weeks when you see a spike, so we'll be certainly monitoring that in the coming weeks, but right now we're still seeing pretty stable hospitalization rates in New York City.\nYou know we got a lot of questions about absentee ballots and pulse sites.\nAnd I just want to thank Community Board five's committee on budget education and city services.\nMatters got an opportunity to talk about councilmember powers bill to support installing absentee ballot, drop-off boxes in New, York City.\nWe know there were big problems, of course, with the board of Elections Administration of the election, we're holding a round table in December on a bill that Senator Kruger carries to professionalize the board of elections in the city.\nGreat first I, want to thank CB5 for working with our office on issues regarding 23rd, 24th and 25Th street Sixth.\nFirst, the comptroller sent a letter to the mayor and Chancellor Kuranza, urging the city to act immediately to close the digital divide, which we know leaves over a hundred thousand students each day without internet.\nSo second, the comptroller authored a op-ed with advocates for children, focusing on supporting the needs of over the 13,000 students living in family shelters in our city.\nThis week, comptroller's trainer renewed us called the restart New York City's lagging capital program.\nWe think that our infrastructure needs are so significant and so ongoing that we should continue spending on our capital budget to make sure we're making investments for our future.\nThanks the census ended and though we will not know what happens in regards to accuracy and the time it gets to the data end for a little bit.\nWe do know that New York City did pretty well given the circumstances and that the Census Bureau says that they are confident they were able to enumerate almost all of the households.\nShe called on the usgs director James Riley, to be removed after an inspector general investigation determined that he retaliated against a whistleblower she's, seeking information on the administration's efforts to withhold federal funds from cities deemed anarchisture additions jurisdictions and this week in light of the transition issues mentioned earlier, the congresswoman joined other House Committee chairs and sending dozens of letters directing White, House and federal agencies to preserve documents in accordance with the law.\nI, think that is it on the representatives of the electeds, correct, I, believe so, yes, okay, that moves us into hearing from anyone from the public for two minutes.\nSometimes people like Harvey Weinstein, who have been trying to silence speech by passing by introducing lawsuits, often in the area of defamation, and our new bill is going to make it harder for those lawsuits to move forward.\nThis new bill will prevent those lien sales from going forward and and protect a lot of personal possessions that are, you know up in the air as a lot of new yorkers are trying to get back up on their feet and get employed.\nThe new building is going on an empty lot on 28th street, it's in the college's footprint and that's where our main loading dock and sanitation, pickup area, is.\nI'm pleased to see that the New York Times Editorial Board wrote about the situation with open restaurants and to hear that other things are happening from the mayor's office.\nWe had concerns about the way the blade sign is going to be anchored into the building, and we want to make sure that it will not cause any punctures through the terracotta that is covering the facade.\nIt's an application to the board of standards and appeals, and it was filed by h hotel for the renewal of a building permit at 58-60, West 39th street.\nThe Department of City planning introduced an amendment that would render a hotel use no longer conforming and would require a special permit.\nPursuant to common law and the common law of New York says that if a owner has a vested interest, meaning that they have spent a lot of money and with this new zoning, it would render them that their investment useless and they can claim hardship and the BSA has the ability to renew this building permit for a use that is no longer conforming.\nWe have learned through the MTA- that the train shed that is located under you, know, partially under the Park Avenue Malls, is in a state of grave disrepair.\nYou know that this is going to keep us busy, but we felt it was important that we're on record saying this is the kind of vision we want for for the malls.\nIn order to be as clear as possible, I'm wondering if you'd be open to not using the word activation, but simply to say, as you said, Community Board, five is committed to being part of the Park Avenue Mall's redesign and the public process regarding their use or something along.\nI, think that it is important that some of them, not necessarily all of them, actually need to receive the same treatment, but some of them should become open to the public, should become recreational areas.\nMaybe there's an another way of saying that you know we want humans to be able to use the space so that you know this intention is expressed in this resolution.\nYou sure, I, think anything along the lines of opening for public use.\nOkay, so maybe you and I can you know, like figure out some language now off via email, and then we can send this language for it, for the result to be sure, amended.\nI mean if there's some way to occasionally monetize the space then does not new York City need that money.\nYou, know fighting corporate events and pedestrian plazas and all the things that have happened over the last 12 years, so I do not think.\nThe argument is that this resolution specifically should say no commercial events, which is not what I suggested in my prior comment or the friendly amendment either, but simply that, like all of our public spaces.\nIt has been following the board of elections and voting as an issue for the committee.\nThey did is they briefed us on bills that have recently passed and affect elections and voting, and these are early voting, which we saw this year, the consolidation of federal and state primaries, which is going to save us time and money, the transfer of voter registration, which is streamlined now for people who move within the state of New, York and pre-registration for 16 and 17 year.\nWe also learned that there are two bills that were passed last year, that are constitutional amendments, so they need to pass into successive legislatures and then be voted on by referendum, and those two issues are the same: day: voter, registrations, meaning you can vote register and vote on the same day and number two is no excuse.\nThis is something that we're going to follow in order to talk about within the committee and perhaps support other issues that came up.\nWe learned that more pull sites are needed and Senator Krugel is carrying a bill that we're going to look at, and it prohibits the use of schools for early voting, but also mandates that building that use state tax exemptions that are owned by an entity that gets more than a million dollars in state grant.\nIt involves both the city and the state, because part of the makeup of the Board of Education is the New York State Constitution.\nThe state and city will have to come together on this, but this is again something that our committee will follow and look to support or have a view.\nWe also heard about council member powers, pre-considered resolution in support of the state bill to establish absentee drop-off ballot locations and then two more important city council items that we're following one is the voting Rights advancement bill, which would require federal oversight for states with a proven history of voter suppression, and it would protect all the eligible citizens constitutional right to vote, and then an oversight hearing was held on the election administration during Covid-19 and that the purpose of that was to lay out the challenges and plans for problems with absentee votes and ranked choice, voting, which is going to come.\nThe second item is the budget report, but I do not know.\nThe district needs statement, the most pressing issue survey for each of the silo areas, the expense budget requests and the capital budget requests may I deem them red.\nOkay, second, you're, going to look at the most pressing needs survey and that's a live.\nAnyone have a conflict with the budget, information and requests and the district needs.\nSo I wanted to ask how this budget request process relates to that discussion because I'm looking through and it does address, moving responsibilities over to DOT, which I personally really appreciate and I- think that's a great thing to include.\nYou know when it comes up again in 2020 or 2021, that being really the forum for continuing that discussion about NYPD funding, sure we're going to go through this whole process again and we're going to keep looking at it.\nGiven that we're, we are on board with the budget request for capital expense for this.\nSo great job of the committee for coming up with all these I did have one proposed amendment or addition to the capital, expense requests and basically it's just adding a 30th item.\nIf you said in the school that we're suggesting you know as a capital that we request that money for this concrete, then I get it as a capital, expense, and.\nThink that many of our you know our top requests go to affordable, housing, homelessness.\nYou know the lockers are okay, that they I think a lot of our requests.\nThank you passes, okay, so the district needs statement and budget priorities passes.\nIf I hear about green new deal one more time without specifics, I'm going to throw up so one of the issues, because you know it's very nice.\nThree new deal, what the hell does that mean in New, York, City, I, remember, I, spent years getting buildings to go from six to four to two and then try to get the electrical and that's the frackies go on and on so I.\nThis concrete issue might be part of it, just something to think about, because today I was in a commercial building, that's being built and they have a new I'm going to call it an hbac system.\nWell I, do not really know what blah is, but it sounded very impressive and it is the only one in New York City.\nProbably we need other ones like it, but since I do not know what it is.\nWhat I'm saying is what is green new deal for New York City, something to think about because it's what we want, but I've, never heard specifics.\nI do not know if there were schools early voting in Europe, Community, Board and board five, but I think there were, and the issue is what I'm trying to say.\nI do not know how many of them are flying helicopters into New, York City, but we are totally in contact with those elected officials.\nAnd I want to thank you for again being the leader as I said, I, know."
        }
    }
}