{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "2020.11.16 - CB2 Parks & Recreation Committee Meeting",
            "publishDate": "2020-11-19",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nParks \\u0026 Recreation (P\\u0026R) Committee\\nMonday, November 16, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:01:43 - Roll Call \\u0026 Introductions\\n00:03:00 - Approval: Agenda\\n\\n00:03:20 - Q\\u0026A: Brooklyn Borough President's Office Capital Budget Director Candice Julien\\n\\n00:28:12 - Approval: September 2020 Committee Minutes\\n00:28:41 - Chair's Report\\n00:32:36 - Other Business\\n00:34:10 - Community Forum\\n01:22:15 - Motion to Adjourn",
            "lengthSeconds": "1:23:31"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "_Mu0hEX4eLw",
            "fillerWordCount": {
                "uh": 141,
                "um": 251
            },
            "readTimeFullTranscript": "46 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "park": 49,
                "project": 38,
                "parks": 33,
                "president": 24,
                "dollars": 22,
                "projects": 21,
                "capital": 20,
                "budget": 18,
                "bridge": 18,
                "funding": 13
            },
            "wordCountSummary": {
                "park": 11,
                "capital": 10,
                "president": 7,
                "bridge": 7,
                "budget": 6,
                "dollars": 6,
                "parks": 6,
                "project": 6,
                "money": 5,
                "funding": 4
            },
            "fullTranscript": "And I'm the co-chair of the Parks Committee and I want to welcome you to tonight's meeting I think we can we're going to start recording this meeting. This is the parks and recreation committee for November 16th, a part of the Brooklyn community board too we're calling the meeting to order and being recorded so that we will have transparency and permanent public access to this meeting on Cb2's YouTube archive we're asking all attendees, as we always do to. Please keep your microphone muted when you're, not speaking, and we do invite all committee members to keep their cameras on and also, if you, if you're, not a member but you're attending the meeting. We'd love you to keep your cameras on too, especially when you do speak, it's always easier to listen to someone when you can see their face. We will let you know when we have topics are open for comment for committee members for board members and for the general public and please, if you do want to speak, use the Webex feature in the participants a panel to digitally, raise and lower your hand and you'll be called upon in order, and if we don't get to your questions during our time frame, we'll try to make sure that someone gets back to you the answer and if you or anyone you know who wants to attend this meeting needs any special accommodation. Please call our district office and ahead of the meeting, if possible, so that we can make that accommodation for you, I'm going to ask my committee members to speak. I also want to thank First Jennifer Melby for taking the minutes tonight. I greatly appreciate that and I'm going to ask my co-chair to introduce himself and then, if everybody would then in turn introduce themselves who are committee members right, my co-chair. Thank you. Suzanne Quinn's, member of the committee and member of the board go ahead. Dwight, oh Dwight Smith, member of the committee on the board, Carolyn Carol and Hubbard, an unweary member of the committee and of the board. Thank you and Jennifer. Do you want to introduce yourself as well Jennifer Melvie Member of the committee and is Lenny here all right, I assume he's planning to be here. Maybe he'll be here a little bit later, so, okay, I'd like to have a motion to approve tonight's agenda and Carolyn Second. It ever fall in favor, aye, okay, the motions approved thank you, which brings us to our discussion and a Q&A for this evening and we're very fortunate to have the capital budget director Candace Julian for the Brooklyn borough president and I'm hoping before we get to our Q&A I know some people have some questions of wondering about what. Actually you do Candace and do you have any funds? More importantly, do you have any funds that the Parks Committee could have any influence in advocating for how they might be spent so welcome good evening, everyone and thank you community, Ward 2, for inviting me to this committee meeting. I'm always happy to just share information on accessing city capital. So again, thank you. Yes, as you mentioned, President Adams, all five borough presidents actually receive five percent of the city's capital budget that can range anywhere in a given year from 30 million dollars upwards to 50 million dollars. Given the state of things who knows what next year's budget is going to look like, but generally just before we get into Q&A, and is there any money left over and how can the Parks committee access some of that funding I want to give you just a bird's eye view into what I do at Barrow Hall and what that capital funding process looks like so I've been at Borough Hall for about eight years now, seven or eight years now, I'm working before I took over the capital budget portfolio last year in the programs department working with our development director on writing grants and then executing those programs in schools, senior, centers, any and everywhere in the borough which we're focused on cultural diversity, financial education, things of that nature, so capital funding. So again, our presidents receive five percent of the city's capital funding budget capital budget applications generally open in December and close in February non-profit organizations complete two applications. One very quick google form to the borough president contact information and project overview, and then they do the larger office of Management and budget cap grants, application and city-owned entities, schools, hospitals, parks; they just apply to the borough. President Quick Google form no need for supporting documents in a secondary document, and then we submit those items into the budget. So that's a very quick overview. It's very different. If it's a city entity approaching you know accessing capital through the borough president or a non-profit. If it's a non-profit, they're, a slew of eligibility factors, they have to have three years of audited financials prior city contracts, depending on what type of project they're pursuing movable property versus construction or renovation projects of a physical structure. So that's generally again some of the differences between city-owned projects and non-profits. The borough president has seven years in office. He has a capital portfolio of roughly 376 million 50 of his capital allocation. Every fiscal year goes towards education. President Adams has been passionate about bridging the digital divide in schools. So you'll see a lot of the awards. Go towards technology upgrades healthy eating things of that nature. Coming after education, 15 of the administration's application went to housing and third was parks, receiving 11 of the administration's capital allocation receiving roughly 42 million dollars in capital projects. So when you ask, is there money left over that CB2 can access there's, never money left over. What being that, you just submitted your statements of needs and are going through that process with OMB as far as parks. What has happened in the past is when Marty Marr the borough commissioner, comes before Borough President Adams. He has and also a lot of times what the community board hands over a list of projects and their funding needs. So I would suggest, depending on what you submitted or what you're really passionate about follow up with Marty, because when Marty comes to the Bp he's going to you know, push like this is you know what's going on. This is how much money is coming from this person that person the timeline and that's what the Bp is going to look at. So yes, if the community board wanted to also work with the borough, president I would say reach out to that managing agency. It parks. Of course this is the committee we're talking to have conversations with Marty Maher, because he would be the one to speak to the Bp to say we can move this project in this district faster than or you know have that conversation around the financing so I think that's a good bird's eye view, a good introduction and I. You know I'm happy to take questions from the committee. Members do I, think you're, muted, Suzanne I, see you have your hand raised. Thank you. I can't figure out how to do the hand raise within the participant panel, so maybe ty, if you maybe you can chat us on that from the old-fashioned way right now. So thank you so much Candice that was excellent, really concise and super helpful, generally. First of all, all capital expenditures, large and too small, giving us some dollar parameters. Sure and that's a tricky question: okay, so many moving parts. You know I like to say with capital guidelines, and then you know a lot of shades of gray right. The borough president has one more year. So we're not going to you know. I can't say you know, whatever president's appetite to start, a new project would be versus closing out projects, and it really just depends on the dollar amounts and the project and the financing. Looking at you know some previous projects. You know, for example, you know something like this is what you know Marty would bring to us. You know this is the project. This is the project cost, so we're just looking at you know if it's a 10 million dollar project, there's two million dollars in it. It's an 8 million shortfall. Where is this coming from and then that's the conversation to stagger it over four years three years, so it's just you know, moving the pieces around to figure out. If the project you know is feasible, but it really just you know, we need to see it on paper to make a decision. I'm going to answer your questions because yeah does anyone else, have a question all right. Well, I have a question. One of the things I find very frustrating is the length of time it takes for capital projects for the parks, at least to get realized to get off the drawing boards and then get to. You know finished that you were showing Cadman Plaza there, for instance the the bathroom upgrade there. It seems like it's going to take I, don't know if it was three years from the time they first came to us and I know how things have to go through certain budget cycles. But is there anything that can be done to shorten that process or are there any steps that the borough president's office has done? I know it's really the city, but it's so frustrating that you have to wait so long to see the fruition of a project sure and there's so many moving parts with these projects where I know. If the project you know isn't going to move until it's fully funded I know sometimes for some projects, you have to get a little crafty if it's underfunded, where you phase the project, so you can get design done or construction part one done, so you don't have that five to ten year, wait to have the whole thing done, so you know there short answer is no. It is a lengthy process. Even for the simple you know, purchasing technology or purchasing a van can take. You know two years because with construction projects, you know when you have to bid out the contract. You know that takes about six months. Design takes another six months so, unfortunately, and that all is dependent on the project being fully funded, so like nothing's happening until the project is near being fully funded, which is why, as I mentioned, depending on the project, you know the conversation with the elected official is hey. I'm going to come back to you over four years at five hundred thousand dollars like this. Is the plan we're putting in place so again. Unfortunately, there really is, unless you know at design the project is, you know, set up in a way where certain things can be done piecemeal and instead of you know, just one big upgrade. You know at one time but yeah. Unfortunately, it does take a while and I can't figure out how to make it go any faster yeah. Equally, as frustrating is we'll put something in the district needs statement, and it might be in there for six years and it still hasn't, nothing has happened on it. So I, don't do you have any suggestions as to how we could get something in the district needs statement to be looked at more closely. I would say again, it depends on the agency and what the ask is again having if it were parks again having that conversation with Marty having a conversation with your elected officials. So we can then have that follow-up conversation with Marty and with the other elected officials to bring everyone together to push the project so I would say the more prevalent you make it on everyone's mind, the you know more prevalent. It would be to the funders and those who can push the project. That's good advice! Thank you! Dwight. You have a question. Yes, Candace good information I have basically two questions. First, on I on the application that you gave in and so correctly it was 60 percent, graduation 15 for housing 11 for park. Yes, and so then, there's 24 of the dollars. Where do those go? I can actually tell you that really quickly, 42 million went to arts and culture. 17 million went into economic development. Public health received 16.7 million department of Transportation received about three percent of the budget at twelve million dollars and transfer DOT things for like countdown clocks, sidewalk extensions, economic development, 17.9 million. That was a lot of stuff, usually done at the Navy Yard Moore Street market. That's about it, I got it gets a reasonable percentage of this. Yes, well, that's good to know the other question was oh, and so, when taking your advice, we go to we go to a party and we lobby him specifically before our capital budget request that we'd like him to put forward now our dollars are. Our budget will be part of the 42 million that that is available and so I guess. My question is: Marty may likely get more than 42 million dollars worth of requests that he puts before the borough president. What is the winnowing process at Borough Hall? Assuming that the numbers exceed the 11 sure and that 42 million prior awards for next year? We won't once we get those numbers from OMB as to what you know we're going to you know assume. The number is that we have. Then we play that you know we balance the checkbook OMB roughly in the middle of January, we'll say you're expected to have x. You know, let's say 10 million dollars for FY 22. I know the borough president likes to give 50 to schools, so you know Fi and then so we have five million dollars and then we just look at what the applications are and then we go from there and again we really depend on Marty to give us that breakdown. So when he comes to us and he's sitting with us- and you know we're looking at the dollars and cents because, yes for all 18 districts, that may be about 50 million dollars, you know in need, let's just say- and the borough president only has 5 million. So we're going to look at project cost, how much money do they have raised and the timeline, because again with one year left in office, you know it would make more sense to close up projects that are close to being. You know funded as opposed to something that's really underfunded. So that's really just how we're looking at it we're trusting Marty's expertise on just the process and where things are in the pipeline to say to the Bp like I think you should fund this and the president will either agree with Marty or agree. Sometimes he would say the community wants this, we're going to put it in there and try to raise the money and work with our partners in government with City Council to fund the project. So you know, even if the project is underfunded, I still say advocate for it, because you know we work on behalf of the community and if there's an appetite you know and real, you know advocacy for it. That's better than you know just pushing paper down the road. Okay, final question, one final question, and so for the upcoming years budget are we likely to still because that'll still be under the Mr Adams Administration will don't likely get the 11 of the borough president's application or percentages change in light of what the dollar the actual dollar amount received is absolutely the the allocation depends on the amount we receive and it also depends on the applications that come in some years. We have a lot of parts applications and some years we don't so really it's just. You know what comes in for us to fund. Thank you sure, any! Oh Suzanne! You have another question. Go ahead! Yes, I'm! Okay! So with the 40, can you hear me yeah? Yes, okay, so with 42 million dollars canvas? Is it fair to say that I mean I, know, there's no hard and fast rules, but typically looking at products that cost a couple million versus 15 20 million? That would take a huge percentage of the pie. Is that, generally speaking, a fair statement? I'm so sorry, could you repeat that again it was a little glitchy on my side that might be on my side, but with 42 million dollars. Is it fair to say that better success rate with projects that are you know a couple million dollars versus 15 million or 20 million dollars, because again, there's no hard fast rule no and I just want to remind every that 42 million is the total for previous allocations. Yes, no I heard that for sure so yeah it depends like I know, like let's say, Prospect park, the perimeter restoration, that's a project that we've been funding since President Adam's first year in office, because again big project, we knew we weren't going to be able to allocate a big number in one year, so we allocate over the years. Another part you know requested 500,000 for turf and like we were able to solely fund that and you it was turf and like a new jungle gym. So it really again, it just depends on the numbers. How much it costs are. The is the council willing to you know we work with council to hey. Are you funding this and you know just back and forth negotiations? So it's really you know there are. It depends on the project. Is it new and exciting? Is it you know something really you know needed in the community. Has this been going on for 30 years? You know everything runs the gamut and we just you know, just look at the dollar amount and where things are- and what did you say was the timing of typically when the borough president and commissioner Maher speak. When would you speak roughly I want to say it's in the winter? It's either January or February, okay, and so my other question is just on our list of district priorities for parks. We have a couple of parks for Example, Commodore Berry. It's something that this committee has been advocating for many years and you know, and has really gotten some great improvement over the past several years. There's still at least one piece, if not a few pieces of work to be done. That seems to be on people's radar. You know at this point, but we feel like that's important and we feel good about the progress that's being made there. One of the other things on our list is about a part of the District Burham Hill in particular. That's under parked, okay, there's just not land set aside four parks and and Dwight and Jennifer live in a part of the district and can speak speaking more clearly about it. So this is a little bit outside of the capital budget process, but is that something to raise to the borough president? So that if parcels are becoming, you know just in the consciousness that that's a need in the community that if parcels are becoming available through you know, God knows what deal or negotiation that there's an awareness, a reinforcement, because it has been on our on our statement of these for several years. But there's a reinforcement that that's something important, sure and I know. Usually my colleague Richard Bearak, through land use, they're, usually I, know green space is something they always. You know covered and advocate for with the developments and things of that nature. So that's something that I would say is more in Richards in the land use wheelhouse, but what I would say? Usually if, if a district or a neighborhood within a certain number of blocks, is under part I, you know encourage the residents to look at joint parks. You know school yards, you know and that's something that either the school or parks can apply for capital to turn that courtyard, which is usually just you, know, an open field into an actual playground that the community can access jointly operated parks like that's something. You know if there isn't green space, that you know some partnership and that's a conversation you have with Marty as well. You know getting the school on board and what is it going to cost to turn this concrete? You know courtyard into you, know a playground, or you know whatever it is. The community is looking for. Thank you any other questions from committee members. Is there anyone here from the community board who has a question okay and I? Think at this point we could hear from any members of the public who are here who might have a question I. Think if you put your name in the chat, we could call on you all right. I'm just going to check my list again. Okay, I, don't suppose, there's any way we could define tree pruning as a capital project. All right, you know, that's done, I! Think once every seven years, something like that. So at this point, Candace I want to say thank you for coming tonight. I hope this is just the first of other visits. Sure now that we know your name. We know how to find you and I really can't. Thank you enough for taking the time and talking to us so I. Don't know that I even knew that there was funding in the borough president's office of this ilk, so it it's really good to hear about it. Absolutely I'm happy to attend any future committee meetings or, if you have a question, feel free to reach out to me as you get ready to lobby Marty and even after you have the conversation with him happy to just touch base. So I know what's on the radar once you know, we have that conversation around parks allocations. So again, thank you and for being so sweet and lovely and also you're, welcome to stay, but we totally understand if you have other things to do so. Thank you all. Thank you. Okay. So now we're going to turn to the approval of the minutes from October. Does anybody have any changes to the minutes or corrections all right hearing? None then I will assume that committee members are fine with the minutes as they've been presented and then we'll move along to the chairperson's report. Some of this a couple of things I, have to report. You may have heard I know some of you were at the general meeting last week, but I wanted to let you know that the municipal building is now Justice Ruth Bader Ginsburg Municipal Building. So there are signs up there, I'm not sure if those are the permanent signs or they're just temporary signs. So if you haven't walked past there in a while that change has taken place and the other thing I'm a little calmer tonight. But again, if you were at the general meeting, you heard how excited I was to find out that we have a calendar of events now on the website, and you know I was going to cut and paste and have those available to put in the chat just to show you that I'm trying to do my part but I didn't get home in time to do that, and but you can now go. You can, after tonight's meeting go to that calendar of events. That's on the web on the CB2 website and register for our December seventh meeting, which I I'll mention also is not the regular we're having a joint meeting with the youth education and cultural meeting on just I may be aware. We are, we will be discussing the statute of Columbus right outside the Supreme Court building in Columbus park. Then you still have time to the end of the month. If you haven't seen the Photoville exhibit it's still up, and it's still so interesting and exciting. And then, if you live in Councilmember Levin's district, he is again doing participatory budgeting and, if you're not familiar with that, it's an opportunity to apply for grants on behalf of your favorite causes, whether it's a school a park. You know, upgrading technology is a favorite, a favorite type of project, that's funded, but this is the time that December, 31st I, believe is the deadline for submitting a proposal. If you go to a council member Levin's website, you can get all the information if there's a park that you're particularly concerned about and there's some discrete, not terribly expensive project that you think would might fall under this. The projects have to be between five and to be able to be completed between five and ten thousand dollars. So if you there is a lot of information and then again, if you're, not that familiar with it once the I believe it's his office. That makes the determination as to which projects will be up for a vote, and then everyone in the in his district gets to vote on which projects they think should be funded. So it's another way to find some money for a for one of these projects that we really need, but sometimes can't otherwise find the funding for so I wanted to mention those things. What is this? Oh, you know I forgot to ask Candace to give our regards to the borough president, so Nan Blackshear since you're here, if you could just first of all, thank you for being here and also if you could convey to the borough president, how much we appreciated Candace being here- and you know thank him for that other business. Is there any other business for discussion tonight? Okay, then I'm going to open well, let me bring up a subject two subjects here, just to give you thank you Nan just to give you something to think about. It doesn't have to be tonight, but you can get back to us again as always we're looking for suggestions for meetings. We have several in the pipeline, but we're always looking for more meeting ideas or for ideas that we haven't. We haven't explored before. Maybe there's a way, a path we haven't taken that we should be looking at. The other thing is I've heard from a couple of you with suggestions for reaching you've been reaching out to friends and colleagues and encouraging them to come to our meetings. We are looking for more people to get involved and, as you know, it's not that difficult to become a public member once you start coming to a few of our meetings, so you think about. If there's someone else, you know that might be interested in getting more involved in parks and encourage them to come to our meetings. So does anybody else have any other business then, at this part of the meeting we open it up to members of the community who may be attending tonight? Is there anyone on the call who would like to speak at this point? Carolyn is Andrew Marshall on the call. Do you know, okay, I, don't know because I don't see the names up. We you could look at the participants list. We didn't do this at the beginning of the meeting, but it might be good at the moment if you are not a member of the committee, if you just like to introduce yourself and if you'd like tell us a little bit about yourself or why you're interested in being at a meeting Oliver, would you like to say something you moved around there? You could unmute yourself if you'd like this is egg development? Oh okay, ed! Thank you! So much for that, and thank you for being here. We appreciate that I. Guess your camera's shy. Okay, all right, Oliver or Cameron! I! Don't know! If you're are you Cameron, I'm sorry, I have a small participant too. So wonderful, that's a park user. She is definitely a park user. One of two park- users in my family and so Suzanne- had reached out to the community asking for more volunteers to get involved, especially those who had families who are averages of the park, and my two girls are, and so we are in the park daily, especially now with everything we are in the park even more than we ever were before, so anything I can do to get involved to help. I'm definitely would love to be a part of this process and whatever way, I can be helpful, but I think I'm definitely a person who needs assigned tasks. So if there's somebody that feels like there's something that needs to get done- and you know a thousand emails need to be sent and a spreadsheet needs to be made. I am great for that and looking forward to potentially working with you all well, if you're a friend of Suzanne's, you must be a can get it done person I'm sure. So what park? Do you frequent? We are cabin plaza users, mainly we live in Dumbo, so we oscillate between Brooklyn bridge park, which I know is a separate purview and cabin Plaza. Okay, well, we we'd love to hear you know what you do and don't like about the park. You know if there's something there is a conservancy I mean they're more fortunate than some parks in that they have that group, but there still is always I. I've noticed because I walk past there when I walk past there, it's usually between 8 and 8:30, that there are more dogs running around there than ever. During that time and they're all they all seem to be having a great time but and I think there's some evidence that peop more people are getting dogs right now, because you know everyone's feeling so isolated. So you know welcome we're delighted to have you and we'll certainly come up with something for you to do. If you don't have something to suggest. First, so yeah, you know it's funny. You mentioned that about the dogs, one second sweetie. So why don't you mention that about the dogs, because sorry you're, about to have a streaker, potentially she's got no clothes on, and here she is. Oh, it's fine. We see the dogs every morning when we walk to Plymouth. We go to Plymouth School and they I have it. Why do little kids love to round walk, run around naked I? Don't know diaper I, don't know, I'm going to go back on mute and let's give somebody else before. Okay, thank you. We totally understand Suzanne you're right, I did I. Ezra did I. Ask you if you wanted to speak all right Oliver did you want to say something? Now we love to hear from you sure hi, I'm Oliver everyone. This is my first community board meeting and I just wanted to learn a little bit more about the process and I live in Clinton hill, myself and I would say the park that I visit the most is Fort Greene Park, which is a just a very lovely park in general. That's great we're delighted to have you and please come back. You know it's very easy. As I said, it's pretty easy to become a public member and we are always looking to expand the number of people who are on the committee and we I, don't you may know Lenny Leviton he's on our committee he's very much involved with the conservancy and you may have seen him in the park, he's very good about I, think, cleaning and also weeding and all of that kind of thing. And so, if you see him, I'm sure you'd recognize him he's very devoted to the park, so good, all right, so I think I've kind of recognized ever Nan. Did you have anything you wanted to share this evening? I know you wanted to be anonymous, but anyway is: does anyone have anything else they want to discuss tonight? I would if Suzanne so I would just oh and Cameron's back on and I'll just say, Cameron and I actually don't know each other, except for we had a brief chat on on Friday when she responded to my Facebook Post and one of the things we talked about was garbage in the parks and keeping them clean. And then we talked about how in Dumbo that's a big problem with shake Shack, and then she told me just today, she already reached out to shake shack to see if she can get them to do more garbage cans outside of their outside of their location, because truly at Brooklyn, bridge Park and Fulton landing there I mean they're, probably contributing to about 80 of the garbage. So she is definitely from what I can see again it's on person and I'm so glad that you joined and Oliver as well I just to follow up on Candace's presentation. So I thought that was great and I love. The idea of us just more actively advocating for some of our needs. I mean we we're very diligent in putting them in the district needs and being thoughtful about them, but just I guess for us to have. You know a marker for us to be communicating with the borough president in some way and just after the new year to to line up support for some of our top initiatives, as makes sense for his conversation with Borough President Adams. Does that make sense to you Barbara and others? Let me think about it certainly sounds like it has potential and I guess. People could start to think about what are their top priorities, and you know I guess the other thing that Candice said is. This would probably not be the best time to look for new projects right and I. Think also, you know, I think the budget. No one knows what the budget's going to look like correct. You know so, but I think it. You know it it's a good idea. I got the impression from her that really we should reach out to Marty. Yes, no agree, but we just want to do it on the right on the right timetable. Right and the right projects that are close to being fully completed are almost funded and things that we could. They could reasonably look at and say yes to yeah, but I mean it's so, but since we've got basically one, maybe two more meetings before the well before meetings at the end of the year, we have one meeting yeah, oh yeah, that one meeting okay and I was thinking more about the January meeting on. So oh but I guess that's not a good idea since we're in the middle of the month in January, so we only have one more month, in which case we need to come back to with our December meeting, with our suggestions that we can talk through with each other and agree on something to approach. Marty with at the beginning of the year, yeah I feel like we always suggest. Yeah I was going to suggest that maybe think about what you particularly would be interested in and in the next week or two, maybe we'll set a date. This is the Wednesday before Thanksgiving sound. Like would be enough time for people to email, the group with what you would like and then we'll try to see what comes to the top as being the most important or of most concern I. Think, don't you think we already prioritized our priorities like we prioritized and then the full board voted so in a way I feel like those should be the priorities and they maybe Robin Taylor could help us. We know those down like of these top five priorities, which you know, which two do. We think it makes sense to has the best shot, yeah, okay, yeah, all right that makes sense. I will touch base with Taiyo and we'll go forward on that. I wanted to get back for a minute that you raised the issue, as did Cameron about garbage and the time kind of went fast now to focus on garbage doing a project, but I was wondering if perhaps the two of you might think about spearheading a project. You know- maybe just you know, focusing on one park the park of your choice, perhaps and trying to do some initiative, whether it's a day you know in the spring, in the early spring, I guess or sometime in the spring, about getting out to a park and cleaning up and trying to get the message out to people who are using the park. I would assume when you're referencing shake shack. It's not so much that there's garbage outside of shake shack, but it's their gar. You know people buy the products there take them to the park and then leave the boxes there and maybe there's some other way they could package. You know using less packaging for their. That would help with having less garbage yeah. It's actually both I think with shake shack. It's there's overflow on the garbage cans close by to them. Oh yeah, Cameron's, not nodding, yeah and the other I, don't know, but that's the thing I mean I knew you know, I'm usually one to say yes and take things on, but I only I think I would love to hear another park. That would really need that, because Brooklyn bridge park, I, think, has an organizational structure in place for that and Cadman also has a conservancy, although Cameron you may, you know I feel like we would have to work with them, but they have a conservancy to organize cleanups I, don't know if people have a thought as to another park that doesn't have an organizing group that we can help to facilitate the challenge there being I. Don't have any connections to those communities. Do we lose Barbara Justin? Just to the note that Nan wrote in about contacting the bid, that is something I did at the beginning of the pandemic, when it was really out of control and contacted the bid to see if they could potentially have their ready, willing able participants also contribute to Brooklyn bridge park. So it is something they did consider. They also said that they were understaffed over the summer given Covid-19 and it has slightly improved, but I can't tell if it's improved because there's fewer people in the parks, because it's cold or there's less garbage, but just to wrap up the shake shack conversation I did reach out to their customer service and we'll try to get in touch with the district manager and even if I have to go to like Danny Meyer himself and so we'll figure out the garbage from that perspective. But to your point, I do think that in my building in Dumbo there have been lots of initiatives for community cleanups and they have been very successful. But Suzanne I know to your also to your point that we are. We have done those already, and so, if there are other suggestions for parks outside of Dumbo in Brooklyn heights, that could benefit from that. I think that would be great and it's something that we've seen success with this with grassroots community. Organizing. The only other note that I was going to bring to the table was- and you mentioned, there's a cabin Plaza, Park Conservancy, and so I'm still getting familiar with which groups handle which parks and what parks are under, which committee's purviews, which is very complicated just for a beginner but Cadman Plaza. The turf is slowly disintegrating and has been for a while and so I don't know. If that's something we could maybe work with Cadman Plaza on or just that idea of turf in general being such a safe use of ground for kids, and is there if we decided to say hey, okay, we're going to redo the turf and Cabin Plaza and it sounds like you have to contract. That out. Is this a larger initiative to find other park locations in our communities district that could benefit from having turf relayed or if there are places that are completely concrete. That could benefit from just having turf space instead of concrete playgrounds or parks, and we could have that be a larger bid for whatever organization wants to bid for it and find some cost savings there. So, just something to consider, as we think about the best surfaces for our children to play on that are both long-lasting and safe I. Don't know if there are other parks outside of Cadman Plaza that have that same issue or they could benefit from different surfaces. My colleagues would know better, but there is a there's a perspective on turf I feel like by the the borough. Commissioner right, Andrew I forgot on Commodore Berry. What the do they want her for they don't want turf I, can't remember what the touching turf, artificial turf at any one of the parks. That's like a two or three or four year project. It's not going to be just a discussion that we're going to have, because you know that issue was approached that cabin Plaza and it was a long drawn-out discussion with everybody in the community getting into it yeah. But if in concert with the Cadman Park Plaza Conservancy that's identified as a need, then basically we would consider it for prioritization on our district needs and it doesn't get done and then we know that the longest to get elevated but I think hi. It's Barbara, I'm now on the phone we were out. Let's come back correct, hi, it's Barbara hi, I'm on the phone I seem to have lost my internet connection, I'm sorry, it's okay, I'm actually having a bad night with internet connection as well. Suzanne and Barbara. I'm seeing technical, low bandwidth signals for both of you. Unfortunately Suzanne. If you're banned with this, though you could try putting your video feed, yeah I will try that okay, Barbara can I hear this. Yes, I can okay go ahead, I was going to say, I think we've just about finished the meeting. In any event, I apologize for my problems, but I think everyone who wanted an opportunity to speak has spoken and I think we we've come to the end of our agenda. So if someone wants to make a motion to adjourn okay- and do we have a second Barbara just before we adjourn I- wonder if Cameron and Suzanne had a chance to conclude the conversation that was happening while we were not able to okay with you, I think I was only Cameron was raising some thoughts about cadmium, Plaza, specifically to the turf and Tia they're on the list that people were outreaching to yes or what was her question about cadmium other? Was it about garbage or something else? No something else, I'll, let her speak they're not currently on the list, the folks that I have on the list for January actually Barbara. It would be okay to just run through a quick preview of the couple months ahead and, what's what sure? Okay sure so December is the joint meeting with yucca regarding the Columbus park statue and we actually have reached out to the parks, Department and invited them to send a representative. Now it won't be somebody from the budgeting part of parks. It would be some other cultural side of Parks Department, but hopefully somebody will be there. January. The groups that were discussed were having playground, NYC rejoin us with a specific proposal for a location for a cd2 pop-up. The second is Brooklyn waterfront greenway, possibly a joint meeting with transportation. The third was trust for public land and the fourth was Brooklyn bridge park, which we think would probably be better later in the spring and for February and March. We had discussed following up on the interest in community gardens and park. Friends groups, so community gardens are typically trying to recruit quite a bit in January and February in anticipation of groundbreaking for planting seedlings in March. So February would be a really good opportunity. If we wanted to coordinate a Cd2 community Gardens public forum, where maybe we could invite representatives from I, think it was 13 community gardens that we identified in the district to come and share how many private plots are available for the season how to join a plot, possibly invite an organization that could answer questions about. How do we start a community garden if we don't have one on our block, etc and then in March, because we now have a comprehensive list of the district parks with and without friends groups? That link is in the chat box. We were thinking that in March we could ask representatives from those parks, friends, groups to come and maybe do a bit of a Cd2 park, friends public forum in March, in anticipation of that being a good time of year to start a parks, cleanup outreach. So that's what we've got on the roster for the next quarter sounds good. It's also, you know, subject to other events or ideas that come along yep, yeah I, think that sounds I, think that sounds great and then cabin Plaza can be rolled into March right yeah, because it's interesting Cameron's now the second community member that I've spoken to in as many months that have actually said that things that aren't as rosy and cadmium plaza. As maybe you know, they were suggested to be previously I. Actually, even though I'm close, I'm not up there too much so I think it would be good for us to get an updated handle on the needs of that park. And just to that note, because I'm now looking at the map of which parks are under management by this committee and it looks like Anchorage Plaza Club corner, which leads up into Cadman Plaza, is part of that. So I'm not sure the best way to put something on an agenda people's radar. But that approach which is basically coming off. The Brooklyn bridge at the intersection of like the BQE and a whole host of traffic issues, is not only often alarmingly full of dead birds but also seems to be full of trash, and also it's just very unkempt and unsafe. And it really serves as an entrance point when you're coming off the Brooklyn bridge, which feels like an introduction for a lot of tourists to Brooklyn and seems like an important place. An opportunity to attempt some revitalization and, as you mentioned about these community gardens I, wonder if there's ever a way to turn park space into a community garden or how that process works because it seems, like everyone, is just passing off this area, to either the DOT or to the department of buildings, doing construction or passing it off to Brooklyn bridge park, if that's their area. So there are just some areas like that's a perfect example. There's green space there and it's really under utilized- and it's often dirty and just used by dogs, and so is there an opportunity there to create something greater, because no one is using that green space as it currently exists other than as a bathroom, and can we turn it into something more usable and also present Brooklyn in this you know: welcome right. You come off the Brooklyn bridge you're a tourist you're coming over from Manhattan, hopefully one day, there'll be more of those people back you get down the stairs and you're, basically greeted with some dead pigeons and a lot of hot dog stands supposed to be part of the strand renovation, which project seems to be totally on hold. What can you talk more about that Dwight? What project is that it was, as I understand the kind of a parkway from from Brooklyn bridge park through downtown over to Bam. The idea was connecting the two sides of downtown with a kind of park like feel and I mean this was something that was put forward by the downtown partnership. Two, maybe three years ago now, which had some support from the borough president's office, then there turned out to be not a lot of money to do anything beyond. You know the early planning, but I'm raising it because that area was has been targeted for improvement, for exactly the reason that you're talking about that it is the gateway of from off the bridge. You know, particularly for for visitors and that's our stuff. Actually, that's something that Taya might be useful for a downtown partnership to tell us what's happening about that, if it about that project, if there, if it continues or discontinuing rather wow 2015, okay, oh so many more years than I did than I thought wow. So it's been a long time in planning and clearly nothing has happened yet the last I had heard about it had gotten snarled in project management and funding issues and was not proceeding, but I'd be happy to get an update. It was a very it's a very ambitious plan, as you can see from the map. It looks super interesting. You know yes, part of the problem really was they had this great concept, but they didn't have any funding for it and I. Think when Regina Meyer last spoke to the community board about those streets, they were doing going to do. It was probably maybe January or February, and then she did say something about the strand, but it was just very minimal and I don't know that they envisioned doing the whole project as intended, initially so yeah. If that got stuck for whatever reason and to your point, it would be great to hear from the downtown committee as well, but maybe there's some type of collaboration. We can do in smaller plots right. So just that you know individual four corner meeting where you get off the Brooklyn bridge is one project to tackle in a smaller scale, whether it's community garden or just revitalization of the green space. And then, as you work your way up through Wall Whitman, there are other opportunities yeah. It was going to be a. They were doing the lighting under that overpass there and then there was supposed to be like little coffee area, and you know real really, because two folks needed to have something that once they got off the bridge from the stuff. So it would be interesting to hear what the new I mean. What what? If anything, is the thinking about this? At this point and Bart to Barbara's point I would I didn't know that streets, vibrant escaping street markings thing was part of the Brooklyn strand, but no, it was separate it just I was saying when she came to talk about it. She kind of mentioned very briefly the some element of the strand. I. Just don't remember it at this point. Okay, if the strand goes back, I think it was still even started. The idea that Bonnie Markowitz, when he I think got some students interested and they had an actual planning, but the original planning was basically from a borough hall to anywhere where it could lead up to Brookwood, Bridge, Park and all those little corners and around there as they lead into Brooklyn bridge park. Now it started going a little further and somebody decided we're going to try to get it all the way down to by the Brooklyn navy yard and get that walkway in there and then even further to pass all the way. Like you said to Atlantic Avenue the minute it started. It's expanding and expanding. It became a dead issue because it's too much money and the whole thing is. We gave up the whole thing because it could have been a beautiful alleyway from borough hall down to Brooklyn bridge park and as if people get into Brooklyn bridge park, they will have like a complete parkway I need all the parts from again Boro Hall all the way to get to Brooklyn bridge park and leave it at that. But no, they decided to try this to try that and each community try to put in a little bit of their peace into it and they just died because there wasn't enough money in the whole party, so I mean if he wasn't resurrected and pushed again I think the best idea would be to try to you know kind of clean it up a little bit and which realistically could be funded so Andrew. What I? If correct me if I'm wrong, but what I hear like you're saying is smaller scale projects brought by different community boards have a better chance of success than collaborating across projects and putting a bigger price tag on the whole initiatives. You know, like you've, heard who's going to get the money to fund it and it'll take years to do it right. The Atlantic yards, the little budget blowed up like crazy, and it's still done is that going to happen in our lifetime right I. Wonder, though, if especially right now, if there's an opportunity how businesses are hurting in a new way to talk about? Not only is the introduction of tourism again into New York, going to be a big initiative for the city overall, but also to encourage that traffic of tourism and of community members to and from downtown Brooklyn to the waterfront to revitalize the businesses that have been hurting is a helpful jumping off point to the point of making it sound sexier some of these initiatives, and then I did just wonder if community gardens do they have a formal application process. Is there a world in which a community garden would be able to take over public park space and just make that space feel better right there? They have the capacity to make things beautiful. That doesn't take the amount of funding that we would want necessarily or need. Yeah I think we should probably table the community gardens so when they come in to to speak with us and hear directly from them, but I think that with the Brooklyn strand, one thing also is that everything with the BQE is adjacent to that and touching the on and off to the Brooklyn bridge. So I feel like it's all, also embroiled with that, and until that has a path forward. The BQE I think it would be difficult to do anything grander. There I think like in our place in this committee, advocating for smaller things within this community is where we can, where we can have success. That would also work with the stream if we shave the strand just to be a smaller alleyway from let's say the borough hall to the entrances, or you know, wherever we might construe to be the entrance as far as Brooklyn bridge park just yeah but I, don't think it's the right time, like personally I. Don't think it's the right time to really push for that. Until that's my opinion. Until there's a little more settled on the BQE piece, I wouldn't mix, you know, I would just end it where, as far as close as we could get before even discussing any entrances could have been knowing. That might be a negative, a whole different issue, but that shouldn't mean that we can get the strand working from Borough hall down to Columbus park down to the Korean Park down to cabin and the area the Cameron has mentioned still belongs to that area. That could be fixed up and leave it at that. Just push on that and that'll take five years to do something honestly, it'll take five years and I would rewatch the gardens and all that it's all mired in with various kind of places or trusts that own land under these public or these little community gardens, because it's I'd love to find out more about it. But it's not just as a simple that it's a community garden. It's like it's trust, that own that land act or who you have to go to get something done, but there are enough community gardens or little venues similar to community gardens in our district. That probably should be brought into this discussion and even if it picks themselves up to be more productive and open spaces for people to enjoy open space. There are a few guys that are actually people actually gardening and I'm they're not interested in having people come in and enjoy them they're just in there to make your own little garden for their family and friends. But there are a few other places like there's one almost exactly across the street from from Portugal that I think you guys remember: Donnie Black used to be part of it. It's completely disused, nobody uses it everybody you know, but it could be a beautiful park. You know it's a little sliver, but it's half truth, there's another one. That's by by the Bam that one of our community park, members is affiliated with a former member affiliated with that little sliver right across the street from from Banff they're, not so much of the garden as an open space that people could sit back and enjoy it. Those are the type I think we should bring to our meeting and find out more about those type of slivers all around our district, because that we could influence something here. It seems like just based on what the presenter earlier had said: Andrew your point of addressing slivers right, these very small green spaces that could be that are underutilized but exist on a very small scale and then, ideally, wouldn't you know, require these epic budgets and could be a little more grassroots I. Think that's a great initiative to have, and if those slivers ultimately can build be building blocks up to this idea of the strand, there's got to be I, think I, don't know they have to find out how many of those little slivers are in our district. That could be worth the speed to make them it's a little more acceptable, open spaces for people in their little neighborhoods to use and the funding yeah. You can find funding on that for local businesses right around the corner or something you know like I'm the one I'm thinking of that is across the street from Fort Greene, Park and I forget what street is it on South Portland get a few of the restaurants that are around there. That could annually contribute a little bit of the budget to provide things, cleaning, equipment, planting equipment, a bench your table, so people could enjoy it on your powers and that you know in the sense, they'll, sweat off our back and just bring the people together and try to create an incentive about it. You know like we're talking about cleaning parts and all that I would hate for us as a committee to be the coordinator just to clean up a few other parts. You know that we really won't control to find volunteers. You know for one Saturday through saturdays to go there and what did that do? I think our purposes would be better if we would be able to in that particular neighborhood find friends of a park to create a group of people that would, you know, adopt and start cleaning up the park. Yeah I agree. Andrew, you know it's just you know. I remember. This is something for Oliver you're from Clinton hill, but there's a lot of other parts in the hill that are not for 14 port Green's got its own giant conservancy. They could muster up millions of dollars that they would want to. But there are other parts. There's the Underwood Party there's the playground, that's kind of part of a park and part of not a park. It's really across the street from Lori Combo, where she lives and nothing's being done here right next to a beautiful community garden, but that's a garden where people are planting all for themselves. The Underwood Park was wonderful, there's a beautiful, a little greener face there and somebody just planted here and doesn't know who it is. I was shocked. You know talking about last week or last meeting when we had the people from Galconda and the skaters surprised to see that they have a port, some kind of affordable John that was questioned about really some. They have something hey you're right. They have something and I. Just remember that was came on board to us just about two years ago. It was nothing else, but a junk place where the department of transportation, and once they finished working on the bpd, they turned it over into the parks department and looked kind of. We got something of a giant. We were talking about this little stupid place at the other end of a printed meal going almost at the footwear goes into the other community board and young adults use that part besides a seating area for very good basketball player, and they have absolutely no facilities to go relieve themselves. So when it's dark and nobody's listening, they go on the sides of a building. Every time we brought this up, Fox, commissioner, prior to Marty Mar would say: do they really need something there? Well, you know come on what kind of it approaches that and yeah I find out y' all panda's got something. Those are the things that were kind of bothering me, but here we had a facility, stupid playground and basketball courts that was being used, a bunch of people that were trying to turn it into a doggy ball, and we try. You know kind of table that for a while, but the young men that were playing basketball. They got nothing in the building. Those are great things for us to advocate, for yeah I mean for what it's worth I think the highest on our district priorities for bathrooms is Oracle playground. I. Think Oracle is the highest on our list for bathrooms, like that's the highest bathroom request on our district needs and that's been on there for years yeah. So that might be a good one. You know again in consult with Hey and Rob. That might be a good one to elevate to Marty and that's a Marty too yeah, it's Marty yeah. That would be a new project yeah. Well, that's true! So, for that yeah I mean it might not be the right timing, but it's like there's a part that doesn't have a friends group you know advocating on its behalf. So if we could be that group, if you will, when Marty's down with the borough president, whoever the borough president is or whoever is you know the Marty commissioner in the future, they will go and they present the entire borough issue of all the parts right, the small tag in the wheel and that time never gets moved unless there's some political strength to get a project being fired. You know if we could get more of the politics involved to get Amanda Barry Park fixed up for the three largest housing projects in Brooklyn, probably we'd. Have that funded right away. I mean I just want to remind ourselves that there was that you know 16 sycamores park or something it was a dump. Nobody wanted to touch it until a couple of mothers decided that they wanted something better in that park than just a place where you know drug used to hang out and smoke potter and shoot it up and prostitutes to pick up the jobs and the mothers got together and they almost twisted what you said. Yaski's are, and he found a million dollars to fix it. It's seven years ago, yeah, seven years ago, Eric Adams became the Borough commission. The first thing he went to De Blasio was to fix all the it's, the streetscape all around Borough hall, some like 10 or 11 million dollars. They got it done within your time and it's beautiful level excellent, except they miss one little sliver. As you walk over there to cross Portugal that little square, nobody wants to fix it. In his first date in office, he got 11 million dollars from De Blasio to fix up hello. Can anybody hear me? Yes, oh Nan. First of all, I'm sorry I really wasn't going to pipe in at all. During this meeting but Andrew, you said some keywords about the money that was used to do around Borough hall. Let me make it very clear that little sliver was a jurisdiction of DOT quandary, because it was under the impression that little triangle was under the jurisdiction of D.O.T. It is my understanding that has been resolved and that they are planning on doing something. I will check with Candace in regards to that, but that would be wonderful as far as what was going on around Barrow Hall and the funding to have that fixed the previous embarra, the previous borough, president felt it was the responsibility of parks felt it was the responsibility for a president and nothing was done. Eric Adams came into office and he was about trying to find a solution to get it done, and then it was done. So. Yes, we created it back. Our office did fix that and contributed funding towards that being done, but it was jointly done with I believe the parks department, because that's the jurisdiction around Borough hall, which is Borough hall, ends at the steps. The minute you go into the plaza that becomes parks department, so I think you know. Some of your story is true, and some of it may be- maybe not so clear, but I just wanted to elaborate on that. Thank you, I'm bowing out again, yeah dear. Thank you for that sliver. He paid for all these big discussions that it was difficult because it wouldn't let us happen. Yes, it's true that the rest of it was fixed. Eric Adam made sure it's kind of done together with parts but I, I'm not going to say politically, who was involved all right, well, I. Think at this point, I think we already had a motion to adjourn that was approved. I was thinking. This might be a good point to adjourn. We had a lot of good discussion here, most of which I heard I apologize for having my internet problem, so I think at this point we should adjourn the meeting and then we can pick up again next time. I think you need a second on that adjournment. I think I only heard one person approve it I. Second, all right does everyone approve? Yes, all right Andrew. Could you just take over at this point, because I can't see anybody? Well, we have a second for the adjournment, so anybody against the journey raise your hand. If you can I'm forage ready anybody objects to be a german yeah. Okay, so it's unanimous! Okay, all right! Thank you.",
            "summary": "Do you have any funds that the Parks Committee could have any influence in advocating for how they might be spent so welcome good evening, everyone, and thank you, community, Ward 2, for inviting me to this committee.\nAll five borough presidents actually receive five percent of the city's capital budget that can range anywhere in a given year from 30 million dollars upwards to 50 million dollars.\nGiven the state of things who knows what next year's budget is going to look like, but generally just before we get into Q&A, and is there any money left over.\nI want to give you just a bird's eye view into what I do at Barrow Hall, and what that capital funding process looks like so I've been at Borough Hall for about eight years, now.\nSeven or eight years, now, I'm working before I took over the capital budget portfolio last year in the programs department working with our development director on writing grants and then executing those programs in schools, senior, centers, any and everywhere in the borough which we're focused on cultural diversity, financial, education, things of that nature, so capital funding.\nOur presidents receive five percent of the city's capital funding budget capital budget applications generally open in December and close in February non-profit organizations complete two applications.\nYou know accessing capital through the borough president or a non-profit.\nComing after education, 15 of the administration's application went to housing and third was parks, receiving 11 of the administration's capital allocation receiving roughly 42 million dollars in capital, projects.\nHe has, and also a lot of times what the community board hands over a list of projects and their funding.\nIf the community board wanted to also work with the borough, president I would say reach out to that managing agency.\nThis is the committee we're talking to have conversations with Marty Maher, because he would be the one to speak to the Bp to say we can move this project in this district, faster, than.\nI'm, going to come back to you over four years at five hundred thousand dollars like this.\nMy question is: Marty may likely get more than 42 million dollars worth of requests that he puts before the borough.\nI know the borough president likes to give 50 to schools.\nSo we're going to look at project cost, how much money do they have raised and the timeline, because again with one year left in office, you know it would make more sense to close up projects that are close to being.\nLike I think you should fund this, and the president will either agree with Marty or agree.\nHe would say the community wants this, we're going to put it in there and try to raise the money and work with our partners in government with City Council to fund the project.\nIt depends like I know, like let's say, Prospect park, the perimeter restoration, that's a project that we've been funding since President Adam's first year in office, because again big project, we knew we weren't going to be able to allocate a big number in one year, so we allocate over the years.\nAnother part you know, requested 500,000 for turf and like we were able to solely fund that.\nAnd, that's something that either the school or parks can apply for capital to turn that courtyard, which is usually just you, know, an open field into an actual playground that the community can access jointly operated parks.\nDon't know that I even knew that there was funding in the borough president's office of this ilk.\nWe are cabin plaza users, mainly we live in Dumbo, so we oscillate between Brooklyn bridge park, which I know is a separate purview and cabin Plaza.\nYou may have seen him in the park, he's very good about I, think, cleaning and also weeding and all of that kind of thing.\nYou know a marker for us to be communicating with the borough president in some way and just after the new year to to line up support for some of our top initiatives, as makes sense for his conversation with Borough President Adams.\nPeople could start to think about what are their top priorities, and you know I guess the other thing that Candice said: is.\nNo one knows what the budget's going to look like correct.\nThat would really need that, because Brooklyn bridge park, I, think, has an organizational structure in place for that.\nIs this a larger initiative to find other park locations in our communities district that could benefit from having turf, relayed or if there are places that are completely concrete.\nMy colleagues would know better, but there is a there's a perspective on turf I feel like by the the borough.\nThe third was trust for public land and the fourth was Brooklyn bridge park, which we think would probably be better later in the spring and for February and March.\nWe were thinking that in March we could ask representatives from those parks, friends, groups to come and maybe do a bit of a Cd2, park, friends, public forum in March, in anticipation of that being a good time of year to start a parks, cleanup, outreach.\nAn opportunity to attempt some revitalization and, as you mentioned, about these community gardens I, wonder if there's ever a way to turn park space into a community garden or how that process works because it seems, like everyone, is just passing off this area, to either the DOT or to the department of buildings, doing construction or passing it off to Brooklyn bridge park.\nMaybe three years ago, now, which had some support from the borough president's office, then there turned out to be not a lot of money to do anything.\nJust that you know individual four corner meeting where you get off the Brooklyn bridge is one project to tackle in a smaller scale, whether it's community garden or just revitalization of the green space.\nThen there was supposed to be like little coffee, area, and you know real really, because two folks needed to have something that once they got off the bridge from the stuff.\nI think the best idea would be to try to you know kind of clean it up a little bit and which realistically could be funded.\nYou know, like you've, heard who's going to get the money to fund it.\nIs there a world in which a community garden would be able to take over public park space and just make that space feel better right.\nThere, I, think like in our place in this committee, advocating for smaller things within this community is where we can, where we can have success.\nThat would also work with the stream if we shave the strand just to be a smaller alleyway from let's say the borough hall to the entrances, or you know, wherever we might construe to be the entrance as far as Brooklyn bridge park, just.\nThere's got to be I, think I, don't know they have to find out how many of those little slivers are in our district.\nI mean it might not be the right timing, but it's like there's a part that doesn't have a friends group you know advocating on its behalf.\nYou know if we could get more of the politics involved to get Amanda Barry Park fixed up for the three largest housing projects in Brooklyn.\nI mean I, just want to remind ourselves that there was that you know 16 sycamores park or something it was a dump.\nThe first thing: he went to De Blasio was to fix all the it's, the streetscape, all around Borough hall, some like 10 or 11 million dollars.\nYou go into the plaza that becomes parks, department, so I think you know."
        }
    }
}