{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "Joint Committee Meeting / Parks & Recreation + Youth, Education & Cultural Affairs",
            "publishDate": "2020-12-08",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nJoint Committee Meeting: \\nParks \\u0026 Recreation (P\\u0026R) + Youth, Education \\u0026 Cultural Affairs (YECA)\\nMonday, December 07, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Process Announcements\\n00:02:33 - Roll Call\\n00:05:56 - Approval: Joint Committee Meeting Agenda\\n\\n00:06:56 - Welcome \\u0026 Introduction\\n00:08:16 - Presentation: Victoria Vasquez, Take Down Columbus NYC\\n00:17:33 - Committee Questions \\u0026 Discussion\\n00:42:14 - Board Questions \\u0026 Discussion\\n00:52:00 - Public Commentary\\n01:15:30 - Motion \\u0026 Vote\\n\\n01:21:05 - P\\u0026R Chair's Report\\n01:21:18 - Approval: November 2020 P\\u0026R Committee Minutes\\n01:21:45 - Other P\\u0026R Business\\n\\n01:22:10 - Approval: October 2020 YECA Committee Minutes\\n01:22:45 - YECA Chair's Report\\n01:28:22 - Other YECA Business\\n\\n01:28:42 - Community Forum\\n01:30:03 - Motion to Adjourn",
            "lengthSeconds": "1:30:39"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "_sSUx8BIFOU",
            "fillerWordCount": {
                "uh": 129,
                "um": 255
            },
            "readTimeFullTranscript": "50 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "statue": 69,
                "statues": 33,
                "park": 27,
                "statute": 16,
                "police": 15,
                "history": 14,
                "officers": 14,
                "parks": 13,
                "land": 12,
                "department": 11
            },
            "wordCountSummary": {
                "statue": 24,
                "statues": 9,
                "history": 5,
                "place": 4,
                "statute": 4,
                "goal": 4,
                "exploration": 4,
                "parks": 3,
                "land": 3,
                "legacy": 3
            },
            "fullTranscript": "Okay, good evening, everybody I don't normally do this preamble, but tonight is a joint meeting of the parks and Recreation Committee and the youth Education and Cultural Affairs committee of Brooklyn community board. We are called to order. It is being recorded for public access and archiving in accordance with the New York State open meetings law. We try to recreate everything as closely to a live meeting as possible, so it is the practice of CB2 to conduct all of our remote meetings with all committee members. Cameras on public attendees are also encouraged to leave their cameras on, especially if you are acknowledged to speak this evening. Attendees microphones will be muted if you are not speaking to maintain appropriate discussion and voting process. The chair or the facilitator of each section will make it known when and which topics are open for comment. We see lots of new folks tonight. Welcome if you've never attended a community board meeting each section will have commentary first by committee members, then by board members at large and then the general public. If you have additional questions that fall outside of public commentary, please type your questions in the chat panel and we will address them as time permits and you can also email us at any time outside meetings. We always provide access for all of our neighbors, regardless of physical ability or limitation. If you require accommodation for full participation, please contact the district office 72 hours before any public meeting, and this evening no accommodations have been requested. So I wanted to acknowledge assistant district manager, Carol Ann Church is on the call. Could you say hello, please so that your face shows up on camera good evening. Everyone Idiom church is the staff liaison to the health environment and Social Services Committee and led by Brandon Smith and the transportation and public safety committee led by Juliette, Colin Chung, who has joined us tonight. So thank you. Miss church and Chair Colin Chung for bringing Victoria's group to this committee. The chairs of Yucca and Pnr will be acknowledged later, but next up is Meredith and we want to thank her so much for agreeing to document this entire proceeding for both committees and she's going to kick us off with roll call good evening. Everyone. This is Meredith Phillips Almeida I am the secretary of the youth, Education and Cultural Affairs Committee today, I'll be taking minutes for the joint meeting and I was asked to do roll call, so I will read off the list of names. I have for membership for each committee and if you could just unmute yourself and say here, I'll make sure you're noted as present in the minutes bar Braziler Granger. I'm here. Thank you, Andrew Lazavecki, you can't Candice Harrison was that here Candice Harrison, okay, Carolyn how to come and wear it. Leonard Levington, I'm here, hello, Jennifer, Melby, here Suzanne Quint here and Dwight Smith here: okay, that's the list of parks and Rec committee members that I had now move on to the Yucca Committee members, my name, I'm Candace Harrison and I'm a member of the parks and Rec committee got I got it. Thank you for thank you because I actually hear you say here. Thank you. Candace internet problems. I'm sorry, thank you! That's okay, Betty Fiber here and welcome to everyone. Dorothea Thompson-Manning, Alec, Duffy, Oscar, she's. Probably right did I miss anyone on the Yucca committee, because that's the list of members that I had I just received a note from Nick Ferreira and he should be joining us shortly. Okay, thank you. Oh actually, Meredith. Would you mind since you've just done a wonderful role? Could you actually take the to approve the agenda for tonight? Please do you mean call to ask for an approval? Yes, please does everyone have a copy of the agenda committee members for both committees? If you do, I would like to call for a motion to approve the agenda medicine to approve the agenda. Okay, I have Betty and a second Santiago. Thank you santia. Oh second, do I need a second from do I need a member from each committee, or is it okay that it's Betty and santia both from Yucca? That's great, okay, thank you. So much any discussion. Do we approve the agenda by consensus, or is this a vote, since this is just fine, okay, perfect, so I will know that we approve the agenda by consensus. Thank you. Everyone, thank you, so I think we're going to move on to our presentation then, and before we start I just remind everyone to please make sure you're muted, if you're, not speaking, we'd love to see your face, even if you're, just listening so again, I'm Barbara Zoller Gringer, the co-chair of the Parks Committee and I, want to welcome everyone to tonight's meeting. We're looking forward to an interesting discussion. Victoria I, don't know if you have any of your colleagues with you, I wasn't told who will be speaking as well as you, your music. Some of my group members are here, but it'll just be me presenting okay, so I want to welcome you. We have Victoria Vasquez from take down Columbus New York City. If you've never walked past the port on Montague and Court Street surrounding the courthouse is Columbus park and there is a statute of Christopher Columbus in the park. So we're all very interested to hear what Victoria has to say. So I'm going to turn this over to you. Thank you for being all right. Thank you for making time for our group to speak tonight. So again my name is Victoria. Can everyone see this presentation? Yes, I. Think okay I see some head nodding again. My name is Victoria and I'm a member of a group called take down: Columbus New York city, we're a group of community members with backgrounds in education, social work and mental health who, through weekly teach-ins and interactive presentations with the community, work to re-educate the community and the public on the complete identities of Columbus. Before we begin the presentation today, I would like to do a land acknowledgement, so the land that I'm going to be speaking to you about today originally was the Lenape Jokingland, the Lenape Homeland and the Lenape were the first people to live in New, York and Brooklyn before it was settled by europeans. We honor the Lenape past present and future and I say this as a reminder to the continued displacement of native peoples on this land and our ongoing commitment to dismantling the colonial legacy. So the narrative of Columbus often goes that he you know in 1492. He sailed the ocean blue that he was a lost child, a curious wanderer, taking on the noble and courageous task of discovering the new world. However, the truth is that Columbus was a capitalist through and through. He did not go into the new world to the curious lens, but with a goal to hunt and claim anything he could for material gain for nearly a decade, Columbus lobbied european monarchies to fund his voyage. She found a eastern Sea route to Asia in Portugal, England and France. The resounding answer was, all no experts told Columbus. His calculations were wrong and the voyage would take much longer than he expected royal advisers in Spain raised similar concerns to King Ferdinand and Queen Isabella, and it turns out the naysayers were right: Columbus dramatically underestimated the earth circumference and the size of the oceans, but luckily for him he ran into unchartered Americas between 1492 and 1504 Columbus completed four rounds for voyages between Spain and the new Americas Columbus also requested. He be made great admiral of the ocean appointed governor of any and all lands. He discovered and given one tenth of all revenue from those lands. A particularly repellent aspect of the slave trade was sexual as soon as the 1493 expedition got to the Caribbean before it even reached. Haiti Columbus was rewarding his lieutenants with native women to rape quote in a lumbas in a letter from Columbus to a friend in 1500, quote. 100 castellanos are as easily obtained for a woman as for farm, and it is very general, and there are plenty of dealers who go about looking for girls. Those from 9 to 10 are now in demand. Columbus did not find the gold he expected and his greed turned to selling cyeinos to fund his voyages. Austin Rep often presented as a product of his time. His actions enraged. The spanish monarchs the monarch's reluctance to enslave Diana's intensified and by 1499 when Queen Isabella learned of yet another arrival of slaves. She famously explained. Who is this Columbus, who dares to give out my vassals as slaves? Humanity during the time of Columbus knew that what he was doing was immoral and illegal and further evidence is in the writings of battalion De Las Casas was a friar and a monk who traveled with Columbus on his voyages, and he wrote. Columbus's men attacked the towns and spared neither the children nor the aged nor pregnant women, nor women in child bed not only stabbing them and dismembering them, but cutting them to pieces, as is dealing with sheep in the slaughterhouse. They laid bets as to who, with one stroke of the sword, could split a man in two or could cut off his head or spill out his entrails in a single stroke of the pike for these atrocities that are well documented and for many other things, colonists complained to the monarchy about Columbus and his mismanagement, and a royal commissioner was sent to Hispaniola in August of 1500 and brought Columbus back to Spain in chains. Although Columbus was stripped of his governorship King Ferdinand not only granted the explorer his freedom but subsidized. A fourth voyage stripped of his governorship Columbus, never received his 10 percent of profits from indigenous slave people, gold mining, child sex, labor or other profitable ventures in the new world. So that brings us to the statue in Columbus park that we have today. The history of the statue is that it was carved by Emma Stebbins in the late 1860s, the sister of the Then Park Board President, Henry Stebbins. It failed to make it into central park and it lingered in the central park maintenance yard until 1934, when officials installed it in Manhattan Chinatown. According to the Parks Department website in 1971, following the renaming of the southern part of Cadmium Plaza in honor of Columbus, the administration of Mayor John Lindsey installed. The statue at its current location, with support from the italian historical society of America and Columbus, is often touted as a symbol of italian-american pride and heritage. However, that is not a sentiment shared by all Italian-Americans. This photo was taken at a teach-in at Columbus circle on indigenous people's day, and this is a sign from one of our supporters called Control Colombo. Their group of italian-American New Yorkers, who advocate for the dismantling of Columbus statues throughout New, York City, and this is their website and a quote from their website is that Control Colombo believes Italian. Americans must reject Christopher Columbus to honor. His legacy in both name and illness is in likeness, is an affront to the dignity of all oppressed people and besides the fact that Columbus couldn't have been italian because Italy was informed as a nation during his lifetime that he did not discover a new nation. He never set foot in mainland USA and he did not reveal that the earth was round. He did not represent any of the values that we usually align in Christopher Columbus. Another startling fact is that we discovered at our teach-ins. There are four statues around the city of Columbus and we found that our teachings. There was a nearly 24 7 police attendance and surveillance, guarding the statues that sometimes three or more vehicles guarding a statue, and we would like to see the removal of these statues because it is not only offensive to the community of downtown Brooklyn, but it's also very costly to the police department and the taxpayer. Using information on New York City.Gov. We can safely assume, with a base salary of a police officer for one police officer to guard a Columbus statute is costing 14 to 28 thousand dollars a month per officer in October. I was able to attend the transportation and Public Safety committee meeting and we got to hear from the 84th Precinct captain Edelrana, and he was speaking to us about how the department was handling changes in budget and increased demand for officers in the face of protests, and he said when we only have limited resources. We want to make sure we concentrate those resources towards violent or feminine crimes. He talks about how challenging it was to balance those resources. When quote, we have to keep extra officers, let's say by Columbus, Park and Burrell Hall, because we want to make sure those facilities are safe, that eliminates those four or five officers. Let's say from patrolling Farragut or Dumbo or patrolling any other area. We can see that this is not in the best interest of public spending and is already costing our community a lot to maintain these statues. Luckily, there are plenty of other people that we can honor. Instead, our most urgent goal is to have the statue of Columbus removed from public space, but we would also like to take that opportunity to reimagine our public spaces to reflect those who have the ideals that we usually misalign with Columbus ideals such as courage, resilience, progress and cultural contribution. We understand that a new monument is a very intensive and costly process that must be carefully curated and we would not want to take on that endeavor without input from our community members, the Lenape Center of New, York and other cultural and artistic groups who have been impacted most by the legacy of Columbus and with that. What we are looking for next is a letter of introduction to the parks, Department and a letter of support from your committee to present a larger proposal to the city council, and that is our. We do not have a website as fancy as council. Columbus is, but we do have an instagram page and I will turn the meeting back over. Thank you. So we'll start with some questions, just making a note here start with members of the Parks Committee and the Yucca Committee. Are there any questions and please mute yourself if you're not talking, because someone's background we're hearing? Thank you committee members. Does anyone have a question? Ask her? Thank you. Can you hear me? Okay, yes, okay, I'm curious. Where, if removed the statue would be based, I think you know, adding historical context from this. If it were removed would be something that I think would be valuable, did sorry, meaning like logistically, where it would be moved or if we or would like, if it were to be moved to a different park. I don't know if that would be that wouldn't no I mean just logistically like what we do with this huge 20-foot tall statue. Good question: where do we put this? Maybe back in the maintenance yard? I, don't know if it's still there but the biggest question. We should look for that. Any other questions from committee members I have a quick question. Oh this is Candice all right, Candace go ahead. Yeah so I saw at the end of the presentation, like you had a picture of David Dinkins and he may be one of the people that would have a statue in place of the Columbus statue. Are there any other figures that you guys are looking at to have in place of the statue in place of Columbus so that process of replacing the statue we would want to make a bigger community question like we wouldn't want it to be all up to our group who we'd want to pick but I used David Jenkins as an example, since he's recently passed as far as living solid figures? No, we don't have anyone that we want to create a likeness of. We do definitely want to have that conversation with the Lenape Center of New York, and you know other descendants of african and indigenous people who they want to symbolize if they want us to be in the likeness of an individual or something more representative of the community. Thank you, so I have a couple of questions. Have you considered placing a plaque there with a lot of information, you're talking about Columbus and outlining some of the information you provided here and perhaps talking about the Sculptrix a bit? Have you thought about that? So there was a committee board put together by the mayor, I believe two years ago, where they reviewed Columbus statue and other figures throughout the city to determine whether they represent hate and should be taken down, and their conclusion was that more context should be added to the Columbus statue in the form of things like plaques and as far as I can tell it hasn't been added. I, don't think that would be in line with our group's goals. Yeah, adding more context to a monument that to a lot of people represents a lot of pain, wouldn't be appropriate in our group's eyes. So you haven't considered that no Miss Vasquez can you just say some of the committee. You just mentioned again that arrived at that conclusion. I'm sorry I just wanted to get that in the notes and I missed it. No, it's! Okay! I! Have it on one of my questions. That's the mayor's committee I have to find a I can send it to the pdf, but it was put together by bill De Blasio. Okay, thank you. You're welcome it's online as a pdf. At that time. That committee did not recommend that Columbus statutes be taken down right or any statutes. No, they recommended that they specifically were reviewing the statue in Columbus circle and they their recommendation for imagery like that, and that specific statue was to add more context and you're also proposing changing the name of the park right. That would be yes and have you considered, you know renaming it after Ruth, Bader Ginsburg. Is that someone you would consider as a personal choice? I don't see that being a problem, but it wouldn't be up to me as an individual or even solely our group. That would be something we want to involve the community on, but we could certainly nominate her as a suggestion and have you considered where the funding would come for a new statute? Not yet our group has had success, crowd, funding, there's a lot of petitions and a lot of other groups who oppose the imagery of Columbus. So we've had success, crowdfunding for our own educational endeavors and we would hope for the financial support from other artistic and educational institutions, but we haven't found any funders for that process yet, and we know that takes a lot of time and a lot of consideration, but we also don't want to wait till. We have a solid, perfect plan to remove the Columbus statue before we have a perfectly created new statute. So are there any thank you for that by the way any Dwight, so Victoria I'd like to understand better what exactly the letter of support would you're asking for given the generalizations were here. Are you suggesting that the letters support? What exactly is it that yeah that'll help me understand what it is? You know we're being asked specifically, I'm sorry. Did you see that last part trying to understand what specifically your group would be asking of the committees in terms of support for what the concept of changing the concept of removing and replacing the statute along with renaming of the park? Yes, that would be ideal and also you know, I want to know what you're asking for that. This is my supposition I trying to understand from what I'm hearing from you. So, but what exactly? Is it that you, your group, would wish for us to do? We would wish for a letter of introduction to the Parks Department, considering it's their statue and if this were to get to a larger city council vote about the removal of the statue, if we would have your support in that vote, but in the so those are two different things in the first instance, you want to talk to the folks at the Parks, Department, correct, yeah and then you'll make your case to those people. Yes, okay, thank you. Samantha, hello, I have a couple of questions in light of the demands in regards to the statue just a little bit of context as well. The work of removing and decolonizing statues have been going on for a few years, one being Theodore Roosevelt, I'm at the vet and also Marion Sims in central park. So I appreciate you guys doing the work for Christopher Columbus as well and removing that statue. But my question is: when you say, for instance, you do get a lot of support and you are moving forward to City Council. Are there additional demands that you may have outside of just renaming a park and also what are your techniques and reaching out to community members to provide space for renaming a park? Are you guys also looking at budgetary things, because you mentioned fourteen thousand dollars to twenty thousand dollars for NYPD? Are you also looking at goals for reallocating funds for the removal, I'm just trying to get a better context of what is the end goal, or are you going to continue a movement for some other statues, so our end goal would be eventually all of the statues in New York City. So we're not looking at real allocating funds that the police department are spending at this time and theoretically, if we remove the statues, then that funding wouldn't have to be spent guarding a statue could be better spent fighting crime, so that would be our only goal is first primary goal: removing the statues that is our goal and then initiating a process to rename the park and have a new statue put up our main way of getting the community engaged right now is through a lot of social media through our and our coalition building. So we put out, you know, advertisements for when we're having a teach-in and ways that people can invite other people and if they can attend how they can see it online and that's how we do most of our coalition building is through social media. So that get all of your questions geared to the Columbus statute here in Columbus park. Is there no other agenda, no other statutes anywhere in the city that you are concerned about work? There are four other statues in New York and we would eventually like to have those taken down as well. I'm sorry what other statues there's a statue in every borough except Staten, Island, there's a large bust in the Bronx, and then there are four other Columbus statues which we would you're saying these. There are four statues of Columbus that you would like to see removed and that's the only goal of your committee. Yes, okay, thank you! Suzanne did you have a question: you're, muted, Suzanne, Barbara hi. My question was just around Victoria the committee and how it was formed and also if you can give any more info on the committee, the mayor's committee and how that was initiated and if there was any consideration to having the other Columbus statues in consideration with that discussion. If you know that so that's the case, were you asking about how our takedown Columbus was formed or how the first house yeah first how takedown Columbus was formed? What's the background and if you could just talk about the membership and the number of people you have actively working with you just to give us some color on the support and then my second question was about the committee, the mayor's task force or whatever. We might call it just where that came from and if there was or wasn't to your knowledge, a reason why Columbus park and arbor wasn't included in that discussion. So our takedown Columbus was started by a teacher named Axel who put out a call to on his social media page asking if anyone would be interested in doing a teach-in at a Columbus statue, and we all got together on zoom and we came up with a curriculum and we had posters made and we had a really great turnout for our first I. Think for our first one we had like 40 people show up and we it was at the Columbus statue in downtown Brooklyn in front of the Supreme Court building and then from there. We did a little tour around the city. We did one for the Brooklyn library, one in front of the statue in the Bronx, and you know we had a lot of really great public turnout. The mayor's commission for the review of symbols of hate, which is the language that is used in the report, was that it was I believe right after the killings in Charlottesville over a white supremacist monument that sparked protests and counter protests and the young woman died. So there was a lot of push in New York City at that time to review our own symbolism and images that I believe only a handful of images were picked just because there would probably be hundreds of monuments on that list, and so committee was formed and they would have open discussions with the community, and then it was a review board of different professionals who would come up with a recommendation for the mayor and some images were removed, I believe a statue of a gynecologist who experimented on insulated african-american women was removed, but the Columbus statue in Columbus circle. They their suggestion was that it remained, but with more context, that report is available online as a pdf. I'm sorry I, don't have it now. So this Columbus statue that we're specifically talking about in downtown Brooklyn was not in that report. Just the one in Columbus circle- and I'm sorry, was there another question after that, one okay, but this specific statue does have you know going back at least five years. You know four or five petitions on this one alone to have it taken down. So this is you know. Columbus is a controversial image. Is you know a very long history of it in the city, so I just wanted to follow up on Suzanne's question and then we'll go to Betty. She had asked you how many people are in the group at the moment, I was wondering if you could hold on to that. We have about 10 group members. Thank you teddy yeah. Thank you. I want to thank Miss Vasquez for whatever our presentation and the time and energy, especially in involving young people in this issue. I'm wondering if, through your group, there's been specific outreach to the italian american community, because amongst many people in that community, it's a symbol of ethnic and pride in being italian-american, which, as you've noted and the history notes, might not be entirely correct, but it does symbolize a pride and many groups have their own people that they revere or days that they celebrate in terms of their own community. So what has been your dialogue? If any? With the italian american community, we haven't targeted the italian-american community for outreach, it's not our objective to convince them, or you know woo them to our teach-ins. Our teachings are open to the public and we encourage anyone and everyone to come. Our engagement with Consort Colombo, the italian American Group, has been very pleasant, but we have not gone out to petition the italian American Community. Thank you, Andrew did you Barbara? Did you hear me? Yes, I wanted to. You know voice the same idea that 35 was the voice because I think it's a necessary part of the discussion just because a group of us met here at this meeting is not sufficient. For me to say: I am all for taking down the statute. I really would welcome a little more academic discussion on this whole. Subject: I, you know what you presented I find extremely informative. I will do my own research further on this I really appreciate for you bringing this out to at least my attention, but I think as long as I'm one of the people that also find it. You know interesting to heard more I think a very broad community has to take part in this discussion. This could not be just you know. We got together after a year in a group meeting of 15 or 20 people in a room, and this is our proposal to take down the statue. I think this needs a lot of serious discussion, whether you know whether that statue deserves to stand there or not, but it's been there since I guess what the 30s we're talking about over 50 years, 70 94, thirty-four, it's a serious part of our life and yes, although it maybe should be considered for taking down but I, think the discussion has to be a little bit more broader. In order to fully you know, let you know completely get to the bottom of this. I can't say that the reason I'm saying this is because I disagree with what you're saying I don't I am you know absolutely shocked that you know of the things I've learned from you. I will absolutely do my own villages to study more and that just regards to that I wanted to study him more. But you know it's not only the Italians that might be offended. It might be also the spanish people of Spain that might find this objectionable and I. Don't think we need to create a you know just willy-nilly, a discussion that we might regret in the future. Yes, we, you know the discussion of where the statue would go. It's not for us to decide I think if it's a parks, department, issue or thing they'll find a place where to hide it for, like I, think, 50 years or 60 years. They hit four eagles from us somewhere in some location until it was time to celebrate 14th park and they brought one of the Eagles back. The other three are still hidden somewhere in Parks Department's warehouse in some way. So you know that shouldn't be a discussion of where we're going to put the park where it's going to cost who's going to put up the money. I think the final discussion about the money who replaces with that comes next. The first I think is a very serious discussion in the community in Brooklyn among people that, yes, we would like to quietly decommission. This statue is that the first time there have been other statues in various other parts that are standing there and nobody even knows why they're standing here I mean we walk through other parts, and you can ask yourself: why is this here? Nobody knows so I. Just that's enough for me. Thank you. Anyone else from Yucca have a question: Suzanne, you're, muted, so I agree with almost everything that Andrew said. I'm just wondering if we want to be on board with requesting an exploration into the statue, I, don't think any of us is prepared to say it. Should it shouldn't. You know be there, but should there be a similar exploration that took place several years ago and co-op for the Columbus circle that should take place for this statue, where the different groups are consulted, I'm not completely clear on whose domain the statue is it the parts department's domain is that how it works that, if the statute's in their park it's their domain, but do we want to request that they host an exploration into this is Quint, that's correct! It is a ultimately a parks, Department decision, Mr Paris did share that the parks Department was invited to attend or to send a representative on three occasions. They declined to attend, although I believe Miss Andrea Keyes is on the call. If she'd like to speak up, I am on the phone right now and, as I mentioned earlier, I am taking all the notes for Commission Ammar in the morning and I guess: he'll contact, Mr, Paris or Ms Church and about his decision or the commissioner's decision. Are there any questions from community Board members Barbara just one other thing is that I just really would like to get a little bit more of a clarification because I don't think that we, you know, maybe this particular half a year or whatever there were officers in and around that area, but in other times I have not seen three or four officers sitting there. Guarding the statue I mean- and this is you know- I've been getting out of that. Subway stop many times and walking over through Columbus park over to the bus stations where the B-38 is, and you could speak before as well across J Street, so I've never run across any three or four officers sitting in the park in the evening correct you know protecting that I would have welcomed they be there because sometimes late at night, I would have felt a little bit uncomfortable, but I have never seen even a patrol car or three or four officers sitting there. So I really would love to quiz the powers that be at the precinct to tell us exactly what they're doing as far as the police officers in the park or in that general area, to get a definition of what exactly those officers or whatever officers are there. So we don't confuse the numbers because I don't think it's going to be. You know the removal or the desire to remove this station should not be about that there's three or four officers just sitting involving that it's not a factual presentation, not that you know your volume is quite low. I could address Mr, Lastrowski's question. If you'd like all right, I'm sorry about that is that better, yes, okay, I believe the local precinct was invited for this evening. I do not believe someone is here from the precinct all right. Dwight do you have a quick question and then I want to give Juliet an opportunity. Oh yeah I just wanted to comment on what Andrew had said. Is that certainly, when I passed by the today four-ish, there were two officers in their there now, whether they were specifically there for the statute, which does have a little chain link around the fence itself, but there were two officers there. When I passed by today, right I can volunteer that I did ask an officer in the park not too long ago. If he was there to guard the statute and his response was basically what statute I know. Other people have had other responses, but that was basically the response. I received all right, so thank you for the questions. I want to turn it over now to Juliet. You had a question or your hand was raised. Thank you. I just wanted to say that Miss Vasquez did come over to our committee meeting and discuss the police presence at the statues and I. We referred her over to your collective meetings, where I think this discussion has been really thorough and appropriate. I just wanted to add that, like from a personal perspective, our commit our I can't represent the whole committee, because we didn't vote on it, but I would say that from a social justice perspective, I would support what Miss Quint had suggested, which would be the exploration and the further discussion of the possibility of removing the statue. I do think. Unlike Mr Lastoweki and Miss Fryebush had suggested more outreach to particular communities, especially the italian-american community, and more public engagement is probably the best idea, because this is a much larger issue. As a student of anthropology myself. Personally, I've read Columbus's Journal and I've. The journal is really explicit on how, in the first few pages of the of his experience of coming to the new world, where he approaches the native american culture as the noble savage that people have sometimes referred to them as and then later on, completely dehumanizes them in order to exploit them as Miss Vasquez has depicted in the presentation today and it's something that is the truth. That I think more people really need to know about. I find it surprising that some people don't already know about that, but the discussion I think, will enlighten more people. So that would be something that I support. Thank you. Okay. Are there any other community board members who want to ask a question at this point and I: don't know that I see everyone, but I don't I. Never did you want to ask a question sure just real quick, Ms Vasquez just curious where the information came about the police and the you know the cost and them guarding it just where you were able to hear that from the number of police. Guarding statue was our own observation, and that was me speaking cumulatively about all of the statues we attended. So maybe the one in front of the Supreme Court building does only just have one patrol car, but we've been to other statues that have had three plus patrol cars. Maybe part of that was that they were you know, put on by our appearance at the statue, so the number of cars is based on our own observation. We have plenty of pictures of our teachings with police cars in the background and the calculations of how much it cost per month was just simple math using the police salary that was on the New York City.Gov website. Okay, great I, appreciate that and I guess, just personal comment: I just personally support this I. Don't think that I think statues are a representation of our values and it's quite clear if we know the real history here, which is real. This is not a value of probably anybody here. So I do not support further exploration. If that means we have to convince people to remove statues that represent oppression. I'm not interested in that personally. This is Dorothea, I'd like to say something to Ms Vasquez I understand that she said she observed police cars, but did that necessarily mean that they were guarding the statue or did it just mean that they were in or that's where they parked their cars? How do we know that this is exactly what their job was protecting this statue? That's what I would like to know. I guess we would have to definitely ask them ourselves, but from the proximity of their car being a few feet from the statue and how they interacted with our group. As we were performing and teaching at the statue, it appeared to us that they were there to get between us and the statue and based on the you know, I don't want to put words in anyone's mouth, but certainly if we watch the video from the community board meeting the Public Transportation one Captain Nadio Rana does state that he does have to lose four or five officers from doing other police work. In order to go to you know, Columbus park or the park place, I, don't know. I guess I would just want to know that is exactly what they were doing and not the fact that they were there. Maybe they stopped people from interacting because they were just there and they didn't want any problems, because we know that certain statues, certain things, do cause people to get a little upset and they start to interact in a way they shouldn't. But I'm just saying just listening to you I, I'm not disagreeing with whatever else was said, I missed a lot of the meeting, but I know the history of Christopher Columbus, but just to hear you say that you saw a cards park there. I don't find that convincing enough reason without us having some type proof. That's all I want to say. Thank you. Oh thank you Meredith. Can you hear me? I'm unmuted right, I want to echo what Mr Ferreira said and thank you for his comments. I agree that I'm also not particularly interested in further exploration and to quote Nick. If we, if this requires us convincing people that we have to remove symbols of oppression, that's not something I'm I think is necessary and I think you know I. Also wonder if we can put aside the conversation about what it costs for police to guard the statue, because I think that's not even germane to this conversation. I, don't think we're here to make a decision based on whether we're utilizing a public resource efficiently or not, because we could have a million meetings about how we spend all kinds of dollars when we do that, we have conversations about that, but that's not really what it's about so it doesn't seem like. We have to continue to belabor that point and whether TD NYC has accurate numbers or not. I mean to me personally: it's not important if there are zero dollars spent guarding the statues. That's not really why I feel like we're here to have the discussion. Thank you, chairs, I. Think. Maybe again, my understanding from what I read is. That is one of the reasons, not maybe the main reason, but one of the reasons that this was brought to our you know for us to make a decision not only about the what was going on with Christopher Columbus and the atrocities, but also because of the dollars that were wasted because of police guarding this the statues. So, whereas I hear you say it's maybe not germane to the conversation, it is part of what was presented. So I'm not saying that's what you have to make a decision on, but I don't think we should just toss it aside, because that is part of what was brought up. It was the cost and the atrocities. It was a little bit of everything. That's it! Thank you. Yeah I just wanted to try to clarify what I heard was that before we foreign action was taken. You really should hear from all the parties I mean there may be things that we, you know were presented with one set of information, and there may be more information out there that we should consider and give people an opportunity to express, reaching out to different groups in the neighborhood, rather than just listening to one group representing 10 people with one side of the presentation, whether or not it's the only one or not, we should have other people have the opportunity to weigh in as well right anyway. Is there anyone now who's, not a community board member but is attending the meeting and would like to ask a question we'll open the floor. Chair Zoller Gringer I've been keeping a running list. The first person. Oh great question, no problem. The first person that requested is Lisa Ackerman, just a reminder that everyone is welcome and encouraged to speak. Just message me in the chat or raise your hand electronically. You do have two minutes and we are being recorded so Lisa Ackerman. The floor is yours: hi, I'm Lisa, Ackerman, I am and completely in agreement that public monuments need to represent public sentiment and public sentiment can change over time and I think whether monuments stay or go it does have to be a larger community discussion and I am not going to argue that Columbus was a nice person or didn't do all the things that have been discussed. I think the one thing that should be remembered if a statue does come down is how do we record some pieces of history that might be important to understand, and the mania for Columbus came out of the post-civil war desire to create healing bombs for the country, and rightly or wrongly, they went back to the colonial era and, in the case of Columbus, went back even farther. So this mania for Columbus really was all about post-civil war, late, 19th, century America and trying to create universal themes and the ramp up to the 400th anniversary of Columbus's voyages is kind of what fueled all of this and Italians walked into this. They did not pick Columbus as their symbol, literally in the most simplified way. The mass immigration of Italians to this country happened in that moment they were horribly persecuted, as all immigrant groups have been over time, and so they really looked around and it was like well, they like Columbus, he's italian, we're italian, let's hitch our wagon there, so I mean I. Think that you know whatever decisions are made. There are pieces of history that we still want to figure out how to memorialize and that's not glorifying Columbus, but it's looking at historical moments and italian Americans are still 10 of the greater New York Metro area population. So in some way you still want to understand how to represent that piece of it, even if not all Italians take Columbus as their symbol. It still was a moment in time that we don't necessarily want to forget and that's all I had to say. Thank you Lisa next on the list is Malcolm Hill, but I believe he may have left. The meeting his hand went up very early Malcolm Hill. Are you still with us? Okay, we'll come back to you. How about Margot, Finkel, hi I first just want to say I, think that this idea about opening things up for more exploration and to hear from italian Americans is guided. I think that this meeting right now is a public meeting where italian Americans can show up and talk about the importance of that statute to them if they want, if they're not here and the rest of us are in agreement, that statue is disgraceful. I think we can go with that. This was a public meeting, I'm not involved with the community board, but I found out about it. I think that you know we're hearing from people on this meeting that they didn't know about the atrocities that Columbus committed and part of the reason for that is because he's been normalized as the hero because of statues like the woman, a few blocks from where I live. The statue that we're talking about I think that it's a problem we're all disgusted thinking about the you know not just oppression that Columbus committed, but the genocide that he enacted. I didn't know that statue was there. I lived just a couple blocks away and now I do know what it is and I'm disgusted I think it should come down and I think that the comment from Melissa Litwin in the chat is really all we need. I mean I'm not an indigenous person I and I'm still upset when I see that statue and just to know that we have community members who see that statue as a symbol of their oppression and have to walk by it is unacceptable. We can make a plaque about the history of the statute. We can put it in a museum. There are lots of ways to preserve history without having a symbol of genocide. You know that people have to see as part of their commute every morning, genocide against their community, their family. So thanks so much I hope we can support this initiative with a letter. Thank you. Margo and attendance is involvement, so you're involved. Now the next person on the list is Ryan Dubois. Is he still with us Ryan? Yes, I'm with you. Can you hear me? Yes, we can hear you, okay, thank you. So much yeah I had to put some comments in the chat box just because I wasn't sure how quickly I would have the opportunity to speak. So I'm glad I am able to speak now. So I'll just reiterate what I said in the chat. Basically I want to. Second many of the sentiments that have been expressed here. I think you know we're in a moment of national truth and reconciliation and questioning Columbus. The narrative and symbolism of Columbus is a really necessary and important part of that process. Myself speaking as an italian-american I do not feel that Columbus accurately represents italian heritage or the immigrant experience of Italians in New York, and it's unquestionable that you know it's historical record that he was the pioneer of a hemispheric, wide genocide and so I think you know the presence of this statue. It is unfortunate, it is disgraceful and so I just wanted to express my personal sentiment that I do support it. Coming down. I support all Columbus statues coming down I support Columbus day becoming indigenous people's day and I want to thank everyone who has expressed similar sentiments tonight. Thank you. Okay. Next is Melissa Litwin I just wanted to pause, I believe Board member Samantha Johnson had her hand up. Did you want to say something? I will just make it short and I agree with most of the sentiments of my board members. In regards to not wanting to go to more detail about information, there's, google, we can find that out. We've been talking about Columbus for many years now and having a debate and as I mentioned in my earlier comments, there have been multiple statues that have been removed and the statue that was in central park for the individual who's supposed to be the founder for gynecology for the mutilation of black and brown. Women has been removed and it took eight years unfortunately, but it got done so I think that historically we are reviewing statues for pride instances and not necessarily for the actual advocacy for black and brown people, so I do I. Would love to support this letter just to get it moving. I mean that the conversation can be started to be more intentional about how we were representing black and brown people and indigenous folk in our land. So I just want to say that thank you, Ms Johnson, Mr Duffy from the board would also like to make a comment. Hi yeah I just wanted to weigh in myself and share that I feel the same way. Sam and other members around this. You know I looked it up and the journals of Christopher Columbus where a lot of this information about his own perpetrated genocide is. It was first translated in English in 1827, so we've had plenty of time to digest and thoroughly understand the extent of the damage that he did to the people that were living here prior to the arrival of Europeans and I know. I have a very strong feeling that in 10 years all Columbus statues will be gone just the way that things are developing in our country, and so our question now is what role do we want to play in that history when people are looking back 10 years? Ten years from now when they're? Looking back, you know we have an opportunity to play a role in this and to be part of the education and I support any way. We can support this movement and this effort I, would advocate for thank you so much Mr Duffy, okay, back to public commentary, we have Melissa. Litwin is Melissa still with us. Well miss Litwin you're, you look, it looks like you're unmuted, but we can't hear you so you might need to try to call in we'll circle back to you. Next up is Brian Lange hi. Can you guys hear me? Yes, hi I just introduced myself, I'm a resident public member CUNY student I just wanted to thank Miss Velasquez for thank you for her time and for educating us. Of course. You know this is very important. Educating others I also really appreciate you. The tenacity of your mission. You know sitting here and answering all of our questions and most of all, I really appreciate your land. Acknowledgement. I. Think that's something! That's much too rare. I think that's something that everybody in our community and our government should really be acknowledging that we're we all live and love and enjoy stolen land so that that's something that I think we all really need to recognize and I have a question. I, don't know! If that's okay, to ask a question, but basically I just want to know, do you know of any contacts that the mayor or any city agencies have with Lenape leadership? Is there any communication or is it just? Is there a lack thereof? I have no idea if the mayor's talking to the Lenape Center or any indigenous groups in New York, okay, so it seems so sorry I would say I hope there is I hope there isn't I just don't know, but I wouldn't know. Okay. Thank you so much. Thank you. Next on the list is Carly Schleider, I hope. I'm saying your name right. Carly is Carly. Okay, we'll come back to is George no I, just typed my comments into the chat box and pretty much what I think nothing else had. Thank you. You're welcome to speak that a lot if you'd like it on the recording, otherwise, no okay, I just wrote that I wanted to echo comments about not wanting to open up this further exploration into the context of Christopher Columbus, especially in relationship to how we could possibly put that in connection with the statue as it stands now, and that the statue to me just represent genocide and, as such, has no place in the city. That's it! Thank you. Carly is George Scott still on the call yeah, okay. Yes, how are you doing so? First I just want to thank Victoria for a tremendous presentation. I've been satisfied. Awesome I want to thank everybody for giving us the time in the Florida actually speak about. This is super important. I am native american and black. On my father's side, I am latino. On my mother's side, I am a brooklynite who has to do jury duty at that courthouse and I know. The courthouse in the park are separate. I understand that, but I have to go and serve justice in a building that right in front of it, has a criminal, a historically awful criminal. It is triggering every time I walk by it now. I understand that we may want the italian-american community and that's fine, but are we also going to have a conversation with the Lenape Community with the other tribes from New York, like my tribe, with black and brown folks, who view that man in the same life Hitler? That's not an exaggeration, so I hear that we want to have further decisions. I, don't think that discussion is warranted, the history textbooks be for itself. But if we're going to have that conversation, my question now becomes. Is that going to be inclusive of all the parties involved? Are we just worried about upsetting, potentially spaniard, Americans or italian Americans, because there's a lot of other people who are super upset with Columbus? Thank you. Mr Scott Next is Daniel Raymond hello. Can you guys hear me we can hear you hi how you doing my name is Dan Raymond I actually work for the fire department as a fire inspector. I'm here speaking in a personal capacity, but I just want to kind of like let you guys know that the narrative of who you know the type of people who are opposed to Columbus is not what it seems in reality. So I just want to say a few words I try to keep it under two minutes, but my family's been here in New, York City for 120 years. My grandmother's side of the family is the Kiarelli family from a place called Castro Filippo in Sicily, not to exclude northerners, but a vast majority of italian New Yorkers are from Sicily or Southern Italy. When we came here, we had nothing and my gran. My great grandfather made a living as a street vendor. My grandfather was a construction worker. My grandma worked as a union worked a union job in an office. My father was a New York, City Firefighter and my mother cut hair and still does overwhelmingly our history here in New. York is a history of working people in 2020. Knowing what we know about Columbus, who was supposedly from what is now known as Northern Italy, sailed under the spanish crown and committed all these atrocities against the indigenous population when he arrived, how is it that we can tie our legacy history or anything about our existence? To him? One day, I was told that Columbus was the representative of my people. He was chosen as an italian-american symbol, but he essentially represents nothing about our collective experience as human beings working for a living in New, York City for the last hundred years. I would welcome the statues being taken down and contrary to how we're represented in the press, hundreds of thousands of other italian New Yorkers of all generations agree a majority of my family agrees and we're not unique. We're being falsely represented. Just take it down, doesn't matter what we do with it, who we replace it with are the minute details of you know. We don't want a plaque, the details, don't matter, we want it down. That's all. Thank you. Mr Raymond next is Malcolm Hill, no I, don't think we've got him Emily Engelhardt hi is my sound working. Yes, okay, hi, my name is Emily Englehart I live in park slope. I've also done jury duty in that court and whizzed right by that statue, without looking at it like every other statue right, but that's my privilege to not have to look around and wonder if I'm being subjugated right there. On top of me, man I was getting really steamed up at the beginning of this meeting. With the really my new questions, I was hearing, I mean okay. Somebody mentioned that they wanted to know in more intellectual reasons, to take the statue down, which is just like weird, because I don't think anyone has ever made and put up a statue for intellectual reasons, I think they do it purely emotionally. This man discovered America, quote unquote for anyone who can't see me, so he gets many huge statues of his face and body. For some reason, that's not intellectual. That is an emotional thing, so I think it makes perfect sense to take it down for just as emotional of a reason, which is the rape terror, plunding obliteration of a whole group of people who rightly own this land over us. Geez I think I just got really steamed up and ahead of myself. I had so many other things, I wanted to say, but then I started listening to some people, yeah I, don't think it needs to go into a museum afterwards, I think take it down. I, don't think we need to store it. I think we can destroy it. I, don't think it make here's the other thing, putting up a plaque to explain the historical context of this statue. Okay, so what's the plot gonna say: I murdered, I raped children I tried to get rid of a whole land of people so that I can own land that wasn't mine and here's. What I look like I, don't understand how that helps anybody. You can read that, like someone else mentioned anywhere on the internet, the actual truth just take the statue down. It doesn't need an explanation, no more exploration on this topic. Please just agree to write a letter for this amazing woman who has put all this information together for us I think a little unnecessarily, because so many of these things are obvious truths. So that's my piece. Thank you. Miss Uncle, Hart, okay, last call for we're, trying Malcolm Hill again and then Melissa Litwin and then I see Nick Ferreira Melissa Litwin. Are you still here? Okay, welcome, I think we might have lost those two Mr Ferreira yeah I. Just last comment: I wanted to say, I. Think if you know, if we're interested in a conversation, I think nothing will start a conversation quicker than the removal of the statue. So I think that would be the great conversation. Okay I see two more hands. Thank you! Mr Ferreira I, I'm sorry, I missed you the first time Kanesha trained him Cooper hi! Yes, my name is Kenisha Traynham Cooper. Thank you for this amazing, informative discussion. I'm actually the mayor's action plan engagement coordinator over in Ingosol nature development. So this is my first time coming here, but I wanted to just I've heard a lot of information and I've also I resonate with a lot of people who are on this call I understand where a lot of people, my including by the way, will like this to be taken down, but is anything that we can do to prevent it from happening again from going up again or anything else that can prevent either statues or any type of resemblance to go up anywhere. Is that possible? Oh, is that I think that's like a Larkin, my immune. It's like a larger, maybe theoretical question about the community. Conscious I, think I mean we're a group of educators. We don't you know we didn't go around trying to tie ropes to the statues. We think it is important that before we ask people to do something, you know say no, why and I. So as far as taking the statue down I, don't think we need I, don't think we need to engage the public since it's already been engaged so many more times in a debate when they don't even have the information first. So I would love to see the statute taken down and not quietly. There should be an announcement about it. People should know why, and they should know what the new image is going to represent on. Why we're taking it down, we can do both at the same time, we can educate people and not have to wait to take the statue down to do it. The taking of this after that can be part of the re-education, but I think you know changing the narrative is what our real goal is. You know it's deeper, obviously than the marble so I think changing the narrative talking about these things openly is really what's going to change it in the long run. Are you muted here I think you muted? Do you think you beat me to it? Was Mr Luckett? Thank you. Yeah sorry, I was hoping to wrap up and actually I was gonna motion to move to a vote on this, but thank you yeah. Of course, yeah I just want to echo what a lot of people have already said. You know I don't want to really beat a dead horse on this, but I. Think from my standpoint. How I look at this is that CB2 is a public body and is a body that represents the community in the same way that a statue on public land is, it implies, support and implies whether or not there's public dollars going to it implies an unequivocal support of whoever the statue is of so yes, I, agree, I, don't think we should let this issue get mired in the bureaucracy of public polling I. Think we have the real opportunity to act on this and I think you know whether or not what happens to the statue is. You know a whole another question, but I think it standing on public ground. Is you know? Yes, a support and it indicates you know I. Think inaction on the part of this board would indicate support as well. So with that I'll move to a motion to vote on the issue of I get was it writing? We can get the exact wording but write a letter of support to the department of parks and recreation. All right. Well, is that so your motion is that we write a letter to the department of parts in support of taking down the statute. Yes, sorry I have two motions. One is letter of support to. Yes, the introduction to the parts of department of parks and recreation, as well as a letter of support for the city council. I, don't know that we can introduce Tia. Maybe you know more than I, don't think we can introduce this group to the parks, Department I, don't think that's our role. I think they can reach out to the parks department directly as anybody could. But if your motion is as I hear, it is to write a letter to the Parks department in support of removing this statute. Is that what your emotion is? Yes, okay! Is there a second to that motion was that Sam yep? Thank you Sam! Are we just raising our hands or how are we going to do this? A roll call would probably be helpful. Meredith I'd be happy to do that. If you like. Thank you yeah. That would be I mean I. Don't need to note. Would you like me to note a roll call in the minutes or just the total, but just the totals as we would for a land use? Okay? No! That's so land, oh okay, you're! Just having the overall vote you're, not putting people's names down! That's right! The question is okay, but it's just hard because the name to make it easier but I can't see everyone I. Don't I've been trying to figure out how to see more people, but I can only see like four or five people across the bottom. So I won't be able to count if people wow no problem, I gotcha, Barbara Zahlergringer. How do you vote abstain, Andrew, Lester? How do you vote Andrew, Abstain, Miss Harrison? How do you vote I support the letter? Carolyn Hubbard comment on Mary. How do you vote I support the letter? Also Leonard Levington I abstain, Jennifer Melby. How do you vote? I'm gonna abstain, Suzanne, Quinn, I support the letter, White Smith, oh you're, muted, Mr, Smith, you're, muted, you Dwight me now. Yes, okay, yes, Phil! I'm I support the letter chair five Bush. How do you vote sorry? I didn't hear Mister Reservations Smith is a yes with reservations. Chair five shady vote. I support the letter, Ms Dorothea Thompson Manning Vice chair. How do you vote we're? Staying Ms, Phillips almed up his secretary? How do you vote yes, Mr Alec Duffy I vote. Yes, Mr Nicholas Ferreira there he is Ms Sam Johnson, favor, Mr Luckett I vote. Yes there. Where is there? Is this Miss Santiago I vote yes and Mr Eric Sproul, who I believe was joining us by phone Mr Sprole on the line? Okay, so that would be five abstain, one absent eleven, yes and zero. No, so it does pass that's what I got as well 1105. Thank you, everyone for being so involved. Thank you, miss bespoke for the presentation. We appreciate you point of order, may I speak I just had a question because the this I think the second part of the request was to something regarding the city council is that already is that unfolded into this request? Have we I'm just checking on the status of that section? I, don't I think the letter of support is good and that if we make it to the city council, we could revisit it got it. Thank you, Taya. Do you know offhand? Is this then, going to the board for a vote? The full board, Betty you're, a mute? That's what happens! I! Don't normally talk so much on meetings. Yes, that's correct, and the next General board meeting is this Wednesday, so if you're interested in this topic, that would be the next one to follow this Wednesday. Thank you all right. Thank you again, Victoria for being here and presenting we're moving on now to the business of the different committees. I feel like I've talked enough here. I, don't really have a chairs person's report for this evening. I'll go to the approval of our minutes. Everybody receives some edits to the minutes today and since nobody commented on them, I'm going to assume that the edits are accepted. So can I get a consensus to approve our minutes from the November meeting. Okay, all right looks good, Andrew you're supposed to ask or report if there is any other parks on business you're listed on the agenda here about any other parks and recreation, business, you're, muted, now no I, don't think to report or okay. So Betty, I'm going to turn this over to you now. Thank you. Finally, okay, no worries, thank you, okay, so the first our first item of business is the approval of the minutes of October of this year. As you know, we didn't meet in November, so we're up to approving October the minutes were sent. Is there any discussion objection edit hearing? None can we say the minutes were approved by consensus. Yeah, okay, I see a few thumbs up. Thank you, okay and then we have the chairs report. So, very briefly, I've been talking on and off about the district, 15 par, which is a participatory action, research project that they have engaged in to look at zoning in for the elementary schools in what they call Sub district three c, which involves two of the schools in our area, and they reported out to the district 15 community November 17th I will send a link to the office and maybe Taya can send the copy of the transcript. It was a long meeting. It was over an hour, so I just want to summarize it very briefly, but people can listen to it. It's actually quite informative. Initially we thought the discussion and consideration would be. Do we have like an open zone so that children who would be applying for kindergarten, could go to any school in that area or would they change the addresses? So if you live in this street, this house you're zoned for a specific school. So that was the basic issue and, like anything else, the more people discuss and explore they're not looking at it they're no longer looking at it that way, they're really talking about. How do we make our schools inclusive for all children? How do we move resources, pedagogy curriculum and school practices toward inclusiveness and anti-racism so they're, looking at it kind of in a broader way than where do you live, and where should you go so I as this issue unfolds now those recommendations are going to the DOE office of Zoning and they will then come up with a proposal and a timeline. The goal initially was that by the time the children start applying for kindergarten for next September that there would be a notion. Are they applying based on the address or are they applying to any of the schools in the area? So before I give my district 13 report? Are there any very brief questions? Did I make any sense? It's kind of hard to explain. Is there? Are there any questions here? Alec did you have a question? I'm sorry, I realized I was unmuted because earlier I just wanted to tell today that her she's screen cheering right now, just in case she pops over to Facebook that we're all looking at her screen. Facebook doesn't exist, Mr Duffy. Yes, this is intentional: oh okay, sorry, my apologies, okay, so I think what yeah is doing is helping me. Give my chair report in saying that, yes, for the next meeting, superintendent Samuels from district 13 has agreed to attend. So we can think about what questions do we want to ask about? What is the current state of district 13 and their process in looking at resource equity, desegregation and integration? So, in terms of that and I'll tell you to send out the invitation I'll send it to you, Taya December 15th at seven o'clock, Nicole Hannah Jones, who you know many people have read her work about she's, a award-winning journalist from the times, and she talks a lot about segregation in the school she's, a parent in district 13 and she's, going to be the guest presenter. I've heard her speak and she's quite brilliant, as well, as you know, being very a good speaker, so they're going to be talking about resource equity because it isn't just as I've said it isn't just about sorting children and where do the children go to different schools based on where you live or based on other factors, but really what does it mean to have a thriving school community where all children are learning and selling okay? So that's for December, 15th, okay, so that is. Are there any questions about that? Okay, so that's my chairs report to bring you up to date on district 13 and district 15. and how they're going about the complicated question of desegregation in the schools. Dorothea. Do you want to ask people if there's any other business for our committee? Well, I can do that. I'm not sure. Is there anything else? Anyone else would like to discuss or have any other ideas for future meetings. Hearing none, I guess the answer is no! Thank you, okay! So the next session, the next section of this meeting, is called community forum in which we can hear from people in the community who have questions, I, guess or comments for either of the two committees that are meeting jointly tonight. So you can share fibers the only hand I see up is owner and I forget who owner is oh Carolyn? Yes, Carolyn, okay, dude! Is there a question or a comment, not sure Carolyn you're? Currently muted. Did you have a question or comment? I, don't know if she can hear us? Okay, maybe that was an error, no other hands. Okay. So thank you. Everyone for spending the time with us tonight on Webex. Can you offer emotion, a young person in Alex, scream hello, young person I, make a motion to adjourn at 7:35. Have a good holiday it'll be a very different holiday this year as we're apart, but together in spirit and wish everyone be safe and healthy and yeah. So this is our December meeting of the two committees so be well good night you're. Well, everybody.",
            "summary": "Okay, good evening, everybody I, don't normally do this preamble, but tonight is a joint meeting of the parks and Recreation Committee and the youth Education and Cultural Affairs committee of Brooklyn community board.\nToday, I would like to do a land acknowledgement, so the land that I'm going to be speaking to you about today originally was the Lenape Jokingland, the Lenape Homeland and the Lenape were the first people to live in New, York and Brooklyn before it was settled by europeans, And I say this as a reminder to the continued displacement of native peoples on this land and our ongoing commitment to dismantling the colonial legacy.\nThe narrative of Columbus often goes that he, you know in 1492, He, sailed the ocean blue that he was a lost child, a curious wanderer, taking on the noble and courageous task of discovering the new world.\nThe statue at its current location, with support from the italian historical society of America and Columbus, is often touted as a symbol of italian-american pride and heritage.\nThis photo was taken at a teach-in at Columbus circle on indigenous people's day, and this is a sign from one of our supporters called Control Colombo.\nTheir group of italian-American New Yorkers, who advocate for the dismantling of Columbus statues throughout New, York City, and this is their website and a quote from their website is that Control Colombo believes Italian.\nHis legacy in both name and illness is in likeness, is an affront to the dignity of all oppressed people and besides the fact that Columbus couldn't have been italian because Italy was informed as a nation during his lifetime that he did not discover a new nation.\nI was able to attend the transportation and Public Safety committee meeting and we got to hear from the 84th Precinct captain Edelrana, and he was speaking to us about how the department was handling changes in budget and increased demand for officers in the face of protests, and he said when we only have limited resources.\nWe understand that a new monument is a very intensive and costly process that must be carefully curated and we would not want to take on that endeavor without input from our community members, the Lenape Center of New, York and other cultural and artistic groups who have been impacted most by the legacy of Columbus and with that.\nNext is a letter of introduction to the parks, Department and a letter of support from your committee to present a larger proposal to the city council, and that is our.\nWhere, If removed the statue would be based, I, think you know, adding historical context from this.\nAny other figures that you guys are looking at to have in place of the statue in place of Columbus, so that process of replacing the statue we would want to make a bigger community question like we wouldn't want it to be all up to our group who we'd want to pick.\nDo definitely want to have that conversation with the Lenape Center of New York, and you know other descendants of african and indigenous people who they want to symbolize if they want us to be in the likeness of an individual or something more representative of the community.\nI believe two years, ago, where they reviewed Columbus statue and other figures throughout the city to determine whether they represent hate and should be taken down, and their conclusion was that more context should be added to the Columbus statue in the form of things like plaques and as far as I can tell it hasn't been added.\nWe have a solid, perfect plan to remove the Columbus statue before we have a perfectly created new statute.\nYou see that last part trying to understand what specifically your group would be asking of the committees in terms of support for what the concept of changing the concept of removing and replacing the statute along with renaming of the park.\nWe would wish for a letter of introduction to the Parks Department, considering it's their statue and if this were to get to a larger city council vote about the removal of the statue, If we would have your support in that vote, but in the so those are two different things in the first instance, You want to talk to the folks at the Parks, Department, correct.\nSo I appreciate you guys doing the work for Christopher Columbus as well, and removing that statue.\nOur only goal is first primary goal, removing the statues that is our goal and then initiating a process to rename the park and have a new statue put up our main way of getting the community engaged right now is through a lot of social media.\nThere are four statues of Columbus that you would like to see removed and that's the only goal of your committee.\nThere was a lot of push in New York City at that time, to review our own symbolism and images that I believe only a handful of images were picked just because there would probably be hundreds of monuments on that list, and so committee was formed and they would have open discussions with the community, and.\nOne okay, but this specific statue does have you know going back at least five years.\nYou know a very long history of it in the city, so I just wanted to follow up on Suzanne's question.\nI want to thank Miss Vasquez for whatever our presentation and the time and energy, especially in involving young people in this issue.\nWe got together after a year in a group meeting of 15 or 20 people in a room, and this is our proposal to take down the statue.\nI think this needs a lot of serious discussion, whether you know whether that statue deserves to stand there or not.\nIf we want to be on board with requesting an exploration into the statue, I, don't think any of us is prepared to say it.\nYou know be there, but should there be a similar exploration that took place several years ago and co-op for the Columbus circle that should take place for this statue, where the different groups are consulted, I'm, not completely clear on whose domain the statue is it.\nOne other thing is that I just really would like to get a little bit more of a clarification, because I don't think that we, you know, maybe this particular half a year or whatever.\nI just wanted to say that Miss Vasquez did come over to our committee meeting and discuss the police presence at the statues and I.\nI can't represent the whole committee, because we didn't vote on it, but I would say that from a social justice, perspective, I would support what Miss Quint had suggested, which would be the exploration and the further discussion of the possibility of removing the statue.\nAs, we were performing and teaching at the statue, It appeared to us that they were there to get between us and the statue and based on the you know, I, don't want to put words in anyone's mouth, but certainly if we watch the video from the community board meeting the Public Transportation one.\nI. I'm, not disagreeing with whatever else was said, I missed a lot of the meeting, but I know the history of Christopher Columbus.\nThat is one of the reasons, not maybe the main reason, but one of the reasons that this was brought to our you know for us to make a decision not only about the what was going on with Christopher Columbus and the atrocities, but also because of the dollars that were wasted because of police guarding this the statues.\nAnyone now who's, not a community board member but is attending the meeting and would like to ask a question we'll open the floor.\nI. Think the one thing that should be remembered if a statue does come down is how do we record some pieces of history that might be important to understand, and the mania for Columbus came out of the post-civil war desire to create healing bombs for the country, and rightly or wrongly, They went back to the colonial era.\nThere are pieces of history that we still want to figure out how to memorialize and that's not glorifying Columbus, but it's looking at historical moments and italian Americans are still 10 of the greater New York Metro area, population.\nIn some way you still want to understand how to represent that piece of it, even if not all Italians take Columbus as their symbol.\nFirst just want to say, I, think that this idea about opening things up for more exploration and to hear from italian Americans is guided.\nI. Think that this meeting right now is a public meeting where italian Americans can show up and talk about the importance of that statute to them if they want.\nI. Think that you know we're hearing from people on this meeting that they didn't know about the atrocities that Columbus committed and part of the reason for that is because he's been normalized as the hero because of statues like the woman, a few blocks from where I live.\nThinking about the you know not just oppression that Columbus committed, but the genocide that he enacted.\nI think you know we're in a moment of national truth and reconciliation and questioning Columbus.\nSo I think you know the presence of this statue.\nI support all Columbus statues coming down.\nI have a very strong feeling that in 10 years, all Columbus statues will be gone just the way that things are developing in our country, and so our question now is what role do we want to play in that history.\nIf, that's okay, to ask a question, but basically I just want to know.\nI understand that we may want the italian-american community and that's fine, but are we also going to have a conversation with the Lenape Community with the other tribes from New York, like my tribe, with black and brown folks, who view that man in the same life, Hitler.\nIf you know, if we're interested in a conversation, I, think nothing will start a conversation quicker than the removal of the statue.\nI understand where a lot of people, my including by the way, will like this to be taken down, but is anything that we can do to prevent it from happening again from going up again or anything else that can prevent either statues or any type of resemblance to go up.\nWe think it is important that before we ask people to do something, you know say no, why and I.\nAnd I think you know whether or not what happens to the statue.\nYes, the introduction to the parts of department of parks and recreation, as well as a letter of support for the city.\nIf your motion is as I hear, it is to write a letter to the Parks department in support of removing this statute.\nYou want to ask people if there's any other business for our committee."
        }
    }
}