{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCBi2mrWuNuyYy4gbM6fU18Q",
            "title": "Brooklyn Community Board 8 Live Stream",
            "publishDate": "2020-10-01",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "10/1/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 344,
                "um": 257
            },
            "wordCountFullTranscript": {
                "building": 146,
                "project": 91,
                "church": 71,
                "place": 49,
                "neighborhood": 48,
                "school": 43,
                "buildings": 39,
                "housing": 37,
                "land": 34,
                "street": 31
            },
            "wordCountSummary": {
                "building": 38,
                "project": 18,
                "school": 11,
                "place": 11,
                "neighborhood": 11,
                "church": 9,
                "street": 9,
                "housing": 9,
                "park": 8,
                "design": 8
            },
            "fullTranscript": "Good evening, everyone thank you for coming tonight, we're going to hear a presentation for a new building at 9 59 sterling place, which is a new tax lot. I want the back zoning lock for 920 park place the hebron school, formerly the old methodist home. I have mrs george, the district manager for cva on the line with us to help manage the discussion. We also have, I believe ms neil may be with us, we'll manage the discussion and here's a weather spoon. The third price chair for cba will help with the chat and help organize speakers we want to testify in through this process. We have the entire team for the project on the line, I believe and ms raspberry. The coordination with project p will be going through that- and I believe I see council member robert carnegie in the audience is that company to have him with us for this exploratory expression. So with that I'd like to make some things clear, given the details we need to go through, we want to give the teams 25 to 30 minutes to make their presentation. Then we will take questions and answers. We will have a moderator who will call upon his speakers, and I think mrs raspberry will be handling identifying our team members to answer questions. Give each chief member two minutes maximum to explain their part of the project. Then we will step through the proposal and then we have questions and answers. I don't know if mister this muscle and according to want to make a statement now or wait until the end of the presentation. Listen to oh. Thank you so much. I won't wait until the end. I need you know that I haven't answered each one of your emails individually and or text and or social media concerns. I wanted to wait for a public forum to be able to hear from you directly, but I needed you to know that I've actually gotten every single one of your correspondence as it relates to the problem. Thank you, council member, and we hope that you'll have a statement after this investigation in the question and answer session. Okay, I'm excited, can you hear me? Can I hear I heard a voice? I don't know who it's from. Can you hear me? Yes, miss collins. I can hear you okay, just trying to get through the technology good afternoon good evening good evening, now we're going to ask everyone to mute and stay muted unless the moderator or the host. Ms george calls upon you to speak. Miss george. Is that how we can work this? We need everyone to mute themselves if they're, not speaking, though, we need to mute yourself, I just want to text my mic. I mean check my mic. Can you guys hear people me be calling for a question? I know I'm just asking to see. I'm just checking to see if my mic is working. Who is this? Can you hear me we can hear you clearly. Thank you help us, ms george, ms weatherspoon is neil and they will be helping to coordinate the who's speaking and when, at this point I would ask miss raspberry to introduce her team and start the online presentation of the materials. Excuse me, I'm sorry, miss tyson. I just they're people that are still they have their mics open. So we have miss yada miyo. If you commute yourself please- and there are a couple of you that have dialed in that you need to mute yourself. Thank you good evening. Everyone. Thank you so much for giving us the opportunity to present to you today. I think we're going to just jump right in and ask the presenters the presentation they will introduce themselves in. You know, interest of saving time so morris and tom. I know one of you is going to share the screen of the presentation and then we'll begin. That's me good afternoon. Everyone! Thank you for your time. I'm tom lewis for morris agency, architects and I will share the presentation just a moment. Is everyone able to see the screen? Yes, great? Okay, tiffany. Do you want to take us from there or doctor? I think dr honore. We should just begin the presentation, don't well no job conor. I believe we can't this. Is it you're calling for audio hello? I think we can hear you now, sir. You can hear okay, I'm sorry about the technical glitches good evening. Everyone. I am thankful for the privilege of coming before you this evening. My name is daniel honore and I serve as president of the northeastern conference of seventh-day adventists, which is the ecclesiastical and corporate parents of 200 seventh-day adventist congregations throughout new york and new england. As part of its mission. The northeastern conference operates also 15 parochial, elementary and secondary schools, as well as a 100 acre campground, and we also operate 270 units of senior citizen housing. The hebron school exists to educate our children according to the tenets of our religious faith and cultural traditions. We believe this country offices offers us the religious freedom to do so without compromising what we believe in the northeastern conference supports member churches and their acquiring and developing of real estate property. A few years ago, we received a request from the hebron 7th adventist church to assist them and redevel redel developing the hebron bilingual school in a way that would allow the school to repair and restore its premises, which would say in council, we conducted a zoning analysis and we issued a request for proposals to qualify developers. We received numerous proposals which were reviewed by the elders and the local church board the hebron church membership. Then took a democratic majority vote to proceed with the proposal of host hope street capital based on that vote. The corporation board also approved the project and entered into a contract with hope street capital. We support the projects based on the benefits that it will bring to the hebron church and to the hebron school currently unable to use the building too, due to unsafe conditions resulting from years of deferred maintenance. It is our hope that the students can soon return with the shortest possible delay. Proceeds from this development project will allow the total renovation and restoration of the hebron school. It will also allow a new gymnasium to be built in the new building and 25 underground parking spaces for school and church use. We support the project based on the benefits to our school. Our estimate is that it will cost multiple millions of dollars to structurally and league fix this building. Apparently, the building is under a vacate order from the city of new york for the third to fifth floors because of the building structural and stability. Our contractor with hope street would provide us with enough funds to be able to repair and restore this building to its former glory. We know of no other way of how we can use this building again. We think that the building that hope street has designed is a good component and a good complement to our building and the blending of the elements of the current building with the new building, and I just want to say here that we respect the rights of all individuals to express their opinions on the matter. We understand that not all are in agreement, but we also have more than 1700 individuals who have signed a petition to that effect. For me, this building is special because about 30 years ago my father was the pastor of the hebron church and my mother taught at the school, and I know that for decades, different church administrations, different ministers have tried, without a veil, to get this building once and for all. So I thank you very much and we look forward to seeing this project move forward. Can I can I can I interject? My name is pastor williams from the holy trinity baptist church. How are you doing fine? Thank you. I don't even know how they delineated it, but, mr williams, we are on a time schedule with this presentation. We appreciate you to contribute to the opening statement that ran over by 10 minutes a minute and 10 seconds, but we're going to go on with the presentation and after the presentation and the questions and answers are done. Everyone will have a chance. Three minutes tops to make a statement or ask a question: yes, ma'am! Okay, thank you! Sorry about that. I'm sorry! Thank you. This is raspberry. Please proceed tom. We should begin the presentation so quickly a table of contents of what we'll be talking about this afternoon. We just had the introduction with dr honore. Thank you for that. Dr honore. We'll talk briefly about the condition of the existing buildings, facade restoration of the existing building, we'll talk briefly about the building history make a case for selective demolition. Then we'll talk about the neighborhood and the building heights and typologies around us. Finally, we'll talk about the proposed design and then rendered views of the proposed design. With that, I would introduce jeff CUNY from jablonski building conservation to talk about the existing building good evening, I'm jennifer carney, I'm the senior conservator for jablonski building conservation 920 park place is formerly the Brooklyn methodist church home for the aged and infirm and is currently the hebron seventh-day adventist bilingual school. In order to develop a master plan for the campus. The northeastern conference of seventh-day adventists retained a design team, including cables, jefferson, architects, jablonski building conservation and silman to perform a conditions assessment and develop a restoration program for the building. Next. Thank you. The original central portion of the building was constructed in 1888 to 1889 a bread, brick with terracotta and brownstone trim. The building was expanded in 1911 to 1913, with three wings of red brick cast stone and stucco added to the east west and south to bring the building to its current footprint. A team performed visual examination of the facade from an aerial lift in January 2019 and identified significant deterioration of the facade and the roof that required stabilization and repair. Most significantly, the tower over the entrance had severely displaced masonry and loose bricks due to vegetation growth which necessitated temporary evacuation of the school. The team also visited the site during rain conditions and identified numerous locations of water infiltration through large holes in the roof, which would compromise the roof framing next, the rear addition has different massing and fenestration from the main building, with a shallow pitched roof, along with replacement windows. At the fourth floor, step, cracking particularly at the corners open joints and displaced brickwork are present, along with severely deteriorated, sills and lentils at the windows. Next, many of the building materials used throughout the building, such as roofing and splashing, have exceeded their useful lifespan and need to be replaced. Other masonry materials such as stone, brick and cast stone, have been damaged by natural weathering and previous alterations or inappropriate repairs. Original windows in both the school building and the chapel are extremely deteriorated with the stained glass windows, in particular, requiring substantial repair based on the findings from this investigation, the team developed recommendations for restoration in order to provide a watertight building envelope and a safe environment for the students of the school. Sorry, I was muted so from there we'll go to talk about the facade restoration with cable shoppers hi. This is michael from capless jefferson, architects, so, based on the recommendations of the existing conditions, assessment began preliminary design, work on a comprehensive program of exterior wall and roofing and waterproofing restorations, with the intent of both stopping the continuing damage due to due to inadequate waterproofing and drainage, and also either salvaging existing materials or using historically appropriate materials where possible. So these following four elevations sort of document, a basic scope of sort of the bare necessities of exterior restoration necessary to preserve the building into the next decades. In addition to the major issue of the main turret stabilization and the roof over, the main original wing shaded areas show where there's loose masonry deteriorating or absent. Gutters the yellow on this elevation shows where existing roof structure is actually penetrating through the envelope and is subject, rusting and damage and also water leaking into the inner whites of the exterior masonry wall. You could go to the next slide if you want the rear elevation shows more of the same we'd be replacing. Lentils is necessary, replacing existing window sills, where they've severely deteriorated, there's also a boiler chimney that requires stabilization, that's shown in a heavy dotted red line. You could go to the next slide. These are side elevations, okay and I think from here we have alicia hunter from lee salesman to talk about the building history, thanks tom, just to give a bit of a context for our involvement. Lee saltzman is the preservation consultant to morris hajj me and hope street for the project, and just to try to you know, help everyone to understand that. We feel very strongly that the preservation research effort helped to inform the design process for this project and we endeavored to have the historic building speak with the proposed new building, both within a campus setting, as well as to have the new building respond to the neighborhood context in terms of height and massing and materials, and a variety of planes. The team's due diligence efforts included looking at the LPC designation report, going to the site, carefully studying character, defining features of the historic building and reinterpreting these cues in a contemporary design vocabulary. We also carefully reviewed historic maps looking at the development of the hebron school over time, historic photographs and studying the context of the site and the neighborhood, and identifying local building typologies and building heights and massing so we'll. We will show that in this presentation in this slide, we just wanted to locate on the site within the crown heights neighborhood of Brooklyn, which includes three historic districts that have been designated by the new york city: landmarks preservation. Commission, the site of course, is located within the crown heights north historic district extension 2 and is bounded by park, place new york and sterling avenues. Next slide, please, as jen kearney of jablonski building conservation alluded to earlier. In her statement, the former Brooklyn methodist episcopal church home for the age of an infirm and now known as the hebron school is an eclectic brick and brownstone institutional building. The LPC designation report notes an eclectic mix of institutional romanesque revival and gothic revival. Styles, as well as queen anne style sash. The church home was founded in 1883 to create and maintain a comfortable residence with board clothing, employment, medical aid and other necessary care and attendance for the elderly of the church. The site was developed in two distinct phases. The original building designed by merson thomas, was constructed in 1888-1889. The original structure was then expanded about 20 years later, between 1911 and 13, designed by builder william kennedy who sat on the homes advisory board. Can I have the next slide please. These historic views show thomas's 1889, building anchored by a high tower with an octagonal dormered, roof gable and dormer windows. As morris will speak to, and tom will speak to later in the presentation, a careful study of these features was fundamental in informing the design of the building next slide. Please, this historic view shows the complex after kennedy's 1913 extension was completed. Kennedy's eastern wing mimicked thomas's original design, while a new chapel extending from the western facade of the original building was executed in the gothic revival style next slide. Please, and also we wanted to show a circa 1939 tax lot photograph from the municipal archives. The view is somewhat obscured with the trees, but you can see on the corner of the building next slide. Please next, please thank you. So, in terms of the selective demolition that is proposed, it is the four-story low, pitched roofed section that you see on the left-hand image, as well as what appears, on the far left hand, side of the right side image and certainly looking at lpc's prior reviews. Lpc certainly has approved selective demolition and new construction at other institutional complexes elsewhere within the city. In terms of this particular case, we find that, despite being built during the 1911-13 campaign, the southernmost extension reads as a utilitarian element within the overall composition of the historic al-salm. We also note that there have been multiple unsympathetic modifications to the facades of this extension that have been performed over time, including the removal of historic windows and mullion divisions, particularly at the fourth floor, the installation of louvers and the application of blue paint. At the first floor stoop. We also note that the 19 11 to 13 additions to the east and west of the original building long park place all featured gabled roof lines that bear a strong architectural relationship with the 1889 building. Both the easternmost edition along park place and the chapel connected to the 1889 building, either with a small scale link such as the chapel or a change in planes such as the easternmost edition, which allowed both the original building and the additions to read legibly the southernmost low-pitched roof extension at the rear of the 1889 building that is proposed to be demolished abruptly abuts and encapsulates the 1889 gable ended facade the fourth floor of the southernmost extension in particular exhibits an uncomfortable relationship with the original gabled roof, which is blocked from public view. The southernmost extension does not rise to the level of architectural merit of the other, well-designed 1911-13 editions, and we feel strongly that the proposed demolition of this extension would not detract from the special architectural character of the building or the crown heights north historic district 2.. Can I get the next slide? Thank you just to identify the extents of the proposed demolition. You can see these portions shaded in red on the elevations that were prepared by caples jefferson. Can I have the next slide? Please thank you and in terms of the proposed design of the new. Oh sorry of the gable and facade which is going to be restored. Excuse me this is encapsulated presently and would be restored and re-exposed. You can see some details, photographs and the elevation would feature of course, restored masonry restored a multi-light queen anne style sash, as well as a restored round oculus window at the top of the gable next slide. Please next slide please. As I mentioned previously, the team really endeavored and undertook a very careful due diligence effort, looking at a number of factors within the immediate context in the neighborhood. So what we found is that the context of the proposed development consists of variegated roof lines and building heights. The highest point of the historic building is 84 feet at the top of the tower neighboring buildings include a mix of taller apartment buildings and low scale, row houses, and next please hello. What's up the team also carefully assessed building typology, whoever that is speaking in the background? Please mute yourself, mr gentleman, and found thank you ethel and found six recurrent types, including large-scale apartment buildings located at the ends of blocks large-scale apartment buildings in the mid-block low-rise brownstones, hybrid multi-family, buildings, institutional buildings and one freestanding mansion next slide. Please, we just wanted to show some photographs that are representative of the different building typologies. Next, please, the team also looked at recurring patterns within the neighborhood, particularly the pattern of low-rise buildings located adjacent to larger scale buildings, as well as the pattern of green spaces located between the sidewalk and the street walls of the apartment buildings behind please. We also noted, during the course of our research, that there are a number of institutions located in proximity to the site, including several churches, the Brooklyn children's museum, a public school and long great, next slide as noted. Obviously, the team carefully studied the historic building on the site, as well as the institutional campus model, and particularly the general theological seminary in Chelsea. There are many recurrent themes in terms of variegated roof lines. Gable ends a play of planes, animating the facades, brick cladding and landscape clothes that help to inform the design of the new building at sterling place, and I would also reinforce that. Of course. Not only was this. If someone could please mute themselves? Thank you. Thank you. So not only is this an opportunity to create a dialogue or foster a dialogue between the historic building and the new building in a campus setting, but also to really look carefully at on the materiality on massing play of planes that exists in historic buildings within the neighborhood. Thank you and morris hello good evening. This is maurice ajme. I'm joined here by tom lewis. We've already met and I'd like to talk about the proposal for the new building. As you can see, this entire project does include extensive restoration of the existing building complex at 920 park, and I'd like to talk to you about what we're proposing. Thank you also to the community board and members of the community for being here tonight. I want to start off by showing just some modern precedence that we used. As misha noted, we looked at the general theological, seminary and other similar modern buildings, as well as the church to inspire our design. We also looked at the array of buildings that you find in the neighborhood to make appropriate proposal which included the townhouses and the large apartment buildings which you find throughout this historic district. Next, two slides tom, please here is a view of the proposed. Well, this is the massing, that's allowable by zoning. This is an as of right scheme. Our current massing does not use all of the far or floor error that is permitted on the site, and we feel that what we've done in the next slide, you can see that we've carved the mass of the zoning envelope to address the historic building at 920 park, the school to the north of us, as well as the other buildings you see in the neighborhood next slide, please. This is the existing slide, which shows the building in the center, as well as the parking where our proposed building will be to the south and in the next slide you see the proposed building with the green space between the building there's an access, ramp and green area between the two buildings. In the next slide, you can see the gym which the school will have access to and you would actually exclusive use of, as well as the community for the corner in the corner. The ramp is shown there and the parking we're also showing the extent of the restoration and user rutledge. The consulting engineers have looked at that and propose the structural design you see on the right. That's the extent of the excavation and the end right, yeah, yes, in the next slide. So here, as misha mentioned earlier, we looked at the school building and took cues from that in terms of the gables, the dormers, the variety of heights and the setbacks, as identified in the color-coded in yellow purple, pink and gray, on both the existing structure and our proposed design with bubbles showing those areas of inspiration. Tom will now walk us around the site and show you the design. Thank you. Thank you again for your time to the community board into the community itself, so I will walk you as morris noted around the building with renderings that show the building in the context of renderings and photographs that show the proposed design in the context of the new building, starting with the view from looking southeast down new york avenue on the corner of new york, avenue and park place, the new proposed design, tucked in behind the historic building the restored historic building and showing the relationship between the two buildings, the gable end relating to the cable and here and then also dormers on this facade. That also are relating again to this dormer and you'll, see these some of these same relationships I'll point out again, as we walk through the various renderings again. This is a little further down new york avenue, looking back at the existing building and then the proposed design. Next to it again, the relationship of the cable ends towards each other. The the dormers also the modern interpretation of the dormers relating to the dormers on the existing structure. This is a slide that landmarks have requested in part because we had taken the photograph when there were leaves on the trees. I wanted to understand what the relationship of the buildings are, so we dashed in the lines this yellow line actually shows the profile of the existing building and this red line and shaded area shows the profile of the proposed design. This is taken from new york, avenue, looking east looking southeast or primarily east and again this is showing what was more saluted to in the site plan is the courtyard between the two buildings. So we have the proposed masonry rear facade the courtyard space that lies between the two buildings, the existing historic structure to the left here and then a small minimized, ramp automobile ramp that takes you down to the parking below the gymnasium is actually can be accessed from right around here and so that's accessible to the community. Excuse me to the school itself and primarily for the school's use. This is the proposed view, looking north from new york avenue so again, we're seeing that gable ended, facade on the corner and then the window dormers themselves with the building somewhat visible. In the background, this is taken from the corner of new york avenue in sterling place, looking east so again we're seeing that gable, facade we're seeing the window dormers that are relating to the existing historic structure. As we look down sterling place, we're seeing the roof heights actually roof heights are varying as we move along the facade you'll see as we get a little closer in some of the we've created an entrance way which creates a gap in between the in the facade. So it helps to break up the facade a little bit we're seeing alternating materials which are creating a rhythm along the street and then again, we've got this break on the this on the new york avenue side, which helps to again modulate the facade. This is a view taken a little further up sterling place again, showing that gable ended facade with the window dormers and then the the rhythm that's created as we go down the street with these varying roof heights and alternating materials. Finally, not finally excuse me here is the the detailed entrance way that I showed in one of the previous renderings that shows this. The breaking up of the facade we've created a bracelet detail here. This you'll actually see goes through to the back side of the building on the courtyard which you'll see when I show you that rendering again we have the alternating materials and the alternating the slightly alternating roof heights, along with the materials going up and down creating that rhythm. We also have, in addition to the bristol layer, detail, we've created a dog tooth brick detail on the underside of the windows to continue to create more interest and detail in the facade. Here is a detail of that front entrance way. So again, we've got the verisola in the middle. The dogtooth header detail. Excuse me windowsill detail here and then we've got some stone on the entranceway, which again relates to there's also stone in the church, facade itself. Looking on sterling place in this case, looking west on sterling place, we see way off in the distance we've got, the gable ended. Facade we've got this rhythm of these ups and downs that are marching along we've got the break in the facade of the entryway again with the rhythm of the ups and downs and then on the end. As a transition piece, we created a metal slightly lower and metal facade, which starts to help to transition the building from down to the neighboring buildings surrounding it from the courtyard. So this would be a view taken from the church. This is what the church would be, the view that the church would have from their restored building. This is, as I said before, this is the back side of that lobby with the bree soleil details, so it is actually a lobby coming all the way through. You can sort of see down here in the bottom of how that's working through and then this courtyard space that lies in between them you'll see a little bit of the detailing dog tooth detailing here. Also you'll see this vertical element, one of the things as architects. That's often hard to work with, is how you end up with elevators and the height of elevators, and so we try to make it a feature as opposed to hiding it. So there's also brick detailing in that piece as well, which this vertical actually relates quite well to some of the verticals on the existing building. In the background finally, landmarks had asked us to show the impact of the existing or of the new proposed design on the existing building. So this is the outline of the existing building and then the proposed design. In the background again, another view that landmarks had asked us to provide, which shows again, the existing building as it is, which would be restored and renovated, with the completion of the new project and here over on the left-hand side, is our a small view of the building projecting through. This? Is in the context of the neighborhood, so this is a neighborhood context without the proposed design and at the moment just showing sterling place elevation. The new york avenue elevation as it currently is, and then the park place elevation and then this is showing that same drawing with the proposed design in it. So we can see some of the heights where we are at a 60-foot street wall on the on the second place, facade 72 feet with the setback penthouse and the building across the street from us is actually a 69-foot street wall, similar as true on new york avenue. There are several buildings that are approaching within the same 69-foot height and on the bottom. The park place elevation, showing the existing building in front and then the impact of the proposed design beyond. This is just an elevation showing the sterling place elevation of the proposed design, and then this is again a larger elevation showing the park place, design with the church ghosted in and the front and the proposed design in the rear behind it. This is just a material selection sheet, so it's showing the two different types of bricks. We showed a glengarry red burn, lighter color or almost orient more orangey, color, brick, a redder brick and you can see down below, and here you can see the ones being the darker red, brick twos, being the lighter red, brick and then the third sample or the third material is this gray metal which happens here and along here and then along the top and that's it. That is the presentation. Thank you very much. This has been an interesting presentation at this point. I think we agreed to have questions from the community and ms wetterber. I'm sorry. Ms weatherspoon will ask those questioners to speak and miss george or ms neil will unmute those speakers or questioners as we go along miss tyus, I'm so sorry to interrupt you. I thought we were going to hear from the church. Is that not do we have a representative from the church other than dr honore? We do we do. We have pastor manna god, and then we also have the first elder of the church that are on the line. Right now, okay, so that this tired, also other members from the church on this call. Okay, so I think miss tiffany raspberry is referring to the proponents of the project, so that would be past abandon and what was the other person's name? It's it's one of the elders from the church who was involved in this process. His name is escaping me at the moment: okay! Well, he can introduce himself each of those. I hope you'll stick to two minutes past the manna gat. So please proceed and yes, pastor, mannequin, pastor, mandy! God are you with us pastor manigat? Are you with us he's there he's on the line? Is your phone muted pastor? We can't hear you tiffany you're, muted. Yes, can you hear me? No, we cannot hear you I'm on the phone with pastor manna got he's having some kind of technical difficulty. We cannot hear you. I don't see his microphone at all. We don't see your microphone, but we can hear him through your phone. You can speak now through my phone. Okay, that everybody can hear you through my phone. Okay, I'm sorry, I'm pastor, maurice manigla, the pastor of hebron church. I came to hebron in September, 8th of 2018 and, as previous speaker mentioned, the building was the british is in the bad shape and need to be repaired. So when I came to hebron, like I look at the record and the record, the church records show that you know the church. The elders voted for the project when the project was presented to them and the church board reported and then the church afforded a majority for the for the project. So this is a church worker. If they're, the chief is aware of the vote and they took it and every vote be. Thank you. Thank you. Pastor. Man again, you have another speaker, miss raspberry. Yes, we do. I'm gonna get him to speak right now, yes, elder toussaint are you on? We have elder toussaint, who was a part of the committee at the church when this project was approved. I don't know why he's not speaking so I guess you can move on and if he signals me, I will let you know so that he can speak, but you can move on to the other church membership. Thank you, ms rasberry. I think we have other members of the hebron congregation in the audience that news weatherburn, I'm sorry, I keep saying the word miss weatherspoon can point to speak or they know who they are and if they would come on and announce unmute themselves and make a two minute more, a two minute or less statement. We can move on with this. Now. What we're going to do? Excuse me, mrs tyus, we're going to have everyone in order as they as they landed in the chat. So, okay, can we ask you where they fall in, because if their name is not in the chat, then we're not going to be able to. We just can't. Have them call out and start speaking, so everyone has followed the order of submitting their name and their question, so we are going to go in order correct. No. At this point, we've had we've heard from the proponents of the project, who were members of the congregation. At this point, I want to hear for two from two or three members of the congregation who have asked to speak on this issue of how the project was approved. So I'd like those people to step forward. I believe one is mirlandi. Demiro. Yes, would you get? Please give us a brief statement on the position of you, your position as a congregant good evening, everybody. My name is miolan demero, I'm a member of hebron church and, as you all know, from the presentation, hebron, school and church has been in the community since 1960. and just brief since I don't have much time since 1960. So what happened was that when the when the deal was taking place, it came back, but can you guys hear me please if you're not speaking, please mute your microphone. Everyone. Thank you, I'm sorry to say, I'm not trying to disagree with them with my pastor, but unfortunately, since he came late into the project, I'm gonna have to I'm. Gonna have to go against what he says, because what happened with this project was that in 2016. I think that the members of ibram went and approached the nec to ask them for a loan. The loan exactly was five hundred thousand dollars and that loan was never approved. As of today, we never see that loan and instead the conference president came to the church and asked them to vote on, exploring a possibility to sell the property on exploring. My word is selling the property on sterling street and we had no idea that the conference had signed a contract with hope with a whole hope builders, the contract until we got a copy from our new pastor in the late of 2018 and the contract, according to the copy that we got, the contract was signed in December 15 2017 for 18 months in June of 2015 of 2019. That contract had expired in November of 2019. An extension was given to the buyer. Without the hebron church, knowledge in may of 2015 in may in may 15 2020. The extension of the contract has been expired. This past may several letters was written to the conference and also to the buyers to let them know we wrote a letter to the conference. Let them know that not to give any more extension to the buyer without our knowledge. Also, several letters was written to the conference and the buyer, and let them know that since may the contract may of this year, the contract was expired. How come the conference is pushing for this deal to go forward without a contract. The president of the conference, mr daniel noe, is pushing for this project to move only because he is looking to collect the 20 from this cell after the president won the second election, which is his term right now that he's on this year is the last year of his current this term. He told hebron members that whatever the debt that we had, all that has been wiped out, we're going to have a start fresh start. Instead, with these buyers, they put a down payment for this deal. He used that money to subtract all our debt that we had. He had stated that he has wiped out for us, so this deal does not help us. My question is for mr onore: why has the contract not been shared with the hebron congregation and have we have that? We have requested to see it on our request and not even been annoyed, and this church and the school serve a dedicated and close net to the community and have the developer met the congregation members or just the church leaders? What type of outreach and feedback process did they have with the congregation was there? That was the time was what was when was the last time they met and spoke with the congregation. Are you aware if there has been any discussion about insuring that revenue for the sale will be going to the congregation community and the renovation of this historic building, because this is what happened from what we know? We do not know how much it's gonna cost to renovate the building. So therefore, we know that they want to sell the bill the land, but how much money is it going to cost to renovate the building the carbon present building right now? We do not know that. So, therefore, that's why we're saying that it is not good to have this deal right now and before my lease question, to the best of my knowledge, there have not been an assessment to conduct or running madness course for the hebron. I stated that already. Are you aware that, because the church and the building will be considered on the zoning lot under the zoning law, all the open space on the lot needed to be open and usable to by everyone in the zoning lot, including the people who will be living in the apartment? Building the resident of the apartment building legally have the right to use all the church ground and keep in mind that it's going to be a school there. So if they're going to use that ground this, the kids will be in jeopardy and my last question will any of the unit be rented to or given exclusively to the haitian community or to the crown heights community, and if it is so, if it is so, how are we? What method are we going to? Are you guys going to use- and you said, 30 of the units will be affordable units and what is the affordable units? What is the price line for the affordable units, and these are all my questions? Thank you. Miss demero. That was a bunch of questions indeed, and I have rita. Also I have rita was on the line with me and barbara is alumni of hebron, school and also church. Member of hebron and rita is also a church member of hebron, and I have some other ones and funds. Polycarp is also on the line. If you want to ask any questions or confirm what I just stated. Also, I have elder tucson who is available to speak now. I have him through my phone because he was having technical difficulties. Okay, now we we've got a pile on here about six and a half minutes of questions from a congregation member. So at this point I would ask if careful notes were taken on her questions, that we ask someone knowledgeable in the hebron team, the hebron church team, to answer her questions succinctly and briefly, one by one from the team we would either have. I believe dr honore answer the questions and issues about tenants would be answered by hope street. Okay, may I suggest that it be someone from the local congregation who has immediate knowledge of what was going on down on the ground I can have dr elder toussaint can speak because he was okay for the process so elder chief. Can you speak and give us some background on the process? You've heard the concerns that were raised, and so can you give us some clarity on what happened? I know that there was a vote that was taken. Can you speak that? Yes, my name is. Can you hear me now? Yes, we can hear you yeah. My name is at the top of the deal with the recent conference and hope capital, and we all we all know for a long time to keep people's school, and we have tried for many years to find ways and the norfolk has come out with a plan, and that was a lot of qualities and one of which was the one that we have now that we picked at the time that the church voted was about 101 to 16 for the project and at least one there was. We were voted on it and with that you want that you will give extra money. We also understand that the concern of everybody and the community regarding this project, but this is a project that the church has accepted, because we have so for many years, and we hope that this project will find money to refurbish our school as far as people objected to the project. For a reason I can understand that, but what I will not stand for is these immune dose or false statements regarding what happened in the past as far as the way understanding the business. We have a lot of time elapsed, as you may hear, between the term that the project has signed to now, and I think that, according to the contract, there was a option for the contractors or developers to have an extension that also has been discussed and everything was underway. It was concerned, but as far as at the church, I thought it. The church has voted to go along with the budget and then the beginning. It was three or four we chose one and then he was supposed to church. We might have some type of absolute disastrous on that board of mine. It was out of necessity that we at even church went along, so we can have money to have. Finally, hopefully we build. Thank you. Thank you. Thank you, elder tucson. Can you do you know from personal experience? What did they vote on exactly and when was the vote taken, but what yeah taken, but it was about 101 to 60, where we got to go along with how it was presented as a church and then finally, when it was visited the second quick time I put it on the chess board go but go along with the problem. Okay, thank you. Elder toussaint. At this point, we've heard from two different factions in the congregation and I'd like to ask mrs weatherspoon to proceed with the process that we spoke about earlier, of having people from the community, ask their questions and get an answer and then move on to the next questionnaire and the next answer this is weather. Miss tyus. May I ask a question before you proceed? I thought we had two other her brawn people that miss demero mentioned were on a call and wanted to speak. Do you have their names miss demero? One of them is miss jermaine, barbara jermaine, yes and the other is miss aretha, yes, ma'am, yeah, okay, each of you would have two minutes three at the most terrible quality. You can't hear me if you sound like a giant bee: it's not coming through clearly do you want to pass to the next person and they can ask your question as well: miss tyus. I think she said that she wants miss leitha to start first. This remains put in the chat box. Please proceed! Hi. Can you guys hear me? Yes, okay, great yeah, so I know we only have a couple of minutes so I'll just make quick, I'm seeing in the chat there are people asking what exactly was voted on. I can just say that I mean first of all, the majority of the church members do not speak english, so there was also a barrier when it came to language. In my opinion, when it comes to that again in terms of the sophistication of the project and the plans that were presented, I can also say that knowing the population very well of the church, a majority of them did not really understand what was going on. I know that in one of the meetings I was very vocal when they had like a kind of an open town hall. A lot of the youth members were strongly opposed of this particular deal to the point where we were shut down in the middle of the church. A lot of the youth did not come back because of this meeting, because our voices were not. We were not really allowed or afforded an opportunity to really be to really. You know ask the questions that we were equipped to ask knowing again that the population was not as sophisticated to understand the complexities. We had questions that we wanted answers to and we were shut down on many occasions and a lot of the youth again have left because of this particular project and the disrespect that we felt from the leadership. With respect to this, I had asked, for you know clarification on a lot of the points they were power points, but the majority of the church, not necessarily as sophisticated understanding what was happening. There were a lot of questions. It wasn't something that was thoroughly explained. The leadership might have thought that could have been the case, but it really wasn't, and it would be hard for me to believe that anybody would think that the majority of the church congregation actually understood, truly understood what was at stake, what it sounded like was it more so of a bullying tactic like well. If we don't do this, we're gonna lose the school as opposed to really presenting. You know what the pros and the cons in a way that would be understandable to the church congregation, and so that's been something that was very problematic. Just the lack of transparency really again from a lot of the youth that are professionals attorneys, I'm an attorney. We had a lot of different professionals that were asking questions that really wanted to get to the bottom of what is going on here. We, you know there was just a lack of transparency even on our level of people who could understand a lot of the information, so let alone the a lot of the elderly members who do not speak english, who do not understand, put up a powerpoint. All they were really hearing was well. If we don't do this, we're going to lose the school and yes it was, I mean we need money. Obviously, to make these repairs we did not. We did not have the money to do so. We still don't have the money to do so and that very that's. A very real issue is that we have this property that needs to be. That needs to be, you know revamped and we don't have the funds. So it was a point of desperation really where we're like. Well, what are we going to do so? I guess, if we don't do this, then we're gonna lose the property, and I think that, unfortunately, when we're looking at it at that extreme, you know they're saying that a majority of the people, I think you know, vote and I remember seeing that vote, and it was you know, kind of iffy, because it was kind of like a let's point to see how many hands are up, how many hands are down type vote. That's exactly how the vote was done. It was not done by like a secret, a ballot. Anything like that. It was like. Let's see a show of hands how many people you know are voting for this, for and against you had older people like I mean I guess, I'll raise my hand, you know there was a lack of really a real understanding and even to this day you know asking for documents like, let's see some of these contracts. Let's see this, there was a separate committee that was really handling. Most of you know the day-to-day process. I guess of this, and that was really it and it was like okay, we're gonna come in and regurgitate or we're going to come and give some information to the congregation piecemeal, but it just it didn't it was. It was something that was. It was really hard to see. To be honest and again when we tried to question when the youth, the professionals who were looking at this and were like this doesn't really make sense. Is there another way? We know that we need the money, that's not a an illusion, we're not delusional, but is there another way? Can we partner? Do we have to sell the land like? We were asking all these questions and we it just we were. It was just like you know whatever, and they and they you know the leadership did what they needed to do did what they had to do so for them to say that you know the majority of the church vote for it. Well, I mean when you present it like that. Well, if we don't do this, we're going to lose this to a majority population of elderly haitian, creole speaking individuals who don't really understand the sophistication and I'm not you know, trying to be ignora or get on anybody's education level, or anything like that. But just let's be real about this. You put up a nice powerpoint. You throw up all these numbers, no one's paying attention with attention to it. They don't understand they didn't understand. So, given that extreme lose that lose the school or do this deal, I mean people put their hands up, and I and again the count was more so, let's look to see how many hands are up. There wasn't a ballot. There wasn't anything like that. There wasn't even a video recording of the you know the counting of the hand, so you know it's, it was it's always been shady. In my opinion and again, I know that everybody is trying to do what's best and you know, there's everybody has their interest and it is a dire situation, but I've you know, I think that there has to be an another way. I don't know what that way is I can't I'm not gonna pretend that what it is, but this just does not seem like it's really in the best interest of the church in the best interest of the school, the best interest of the crown heights neighborhood. That is all. Thank you, ms pierre. I believe that is at this point. We can move to the community attendees and work with ms weatherspoon to get the additional questions that will align with ms pierre's statements as well as pastor madagas statements that the work needs to be done. Somehow I don't know exactly how so, ms weatherspoon, can you get the next questioner good evening? Everyone, a couple of you, have a few questions so just in the interest of time and just fairness. If and sticking to the two-minute time that we're supposed to be asking these questions, I'm going to ask for you to have multiple questions that you maybe do one or two, if we, if you can knock it out in two minutes and then we'll come back to you after everyone's had an opportunity. Okay, claire is the first person. Please is clear hi I just want to make sure barbara's statement gets read so I'll use my time to do that. So barbara jermaine says I went to hebron school from nursery school to eighth grade at our meeting at hebron church. I proposed that we oops it moved sorry at our meeting I proposed that we should reconsider this deal. I was shut down, as were many of the youth who went up to the microphone. We feel as though this project doesn't move backwards for hebron. Birmingham, the school founder, a black man from haiti, invested at the start of acquiring the entire school ground. Not the park place side from the future young black people in our church. They need to know that they don't need to sell what they own in order to improve our young professionals. Let the board know that we have resources. They can tap into even lease the land on sterling place and continue to own it, since we need to repair before the structure crumbles, and I don't have any questions. Ms weatherspoon, that's a statement from miss barbara germain next we'd like to go to linhi hi. How is it going? My name is louise ryan. I it's three doors down from the proposed construction and I wanted to understand, given the proposed construction will literally block sunlight and air flow to me, my neighbors, my neighbors homes, choking off our thriving gardens and creating a heat sink. How can hope street position themselves as friends of the community? The second question? Oh sorry, the other, and also before I even finished that I actually would like to see my time to friends of 920. They have a statement to read, so I apologize. I forgot about that yeah. So, okay, so who's speaking for 9 20., ingrid here, hi, ingrid, please hi, okay, good evening, everyone friends of 920 park is a diverse intergenerational coalition of neighbors united in our firm opposition to hope street capitals. Project at 920 park place. To date. We have garnered widespread support of over 6 500 individuals and counting have signed our petition against this project, and we have received statements of support from local community groups and organizations, including the crown heights north association, the crown heights tenant union, the sterling place, civic association, the historic districts council and crown heights mutual aid. This project is a travesty, no matter which way you look at it and it must be stopped number one. The project goes against landmarks law, the partial demolition of the historic structure, its inappropriate scale and style, the obscured sight lines, the significant adverse impact on the old homes, visual entity and the character altering changes to the open space are all in direct violation of the city's environmental quality review guidelines for historic buildings. This is cultural erasure and it begs the question whose monuments does the city protect, whose history matters the proposed project? Would be the first building of such magnitude built in our historic district, since it was given landmark status by LPC less than 10 years ago and would set a dangerous precedent for preservation standards in this new historic district? I'm almost done number two. The project removes half a block of essential green space in a district that is already plagued by higher temperatures and unhealthy environmental conditions due to racist redlining. We are in a climate crisis. How can we possibly continue to ignore devastating impacts of selling away open, green space for private profit? The environmental impact of this development is not a footnote. Lives are at stake, removing the little green space available in a majority. Black neighborhood is environmental racism, and it is outrageous that hope street capital is not proposing a single green initiative to mitigate the environmental, devastating devastation they are causing. I'm done. Thank you so much ingrid now, I'm gonna ask susan suzanne, spelling sorry, I'm actually reading the second part of the friends of nine twenties and I'm sorry, no worries no problem at all. So hi, I'm noemi. So as if what my neighbor ingrid just explained, isn't bad enough hope, street capital's project does not have a single redeeming quality in terms of housing. The small unit sizes make it clear that this development is catering to young short-term tenants who will not be looking to settle down and integrate into the community do not be fooled. There is no affordable housing in this development. At best hope, street capital will participate in the affordable new york housing program and offer 30 percent of apartments under this program, but the program's name is misleading by design. Only the upper middle class can afford apartments offered through affordable new york this year, individuals who made a hundred thousand dollars a year qualified for an affordable new york apartment here in our neighborhood. The median income is around forty thousand dollars and that figure is even lower for black households. Therefore, we repeat, there is no affordable housing in this development. Lastly, we are deeply disturbed by the congregation's testimonials of the corrupt deal-making that has occurred between hope street capital and the northeastern conference leadership. It's clear that our neighbors in the hebron congregation have been misled and manipulated. This is an outrage equally troubling is the northeastern conference's claim in the media that the local community has never offered them any help to restore hebron's historic building. In fact, the opposite is true. For over 15 years, local community members, including members of the crown heights north association, have offered to meet with the church's leadership in order to share grant opportunities that would fund the restoration of this building. The northeastern conference has consistently ignored these opportunities, but we are still here and we are still willing to help. In conclusion, we urge the land use committee and cba to vote against this project. This greedy developer shows no regard for community concerns, is willing to desecrate a landmark institution for its own profit, has no real intention of offering affordable housing and makes corrupt, backdoor deals behind the backs of hebron's members for the sake of our community. Please vote no on this atrocious project. Thank you. Everyone for your time. Thank you. Naomi and ingrid next will be suzanne, spelling board member of crown heights north association, and she will be reading a letter for the record. Thank you, suzanne you're welcome. This letter is going to the landmarks preservation commission, as well as the developers the crown heights north association inc. China appreciates that you and your colleagues took the time to present your project to us and other community members on June 25th 2020. As a result of your presentation, as well as your latest updates to your plan. We do not support your proposal. There are a number of reasons for our opposition. First and foremost, the entire former methodist home site is part of a new york city, historic district, the crown heights north 2 district, both the building and the entire grounds. The rear grounds cannot be sold off for as of right development without permission of the landmarks preservation commission, this entire project flies in the face of the 1965 landmarks law. The entire property is also listed on the state and national registers of historic places. The state historic preservation office shippo will likely find a project of this size and designed to be an adverse impact on the historic resource. The proposed plan will negatively affect the architectural integrity of the hebron site. The proposed plan clearly competes with rather than being deferential to the existing hebron building in scale bulk and its materials. Ebron is the gem of crown heights north. It is an intact picturesque, romanesque revival, gothic institutional building, the only building of its kind remaining in central Brooklyn. The erasure of the open space surrounding the hebron buildings will obscure the legibility of the landmark's historical identity. As an institutional structure, the project will be a substantial adverse impact on an architectural resource with crown heights north historic district, all right in the isolation of the property from or alteration of its setting or visual relationship with the streetscape. This includes changes to the resources visual prominence so that it no longer conforms to the streetscape in terms of height footprint or setback. It is no longer part of an open setting or can no longer be seen as part of a significant view corridor. The proposed plan is an urbanistic departure from the established tenants of the neighborhood, including breaking the street wall, and its scale is incongruent with the streetscape of the three and four-story row. Houses on sterling place between new york and Brooklyn avenues related concerns include the adverse impact development on this open space, we'll have on the crown heights north community. The city is taking serious measures to keep and create open space to minimize the risk of Covid-19 virus infection. The new building would create a heat island which has proven to be detrimental to the health and well-being of local residents, many of whom are seniors and others with respiratory issues. While it does not come under the purview of LPC, your proposal does not take into consideration the needs of crown heights north community members in need of housing, many of whom have already been displaced by gentrification. The vast majority of your planned one-bedroom dorm-like apartments will not be affordable to or even marketed to, those who need apartments. Most china supports low-income housing development for those in need. Finally, china proposes excuse me that the applicant work with shippo and explore historic preservation. Tax credits as a tool to adaptively reuse, the existing hebron building with very few changes to the present footprint. This could result in unique, desirable apartments allowing hebron to make the needed repairs and provide the educational and senior services they desire. In addition, hebron can create a specially designed outdoor green space, suitable for education, recreation and relaxation for the hebron congregation and the community at large, sincerely the board and president of china. Thank you very much. Miss spelling the next person will be elena rinsler. Ms winslower, do you still have a question? Please unmute. Okay, we're gonna move on to miss judith, wiletsky hi. Several of the members who've spoken have already covered the topics that I was going to ask so, but I do think it's important to reiterate the questions of why this is architecturally appropriate, especially because it has absolutely no sustainability features. There's nothing to mitigate water, runoff, anything to decrease the heat island effect for the neighborhood, aside from it just being totally inappropriate for the hodgepodge of different architectural styles that don't really relate to the neighborhood. Thank you. Thank you. Thank you. Miss wiletsky. I know barbara jermaine had someone speak for her robert johnson, please. I know that you have a question and a statement hi everyone. My name is robert johnson. I live I'm a homeowner. I live across the street at 976 sterling place and I don't really know where to begin. My family decided about 10 years ago to invest in the property understanding that this was a landmark district feeling grateful to be caretakers of a landmark property and also to engage with and help. My neighbors is something that I've that I've begun doing and something that I enjoy helping them, maintain their properties and just further the the beautiful architecture and the community built around it and I've I feel very lucky to have been a and continue to be a a caretaker of this of this beautiful building and every day I look out across the street and I see a beautiful building and I wonder why hasn't it been taken care of, and then at the beginning of this this presentation, I hear the president of the northeastern conference list just a little properties that properties he said that they own millions of dollars of property right and he lets this property fall apart, crumble right before his very eyes, the congregants come to him and ask directly for a loan, and what does he do? He proposes selling their property out underneath them. It's. I just don't even know where to begin with this, it's a landmark district. The congregants are against the proposal. It's obviously not in keeping with the architecture of the neighborhood and yeah. That's all. I really have to say it's just really disgusting and disappointing. I think that the preservationists who are pushing this should really think about what they what they mean when they call themselves preservationists and why they think it's okay to push this in our neighborhood. When I know they wouldn't try to build anything like this in other neighborhoods, china worked hard to make this area landmarked and to just see something like this. Try to get pushed over everyone who lives here and has taken care of this neighborhood for years through bad times, and now, when there's some profit to be made, what happens the developers come in and try to squeeze out what they can? It's just despicable. I that's all. I don't really have a question. I'm just disappointed in the fact that it would even come this far. Thank you for your time. Thank you, mr johnson, for the statement next would be michael r hi. I live at 11 2 park place and I walk by this building every day. I'm just wondering about the consideration of the height, because it's so in striking contrast to the neighborhood, despite the architectural renderings that are trying to prove otherwise, and I think that the regulator monolithic masking of it and the lack of like any sort of considerable setback from the actual street are particularly jarring, and I think it's almost. It feels almost a little hypocritical for the preservations to speak about how there have been taken. Consideration of the gabled roofs of the historic structure and the building that is being demolished is being demolished because of its monolithic, flat, roof massing, and so I guess I just want to know what the deciding factor is and like how you came to that decision. Mrs rasberry, anyone on your team want to answer that question briefly. Yes, tom. Can you answer that question I can or morris? Would you like to speak to, or would you prefer? Actually we did spend a lot of time. Looking at the other buildings in the neighborhood, the street wall of our project is 60 feet, which is the same height or lower even than the building across the street, and a number of the other larger apartment buildings that you see throughout this historic district, and we also spend a lot of time carving and setting back the building in a number of places along the street. Thank you. Thank you. Okay, rob mantlebomb good evening robin hi there hi there, so I live at 960 sterling place, and I just want to say that I stand with my neighbors against the project. That's being proposed here tonight for all the reasons that the community is presented, but I recognize that the city needs housing and especially housing near transit, and I understand that there's going to be tremendous pressure on the community board to come to terms, and I know that projects that go to LPC usually end up getting built in some fashion, and so with just trying to be realistic. Here I just want to lay down some markers. You know if, for those people on the community board, who are interested in negotiating with the developers, what the markers might be for a project that actually benefits the people in the neighborhood, and I I'm really just talking about affordable housing, as many people have pointed out here. This is not a neighborhood where the median income is 130 above the area median income, we are a very low income neighborhood, you know the median income for black families here is probably 40 to 60 percent of the AMI, and so I think that if this is going to proceed in any fashion, the developers really have to choose the option under the affordable new york housing project. That is in that category. You know: option a where you know where most of the housing is most of the units are available at 40 to 60 percent of AMI, and they have to build units that are consistent with what people actually need here and not sort of warehousing for freelance graphic designers, and I think that there has to be you know. The community board has to negotiate terms where the landlord is not permitted to sort of reject people. You know who don't meet the credit score requirements or who have certain criminal records, and there are all sorts of innovative approaches to sort of making sure that you know credit scores and criminal records, and you know prior rental. History aren't barriers to renting, and I just want to say that at the end of the day, though, none of this can come at the expense of the architectural fabric of the neighborhood. If there's going to be a building built here, it's really got to be much smaller and much more consistent with the neighborhood and really preserve the green space on the sterling place side. So it's gonna be a lot less lucrative for mr gershon and probably the sda2, but you know I think, there's you know if they're gonna do something like this, you know they're gonna have to give up quite a bit, and I talk in more detail in my statement about some of these barriers to affordable housing. So there's a lot more detail there. If you're interested in that, that's all I had to say, thank you very much. Thank you very much. I just want to remind everyone to try to get it to the two-minute limit. Next up is talia felberg anyone else who wants to make it okay, so you don't have a statement or question. Thank you. Okay, thank you, gretchen! Actually, sorry, I do just want to register my opposition to the project as someone who lives near this building. Thank you, okay. Thank you. Gretchen yeah. I also would just like to register my opposition. I live at 1528, bedford avenue. This sounds like all sorts of wrong for the community, especially now hearing from people from the congregation it sounds like it was extremely misleading. So that's all I have to say thank you. We appreciate your statement. Thank you, fiora ortiz joiner. Thank you hi good evening. My name is fjords. He's joiner, I reside at 1203 bergen street and I'm the president of the rebirth of bergen street block association, ms demerol kind of touched on a question that I wanted to ask and so did rob, but we haven't gotten an answer. So I'm going to ask it again: the median income for a black household in the church's census tract is about 40 000. Would you approve a household earning a total of 40 000 as tenants for a one bedroom apartment, and my second question would be who will be allowed to access the underground parking and gym that will be attached to the building who benefits from that space? And those are my questions and I would like to answer. Thank you. So I'm gonna start and then you know please someone else from the team. Maybe jay jump in the city of new york manages the affordable housing program. They set the parameters and the guidelines, it's not something that hope street or the developer has any control over jay. Do you want to add to that hi? I'm jay segal, I'm the land use lawyer for hope street. Now the york, the person who spoke before and said that we providing affordable housing pursuant to the affordable new york program is correct. We haven't decided what option yet we will choose, but that's the program and their guidelines are the guidelines. We would adopt the question about access to the underground parking and to the gymnasium I'd. Look that to jeff to respond to, because that came up earlier as well. Okay, so let me speak to the parking garage one which is accessory to the building, as well as for the benefit of the church and the school. The gymnasium is for the exclusive use of the church and the school. The accessibility is from the sidewalk level, with respect to who chooses the housing, it's all done by a third party. It is not done by hope. Street is not done by our measures. It's a third party which selects who gets the affordable housing units. Excuse me one more to pick up what you asked. Definitely your comment was made a little bit earlier, so somebody was concerned about the people in the apartment having access to the school that concern's unwarranted. There are separate tax slots and the people who would reside in the new building would not have any access to the school and vice versa. The tax lots are separate and nobody has access to property. That's not on the tax. How about the parking- because that was part of the question who benefits from that the parking is 100 allocated the 25 spots for the use of the church last school, sam wood? Jr? If you still have a question, please be hello. My question is: why was hope street capital placing flyers in the neighborhood advertising the development as a in quotes new rent stable as residential building with affordable housing units distributed throughout the community at the request of the community board? In order to notify you all about this hearing, and there were specific guidelines that we had to write into the fire. So we received a template from community board eight, and we just answered the questions and those were the answers to the questions that they were. They required that we put on the fire and just because of Covid-19 and the fact that we can't meet in person. They ask that we do an extensive outreach regarding this meeting. So we had teams of people drop off throughout the community 350 flyers to make sure that we had a very open conversation that everyone was included. Miss raspberry. Can I just clarify the question which is about the language used on the flyer? Not the fact that correct it's incredibly misleading, it's not misleading. This building is going to be rent stabilized under the affordable new york program and will have an affordable component under the affordable new york program. There's nothing misleading about it. It's exactly what it is. May I ask if you mean rentals, they are rentals: okay, jerriann, scott, I'm not sure about how to get a month. Who is speaking, please jerry and scott I'm trying to get on. We can hear you, oh all, right! Thank you wonderful, good evening. Everyone. I have under a minute to say that, 71 years ago my grandmother and grandfather bought the house that is directly across the street from the back door of what you are just deciding to create a travesty. They bought this home for what is now five generations of us. We have loved this community. We have grown in this community, our neighbors have been. We have been have neighbors that have been here: 10 20, 30 40. We are here 60, 70 years because of the beauty and the air and the seeing the sky and the neighborhood cannot do this. You cannot do this. Thank you miss scott. Thank you for that cameron. Blaylock, please! Oh sorry, I didn't have a question. It was more so just a comment in the chats. You make your comment or you're good. No, I it was. It's been covered, mostly in rob mendelbaum's comment. Thank you. Okay, you're welcome, maya murphy, please hi! My name is maya murphy. This is wesley stokes. We live at 960 sterling place. Thank you for your time and the opportunity to speak. I am absolutely opposed to this project. We both are. We urge the land use community to vote against it. As we've heard, this massive apartment, complex, is being proposed on the methodist homes grounds, which is part of a landmarked designated area. Today is the only remaining 19th century institutional building in this district, and it is the neighborhood's finest example of a romanesque revival. Building crucially the green around. This is vital in identifying it as an institutional building. When you walk down the street, that's what you notice, that's how you see it as special. That's what makes it a gem, the article, preserving a place that protected by suzanne spellin who's on this call states that the manicured grounds surrounding the buildings were a rare and treasured part of life in the midst of the city. Yes, this proposal will destroy that it will destroy the freestanding nature of this building and render it unrecognizable as a landmarked institutional building. Yes, the existing building needs substantial repair, but this needn't come at the expense of destroying in one fell swoop, the core identity and legacy of this site. This original building was built out of a spirit of health and purity. The grounds are precious in future and offer rare moment of respite. We increasingly understand the relationship between the green environment of human health and that communities of color bear the health effects of moving losing green space most heavily. I worry about the long-term health effects that will befall the surrounding community that removing these grounds will create. There will be increased air pollution. Increased noise increase, surface heat. This leads to decreased respiratory levels, it will contribute to chronic stress and health and heart disease. I especially worry that with so many children living on sterling place and the surrounding streets, what happens to screen space is removed, especially combined with the known effects of large-scale construction on childhood, asthma and other chronic diseases? Yes with hope street capital plan to combat the impact of this type of environmental racism. Thank you. Yes, thank you. So much next we have lauren fouda. I asked to ask everyone else: who's, not speaking to mute their microphones. Please miss lauren founder. Do you still want to make a comment or have a question? Okay? Next we have pharah souffront democratic nominee for the 57th assembly district. Please you have the floor. Everyone. My name is pharisee from forest, the incoming democratic, well democratic nominee for district 57, which is right next door. I also want to say that, in addition to being the next well soon to be next elected official, I am also a proud alumni of the hebron seven-day adventist school. So I have attended the church. I have been a student at the school and it is to me from what I understand about the community is that gentrification is real and has been stripping our community of the very members that make it what it is today. The hebron that seven days, fantasy school, in addition to be a landmark, has been an institution of pride in the haitian community. So one to have a developer come in and outright lie to the community, confuse them and manipulate them to get the property. That's one that's wrong and then two to then propose a structure, a building that first violates the landmark guidelines or whatever the laws are, but then also go about and not actually give what the community need, which is true, affordable, housing, we've seen it time and time again, y'all profits before people profits before people. So I wanted to be very clear that nothing here has changed. Clearly, it's profits before people, because even when the developer said that oh, you can have and it's AMI is set by the city. Yes, they do set guidelines, but it is up to developer to choose what is affordable, what they will offer as affordable versus what is not affordable. So do not let them go ahead and try to shirk off that. Okay, they already started off on the wrong foot and it seems like they're going to continue to run on the wrong foot again in the name of what making profits. So I do respect what the community decides and it seems like the so far from what I'm hearing from the comments the community decides that they don't like this project so far, but for me it always be how we gonna maintain the community. How we're gonna make sure that the people who live in the surrounding areas can stay in your park, stay in their homes and it seems like first of all, the AMI is off. The structure is off. The environmental of the environmental effects is off the landmark this. The landmark establishment is off whatever you call it. What do you call that thing, but it just is off and when something don't sound right to me, they don't you pay. These people get paid a lot of money to come and talk to us and explain things, and if it don't sound right, they need to go back into the drawing board and start over again. So that's just my two cents, I hear y'all and I support I am strongly in opposition of this development. Thank you. Thank you. We have a second lauren that wanted to say something. I don't have a last name. So I'm sorry I'm sorry to interrupt, but I want to be you're, muted, demuted, you're, muted. It automatically have to hold down the spacebar. We have council member carnegie here as well and he's been patiently listening and I'm hoping he is willing to make a statement at this point. Hello. Can you hear me? Yes, can you hear me hello? We can hear you now. Yes, so it was. It was really great to hear from the community, especially the residents that are that are close by I was elected, to represent this district and to serve the constituents and to do what was best in their best interest, and I'm going to continue to do that. So, unfortunately, for me tonight I did hear some competing interests even in the church and in the church plan and I'd like to further get a solid understanding of what the church wants and what its membership wants, because I'm not clear on that. I heard two differing opinion: differing opinions on what the church and the church's leadership want. So there are, I'm duly bound to listen to and try to meet the needs of the community in its entirety. So that's the residents that are close by that's the church. That's the church's leadership, so I'm not prepared to make a statement at this particular time on this case. But you please understand that a lot. This is going to be a city council decision in terms of land use and that kind of stuff, so I'm acutely aware, and which is why I don't want to rush to making a statement here tonight. You and I miss tires- have talked about this and china and other members have called me and had a conversation about it. It's great to hear from the community, though at large, especially those who would be negatively impacted or positively impacted by the close proximity of this development. I don't think development should hurt people, and I don't think development should have a negative impact on communities, but you know the church who has a solid stake in how this happened. I've heard from them as well and the church leadership so there's a lot of differing of opinions or varying ideas about what this will do and I'd like to, as the council member be given an opportunity to think this through have more dialogue and conversations with the community and not make a decision based on this particular call. Thank you councilman. Thank you, council, member pornegi. I just want to thank you for being measured. Wait time out before you miss times, I'm seeing things in the in the in the chat which really concerned me. I don't understand why you wouldn't want someone to be measured and to make sure that they take into account everyone's opinion on how this should go, but the chat is going off the hook about this someone's saying that they were reaching out for me to me individually for months. I see renault, so for borrow president, so I guess you know, I don't know what I can say further. Thank you for allowing me to weigh in. I do have a measured approach. I currently sit as the council member for this district and will be carrying the voice of the people. I don't know what you expected from this particular call, but thank you so much miss titus councilmember. I hope you'll remain. For the rest, the remainder of the discussion remain on the call on the meeting for the lead of discussion and the vote. This will go to the full board next thursday, and then it goes to LPC, and my understanding of that process is that once an area is zoned, this is not a ulurp action. So I'm not entirely sure that you would see this after LPC makes its decision based on the hearing for October 20th and then a meeting after that. So I hope you will remain for the rest of the meeting to hear the vote and also keep an eye on what happens here. I personally have to say that for the number of very educated people who are members of the hebron congregation- architects, engineers, accountants lawyers, that there is funding for building schools on private property under charter school laws and rules through new york state department of education, so that money's been there. I don't understand why no one reached out for that money to build the school, but this is something we could talk about. I hope we can have a meeting offline and get your questions answered in preparation for the other two upcoming meetings that I mentioned the full board and then LPC. Thank you for staying and for making the statement you've made so far that you are listening and you're weighing. Thank you. Okay, go ahead. Yes, please, because we just have a handful of people who are waiting. I just want to make sure maybe their answers have their questions have been answered, we're not sure okay up next would be. We have. We had a second person named larman with with an her last name is not available. Miss lauren did you want to still speak if you're there? Yes, I do. I thought it was directed at me. Thank you. Thank you. So much yes, okay, I think. Like a lot of my neighbors, I have no problem with building new housing in the neighborhood, but it needs to be for the existing community, both in family sizes and rent, and that this building includes so many small units, like some of my neighbors have already mentioned, means that it's not built for families. It will rob the neighborhood of space for buildings that do support families and schools. Both hebron and other schools in the area, public schools and charter schools alike need families for ongoing. Need families for ongoing success to support our children to become strong citizens and families need affordable housing to help with that, I know that we heard answers about not being able to determine how many affordable housing units are in this building. I don't believe that personally, but what I do know is that a developer, like hope street, I think you all would have given the amount of experience that you have quite a bit of knowledge about just how many of the units might qualify for affordable housing and what that might be set at. So I would like to hear from you- maybe you don't know for certain, but what are your estimates, given the other work that you've done about how much affordable how many of these units will be affordable, housing and what the threshold might be set up? Jay. Do you want to answer that question? I think we've already explained that the affordable pursuant to the affordable new york program and they have several options and we haven't chosen. Yet what the option is. What are you waiting for we're waiting to see if the project's approved at what size it's approved, and then we can figure out what we're going to do? Well, what are what are the? What are the? What are the range of options here? It's the options under the affordable new york program. If you like, send you, we can send you those options, you don't want them. We can send you the options, email them to the community board and they can forward them to anybody who's interested about the number of youth that qualify and the rates that they might qualify at. We can do that, we'll send it to you, send it to the community board, so they can forward it to you. Okay, I'd like to make everyone understand that this has been this project's, been in the hopper for years now, so tonight we're gathering information to make an informed vote now, mr siegel, are you saying that you want to defer a vote by the land use committee this evening to next month, when you had a chance to review the material that you just offered? Well, I didn't say that at all what I said is we provide the information about the affordable new york program to you in a letter in the next couple of days. We definitely do not want to defer the hearing. As you recall, we were ready to have the hearing in June, because there was an issue as to how much before the hearing we had provided you, the information you wanted, and so the hearing was adjourned for three months and we don't want it adjourned any further. I understand that completely, but what I want to make sure you understand is that your here and asking for the land use committee to recommend to the full board that they support this project and you're, holding back on information about a very important aspect of the project that's being proposed. It includes housing, it's in a different census tract, so it would be informative and enlightening to the land use committee members who have to vote and that's a mix of appointed and community members. I would ask them to vote tonight if you're ready to take a vote. I have seen project proposers come before this committee and be bombarded with questions like you faced this evening and though that proposer said look you know I had so many questions. Let me go back to the drawing board and I'll come back next month with revisions that you're complaining about. So if you are not prepared to address the tranches, the different sizes of apartments that you're going to put into the affordability plot for new york, the new york affordability program, I think it's going to dampen u.s chances of getting a supporting vote out of this committee this evening. We understand that we will submit the information to you after the hearing we're going to risk your negative vote. After all, this is supposed to be a vote regarding the aesthetic appropriateness of the building. It's not supposed to be a vote about affordable housing, but if you nevertheless decide that you want to make your vote based upon the affordable housing, that's your right to do it, and I didn't tell you I'm withholding information. I told you, I don't have it memorized and I'd rather make sure the information that you got was accurate, so tomorrow I will look in the books, provide the information and mail it to you, and if that information changes your mind between now and your full board hearing next week, then it'll change your mind. If it doesn't it won't? Okay, let me just let me just speak to that. The full board gets a recommendation from this land use committee and if your information that you're planning to send tomorrow would add to that review at the full board, then that's a good thing, but just to go back for a minute. The the project presentation was postponed in June, largely because the team didn't have a lot of answers. It was we got the presentation an hour or two before the meeting and then a lot of the answers were just not forthcoming. Questions came in from the audience and the committee in the community and the answers were just not there, so I just want to add that to your analysis of why this was postponed. No, we appreciate that nobody blamed you for it. I just pointed out there's a three-month delay that your board doesn't meet over the summer and you're aware some other boards do, but nevertheless we followed what your procedures were and we waited the three months and we came back with our complete program. I just didn't have memorized some of the information. Okay, I'm sorry! I just want to keep the record straight. The land use committee and the state liberty authority committee, those two committees of community board, eight meet July and august, and it was your team that decided to put off coming back during that time and to come back in September, and then it was pushed over to where we are now. So just keep that straight. We were told that we were that the community board wanted to not only have us present to the land use committee, but also to the full board, and that, because the full court was not meeting over the summer that we needed to postpone until after the summer. So that is actually what we were, that that's the message that was communicated to us and why we postponed it and we didn't appear in the summer because it was not meeting and LPC said that it was the community board's preference that we make a presentation because of the scope and scale of this project to both the land use committee and the full board. Well, that's not accurate, either. There's a misunderstanding buried in there. The full board meets in September, but the land use committee could have been reviewing your material at either one of its two meetings in July and august and still make the full board meeting in September, and so at this point please do not plan to make another presentation at next thursday's full board meeting. That is not the plan. That was not the plan when we discussed this with miss george and it wasn't discussed with me, so we don't do we don't do a redo of land use or other committee meetings at the full board meeting. That would be a six-hour meeting. Thank you. Excuse me. There are just a few more people left and I'd like to have them have their opportunity. Dylan p. Are you there? Yes, thank you I'm here, I'm I'm a resident of 959 park. I live directly across the proposed site and I want to thank everyone in the community. Who's come out and voice their opposition, and I really just want to to try to amplify. What's being said here by all of them. I think everyone's just made incredibly good points. I'm a I'm! A white male who's lived in this neighborhood for about three years, so I don't know if I can really speak with authority or credibility on what needs to be done to stop gentrification, but I'm pretty sure that this is not going to help this incredible community. I think it's pretty clear that the developers haven't engaged with the church in a meaningful and honest way, and it's pretty clear that the developers are being very clear about what the quote-unquote affordable options might be for whatever gets built at the 920 site. So I'd really encourage all of the elected officials who are on including mr carnegie to please don't paint this as a oh. There are two sides to this. There are multiple voices in the community. I think there's been overwhelming opposition, that's been voiced here tonight. I think there's going to continue to be overwhelming opposition and I'd hope that mr courtney and other elected officials continue to hear our voices from the community, and that's all I have to say thank you very much, I'd like to see something hold on please just one. Second, we have a. We have an order here, helen basil, would you still like to speak spatial hi? Thank you. First of all, I just want to express my opposition to the project. I'm I was very upset to hear about. What's going on within the congregation number one number two, since we're talking about aesthetics, there is no way that glass and steel belong in this neighborhood. I live on park place between kingston and Albany. I constantly go up and down kingston I mean sterling and park place this. The way that this is currently designed does not is inappropriate to the neighborhood it's inappropriate in terms of the glass and steel component, as well as the density and both the density physically, as well as the density. Essentially, it's a dormitory and that's all I have to say I exceed my time to other people who have comments. Thank you, miss bay show next up is jamie granville, ms granville, mrs ranville used to have a comment, a question. Basically, I put my comment in the chat that it would be very useful if mr carnegie would send people to the land use committee, so we wouldn't have to always chase him to get a conversation with him because he's very hard to reach. Unlike his predecessor, he does not have anybody in his office that deals with housing or land use. That's my comment. Thank you for that comment. Okay, chloe hi. I just wanted to express my opposition to this project. We are residents of 919 park place and we look out to on to the hebron school every day. I would firstly like to address that, since this is a meeting on aesthetic that I agree with the community that the aesthetic of this building is not in line with the historical buildings in this neighborhood. Beyond that, I would like to address the far-reaching financial impact on the community, though this building will offer the city mandated rent stabilized units. The impacts go beyond this to the community members living outside of this one particular proposed building. This development will push gentrification faster and farther than it then, in this already changing neighborhood. This building will raise the median rents in the surrounding community and will push out the residents that have lived here for generations. I think we have to look at this and I think council member cornegie should address this as well when he talks about both sides, and I think, when we're talking about our community, the side of the residents that have lived here for generations are an important voice that are expressing opposition. Thank you. Thank you. So much sarah lazor hi everyone, so I haven't been on the board for a very long time, but I have seen quite a few land use decision making proposals and the project that this that, in comparison, this brought to mind for me was one that had to do with the the back yard, essentially of the Weeksville houses. And you know when we're talking about landmarks. It's you know, they're aesthetics, but there's also historical continuity. There's the you know trying to find some sort of thread from the past into the present and with the Weeksville houses. The concept was the I. The project that was seeking approval was building a garden in the backyard and when the discussion was being had, they talked about how the Weeksville houses these amazing historic sites that exist in our district. You know this garden, it fits there's a you know. Obviously, the garden won't look exactly the way that the gardens looked when the when people actually lived in the Weeksville houses, but it's of a there's, a historical continuity between the youth at the time for this for this historic land and what they were trying to do with it- and you know this building that the school is in. You know I read the history about it and it used to be a home for the elderly and the indigent people who did not have tremendous resources. It wasn't for the richest people of new york. It was for people who, frankly, didn't have a whole lot and you know there's the aesthetic considerations in terms of historic landmarking, but there's also, you know the consideration of how does this piece of land fit in with the history of the neighborhood, and I just wanted to add that to the many important points that have been brought up already. Thank you well, thank you. So much ben weinberg. Please! Yes, can you hear me? Oh sorry, for the echo. Can you hear me? Yes, hello here you been yeah? Oh yes, sorry I always made it. Thank you. I just want to make a my name is ben weinberg. I live at the 960 sterling place, so that's right across the street from the proposed building. I just want to make comment about affordability. I know it was mentioned here that the program that a developer might choose was mentioned here, so I just wanted to clarify that you know in reality. The developer has no obligation here to build any affordable units right the moment that they pass the LPC the landmark preservation. Commission, no and the LPC cannot force them to build any kind of housing. So the moment they pass that no government agency can mandate them to do anything. They can tell us they can build 90, affordable housing, which they will not do, but there's no real guarantee for it. Now they also say that the building will be rent stabilized, but that just means that there will be market rate prices 70 if they will indeed build 30, affordable housing, so 70 would be market rate prices and they will be stabilized starting from a market rate prices which is out of reach for most of community members. Now, just to just to kind of give an example, I checked it because it's very easy to check you know we can see the other project that hope street capital has built before they take pride in it in their websites. Oh, that's. The developer, hopes to the capital they're, not an expert in affordable housing. They have two they've built two rental apartment buildings before the first one in Williamsburg, 55 hope street has no affordable units. The average rent there currently is 3 260 dollars. That's from street easy! It's very you can you can check it yourself? Then they build a second rental apartment building it's in long island city on jackson avenue. I think it's a luxury 175 unit, building with 35, affordable units, so they're 20, affordable units, but 80 of the units has an average rent of three thousand over three thousand dollars. Then they built a bunch of condo buildings which are around Brooklyn and there are some of the really priciest projects in the borough. Now I don't, they haven't built anything in our neighborhood yet, but just to get a sense of the expected rents. The marketplace in this project- we all we need to do- is just to look at other new developments of our rental apartment buildings in our neighborhood at 1511, bedford, ave, which is that huge building on bedford and near eastern parkway. If I remember correctly, that's 142 unit rental building opened two years ago, one bedroom there is sold for 2 900 a month across the street. There's another huge rental building, 401 eastern parkway one bedroom. There is three thousand dollars: that's just one bedroom right, three thousand dollars a month on average and then there's one a bit further from here at 564, st john's place, one bedroom. There is three thousand two hundred dollars and the first two projects I mentioned on bedford. They were built under the city's mandatory inclusion, air housing, which is a much stricter program for affordable housing, and it's still with these prices. This project again, the proposed project, has no it's not required to take part in any program, so they can set whatever prices they want. They can do the 30, affordable dimension and there were a lot of talk here about whether it's affordable or not, but they can also not do it we're over time. We're all the time. Mr weinberg, I finished my comments I have no. I think I meant excellent survey and it'll be in the record and let's see how it ties back to the material that we'll receive tomorrow. So I believe that was the last speaker from the community. No, it wasn't the last speaker and that's waiting is mr jose. I want. I also. I also want to say, mr weatherspoon, that we may have other elections. Okay, they have other elected officials in the audience who want to speak. I'm not sure, but this is the last person that I know of a gentleman in the who's been asking to speak in the comments. Since you know, for several hours now named alex wood, mrs weatherspoon will handle the who's coming onto the mic. Next go ahead and his website, okay, so mr o'say, chai or shah, you say so say: okay, mr alex wood. Please hello! I'll! Keep this quick! I live across the street, I'm at 960 sterling place. You know. Fortunately, many of the residents in our building do have rent protections, but I have seen people pushed out who are not protected due to rising costs. So I think all those comments are very accurate in the neighborhood when people have been pushed out of the neighborhood in recent years. But the main point I want to make is aside from aesthetics is just the massive size of this thing. It feels like the consultants looked at this piece of land and said: how can we squeeze every last penny out of that space? You know it's not just about finding the money to preserve it's hurt or about you know, building something for the neighborhood. It was, let's take every down to the centimeter bit of airspace, land space and apartment space and cram it in here to maximize profit. So I hope that landmarks and the community board will consider that the scope of it as well. You know this is not a modest proposal to meet the church's needs and the neighborhoods needs. This is a money grab. Thank you. Thank you. Well, thank you all, ms weatherspoon. Is there anyone else out there any elected officials in the audience that want to speak? Well, I believe we have orlando ross from yvette clark's office, congresswoman ivar clark, mr ross, any chance of me, hello, everyone, my name is I'm with congresswoman clark. This is a very informative meeting. I just want to let you know that I'm on the call and monitoring it and we'll be watching to see what is going to be done. Just wanted to reach out to everyone and just let you know you need to contact our office. I will be putting our information in the chat. Thank you. Are there any other officials present on this call? Well, I'm not an official, but I am a resident of the community hey. What's your name, sir, william wallace? Thank you please. I live directly across the street from this project on new york, avenue between park place and sterling place. I've lived in this community all my life, literally all my life. My parents bought this house when I was born 1953 and I'm so I'm the second generation here now, I'm raising my family in the same house, I'm totally against this this project. You know I've looked at. I look out my bedroom window and I see this beautiful property across the street and this proposed project that they want to build here will totally destroy the neighborhood that I'm so used that I've grown up here. I'd love, I went to saint gregory's all my sisters and brothers did, but I have a few proposals. Instead of building this project on sterling place, I look at this property and I see what appears to be a residential area on the park place side. Why not just renovate that spot that side of it that's just beyond where the school is and make that affordable housing where is really affordable? Housing further I'd like to propose to hope street that they take a look at alternate sites. Now that I happen to know, there's some vacant land. Now I don't what's happening with that land. I really don't know, but it's on Pacific street down between clausen and grand. It's much larger than this site; they want it. You know it's just land, there's nothing to nothing to demolish there. I'm sure that they can get in touch with whoever owns that property and make a deal over there. That land is sitting there. I've been eyeballing it for the past few years. I don't mean to interrupt. I really don't. Mr wallace. That's really a different type of conversation and we're needing to wrap it up. So I thank you for at least making yourself known. Okay. Thank you. Thank you, ursula. Can I can I ask one last question: I have this ingredient right here. Sorry, I have been putting them in the chat and for some reason I put two or three questions, but I like to add this one of hope, street capital and the question is: did you ever consider the environmental and health concerns of taking away one of only two open green areas in our neighborhood, which creates a heat island, reduces rain water absorption and diminishes the sewer system capacity for stormwater runoff? Was this discussed with hebron, since they will be greatly impacted as well. Green space is not wasted. Space climate science tells us that green space is essential to healthy communities, and we now have evidence that neighborhoods of color are plagued by higher temperatures and unhealthy environmental conditions due to racist redlining. How can you justify removing green space from a neighborhood and I'd like to continue with along with that? I think it's outrageous that the proposed development has no green initiative. Your most recent development at 98 front street is a leed certified luxury condo in the affluent, largely white neighborhood of Dumbo. Why is leed certification not being sought in our community a majority black working class neighborhood, whose existing environmental conditions are already far more dangerous than in Dumbo? Why is that not being considered for this community? Why are you not attempting to mitigate the devastating impact that your removal of green space will have in our community? I'm done. Thank you. I can answer that. I think that the allegation frankly is absurd. This is a lead building, just like Dumbo. The storm runoff claim is absurd. It is code from the department of buildings that you cannot let water run off your property. You must capture it. I think that what's been said today about what we're doing here about the heat island, the water runoff that we're not environmentally friendly, is completely false and it's it's an outright lie. So I really don't know what to tell you: it's a lead building. There is no runoff and we are subscribing to all lead parameters, and none of that was explained to us on June 23rd. Well, I just explained it was so invasive. You know your person, this raspberry was just so invasive about all the information that they shared with us. I was. I was not evasive on that meeting the team, because there were people who were qualified. Let me answer it: okay, we're not going to dissolve into diatribe it's still. Okay, there's nothing evasive about it. This has always been a lead building. It is the building code of the department of buildings. If you took the time to look it up, you would know that you can't let water run off your building. It has to stay on your lot. Mr gershon, mr gershon, you can counter that by merely pointing to the page in your presentation where you indicate that the building is lead certified, so I can't do that, but I'm saying it verbally if you'd like okay. Thank you very much. Thank you. Thank you very much. Okay, thank you. Are there? Are there any elected officials in the audience that want to speak? Do we have questions from the community committee members? I have something to say: I'm not elected official, but I live at 964 par place. I'm the fourth generation my grandparents bought car place in 1951. The only thing I want to add is: when you start I'm sorry, hello. Can you tell us your name, please, I'm sorry sharice terrain, I apologize. Thank you teresa, representing the robinson family. The only thing I would like to add is that, and I come from corporate America- is that when you come in to do any presentation right, you have to come in to the community right with a different type of attitude and I'm very uncomfortable with your attitude, sir. It's a very toxic masculinity approach, okay and then for the young lady, the woman of color. When I don't like how you are presenting yourself and it's making me very uncomfortable okay, so we need to change our tone because, when you're coming and presenting I'm a part of this community- and I'm my family has been here more than ever- almost everybody besides jeremy. So I have a right to say this: please don't you know all due respect elder, don't come into my time because I sit here patiently and what I don't like is when people come into our community and disrespect us. If someone asks you a question, you don't have a right to dismiss them and disregard what they're asking you. So we need to be professional and when we have concerns we have a right for our concerns to be addressed period. Thank you. Community has spoken in depth and at length. We have board members here. I'm sorry committee members here who I'm going to ask to ask their questions and then I'm going to ask for a motion and a second. So we can vote on whether or not to recommend to the full board to support this project committee members. Any questions hi ethel, it's gibb. I do have a question for the for the project team. If I may, please go ahead, I'm starting the clock go ahead. You know. I think one of the most objectionable ultimates of the project to me is the elevation from sterling place, which presents the context much higher than the row houses to the east. Now I've looked at this develop some of this developers. Other projects, the architects of their projects, and particularly the one that they did at 465 atlantic in borum hill, has a setback. That's much closer. That starts much closer to the roofs of the adjoining historic buildings than this one does and I'd like to ask if the if the project team would consider changing the elevation on sterling place, so, instead of starting the setback at what looks like sort of floor five yeah, it's really floor, it's really floor six if they started the setback at four but the floor four. Instead, to come closer to the roof line of the other row, houses on sterling place, and I think that would do a lot to make the massing look like it makes more sense on that block hi. This is morris edger, the architect for the project. I want to say a couple of things, I'm sad and that it's devolved into this bickering and I think it would be good if we could have a dialogue. I also think it's unfortunate when we tried to present this back in June that we weren't able to present it for technicality and I actually was shut down. When I tried to request to speak at the chat. All I wanted to say at that time is: let us present the project, so we can start the dialogue, you don't have to call for a vote and that would have given us three months to actually have a meaningful discussion. In any case, I would like to add two things, one to the person who said that we were squeezing every square inch out of the property we're leaving about fifty thousand square feet. That's fifty thousand square feet of developable rights back behind and we're not that we're not developing, because we wanted to keep this project low. The street wall is 60 feet. There are tremendous number of buildings that have higher street walls and most of the apartment buildings and many of the people that spoke earlier are in those buildings but as it pertains to the row houses. I certainly think that that's something that we can look at stepping down and we already made an effort to step that down, but we definitely could have a dialogue about modifying the design and looking at those things, this is a leed certified building. I'm sorry that I probably should have mentioned that earlier, but I don't think that we're trying to create a building we're building on a parking lot, we're landscaping the entire area between the two buildings and adding landscaping along sterling place. So we will be adding a lot of green literally to the building and we don't intend to do anything that would be increasing the heat island effect. So I hope that helps to answer some of those questions. I appreciate mr ajimi's answer with respect to the setback. I think that would help quite a bit on that elevation and I'm glad that you're open to considering that and I'd like to just address a couple other points quickly that were raised during the commentary. One relates to the affordable housing component of the project. Listen, it's not part of the LPC review, but it's very important to see that we get affordability levels that meet the community's needs. When any project comes before the community board, I don't think it's. I don't think it should be news to any land use attorney or any development team presenting here that a community board is expecting is expecting to see affordability at the median income that meets the neighborhoods needs and it's not affordable new york option c. So all it's our it's our prerogative during the time that we review these applications to look for commitments from developers that address those needs, even if they're, outside the scope of the landmarks of the landmarks review. I do want to make one final point to everyone in the audience, which is that this is not a euler application. This is a certificate of appropriateness and the LPC will vote on this, and their commissioner's vote you know, will carry the day the opportunity, therefore, to defeat the project on the battlefield is not a particularly strong one. I think the community has a better opportunity to try to get commitments from the developer to address some of these issues that were raised about context and about affordability than than trying to then trying to browbeat the project into non-existence. So I would, I would expect to try to move in that direction. If that's, if that's possible- and I can come back to that later after some other committee- members have had a chance to speak. Thank you very much. Thank you. Are there other committee members who may have put their questions in the chat or not, or do you just want to ask to speak now? Please speak up. Ask your questions. Make your statements. Committee members. I don't have a question. I wanted to make a statement, but I wanted to defer this is deborah young. I wanted to defer, until after committee, members have had an opportunity to ask specific questions to the proposed plan. Thank you. Miss young, I'm not seeing any questions coming in from committee members go ahead, please, okay! Alrighty! You know! I think that the significant issues have been presented by everyone on this call, those in support and those are posed, I'm in a unique position, because I'm wearing I'm on this call with three hats on one as a community board member one as the president of the crown heights, north association and co-founder and as a person, who's directly impacted by this project. I live across the street and I wake up in the morning and open my shutters and I see open space and when I think about the impact that this development would have on my quality of life as well as those who live in this community, I can't fathom it okay, our lives matter and I can't breathe when I think about what this building would do to the quality of our life. I totally support hebron, as I mentioned in my chat crown heights north beginning in 2004, started reaching out to hebron to help work with them to identify resources to restore that building. We made numerous calls after the 2004 meeting and we didn't get anywhere. We know that hebron reached out to I think hud. They made an application in 2006 for funding that did not go forward. We don't know why we again reached out to hebron in 2019. Well, maybe that was too late, but we made many calls and had attempted to meet with the hebron congregation again to bring resources to help her brian achieve their goals, a goal that we could support a goal. That would be a win-win for everyone, the habron school and the community. But people were not open. When I say people I mean the hug brawn congregation leadership, I should say we're not open to meeting with us. We are not beyond even doing that. Now. There are numerous people, many of them on this call today, who have rolled up their sleeves and begin to look at resources and are willing to work with lebron to help them restore that building housing can be done within the footprint of the exact same existing building. There have been ideas about how to maintain that open space that would be a win-win for the lebron and the community. The possibilities are endless without selling off this land that could be again a win-win for this community and for hebron. With that said, I propose that community board aid that this land use committee not support this project as presented. Thank you. I second that motion who was the second sharon wetterburn I would like to, and this is give I would I would. I would like to make an amendment to the motion that and that amendment is that the committee not support this project as presented unless the developers reduce this make a setback on the sterling place. Elevation at the fourth floor to reduce the massing of the building. Next to the row, houses of sterling place and commit to affordable new york option. A which will provide for a lower affordability level for the affordable units in the project with all due respective. I understand your position. I have a lot of respect for you and positions and what you bring to the table, but I cannot accept that amendment. It would require a second according to robert's rules. Okay, give you're, saying that your proposed amendment would require a second. Yes, if it doesn't have a second, it will die. I believe the initial emotion maker has to accept the amendment she, the emotion maker, does not have to accept the amendment as if it receives a second, but it seems that seems to change from other meetings. No, it's not it friendly. A friendly amendment can be accepted by the motion maker, but any amendment does not require the motion makers. Acceptance if there's a if there's a second. So if there's a second that's great, but if there's not, we don't need to have the discussion. Well, I think we need to pull out the book on robert's rules. Ms collins, I don't think there's a second for the amendment, so maybe mr viconi and miss collins. Let's proceed with the recommended approach and ask for a second on the motion to end: is there a section? Do we go? Why are we going to ask for that? If it's not legitimate, I mean we don't have to, except for what one person said. Let's look at the rules because I don't remember that going on in the committee. At any other time, miss collins, we've had a meeting. Now that's gone on for two hours and 45 minutes. I can't I can find out which rules and give you the citation, but if there is no second, there is no second, so I think that's probably the most expeditious way of dealing with it weather burns motion to withhold support. Then you would have to provide the citation. So I asked for a second on this striking motion to amend the withholding the support, in other words, to support the project. If the proposer agrees to a setback and what the other things mississippi would have to put his full amendment in the chat, so we have a record and it could be recited before it goes to vote. Is there a second on the amendment hearing? None. I refer to the initial motion with a second to withhold, support for the project and I will call the role on the committee princess ben james. How do you vote yes or no john balcoats vote against the motion in favor of the project. Thank you vote. Yes, you vote and you vote to support the project. Thank you, okay. Let me back up and I think the emotion needs to be made clearer, be rephrased. Thank you. Thank you. Yeah. This potion is to withhold support. So if you vote no you're saying you want to support the project. Yes, I believe the person who voted before me may have had the opposite intention, but I am voting to support the project. Okay, the motion is to withhold support. So if you vote yes, you're voting against the project. Okay, so can I yeah okay, that wasn't explained prior to me, I'm explaining it now. Thank you. So what is your vote? Ms ben james? I vote yes and mr buckholz, you understood it, but you still voted. Yes, no, I'm voting no! Now, okay. Thank you very much. Okay, mr callahan, do you vote to withhold support? I vote in favor of the motion to withhold support that is correct. Okay, janet collins. I vote in favor of the motion. Yes, norah daniel. I vote in favor of devotion. Yes, james ellis, I vote yes, kathy island, kathy island, kevin farley. I vote yes, kevin fred frazier, the johnny granville. I know she was on that. Oh yes, okay, zuzima, jordan, peter crassus. Yes, sarah luzor, laser lazar, it's lazar! Thank you. I got it. Okay, your vote, yes to the motion, no to the project. If that makes sense. Yes, the moment yeah. This is with whole support for the project. So you're voting. Yes, charity, jerry, norton, roberta adam sacks, yes, meredith dayton, meredith staton ethel tires. Yes, give vacaney; no here's a weatherspoon, yes jaren wetterburn, yes, deborah young, yes oops! Okay, we have one. Two three we have 14 to withhold four and two to not include support. Motion. Carries that I'm so sorry can you motion carries and will be recommended to the full board for next thursday's meeting. So with that said, I just want to suggest that there are options out there. I hope we can meet on this. I hope to hear from mr seagull tomorrow and we'll see how we can go forward. Thank you all for coming and we'll see you next thursday. Thank you apple. You run a good meeting. You're welcome. Thank you good night, everyone, the link for next, the link for the board meeting. The link for the full board meeting will be on the community board's calendar. Thank you all for coming and good night. Thank you. Thank you. Thank you. Thank you. Thank you. Thank you. I wish there were always this many people coming to land use, meetings, land use or any other meeting for that matter. 164 people on the call everybody come to land use. This is where it's at when we can come to the land use meetings. Is there something we can sign up for to get notifications? It's always on the first thursday of the month, unless there's some other thing that yeah, unless there's some other reason like a holiday, etcetera, but usually it's the first thursday of the month and check our calendar community brooklyncba.org go to meetings check the calendar. All of our committee meetings will be listed on the calendar. The webex links will be on the calendar. Thank you so much. Thank you guys, always so many exciting things to learn to pay attention to, and if you are there four times in a row, you get to be a public member three times you earn your oil. Okay, you got one. We get to be a public member. If you're there three times a week to vote, you get voting right. You earn your way. Oh wow, okay, cool consecutive meeting, awesome, I'm on board I'll see you guys have a good night.",
            "summary": "We support the projects based on the benefits that it will bring to the hebron church and to the hebron school currently unable to use the building too, due to unsafe conditions resulting from years of deferred.\nIt will also allow a new gymnasium to be built in the new building and 25 underground parking spaces for school and church use.\nWe think that the building that hope street has designed is a good component and a good complement to our building and the blending of the elements of the current building with the new building, and I just want to say here that we respect the rights of all individuals to express their opinions on the matter.\n, I'm, the senior conservator for jablonski building conservation 920 park place is formerly the Brooklyn methodist church home for the aged and infirm and is currently the hebron seventh-day adventist bilingual school.\nWe feel very strongly that the preservation research effort helped to inform the design process for this project and we endeavored to have the historic building speak with the proposed new building, both within a campus setting, as well as to have the new building respond to the neighborhood context in terms of height and massing and materials, and a variety of planes.\nThe team's due diligence efforts included looking at the LPC designation report, going to the site, carefully studying character, defining features of the historic building and reinterpreting these cues in a contemporary design.\nWe also carefully reviewed historic maps looking at the development of the hebron school over time, historic photographs and studying the context of the site and the neighborhood, and identifying local building typologies and building heights and massing.\nNeighborhood of Brooklyn, which includes three historic districts that have been designated by the new york city: Landmarks, preservation.\nIn, her statement, the former Brooklyn methodist episcopal church home for the age of an infirm and now known as the hebron school is an eclectic brick and brownstone institutional building.\nThe easternmost edition along park place and the chapel connected to the 1889 building, either with a small scale link such as the chapel or a change in planes such as the easternmost edition, which allowed both the original building and the additions to read legibly the southernmost low-pitched roof extension at the rear of the 1889 building that is proposed to be demolished abruptly abuts and encapsulates the 1889 gable ended facade the fourth floor of the southernmost extension in particular exhibits an uncomfortable relationship with the original gabled roof, which is blocked from public view.\nThe southernmost extension does not rise to the level of architectural merit of the other, well-designed 1911-13 editions, and we feel strongly that the proposed demolition of this extension would not detract from the special architectural character of the building or the crown heights north historic district, 2.\nNext, please, the team also looked at recurring patterns within the neighborhood, particularly the pattern of low-rise buildings located adjacent to larger scale buildings, as well as the pattern of green spaces located between the sidewalk and the street walls of the apartment buildings behind please.\nGable ends a play of planes, animating, the facades, brick cladding and landscape clothes that help to inform the design of the new building at sterling, place, and I would also reinforce that.\nThis entire project does include extensive restoration of the existing building complex at 920, park, and I'd like to talk to you about what we're proposing.\nOur current massing does not use all of the far or floor error that is permitted on the site, and we feel that what we've done in the next slide, you can see that we've carved the mass of the zoning envelope to address the historic building at 920 park, the school to the north of us, as well as the other buildings you see in the neighborhood next slide, please.\nAs misha mentioned earlier, we looked at the school building and took cues from that in terms of the gables, the dormers, the variety of heights and the setbacks, as identified in the color-coded in yellow purple, pink and gray, on both the existing structure and our proposed design with bubbles showing those areas of inspiration.\nWe have the proposed masonry rear facade the courtyard space that lies between the two buildings, the existing historic structure to the left here And then, a small minimized, ramp automobile ramp that takes you down to the parking below the gymnasium is actually can be accessed from right around here, And, so that's accessible to the community.\nThis is the proposed view, looking north from new york, avenue, So again, we're seeing that gable, ended, facade on the corner and then the window dormers themselves with the building somewhat visible.\nThis is a view taken a little further up sterling place, again, showing that gable ended facade with the window dormers and then the the rhythm that's created as we go down the street with these varying roof heights and alternating materials.\nThe background finally, landmarks had asked us to show the impact of the existing or of the new proposed design on the existing building.\nThe new york avenue elevation as it currently is, and then the park place elevation Then this is showing that same drawing with the proposed design in it.\nWe can see some of the heights where we are at a 60-foot street wall on the on the second place, facade 72 feet with the setback penthouse and The building across the street from us Is. Actually, a 69-foot street wall, similar as true on new york, avenue.\nThe park, place elevation, showing the existing building in front Then the impact of the proposed design, beyond.\nThis point, I want to hear for two from two or three members of the congregation who have asked to speak on this issue of how the project was approved.\nAs you all know, from the presentation, hebron, school and church, has been in the community since 1960.\nYou aware if there has been any discussion about insuring that revenue for the sale will be going to the congregation community and the renovation of this historic building, because this is what happened from what we know?\nWe know that they want to sell the bill, the land, but how much money is it going to cost to renovate the building the carbon present building right, now?\nThe resident of the apartment building legally have the right to use all the church ground and keep in mind that it's going to be a school there.\nMy name is at the top of the deal with the recent conference and hope capital, and we all we all know for a long time to keep people's school, and we have tried for many years to find ways and the norfolk has come out with a plan, and that was a lot of qualities and one of which was the one that we have now that we picked at the time that the church voted Was about 101 to 16 for the project and at least one there.\nYou know there was just a lack of transparency even on our level of people who could understand a lot of the information, so let alone We don't do this, we're going to lose the school I mean we need money.\nThe project goes against landmarks, law, the partial demolition of the historic structure, its inappropriate scale and style, the obscured sight, lines, the significant adverse impact on the old homes, visual entity and the character altering changes to the open space are all in direct violation of the city's environmental quality review.\nAt best hope, street capital will participate in the affordable new york housing program and offer 30 percent of apartments under this program, but the program's name is misleading by design.\nFor over 15 years, local community members, including members of the crown heights north association, have offered to meet with the church's leadership in order to share grant opportunities that would fund the restoration of this building.\nThis greedy developer shows no regard for community concerns, is willing to desecrate a landmark institution for its own profit, has no real intention of offering affordable housing and makes corrupt, backdoor deals behind the backs of hebron's members for the sake of our community.\nThe entire former methodist home site is part of a new york city, historic district, the crown heights north 2 district, both the building and the entire grounds.\nYour proposal does not take into consideration the needs of crown heights north community members in need of housing, many of whom have already been displaced by gentrification.\nI live at 11 2 park place And I'm just wondering about the consideration of the height, because it's so in striking contrast to the neighborhood, despite the architectural renderings that are trying to prove otherwise, and I, think that the regulator monolithic masking of it and the lack of like any sort of considerable setback from the actual street are particularly jarring, and I.\nUnderstand that there's going to be tremendous pressure on the community board to come to terms, and I know that projects that go to LPC usually end up getting built in some fashion, and You know if, for those people on the community board, who are interested in negotiating with the developers, what the markers might be for a project that actually benefits the people in the neighborhood, and I I'm, really just talking about affordable housing, as many people have pointed out, here.\nYou know the median income for black families here is probably 40 to 60 percent of the AMI, and so I think that if this is going to proceed in any fashion, the developers really have to choose the option under the affordable new york.\nA, where you know where most of the housing is most of the units are available at 40 to 60 percent of AMI, and they have to build units that are consistent with what people actually need here and not sort of warehousing for freelance graphic, designers, and I.\nThere's going to be a building built here, it's really got to be much smaller and much more consistent with the neighborhood and really preserve the green space on the sterling place.\nMy, question is: Why was hope street capital placing flyers in the neighborhood advertising the development as a in quotes new rent stable as residential building with affordable housing units distributed throughout the community?\nA building that first violates the landmark guidelines or whatever the laws are, but then also go about and not actually give what the community need, which is true, affordable, housing, we've seen it time and time again, Y'all profits before people profits before people.\nDon't think development should have a negative impact on communities, but you know the church who has a solid stake in how this happened.\nI've heard from them as well, and the church leadership And I'd, like to, as the council member, be given an opportunity to think this through have more dialogue and conversations with the community and not make a decision based on this particular call.\nI personally have to say that for the number of very educated people who are members of the hebron congregation- architects, engineers, accountants, lawyers, that there is funding for building schools on private property under charter school laws and rules through new york state department of education, so that money's been there.\nA lot of my neighbors, I have no problem with building new housing in the neighborhood, but it needs to be for the existing community, both in family sizes and rent, and that this building includes so many small units, like some of my neighbors have already mentioned, means that it's not built for families.\nIt will rob the neighborhood of space for buildings that do support families and schools.\nI, don't believe that personally, but what I do know is that a developer, like hope, street, I, think you all would have given the amount of experience that you have quite a bit of knowledge about just how many of the units might qualify for affordable housing and what that might be set.\nBut what I want to make sure you understand is that your here and asking for the land use committee to recommend to the full board that they support this project and you're, holding back on information about a very important aspect of the project.\nIt includes housing, it's in a different census tract, so it would be informative and enlightening to the land use committee members who have to vote and that's a mix of appointed and community members.\nI, have seen project proposers come before this committee and be bombarded with questions like you faced this evening and though that proposer said look you know, I had so many questions.\nWe were told that we were that the community board wanted to not only have us present to the land use committee, but also to the full board, and that, because the full court was not meeting over the summer that we needed to postpone until after the summer.\nWe didn't appear in the summer because it was not meeting and LPC said that it was the community board's preference that we make a presentation because of the scope and scale of this project to both the land use committee and the full board.\nBeyond that, I would like to address the far-reaching financial impact on the community, though this building will offer the city mandated rent stabilized units.\nThe impacts go beyond this to the community members living outside of this one particular proposed building.\nThe project that was seeking approval was building a garden in the backyard and when the discussion was being had, they talked about how the Weeksville houses these amazing historic sites that exist in our district.\nObviously, the garden, won't look exactly the way that the gardens looked when the when people actually lived in the Weeksville houses, but it's of a You know this building that the school is in.\nI live directly across the street from this project on new york, avenue between park place and sterling.\nAnd I, see this beautiful property across the street, and this proposed project that they want to build here will totally destroy the neighborhood that I'm so used that I've grown up here.\nHousing further I'd like to propose to hope street that they take a look at alternate: sites.\nWe can vote on whether or not to recommend to the full board to support this project committee.\nAny project comes before the community, board, I, don't think it's.\nPresenting here that a community board is expecting is expecting to see affordability at the median income that meets the neighborhoods needs and it's not affordable new york option c.\n, I think that the significant issues have been presented by everyone on this call, those in support and those are posed, I'm in a unique position, because I'm wearing I'm on this call with three hats on one as a community board member one as the president of the crown heights, north association and co-founder and as a person, who's directly impacted by this project.\nThat said, I propose that community board aid that this land use committee not support this project as presented.\nI. Second, that motion who was the second sharon wetterburn I, would like to, and this is give I, would like to make an amendment to the motion that and that amendment is that the committee not support this project as presented unless the developers reduce this, make a setback on the sterling place."
        }
    }
}