{
    "data": {
        "YoutubeMetadata": {
            "author": "SCB2",
            "channelId": "https://www.youtube.com/channel/UCKIWgeLY30w2rGRuJTw4_pg",
            "title": "October Monthly Meeting",
            "publishDate": "2020-10-20",
            "shortDescription": "Community Board 2\\nStaten Island\\nOctober Monthly Meeting\\nTuesday, October 13, 2020\\n7:00 PM",
            "lengthSeconds": "0:53:59"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "SCB2",
            "normalizedName": "Staten Island Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "CB2 Staten Island",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCyEZl1b4GuZ2zrJosoocsIw",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "_XirEyUjgDs",
            "fillerWordCount": {
                "uh": 9,
                "um": 25
            },
            "readTimeFullTranscript": "2 min read",
            "readTimeSummary": "1 min read",
            "wordCountFullTranscript": {
                "Applause": 19,
                "flag": 3,
                "bikes": 3,
                "locations": 2,
                "evening": 1,
                "allegiance": 1,
                "republic": 1,
                "nation": 1,
                "liberty": 1,
                "justice": 1
            },
            "wordCountSummary": {},
            "fullTranscript": "Hi Julie, okay, ready when you are okay, all right good evening. Everyone, let's get started, welcome to Community Ward 2's October meeting as usual. Let's salute the flag. David santoro has the flag behind him. Please thank you. I pledge allegiance to the flag of the United States of America and to the republic for which it stands. One nation under God indivisible with liberty and justice. Thank you very much. Okay. I guess we have enough to get started right, debs mark we have a few people on here. Okay, you have 45., okay, great attendance, hey everybody, ready aj, yes, alifi Babashkin Balzano, here cleft, here cognata, I'm here, Collegio Robert's, here d'amato di trapani Garlicy genevieves, here Magenta yeah, Tennessee, Jones, Ken, Khalid, Lagazzo, yeah, Lanza, Markowski yeah. There you go here, Mandy here, Nina Vagina, here, orlando Pacific, parallel here, Lugeria yeah santoro, here seminara, what's different from the origins is, is did a very good job. This is flaws. So just is thank you very much. How many bikes are we going to have on how many bikes are we going to have on how many bikes also regretting the right mix? I'm just curious what the locations that are on the street will have signage changes, so you won't be won't be allowed to park in that area, and Hayes can speak more to this, but as much as possible. We've placed them in locations where you already were not able to park places where maybe there was some strength is right. Now. Foreign, I noticed, is thank you very much. Okay, let's move along here questions okay[ Applause][, Applause], okay[, Applause][ Applause]. Thank you very much. Thank you very much[, Applause][ Applause][, Applause][ Applause] and as far as the electricity is was okay. This is[ Applause], you can't have the 20 pounds. Yes[ Applause] allowed is okay. Okay, we had a presentation, the Mid Island Additional, okay, before it is okay foreign. So if anyone has any real objections, yes[ Applause] is[, Applause][, Applause] oh[ Applause] okay[ Applause]. Can you see this is[ Applause] is[ Applause] says? Thank you. Okay[ Applause] thank you[ Applause]. Thank you. Everybody good night.",
            "summary": ""
        }
    }
}