{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "title": "Manhattan Community Board Six - Housing, Homeless, & Human Rights Committee Meeting",
            "publishDate": "2020-11-17",
            "shortDescription": "",
            "lengthSeconds": "2:00:05"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "a0S3b5Pes1U",
            "fillerWordCount": {
                "uh": 550,
                "um": 359
            },
            "readTimeFullTranscript": "68 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "shelter": 51,
                "clients": 46,
                "core": 43,
                "services": 36,
                "housing": 35,
                "families": 34,
                "family": 31,
                "security": 31,
                "sites": 29,
                "shelters": 25
            },
            "wordCountSummary": {
                "shelter": 14,
                "core": 12,
                "housing": 11,
                "services": 10,
                "families": 10,
                "street": 8,
                "clients": 8,
                "shelters": 8,
                "residents": 7,
                "security": 7
            },
            "fullTranscript": "But it looks like we're still waiting for folks from DHS to join and there's Matt from DHS joining now. Okay, you're live on YouTube. Now let me go ahead and start the screen share great. So are we good to go? Yes? Absolutely: okay, hi. Everyone welcome to the November 16 2020 meeting of the CB6 housing homeless and human Rights Committee. My name is Corinne Vanderdonk, I'm the chair of the CB6 housing homeless and human Rights committee. This meeting is called to order at 6:32 pm tonight we are joined by assistant district manager, Cody Osterman, members of the public. You can raise any questions or comments that you have through the Q&A feature of zoom. If there is time following the committee's discussion, we will feel questions is taking the minutes for tonight's meetings. Thank you. No problem. We will now take attendance by roll Call. Cody will conduct the roll call okay members of the committee when I call your name, please unmute yourself and say present I'll announce if there's quorum at the end. Joan Barrenbaum President Claire Brennan Andrew, Gross, Abby, Krusmark, President, Rich Mintz, present Rajnaya Present Matt, Roberts, Present, Andrew, Suresh, okay, Corinne Van, Der, Dank, present Jeff Zelen right now. You've got six of ten members on this committee present and Andrew has just joined so now, you're at seven great. Thank you. Okay, the agenda for tonight's meeting was to distribute it ahead of time by the board office and appears on the screen before you committee members. If there is no objection, we will adopt the agenda, as stated members of either committee. If you object to adopting the agenda, you may raise your hand through zoom, seeing no objections. The agenda for tonight's meeting is adopted. The minutes from the October 19th meeting and the May 19th joint committee meeting with the health and educated education committee were distributed ahead of time by the board office. If there's no objection, we will adopt the minutes. If you object to adopting either set of minutes, you may raise your hand through Zoom Corinne. There was actually a third set of minutes. It's the May 19th joint minutes with health, the September 21st and the October 19th. Sorry, okay, so I forgot to mention September 21st, yes, so October 19th may 19th and September 21st minutes no objection. These three sets of minutes are adopted and will be available on the CB6 website tomorrow. In order to conduct an efficient meeting, let's observe a few ground rules. No one may speak until granted the floor committee members. If you have a question about committee business or wish to make a motion, please raise your hand through zoom. If you click the participants icon, the participants panel should appear and you should find the race hand function there. If you still have technical difficulty, you may click the chat, icon and relay your difficulty. The chat function should not be used for committee business or questions about agenda topics. All remarks should be made on the record. By raising your hand, through zoom chat should only be used to alert us to any technical difficulties you are having or to state in writing information like an email address that was already stated aloud on the record during the meeting when a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak. We are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments, succinct and germane to the discussion, some expectations for the public. Thank you for joining tonight's meeting. Cb6 has been collecting questions and comments for the representatives of Core and DHS from the public ahead of the of this meeting. In addition to those questions following questions asked by members of the committee, you will be able to ask questions via the Zoom Q&A feature. We will try our best to get as many to get to as many questions as possible. Please try to limit yourself to one question. If, after the meeting, you still have lingering questions, please email us at info Cb6.Org and the CB6 office staff will work to get answers for you. The committee vice Chair, Rich Mintz, will be looking through the questions as they come in and will read the questions aloud and direct them to either DHS or core, and with that being said, our we'll get to our first agenda item, which is the presentation by core services, group and department of Homeless services on a new permanent homeless, shelter for adult families at 118, east 40th street. Sorry, I'm lost tracker. I will quickly just kind of talk a little bit about how things will run. The community board can not approve or reject the sighting of a new shell of a new shelter. This shelter is coming and DHS and core have joined. To answer the committee's questions and the public's questions. Once the site opens, CB6 elected officials and stakeholders will be on a community advisory board for the site so that we continue to have open lines of communication with DHS and core. Following this meeting, please email again info Cb6.Org. If you have any questions, I'm going to walk you through a few slides and then we'll have DHS present things about the Renwick hotel. So just some statistics, the New York City's, homeless, shelter population, as of July 2020, is close to 60,000. The largest percentage of that is families with 20,000 homeless children. The number of homeless adults in families is about 20,000 and then the homeless, single adults is also just under 20,000. Federal data from 2019 suggests that New York City really has 78,000 house residents, that is shelter and people living on the street, and that is not to mention many families that double up in apartments or triple up in apartments, especially nowadays. Cd6 is currently home to four permanent shelters, the intake, shelter, the men's shelter at First, Avenue and 30th Street Providence women's shelter on East 45th, Samaratan, Village, East, 53rd hand up safe haven on East 17th, so our fifth shelter when this site opens at 118 east 40th street, it will be the fifth permanent shelter in our community district. Now remember. This does not include temporary density reduction sites currently in use to prevent the spread of Covid-19. This will be CB6 first, adult family shelter and there will be a cab after it opens as I mentioned before. We will that's thank you. So these are the four temporary hotel sites in Cd6, the pod, East 39th or Marcel East 24th, Vanderbilt, East 47th, and the hotel at Lexington and 30th Street. Fair share. The latest fair share data that we have is from July 2019. I'm very aware that we would love to get new numbers on that and we're now at the end of 2020, and we have been pressuring the powers that be for new numbers, but for now what we have is this and compared to our neighbors, we are below average cd6 has 1.5 percent or about 850 shelter residents the highest. The communities with the highest percentage are in Queens the Bronx and Brooklyn, with the highest being 6.4 percent in the Bronx and again we are at one point: five percent. We can go to the yes, that's it correct. Oh, that's it. Okay, I'll, say: okay, oh yeah! So then, one of the other just reading the comments, the reading the questions I want to make everyone aware that you know this particular shelter is right at the border of CB6 and we're finding that some of these shelters are clustering around the borders of our community boards. So because of that, we are also joined today. Very gracious, grace gracefully by the district manager of CB5 Marissa and I'm Marissa and I totally scribbled. Her last name and I can't read it and then divide the chair and Vice Chair, Renee and Julie from the CB5 budget, education and City Services Committee. So if you have, for example, I believe main chance, there were quite a few questions about main chance that is in CB5. Now we don't want to say: oh that's, not our problem. It's in CB5, even though it's like literally like half a block away from our borders, but at the same time it is very hard to communicate. We need to get a better set of communications between the community boards between DHS, so that we're just not kind of working in our own little pocket, not knowing what's happening in CB5. So one of the things that I would like to talk about is better communication and sharing of information about districts close to us and with that I will handed the floor over to DHS. Thank you so much. Oh, hey Leilani! This is Matt Borden I apologize folks for not being there virtually I'm and having some technical problems on my end, but my name is Matt Board and I'm an assistant commissioner here at the Department of Social, Services and I, certainly before we begin I want to thank everyone on the board for their time tonight and also would like to start by introducing the folks who are here with me tonight. So I'm joined, of course by Leilani Irvin, who many of you may know who's our Manhattan district borough manager, and we are also we soon joined by Sonia Russell, who is here: okay, hi Sonia? Who is an assistant commissioner for adults and then from core we're honored to be joined, but I have Keisha Phipps here from core, along with Gordon Jackson, who will be handling security for the site, which I know everyone has lots of questions about, so I really would love if it works for everyone tonight, I'll be immersively brief. I'd love to just give you a quick spiel in terms of where we are how we got here and I'll turn it over to core to have them talk about what they do and then, let's just spend as much time as we can talking about services. Is that does that work? Okay, I'm gonna, say yes, so I once again, thank you. Everyone for joining. We are at the Department of Social services responsible for ensuring that anyone that seeks housing in New, York City that seeks temporary shelter is able to find it, and we do that, of course, by helping individuals who are both chronically the chronically street homeless. Folks who maybe should be sheltering outside, and those folks who may but seek shelter by coming to our intake center at 30th street and at 30th street is that's where we have our single adult men coming in and also we have our adult families tonight. The shelter that we're talking about at 118, east 40th street is going to be, of course, for adult families, as many of you may be familiar with are folks that are any kind of couple or partnership that are above 18. That can include folks that in domestic partnerships, as well as adult children and their moms, usually as well as any other kind of configuration that could be an adult family, adult families, shelters are some of the proudest work that we do are with adult. Family, shelters and communities have really grown to love having them in our community. As you can see, there was talk about moving folks from the harmonia, which is an arsenal family site, and that was talked about briefly, and it was quickly shut down because of the vociferous opposition to folks, leaving that site by the elected officials and community, because how much they really appreciated and having them as a part of their neighborhood framework. So for this site, as you mentioned, thank you for showing the various sites we have in the district. We certainly you know in cv6, in relation to the rest of the city. I think that you did a pretty good job explaining it. We're particularly excited about this site in part because of who we're partnering with we're only as good as our partners, and in this case core is one of the very best providers we have in the city. They operate excellent care and services for clients and they're, also one of the very best at doing the kind of community engagement necessary for shelters to be successful. It's not just about having a good shelter that provides services for clients in the building, but we're very aware that it's really important what happens outside the building is equally important and we really strive through, as you mentioned, having community advisory board to ensure that we will be able to make sure that we are held accountable and hold core accountable to do the kind of work that we expect with inside the building and also outside and without further ado Leilani. If I missed anything, please jump in, but if I haven't I'd like to turn it over to core and Keisha, and you can take it away. Thank you Matt, good afternoon or good evening. Everyone. My name is Keisha Phipps and I'm the Vp and chief administrative officer for core services. Group I want to thank everyone for the opportunity to speak. Today. We really as an organization we're strongly committed to having open and ongoing dialogue with the communities in which we serve, and you know, forums like this are especially important to us as we start programs, and we want to make sure that we can set up meaningful and sustained relationships with the community. So thank you again for the opportunity, as Matt highlighted. We are here today to talk about adult family shelter to be located at the Renwick hotel, 118, east 40th street core works daily with single adults, families with children and young people to harness their own strengths, and we basically identify and break barriers to independence and build bridges to self-sufficiency and change the lives of the clients that we serve. It's important for us to work with the populations because they're often overlooked and underserved, and we believe that all of us at some point need a helping hand and we really have a moral obligation to make a difference and to create opportunities for vulnerable populations here in New, York City I've been with core for about 10 years, and my position has really given me the vantage point of seeing the growth of the company. Today we serve about 3,000 clients daily in close to 40 sites, both in Washington DC and New York, and we have programs survey serving the re-entry population homeless, shelters for single adult males families with children, adult families, programs for runway, homeless, Youth, Lgbtq, Youth, homeless, young adults and person living with HIV Aids. We employ about 1200 employees who really represent the communities and clients that we serve and that's an important differentiator for us as an organization. We really believe that we have a strong record of performance across our portfolio and we distinguish ourselves in three ways. One is the quality, programming, security and resident accountability and, as Matt highlighted community relations, those are really the key cornerstones of what we do. We understand that for all our programs to be successfully integrated into the community, we really need a public that understands what we're trying to achieve what the purpose is and really neighbors who are comfortable with our procedures and the work that we do. So it's important for us to spend the time to really share that with you and to also be available throughout the operations to be able to address any concerns or even get your feedback or input on how programs can operate. So let me start. Matt talked a little bit about the adult family composition right, so it can be any family without minor children, so legally a legally married couple: domestic partners, adults who can demonstrate medical dependence on one another, two adults who have a family relationship, whether in supportive relationship, whether it's emotionally physically aunt, grandparent, parent to child or step child and siblings. Today, they're about so last night, there were about 2034 adult families living in shelter which consisted of 4,296 individuals core. Currently operates one adult family shelter in far rock away serving 160 families, and we take that responsibility very serious. If I could paint a picture of what a family could look, we see many success stories coming out of our programs. Our goal is to get them to permanency, to get them placed into some permanent living situation. We have a family that we're working with now husband and wife, who are both in their 50s they're, both born in New, York City, and you know many of our residents have strong personal experiences and ties to New York City and the couple was displaced after a severe storm destroyed their home, and so here we have. You know a family, Un families that we know that are working that really just had something happened in their lives that had them displaced. They joined our shelter in January 2020. This family has really been compliant and cooperative and has worked with the team to take advantage of the resources that have been available for them throughout their time with us, they've kept appointments. They've worked with our housing specialist to visit sites. They secured employment. Unfortunately, with the pandemic, they did lose that employment, but we're constantly working with them and I'm proud to say that we've been able to match the family, the husband's actually a veteran and so we're able to find them a veteran at one bedroom that they're going to be moving out to in the next week or two. And when you talk to that family they describe the scriptures department, has a dream apartment and that's really what we're trying to do to connect our adult families to a permanent living situation and to really support them in when they're most vulnerable to get them back on their feet. And so, even in shelter. Our families face more barriers and roadblocks, but they really work hand in hand with our staff who facilitate you, know their achievement of goals, while they're in their program, which get them to the ultimate goal of transitioning to permanency. So some of the I think what that story highlights is the importance of having a structured environment with programming where our families can be supported and, most importantly, well-run programs. You know that's just one example of how a family may enter shelter with their fam families come to shelter for a variety of reasons. You know some lose their jobs, some have experienced chronic trauma loss, some have histories of substance, abuse, mental illness. You know limited educational achievement, some are service resistant, and so it's our job to really identify what their strengths are and to help them address the barriers to independence and get them to a point where they can move out. Our work is grounded in the values of treating our clients with dignity and respect, first and foremost, understanding the importance of compassion, because we know that again they face myriad of challenges that we have to support them on a day-to-day basis and accountability and excellence. So we want to make sure that we hold our staff and we hold our clients accountable for, what's expected of them, while they're in the program, because only if everyone's doing what they're supposed to do, we actually get to the outcome. So as it relates to quality programming, our goal is to address the needs of the shelter population. So most important and foremost, we have to understand what those needs are. So the very first thing that happens when a client comes into our program. Is they get a comprehensive assessment? That assessment then drives what we call the individualized living plan and it will identify specific goals that client that will work on smart goals. So you know they're going to be specific. They're going to you know be time-bound for, however long we expect that person to be in the shelter achievable and we work with that client to achieve those goals. There's a they're assigned a case manager who will you know, provide services and in-house then also make referrals to community-based organizations, and one of the things that we will do is identify local community-based organizations that can enhance the services that are available for our clients. Housing placement, of course, is a big component. We'll have a housing specialist who will connect her clients with available units they'll create you know, constantly keep track of inventory. They'll escort our clients on visits to look at the viewings and their primary goal is to encourage the families to seek and accept. You know the first available housing, so we're constantly driving to move our clients out quickly and you know to make that resource available for the next family that may need it. Of course, we believe that employment and permanent housing are the twin keys to long-term success. So employment is a very big component of how we support our clients, so helping them with job readiness, preparation and placement doing workshops, and it's again we also will partner with community-based partners that provide these services in the community. We're helping our clients, understand, entitlements and benefits things that they're, you know have available to them to help them. With the move out on our staffing plan, we also have a social worker and they're looking at from a clinical perspective, the barriers that are facing our clients. Looking at counseling, you know anything from relapse, prevention, identifying, managing triggers and having those conversations in a clinical way and, of course, making referrals to community-based partners for any additional support that client may need in the community and one of the things so between the case management, individual counseling. You know employment, readiness, culturally concrete staff who understand the needs of the club, the clients and really those who understand the importance of compliance. We think that we really create quality programming that ultimately impacts our clients, one of the things we're also audited an ongoing basis. We work very closely with DHS, as Matt said. We really think see that relationship is very collaborative, and you know it's just a really strong partnership, but we also held accountable as a provider, and so you know our program. Analysts will come in and conduct audits to make sure that we're on track with the metrics that are in place for us. So, for example, you know ilps individual living plans have to be done with a certain time frame, making sure that those are in place making sure that we meet our targets for move outs and I'm proud to say that Julio De Jesus who's, also on the call Julia you want to do a little wave is our program director at our beach site and they do a phenomenal job of exiting the court. The move out targets each quarter, I think he mentioned. You have 50 move-outs, so far, right, Julio, so 50 in so far in 2020, and for us, that's what it's all about that outcome of being able to connect families to permanent housing and, of course, as we enter the wrap up the year. Our goal is to get everybody home for the holidays, and so we're constantly working towards that and everybody on our staffing pattern understands the importance of that, as it relates to security and accountability. We go above and beyond to make sure that we maintain a high standards of security. We take our promise as good neighbors very seriously. I mean safety has to be our highest priority and there are multiple things that we do to ensure that's in place. You know it starts with the program director who really plays a critical role in making sure that there is adequate supervision at the site to ensure that the safety and security of the residents, the staff, the visitors in the community as a whole. We have experienced staff who work tirelessly to secure the exterior interior of the facilities residents. Of course, have a curfew, that's designated by DHS at ten o'clock staff are trained to report incidents immediately and we're very responsive. We will have at the site seven security per shift and that's and that will be provided on site 24 7. three will be located at the front entrance to control, building access and to monitor the security cameras. We'll have one person really just students with the front desk and the other two will be with the wanting clients as they enter manning the metal detector and now we've added temperature checks as part of our Covid-19 protocol. Those are mandated for any person entering the facility and, of course ones are just to make sure that any no prohibited items are carried into the shelter and by doing that, we're also trying to enhance public safety. Three people are roving. We have clients, we have staff who are roving the building as well and roving the exterior the community we'll also do block row so, in addition to east 40th, the surrounding streets, just to make sure that clients are not loitering and you know we'll be directing clients back to the building. One of the things I think all together, we'll have about 45 staff at this site and it's important for that to make sure that we have the supervision both in the day and throughout the night, to ensure that everything is operating. As we expected so a lot of questions about food services, we will provide three meals a day and the breakfast lunch and dinner will be prepared on-site by a cook. We provide a diet, a licensed dietitian reviews, all the menus and approves the menus and to make sure that everything you know meets all the requirements for this population and I'm proud to say we actually get really good feedback on the food that we prepare. So we'll continue that, let's see from a good neighbor standpoint, I know that that's an important thing that the community is, you know always very interested in hearing. We want to make sure that we maintain good relationships with our neighbors and that's important, not just for us as an organization, but that's something that as it relates to independent living, we have to empower clients to be able to do, and so you know. Sometimes it's really having that conversation and setting that expectation about what is what they can do to strengthen their relationship with the community and as part of our intake. All of our clients are required to sign the good neighbor policy and our staff will review that with them and it will highlight what's expected and give specific examples of things that are not expected right, so littering playing loud music. Talking loudly, you know, loitering disorderly conduct we're very clear about what is expected and all of our staff reinforce the expectations in an ongoing basis. That's you know a very important part of what we do. I think Matt, you mentioned briefly with the chair, mentioned the community advisory board. That is an important piece of our model. We want to make sure that we engage community stakeholders that we have a forum to be able to hear. You know the voices of the of our neighbors, whether it's clergy, community-based leaders, residents and you know, create a space where you can talk freely and transparently, and you know, at the end of the day, hold us accountable for what it is that we're saying we're going to do. We try to hold ourselves accountable and we do believe that as part of the community, we have to be able to sit in sessions like this and answer questions and let you know what our plans are. So we as part of that we will, you know, set up meetings and come up with an agenda for how we, you know, share information about what's happening in the program. In fact, the community advisory board also enhances programming, because in some cases we may hear opportunities for employment for our clients. We may hear opportunities about folks potential staff that can work for us, so a mutually beneficial body, so to speak. That really helps us integrate our programs into the communities and really holds us accountable for our good neighbor strategies. I know there's some in addition to the community advisory board. We'll also have a dedicated phone line for residents who may have any questions and that's very real time. We want to make sure that we're responsive and, in fact, on our board Gordon Jackson, will speak next, he's our Vp of community affairs. So you know having on our executive team someone who's whose sole mandate is to engage with the community really speaks to our commitment to having real, meaningful conversations with the community. That is an important part of our model. Local input, and you know, partnership on an ongoing basis. So that's really a quick overview of core and the program that we will provide at 1:18, p's, 40th and I'll, open it up to Mr Jackson. If you want to talk a little bit more about the security and then we can maybe give Mr Dejesus just a quick second to talk about what he's been doing at beach. Thank you, miss Phipps, and thank you for everyone for setting up the platform as misfit shared, there's so many pieces that kind of go into the puzzle, making sure that we integrate a successful program model when we open up one thing, Miss Phipps did leave out she covered. So much was our commitment to safety goes beyond just the fact that our pro-court security will have guards on every shift. Part of our responsibility will be to engage the community. Obviously, we will obviously provide perimeter rules that will go one to four blocks away from the facility just a little bit about how our guards are trained. I saw some questions that had come up was really just about the competency of the guards and you know, are they equipped to handle any challenges that could come up? Our guards go through everything from Narcan training to first aid training to mental health awareness. They go through many of the trainings that our program staff go through because we know that guards are often the first line of observing behaviors that can sometimes impede on quality of life, so part of the core and pro core models that relate to security and how we manage and really look to get supportive relationships in a community really ties into quality of life right, because we want to make sure that, when this site opens at our clients can enjoy their quality of life, but at the same time balance that with the quality of life that already exist in the neighborhood. So some really good questions had come out and about just about safety and security. And what does that look like? And what does that translate to one thing about pro core security is that we also do bike perimeter roads, so you will see pro core bikes that will be, you know, really just community engaging so to speak and providing a security presence, we're not there to engage every single client. Sometimes we want to hear the good stories you want to hear the bad stories right. If something goes well, you see a client doing something great we'd like to hear just as much about that, as maybe somebody went through, did something that you thought may have had some level of concern to Mrip's point. We are available in real time. Procore security is the security company that supports this contract. My telephone number, our leadership at that site. There will be a security manager who will be at that site, as well as the operations coordinator, as well as the program director, and we all work together in the team. So if something happens at that site- and you see something we like to always borrow that phrase, if you see something say something we want to know about it in real time, if you see something at ten o'clock at night six o'clock in the morning eight o'clock in the evening- and you have some concern- reach out to us immediately- this method works best at our other sites. I sometimes will get a phone call or a picture or something at one o'clock in the morning. If we can either reinforce that, it's not our client and try to make a referral to see if we can get that individual some support, but we also want to only if it is our client. So we can make the proper referral to get them the support services that they need to change, that behavior and just the last piece I'd be remiss if I didn't mention it. As we talk about safety and security, let's talk about a little bit about where core and pro core at in terms of our coverage response myself, Ms Phipps, some other folks, with corn pro quo, we all sit on the committee right and we meet every week to talk about best practices and things that we can do to reduce the spread. So the company, you know, mask obviously always required with all staff. We provide enough PPE for staff. It's part of our messaging consistently because to Us safety starts with health care and wellness, and that's a big portion of what we do so I definitely want to turn it over to Mr Jesus who's on our team as well, who comes with the wealth of operational and experience just with DHS contracts and with the core team. Thank you Gordon. My name is Julio de Jesus. I am currently the program director at Beach House, located in far walkway. I'm also going to be overseeing the program at East, 14th, Street, 180, Eastman, 40th Street, and what we want to do as core is win the same type of program that we are running at these residents over to east 40th street we've been very successful here with the elected officials with the community members, we're on the community board 14 as well we're very integrated into the community. You know we are committed to helping our families in a constructive fashion. We, while challenging them to improve their lives by gaining and securing permanent housing and becoming contributing members of the community. Up to this day, like Mr speaks, are just stated. We have moved out 50 adult families into permanent housing. You know we are graded by department of Health services. It's like going to school again every poker. Every year we upgrade it with the common, honest services and every year you know we go above and beyond our targets. Of course, we have those plans that you know that going to be a challenging and that's when we start building the layers and we'll start working with those clients and in one case managers, though, it's not successful, we'll pass it on to the other case manager. Until we find somebody that could identify with that client and help them out and get into permanent housing. We just recently moved out a family that was very difficult to work with the adult member was bed bound. One of the other members was Bill Barr and it was very difficult to work with, and it was a very successful story. Also DHS appreciated our effort on moving this family out into the community. Our program services include, like misfits our stated case, management entitlements, employment services and house insurance assistance. These works will continue in coordination with neighborhood groups and public agencies to help the homeless families outside each family situation is stabilized until they are ready to re-enter the private housing system. Once again, I'm going to be available I will provide my phone number I will be your point of contact. I'm available, 24 7. I do not get away from any problems. You know the best thing to do, I'm a hands-on person and that's how it stops on I solve problems. You know I'm involved with every client in this facility. I know them each by name. Okay, I've got some questions where there's only going to be security on site. No we're going to have core staff on site, 24 7. we're going to have a shift supervisor work for core services, along with a supervisor from the security company from pro core. Our supervisor from core services has more experience in and engaging the clients we're going to have such case managers on site from one to nine every day on saturdays or do from nine to five thirty. We're also gonna have some social workers on site as well, and this is for those clients that you know a lot of clients. You know they come with a lot of issues and they don't trust everybody. You know, but that's how we gain the trust. The first thing about this kind is getting the choice. Once you gain the client's trust, then we could help them out. You know it's about respecting them. You know and getting their trust. I have learned through all my years of working with homeless families that you know it's what you do for them that count. You know at the end of the day, it's about providing the services to the people that really need it. You know a lot of these families, they don't deserve to be homeless, but yeah here we are, you know. At the end of the day, you know, I could identify myself with a lot of his families and I'm pretty sure that some of the members in this panel who also identify themselves with some of these families- you know it's about Kevin. These are human beings, you know and for me, I, take this very personal and I understand your concerns about your community, but believe in me, when I tell you, I will be there for you. I will be there to assist you with anything that I can and also Paul will back us up. I've been working with core little on the four years and I'm very proud to be a member of core services group. You know I've been doing this for 20 years. I only work for three providers, and this is the best provider that I know. That is that really cares about what they do. You know they are very bested in what they're doing and I'm very proud to be, taking on a new challenge, a new program that I know that my services could be appreciated. That's all I have to say thank you Julio. Thank you. Leilani! Do you want to close out? I'm not sure I think that you all really covered it all, but only thing I would add. Is that with every site that becomes live once it once the sites open which this particular site is slated to open late December of this year will come with the community advisory board, and so that is what I will call on the community board to help me identify ideal, Cad participants and elected officials to help us identify who those members in the community would be great to be a part of that community advisory board once is formed, and that is a system where it's kind of like a checks and balances. It allows for community to have input in real time directly to the sites in the agency and also to make sure that we're being held accountable, and so I'm happy that will be formed and happy to state. That is something that core ndhs in partnership with the electeds and the community board will help to create and form so that will only become live once the site has once the site opens up and Sonia that's correct right. This site is slated to open late December of this year, you're on youth. Okay, I'm sorry! Yes, the goal is to have this site: open, December, 15th, okay, right! Thank you so much for that was a lot of information and I. Thank you so much and I'm just going to ask a few questions and then hand it over to my vice chair, Rich Mintz who's going to field questions from the public. This is a question for I guess for DHS or core. How was this particular site chosen? What was the criteria behind sure? So, as we've? That's a great question, totally understandable. So, as we have stated publicly many times, we are always open and trying to find new sites. We have what's known as an open-ended RFP process. So in order for folks to get forget sites to us, a developer will link up with a provider. The provider will submit a proposal to us. We grade the proposal, we look at it. We think if it's appropriate or not and then ultimately that proposal gets rated and if it has a high enough rating, then it becomes something that we move forward with and yeah that's and that's how this site came to be sorry. So it's in your saying you have an open RFP is it was suggested this site or I. Don't know in this case if it was the if the developer came to us and then found core afterwards or vice versa, but that's ultimately how it costs. But ultimately the proposal is submitted by Corps, so, okay, so businesses may be a question for core why this particular site other worry yeah? What about this site was so particular appealing, yeah, so I think one of the barriers. One of the challenges with you know providing the programs that we do is really having site control having sites that can accommodate the capacity that's needed, and in this particular case we had. We were able to work with the landlord to get access to this to the building and it can accommodate. You know upwards of 170 families which would meet the need for DHS, and so we did submit a proposal for this site as in response to the open-ended RFP, and then we were awarded subsequently okay, great, thank you so, and you said, there's a 170 families. Is there a maximum occupancy? There's 107? Are there 170 units there are Sony? Maybe I'm not sure what the final count is that I believe the so some of the space will be used for offices and then the others for accommodation for families, I, believe the capacity is 172. units and how about the total population, so that may vary depending on the family composition. Some of the family compositions are, of course two adults, some, maybe three, so it would depend primarily on the spacing some of the rooms at the windwork are very large and can probably accommodate more than two family members, whereas some of them, we would only put two because of the size of the room, but primarily it's for a cup for two adults. Great. Thank you so I mean that gives us an idea. This is I. Think for DHS. Do you have the numbers of exactly how many permanent shelters there are going to be when we take CB5 and CB6 and lump them together? Do we have that I? How many permanents? Why would we I? Don't I'm not quite sure, I understand? Why would we? What are we lumping together, CB5 and Cb64, and why not CB4 or Cv3, but just wondering about the Murray Hill neighborhood in particular, got it there is no I, don't I mean we have that we have the numbers off, I mean I, think you had the numbers for CB6 the numbers for CB5 I don't have on me. We are using quite a few covered commercial hotels in Community board five. However, we are extremely hopeful and excited to get out of those hotels. We do not wanna be in hotels, it's very clear that we would want to be in shelters like the runway, but we can actually have the kind of all services that we needed and I'm very hopeful that we'll be able to as soon as we get the green light from the folks in the state in the city health department remove folks out of these temporary commercial hotels and natural permanent shelter. Of course great thank you. I know: Cody Osterman, the assistant district manager wanted to speak a little bit about my question: Cody hi. Thank you. Corinne for Matt or Leilani or Sonia I. Think what some folks in the Q&A are expressing is just some concern about the transparency of the citing process, so I'm hoping that one of you can just walk us through for the community how the citing process works, how the fair share analysis works if there is up-to-date, fair share analysis that takes into account this new site and then finally, one thing that I know is frustrating for some folks who are asking questions from the public. Is that they're you know for if you live in Murray Hill, you don't know, perhaps maybe, where the line between community board five is in community board. Six, is you know your neighborhood so to have it not viewed as a neighborhood and to not have data on that is really kind of frustrating to some folks here, so we just want. You know to be able to offer the community as much information and transparency about this whole process as possible. Thank you sure. So, I'm happy to take that question and in part you know. The Murray Hill community is very, is one that's very fond and near to my heart in part, because my father and my stepmother actually live on 36th street on the east side and our and I think I actually saw some of the questions that were submitted actually are literally neighbors to my parents. So I'm very aware of this neighborhood this community and in terms of the impact the site will have on folks. Let me just let's start from the beginning by saying that this site, because we're working with the kind of provider that we're talking about and because we are so thoughtful and concerned and have to share the concerns, is not going to have the kind of impact that some folks may be concerned about right. So I just want to start with there, because there's a lot of fear-based concerns regarding our sites and there's a lot of fear regarding what does it mean to have shelters and I just again want to circle back to that? You know we're talking here about adult families, and these are folks- and these are New Yorkers- that are really trying to get their life back together and they're back on their feet as part of a family unit, and this is this site is going to be really important to them to help figure out how they can get back on the path to permanency and in terms of how sites are selected. I'm happy to talk about it again. What we have is an open-ended RFP process, because New York City has a legal mandate to provide shelter for all those who need it. What we have to do is we have to have a rolling, basically submission process where sites are and historically I'll, be quite honest. These sites were placed in black and brown communities. It's full stop period. There are sites, there are neighborhoods in the Bronx and they're neighborhoods in Queens, where there are upwards to 20, 30 and even 40, shelters, and so part of this administration has been very deliberate about. Where are we putting our sites and making sure that those sites are actually equally balanced? And we are, our goal is to make sure that we have sites in every community board where there are folks where they're that are coming in and experiencing homelessness in terms of the fair share process. The fair share criteria, which is adopted by city Planning Commission according to the city charter, is about trying to foster equitable distribution throughout the city by establishing considerations that must be taken into account as we select these new sites and the criteria includes our stated need for the facility and the size of the site and also our ability to provide efficient and cost effective delivery of services. Ultimately, when we're doing fair share criteria, there's not a numerical limit on the city's ability to site facilities, but rather the criteria states that any concentration of facilities must be considered and disclosed and for this site, as we've talked about before that, there is a fair share. That's currently being developed and worked on and before this site opens and before there's a single person in it, it'll be published and the community board will have a copy of it and folks can see it. Thank you so much Matthew I, just of I'll start with one question that I have for security for Mr Gordon Jackson. We have breaking ground Jim Hodgins from breaking ground who's. Our outreach who's part of the outreach in our community board. Six listening to us- and you know, looking at a lot of the questions you know there is, you know, there's a difference between on house living on the street and the on house. That are, you know, and people are going to be at the Renwick and sometimes the community is confused. What's you know like and things that maybe the problems are coming from the Renwick when they're really coming from other in individuals? Are you going to Mike? Are you going to have direct communication with breaking ground, yeah good question? We will we're familiar with breaking ground's work and part of our community engagement process. Our perimeter roving will be to make sure that we establish a good report. We've actually sat on some panels and with folks from breaking ground, so we know their work and we were honored to have to be able to partner with them. With this. For two reasons, one: when our regards are outdoing perimeter ropes, they will carry PPE they'll, carry mass they'll, carry anything that they can give to somebody, whether it's somebody who's street homeless or whether it's one of our clients, perhaps just somebody who needs a mask. So one thing we want to do and I want to be really and I'll follow up with the person from breaking on breaking ground who's on. The call afterwards is to make sure that we establish that relationship so that we can help identify and make a distinction between who is a client that resides at this location versus somebody who may just be in need of services. So, yes, that's definitely part of how we operate great. Thank you. So much for that answer. I just want to end. Let's I want to stop talking after say. One thing you know: I live on. 18Th street and I can see the 17th Street safe haven from my windows, and you know it's just been really lovely to have them as neighbors. It's great to know that people have a place to go to. There are no problems coming from a well-run shelter and considering that the Renwick is opening up in the Mid-December I would encourage people to consider donating holiday items, not a fresh tree. That's not allowed a fake tree. If anybody has a fake tree that a police contact our office and we'll see that we can get it to the right people at the Renwick and with that I'm going to first call on one of our committee members and then rich Mintz is going to open up the questions. Andrew Gross all right question thanks. So much I just want to say, as a member of the committee and I recognize how many participants there's like 200 people on this call, there's like over 100 questions and it would just be without it would be unfair if I didn't recognize the fact that, as a neighbor to the site, that's on 47th street what a failure I think the city has done and how they communicate with us on the committee on the board and also all the people who live in not just our district but other districts. It's the second time that one of these shelters has been put up with no communication, and the city can say that they have this meeting, but the fact that matters. If you look even at these questions, then it again happens and it's an attitude that the city is going to go and do these things and take these actions and basically do what they want and have these meetings after the fact and I give a lot of credit to the people from core sounds like they've got a great operation. I really appreciate the security because living here as a neighbor to this facility, it hasn't been so great I, see drug use, people shooting up drug needles, I see people defecating next to my building, I see horrible behavior here, and people have a right and I, as a member of this committee, have a right to be a voice for the over the almost 200 people in this meeting. Right now, who are clearly very upset and scared, have been living in this community for years without incident and are seeing what's going on here and so I. Just think that the communication from the city has been so par, I think the security, at least in my area, has not been very good at all I. It sounds like core. Has a serious operation: they're gonna have perimeter security. That sounds. That's very important. I appreciate them, making that ultra clear, because that was never made clear about the site that I live next to, but I think the main question that I have on behalf of a lot of people in this meeting. Who again it's not just me representing a lot of people who feel this way. How is the communication from the city going to change, because this just doesn't seem fair to everyone, who's living and by the way, extremely sympathetic to these people who are, in these situations extremely sympathetic to homeless people extremely sympathetic to people in need? But when you see these things happening in our community, just have to say something: I mean I completely hear what you're saying Andrew but I do have to say. As the chair of the housing and Homeless Committee I thought that most people, when they say I, want to be notified before they open I want to hear before they open. But people really want to say: is I'm going to do everything to stop this and that's really what the kind of the subtitles are to that particular question at the same time, you know the community has no say, and you know it is- it can be at times frustrating, but to answer your question that is, in my opinion, the answer is this: is that basically only communities that have the time and the resources to change? Some of these decisions will have these decisions changed if they are given enough opportunity in time and with the you know, Cb-8 being a very good example of how the powerful will end up diverting, you know becoming nimbies, and it's just it's not a pretty sight. Sorry and yeah DHS can also respond to Andrew if they want. You know, I'm sorry, that those feelings exist. I think that it's incredibly important to talk about the sites individually as we're talking about and the population that they're serving and who they're and what's happening with them. This site, as you've mentioned, is going to be operated by core and I would ask that we talk about what's happening with this site and certainly we're happy to have community conversations regarding this site moving forward, as it is a permanent shelter I believe, I'm not quite sure what the 747 shoot is if it's maybe temporary beds that are being utilized by the Y right now, we've had community conversations about it. You guys have proved it. You should know about it. It's the 47th street Y yeah right, wait! You well, you didn't say that you just said 47th street. So again, we've had conversations with that. We've talked to community about that. We've actually met folks from the plaza nearby and actually on site and did a walk through and again I think it's challenging. I'm sorry that if you're not looped into the conversation, we can certainly happen to circle back and make sure you are for future conversations, but we certainly want to be responsive whenever we can thank you and with that, I am opening it to rich. Who is going to try to get some of try to get to as many questions as possible? Yes, I! Thank you. Can you all hear me? Yes, so we got a few dozen questions in advance and several dozen questions and comments. Since this meeting started, I've tried to pull up from them and consolidate them, so we can get as many issues addressed as possible during this question period. If you don't get a satisfactory answer to your question, please feel free to follow up with our office at info Cbsix.Org and we will we'll tr. Someone in the office is trying to deal with it. I will start just very briefly by noting my own experience. I live across the street from a temporary hotel, shelter operated not by core by another provider, but everything is very similar from the structure of the security to the engagement with the neighborhood and so forth. We have a direct phone number to this. I live our building. Our co-op board has been in communication with the shelter operators. We have the phone number of security director. It works. They pick it up. One thing that we did ask for because we have, we had a few I would say minor disruptions when the thing first went in due in part, I think to, as Andrew pointed out, a lack of understanding of what to expect, because I think communication wasn't that great at the beginning. But one thing we asked for is for a security guard to be posted outside 24 7. We got that it made a big difference in terms of the feeling of the people who live here that things are under control. One of the things we've learned is that the security staff know all the residents personally and know exactly who is likely to have what kinds of issues challenges or problems. So that when we bring up an issue with the security team, they generally know exactly what the issue is. The other thing we learned is that they are in direct communication with the 13th precinct, and the police officers at the 13th are also familiar with individuals associated with this, with the shelter who pose a challenge, and the final thing that I'll say is that they also require residents to sign a good neighbor policy. It seems to work like all the people I deal with. Are our residents are amicable and stable, and so I just want to I just want to say that by way of illustration, that it's possible for this to go well and for these facilities to go into place without a huge negative impact on the community on the rest of the community, because obviously they have a positive impact on the residents. So I'm gonna go through some questions that I pulled and I'm gonna. These are kind of out of order, because I pulled stuff in and consolidated it, but I'll just go what kind of background checks or, if applicable, criminal checks are performed on residents before they are invited to be residents of these facilities. So I'll I'm happy to answer that, so there are none just like any other building in New, York, City or a hotel. You know folks can come into the into our sites, regardless of their criminal background or criminal record, and if you are the only thing, that's matters is if you, in this case you and your loved one are in need of housing and we are there to help provide it. Okay, a related question: there's a perception, apparently that when these facilities go into a neighborhood crime goes up. We know that objectively, crime is down 28 day. Crime is down, 20 24, sorry 33, compared to last year. Year-To-Date is down 16, but we also know that burglary is up, and I'm wondering if anyone from DHS can comment on whether you do notice an increase in crime when new facilities are opened, listen well, I'll, say I've been to community meetings before where people from NYPD have spoken up and said the exact opposite that actually bringing sites has they've actually seen crime go down. I think it's really challenging to talk about crime statistics and certainly in regard to homeless people or shelters, especially at this moment in time. Obviously, the city is facing all sorts of unusual situations right now, given where we are with the pandemic. So I don't really think that it would be makes sense to opine upon it, but I think in our experience that there has not been a rash of incidents that have happened when sites have opened I. Think if there were, if you look out, the media covers shelters pretty closely. Folks would definitely hear about it in our experience. That hasn't been the case and I think it's in part because who we're choosing to partner with, and the kind of rules and regulations that are being established within internally within shelters and the kind of care and compassionate that are being offered by these providers, and so I have not seen that again. As I said, I have my I have family that live in this neighborhood family. That's close to me, I do not feel concerned at all for their safety. Okay. Thank you. A question about the temporary hotel shelter program, which you already said sure is likely to be scaled down sooner rather than later. One question that someone asked related to those which I think also applies to this is going to be an adult family shelter. Is there any possibility that the type of residents will change without the input of the community? That's a great question. So I can only unfortunately, I can only answer it in terms of this administration because there is not as when it comes to buildings and shelters. Ultimately, it's the need of the city that drives and the capacity and what we need that drive. The kind of sites that we have and so I can say that there is absolutely there's a zero percent chance that this site gets changed within this administration. I would think that it wouldn't get changed in the future administrations. I think when sites work, I, don't think that there are occasionally flips that do take place. Those are the rare exception to the rule, but I can't, unfortunately, look into the future and make that determination, given how the system operates, but I would not expect that to happen. No okay, thank you. Here's a question for core, and these are really two related questions about interface between the facility and the community. Someone named Kathleen asks. First, can we have a community liaison on site who's uniformed or badged or otherwise identifiable who people can speak to directly if they have questions or issues and related to that? What does core recommend that community members do in order to smooth the relationship between the people who are neighbors to the facility and the operators and residents in the facility? I'll answer that question. Thank you. It's a very good question. So, let's start with what neighbors can do? One thing that will be available is my telephone number, as well as Mr ACES will be available 24 hours a day, if you want to reach out with any types of concerns that you may have. Additionally, I will be out handing out business cards to local businesses to let them know that we are available to keep an open line of communication, no matter what happens additionally, as part of the staff and patent at this particular site. There's a security manager who will be on site who oversees the leadership for security at that site. His telephone number and business card will be made available as well, so that we can support a continued dialogue about any of the issues or challenges that may come up. So those are just some of the things and just in terms of how we work with the community as a company core, as a company is very committed to our community engagement arm of what we do, and that translates from everything from being involved with black association events that may be coming up. We can demonstrate in other sites that we've had across the city, where we shovel snow, for the entire block as part of our commitment to making sure that we help preserve the quality of life and integrity of the block we planted flowers we planted tulips and we've had a lot of really good, strong success stories that have come out of partnering locally with the community. I think to riches point here made some observations that, when a good provider is in place, good security is in place a community. That's as engaged as you guys are right now that this operation and what obviously, with the strong support that we get from DHS the relationship can work and some of the concerns and anxiety that you have are addressed. When you see a good provider in place, support and supporting what your concerns are so yeah and just to respond directly to that. It's not that we don't have any concerns. Certainly, we now have people living on the block who are different than the people who are living here before there are people who, at some times of the day, are gathering on the sidewalk and some of the other residents of our neighborhood are made uncomfortable by that. But you know the fact is we understand that everyone has a right to be in public space as long as they're, not disruptive, and so we are trying to work with the facility to make room for everyone. So I'm gonna move on to another topic which we got several questions about, that I've heard to squish into one discussion, and that is questions about substance abuse related to the facility. Someone asked what the likely percentage of residents are, who will be abusers of illegal substances and what to do in real time if someone is seen injecting drugs or using illegal substances in another way in a way that is in public or dangerous that we think is connected to the facility. Well, I think I'd like to let Corey answer that question, but I'd first like to ask for those of those who think of those folks who are living in apartment buildings, to ask that same question of your neighbors and if and how, what percentage of your neighbors that you think are using illegal drugs in your building. You know I, think that that's a question that we all could think about and talk about, I. Think. If we're talking about you know how are we making sure that clients remain safe and that their health is maintained? I'm happy to have core answer that question. Well, so, if you see any quality of life concerns, you see any clients engaging in any behaviors that are concerning, which would be obviously, if you see a client or someone that you think may be a client engaging in use of illegal drugs or a lawyer, or doing anything that you think would be an impedement on the quality of life. We would like to have an op. You know as conversations like this continue through the community advisory board through the relationship with the NCOS from the 13th precinct. We would like that they would identify these clients, because one we want to make sure that we are single enough, that it's not a client right now. This could be somebody who's in these services, but you can rest assure that we want those behaviors reported, because it gives us an opportunity to do our job better right, because then we can make the appropriate referrals that we need to get that person the support services that they need to be successful. Thank you. We I'm sorry, I'm moving so fast, but I want to squeeze as many of these in as possible. In the limited time we have a couple of questions about permanent, supportive housing. Someone asked what the plans are to develop more permanent, supporting supportive housing in communities in district 6, so that people can be given more stable places to live in lieu of shelters and a related question is: can someone talk about the cost of operating a shelter like this compared to the cost of developing permanent supportive housing or turning this facility into permanent supportive housing? So, unfortunately, I don't think that I can opine upon the cost of those? Two different factors as that's not, that is that as the part of social services, we don't actually operate that kind of supportive housing. However, I will say this: we are actively looking whenever we can to figure out if there are opportunities to convert shelter that we have in existence to also include a permanent, affordable housing as a part of it. We think that that's a great model, part of the turning the tide was basically looking at places how we could expand our footprint. There are places where their shelter, where we can, if we could build up we'd love to build it, build more on the site and create more affordable housing as a part of it. So that's something that we continue, that we will do and I promise to keep this board. You know looped in as we have those conversations as we look about the city because obviously affordable housing is so important, so I don't have an answer for though the cost of one versus another, duke I, can't remember, but do we still have do we have anyone from breaking ground on here? Who would like to speak briefly about the mechanisms for developing permanent supportive housing and the costs for that I can't see who's online? You do have somebody from breaking ground. This is Jim Hudson, the assistant director of the Street Homeless Outreach. So it's not your specific period. No, not at all. I'm afraid, I'm sorry about that. Okay, all right well, I mean this is a question that we've talked about before in committee, and so we probably will need to get some more information about the mechanisms for developing permanent supportive housing. I have a another cluster of questions which are related to the how residents will be evaluated for psychiatric and employment. Counseling needs whether those services will be provided on site and how this compares to how things are done in other shelters core. Would you like to answer that question or Sonia sure we as part of the staffing model I, think I mentioned? We will have a social worker on site who will be responsible for providing doing biopsychosocial assessments of all the clients. So, looking at the client's history getting trying to understand the narrative around their background and really getting to the clinical needs of that client. In some cases they will work with their case manager. We also have an employment specialist on site and the employment specialist is tasked with doing some of that job readiness prepare preparation, helping them with placement, doing workshops, helping them with resume writing or doing referrals to agencies that focus on that employment, readiness, the social worker, the case managers are looking at the specific assessments or whether it's substance, abuse mental illness and we're working in partnership with DHS, because there may be instances where we identify someone who may not be a fit for that setting and we work very closely with DHS to either transfer that client to a more appropriate setting. But that assessment is very important to be able to make that determination. Okay, thank you, and a question is kind of related to that. We had I had three or four questions about what is that? What's the daily schedule going to be like at this facility? When will residents be coming in and out and how will rules be enforced about, for example, that people take their medically required medications that there are no issues with weapons or drug possession in violation of rules and so forth? So I'll take that question. So all of our shelters operate seven days a week, I'm primarily having social services available Monday through Saturday. They will also have late nights, so some there may be days of the week where staff is there: social services staff, specifically until nine pm, but I think during the day staff usually starts around eight or nine o'clock, so social services will be made available to all of our residents between the hours of 8 a.m and 9:00 pm at least six days a week with respect to I. Guess the screening with weapons I think I heard there is or will be. If I'm not mistaken Florida, you can correct me if I'm wrong a magnetometer, a male detector of some type at this facility, which would allow for us to screen our clients as they come into the facility to just make certain that they are not carrying items that are not allowed in any of our DHS shelters. And this is something that we have across the majority of our shelters. We do have a screening process with respect to magnetometers or metal detectors. They have it at their shelter for a rockaway, and it works very well. I do want to comment with respect to that core has what I would say in my experiences running, shelters I have over 65 shelters within the five boroughs as far as a provider having a connection with the police department, I have to say, court ranks number one with having that relationship and I think that is paramount as to why their facility in far walkaway has the least number of incidences and or have instances where police are more than willing to come in and assist and participate. Because of that relationship and I think that is attributed towards core's ability to have these relationships not only with their community but also with the police departments within their district I. Think there was another question about clients coming in and out. Our clients can come in and out. We do ask that clients come in at by 10 o'clock, but of course those are employed may have to leave. Anyone that is not signed for their bed for at least 48 hours would have to be logged out and start this process again, but we want to have conversation with clients when we notice that they're not signing for their bed as they should, because we want to make sure that we address their need. So our clients, although there is a curfew, it's not a jail, so yeah I don't want anyone to be mistaken by saying oh well, she mentioned there's a curfew someone's outside at 1 am again. We encourage our clients to abide by our shelter, losing regulations, and we do have something that they just call client responsibility where we have a panel or a discussion about how the client needs to be responsible for their actions, and there is consequences to such actions, but I think it's important that we, the provider, is engaged with that client to ensure that you know whatever needs to happen, that they do so and I have to say that Mr Dejesus, who runs one of our largest adult family facilities, has done a very good job in ensuring that the clients have been respectful, responsible and doing what was needed, which is why his numbers, as far as move outs are so high. Thank you, I, I'm wondering if anyone from core can give us information about statistics that reflecting their performance and helping to transition people successfully into permanent supportive housing or into independent living sure, so, I think. As Mr Dejesus pointed out. So far this year we've moved out. 50 families from in our adult family, shelter and in our 2019 DHS has what they call the shelter performance scorecard. Thank you, Sonya, and so we were ranked very high in our move outs. In fact, one of the quotes was that we had a track record of being able to move clients out and being able to replicate it across our portfolio, and so the performance has been very strong as it relates to Ilp completion, as it relates to move outs, reporting of critical incidents and our facilities. Those are really the I think so the top four metrics that DHS assesses and we meet or exceed the metrics, and we are above our peers in the same facility type and I'm sorry I, don't have the exact statistics in front of me. I'm just going off memory. This one I think is a question for core the residents who move the families who move into this facility. Where will they come from? Will they be coming from other residences within the shelter system, or are they going to be transferred sorry coming in fresh through intake to the shelter system and either way are they people who live in Manhattan now or are they? People are coming from other boroughs? So it will be a combination of both clients being transferred from other facilities and or coming straight from intake. Typically, when we open up a new shelter, we would move clients. We will look at other portfolios and see whether or not there are any clients who lived in the borough of Manhattan and would like to return to that borough. We don't have a number, a large number of adult facility. Family facilities in Manhattan I, currently only operate, I think two one on Riverside, the other, which was Harmonia that many of you know of which is on East 32nd street. So those are our only two at the moment so having this additional shelter in Manhattan is great, because a lot of our a lot of our families have some connection, albeit not maybe in that particular district or community board, but just in the borough itself. So we would see whether or not they're in families that are in perhaps Rockaway or in Queens that have services that are in the borough of Manhattan, which would make it easy, as far as commuting wise to get to those services rather than from boroughs and on far walkway or what plan? Oh, you mean people who are living in Say, Far Rockaway, but who are receiving counseling and support services in Manhattan all right, okay, so we would reach out and see whether or not that would be a good fit for them and then, of course, have them transferred in okay. Here's a question from someone who asks given that this is a permanent shelter and the residents are likely to put down roots in our community, at least for a time. What can we do here in the neighborhood and the community district to help ease their transition into the community? I'm not I guess that one's for core, yes, well, I'll, answer that one I think just treat these clients the way you would treat your neighbors right now with dignity, not to not even presume that anyone would not right, but a smile, hello, a good afternoon if you see a new neighbor coming in treat them with the same courtesy that you would with any other new neighbor coming into a neighborhood. That's one of the beautiful things about this city is that it is diverse and it's vast and on the most fundamental level, a simple hello or good morning and continued conversations like this that allow us to remain transparent and I'll, say this too. We find that neighborhoods and sites that we open. Where we get this level of community engagement. The program goes even better because we know that we have neighbors who, when I look at this car and I, see 159 participants, I, see 159 participants who care about the quality of life and about what's coming, and we operate very well in that space because we like this two-way dialogue, because it allows us to exceed the goals that are that we're contracted to provide so on the most fundamental level. A hello. Thank you not a thank you per se, but hello a good afternoon a good morning. It's a great start. Thank you. I have one general question about people experiencing homelessness, who are providing who are responsible for quality of life disruptions, and this is not specifically about this shelter but, for instance, there are a few places in our district where there have been encampments that have been persistent, which I think the ones mentioned here our office knows about. There are places where there are perennially people sleeping lying sitting and being disruptive when they are awake. You know, there's one site that we are aware of on 2nd Avenue near East 32nd street. This question is for DHS. We know that what our community board says is that people should call 311 when they see someone who is in a an uncomfortable situation, and it's not an emergency. Is that what DHS recommends when there are areas where there is a persistent informal street residence of people? That doesn't look like it's being addressed. Yes, absolutely I. Would we would recommend for folks to contact 311 and then, within the hour our street homeless, outreach teams will be decided to engage the individual that was flagged to us. What I would say is I'd recommend for folks to download the 311 app. The app is by far it's it would I'd say: is the quickest most fastest way to contact 311 geometrically pings, your location, it tracks where you are, and you can, by the click of a button request for Street homeless outreach support and someone like Jim Hodgkins who's on the call from breaking ground would be he'd. Have his team be dispatched to engage those individuals for shelter or services, and that is clear that we're not to conflate the two right who's in shelter and who's on the street? Yes, I understand yeah. So the matter for street homeless inquiries 311, is the best tool. It also lets us know how often the teams need to canvas an area. How often the teams need to frequent an area lets us know the time of day folks are seeing folks out and about, and so that's the system that we track closely on the back end and heavily rely on. So yes, 311 is the best tool to use. Thank you. I'm going to wrap this part up shortly, because we have a bunch of we have another business item and we've already hit the at 90 minutes, but I want to make sure that two other comments get aired. One is from a person who says they were a Renwick employee for 33 years. They have lost their job, I infer that they were furloughed. There are 50 were 50 employees there. They were not notified that this was happening and they want to know whether they have lost their job permanently and I. Don't think anyone here can respond to that, but I wanted it to be aired and on the record and the other is we got a comment from one participant saying we are spending four million dollars to renovate a small playground. We should be able to welcome individual homeless families to the to this neighborhood without ascribing negative qualities to them. So Corrine, with your permission, I'm gonna hand the floor back to you so that we can wrap this topic up and move on to the other agenda. Item and I just want to say, as the person who's been moderating. This part. We appreciate all the work that the people from DHS from core and from breaking ground are doing on this issue. We speaking for myself I understand that we have a social obligation to make sure that everyone who is in community district six is safe and provided for and we as a community board, absolutely represent people who are homeless as well as everyone else in the district. So thank you all grant I'm going to go on mute and I'm going to turn off my video. Thank you very much rich. Thank you, yeah I, just yes, also to all the panel members. Thank you. So much yeah I just want to end this with a little speech that I had at the last meeting as well. You know this is a huge systemic issue all over the city- and you know the answer to this- is not to ask people to just go somewhere else, so you don't have to look at it, but it's about, but yet these shelters are also not. The solution is housing and some more housing and very specifically supportive housing and more affordable housing. A lot of the main culprits that cause a lot of kind of quality of life issues are on house that refuse services all together, and one of the reasons that they do is because the shelters, especially the 30th street shelter, is just not a place. They want to go to there, it's not a safe place, but the Renwick hotel is going to be one of those shelters that people do want to go to and they actually will get help and are part of the solution and with that I. Thank you all. Thank you. Everyone. Thank you so much for having us. Okay, going to our second and last agenda item, which is a discussion on City Council, Intro 1977, which is you know actually talks about. You know, addresses our agenda item number one which talks about allowing qualified local entities of first opportunity to purchase residential buildings when offered for sale, which would then allow for Clts community land trusts to purchase these buildings and turn them into affordable housing. But I'm not the expert on this. The person who worked on this very hard there's actually two resolutions. One is in support of the Copa Law and the other one is in support of letting the tax liens law expire, so that properties that are delinquent in their taxes go back to the city and can be turned into affordable housing but Jeffrey. You know more than me, so thank you so much Jeffrey. You have the floor and oh and Cody. If you can bring it up, if you can share the screen, that'd be great. Well, first I'll just say: I am definitely not an expert in either of these, but thank you. Corinne I on the Copa Mata I was I put together a resolution in large part with the help of Carlina Rivera's staff. She is the sponsor of the community opportunity to purchase act and right now. It is the last I understand it from this summer that it was just out of committee. So this would be a resolution that would, in support of the city council passing this. Should I do I read the whole resolution. Everyone can read it on their own, but yeah I mean, in short, the community opportunity to purchase that Copa. It provides a right of first refusal to community land trusts Clts, as well as other non-profit, affordable housing developers a right of first refusal. So if a property is going to be on sale, there's a list of qualified developers that would include Clts and other non-profits to at least have a first shot at placing a bid on the property, as well as the ability to match a bid on a property so that the Clts have at least there's a mechanism by which they that they have to have. It gives them an opportunity to potentially raise the funding in order to do that. There has been some success. You know significantly on the lower East side, with Cooper Square Clt, where they have purchased multiple buildings already and there's been a big push with regard to Clts, starting with the some funding from last year, I think somewhere in the neighborhood of 750,000, and this would just help the clts and other groups do what they're doing which private investors can still purchase properties, but it just gives a writer first refusal to the clts and an opportunity to match if they're outbid and that's sponsored by Councilwoman, Rivera and I believe it's endorsed by I. Think the other council members in our district. Thank you, Jeffrey, yes and I. Think most of you heard the were present at the a new economy presentation last year about Clt, so we're all pretty familiar. Is there any questions? So we put up the second one and then bundle them for a vote, or do we do? Oh? Can we bundle in a committee? Probably not right that was I mean I would suggest. We just do one at a time we're already at a time Mr one at a time. Brian Andrew has his hand raised. Okay, it's a quick question right, hi good evening, quick question. As far as the acquisition of the properties are concerned, I just want to understand. This is a little over a little bit over my head when a clt is wants to acquire a property. Are they? Basically, what this is saying is they're getting a first opportunity to bid for the property. I just want to make sure they're. They would still have to pay fair market rate or competitive rate for that property. Correct sure, I mean it it's only. It only provides two things: a writer first refusal, so they have a right. They have, they get first dibs on making a bid, they can be outbid and if they are, they also have a right to match. But so you know doubles their initial bid. All that the clt has a right to do at that point is to match the higher bid. If they choose to do so, you know if the market bid is high enough. It may just simply be out of the reach of the clt, but what the Clts have said is that it there there's a certain amount of work that goes into getting sources of funding, and this just gives them a little head start on being able to do that. But yes, it would be market. You know it would be market rates, as whatever RFP process request for proposal process that they have. This would just require them to let the list of qualified nonprofits. You know be aware of it. That's great! Thank you. So much thank you. Can I have a motion to vote on this. Thank you. So everybody in how do we do this? You need a second and then I will do a role clean up a second thank you. So this is on the Copa Intro correct. Yes, all right committee members, I'll call your name and please announce in favor against abstain or not entitled John Darren in Favor Claire Brennan did we lose? Oh, no Claire's, still here, Claire all right, Andrew Gross in favor, Abigail, Cruz Mark in favor richmonds in favor Rajnir in favor, Matt Roberts in favor. Andrew Suresh in favor, Corinne Vanderdunk in favor, Jeff Sellen in Favor, Claire, Brennan, again Claire, oh, it looks like Claire's stepped away, it's nine in favors, none against no abstentions and no not entitled. That resolution passes great. Thank you which brings us to our second resolution that ties in really with the Copa legislation and Jeffrey. You want to talk about that. One sure the! Let me just pull this up, I'm sorry, okay, so the in 1996, the city enacted a law that the that allowed tax liens to be sold to a private trust that run by investors and rather than what they had been where the city itself would potentially foreclose on the properties. And so the idea was that the city would collect a certain amount of money up front from investors, and then these this debt was monetized and sold to the trust, run managed by the Bank of New, York, Bonnie Mellon, and what this year, because there has been a significant amount of property owners over 50 of which are one to three family homes- and this is council. Member Reynoso in Brooklyn is I. Guess sponsoring the charge. It's not to pass a law, but rather to not reauthorize and allow to expire this law, which would expire on its own on December 31st 2020, at which time the Lien sales, the law that would allow the lien sales would expire so far this year they did not do a lien sale and it has been postponed four times already. 30 days, Post, Bowman's, 30-day postponements, the governor and the mayor wanting to postpone it, because there are obviously significant. You know numbers of property owners and, for the most part, these are small property owners over half or one to three family home owners, and what council, member Renault, so you know found was that a majority of those were in neighborhoods that were largely people of color, for example, in certain areas in Brooklyn, where these were largely black owned and other people of color owned, one in three family homes and potentially has a disproportionate number of what would be foreclosures, the difference being that so this the city has postponed the sale this year and because of that, there were there's a number of council members who have and there's been a push by a variety of non-profits. Who said? Well, maybe you know maybe it's time to just instead of just postponing to just not reauthorize the law and instead allow the city to could foreclose possibly. But there are other avenues by which the city can you know, work with owners in order to allow them to. You know, pay off the tax liens. Also the in relation to the clts. It's been argued that the Clts had, in the past obtained tax, foreclosed properties to be to create supportive housing and one of the prime examples of that was again the looking at in our area, the Cooper Square Clt, which had in 1991 in the early 90s. They had obtained a significant number of buildings in the bowery by way of purchasing from the city, for that had been a foreclosed properties and so, and it also allows the city to work out other possibilities both with the tenants and with the owners. So the what this would do is would allow to expire. The currently the department of finance selling off the tax liens, and one of the another argument has been that in the ski in the grand scheme of things where there's a 90 billion dollar budget, the tax lien sales projected, for example, this year, would yield around 57 million dollars in revenue and, while you know in a cash-strapped city, dealing with Covid-19 57 million dollars in revenue is not nothing. Obviously, the property taxes make up 28 billion dollars of the 90 billion dollars this year. The for closing on the opportunity selling this off to private investors, which typically means a very aggressive foreclosure process, would, although losing a relatively in comparison, nominal amount of revenue. The argument is that it would allow a pipeline for potential new properties, as well as some relief to small property owners. Great, thank you. I. Think you are, the expert I think do I. Are there any questions? I have a question just so I understand it. This is kind of in your mind, killing two birds with one stone. So, on the one hand, it's helping small property owners. On the other hand, it's providing an avenue for Clts to obtain sites. They would not otherwise do I understand that correctly. Yes, so what we've been told by some of the groups that have been working in relation to this, including the council member Reynos's office, that there would still be properties that would be foreclosed upon? That's probably, you know the reality with regard to unpaid taxes, although the process is potentially not as aggressive as when private investors have purchased it through the private trust managed by a bank of New York, at least that's the argument and that the city has other processes in place in which they are more apt to work with the owners. That said, when properties are foreclosed upon- and there will be- you know, properties foreclosed upon it- does allow the these tax foreclosed properties do become a potential pipeline for those types of properties and an example was the Cooper Square that had purchased a significant number of tax, foreclosed properties in the early 90s prior to the 1996 law and were not able to do that after 1996. and again, this would not be asking the council to affirmatively pass anything. It would be urging them. As of right now and I spoke to someone in council Councilman Renos office. There actually is not currently any anything before the council to renew nobody has proposed renewing it yet so it potentially dies on its own by virtue of nobody proposing it to be renewed. That's my understanding as of right now, but this would be to urge the council to in fact not do that to not renew the law just to allow it to expire, yeah and then yeah. Thank you for that question and then you know if they do become available, if they do become foreclosed upon then, because of Copa Clts will have right of you know can have right of first refusal, so it just kind of works together. Can I have a motion in favor of this resolution. I'll move it so moved. Thank you, Cody you're, on I'll. Second, it oh I thought somebody seconded already. Okay, sorry thank you. Raj, okay, Committee members. I will call your name, please unmute yourself and declare in favor against abstain or not entitled John Barrenbaum, Baber, Claire Brennan in favor and Claire for the record. You were in favor of the last resolution, but you had audio issues. Is that correct? Okay? Thank you. Andrew Gross in Favor, Abigail Cruzmark in favor, richmonds, Rich, okay, Raj and I are in favor Matt Roberts in favor Andrew Suresh, Favor, Corrin Vanderjunk in favor, Jeff Zelen in favor, and rich Schmitz against I'm in favor all right, that's ten in favor! No against no extensions, no, not entitled great. Thank you, which brings me to the chairs report. I'm going to waive my report. All the new business we are. The flyers went out for the to the tenants of these two buildings that we had that the housing Justice Initiative had helped us identify where there could be potential. 421A tax fraud, Cody those went out right. Those flyers were their processing. It was a very large batch of them, but I had them the service that we use to mail things out. It started the process on Friday and they should be in the mail shortly great and the flyer is currently on. This is the flyer you want to scroll up. So this is what all the tenants of those two buildings will receive and they will be able once they have requested their rent history they can contact. Is it contacting us, I forgot or the housing initiative, or both they're, going to contact us and then we're going to work with them and Hri to read their rental histories and determine if well, we will not make an actual determination, but you know evaluate to see if we think that there is more evidence of rent over charges and, if so, and if there's a pattern of them, Hri will connect us and the tenants who are impacted with attorneys that they've worked with in the past on these matters about taking their landlord to court for rent reductions, given that they were illegally overcharged. Great, thank you and how many went out 248 we did. We started with one building. It was a very large building and we sent every resident of every unit of that building one of these flyers. We don't know that people's names or if they'll or some units might be vacant currently, but we just did a mass mailing to every current resident in the building great. Thank you. I'm looking curious to see how many responses we get great work, any new business questions from the committee right. No, I'm asking for a motion to adjourn looks like Joan has her hand raised. Oh, you have your hand raised. Jim, don't move! Ah, okay, seeing no further business! This meeting is adjourned. Thank you all so much for your time. Thank you.",
            "summary": "Okay, The agenda for tonight's meeting was to distribute it ahead of time by the board office and appears on the screen before you committee, members.\nBy, raising your hand, through zoom chat, should only be used to alert us to any technical difficulties you are having or to state in writing information like an email address that was already stated aloud on the record during the meeting when a committee member is given the floor to speak, I will identify you and you can unmute yourself so that you can speak.\nVice Chair, Rich Mintz, will be looking through the questions as they come in and will read the questions aloud and direct them to either DHS or core, and with that being said, our we'll get to our first agenda item, which is the presentation by core services, group and department of Homeless services on a new permanent homeless, shelter for adult families at 118, east 40th, street.\nData from 2019 suggests that New York City really has 78,000 house residents, that is shelter and people living on the street, and that is not to mention many families that double up in apartments or triple up in apartments, especially nowadays.\nSo then, one of the other just reading the comments, The reading the questions I want to make everyone aware that you know this particular shelter is right at the border of CB6.\nWe need to get a better set of communications between the community boards between DHS, so that we're just not kind of working in our own little pocket, not knowing what's happening in CB5.\nOne of the things that I would like to talk about is better communication and sharing of information about districts close to us and with that I will handed the floor over to DHS.\nWe're honored to be joined, but I have Keisha Phipps here from core, along with Gordon Jackson, who will be handling security for the site, which I know everyone has lots of questions about, so I really would love if it works for everyone.\nWe are at the Department of Social services responsible for ensuring that anyone that seeks housing in New, York City that seeks temporary shelter is able to find it, and we do that, of course, by helping individuals who are both chronically the chronically street homeless.\nThe shelter that we're talking about at 118, east 40th street is going to be, of course, for adult families, as many of you may be familiar with are folks that are any kind of couple or partnership that are above 18.\nIt's, not just about having a good shelter that provides services for clients in the building, But we're very aware that it's really important.\nWhat happens outside the building is equally important and we really strive through, as you mentioned, having community advisory board to ensure that we will be able to make sure that we are held accountable and hold core accountable to do the kind of work that we expect with inside the building and also outside and without further ado Leilani.\nWe're, strongly committed to having open and ongoing dialogue with the communities in which we serve, and you know, forums like this are especially important to us as we start programs, and we want to make sure that we can set up meaningful and sustained relationships with the community.\nWe are here today to talk about adult family shelter to be located at the Renwick hotel, 118, east 40th street core works daily with single adults, families with children and young people to harness their own strengths, and we basically identify and break barriers to independence and build bridges to self-sufficiency and change the lives of the clients that we serve.\nWe serve about 3,000 clients daily in close to 40 sites, both in Washington DC and New York, and we have programs survey serving the re-entry population, homeless, shelters for single adult males families with children, adult families, programs for runway, homeless, Youth, Lgbtq, Youth, homeless, young adults and person living with HIV Aids.\nOur families face more barriers and roadblocks, but they really work hand in hand with our staff who facilitate you, know their achievement of goals, while they're in their program, which get them to the ultimate goal of transitioning to permanency.\nOur work is grounded in the values of treating our clients with dignity and respect, first and foremost, understanding the importance of compassion, because we know that again they face myriad of challenges that we have to support them on a day-to-day basis and accountability and excellence.\nSo, most important and foremost, We have to understand what those needs are, So, the very first thing that happens when a client comes into our program.\nYou know be time-bound for, However long we expect that person to be in the shelter achievable and we work with that client to achieve those goals.\nThey're assigned a case manager who will you know, provide services and in-house then also make referrals to community-based organizations, and one of the things that we will do is identify local community-based organizations that can enhance the services that are available for our clients.\nYou know to make that resource available for the next family that may need it, Of course, We believe that employment and permanent housing are the twin keys to long-term success.\nLooking at counseling, You know anything from relapse, prevention, identifying, managing triggers and having those conversations in a clinical way, and, of course, making referrals to community-based partners for any additional support that client may need in the community and one of the things so between the case.\nYou know it starts with the program director who really plays a critical role in making sure that there is adequate supervision at the site to ensure that the safety and security of the residents, the staff, the visitors in the community as a whole.\nWe, want to make sure that we maintain good relationships with our neighbors and that's important, not just for us as an organization, but that's something that, as it relates to independent living, we have to empower clients to be able to do.\nYou know the voices of the of our neighbors, whether it's clergy, community-based leaders, residents and you know, create a space where you can talk freely and transparently, and you know, at the end of the day, hold us accountable for what it is that we're saying we're going to do.\nThey go through many of the trainings that our program staff go through because we know that guards are often the first line of observing behaviors that can sometimes impede on quality of life, so part of the core and pro core models that relate to security and how we manage and really look to get supportive relationships in a community really ties into quality of life right, because we want to make sure that, when this site opens at our clients can enjoy their quality of life, but at the same time, balance that, with the quality of life that already exist in the neighborhood.\nSo you will see pro core bikes that will be, you, know, really just community engaging so to speak and providing a security presence, we're not there to engage every single, client.\nThere will be a security manager who will be at that site, as well as the operations coordinator, as well as the program director, and we all work together in the team.\nI'm, also going to be overseeing the program at East, 14th, Street, 180, Eastman, 40th Street, and what we want to do as core is win the same type of program that we are running at these residents over to east 40th street we've been very successful here with the elected officials with the community members, we're on the community board 14.\nWe, while challenging them to improve their lives by gaining and securing permanent housing and becoming contributing members of the community.\nOkay, I've got some questions where there's only going to be security on site.\nOur supervisor from core services has more experience in and engaging the clients we're going to have such case managers on site from one to nine every day on saturdays or do from nine to five thirty.\nI have learned through all my years of working with homeless families that you know it's what you do for them.\nThat is something that core ndhs in partnership with the electeds and the community board will help to create and form so that will only become live once the site has once the site opens up and Sonia that's correct.\nYou, know upwards of 170 families which would meet the need for DHS, and so we did submit a proposal for this site as in response to the open-ended RFP.\nWe do not wanna be in hotels, It's very clear that we would want to be in shelters like the runway, but we can actually have the kind of all services that we needed.\nI know: Cody Osterman, the assistant district manager wanted to speak a little bit about my question: Cody hi.\nSo, I'm happy to take that question and in part you know, The, Murray Hill community is very, is one that's very fond and near to my heart in part, because my father and my stepmother actually live on 36th street on the east side and our.\nLet me just let's start from the beginning by saying that this site, because we're working with the kind of provider that we're talking about and because we are so thoughtful and concerned and have to share the concerns- is not going to have the kind of impact that some folks may be concerned about.\nSo I just want to start with there, because there's a lot of fear-based concerns regarding our sites and there's a lot of fear regarding what does it mean to have shelters.\nWhat, we have is an open-ended RFP process, because New York City has a legal mandate to provide shelter for all those who need it.\nThat are, you know, and people are going to be at the Renwick, and sometimes the community is confused.\nI think the city has done and how they communicate with us on the committee on the board and also all the people who live in not just our district but other districts.\nThe second time that one of these shelters has been put up with no communication, and the city can say that they have this meeting, but the fact that matters.\nIf you look even at these questions, then it again happens and it's an attitude that the city is going to go and do these things and take these actions and basically do what they want and have these meetings after the fact.\nI appreciate them, making that ultra clear, because that was never made clear about the site that I live next to, but I think the main question that I have on behalf of a lot of people in this meeting.\nHow is the communication from the city going to change, because this just doesn't seem fair to everyone, who's living and by the way, extremely sympathetic to these people who are, in these situations extremely sympathetic to homeless people extremely sympathetic to people in need.\nAs the chair of the housing and Homeless Committee I thought that most people, when they say I, want to be notified before they open.\nCertainly we're happy to have community conversations regarding this site moving forward, as it is a permanent shelter.\nI live across the street from a temporary hotel, shelter operated not by core by another provider.\nOne of the things we've learned is that the security staff know all the residents personally and know exactly who is likely to have what kinds of issues challenges or problems.\nYou know folks can come into the into our sites, regardless of their criminal background or criminal record, and if you are the only thing, that's matters is if you, in this case, you and your loved one are in need of housing and we are there to help provide it.\nI think it's really challenging to talk about crime statistics and certainly in regard to homeless people or shelters, especially at this moment in time.\nOne question that someone asked related to those which I think also applies to this is going to be an adult family.\nIf you want to reach out with any types of concerns that you may have, Additionally, I will be out handing out business cards to local businesses to let them know that we are available to keep an open line of communication, no matter what happens additionally, as part of the staff and patent at this particular site.\nSomeone asked what the plans are to develop more permanent, supporting supportive housing in communities in district 6, so that people can be given more stable places to live in lieu of shelters and a related question.\nIs that as the part of social services, we don't actually operate that kind of supportive, housing, However, I will say this: We are actively looking whenever we can to figure out if there are opportunities to convert shelter that we have in existence to also include a permanent, affordable housing as a part of it.\nYou know looped in as we have those conversations as we look about the city because obviously affordable housing is so important.\nOkay, all right, well, I mean this is a question that we've talked about before in committee, and so we probably will need to get some more information about the mechanisms for developing permanent supportive housing.\nCounseling needs, whether those services will be provided on site and how this compares to how things are done in other shelters, core.\nBut I think it's important that we, the provider, is engaged with that client to ensure that you know whatever needs to happen, that they do.\nI'm wondering if anyone from core can give us information about statistics that reflecting their performance and helping to transition people successfully into permanent supportive housing or into independent living sure, So, I, think.\nThis one I, think, is a question for core the residents who move the families who move into this facility.\nA question from someone who asks given that this is a permanent shelter and the residents are likely to put down roots in our community, at least for a time.\nI have one general question about people experiencing homelessness, who are providing who are responsible for quality of life disruptions, and this is not specifically about this shelter.\nYou know, the answer to this- is not to ask people to just go somewhere else, so you don't have to look at it, but it's about, but yet these shelters are also not.\nOkay, going to our second and last agenda item, which is a discussion on City Council, Intro 1977, which is you know, actually talks."
        }
    }
}