{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB10",
            "channelId": "https://www.youtube.com/channel/UCY2LtGVfxi7RFu672Dt0imw",
            "title": "Top chat replay",
            "publishDate": "2020-06-16",
            "shortDescription": "Community Board 10 Brooklyn\\nJune Board Meeting\\nMonday, June 15, 2020\\n7:00 PM"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB10",
            "normalizedName": "Brooklyn Community Board 10",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPueX4MsL5dhnFZ-wqDwvKw",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 0,
            "um": 2
        },
        "wordCountFullTranscript": {
            "favor": 43,
            "community": 36,
            "board": 31,
            "a.m.": 27,
            "meeting": 26,
            "committee": 24,
            "time": 22,
            "year": 21,
            "application": 20,
            "establishment": 18
        },
        "wordCountSummary": {
            "community": 12,
            "committee": 9,
            "police": 7,
            "board": 5,
            "application": 5,
            "office": 5,
            "ways": 5,
            "media": 4,
            "year": 4,
            "district": 4
        },
        "fullTranscript": "I'd like to try and get started, and we can hopefully keep this one short so welcome everyone, 2024 board, meeting of community board 10. We do have a few new members here and I'd like to say hello, hope you guys have fun you're. The last meeting before we go on hiatus, so you'll come back I'd like to call for an adoption of the agenda, and we would like the speakers to try to limit themselves to two minutes each like to ask our councilman Justin Brannan. If you'd like to say a few words, do we have Justin, no okay, I think he wasn't elected on the roster to speak this evening that correct yes, also, senator Granada said he would be here. I, don't know! If he's here, hey wow, this is going public session. We've ever had. Okay, thanks mark Michael Festa. You have your hand just close the public session for a moment, maybe move on to our public hearing and if any of our lock dudes come in a little bit later. Well circle back! If that's okay with everyone, so I'd like to move on to the public hearing, we have a review of a BSA special permit application. So I'd like to turn that over to Doris, you have to unmute yourself I'm, you Doris. The zoning and land use committee met in quorum via zoom on Monday June, 8th at 7 p.m. the committee met to discuss an application for a special permit under Section 7 3-3. Six of the zoning resolution for a physical establisher establishment, a gym at 437, 88th Street, the property lies in a/c, 8-2 and c4 to a zoning district. Physical Culture establishments are not permitted use groups in these zoning districts. This application is not yet calendar. Also in attendance. In addition to committee members was Todd. Dale representing the applicant. The building is on an irregular line and the applicant intends to make the basement a cellar which will be used for lockers. The first floor will be a lobby and the second floor will be a gym. Approximately ten thousand two hundred square feet. The bulk is allowed under the current zoning and it has been approved by the Buildings Department. One of the conditions of a special permit is that the use will not impair future development of the lot. There's nothing in this. That would have said a few kids eliminated. The operator of the gym will be blinked, which is part of the equinox proof clinkers of cookies, corporate-owned, not a franchise. The Buildings Department of Buildings also approves the operator. If link leaves, the premises can be diverted to convert into any approved usage for the zoning laws. If it is a new gym that owner would need to be operating, we need to be approved by the Board of standards and appeals. A multi was made to approve the application and the motion was seconded, a roll call was held and the motion was approved unanimously. The district office has a full attendance list. Do we have any discussion? Any questions, any comments, any comments, no, do we know who put the application which room the it's going to run. The gym is, and the owner is Tim's. You have Henry Stewart with his hand, up are they're using the existing building. Are they putting up a new building, no they're using the existing building? Making some modifications to it to the outside as well or just to the inside. They really didn't say, and we did not ask you know there might be changes to some changes, but it wouldn't be anything that would require from the drawings it does look like. There's gonna be some. You know improvements to the funds of the facade in the building. We just had the drawings submitted to us. It looks like there'll, be some. You know enhancements to the fund, but overall the existing shell of the building looks like it'll stay. You know in this existing footprint just curious as to what is in this building now nothing nightclub. Yes, oh the top of the Crescent is questions in the chat. People should be paying into the chat. Julie has a couple questions there I think we just do the questions. Yes, people, it's too, you know there's too much conversation going back and forth. We haven't really been doing that. Brian, oh man, working fine, Julie, yeah Julie asked. If there was parking I got my answer: I got it so I didn't see the drawing I. Unfortunately, I got the answer. I know what the building is unfamiliar. You would like to you know: do it with the raise hand, feature because it's too hard for the administrators to follow the questions in the chat and answer everything? Okay, so are there any other? Any other questions? Okay, Doris! You want to call it yes, yeah. Their name is called so tracy britain in favor capitis in favor, Shirley, chin, Judy, Collins crews, Richard day in favor. Thank you, Michael Chris, Ellis Jones in favor and political favor, Tom and Feliciano I. Don't think she's here, okay, not here yet: okay, Steve, Harrison, hi, Thank, You Justin highest in favor of a job; okay, Jim, Johnson, she's, absent Habib. Today, okay, with me, okay, it's Dean was senior I know he was he was trying to get on. He calls me all right. Well, more can absent right now: Joe's absent Larry's, Delta Jews, all in favor Alito in favors, Sanji malice in favor Michael. She favor, hey. The hole is concluded as the motion carries. Thank you comments that the zoning committee meeting was called to order. 7:00 p.m. and at 7:19 I would like to go to the public session and see if Justin, Brannon, councilman Justin Brett, and it would like to say a few words before we started, and so we started the public session. You happen to be the only elected speaking today, so we just give to the next item and came back to you. I'll be really quick, just wanted to say: hi everybody I miss you guys hope everyone is safe and healthy and taking care of themselves. You know this is a very remains, a very anxious time for our city for our country. You know for all the reasons, including just lack of leadership from the top down, and it's a very tough time to be a lowly elected local elected official. Like me, where you know the leaders up top make big pronouncements, and then we have to kind of sort out what it means locally, but I do want to acknowledge that since we last met there were a bunch of protests in the neighborhood and they were all they were all very positive, and many of them were led by youth young people, which is very inspiring to see it's a shame that we have to put that peaceful qualifier before the word protest these days. But that's the world that we're in right now, but all the protests in the neighborhood were peaceful. There was no looting. There's activism here, folks are doing it in a constructive way, not a destructive way. You know I think this moment calls for us all to dig deep and harness our compassion and our ability to listen to folks who have different experiences than we do and that's how we're gonna build a better city and a better nation. I've been locked inside budget negotiations and the city is facing a 9 to 15 billion dollar budget, all because of kovat. So there's going to be a lot of very decisions that are gonna have to be made. It's not going to be pretty, you know and we're already seeing the effects of it down to you know. The grass in our park is seven feet tall and the garbage cans are so we're gonna. Do everything? Ok, we're gonna, do everything we can to make sure the baseline city services are funded. Obviously, public education is a huge issue, making sure that cuts aren't made. You know cuts are made across the board, but cuts that don't affect our kids and the classrooms trying to get dig into some of the waste and some of the bloat. That's in this budget and that's been in this budget. You know, we've been cities been spending like drunken sailors, and you know it's time to make saving money sexy again. It's not easy. I'm, usually one of the only people in the room saying it. But here we are so there's going to be a lot of tough decisions made, but we're doing our best to make sure that the safety net is not affected for our most vulnerable and certainly that basic cities. This is continued in our city, so I appreciate I, appreciate everyone reaching out really just trying to do our best through this very combustible time, but appreciate seeing you guys and thanks for letting me come on and say, hello and I'll. Let you get back to business. Thank you. Someone is a question for Councilman my report, so welcome. All a lot has happened since we met in May. Our community continues to be faced with challenges that develop and evolve at a rate which we all struggle to keep with, which we all struggle to keep a pace both in terms of comprehension and emotion, and during this unprecedented health emergency we've seen terrible acts of injustice which acts we can only wish were also unprecedented. The myriad pressures brought to bear on us during this time have caused an eruption of crises for health change and for justice, elected officials trained to obtain reliable information to make informed decisions, often with little guidance, and they struggled to rapidly provide answers to so many who need them. No one has been afforded the luxury of time to analyze and digest what has been happening yet were called upon to take decisive action and provide solutions. I have spoken with many people, and it is amazing to hear how some are quite certain that were at the end of this crisis of health, economics and inequality, while others are equally as certain that the end is nowhere in sight. The problem is that the price of taking the wrong course of action is high. It could mean someone's life as we've seen. So what do we do? Well, I believe you can never be wrong. Do the right thing, I've seen a lot of people in our community doing the right thing. We followed the laws and the rules we've acted to protect ourselves and others from this virus. We've stayed inside worn masks, kept apart from others, we've protested, boldly and peacefully, we've seen for those who have any selfless and we've grieved together. We've been respectful and caring toward one another and as a board, we've committed to work throughout and can be junction with our elected officials. It's in hard times. When you see what someone is made of and I think that we are made of the right stuff and I am so proud of how our community and as individuals have handled these challenges. So as we progress, let's be sure that we, both as a community and as individuals, continue to do the right thing, and so what we're made of we continue to follow the laws and the executive orders for those reopening businesses trying to provide for their families. Do the right thing by following the law: enforcing social distancing and staying mindful, but your business decisions affect someone else's family someone else's life for those who are socializing in groups. Do the right thing by erring on the side of caution, remembering your actions and pact us all. We know this virus spreads blindly and exponentially. Your actions can mean life or death to someone else. We can all do the right thing by being fair considerate and respectful to one another, and maybe, by the time this board returns from hiatus. We will return to something close to the old normal, but with a greater caring and respect for all, we will be working on extending the current right to continue to hold our meetings remotely, so we can ensure that we remain safe until it's possible, for all of us can even curse him again and I want to. Thank you all for continuing to rise to the challenge and I wish you all a safe and healthy summer respectfully submitted. That's my report, so I'd like to move on to the district managers report, Josephine Thank, You Lori. So first I want to thank Lori for your wonderful report and for your leadership this past year, as chair of the board, can't believe a whole year is gone by as well as officers who, on this evening. So I want to take this opportunity to also welcome our new board members, who were appointed by the borough president and express my appreciation for your service on behalf of all of us, so welcome to new board members, Chris Ellison, Marisa Perez and waging Leo welcome. So yes, as Laura said, you know, we are in a very challenging time in our city's history and together you know we will work and accomplish great things. It'll be challenging economically. You know, as Laurie said earlier, we are just very proud of so many wonderful organizations and residents who have set up during this time to really help out. I want to give a shout out to the Arab American Association and our board member and co-founder Habib today, who invited me this month to help in the food distribution which was incredibly touching to see and really just incredible experience to be with so many good volunteers and meet and greet residents and our community, so grateful for the food distribution and services throughout our community I wanted to update everyone on some updates that were provided to the office over the months. The 79th Street overpass D-O-T, a New York State, do T overpass, which many of you may have seen. The temporary bridge has taken down and it looks like very soon. The finishing touches would be completed and that project will be successfully completed and done, and we await word on the Fort Hamilton Parkway overpass, which is in poor condition. The Department of design and construction is currently working on a water main installation project on 66 and 67 streets from 8th to 9th avenues. This week the 86th Street elevator projects is near completion, be open by summer of 2020. I wanted to also thank mark Moss for hosting us these past few months and truly helping us when we were thrust into the virtual meeting world. Your training and assistance is very greatly appreciated and it looks like this is gonna, be our forum for some time the street activity permit office. This is the office that regulates block parties and Street events has not been able yet to provide guidance on block parties July through September. We are anxiously awaiting word and I'll be sure to keep the board and forms we are getting. Many calls from local residents who are interested in having Street closures with social distancing as a way to just really, you know, get outside a little bit. After being, you know, inside for several months during the stay at home order, so I don't have an update on that, but I will keep you all apprised, also the MTA bridges and tunnels. Authority is currently working on two projects. As you may know, in the district, the Gowanus project is widening. The Fort Hamilton Parkway exit, so construction now is exclusively taking place behind barriers. Work was shifted to daytime, so that's a big help and drilling work, although noise producing will be limited to only daytime the deck replacement and concrete repair work is now shifted to overnight hours due to rising traffic volume, as we enter phase one of the reopening and unfortunately there will be noise producing work on the overnights. It's something that we're monitoring and working closely with the tbta and I certainly will keep you updated as we get announcements and if you haven't already and I'm speaking to new board members here to tonight, please, like us on social media. Bryan's gonna give a report later, but we really are trying to expand our social media presence. We are up to two hundred cage likes we'd like to be up to two thousand by the fall, so hopefully in my next report, I can share that good word and we've gotten some valuable input from members of the communication committee. So we're hoping that we can push this goal and our next general board meeting is going to take place on Monday, September, 15th at sure he'll, maybe, but most likely on I'm. Sorry I read that before I caught myself, most likely we'll be on a virtual class form. But if anything changes we will certainly let you know, but please mark your dates for Monday September 15. Thank you, Thank You Josephine and parole your work during this year, which of course continues throughout the summer for you. Okay, now we move on to the treasurer's report, which will be distributed with the minutes in the interest of time, so we're moving on to our police and Public Safety Committee report with our veloute Barbara. A new hearing. Yes lean back, take your shoes off very interesting meeting. So our meeting was on June 10th. You know this year at 7 p.m. on a zoom, and there was an application for a new liquor license for a weird wine beer and cider submitted for Luann's coffee bar Inc, located on the first floor of 7405 3rd Avenue. The attorney is Anthony Caraballo and the principles for this establishment are Luis egg, Garcia Maldonado, vice-president and Bridget Garcia applicant. They are brother and sister. The ours replica of operation are listed as Monday through Wednesday 8 a.m. through 12 a.m. music from Ian 12:00 a.m. the kitchen from 8 a.m. to 12 a.m. Thursday, 8 a.m. to 2 a.m. music, 7:00 p.m. to 2 a.m. kitchen 8:00 a.m. to 1 a.m. Friday and Saturday 8:00 a.m. to 2 a.m. music from 8 p.m. to 3 a.m. that's an hour. After the officially closed the kitchen from 1a 8 a.m. to 1 a.m. Sunday, 8 a.m. to 2 a.m. music 6 p.m. to 2 a.m. kitchen from 8 a.m. to 12 a.m. the anticipated persons occupying the premises are 50 in the application. The owners noted is that they will not be promotional events or private parties. They will not be hired security, there will be deejaying and background music use. In addition, it was acknowledged that the doors and windows will remain closed, but music is on and will follow, and why see noise regulations there will be no outdoor space used. What was noted in writing on the application is not what has been in practice from at least since September 2019 photos of the interior were included in showed tables and chairs. Stacked countertops are bare and there are photos of doors and hallways with several places under repair. There is no image of what this establishment will look like as a finished product. A PowerPoint slide presentation, aided this report. New york city building inspectors responded to a complaint on September of 2019 as a soundboard was being installed without a permit. No violation was found as a permanent was not needed for this work. It is noted that an in a letter to councilman Brennan a resident reported that the board was to prevent anyone from looking into the establishment from the outside another resident, and she was also complaining about the noise to the Rihanna's of the morning. Another resident participating in the zoom meeting stated that the noise, including loud music in karaoke, is unbearable well past 2 a.m. she also stated that the board is used to obstruct the view into the establishment from the outside. It is not for sound. In addition, she stated that you cannot see into the windows New York City Building inspectors attempted to gain access to the premises on February, 25th and 26th of this year. Regarding the lack of a building permit for constructions, they could not gain access. There is no certificate of occupancy included and it is stated that this missed mixed-use building does not have one adverse history for this establishment. New York City opened data-driven. One calls from 2010 to the present one call in 2011 for double parking. There have been 20 calls from September 2019 through January 31st 2020. Some calls are numerous on the same leavings for all of these 20 calls. The complaint is loud, music and partying. Some of these calls are made as late as 12:37 a.m. this is, after the sound board installation inspection. This was also provided to us from captain Conwell of the 6/8 precinct police department and thus- and this will be the following report- that I gathered from what the captain Conwell sent to us, and the first is an email dated from the captain on January 3rd 2020. The precinct conducted two visits there observing alcohol on both occasions that Manya this is Luann's coffee shop, the precinct inspected the business and found a fully stocked bar the owner failed to produce receipts and records for the alcohol. Our police captain informed us that this is a store fund operating as a bar unlawfully selling alcohol and as a party hall nightclub, mostly on weekends. This establishment is not licensed by the SLA. It is supposed to be a coffee bar January. 3Rd 2020 is the date of the second inspection. Multiple summonses were issued regarding unlawful dealings with alcohol and much alcohol was destroyed by law enforcement. He also provided us with additional adverse incidents. Regarding this premise: On February 1 2020. There were two arrests following a serious physical altercation between patrons at this unlicensed premise, upon police arrival, it was evident that alcohol was being sold. Minors were consuming alcohol, thereby endangering the welfare of these minors. There were no receipts or records of the business for inspection. The use of marijuana was witnessed in the Taser and pepper spray were recovered. There was blood and evidence of a fight and destruction to property. The owner mr. Garcia and the patron were both arrested. Our new police captain Tolson and officers Panepinto and Inger breaths in' participated in this meeting through zum reiterating captain Conwell's written report, miss Bridget Garcia and mr. Luis, Garcia Maldonado brother and sister were present at the Xoom. They were given an opportunity to speak. Bridget was the spokesperson for this establishment. She stated that she is sorry for what happened and so that this that inexperience is the cause of these events. She says that she takes responsibility. The committee questioned her further regarding the repeated complaints, noise, promoted events, illegal use of alcohol and the need for police intervention. She was aware of the problems and the owner of the property was aware. Richie Garcia informed us that the premise was sublet it in actuality. She later stated that it was some led out to several different persons who were sponsoring promoted. Events to the committee, the excuse of an experience was not accepted. The committee stated clearly that we wholeheartedly support our local businesses, but it is unacceptable to disregard New York state laws by selling alcohol without a license endanger the welfare of minors. To continually disrupt the quality of life of our community and to show blatant disregard to the essence of this family-oriented neighborhood in some in consideration of the fact that there is no certificate of occupancy for this building that we do not have photographs of what the actual establishment will look like, but the application submitted submission has not included the new york city building inspectors resolution to the construction without a permit. From this february, we disregard of the numerous 3-1-1 calls for the repeated complaints for noise for a year and a half with no remedy and the knowing illegal I'm. Sorry, that's wrong for since September and the knowing illegal use of the establishment as a bar with the continued consumption and sale of alcohol without a license, including the need for 9-1-1 police intervention. On several occasions the committee voted to deny this application and to send a letter to the New York State Liquor Authority. Regarding the actions of these owners, we asked if the board moved, to approve our recommendation. Okay, so did you meet in Coram barber? Oh sorry! Yes, we did it okay. So that means the motion is on the floor and so I opened up to discussions. We have any questions or comments with regard to this application. Do we have any hands off mark, not a question, we're very quiet tonight? Okay, so no questions, no comments. We will call the question. You said there was no SIBO at all. It never was or expired, or you just said that the building has no see I mean it's possible. It was built precio, which is time in an area but yeah. Okay, any other questions. Does the establishment also own the building? No, you know okay good all right, so they they'll be there assuming they're out. Then they have some sort of a lease or something I assume that the owner with the landlord all right. So they just have to shut down the business, but they can open up another business theoretically to the SLA regarding them for an alcohol license, and we will also this doesn't preclude them from opening a coffee bar where tonight we're voting exclusively on the liquor. License application remind me how long this place has been open. The complaints begin in September of what year nineteen and when do it, when was the premise open as a coffee, shop or September of nineteen and the first complaints came in when September of nineteen forget it. Yeah I mean I'm, surprised, wave and letting them open as a coffee shop scene of oh. How can anything operate there? Any establishment have you know operating there without a CFO. Well, a lot of buildings were built pre before the time when the city started issuing certificates. Normally what they get is. It sparked is a letter from the Department of Buildings, basically, a letter of no objection stating that okay to use the building and such in such manner as long as its own and compliance. Typically, a letter of no objection is issued and that's utilized for the State Liquor Authority submission is available in the application. Thank you, okay. So any other questions or comments mark. Do we have anybody with a hand up? No excellent? So let's call the question again: we have to do a roll call vote because we are on this zoom format, so Josephine, if you would be so kind. Yes, thank you. Tracy Britain in favor, Jane capita, nachus in favor, Shirley, Qin, absent, I, believe, okay, Judy Collins, maybe we'll get back to Judy, maybe she's having trouble no audio okay, Chris Ellison in favor and Politico in favor, Carmen, Feliciano, I believe she's, absent, okay, Michael Festa, yes, Carmen I'm, sorry, Carmen be a muted Thank, You Diane Greene artists in favor, Steve goofus, he's absent, Judy, Grimaldi Judy's on but she's having trouble with her audio. She texted me: okay, Steve Harrison! Thank you, Dan! Thank you. Joe June is absent. Habib Stoker colas in Taylor Thank You Marty, once raging leo in favor, NIC Leonardo's, Stephanie, Anthony, Marino I know she was here enjoyment, Thank, You, Ruth, Nick, Mossad, I, know he's here. I know he's here. Excuse me, Judy Grimaldi's, texting she's in favor. She can't get her sounds on okay! Thank you, Judy Collins. Thank you very much. Public safety committee agenda Barbara but you're gonna leave me the second out of three is O'sullivan's. Pub & grub limited located at 18 I, know to third Avenue and it has applied for an alteration to the already existing liquor beer, wine and cider license that is already in operation. The establishment corporation name is O'sullivan stopping grub LLC. The principles are Bernadette O'sullivan and John O Donnell. The attorney representing this establishment was mr. Terrence Flynn jr.. This establishment is known as a bar tavern. The application for the construction was filed on February 7th 2020. It has been administrative, Lee, close to doing activity on April 7th 2020 a job description. This project consists of an interior renovation of the bar restaurant area and the residential units of the second floor, removal and replacement of all bar counters to its same location, alignment to the floors and ceiling height, new roof, hatch and skylight. No change is proposed to the building use, occupancy bulk or footprint. The BOC was checked. The box was checked off certifying in all construction documents. Related to this application do not require a new or amended certificate of occupancy, as there is no change in use, exits or occupancy. This application wasn't completed in its entirety on the date of the meeting in the method of operation. It did note that there is the use of video arcade to jukebox and security. It noted that the business area is on the main floor and the basement there is no outdoor use. The community board office had not heard for the representative regarding this alteration, and that was lawyer. Terence Flynn jr. the district office reached out to the attorney numerous times beginning on March 9th 2020, stating that unless they complete the questionnaire and attend a hearing, a letter would be sent to deny this application. No contact, communication or follow-up had been made until the day of this meeting, which was June 10th. The owner's daughter apologized as there was a lack of communication with this attorney any Sullivan. The daughter of ghetto Sullivan did participate in this zoom meeting. Also present was the contractor Matthew Bell. We were assured that all necessary documents are available and they were delivered to the community board office within the next two days. So by Friday we had everything. A new attorney is Justin. Daley of the law. Firm of Connors and Sullivan available are the floor, plans, menu and certificate of occupancy. The premise has 30 seats, 10 tables and room for 15 at the bar anticipated occupancy is 50 persons. There is no adverse history to this establishment. The application for an alteration of the SLA license is necessary, as there are structural changes to the establishment. The construction will include renovations to the bar and the placement of the staircase, from the middle of the premise near the back, so as to not cut the bar in half and to open up space. Mr. Bell informed us that the construction will take approximately six months. Miss O'sullivan was asked as to the veracity of the rumor that the second floor was going to be turned into a wine bar. She emphatically denied this in a stated that she has also heard this rumor as well as others. The committee moved to deny this application. Unless the following stipulations were agreed to the premises will operate as a restaurant. There will be no sale or consumption of alcohol. The premises until the appropriate license is issued or renewed, the CFO is on, and the owner or manager will be on site during all hours of operation. The hours of operation will be as the following Monday through Saturday 10:00 a.m. to 2:00 p.m. kitchen from 5:00 p.m. to 11:00 p.m. Sunday, 12:00 p.m. to 2:00 a.m. and the kitchen from 12:00 p.m. 9 p.m. the applicants will not sublet the premise. The doors and windows are to remain closed in coordination with any amplified music. The background recorded music remain below the level permitted by New York City noise code. There will be no music on the outside of the premises. The applicants shall not sponsor or use any promoter or have promoted events. There will be no smoking permitted if need be, New York state certified security will be hired and on-site during all hours of operation. They have never needed that there will be no smoking, and the applicant agrees that should it change its method of operation, it will give notice and meet with the community boarding committee at least 45 days in advance of any such change and the owner has agreed to all stipulations. We ask that the board moves to approve the Committee's recommendation. Ok, so the committee met in quorum. So the motion is on the floor. I'm gonna call myself first, because I think you said they went to pee I think maybe even 2 a.m. we check Monday through Saturday 10 a.m. to 2 p.m. him. That's a strike day. Well, that's a short day. I want that different. You mentioned that there was commercial in the cellar. Is it correct? That is ordinary boiler, room storage, kind of commercial use, or is there using it as part of the business? No okay? So it's not the no. Thank you. Okay. Anyone else doesn't appear to be okay, so I will call the question. One thing I would like to say is: while Josephine is doing the roll call. Someone has is having a hard time with their audio. Maybe we can. They can give a thumbs up okay, so thumbs up for thumbs down again. Maybe it'll move things a little more quickly, so Joe, okay, Tracy buttons in favor, shame capita Nagast, judy collins, you see a thumbs up either do melio favor, which a day Michael. Thank you, Chris Elsie! Thank you. Thank you. Chris comments. Call me Feliciano Carmen, you beauty! Thank you. Michael Festa, in favor artists, in favor, Steve, Griffins, I, think he's absent. Judy Grimaldi Hardy is not working movie protects steve Harrison. Thank you dan headaches. Thank you. Jonathan in Thank You Justin hi in favor, in favor Marty. Let's waging real in favor Nick Leonardo's Mahoney's Anthony Marino in favor Bruce maser in paid her Nick Mossad Susan Janet votes in favor. Thank you. Okay, yes, I just couldn't Julie. You keep cracking, keep a straight face with that mask on. Please come on hey last one is just informational. The body brothers corporation, located at 67, 52 4th Avenue. Stop. Would you get them covering her? They notified the community board that they would be applying for an SLA wine beer sign a license. The applicant was not prepared, says the establishment is still undergoing construction. Therefore, the decided to delay this application and attend the CB 10 hearing at the police of Public Safety Committee in September, and that was just for informational purposes for you only since they were supposed to be part of that meeting. The other night Oh respectfully submitted the next item on the agenda is the budget and Personnel Committee and Sandy Ballas will be delivering that report. India nursing his absence sandy, the budget Personnel Committee held a zoom meeting in quorum on Wednesday May 20th 2020 at 7:00 p.m. with the following members, president Bryan kasuba. Bravo Bravo Lucci, sandy Valles bar burger Mac and chairman Deidre zinnia also present were Dorothy guru, CEO and district manager, Joseph embackment. The purpose of the meeting was to allocate funds remaining for the fiscal year 2020 budget and proposed a fiscal year. 2021 budgets for commuting for 10 I, don't number one. Due to the coronavirus. There were unspent funds for the other than personal services, category totaling, two thousand to two thousand two hundred fourteen dollars. Only 6n and unspent funds from the city council grant fund of three thousand 230,000 ninety-four cents for a total unspent funds of five thousand four hundred sixty two thousand twenty cents. A motion was made by Barbara, Bellucci and seconded by Bryan kasuba to spend the total of five thousand four hundred sixty sixty-two dollars and 20 cents in unspent funds for fiscal year, 2020 budget for deep cleaning and disinfecting the district office and printing of military pamphlets and printing of senior pamphlets. The motion passed unanimously: the following fiscal year, 2021 budget for the other than personal services and personal services for the Korean War Tan is proposed. No all Community Board budgets were decreased by eight thousand seven hundred twelve dollars, leaving the community or ten with two hundred forty eight thousand seven hundred ninety five dollars for the fiscal year. 2021 budget Brooklyn Community Borton proposed fiscal year, 2021 budget Personnel, Services full year, salary for three positions: two hundred seven thousand one hundred and forty four dollars hourly salaries for one position. Twenty-Six thousand six hundred dollars and a college a for one thousand: five hundred dollars: total personal services budget, two hundred thirty five thousand two hundred fifty five dollars other than personal services office supplies, two thousand dollars: water and water cooler, one hundred dollars, storehouse items from New, York, City, four hundred dollars; security equipment, $504 interested in California, quipment, $2,500, constantcontact, 608, mints, $510, temp services, 1096 cleaning services, two thousand three hundred and fifty dollars toll for the other than personal services. Thirteen thousand five hundred forty dollars total fiscal year, 2021 budget, excluding energy, 248 thousand seven hundred ninety five dollars. A motion was made by Brian Kazuma seconded by Barbara ger Mac, to recommend the proposed budget to the full Board for Community Board ken. The motion passed unanimously respectfully submitted for Dean Rosie yeah me. Okay. So now you just gave us a report for each for the fiscal year, 2020 the remaining and also fiscal year. 2020 want okay, just because they were on the agenda as to items I'm just the committee met in quorum. So because it's on the agendas to items I'll just do the review of the fiscal year 2020 budget, first, okay, so are there any questions? It was the committee met and quorum. So the motions on the floor there any questions comments. I, do understand that would be best in interest of time. However, for purposes of clarity for purposes of they prefer to do them separately. I want 100% clarity on what the board is voting. Oh I've been some issues raised in the past with regard to the override votes on, and this is, it is important that this be documented for those purposes so I would like to just. If we can do it quickly. I understand it does take time. It is important, so I would like to put the fiscal year 2020 budget on the floor, any other questions or comments. Okay, so Joe can you do the roll call? Yes, Tracy, Brittain Tracy I can't hit Tracy. Are you able to do audio on okay, I'll, move on James, Magus Shirley king I? Think she's absent, judy collins richard day in favor, in favor Michael Festa in favor penguin artists in favor? Deep wizards are you Johnny he's a cutie Grimaldi she's in favor, okay, Steve, Harrison, dan headaches, Justin hi in favor I think we lost barber. Thank you. My host muted me I'm in favor Thank You, Laurie Willis in favor, Michael, shade, okay for the budget, so that motion is on the floor. We have any questions or comments. Okay, so call the question in favor, okay, Thank, You, Carmen Feliciano in favor Steve is absent. Judy Grimaldi, let's see I'm. Sorry thank you. Thank you. Thank You Anthony in favor, mr. parez favor dozen Pulaski Jean with senior doctor Maui way, I think we lost him. Larry Stelter in favor, Henry Stuart in favor, Alito Chinatown and Sanjeev Alice, good favor babalu cheap in favor Louis in favor, Michael G in favor. Thank you. That concludes the ball. Okay. Thank you. I just I called for two votes on that, because I want this to be clear, there's been a lot. There were not so not such not so far back. There was some confusion about boards and personnel actions and I. Don't want it to be any mistakes and our lovely staff and the people who are dedicated to our office for some ways and not get paid so I wanted that to be clear. That was my reason for that. So we have the communications and public relations committee report by Brian kasuga. So the communications and public relations committee met on May 27th at 7 p.m. on WebEx. We met in quorum, and so we had one topic: we're updating on the keyboards launching of Facebook and Instagram. The committee met to discuss and review can be bored launch of his Facebook and Instagram accounts both were launched on April 29th. The successful launches were done with the help of Kristina Medina, the CEO and founder of C a.m. brand and Lizzy on a paid college age from st. Francis who works in the district office. Since we have blogs web pages, we presently have about two hundred and one Facebook followers and 150 Instagram followers. District manager, Beckman, has done an excellent job. Maintaining and updating each page with content and information regularly was a young as assisted Josephine. With the page updates. The pages have been used to promote returns, live stream, feed from our meetings from city agencies and other local community organizations. During a meeting, we discussed ways that the committee can help support the work being done by the district office to keep these accounts active. We believe right now. Our main focus needs to be promoting these pages and boosting the number of followers. We encourage everyone on the board, who has Facebook or Instagram accounts, to follow CP ten and share the pages with everyone on your content contact list, I'd encourage them to do the same. Even if you do not have personal social media accounts, you can still promote these pages by encouraging people you know to follow seed. In addition, many of us are active in other organizations and businesses that may have social media and we can use these organizations to help promote our own page. In order to find CB turn on Facebook and Instagram, you can search using the name community board, 10 B K. That's all one word community board, 10 B K, and then you can search and find us and like us and share us. In addition to the committees promoting our pages to contacts, local businesses and organizations, we're playing creative ways to use the CB time social media to promote positive stories in our community and share important information, that's useful to all residents, communication and the dissemination of accurate and timely information has never been more important than it is right. Now in a Cove in nineteen world, CB 10, thanks in large part to the leadership of josephine, with the help of her district staff, has always been used as a trusted source of objective non, biased information being able to grow. Our social media presence only helps achieve the goal of reaching larger audiences quicker. Cb 10 can help dispel much of the inaccurate information and propaganda that often floods, social media news outlets. The committee will continue to work to support our social media efforts and look at other ways to promote the great work that we as a board to and that the community should be aware of. Thank you and I hope. Everyone remains safe and healthy, and you all have a wonderful summer. I look forward to hopefully seeing you in person. This fall. The meeting was adjourned at 8 p.m. respectfully submitted Brian kasuba, chair of the committee, and we met in car okay. Thank you very much Brian, and that was an informational report. So we don't need to vote I want to thank you for all of your efforts in getting and getting our Facebook page up, because it was something it was in a long time in the work so I. Thank you for that and everyone please like our Facebook page. Maybe he likes so moving on to the next item on the agenda nominating committee. I would like to thank the nominating committee by the way for their work and for their nomination and it's chaired by Judy Grimaldi, who are we still missing Judy? Is she able to login okay, call a Miss secretary to cast one vote in favor of the slate so vote for the okay Judy? Isn't here Regis late? According to the agenda, the slate as presented for the fiscal year 2021 is presented by the nominating committee at the May 18 20 24 meeting is as follows: chair Laurie Willis vice chair in January, Kappa, Tanaka's secretary sandy ballast and treasurer Brian, kazoo so secretary. Thank you for casting your vote and now it's on Joe, yes from Judy. No, that was, it I think just the casting of the one Balam. That concludes it. That's the official ballot brings to a closed our meeting our last meeting before we go on summer hiatus, except for do we have any old business, so they I do really quick I misspoke in my report, our next board meeting in September 21st. So we have even a longer break because I sorted by week board meeting for CB test yes or hail or in the ether. Anyone, okay, Jude I would like everybody to know that she's with us, but she just has a faulty connection and can't do audio business. Yeah just have a really nice summer. Everyone, no I, sent an email to the about. This seems to be your honor I'll, be clear out the window here. Beverage parking for that was premature. Extra lately, there's motorcycles, cars racing down the street all hours of the night and during the day I mean if there's less traffic. People is take advantage of if they see an open road and they pedal and hit the floor at the floor. So it's been we've gotten a few of these complaints and we will certainly let the commander know. Thank you also had my recusal also a night. Yes, thank you giving this over to the commander. We do have a new commanding officer at the 68th precinct. Now captain come on well a lot of you. If you've, you know followed on the police department's social media they do, is they really did a great job? They have impounded cat cars drag racing and we are just getting to know our new commanding officer and it will be alerting to learning touching days with him in the in the not so distant future. Yes, why do they keep switching captains? You know I'm comfortable with someone and they get to know your neighborhood and my priests they just like make them move on. It is customary that an average commander stays about two years, not this I'm. Just saying that I personally feel as community board member to our community. We should have better communication with the police department, whatever that's going on and I, think that's something that we should address with the powers that be that we need to keep people in the community that are connected to the community. I, don't think they have to keep moving on after two years. So maybe we can address that at some other point in time as new big thank you, everybody yeah become familiar with our neighborhood they've moved on exactly yes, that's some something and I want to speak about I jumped on this a little bit at the end of the last meeting when we were together, bob was driving along Fifth Avenue in the 80s Saturday night about 7:30, quite early still bright, light out, and at least two or three of the bars there had a like 20 people outside drinking having a party. No masks, I, don't think our commander on the police are there with us. But what is the plan? I mean before you know what you're gonna be getting calls three one as the summer continues of noise smoking people drinking in public? What are we doing with this? So Josephine? You want to go ahead. Yeah I just want let Barbara no I mean right before there's no meeting say I did speak to the new commander, captain Tolson, who apologized for not being able to be here tonight, but he did say, he's doing outreach to all the SLA licensed establishments. He's gonna be proactive. Outreach following you know weekend calls, and there was a spike in three. Would one call so we're on the same page there and we will be following up, but he said they are doing proactive outreach. Sorry I just want to keep this going for just five more minutes. This is a big problem in the police department in general. It's we have to change the dialogue and I feel that if you keep changing your captain, they never going to get connected to the community. That's part of the problem with communities and their police departments, so I'm just saying that that's that this is an issue that we as a community have to keep addressing as far as changing the way that we, you know, protocol for Police, Department I mean I, don't know if that has to do with the mayor, the governor, but it's something that we have to keep in the dialogue for all of us, as community I mean, would everyone agree or am I just this Steve Harrison Jill I'm listening to you and I agree with you in many ways, but having been on the community board for a very long time, I can tell you that there's many captains I wish, would never leave. But there's a few I wish were gone in less than a year, be very careful what you wish for here. You just might get it yeah, but it doesn't have to be one or the other. It doesn't have to be like you know it has to be an open dialogue constantly it shouldn't be that two years go and you're gone. It should be like we appreciate you. We want you, we want you to stay on, it doesn't have to be black and white, like everything else in this city is like black and white everything's, a gray area. I think we need to have an open dialogue about how we can reform the police department within the community, and it doesn't have to be. You know you're here forever or you're, not here. It just needs to be an open dialogue. So it's just something that I want everyone to think about, and then maybe we could revisit that at a later time. Steve's comments. So we are very careful. Thank you. Two things. You know a comment on the policewomen I met with the new commander is a great guy to be changed every two years. I think it's a good idea, because if they case they feel relaxed in the neighborhood, things start going different ways that that's my comment. Does it mean thank you very much for the commendation on the arab-american Sochi Asian, and we were very glad to have you with us giving food away one more item. The Islamic Society of barrage are giving meat boxes. Ten pounds of meat I think it's on Friday every Friday for the next three Fridays. If you put that please need and if they can't, if they cannot come out, give me the name. I will deliver myself. Thank you. Babe I, just wanted to mention really quickly. I missed in my report is that we learned that our former district manager of community boards had Mary sand pebbles passed away, so I just wanted to share that with board members, and we just really saddened to hear that news and if we get any more information about any memorials or remembrances I will be sure to share with the board about a month ago. Okay, I just wanted to say I just wanted to say that Mary Ann Peppa's was very important to our board. She was a great lady and she will be missed. Thank you, Steve. We need to be calling on people I, don't know. Who guys can we use the raise hand function it'll, make it a lot easier. Who's texting me he's asking if we can appoint a task force to address this insensitivity to the overall community concern she's speaking about the captain, will have to get together and discuss as a board. I think there are a number of considerations that go into that. You know we are advisory. You know obviously, there's concern here. I see that we have senator gun artists with us and I was great to see everyone understand. We have some new people joining us today. This will be both the most rewarding and frustrating experience all having community service, and they say that both with a smile on my face, because it really is surely incredible to be able to serve our community in this way. So thank you to everyone who has who's joining for the first time. I'm sure you'll have a great experience. A couple of quick things and I know I'm, probably towards the end of the meeting. Everyone wants to go, have their there they're really very concerned about what's happening on the small business front, part of the conversation about the restaurants and what's happening the weekend and 22, because everyone is frustrated. Everyone wants to get back to some type of normalcy and we have been doing safely and the city and state have not been forthcoming with really good guidance, and the city especially, is trying to delay the rollout even longer, which is incredibly frustrating and incredibly disappointing. I started a small business recovery. This is not just talk about ideas really to figure out and triage problems as they were rising and see. You can't get specific answers to specific questions that pop, so we don't let them linger and fester and leave people in a state of uncertainty, so that would be. We have about 30 business owners from across the district right now. Effort will continue to grow if you're interested. If you know this one, that's interested to my office into the Jill's point, this information, just as a point of information, not with any views on it, but the borough president last week proposed having community boards and community precinct councils they'd, be able to weigh in on the appointment of new police, captain's, never precinct as a way to empower and encourage community engagement on that front. So that's an idea that maybe you guys about a week or two ago, and so it's definitely worth considering and talking about more. We still have seen issues with unemployment still have seen issues with food security. We are now offering food four days a week next week, we'll start offering it five days a week, the office, because the lines just keep growing longer in law. So, even though we're starting to reopen, there are still many people in our community who are not back to any sense of normalcy and who, in fact, are hurting more so now it's been their savings, their credit, and now they have nowhere else to go. So that's gonna continue to be the issue for us, I think for a few months still so, as always reach out to me with any questions, concerns complaints but I'll take everything else. Female I, just thank you for letting me in' and thanks Dorothy for helping out I, know. I didn't get to speak on the police issue, but the whole community's concerned about it. So we as a community board I support Jill, and we really have to either under the police of Public Safety, but we cannot not speak on this issue. It is too important and we have to have our have to really coalesce around this. We can't put it aside Laurie, so please consider it very strongly in your upcoming agendas. Thank you appreciate it. Okay, you know we have to do before I put anything on an agenda I like to do a little research and find out what our purview is and really what it takes to get something like that to move forward. So I always like to do a little bit of research, rather than just throw something you know on an agenda because I don't want to be in a situation where it ends up that you know. Of course, we can always make suggestions, but it's better to make suggestions from an informed standpoint where you say hey. We want to do this and we can do it by doing this. I feel like, rather than throwing the idea- and you know into the laps of elected officials and saying hey guys. This is what we want: go figure it out. I always like to do a little research. So that's why? Sometimes, if I don't sound like I'm encouraging an idea? That's not really the case, I'm thinking, okay, how do we do this? How do we get that done so committee blindly and then we'll see, but it has been a concern and I do here. You know having been the chair, police and Public Safety for a while, you know. Sometimes we do have commanding officers who are just so attentive and wonderful, and sometimes we don't get as much of a response as we'd like I'll put it that way, so I'm not sure if the resolution is input on who we get or whether it's input on tenure, but we should have some input on because we do need someone who fits our community and understands the issues are of our community, one of my pet peeves I'm, sorry to drag this out, but since we're on the issue, one of my pet peeves has always been when we have a commanding officer that says to us: hey you know. Crime in your district, statistically, is lower than in most districts in the city, and so basically you should just be happy and my gut reaction to that is always you know we don't strive to meet the lowest come. You know the lowest level or even the median. We strive to keep what we have and always improve on it. I think that should be the goal. You know at least the standard we have and improve on it to be the goal in any district. So this sounds really simple, but I think it's something that were it's going to be something that we would have to tackle so I'd like to put a little research and thought into it. You know before we actually put it to a committee, but you know we're hearing, concern and so we'll work in that direction, so everyone 38 I, think we'd like to get moving on, even though this is our last meeting before I hate gonna, miss each other, but I would entertain a motion to adjourn. I need like to make a motion to adjourn. I have a second beer from Ruth, mace or the hand up I'm all in favor enjoy you.",
        "summary": "I want to give a shout out to the Arab American Association and our board member and co-founder Habib today, who invited me this month to help in the food distribution which was incredibly touching to see and really just incredible experience to be with so many good volunteers and meet and greet residents and our community.\nIt's, something that we're monitoring and working closely with the tbta And I'm speaking to new board members here to tonight, please, like us on social media.\nYou know this year at 7 p.m. on a zoom, and there was an application for a new liquor license for a weird wine beer and cider submitted for Luann's coffee bar Inc, located on the first floor of 7405 3rd Avenue.\nShe stated that you cannot see into the windows New York City Building inspectors attempted to gain access to the premises on February, 25th and 26th of this year.\nThe committee questioned her further regarding the repeated complaints, noise, promoted, events, illegal use of alcohol and the need for police intervention.\nThe committee stated clearly that we wholeheartedly support our local businesses, but it is unacceptable to disregard New York state laws by selling alcohol without a license, endanger the welfare of minors.\nIn some in consideration of the fact that there is no certificate of occupancy for this building that we do not have photographs of what the actual establishment will look like, but the application submitted submission has not included the new york city building inspectors resolution to the construction without a permit.\nThis february, we disregard of the numerous 3-1-1 calls for the repeated complaints for noise for a year and a half with no remedy and the knowing illegal Sorry , that's wrong for since September and the knowing illegal use of the establishment as a bar with the continued consumption and sale of alcohol without a license, including the need for 9-1-1 police intervention.\nThe committee voted to deny this application and to send a letter to the New York State Liquor Authority.\nLet's call the question again: We have to do a roll call vote because we are on this zoom format, so Public safety committee agenda, Barbara, Leave me the second out of three is O'sullivan's.\nThe district office reached out to the attorney numerous times beginning on March 9th 2020, stating that unless they complete the questionnaire and attend a hearing, a letter would be sent to deny this application.\nThey have never needed that there will be no smoking, and the applicant agrees that should it change its method of operation, it will give notice and meet with the community boarding committee at least 45 days in advance of any such change, and the owner has agreed to all stipulations.\nTherefore, the decided to delay this application and attend the CB 10 hearing at the police of Public Safety Committee in September, and that was just for informational purposes for you only since they were supposed to be part of that meeting.\nA motion was made by Barbara, Bellucci and seconded by Bryan kasuba to spend the total of five thousand four hundred sixty sixty-two dollars and 20 cents in unspent funds for fiscal year, 2020 budget for deep cleaning and disinfecting the district office and printing of military pamphlets and printing of senior pamphlets.\nDon't want it to be any mistakes and our lovely staff and the people who are dedicated to our office for some ways and not get paid We have the communications and public relations committee report by Brian, kasuga.\nWe discussed ways that the committee can help support the work being done by the district office to keep these accounts.\nIn addition to the committees promoting our pages to contacts, local businesses and organizations, we're playing creative ways to use the CB time social media to promote positive stories in our community and share important information.\nThe committee will continue to work to support our social media efforts and look at other ways to promote the great work that we as a board to and that the community should be aware.\nWe don't need to vote I want to thank you for all of your efforts in getting and getting our Facebook page up, because it was something it was in a long time in the work So moving on to the next item on the agenda nominating committee.\nI would like to thank the nominating committee by the way for their work and for their nomination.\nIf you've, you know followed on the police department's social media.\nI mean before you know what you're gonna be getting calls three one as the summer continues of noise smoking people drinking in public?\nI mean I, don't know if that has to do with the mayor, the governor, but it's something that we have to keep in the dialogue for all of us, as community And I agree with you in many ways, but having been on the community board for a very long time, I can tell you that there's many captains, I wish, would never leave.\nI think we need to have an open dialogue about how we can reform the police department within the community, and it doesn't have to be.\nI missed in my report, is that we learned that our former district manager of community boards had Mary sand.\nYou know this one, that's interested to my office into the Jill's point, this information, just as a point of information, not with any views on it, but the borough president last week proposed having community boards and community precinct councils they'd, be able to weigh in on the appointment of new police, captain's, never precinct as a way to empower and encourage community engagement on that front.\nWe as a community board I support Jill, and we really have to either under the police of Public Safety.\nBut you know we're hearing, concern And, so we'll work in that direction, so everyone 38 I, think we'd like to get moving on."
    }
}