{
    "YoutubeMetadata": {
        "author": "QCB5",
        "channelId": "https://www.youtube.com/channel/UC51mApBs4KUp4T8avIhyAnw",
        "title": "Queens Community Board 5 July Meeting",
        "publishDate": "2020-07-08",
        "shortDescription": "Community Board 5 Queens\\nMonthly Meeting\\nWednesday, July 8, 2020\\n7:30 PM"
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "QCB5",
        "normalizedName": "Queens Community Board 5",
        "twitterName": NaN,
        "youtubeChannelName": "CB5 Queens",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC51mApBs4KUp4T8avIhyAnw",
        "twitterHandle": NaN,
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "We're getting close to time 36., so we have 34 participants and, for some reason, richie's on twice lied with the ipad 8 and the phone number okay. Whoever is I'm confident that we are warmed up so mark you could go live and then we'll begin. The meeting at 7 35, okay, we're just showing the log the apple right now. Okay, thank you. Why, on the bottom of the screen, because richie told everybody he was, is so call and use the one. That's edgar right, I believe so can who's that hello. Yes, okay, I'm not even going to attempt to spell that sorry yeah. My first name go ahead, hello, hi! So my first name is king. Jose like what I'm sorry, your best partner, couldn't get his message to us today. So if you know what he wanted to report, you can report that later for us. Okay, of course, of course thank who you 639-7676, nine seven, six, seven, six good, very good and somebody's listed as video, I'm gonna text that person okay, so joe, is here on my nickname video. You know you know joe video killed the radio star you're dating yourself. Thank you, okay, so if everyone will okay, so welcome to a live, visual meeting of community board, 5 Queens will open with, as usual the pledge of allegiance donald. Would you show us the flag? I pledge allegiance yeah go ahead don I pledge allegiance to the flag of the united states of america and to for those of you who are just viewing. We thank you for joining us for the board, members and electeds that are participating or the elected that have sent us statements we'll get to you. The first order of business tonight is someone's got to sign their sound on or making noise. That's on the telephone. Just gonna ask if everybody can mute themselves unless you've been okay, so, while you're doing that the first order of business tonight is a corona update and is that you che? No, yes, my camera is not working today. So it is. We see you [Laughter]. Yes, that's me in the city council chamber. Yes, sir yeah, let me know when to start go: okay, all right so hi good evening, everyone! My name is che no from the new york city, department of health and mental hygiene. I work for the office of external affairs and I'm glad to be able to join you today tonight once the board meeting so tonight I'll be providing some situational updates on what the city is doing, what the state's doing and so to begin I'll, be discussing numbers so globally we have more than 11.8 million reported cases. As of this afternoon. Last month, when I spoke at this board, I say I said- maybe eight million or nine million- I don't know, but the number has gone up dramatically. New york state itself has a hundred eighty one thousand one hundred fifty two reported cases outside of new york city and new york. City itself has 214 to 570 reported cases. As of today. New york city lost 18, 618 people and confirmed deaths and 4 4606 probable deaths, and we currently have a 213 confirmed cases and 500 pen I mean 55 pending cases of misc, so the pending cases are retractive and were acquired after the data match. With new york state for more information, you can visit nyc.gov health coronavirus and click on data. The numbers are updated every day, so for Queens itself, Queens has 65 428 confirmed cases of those cases 26 or about 1737 people are hospitalized have been hospitalized. There have been five thousand six hundred eight hundred sixty eight confirmed deaths and one thousand two hundred twenty two probable deaths as of today and Queens has 41 confirmed cases of misc. So, as you all know, new york city is in phase three of the reopening. All new yorkers should get tested for covert 19., please stay home if you're sick, only leave for essential medical care and testing or other essential errands and keep physical distance stay at least six feet away from other people and don't forget to wash your hands often with soap and water use hand sanitizer. If soap and water are not available and wearing a face cover and face covering is mandated by the governor's executive order, you can be contagious without symptoms. Protect those around you by wearing a face covering. So today is today july 8th. What is new york city's get tested day of action so today begins the campaign of we hope to get 175 000 new yorkers tested for covet 19 in a week, and the test and trace core with which is a combination of the health department and home health and hospitals is trying to have all new yorkers receive free testing for coping 19.. All new yorkers again should get tested for tested for cover 19, regardless of symptoms or increased risk. Immigration status will not be asked and it will be free for more information. You can visit test and trace DOT NYC and to find the site near you please visit nyc.gov, Covid-19 test. Repeat, testing should be offered if you have Covid-19 19 symptoms or, if you're concerned, by possible exposure, including spending time in large crowds and exposure to someone with confirmed or possible, Covid-19 19 or breaches and wearing a face covering or maintaining physical distancing. All new yorkers who participated in recent protests on any side should assume that they were exposed to Covid-19, 19 and get tested and with phase three. We have various industries starting up operations again. Non-Essential businesses and business activities and the following industries are now open: agriculture, forestry, fishing, hunting, commercial building management, construction, essential and phase two and store retail hair, salons barbershops, manufacturing offices, outdoor and takeout delivery. Food services, indoor dining, is not open for the governor and the mayor's orders. Personal care establishments are open, real estate, retail, which is limited to curbside or in-store pickup or drop-off, retail rental, repair, cleaning, vehicle sales leases and rentals and wholesale trade non-essential worker workers not included in phase 1, 2 or 3, are directed to work from home with phase 3. We also have open outdoor recreational activities such as basketball, bocce handball, tennis, volleyball courts, dog runs new york, city, public and private beaches for swimming new york, state park, beaches for swimming playgrounds and public and private outdoor pools. So these are now open and recently the board of health allowed child care centers to reopen on monday july 13th. However, the centers do not have to open if they feel uncomfortable. So in order for them to be open, child care, centers must have new york city permits and attest to the following: no more than 15 children per room base, coverings for staff and children, daily health screenings, frequent cleaning and disinfection and limited sharing of items, including toys. We will inspect programs to verify compliances and for businesses to have questions about restarting they can call the department of small businesses at 1, 800 sbs for NYC, so that's 1-800-727-4692 and as for reopening guidance, please visit ford.ny.gov, let's see what's the hot potato topic: yes, the travel advisory, so new york, new jersey and connecticut, have agreed to quarantine individuals from various states. This restriction applies to travelers from alabama arkansas, arizona, California, delaware, Florida, georgia, iowa, idaho, kansas, louisiana, mississippi, north carolina, nevada, oklahoma, south carolina, tennessee, texas and utah, so the travelers from these states should be quarantined for 14 days. The state is also looking into specific air conditioning requirements to prevent airborne spread of the virus. During the press conference today, the governor mentioned mentioned that indoor malls can open provided that they are outfitted with mirv, 11, 12 or 13 filtration systems. That's up to that's up to the mall to decide. It does cost money, I'm not sure which models will be open, but yeah. The requirement is there and since we can't dine inside the city is expanding restaurant seating options in order to keep new yorkers safe. So we have sidewalk seating, curb lanes, heating backyard and patio city, and the open streets will be active from friday from 5 pm to 11 p.m and saturday and sunday from noon to 11 p.m. Yeah, that's it for my updates today. Since a lot of the topics I covered in the past instances of this meeting. Okay, mr chairman richie you're, here richie has his hand up. Yes, if I could ask a question, there's been a lot of discussion about false positives and false tet negatives on the testing. Could you speak to that? Please. Thank you. Yes, so for the Covid-19 19 testing itself, if you're getting the regular nasopharyngeal or oropharyngeal swabs, the test is relatively accurate. We haven't seen much instances, but we've seen this problem crop up in antibody tests. So when it comes to antibody tests, we're stressing that it's not a definite result that you're immune from covalent 19., in fact we're still trying to figure out. You know if the antibodies make you immune to kova, 19 or, if they're just there for a couple of months if they disappear. You know it's still not clear. There are various research papers coming out saying different things, but we need a large sample size and you know we need to conduct additional testing. So that's a concern that we definitely have and therefore you know with this day of action and going forward we're trying to offer you know we're offering free coping 19 testings so that new yorkers can get tested as frequently as possible if they want to okay kenny, you have a question yeah over the week I was away from upstate for the weekend and on the news up there. They were talking about being that it's you know that we're in july and higher heat, they were saying not to leave hand sanitizer in your car because it can't explode well, anything that contains 90 percent alcohol. Yes, that's true, most people wouldn't even have thought of it. You know. Thank you, mary ellen! That's paul! Go ahead, paul question: how is the city enforcing the quarantine, for example? If I have somebody who I know has been away for a while and now has come back and back on the block, and I know that what state they've been at and if they go out the next day and every other day that doesn't seem to be a quarantine. How is the quarantine enforced? Is this? Just everybody's on best behavior trey. Okay, thank you for your question. So this quarantine order is from the state itself and I understand that it is a state that will enforce. As for the enforcement mechanism, I haven't received additional word on that, but per the new york state public health law. They can impose various penalties, starting from two thousand dollars going into five thousand dollars, ten thousand dollars and so forth. So I'll ask for enforcement details. So once I get more word I'll share with the board, so is there someone that we can call if we see a flagrant violation trader one day, I'll get a number that was produced online at the daily conference, both the mayor and the governor? If someone wanted to rat out their neighbors? Yes, so marianne microphone, no hi, I got a question. As you know, the warmer weather coming and the beaches are getting quite crowded. I was told by someone that covered 19 is it gets killed in the ocean water because a lot of people are on top of each other? Is that true? Or is it in this? It is a myth because well, if that proved to be true, then we wouldn't have high case numbers in Florida, because over there people are on top of each other, but beginning may, because they opened up way too early. So people are all over each other. You know enjoying the beach going on, you know, enjoying the sun and then going surfing and whatnot and the case counts are still going up. That's why so new york state, you know, thankfully right now it has calmed down. So our case counts case. Numbers are lower than that of most states, but the threat is still there. So we're not sure if the reopening will cause an increase in case counts again, because over the past week, two weeks, the case numbers, you know they fluctuated the highest. One was 900 a day today. I think it reported, maybe 570.. So you know we're still keeping an eye on eye on this thing and that's why we're asking people to maintain physical, distancing and wear face coverings, and you know, avoid large crowds and so forth. So I mean going outdoors, you know that does reduce the risk because we're not you know, breathing in recirculated air and we have more distance between people. But when we're you know going out to enjoy recreational activities, you know we must ensure that appropriate distancing may be maintained for the safety of ourselves and others. Thank you, dimitrov dimitro, marianne, somehow you're making noise. What are we doing here? Dimitro? Where are you okay, marianne, somehow, there's noise on your end? Would you I don't see how that can be possible. Vinnie, she's, muted yeah, it's not it's not from there. Okay, so dimitro. Where are you were talking about 15 children student in a room? How big is the room size we are talking about? Is there any invitation? City has set up for the room that we can 15 students in a room? That's right! I believe there are different size stipulations per the states of announcement. I do not have that information on hand, but I understand that different criteria and daycare child care providers that are looking to reopen must attest that you know they fit these requirements under penalty of law. So six feet: distancing requirement is required even in a room yeah possible. Yes, was it wasn't it combination of 50 of the legal occupancy plus six foot, spacing it's different for each industry because, let's say: let's take, for example, for manufacturing and different environment office environments for working environments. The initial restriction was 25 percent and we increased it to 50 percent and but for houses of worship. For example. You know it was restricted to 18 percent or 20. Now I think yeah 25 and now it's up to 33. So I guess it depends on the activities they conduct for child care activities. You know children are running around and they will be speaking. They will be talking. They'll be they'll, be doing sing-alongs. So that's why they're trying to keep it under a manageable number and as for like the spacing the distancing itself, I can you know, look at the guidelines and I'll give you a definite answer later on. Thank you. I I'm unmuting anybody who's on the telephone. In case they have a question. Okay, if not the next item of business, is a presentation by hold on I'm going to get my cell phone up a presentation regarding white cough hospital adolescent program: gary, do you know anything more about that? Well, no, there's a hannah is okay. Introduce yourself hannah, please hi! Everyone. Can everyone hear me? Yes, awesome. Thank you so much for having me into this meeting. So again, I'm hannah I emailed gary months ago about this new program. So I'm really excited to be able to talk to you all. So I'm a staff, member of wyckoff pediatrics, wake up hospital pediatrics and we have a fairly new program: that's geared towards getting adolescents, so teens 13 to 20 access to holistic care. That includes you know not only their physicals but their sexual and reproductive health needs. So this program came about because concerned staff, members and doctors said you know in ridgewood and bushwick and the surrounding area of wyckoff hospital. There's all these statistics of young people still having disproportionate rates of stis and hiv and relationship violence. You know what can we do about this and why isn't there a clinic that has youth specific sexual and reproductive services, so hence the birth of extended programs for adolescents at wike off pediatrics? So you know obviously we're still in quarantine, but you know teens will be teens, they're, still sexually active, some of them and need these services, and even after this, a lot of young people need these services and aren't getting them across Brooklyn and Queens. So if you know any young people who need these services or you're a member of another organization or just a concerned adult for youth, this is a really great resource to have in your back pocket to be able to bring up and to give further details. If you don't know where wyckoff pediatrics is we're at 1411 merle avenue, that's right off the knickerbocker m train, but we will be screening virtually and I can give my phone number. If anyone has any questions about the specific virtual screening, we have a grant that allows us to get services to young people, regardless of what their insurance or immigration situation is. And it's holistic. You know we're not forcing anything down anyone's throat if a young person just has questions, that's great. If they want condoms, that's fantastic, and if they want, you know medication for hiv prevention. We got that too and yeah. If there's any further questions, I can definitely assess that now, but also I can leave my phone number and email if questions come up later. Please do anyone have a question or comment at this point. Okay, raise your hand, sorry go ahead, bob. How does anybody know about this and participate in the program so because we're a part of wyckoff hospital? Pediatrics, often young people come in for a physical and they hear about. You know our program because they're sexually active or curious and they can get services through us or we reach out to other schools or community organizations, and they tell youth- and it kind of happens like that, so the youth that I'm currently working with, who are my clients? They looked up hiv tests online and that's how they found us or they came from a high school. So to follow up on that. How much outreach is done on the queen's side of the border or the cat queen side of white cough catchment area, not as much as we would like to now? You know, unfortunately, as we were planning outreach, this pandemic hit and we didn't get the chance to go to. You know the queen's libraries and schools, but obviously you know wyckoff pediatrics were right on the border of ridgewood and bushwick. So it's in the plan to be able to do more outreach into Queens. Well, you do realize there is nothing between wyckoff and jamaica hospital or saint john's episcopal. So this whole community board five area is barren and we rely on wyckoff to help us. So you need to get the word. The word out. Yeah I mean we are. We are new, it is a new program. So that's why I was thrilled when gary accepted the invitation for me to be able to spread the knowledge about this program very good, any other questions. Those who are on phones are unmuted. Okay, if not ken has a question again: hello. Are you allowed to advertise in the walk-in medical centers throughout the area like city med, and I have not asked about city, med and city md, yet I could definitely ask the clinical manager about that, but I don't think there's I don't think, there's a relationship between wyckoff and those locations, yeah wyckoff someday, will be doing outreach to all of those locations and the regular doctor's offices on the queen's side. But at this point there's probably nothing yeah. We set up advertisement for folks who just walk into the maine wyckoff hospital and that lets people know because wyckoff pediatrics is about a 10 minute, walk away from the main hospital. But of course, right now all outreach that I'm doing is virtual. Thank you. Anyone else. Thank you hannah. Thank you! So much. Okay. The next item of business is the public forum. Mr giordano, do you have anything on the public forum a little bit? Thank you okay. So we got a statement from the census bureau and then vinnie don't forget about michael barrage. I don't know if you want to talk about his situation, what he put forth first or no that'll, go under we'll. Do that at the end of it, yeah no go ahead, go with officer bearish. First, then, okay, you can't find it on my notes. Yeah. I have it: okay, so police officer, bearish, michael barish, who's, one of the two community affairs officers for the 104th police precinct and said he hopes everyone is doing well. Here's some information and updated crime stats for the past 28 days here in the 104 precinct, rape was up by one incident. They do have a person of interest. In that case, robbery is down. 14 incidents, felony assaults up four burglary down five grand larceny down eight grand larceny, auto down 10. and our fellaini assaults are up. Majority of these cases are domestic violence cases and have been closed out with an arrest. If anyone needs anything or other information, please feel free to write or call, and he hopes to see everyone soon. That's it as far as his report goes. Okay, any laura! You have a question, no kathy laura who kathy sumski. You have a question on this. I do I just wanted to know if there's any statistics on the homeless, shelter what's going on there, a lot of rumors where is hold on a second, let me just kathy massey you've been dealing with that you have anything to say about it. Yeah. Actually, I just got off a community advisory board meeting with 21 people regarding what goes on at cooper, rapid center and needless to say, we spent an hour on the phone and personally it was a waste of my time. I've requested that we have another meeting in august, not wait three months, because all the problems that we brought up to them, if they're not corrected we're going to wind up with a larger problem, given schools open in september, I think that's. The question is: what's the count right now: 100, okay and there's no program, the only programs they're doing and everything they're blaming everything on the coronavirus. So therefore they can't do job counseling, job training, they're doing one-on-one. They can't do group anything and basically, whatever we brought up to them, and we questioned what programs they have basically were concerned that they were not addressing the alcohol and substance abuse issue which we've seen quite a bit of and their response to that is, they will refer people to a medical, professional, all right so for the next meeting, you'll have a full report for us yeah and give you a report at the end of this meeting. Okay, thank you all right, yeah! We'll do that later, all right! So laura you had your hand up. What's up hello, laura you have to unmute with my computer, hi, sorry vinny! I just wanted to let you know that daniel kurzner called me, and I have he sent me holden's report. Okay, that's thank you! Gary richie, you had something question yes regarding if it's regarding the homeless, let's keep it to when kathy reports right now we're doing the public forum. Okay, thank you. So, mr giordano, would you continue with the public forum? Yes, so we received a statement from a representative of the bureau of the census. A woman named sayaka prestia was a partnership specialist, the new york regional census center update on census, operational adjustments. It's called based on the current self response rate of 61, the u.s census bureau estimates. It will need to visit approximately 56 million addresses across the country to collect responses in person. Census takers will begin the non-response follow-up operations starting july 16th in some parts of the country and the new york city boroughs. It will begin on august 13th and conclude no later than october. 31St census takers will follow local public health guidelines when they visit, households can still respond now by completing and mailing back. The paper questionnaire they received or by responding online at 2020census.gov or by phone at 844-330-2020 census takers, will not visit households that complete the census and part of this is an update on the census. The current response rate as of july, the 7th the national response rate was 61.9 percent new york state 57.4, Queens, 53, ridgewood 48.1, which they say is up by almost one and a half percent mass fifth 52.74, which is up 1.6 middle village, 51.49 up 1.3, 2, glendale 48.2 up 1.47. Please can continuously encourage everyone to respond to the census before door. Knocking starts on august 13th, stay safe and be counted in 2020 census. Anything else. No! Thank you. So the next item of business is that kathleen kathy on mute gary. Could you please repeat that phone number? Okay, eight, four, three: zero! Twenty! Thank you. You're welcome. Okay, nothing else! We'll go on to the next item, which is the chairperson's report, and that's me vincent our curie chairperson. So miss laura. Do you have to call the roll call, because I know we have to have it recorded? I believe the program is being recorded, but I think we should call the attendance. Can you do that? Thank you all right, hikari hi good evening, yeah, okay, great vincent o'curey, tony benanti, amir eric butkowitz yeah, eric he's here, yep, I'm here bob chamelli. Thank you, walter clayton here patricia crowley present. I know brian julie, I don't believe, is out there. He told us he could make it jerry drake. I did not see dimitro fitkowski present steve fiedler, I did not see. Are you there steve sean fish present garung present fred haller. Here, fred, yes, thank you. Fred, hofferly, here, richie uber know you're here, rich president paul kersner paul was here earlier paul you there. I don't know what happened to paul. Okay paul was muted king kirstner president, okay, great and paul was muted. Thank you. Marianne. I see you latancia and that's how I don't think said he could make it to later. Ed. Are you there? No mike liendo, I didn't see you are you there. John meyer present patricia maltisos president edgar mantell president kathy massey, president eileen maloney. I didn't see you: okay, peggy o'cain, michael o'kane, yeah donald passantino risen, ken reberger, president ted yeah, okay, calvin rodriguez, okay, louis rodriguez, okay, lee rottenberg president lee president, okay, walter sanchez, walter carmen santana, I know, is not present. Dennis steffen here, kathy sumski present, megan tadio, barbara toscano here, patrick ching, casey, yeah, mickalene von draven, okay, crystal wolf, present, marianna, zero and nan sang okay. I think I got everybody. Thank you. Thank you. I think I'm here, I'm you miss me guy now, okay, I had you down. Sorry, if I missed you, okay, thank you! It's okay! Thank you. Okay! Thank you again, kathy hello, kathy. What's up, we have to okay, nothing all right! Thank you. So we did attendance. How about minutes. Everyone should have gotten the minutes electronically. Do I have a motion to accept the minutes as read or corrected motion to accept a second okay, so kathy massey, marianne latanzio, all in favor, all in favor any opposed any objections. No! Thank you! Okay! Yes, I think it was not marian. Am I correct tony benanti? Second? Okay, I'm sorry, okay, I'm working from a laptop and a cell phone, so I apologize so after the minutes of liquor. I love this is the complete list, but I will be corrected new liquor licenses. Mr g, are you making a sound or you're on for some reason, you're on the screen? For some reason I don't know. Okay, I wasn't making a sound that I know. Well, maybe just mute yourself and see what happens. Okay, nope, you know what's going on a monk? Okay, are you on any? Are you on speaker view instead of gallery, I'm speaking not gary, that's correct. Okay, so liquor wine and beer license applications and renewals new liquor license. Why is isla lounge corp doing business as el coquille 5419 myrtle avenue, cafe? Rum, limited 1050, wyckoff avenue, ridgewood liquor license renewals, priestess del mar restaurant new york, co-op, 675 woodward, the chili house, inc, 6956, grand avenue, harbouring sports bar 6463, dry, harbor, road, middle village, cozy corner doing business as cozy corners, six, zero one, zero, I'm sorry, six, zero one, seven o avenue new wine and or beer license la cafeteria del burro, corp, 6402, myrtle avenue wine and beer license renewals, mr pancho corp 4663 metropolitan avenue walter. Could you mute yourself sanchez? I got it. Thank you, ard group llc doing business as slide bar b bq 527565, please rogna, llc 6359 farsw has notified us that they will be submitting a corporate change application to the new york state liquor authority, as the current owner is selling his business to dave goberdon. The method of operation would remain the same fatima restaurant co-op doing business as new estrella del mar 552 seneca avenue. Ridgewood has notified us that they intend to submit a class change application to liquor atari to change their existing restaurant wine license to an on-premises liquor, wine, beer and cytolysis. Did I miss any laura? No, you did not. Thank you, okay. So that's the minutes. That's that okay building department, demolition notices. I don't know if I have everything here in front of me, there's a garage at six five, four one, six one street, there's a demolition notice for well, it's actually an excavation notice of five two three five, seven four street there's an alt one notice for eight two: five, six one drive there's a garage demolition for six, nine, two, zero juniper valley road and as a demolition notice for 446 grand avenue. I think that's all gary has his hand up gary zinnie. Can you hear me yeah all right, so the first one is 75-41 61st street yeah, it's a garage; okay, the second one is 52.35 74th street. That's what I thought. I don't think that's what you said, sir and the ridgewood one is 446 grand view avenue, not grand avenue. Okay, grand view have you. Thank you. Thank you. All members should have got a copy of that list. No! Okay, that's why I was trying to catch up because it didn't come out fully yet okay. The next item under my report is well I'm going to skip around a little bit so before I get to the elected official, I've been reviewing the outline from d-cass and the mayor's office on what needs to be done to restore full-time or and or part-time use. At the community board office. We've started prepping for that. We do not know when and we'll talk to joe in a little while about that. So we had a com, two complete cleanups with the general cleaning. We had the carpet, carpets, cleaned the walls wiped down. We had ultraviolet light cleaning of the spaces. With the air conditioner system running, we had the landlord change. The filters we've put in a new toilet seat, we're adding more parts and pieces. The existing work stations are basically separated when we have to move some seats around for the public. If and when we open to the public, we'll need some plastic shields further working on that the office is basically close to the public and anyone. At this time we have a partial workforce in place, partial workforce working from home. Until we get further notice, we need to do some more work in the office. So with that joe nasserino, you have anything to update us on that or anything to report. I have a couple of things to report. First, to start with that issue. First, hello, everyone. I hope, everybody's well hello from the borough president back in office. I I'm sorry to tell you. I have not gotten a response. As far as borough, president staff, we are minimal that we are in the office. I know d-cass is back pretty heavy in borough hall. I know the d.a has a large membership there and buildings in borough hall, but I have no word for you nor me. I will again speak with sharon tomorrow at my thursday morning, meeting and see if she can give us some guidance for you. So forgive me I don't have any info. Thank you. Go ahead. I'm sorry I said thank you. You're welcome, well items queen's, complete count. Committee has been doing mass outreach to coattail on gary's statement about the census. It's get out the count our office is partnering with the census to host phone banking every friday. What I will do is, after I'm done I'll put the number for borough hall where you can call in. If you want to phone bank from one o'clock to four o'clock. Technology is amazing: you don't even dial, you know you hook up to their program and it dials for you so I'll put that in the chat room. My number number two borrow hall recruitment. Fair is going to be on the 15th 2 p.m. Obviously that's virtual, so you go into our website and of note this month, borrow board and borrow cabinet are together held together and that will be on the 20th at 5 30, and with that ring I say thank you. Thank you whose telephone could be muted. Please thank you. So all right, it's walter saying I have something for joe. Is that all right? I ask a question now. If you raised your hand, oh ray's, hands bottom right hand corner, go ahead, walter, the moment's lost now walter. We got you there, you go all right. What's up walt on, you walk you're, going on you, you and I spoke a couple of weeks ago about the amazon project at the metro, mall and you know I could swear that. I gave a report to the community board about what was going on there and I guess it wasn't in the minutes, or maybe we didn't. I have to tell you the wonderful gary giodano, okay kathy. I had two conversations with both of them and thanks to their note-taking and information, I got information on both buildings. I submitted it to the borough president and I think what the issue was at that time, walter after talking to her and getting that information from harry was that she was competing. The two buildings I didn't realize there were two buildings, so she was you know and listen. She wasn't the borough president, then so it wasn't. Even it wasn't even like she didn't have it. She wasn't the borough president. So I straightened her out. There's two buildings: what the buildings were, what they're going to be square footage? She's, happy, I'm happy. She hopes the community is happy that they're coming in, and that is that. But thank you, walter. Your help was important. Thank you gary, and thank you to kathy. Why I don't know she's on good staffing. You picked well, sorry ken has his hand up yeah. Then I was just wondering: do you know what kind of filters we're going to be able to use at the office? Well, I could, I could definitely say they will not be hepa filters, because the boiler isn't designed for hepa filtering system, but they'll be high density filters that were put in by they've been put in by the landlord right, because I know there's a lot of talk about certain kinds are better than others now well, hepa is the hepa filters are the top of the line systems, but you have to have the system that works with it. So, and I don't think the average system in any facility, including a mall, can't support hepa filters right so and the governor said that was going to be a problem probably and it's my opinion that a hepa filter will not, on its own, will not present prevent disease from traveling. So, for instance, at white golf heights, medical center we've installed ultraviolet systems into ductwork. So, in addition to the filters, the ultraviolet kills the germs good, because you really can't tell what filter will take care of what germ. So that's why we've done ultraviolet is the ultimate. But it's we looked at that we had when we had the ultraviolet cleaning of the office that cost us 850 dollars to do about five hours of ultraviolet light. Cleaning to install a system would have cost us twenty thousand dollars. So you can only do so much all right anything else, all right. Where were we building department? Oh elected officials, so laurie, you said you got holden's report. I think kinger had a copy too, but go ahead laura if you have it. Okay, just give me a minute to get it up here. Okay from the office of robert holden, hello, neighbors, community board, five members and fellow elected officials. I hope that you are all staying safe and healthy, and I thank you for your continued work and volunteerism as we navigate this challenging year together. Our city is now beginning to reopen businesses as the spread of cover 19 has slowed dramatically, and that is thanks to all of our collective efforts. Social distancing, wear, masks and practice good hygiene, my office in middle village remains closed, but my staff and I gladly continue to serve our constituents every day while working from home, please do not hesitate to call 718-366-3900 or email district 30 at council.nyc.gov my office anytime, when you need assistance. As you are probably aware, the city council in june voted in favor of the proposed fiscal year 2021 budget. After much, I voted no to the proposed budget due to the fact that it included one billion dollars in cuts and reallocated funding from the NYPD. These cuts will result in the over in the school safety division being moved under the authority of the department of education, overtime, hours being cut and the cancellation of at least one police academy class. I believe these cuts will be damaging not only to the morale of our police but to the overall public safety of our city, which is why I could not vote in favor. Now that the budget has been passed, the city council will slow down for the month of july. In the coming weeks, my office is hosting a coke 19 antibody testing event on july 15th at tunable, south and 78th street from 10 am to 6 pm. Please contact my office for information on how to register in advance. We are also working to bring a long-term code testing site the district. Soon. Thank you again for your continued dedication to our communities and I hope to see all of you in the near future. Sincerely robert f holden council member district 30.. Thank you, okay! So again, going back to the yes. Thank you am I there. Thank you laura yeah. We can hear you okay, hear all that. Okay, so going back to the correspondence we received from the mayor's office in d-cass, about operations remotely and during this crisis, one of the items they determined there was that if there is no regulations in our bylaws for voting remotely, we need to vote to permit that. So, mr giordano, would you read off the results of the elections and then I'll take a motion to ex to accept the vote. The yeah accept the elections as voted out on our last electronic meeting and in the at the mail-in ballots, mr g. Okay, so gotta start with the chair and work your way down. Well, no, there was stalls what we did remotely, because there's nothing in the bylaws that allowed for that. Okay, so vincent r curie was nominated to be chairperson of community board five. He accepted the nomination, as stated in the minutes from last month's meeting, and there was no opposition, so he was unanimously elected for first vice chair walter sanchez was nominated for the position. He accepted the position. There were no other candidates for the position and therefore he was elected unanimously for second vice chair dmitry fitkowski was nominated for the position he accepted and there was no opposition. Therefore, he was unanimously elected for treasurer. Kathy massey was nominated. She accepted the position. There were no other candidates for treasurer. Therefore, she was unanimously elected her secretary margaret who we all know was peggy o'kane was nominated for the position. She accepted the position and there was no opposition. Therefore, she was unanimously elected so where the election took place was for at large positions. So what we did was that we emailed everyone a ballot which they had to download and return to sign and return to the office after listing whatever candidates they wanted to vote, for. There are 47 members of community board, 5 Queens, 42 members voted and the results were ted wrens with 29 votes, fred haller, with 26 votes, paul kirzner, with 23 votes, john meyer, with 21 votes. Those were the top four vote. Getters. You want me to read the rest vincent. Oh, that's good! You got the top four okay, so I would like someone to make a motion to accept the voting. The electronic and mail-in absent mailing ballot voting for the offices. I guess we call them right. The of board. Five yes hold on hold on hold on slow down, hey hands up. Richie has his hand up. So do I? Okay, we got richie first, go ahead, rich I'd like to make promotion the circumstances. Okay, ken has his hand up peggy first motion, but I will second richie's motion that we accept the vote is transmitted by gary. So on the question kathy, I just have a question. I don't know if it's appropriate to ask right now, but with the term limits, does that assure that you all will stay in office even though term limits might? What are you talking about term limits for the community board? Wasn't it voted that term limits for two years? It's like four years, because it was two years. So it's mute, it's moot because we vote every year. Okay, great! Actually, I was just confused about that. I wasn't sure how that was all gonna work. Okay, who wanted to speak on that john? I would just like to clarify the term limits started last this year. I believe whoever got appointed this year has five two-year terms. Anybody appointed subsequently or possibly even starting last year, has four full terms, so it's it is a ways off for a chance. As I said, it's a moot because we have elections every year, so it doesn't matter if it's two years, four years six-year membership, it's elections every year. Okay, any further! On that the motion, those on the phone are unmuted all right. I think we need to call a roll call. Is that not correct? Mr g? That's that, I believe, is in order. Okay. So if you would oh paul, if you'd like to talk use the virtual raise hand, I don't know, if that's what you're trying to do, I don't know what that is. Mr g, would you yeah support before you talk there, bob carmeli bob? No, I raise my hand because I'm voting. Yes, I thought that's for no, you wait to be called okay. Thank you all you do. You have a question paul. Yes, the committee: the board, has already voted on the issue. If you weren't listening to me, what did I miss that, based on what was received from the mayor's office, because there is no section in the bylaws for remote voting, we had to take a vote on it, okay, otherwise we would be doing something illegal, no, don't say no, okay, but okay. Thank you. Would you please call the role. Mr g? Okay, please state what we're voting on the people that we elected? Okay, because we couldn't, but that's what you that's, what you seconded right back, no, but the way you spoke it sounded as though we were voting on the methodology rather than the actual candidates. Ah, yes, I think it's the method, not the candidates themselves. Give me a break. It's the method, the whole thing it's both okay! Well, no because we can't change the vote. So it's not the vote itself. It's the method. Okay, please call the roll give me a break all right. Take it easy, mr adhikari. Yes, sir, are you in favor? Yes, vincent r, curie for antonetta benanti for eric butkowitz or robert shimelli? Yes, walter clayton, four, patricia crowley: four dimitro fitkowski, four dawn fish: four, mr garan or fred haller richard huber for paul kurzner or marianne lutanzio or john meyer. What's my name? Who did I miss king dakarsna? Oh thank you, john meyer, four, okay, edgar mantel, four kathy massey, kathy massey or peggy o'cain for michael o'kane, or don passantino, four michael porcelli, poor ken rayburger or bedrams, or luis rodriguez, four walter sanchez or dennis stefan kathy sumski, four poor, crystal wolf boy, and I think that's everyone good everyone. Thank you. I have nothing else. Do anyone have anything for the chair, mr akiri? Yes, the statements from the other elected officials. Oh, I thought we'd go ahead. We only did the council member go ahead, all right! Okay, so we received a statement from the mayor's office saying the annual tax lien sale is postponed until september 2020, as the city continues, its recovery from the cobot 19 pandemic property owners who are facing hardships, making their property tax payments can take advantage of several existing department of finance programs. These include exemption programs to lower the amount of taxes owed, standard payment plans or a new property tax and interest deferral. Call the pta program for those who qualify for more information on those programs can be found on the agency's website, which is https, colon double slash, www.1.nyc site, slash finance, slash index DOT page. The mayor and city council reached an agreement on an all-time and balanced 88.19 billion dollar budget for fiscal year 2021. The budget is balanced, despite the lack of borrowing authority from albany or a federal stimulus to ensure the budget can continue to fund critical services for vulnerable new yorkers. The administration will continue to advocate for support for borrowing authority from albany and a stimulus from washington, most notably, the budget includes 1 billion in cuts and cost shifts to the new york city police department, while maintaining patrol strength to protect the safety of all communities. On june 23rd, the mayor established a multi-agency task force to crack down on illegal fireworks sales, the task force, targets, suppliers, distributors and possessors of large quantities of illegal fireworks by conducting investigations and sting operations within and outside of new york city to disrupt supply chain. The task force consists of 10 officers from NYPD intelligence bureau, 12, fdny, fire marshals and 20 members of the sheriff's bureau of criminal investigation. The fdny has also launched the public safety campaign, including public service announcements and social media, to illustrate the dangers of illegal fireworks. As of july 3 fdny fire marshals have confiscated nearly 400 000 worth of fireworks from around the city and they have arrested 17 people. Phase three in new york city began on monday, which includes the reopening of dog, runs tattoo and massage parlors nail and tanning. Salons basketball handball tennis, bocce and volleyball courts and soccer fields doesn't say baseball today is our get tested day of action during which we are encouraging all new yorkers to get tested for covet 19, even if they do not have symptoms. Testing is free, safe and confidential for an interactive map that shows all known testing sites. Please go to nyc.gov, covet testing or call 311., and that came from jessica, schabowski who's, the queensborough director of the mayor's community affairs unit. We received a statement from state senator joseph adabo good evening to the members of cb5. As always, I appreciate your efforts, especially during these trying times throughout the coronavirus pandemic. On monday june 29th, my middle village office returned to its full-time status monday through friday. 9 00 am to 5 p.m, with its full complement of team members returning to work, I am thankful that my team worked at keeping the office open throughout the pandemics so that we were able to address virus related issues such as unemployment claims, food availability and assistance for our local small businesses. We continue to handle these cobit issues as well as other community issues that come our way. The middle village office will continue to have the 24 7 live operator service. To answer the needs of my constituents after office hours, the senate is expected to return to its legislative session remotely via zoom later this month. If my team- or I can be of assistance to you, please do not hesitate to contact us at 718-497-1630 thanks again and have an enjoyable saved summer, and then we received a message from the office of assembly member brian bondwell, from victoria leahy, the executive director of that office good evening. Everyone. We hope that everyone is doing well and staying healthy. We have a few announcements that we would like to share with the public. This evening our office has created a covert 19 community resource guide, which includes information and resources for individuals, impacted by covert 19 that are offered by the city, state and federal government, as well as non-profits. We've shared the resource guide with cb5 and we'll continue to share the guide with the public. If you have any questions or concerns, please do not hesitate to call our office. We are continuing to work remotely and are more than happy to help. We can be reached at 718-6511 if you are not able to get through to us. Please leave your name number and a brief message describing your issue. We will call you right back, thank you and be well from assembly member brian bondwell, and that's what I have as far as elected official statements, where we might as well give your report. Then, okay, I think we got everyone, some a package that laura put together of gloves and masks, some of which had, I think, the mass had a cb5 low. I have a cb5 logo on them and hand sanitizers and laura delivered to several senior centers masks and hand sanitizers, and I think gloves as well and as far as the virus goes. I think new yorkers have a lot to be proud of and that we have worked pretty diligently with the great majority of us to really reduce the numbers of people becoming infected and people dying from this terrible virus. The rest of the country, the numbers are going up in a lot of states and, as cheno said, it's requiring quarantining here. If that could possibly be done of people coming from many other states, and I just wish that people throughout the country would take the initiative to just keep social distance and realize the importance of wearing masks, because those numbers didn't come down in new york, city and new york state. For no reason at all. I think marianne latanzio is going to give a public safety report, but I'm certainly concerned about a lot of the violence that has taken place, especially with regard to the tremendous increase in shootings in the city of new york that have resulted in numerous murders. The city numbers for crime are up dramatically in the past month, related to violent crime, and that needs to change and that's a more complicated issue than we can talk about this evening. But I remain concerned with regard to that and as far as anything more goes I'll give up the floor to the rest of the agenda. Sir, thank you. So we'll go to committee reports and marianne with public safety. Okay, the public safety committee met virtually on june 25th 2020.. First order of business was to congratulate deputy inspector perry on her well-deserved promotion. We also thanked all the officers of the 104th for keeping our community safe during this difficult time. The committee inquired about the effects of the covet 19th and 104th precinct officer bearish stated that 25 to 30 officers tested positive for the cope at 19.. Some officers lost up to a month of time while recovering from the virus. The committee also discussed the re recent protest in the 104th precinct police officer, berry stated all protests in 104 were peaceful and orderly. There have been approximately 10 protests in 104th. The committee discussed the user's fourth as a big issue regarding proper policing and agreed. What happened to george floyd was horrible. This committee recognizes that at the times the police officers need to deal with very difficult situations within a split decision, but the proper use of force is a big issues which needs to be addressed. The committee discussed the concerns of disbanding of the police department. It was stated and agreed upon that no officer knows how they were going to act in a difficult situation and at times this whole decision needs to be made. The committee voted in favor of sending a letter both to mayor de Blasio and to the head of the new york city council, corey johnson, explaining why we are where we are against the funds in the police department and what is needed to is better training of police officers to dis-escalate situations. The committee discussed the number of police officers on each tour of the 104th precinct police officer, bearish stated the following as typical staffing patrols. Our day tour has 10 to 12 offices, which is four to five police cars, four to twelve shift 12 to 15 offices, which is five to six police cars, and the midnight shift is ten to twelve offices, which is four to five police cars. However, in the past month, officers have been shipped out of the 104th prison to cover protests and they were doing 12-hour shifts officer barris stated that a class would be graduating. This month after the public safety committee met, it was learned that 104th received seven new offices from the academy crime stats in the 104. crime is up 28 in the past two years in 104th precedent and 17 year-to-date felony assault from 66 percent year-to-date, burglary, up 83, year-to-date robbery, up 22, year-to-date officer, bearish, stated burglaries up during the pandemic graffiti becoming a big problem. Again in the cb5 area was discussed officer beverly stated we no longer have a graffiti office at the 104th precinct, and therefore a few greedy arrests had been made officer. Berry stated NYPD more concerned about cleaning up the graffiti than catching them. Okay, we discussed some things in the summing sins. In the past 28 days there were 387 parking violations issued and 337 move-in violations issued year-to-date. They were given 2 568 parking violations and 4 490 move-in violation sentences. The committee must discuss fireworks being out of control both in 104th in new york city officer. Barry stated problem is city-wide, including 104.. He said if anyone knows of a location, please to report it to 311 on 9-1-1 officer, berry stated, deputy inspector perry is aware of the problem, and officers were instructed to hand out summonses about fireworks being pulled in officer barry stated we do not have a fireworks staff. Currently in the 104. okay, homeless, shelter, resident, 7816, cooper, amy was discussed or was very stated. Police officers have responded to calls to the shelter more often, but many of the complaints are not founded and the problem is usually an assault on one. Another officer barry stated that his knowledge there are approximately 100 to 110 men currently starting at the shelter bail reform. The committee spoke about various situations on cooper, all right cooperative. We are not starting to see the effects of bail reform. Officially better stated, there are a lot of criminals who know they're going to get a slap on the wrist, which is an increase in crime. So the committee next discussed bicyclist safety and pedestrian safety issues. 50 students were killed in 2018 and 70 pedestrians were killed in 2019. It was disgusting for cyclists to wear helmets, and many cyclists are not following the rules of the road which are causing dangerous situations both to themselves and others. The city is promoting the use of bicycles, but not advocating for bicycles, behaving responsibility for their own safety and the safety of others. We will discuss bicyclists and safety issues at the net possible safety meeting. The meeting was adjourned at 9-09. Thank you any questions or comments on that report. If not we'll go to kathy massey with homeless services. Okay, so we had the cat another cab meeting. This is the second one since they opened there are a hundred men in there. The issues that we discussed were the alcohol and substance abuse problem, the programs that are going on and the lack thereof there there's no training programs at all. Basically, most of the men are unemployed. We talked about the fact that they do allow level one and live a tool, sex offenders in the building to live there, and we questioned the fact that you know there are a lot of problems now there have been, I believe, 424 911 calls regarding the shelter and there's a percentage that are unfounded, but there were a couple of arrests, a few assault arrests and we discussed the men wandering and not social distancing, not wearing masks, and their answer is well. We can't force them to the interesting thing. Is they don't seem to be aware that school opens in september and as bad as things are now? We're gonna have four elementary schools, the children and the daycare and the gymnastics all surrounding there. We've had we've sent them photographs dhs of their residents, shooting heroin in the stairwell on cooper avenue. Then they said it wasn't their resident and we sent them a photograph of the resident coming and going out of the shelter door. So the issue is they're, claiming that you know not all these complaints are about residents, but the real issue is residents attract an undesirable group of people. Unfortunately, so if it's not their resident, it's someone visiting their resident. Actually today, while we were on the cab meeting, daniel from bob holden's office was in his office participating and one of the residents knocked on the door, he was totally strung out on heroin, and this is what we have. He was originally in a shelter in Brooklyn where they were giving him his methadone and not giving it to him here at cooper, rapid, so thing things are not good with west ham and as we anticipated, they are not equipped to handle this. I have left several messages for nick orlich who's, who manages it the shelter he never returns calls, and if you can get through to leave him a message, you're lucky it basically says that his mailbox is full. This is a ongoing issue. I suggested that the next cab meeting is, should we really should have it with the business owners because they're taking a big hit from this? As you know, I mean we have outdoor dining, and now we have the residents from the homeless shelter sitting at all the tables. Then you can attest to that. You were up at zones, you know what the problem is there. The same things are starting to happen at the avenue and other restaurants. So I don't know if I can answer any questions, I'm happy to do so. Thank you. Any questions for kathy so just to chairman, if I could just sorry wrong button I'd just like to say the local delis and the local gas stations and such have said that those residents have already worn out their welcome there by just hanging out there for endless amounts of time so just like to throw that out there. Thank you well, they'll, be included in the invitation for business owners. It's not going to be limited to just restaurant owners. So, as kathy said, we did observe there is one gentleman that always stops at the mcdonald's on his way out and it's way back, there's one gentleman that I had to remove three days in a row from the stomptish beer garden because he was begging from the customers inside the gate and they typically, as I told the bearish, they typically leave at 10 in the morning head down to ridgewood and by noon they head back to the shelters or they get their back bite too. There's at least a half dozen and kathy. Yesterday we thought we observed some female residents. Do you know if there are any females there? It's only men, it's only men as 100 men. Well then, they had visitors yesterday, not surprised. Thank you. Okay, kathy sunski has her hand up. Yes, I have a question. I thought the mayor was taking everyone out of homeless, shelters for social dis, distancing and putting them in hotels. Why aren't they doing it for west ham? Well, there's a lot of there's a lot of questions about this particular facility. One. There is no signed contract two. They are not operating it as in the process that was outlined to us. There is no outside mobile security patrol as outlined to us. There are somewhere between 100 111 people in there and we have no idea what the mayor is doing. Those were sorry, okay. I know I've passed by a few times and I've seen like maybe 10 15 of them standing outside no masks, it's nothing. Okay, just really! With regard to the contract. Yes, they have a signed contract. What it is not registered, so there is a contract, it's not registered. We brought up the issue of I'm sorry kathy. What were you questioning? It was, I'm sorry all right. I have to unmute myself, I'm sorry. I was just questioning why they weren't moved out. Oh okay. Yes, that's the other, the okay, I was told we were told that they were going to move everyone into hotels. Once again, when the plan changed, they never notified anyone that they were not now. I believe- and we couldn't get a straight answer- is they ran out of hotel rooms? So you know they're blaming everything, that's wrong with the shelter which we said would be wrong with the shelter they want to blame it all on the pandemic, and you know I only said to them. You know they keep saying the poor and I understand this, but our community has been impacted by the pandemic. Also many of our residents have lost. You know. Community people have lost their jobs also, you know so this is not. The pandemic is not an excuse for the behavior all righty. Let's not continue with committee work, but thank you for your report. Those on phone have are unmuted. If they have questions, if not we'll go on with the environmental committee, we have a report. Yes, no okay, chairman brian dooley, was not able to attend this evening's meeting. Thank you. How about john meyer transportation? John? Are you there? I am here. I actually did arrive at the transportation committee a little late. I was looking over the minutes that gary was kind enough to send to me. Do you want to speak the only capital project that was raised at the meet the last meeting, which was on 7 30 on june 23rd? Was the planned reconstruction of wycof avenue from flushing avenue to cooper avenue? Would you like to give any highlights to that conversation vinnie? I know this is a project. That's been dear to you for a while, and we have been very frustrated by the lack of movement on it still boggles my mind. I think gary was the last one to discuss it with the elected officials. Gary did we get an a new update on wyckoff gary? You have to unmute, I think I'm unmuted yes, yeah. Yes, I'm tr. I need to organize something with the department of environmental protection and us and dep, or get the get that organized oh yeah, so because a lot of what is supposedly putting a halt on the project or a delay, at least on the project and we've, I think we talked about this last month, maybe but the contamination that is possible in the sewer line. So as you, those who've been paying attention to what's been going on in the on the borderline of Queens and Brooklyn, where the walt wolf outport property was. There was some atomic yeah atomic energy spill in the area. The federal government was going to take care of the property when the city announced the wychov avenue project, which includes property line to property line, sidewalks curbs watermelons sewers everything you can think of. They suggested that maybe the city or should look into the sewer. In case there was runoff from the contaminated site. We looked at the some of the details of the project and it was going to be phased because they couldn't shut down the entire avenue in one shot. It was going to be at least three phases, starting from the west, which would be flushing avenue and working east, and we had suggested that they at least award the contract for phases, one and two. While someone is analyzing the sewers to see if there's any contamination in there. My understanding historically was that they did know that there was actually a great deal of sewer problems with the atomic materials. The radioactive materials- and that was one of the biggest parts of the cleanup- well, they didn't know the extent they cleaned up what they had designated originally, but they suggested to the city to look into the rest of the sewer, the other. It is a capital issue for our board that was discussed for a brief moment. We have been trying to get the mta to give us some more in input on what they're doing, with the m train structure that they started painting last year and it has been delayed for many reasons, at least of which is the current covid19 issues. There was also some discussion during the meeting of the mta new york city, transit steps to safety for trains, buses and commuter rail, which is a changing environment. Every day there was a recent press release on monday about ridership numbers. We are still down about 70 a little bit under 75 percent from normal when pre-covet, so that's going to be an issue and we got to get to figure out how to get back up people comfortable with mass transit. There were quite a few discussions about transportation, safety issues and requests continues to be a large amount of speed issues. We are constantly being requested to have speed bumps put in various signage for slowing, stop signs controlled intersections speeding seems to be always an issue. It hasn't been any less in our current environment, but there was some helpful discussion towards the end of the meeting about the use of street space and sidewalks for restaurants to recover during this time. That might change the dialogue a little bit, but it also raises the issue of safety in our streets is paramount. If we're going to be putting people in the streets as well for dining and whatnot. Edgar mantell gave a report back on the new york community aviation roundtable issues mostly focused around laguardia and the changes that are happening there still and outside of that. There's nothing of note in the minutes that I saw to report back. Have we made a decision about the next meeting vinnie? No, because it's august we'll have to we'll wait and see before in the next two weeks we'll see, but hopefully no and if there's so. If there's no major issues that are brought before the board for transportation, there probably won't be a meeting until the end of august. In preparation for our september board. Meeting ken has his hand up john. I don't know if the board or john or if anybody heard about the accident on 80th avenue and 62nd street saturday evening at 10 o'clock, no a vehicle driving west on 80th avenue hit the speed bump flew into the air, and that's where 80th avenue turns a little bit took out a couple cars and then rolled over three times. So the speed bumps work yeah. They do that's what I was going to say. The speed bump actually worked, but he had to really be flying to the pit go airborne. Lee has his hand up yes, hi. I just read an editorial on the daily news that was criticizing suvs for a lot of accidents with pedestrians and bicycles and they're, saying that they should stop making large suvs or put warnings on them that they're dangerous. Have you heard anything about that or lee? I actually a couple meetings ago. I shared a very well researched and well documented, and I can try to send it to you, article in the detroit free press, so the home of the auto industry in the u.s at one time they have actually done a lot of research on the change in how cars are constructed and the fact that the suvs are indeed more responsible for injuries to both the people in them, as well as the people around them. Well. Thank you at the auto show this past year everything grew much larger. There are pickup trucks that are. The hood is higher than my head. That's what the article said they said ten kids can lay in front of a typical suv, and the driver can't see them. That's correct, rich yeah regarding that accident can was the speed bumps successful and killing the driver. No okay. Next ken your hand is a lot. No, I know with the with the suvs the well the last one I had I mean my god, there's stickers all over. What don't do this don't do that watch out for this don't turn this way, but it basically all comes down to speed, and if you watch tv the commercials in they encourage speed right, that's the biggest our biggest problem. Well, there is some truth to that. I mean the way that the automobile is sold on the tv is they show our own city with cars, speeding through it with like late at night, empty streets? It's not the message we need to be sending. I did include in the chat for everybody a link to that article. So if you thank you check that out those on telephone or unmuted. If I could say something who's that fred yeah, I don't know how to raise my hand on the bottom right hand corner no, it's not there. You have to have the participants list open click on participants. I just did. Oh, I got you all right so go ahead. You don't need to do it now at the end of the public safety they mentioned, the you know, bicycles, basically running all over the place. I mean, I am don't think I've seen one stop at a stop sign and you know, as far as the stop light, maybe any discussion on how to make you know any anybody stop any and participate in any sort of traffic signaling that they should or is it just you know just run everything and everybody's got to watch out whether it's a car or a pedestrian. Is there any thought as to enforcement? I think you thought of enforcement is going south with the conditions in the budget and the lack of respect for the police department and the number of offices that will be retiring that have already put their papers in so that a more lean, a leaner thinner police force will probably do less enforcement than what you're looking for. Well, I hear a lot of discussion of drivers automobile drivers not driving safely, but I do see them stop. I very rarely see them running a light running a stop sign, but I don't see a bicycle or a motorized bicycle stopping at any of those. So, okay, I'd like to like to see somebody talk about. Can we can we actually talk about numbers fred? Could we do that at committee? We can do that at committee, but what I'm hearing is a lot of personal. You know data points that are not real data points, so real stuff, let's yeah, if you ever see anybody stop at a stop light or it stops. I see cars through stop lights all the time. Gentlemen. So if you really want to observe some traffic conditions with no matter what the vehicle is, a bus, a truck, a car, a bicycle try sitting at one of our new outdoor cafes, especially if you want to do it at some stomp dish, because that's the intersection of myrtle and cooper and very well signaled and watch. No one. Stop okay! I disagree. Yes, ma'am. I think it's only going to get worse and I think what we're seeing now is the fact that- and this is any vehicle cars bikes motorcycles- that there are no the undercover has been dismantled. So there are no unmarked cars that no one's concerned about getting caught running a light because that whole division is gone well, it doesn't matter we observed. Can we can we ask that question to go to public safety? Absolutely, we can definitely ask the 104 to come in and talk about their traffic enforcement, but if you actually look at some of the numbers and what they're they've done year over year, you will notice that traffic enforcement has not been an issue for most precincts in the city for a number of years now and that that's an issue that is relayed every day I mean fred. You raise your issues of what you feel you've seen, but I can speak to the fact that I have been at so many transportation committee meetings and everybody is asking for speed, restrictions and speed controls on their personal blocks, because it is, it is cars that is the most problematic at multiple tons per mile per hour, and we've observed people speeding around a stopped police car and then the police car had to chase that person down. So it's just crazy people all right, any other committees we have to report discuss if not any old business, any new business motion to adjourn to jerry, hey walter. Thank you second goodbye second by marianne. Thank you all in favor, thanks everybody. We will not have an august board meeting unless there is something we have to rule on or pass on. So thank you all and enjoy this hot weather tomorrow. Take care. Everybody be safe. Good night take care everybody good night, everybody good night, everybody you.",
        "summary": "My first name is king If you know what he wanted to report, you can report that later for us Thank Visual meeting of community board 5 Queens will open with, as usual, the pledge of allegiance donald First order of business tonight is someone's, got to sign their sound on or making noise.\nThe numbers are updated every day, so for Queens itself, Queens has 65 428 confirmed cases of those cases 26 or about 1737 people are hospitalized, have been hospitalized, There have been five thousand six hundred eight hundred sixty eight confirmed deaths and one thousand two hundred twenty two probable deaths as of today and Queens has 41 confirmed cases of misc As you all know, new york city is in phase three of the reopening All new yorkers should get tested for covert 19.\nPersonal care establishments are open, real estate, retail, which is limited to curbside or in-store pickup or drop-off, retail rental, repair, cleaning, vehicle sales leases and rentals and wholesale trade non-essential worker workers not included in phase 1, 2 or 3, are directed to work from home with phase 3 We also have open outdoor recreational activities such as basketball, bocce handball, tennis, volleyball courts, dog runs new york, city, public and private beaches for swimming new york, state park, beaches for swimming playgrounds and public and private outdoor pools These are now open and recently the board of health allowed child care centers to reopen on monday july 13th The centers do not have to open if they feel uncomfortable In order for them to be open.\nChild care, centers must have new york city permits and attest to the following: No more than 15 children per room base, coverings for staff and children, daily health screenings, frequent cleaning and disinfection and limited sharing of items, including toys.\nIt does cost money I'm, not sure which models will be open, but The requirement is there and since we can't dine inside the city is expanding restaurant seating options in order to keep new yorkers safe So, we have sidewalk seating, curb lanes, heating backyard and patio city, and the open streets will be active from friday from 5 pm to 11 pm and saturday and sunday from noon to 11 pm If I could ask a question, there's been a lot of discussion about false positives and false tet negatives, on the testing So for the Covid-19 19 testing itself, if you're getting the regular, nasopharyngeal or oropharyngeal swabs, the test is relatively accurate and you know we need to conduct additional testing That's a concern that we definitely have you know we're offering free coping 19 testings so that new yorkers can get tested as frequently as possible if they want to higher heat.\nBut obviously you know: wyckoff pediatrics were right on the border of ridgewood and bushwick So, it's in the plan to be able to do more outreach into Queens You do realize there is nothing between wyckoff and jamaica hospital or saint john's episcopal This whole community board five area is barren and we rely on wyckoff to help us So. That's why I was thrilled when gary accepted the invitation for me to be able to spread the knowledge about this program very good, any other questions.\nI, don't know if you want to talk about his situation, what he put forth first or no 'll so police officer, bearish, michael barish who's, one of the two community affairs officers for the 104th police precinct and said he hopes everyone is doing well Some information and updated crime stats for the past 28 days here in the 104 precinct, rape was up by one incident.\nActually I just got off a community advisory board meeting with 21 people regarding what goes on at cooper, rapid center and needless to say, we spent an hour on the phone, and personally it was a waste of my time.\nThe next item under my report is well I'm, going to skip around a little bit so before I get to the elected official I've been reviewing the outline from d-cass and the mayor's office on what needs to be done to restore full-time or and or part-time use.\nDo you know what kind of filters we're going to be able to use at the office?, Don't think the average system in any facility, including a mall, can't support hepa filters right so and the governor said that was going to be a problem, probably It's we looked at that we had when we had the ultraviolet cleaning of the office that cost us 850 dollars to do about five hours of ultraviolet light.\nYou said you got holden's report Okay from the office of robert holden, hello, neighbors, community board, five members and fellow elected officials.\nPlease do not hesitate to call 718-366-3900 or email district 30 at councilnycgov my office anytime, when you need assistance As. 2021 budget After much I voted no to the proposed budget due to the fact that it included one billion dollars in cuts and reallocated funding from the NYPD These cuts will result in the over in the school safety division being moved under the authority of the department of education, overtime, hours being cut, and the cancellation of at least one police academy class I believe these cuts will be damaging not only to the morale of our police but to the overall public safety of our city, which is why I could not vote in favor Now that the budget has been passed.\nWe are also working to bring a long-term code testing site the district So going back to the correspondence we received from the mayor's office in d-cass, about operations remotely and during this crisis, one of the items they determined there was that if there is no regulations in our bylaws for voting remotely, we need to vote to permit that Mr giordano, would you read off the results of the elections and then I'll take a motion to ex to accept the vote.\nThat are offered by the city, state and federal government, as well as non-profits We've shared the resource guide with cb5 and we'll continue to share the guide with the public Please do not hesitate to call our office We will call you right back, thank you and be well from assembly member brian bondwell, and that's what I have as far as elected official statements where we might as well give your report.\nIf that could possibly be done of people coming from many other states and I just wish that people throughout the country would take the initiative to just keep social distance and realize the importance of wearing masks, because those numbers didn't come down in new york, city and new york, state I think marianne latanzio is going to give a public safety report, but I'm certainly concerned about a lot of the violence that has taken place, especially with regard to the tremendous increase in shootings in the city of new york that have resulted in numerous murders.\nWe also thanked all the officers of the 104th for keeping our community safe during this difficult time, The committee inquired about the effects of the covet 19th and 104th precinct officer bearish stated that 25 to 30 officers tested positive for the cope at 19.\nThe committee voted in favor of sending a letter both to mayor de Blasio and to the head of the new york city council, corey johnson, explaining why we are where we are against the funds in the police department and what is needed to is better training of police officers to dis-escalate situations.\nThis month after the public safety committee met, it was learned that 104th received seven new offices from the academy crime stats in the 104 crime is up 28 in the past two years in 104th precedent and 17 year-to-date felony assault from 66 percent year-to-date, burglary, up 83, year-to-date robbery, up 22, year-to-date officer, bearish, stated burglaries up during the pandemic graffiti becoming a big problem.\nThe committee must discuss fireworks being out of control both in 104th in new york city officer."
    }
}