{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "November 4th",
            "publishDate": "2020-11-05",
            "shortDescription": "",
            "lengthSeconds": "1:59:25"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "aNfIwctLpQ4",
            "fillerWordCount": {
                "uh": 629,
                "um": 328
            },
            "readTimeFullTranscript": "61 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "hotel": 47,
                "building": 46,
                "project": 42,
                "malls": 28,
                "development": 26,
                "zoning": 24,
                "construction": 23,
                "foundation": 22,
                "permit": 21,
                "space": 19
            },
            "wordCountSummary": {
                "hotel": 11,
                "building": 10,
                "development": 8,
                "zoning": 8,
                "construction": 7,
                "project": 6,
                "developer": 5,
                "right": 5,
                "change": 5,
                "permit": 5
            },
            "fullTranscript": "Quorum yet so I am going to wait a couple more minutes, hoping that members of the committee do join so that we can start promptly and thank you for your patience all right good evening. Everyone it looks like we have a quorum, so we should be ready to to get going so good evening. Welcome to the land, use housing and Zoning committee of Manhattan Community board five. My name is Leila Lugisico, I'm the chair, a few words about how the meeting is going to proceed tonight. We have one application for review and one item for our discussion for the application that is in front of us. Let me tell you how we are going to run the meeting. The applicant is going to be given an opportunity to give us a full and uninterrupted presentation after this presentation concludes. Members of the committee will have an opportunity to ask questions once this question session concludes by members of the committee. I will open up the floor to members of the public. Members of members of the public will have an opportunity to ask questions and make comments to the application. The applicant will have an opportunity to address these questions and comments once this public session concludes. We will turn to a business session during business session. Only members of the committee are allowed to speak and we will discuss the matter. We will make comments and we will make a motion. This motion will be discussed taken to a vote. This will become the official position of the committee of the land use and housing and zoning of CB5 this vote, and this position will be presented to the full board of Community Board, five, which means on Thursday November. The 14th lou correct me. If I am wrong and this motion will be discussed and voted by the Full board of Cd5, this vote of the full board will become the official position of the board and will be sent as our official recommendation to the BSA and any other relevant parties, such as our elected officials or city agencies, and the discussion item will proceed on a similar format, except that we do not have a formal presentation, but we will follow the same order where we will have a question period for members of the committee. I will open up the floor to members of the public, and then we will move to business session during business session. Only members of the committee are allowed to speak and, if appropriate, we'll make a motion that will take to a vote. Hopefully that is clear. The usual would be appreciated of of all meaning that you know make sure that your mic is on mute when you're, not speaking, make sure that you unmute yourself when it's time for you to speak and with all of that said, we will start the meeting with the review of our first item. It's an application for a BSA special permit. The project is a proposed hotel that is located at 58-, 60 West 39th street, and we have the team of applicants present with us and if you want to take it from there and give us your presentation great. Thank you very much for the introduction. Let me see if I can share my screen here. Okay, can everybody see that you can see the present? Oh yeah? Okay, great, I see some nods, okay, great okay, so good evening. Everyone. Thank you very much for this opportunity to present this project. My name is Eugene travers, I'm a land use attorney with Kramer Eleven Nephton Frankel, I'm joined by my colleague, Gary Tarnoff. We should be joined, although I do not know if they're on by Weihang Hugh of H hotel who's the developer of this project and Peter Kuhn of Pune architects, who is the project architect? So this is an application to the board of Standards and appeals for a common law vested right to complete construction of a hotel development at 58, West 39th street between 5th and 6th avenues, part of me there we go. Okay, so you can see here the site's located in an m16 district, except for a very small portion along its western lot line, which is located in a c53 district and also within the special Midtown district. Construction of this hotel began on February 5th 2018, with the demolition of the former structure on the site. Excavation and support of excavation was completed thereafter and then work began on the foundations. Approximately 70 percent of the foundation was complete by December 20th 2018. That is the date that the city adopted its M1 Hotel zoning text, amendment which no longer allows hotels in M1 districts on an as a right basis. So at that point that the text was adopted, this hotel project became non- conforming. Now the zoning resolution provides that, if you've completed your foundations before a zoning change is adopted, you may continue that project under the prior zoning. In this case, the foundations were not complete, so the developer's recourse is to apply to the BSA for a vested right. New York law says that a developer is entitled to a vested right if substantial construction and substantial expenditures have been completed prior to the zoning change and also where the developer would suffer a serious financial loss if it is not permitted to continue its project under the prior zoning. With respect to substantial construction, this project, the application demonstrates including an affidavit from the engineer that, as of the rezoning date, all demolition work had been completed. All excavation work had been completed. All supportive excavation work had been completed and, as I mentioned, approximately 70 of other foundation work was completed, including the installation of all of the foundation piles for the project. This is a markup of the foundation drawings that was submitted with our application. This drawing shows it's a it's a visual depiction of the work that was completed. This shows that all support supportive excavation was completed as of December 20th 2018.. This next drawing has a lot on it. But if you look at the labels, it's saying all excavation was completed. All piles were installed and grouted all underpinning was completed, and then the next drawing is a section view of the drawing that you just saw showing the completion of that work. So that's a substantial construction with respect to substantial expenditures. The application includes materials demonstrating that the developers spent just over 11 million dollars on the project prior to the zoning change. That represents approximately 16 percent of the total project, cost and precedent. Common law cases have shown that expenditures in the range of between five and fifteen percent are sufficient to support or to establish a vested right. So in this case we're just slightly above that range. Finally, the applicant would suffer serious financial loss if it's not permitted to continue its hotel development. The alternative would be to convert the project to a conforming office development. We engaged an independent appraiser to analyze that development and they determined that the office development would have an as complete value of about 22 million dollars compared to 44 million for the hotel and an as stabilized value of 26 million compared to 52 million for the hotel. This means that the office development would have a value of approximately half that of the hotel development. So it speaks for itself that if the developer was forced to abandon this project in favor of an office alternative, it would suffer serious financial loss. Now it should be noted that when the hotel text amount was adopted, it did create a new city planning special permit to allow hotels in M1 districts, but to go down that road. You know we're looking at two to three years, pursuant to the uniform land use review procedure with really no guarantee of success, because we do not know if the building is designed, we'd even be able to meet the special permit findings. The much more proven approach which we believe any reasonable developer would take would be to seek the vested rights to which it's entitled to which is exactly what we're doing with this application. I also want to point out that this application is to vest a 31 story, hotel development that you can see here, because that is what was approved by the department of buildings at the time that the zoning change went into effect. Assuming that this application is approved, the developer intends to acquire excess floor area from the parcel to its west, which you can see here and to cantilever over that parcel right. So the adjacent parcel is located. Let me just go back for saying: the adjacent parcel is located entirely in a c53 district, where the M1 Hotel district regulations do not apply. So we believe that this enlargement would be permitted as of right and the larger developments again assuming the vested rights application is approved and the zoning lot is enlarged would be a 34-story hotel with approximately 173 rooms and 62,000 square feet of zoning floor area. So, although this larger hotel is not actually the subject of this application, we're investing the smaller hotel, we did want the board to see what the end result would be or was contemplated. That is the application in a nutshell, and we would be very happy to answer any questions. Thank you very much. So, as usual members of the committee, please use the raise hand function. If you wish to ask any questions- and we will start with questions- and I see that David Calis has his hand up Dave go ahead. What is your question yeah a couple of questions? I believe that part of the original reason for the M1 ruling was to prevent too many hotels from appearing in the same district and yet right down the block from your hotel is another 37, 27 storied building another hotel? That's going up right down the block at 26 west 39th. It's going to have 299 rooms in it, so I'm concerned about the two hotels being together. Part of the rolling also says that the the ruling stands that they were worried about inappropriate architecture and that whatever hotels that were developed in the neighborhood show some sort of respect or coordination with the local buildings and from what I can see from your drawings and your pictures and the actual neighborhood itself. It seems that buildings both to the East and west of your building or sort of gothic inspired architecture, and yours, of course, is a 31 story. Glass structure, which seems to bear no relationship to the local architecture of the neighborhood and I'm also very concerned about the cantal lever, 26 feet cantilevering over into the adjacent yard. This is the sort of greed and architecture we see throughout the city. That is just. I just do not understand it. The need for space, and this will actually be hanging out over a beautiful gothic building. That's right! Next to it's right, west of your building. It just seems such a strange way of conducting your business. I wish you could explain how you came to use the cantilever. Did you get air rights or how did that happen? Well, the cantilever would be constructed pursuant to the acquisition of the development rights from the parcel of the West, as I mentioned, but you know with respect to the architecture and issues of supplies of hotels in the area. That's not really what this application is about, and you know the M1 Hotel District, Amendment was put into place, did recognize that hotels that were under construction would have an ability to vest they put a special vesting provision and they acknowledge that even developments, not meaning that special vesting would be able to rely on the standard vested rights, which is essentially what we're doing here. Okay, thank you. Another question from Clayton go ahead, so I have many questions, but the one that I just wanted to ask right now was also about the cantilever you blew through that somewhat quickly, but I believe that the logic you laid out was that, because the zoning is different in the lot above which the cantilever would exist, the cantilever element of the building would be as of right, even though the base of the actual building and the actual building is in a different zoning lot. Did I understand that logic that you laid out correctly and if so, could you please just repeat it with a little more detail? Sure let me go back to the slide, so you can see here. This is lot 81. This is the development site it's located in an m16 district, except for a very small portion of it, which does extend into the c53 district. Do you have any way to enlarge this particular area for us? I should be able to. Maybe I you know I do not have that control here. Let me see yeah, that's better. Okay great, so you can see that a very small portion of the development site itself is in the c53 district, which does not have the restriction on hotel development. So you know this would be the zoning lot and, as I'm sure many of you familiar with you know, the zoning regulations are applied on the zoning white basis, so this portion is in the m16 district. This portion is in the c53 district and, yes, the enlarged portion is not subject to the M1 Hotel district restrictions. Okay, thank you. Clayton. Do you have a follow- up question? Well, I just is the first time that I've actually faced that particular point that, even if a part of a building whose base is in one zoning district that somehow the addition hanging over another zoning lot would make it as of right. That logic seems totally alice in wonderland to me. Well, I can tell you like forgetting about the cantilever for a second, this three foot portion of the building- that's in the c53 district has to comply with the c53 district regulations and it does with respect to heightened setback, so that same logic is applied to the cantilever. If that makes sense as surprising as it as it may be. Clayton I understand especially given that it's really a sliver that is in the c5- 3 district. This is the rule with split lots. So you know if the the boundary was like smack in the middle half of the building would be allowed to comply with a c5- 3 and would not be subject to you know any BSA action, whereas the other half would be deemed non- conforming so as such, and if they are the owners in title and rights or if they have an easement to build a cantilever on the lot that is adjacent, then it becomes as of right as problematic as it is. I agree with you. This is actually in compliance with the way the the rules of the city of New York are currently written. Thank you. Thank you. Do you have follow- up questions, or do you want to come back with additional questions after other committee, members have a chance to speak. Yeah go ahead with other people for now, okay sounds good. I see that Nick has his hand up Nick go ahead. Thank you, laila eugene. It appears that the property was acquired by the developer in January 2016.. Is that correct? That does sound correct? I do not have that information in front of me. The deed was provided in the package. I assume that's correct, so the zoning change went into effect, December of 2018. What was going on between January 2016 and December 2018? Well, as of February 5th 2018, that's when construction started as to what happened before then I can't speak to that. Perhaps financing was being sought. I do not know, and unfortunately I do not. I do not believe the developer has been able to log in. I do not see her okay. Thank you. Any other questions from members of the committee Ryan and to ask another timeline question. Since the point where the zoning tax change went into effect, has any work happened on that site, or has it been completely stopped and shut down construction stopped? It did continue after the zoning change it, I believe, stopped in March when the virus began ramping up and as many things shut down project site understood and are you? Are you able to sort of speak to why the decision was to continue construction on that site? Despite the text go into effect? Well, the permit was still valid and you know none of the work that has occurred after the zoning change. One effect is being relied on in this application, but basically the permit was still in effect. Thank you. I thank you other questions from members of the committee. Okay, I have a few questions of my own. You mentioned eugene that the as of the zoning tax change. The developer had spent 11 million on the project. Can you actually specify if those were soft cost or hard costs? There is a breakdown provided in the application materials. Let me see if I can pull it up here. Sorry they're both hard end soft costs. To answer your question, but if you need this specific breakdown, just give me a second, it's oh right now, can you can you see what I just pulled up on my screen? This is the this is okay. This is the budget that was submitted to the board, so it has the hard costs. Sorry, let me see if I can. This is this is the breakdown here which is demolition, excavation islands Foundation six million? I'm sorry! I lost you here. Six million is the other hard cost correct. Okay, then, so the soft cost total is about 3.5 million, so the total is 11 million. Okay. Thank you. My other question. Is you mentioned that the the audit that you ordered on the office development profitability versus the hotel profitability showed a serious loss right, correct? Okay, when I looked at the the reports, it seems that what the report concludes is that both a office, development and a hotel development would actually be healthy, desirable and profitable. It just so happens that one is more lucrative than the other. I did not see any loss in any of those reports, whether it's a commercial or hotel. Well, if the developer is underwriting a project, certainly if they're learning that their project is worth half the value than they thought it was, I would think that would be a serious loss to most developers. It's less lucrative a lot of when you lose money. It's half the value of the of the loss is when you lose money. I think we tried to figure out the simplest way to show the difference in value. I look at the amount of money that's invested in the hotel, an actual loss of. If you look at the cost versus the return from the office, it just does not justify the cost of building it, but that's not the way we present. There is not really a format for presenting this kind of a case to the board, so we thought the simplest way to do. It would be to show that the return is much different for the two different uses and if the board asks us for additional information, BSA additional information about the loss will be happy to provide it. But I believe the appraisals you know the cost of building this project does not justify building the office building. Okay, I think I had another question. Oh yeah, if I read the the application- and the report correctly, it looks like there is a large hotel development on 38th street. Is that the the project that is adjacent to yours, or is that a different project? It has a 38 30th street address, but it looks like the project that you referred to, that is adjacent. The the 34-storey hotel with 200 rooms is a through block project. I just want to make sure that we have a good tally if the number of hotel rooms are being developed in this particular on this particular block. I believe you're referring to the project or the building directly to our west, that we would be merging zoning glass with. Is that correct? I? If so, I do not. I do not have if it's this. If it's this development, I do not. I do not know the number of hotel rooms that are contained in that building currently and it's an existing hotel right. Oh okay, it is an existing hotel, correct the dream: it's called the dream: hotel yeah! Sorry, I did not. Yes, it is okay. So now I'm confused, I thought that you were acquiring this property to develop a 34-story hit a 34-story hotel with 200 rooms. Where should that be located? Sorry, so let me clarify that we would be. We would be acquiring excess development rights from the hotel next door to us, so it's not built full under its own. This development emerging zoning laws and putting those rights into our building. Okay. How many air rights are you or is the the developer intending to acquire Gary? Do you know the square footage? I think it's about twenty thousand square foot. Twenty thousand! That's an estimate! Okay! What is the underlying far it's 10 in the c 5 3, it's 15., so it's a 15 far, which is why there's probably excess and then the in the m16. It's 10 right, correct and are you able yeah, okay, you're able to pile these air rights from the c5 three site onto the m16 in the c5? The majority of the hotel is in the N16 district right and though so, therefore, those 20,000 square feet of excess development rights that are being purchased from the adjacent parcel would then end up in an m16. It will be built in the cantilever in the c53 portion of the lot right. Oh I see so those are the 20,000. Okay, those are the floating cantilevered. New okay got it, and, as such, you consider that they're not well, I mean they are not under the m16 regulation. Okay, I have another question regarding the the massing and the height of the building, how many floors of mechanical equipment does this building have sorry, Peter is in the audience? Let me Peter. Can you hear us you can unmute? I do not know if he's at his computer right now, but he's here. We can certainly follow up with the number of mechanical floors. It looks like there are two from just from looking at the Zd1, but yeah Peter will have the we can get you that answer. Okay. Looking at the the floor plans that were submitted with the rest of the application, it seems that there are three floors of mechanical equipment at the base, one floor of mechanical equipment in the and pretty much in the middle of the core of the building and then a large one at the top, which in total seems to be pretty generous, and I would be interested to know what is the rationale for allocating so much space for a mechanical room? Well, Peter is can't get on. We can. We can get a response to you in writing into that question. If he's not on the can't get on the hearing, can someone text him getting answers in writing after this meeting would be late? Okay, let's let me try and text him. Okay, thank you and, in the meantime I think. That concludes all my bundle of questions Clayton. I want to come back to you and see if you have additional questions. My main questions were actually also about the mechanical space floors and I want to understand more the rationale why they are as many as they are the location and this the height that they are. I just want to say our architect's phone died, so he joined he's trying to join. He has not joined already with his other phone, which is should be a 917 number like. I do not know if you see that if he's here, no, I see a 718 number, but not a 917.. Okay. What is his name, your other architect? It's a Peter queen, okay, yeah. I see Peter here I'll, promote him to a panelist. Thank you Luke. Hopefully we can get him to address our questions. I know that David Keyless had his hand up again. Dave. Do you have any follow- up questions we're still in question, so I know that a number of us have some comments. I would encourage you to see them for the coming period. Yeah. I have a question. It's just a little hard to tell from the mechanical drawings most of the buildings in the neighborhood, especially the buildings being surrounded by your lot, are manufacturing buildings with the necessary light and windows that they needed to provide these spaces with fresh air and light for their manufacturing. I'm just curious as to your building, with the size of the height of it, and also the actual size itself. If you'll be cutting off significant light and air to buildings in the neighborhood, I do not think I could speak to the quality of light and air after this building is constructed. I would point out you know it's: it has a front set back, which does provide some degree of light to reach the street and areas surrounding it yeah. I was specifically thinking about the back of the building, which is where all the manufacturing buildings on 38th Street, or I noticed the average height, is about 14 stories and I'm just afraid that these manufacturing buildings might lose their light and their fresh air. That's my only concern right. Well, I think any even a conforming development I mean we're talking about a non-, conforming use here. A conforming office building could be the same massing. So it's it's more of a policy issue than specific to this particular development. As for the the zoning, is there a required setback, meaning like at the streetlight? No from from the a rear yard setback yeah, it's required where you are and how big is it? How big is it? Do you have the side plane it's either 20 or 30 feet. It's probably 20 feet. Okay, it's a 20! It's a 20-foot rear yard, okay, so just so we're clear. Basically, the underlying zoning of that particular lot requires that any new commercial or hotel building be set back from the lot line in order to give a 20-foot rare yard. So it's not going to be. You know like a smack against the the rear building. There will be 20 feet between the new hotel and the existing building that is at the rear. I just want to go quickly over the timeline to make sure that we have the chronology correctly, so the the property was or the site was acquired in 2016.. So we know that the zoning text change passed on December 20 2018. When did the construction? When was the DOB permit the initial DOB permit issued? I believe it was shortly after well. The initial permit, which was, for you know, putting up a site safety fence, was before that February before construction started and the full permit the Nv permit, which is the you know, the heart of what's being vested, was approved in October. I believe of 2018 October 2018, right and construction started on October 2018.. No well in advance of that, because there was work done pursuant to other permits before the full permit was issued right. There was a foundation and excavation issued some at some point at some point between February, which is fairly common for construction, so Excavation foundation permits were issued sometime around February, 2018 and then construction started then correct. First, there was a demolition permit to demolish the building and then excavation and Foundation. I do not know if the are the dates in the materials they are, I'm going to pull them up. There's a there's a table in the statement of facts which you should have all received, it's part of our application and I'm just going to scroll down to it. So we can all see it together. So this is the sequence. So there's actually I'm sorry I spoke there was a permit in January 2018 demolition, which we that's really when construction started was February 6 2018 there was another kind of ancillary permit for construction equipment. Then you have our foundation permits in July. This is a foundation. This is excavation and foundation. A plumbing permit is just there for information, and the new building firm was actually November, 30th 2018.. Okay. Thank you. You're. Welcome, oh, that, that's very helpful. All right do we have any further questions from our members of the committee. Oh yeah Clayton go ahead. Well, this is actually a question more for you layla, unless the applicant has something that would want to add, but I would just like a little more context and reminder of in my in recent memory on this committee and when Committee Board 5 weighs in on circumstances such as these. It has not been the vested rights argument. It has been. What we have looked at is whether the foundation was completely complete prior to the zoning change. So I guess I just want a little more context and education about how unusual the vested Rights argument is, and if and what the city's you know, rationale and track record is with hearing those hearing, those arguments yeah, so the basically it what we look at and what the what the applicants argue is the vested right. So it's you know it's common law. It is not specific to New York it's. You know. It applies to pretty much any municipality in the state of New, York and probably the rest of the country. Where you know the principle is pretty simple: when you have a change in the way you can use the land and you had a vested interest in doing a particular project and you spend a lot of time and money and then all of a sudden boom. You know it's no longer a conforming use, because the municipality has decided to change the rule. Then you make the case that you have a vested right and therefore you have started enough ahead of this change and you have spent enough money to prove that the municipality should let you finish what you had started. So what it hinges on is really and what we look at and what the BSA looks at is really. You know how much time, how much money? How much ahead, has the project? Then. So, let's say you know. Let's take an example. Let's say that you know this hotel is already halfway up the ground and you know they're about to you know like finish a roof and put windows. You know very obviously there is a vested interest. You know they've already started partitioning inside putting sheet rock whatever. Basically, the way the BSA now I'm referring specifically to the BSA and not other municipalities in the state of New York. The way the BSA has looked at these cases, which I mean it happens all the time you know it's like on a certain day. The zoning changes- and you know, whoever is halfway through is you know, has to you know, wants to make the case that you know their product should be allowed to to be completed. So what the BSA looks at is how much money was spent and the way the rules are, you know excavation should be completed. Pouring the foundation should be completed and the I'm sorry the demolition of any existing structure should be completed. 100 percent excavation should be completed, 100 percent and the foundation should be substantially completed, and this is where we, you know, we struggle and everybody struggles, because the BSA- and you know the law. The way it is written does not say what substantial exactly is. So you know, then it is subject to interpretation. You know, is it is five percent substantial? Well, probably not it's fifty percent substantial, maybe one hundred percent you know is substantial, of course, and then it's a matter of you know. Where do you put the needle? So you know basically what we have to look at. Is you know whether we believe that you know those criteria are met, but also, I think it is important to keep in mind what is the intention of the new zoning and how the current project deviates from the new zoning. So you know those are the questions that lie in front of us. I hope that your question. Well, yes, I think I was just a little confused on the on the phrase about vested rights, but basically what you're saying is that this is analogous quite practically with the last time we heard such an application, which was in March of 2019. It is exactly the same thing for the exact same reason: the exact same zone, zoning text, a main amendment that basically passed and that we supported wholeheartedly and so warmly- and you know with great enthusiasm, because we do believe that hotels as a conforming use in a manufacturing district is not appropriate as of right and it can be appropriate by special permits so that we have a chance to address all the concerns that hotel development poses in our manufacturing districts, not to say that they should not be built and we're very clear in our recommendation and our support of the zoning change so yeah. So, okay, my follow- up question, which would be for the applicant then, is since we do not have a definition from the city on what the word substantial means. What is what? How does the applicant testify as to the number numbers for the foundation work? I mean the piles. The underpins tie backs what amount of material was put in, what percentage of work was completed? How do you represent that? First and foremost, we have an engineer, who's signing and sealing drawings, and you know putting his professional reputation on the line who- and it's not just an engineer that was hired. It was the engineer who who's familiar with this project and he worked on it. You know we have to provide all of the bank statements and invoices which are all in the application they're it's voluminous but they're. It's there. We provide a budget, there's a sworn affidavit from the developer. It's all it's all about documentation, and we, this is a fairly well documented case some you know, so you see certain vested rights cases where sometimes it was a smaller developer or smaller project and they did not realize the zoning changed and was not paying attention to anything or did not have any sort of records, and they do this stuff on the back of a napkin. So this is a pretty well documented case and you provide that all of the board and although there's no definition of substantial construction or certain expenditures, there's a tremendous amount of precedent which, of course, we analyzed when we look at this case- and you know we believe this case is a strong one, as I mentioned, with respect to expenditures, five to fifteen percent has been deemed sufficient in the past in terms of expenditures we're above that percentage. We have. We've clearly demonstrated that we've completed excavation all support of excavation, and we have made you know significant progress, substantial progress, potential, construction on the foundation, and it's all it's all in that in the application. That's it's just a collection of data and certifications from professionals, site observation reports, things like that. Oh thank you. Do you have any photographic evidence that you can share with with the committee there there's photographs in the application? Did you want me to find those now? The the photographs that I looked at did not seem to really make. I do not know I was I do not know. Maybe you want to show them and probably yeah- you probably did not know exactly what you were looking at the I will admit that, in terms of photographic evidence, this application they did not have a like a site camera installed, which is often you know very helpful thing in these types of applications, so the photographs from what they had available from. I guess people working at the site. Much clearer evidence in this particular case is all of the other evidence like the marked up foundation drawings, the affidavit from the engineer, the affidavit from the developer, all of the bank statements showing all the payments made. That type of evidence is what we have for this case. Okay, just you know mentioning that the previous application that we are reviewed for an exactly a similar situation on this block, you know pertaining to the same learning exchange had substantial photographic evidence that made the determination a little easier. It certainly does yeah, no all right any other questions from members of the committee before I open up the fourth two members of the public layla. I do notice, I'm not a member of the committee. Obviously, but I do notice that Peter Poon is here, I think I do not know if you still had questions yeah. We do have a question for the architect about the the height and the number of the mechanical floors for this particular development, I'm trying to speak, but I hear you can you hear me? Yes, very good? Is there an echo somewhere? Is there an echo somewhere? We can hear you go ahead, I'm good all right. First of all, I do want you to know that there's a high limit as to how tall we can make this building in spite of what everybody thinks that it can go as high as possible as a high restriction, and I think we are going no more than 300 feet because of the new high- rise requirements that anything be beyond. I believe it was 300 or 320 feet. There would have to be a free life safety stairs. We can't afford it because the footprint of the site is too small, so we have two stairs and three elevators put aside the the usage of the the building. The building could only afford to have two life safety, five stairs and two to three elevators, and so that's could you address the question of how many mechanical stories there are and why you have that many we actually do not have a lot of mechanical flaws, because we are using a split system of the bfr system that we have to locate the condenses and there's not a lot of open roof space that we could locate condenses, and you know that each of these condensers could service, maybe eight to ten rooms. So every eight to ten rooms, we have to distribute the condenser units and we have sandwiched them so that the condenses floors would surface a half of the floors above and half of the force below, and I just follow what was the recommendation from my mechanical engineers to distribute the mechanical floors? Needless to say, we are utilize. We also have a structural system that we have to employ in order to make the cantilever work and so that we have partially some of the mechanical units in the cantilever floors, but most of them are evenly distributed. If I remember correctly and what is the height of each of the mechanical floors, please the scheme that was presented to the community board as documented by the report, they were 10 feet floor to floor, except that there might be one that we locating the emergency generator. So we would need a little clearances above for the oil pipes and went and inventing and whatnot, and that may be a double story: height Peter. Do you have access to the the building drawings that are part of the application that was submitted to us and though, if you could go to page 17 of the the Pdf, I was trying to log in remotely from my apartment, and I lost connection. That's why I am using my cell phone, so I I believe that gene might have a full set of those drawings if you could show it on the screen and if you want me to speak to those drawings and if gene can upload it on the screens, I can speak to that. So it's labeled attachment 9c right. This is this is going to be a taller computer to open right now, let's give it a shot. Let me try to see if I could look at that from my cell phone okay yeah see if it opens. Ultimately, I do not know I mean I have it open on my computer. I do not know if I can share my screen quickly. It's I've got it open, yeah, perfect. Okay, the graphics are coming up, yeah, which drawing are we it's page 17 of the pdf. Thank you give the drawing numbers. It's the the page, labeled z01 we're getting there. Sorry yeah, it's a gigantic document. It takes forever to load. Well, I try to put in the actual number. Let me see to see that option screen right now, it's off to page a19, so we're getting there. Okay, thanks for your patience, almost there all right. That should be the one okay, so it's pretty small on our screen, but hopefully we can still get a sense of what we're talking about. If you look at those sections, it seems. I agree that the floors two three four and five are mechanical. Then there's another mechanical floor where your cursor is and then there's another one that is located underneath this water tower, so it if I read this drawing, as is it seems to suggest that there are six mechanical floors, including one that is double height up top right. Okay. Now what I need to point out to you or is that this is a scheme as an S of right section, and we also have developed a another scheme which has the cantilever. Now, if you look at this standalone drawing, it does not represent the cantilever at all right, and so everybody have been talking about the cantilever. That's a subsequent scheme. What you see on the screen right now is a drawing that does not have the cantilever. That does not have the twenty thousand square feet that Gary was talking about. So what you see as the mechanical was actually a shell space that we intend to locate the 20,000 square feet that will be transferred to this building after the Cantilever air right is purchased the twenty thousand square feet and it seems when you, when you look at the subsequent pages and I'm not going to suggest one second, that we do that, but it seems that you're deducting this area from your usable occupiable far when you say subsequent pages. What subsequent pages are you referring to the subsequent pages of your drawing? Look. I'm sorry! I am not in my office. I do not have access to it and you're asking me to review drawings that we have prepared two years ago, so my memory may have fluid all right. If you could be more specific, maybe I could answer it when you say subsequent drawings. I only know that we have two sets of drawings that we presented. If you look, let me be more specific. If you look at the substituting pages, meaning page zero, two and going forward. Those pages actually show the deductions from your total. If usable far- and it seems if I read this correctly- but you know, I want to make sure that my reading is accurate, which is why I'm asking you the question: it seems that you're deducting a large amount of square feet as being non- usable because it is deemed mechanical and, as you know, mechanical floors do not count towards your far. Yes, I was talking with my wife. You are correct, you're, most correct, but nevertheless I also want you to know that I mean the paper wise. It may not count, but when the building inspector can come to inspect the building and they have to see actual mechanical units, spoilers condensers generators and whatnot on the floor, and if they do not find it, then we do not get the Tco or the co for those spaces right, and we know that so it's you can't just label a space as mechanical and not have actual equipment on there. But gene. Can you go to this page number c002 that our chair person is referring to, because then I can maybe explain better okay, let me tell you which page it is okay. So if you go to page 21, for example, your pdf deck, it is starting to show the zoning deductions. Is there a particular floor? You'd like me to go to, I think she might be referring to a chart kind of a chat, 103 Z104 Z106, I'm just trying to understand. You know what it is with that, so if you could, if and if we could hold it there, and so I do want to refer that look. I think we have labeled a lot of the mechanical flaws as to the actual usage that we intend to put it there as gene was flipping the pages, so you could see that one of the page that he just flipped indicated storage tank. Maybe not this one, maybe the one previous. I do not know. If you see that right, it shows a storm retention tank. Yes, so right, I do want to explain that you know there was a reason for putting the mechanical force. If we had a larger site for instances, we would collect the storm water on the site itself, but because we have a small site, and so we have to collect the storm waters within the building and through control drainage, so that you know it would we would control the seepage and the and the way it's being pumped into the city system so that it does not overflow the storm water system, and things like that. So I just want to take that opportunity to try to explain why some of those mechanical systems are there and why it would be much better to be located them in the lower portion of the building than at the upper portion of the building. Because it's containing a storm water tank right, okay, Gina, you can continue to go to the charts. I mean we do not need to go through every single one of them. I you know. I just want to make sure that in the in the section that you showed us, although we understand that it is no longer what you're planning to build that, you are basically proposing five floors of mechanical equipment. I did say that earlier that I think we, I can't remember exactly. There might be two floors that we might be using if we acquire the air right well. Actually, we have quite air right with the Cantilever scheme that is no longer going to be mechanical, because when we get the application for this first set of drawings that you are seeing, we have not gotten our air right and therefore we're just applying an s of right building with no cantilever, so you're saying the mechanic will be could be spread out more. Yes, that's what I'm saying right. Some of those mechanicals have to be at the top of the building for this vrf system. I mean they can't be located too far away. Okay, is there any way to actually get the the actual drawings for the cantilever building the most current ones? Yeah? Yes, okay. I think that would be helpful so that so that we all have the same drawings if that can be shared with us at some point in the in the coming week. That would be great. Thank you. Okay. I see no more questions from our members of the committee, so I'm going to open up the 40 members of the public. Do we have any questions or comments from members of the public? Any questions, any comments to this application? Okay, so seeing none, we are going to move to a business session during business session. As I said, only members of the committee are allowed to discuss the the matter and we will start with comments. I want to hear comments from members of the committee feel free to use the Wraith hand function and if you do not, I will have to call upon you. We need comments, guys Clayton I'll call on you. Oh Mike has his hand up Mike go ahead. Well, it's a I understand that they did not really complete the foundation but they're, taking a risk by building a hotel in these kind of conditions with the pandemic and an office building would be a risk too. So I do not see any residential on this block and it's manufacturing in other hotels and office space. So I do not see any downside for letting them take their risk. Okay, Dave yeah, I'm just concerned about the cantilevering. I have Kendall go without saying something about it, whatever the merits of whether they got the foundation in there in the nick of time, I'll have to research a little harder, but I just can't stand this candle levering. It seems the worst of New York architecture in the greed and the hogging of space. It just drives me absolutely nuts, that's my two cents just to reframe the conversation a little bit. I just want to emphasize that really what we're looking at here and what we need to comment on is whether we believe that there is a you know that the applicant has a vested interest and that the vested law applies here, that they have spent enough money and that they have completed enough of the building to justify continuing building the building. I also want to remind everyone that the zoning has changed, which is why this building is no longer conforming and the zoning has changed, because you know for a variety of reasons. It was actually a city- wide zoning tax change that you know made hotels, no longer a conforming use in manufacturing districts for a variety of reasons, because you know it's a use that was actually competing with other types of users that were deemed more desirable for manufacturing, including manufacturing use in our district. We have been adamant in saying you know years after years after years and calling for that exact type of zoning text change, that the proliferation of hotels was actually very disruptive to to our district for a variety of reasons, but one of them being that these hotels and the proliferation of them, the sheer number of additional hotels in our manufacturing district, was actually pretty disruptive and especially because the the architecture that was permitted for these types of hotel was actually very disruptive to the streetscape. Most of these hotels, if you know, if you take a look at, you know, there's a quite a few on 28th street 30. They are set back from from the street. They create. You know a really real disruption to to the streetscape and they're, usually taller, and you know they do not really add much to to our district. They have been competing with other conforming uses, such as class, the class B and Class C office phase, which is you know, quickly disappearing from our district, which is something that is problematic. So you know I just want to reframe the conversation. It's not really about. You know whether we like this building or not, or you know other aspects of it, but it's really to determine if we believe that there was enough construction in terms of you know, like substance and investment put into this building and also whether this particular type of development, a hotel, 31 story with you know a very different type of you know: urban, you know element in a an existing streetscape and urban context. Does that deviate from the new zoning or not? So you know I just wanted to bring that context into the conversation Ryan. You have a comment. Go ahead, we're following a lot in ways of what you were just saying. You know I'm looking at this and considering this you know very specifically and sort of narrowly on the question of the BSA application and, although I will say I think it's useful and valuable that we've been able to ensure that there's some more public understanding of all the things we've been talking about. Additionally, with that in mind, I do feel like this is they have put substantial effort, investment and progress into the excavation and foundation and so forth, and so I am positively disposed towards the BSA application here and consider that to be the core of what our exercise is right now. Okay, thank you, Aaron, hey everyone, so I I'm sort of leaning on you know. I feel, like the new zoning text should apply to this project and I think it's really problematic. I think it's a little bit subjective. I would sort of lean on the side that you know. I do not think maybe enough substantial work had what was done, but I would like to see the new rules apply here. I think it's a real problem and that's exactly what the news learning text was meant to. You know protect, and I think it's a real problem if we're sort of letting this one get in under the under sort of the radar. That's just sort of my stance on this one. Thank you, Aaron Clayton. Yes, I tend to agree with Aaron's comment. I think that, from what we've seen in the application, there is documentation of the financial investment they put into the project. I would absolutely grant that I am not clear from what I see from photographs if we know enough to know that, in our determination, based on our precedent about substantial work in the foundation, if it meets that standard and much more to the point, I think layla to your directive about the framework of the conversation about the intent of the zoning text change and the extreme problems that we've had in our entire district. But in this exact neighborhood that we need to be extremely conscientious about waivers granted. Given that the zoning was changed for a reason and for a reason that we advocated for years and the other point that I just wanted to make- and I guess this is also somewhat subjective because there's no real definition but in my eyes, having a perfectly legitimate, perfectly actionable conforming use of an office alternative which would have value and which would make money, does not qualify as loss. And that to me is the main point that I would want to hear more from my fellow committee members, because I do not believe that finding justifies granting of the waiver yeah. Thank you Clayton. I you know, I won't say that you know on the various questions that you know the BSA application raises. You know I would say that was the demolition completed. 100, yes, was the excavation completed 100. It seems that this is. This is correct. It seems that it was excavation was a complete one, 100 foundation, it's very difficult. You know I looked at the material, you know they are affidavits, but you know 70 percent 60. It's really hard to determine the photos, do not suggest that 70 of the foundation was completed and I find the timeline to be. You know a little concerning. I would say it's it. It's quite a you know an accomplishment to start construction in sometime in or like to be issued a permit in July and then to be 75 70, complete with foundations. I find that it it's a quite fast pace. That is giving me pause. So I do not know that you know that this number is actually correct. The the cost of the project is also giving me concern. I do not know that you know like if you just look at the heart cost. It's 6.6 million out of 11 million for elements that were needed, regardless of the use that it ends up being proven for this particular project. So you know whether you buy you build a you know: a commercial building that is conforming use or a hotel that is non- conforming. You still need to demolish what was there and you still need to excavate. So this actually is not a cause that is lost, then the notion of serious laws. I read the the reports that were commissioned by the by the applicant and both for commercial use and for hotel use. They both basically give a total green light, they're, both good projects, profitable projects in a strong market that accounts for Covid-19. The reports were actually issued sometime in summer 2020 and they both say that you know for both uses, whether it's conforming or non- conforming, that you know those are good uses, and you know they basically give a green light. So you know one may be more lucrative than the other, but that can not be conflated with a serious loss and then finally, I would say that you know in the on this particular block. In particular, there is just such a proliferation of hotels. You know on 39th street there is this hotel. There's the you know the neighbor there's another hotel to the east and there's a hotel that maybe is actually the dream hotel. That is a through block on with an entrance on 38th street. So the deviation from the intent of the new zoning is really what I struggle with, and you know I think that a new development and on that particular site is good. A commercial use is conforming use and it is a good use. You know, no one is going to suggest that it should become a manufacturing use now if the developer is really intent on developing a hotel. There is a path for that, and this is really you know, an avenue that I would you know, urge the applicant to consider, because then our concerns in terms of streetscape and contextuality could be addressed through a a special permit. It would be, you know, a better design that could be more sympathetic to the district, and this is something that we probably could you know rally behind so overall. I think that the route of the BSA permit is actually not the proper one, and I would really encourage the applicant to look at other options, whether going for conforming use with a commercial building or exploring the other. The special permits- and those are my comments- are there any other comments from members of the committee yeah ej, yeah I'll just you know I'll chime in to say that these are these are hard applications and we try hard to be accommodating, and you know at the end of the day, I think for me: what is the the tiebreaker the deal breaker? Is you know whether or not you can, as you were, describing whether or not this application really meets what we would consider all of the criteria you know include in, and you know I think in this case there's a number of questions such as the timeline of the foundation and, as you said to me, it also kind of comes down to whether or not it's complying with the with the spirit of the rezoning and the contextuality of the of the area. So I agree with a lot of what you said: Laila there's I think there are. I think there are other avenues in this case and to me it just does not seem to meet all the different criteria that we would lay out for for this specific for another hotel, with a with a specific permit here in this situation. Okay, thank you other comments from members of the committee. Okay, so seeing none, we will need a motion so that we can take this to a vote. Who wants to make a motion? Would it be a motion to deny unless and what would be unless Dave go ahead? Well, the applicant comes back if he wants to pursue, as you said, the hotel yeah, so the application is really specific. It's not a you know, sort of like either or the application is really for a BSA variance. So it's either. We are in support of the BSA variants. Basically, we need to send a message to the BSA. We need to tell them whether they should grant this request or whether they should not grant this request. So if we believe that the route for the applicant is actually to pursue a special permit with the Department of City planning, then in essence we are not in favor of the BSA action. Does that make sense? Yes, it does okay, so I think I think the motion you know if I hear the comments from the a number of members is to actually recommend denial of the the BSA action and instead to urge the applicant to consider a conforming use or to consider a special permit under the existing zoning of this particular lot. If that was the motion, then I second it all right. So I guess we have a motion in a second. Are there any questions or comments to the motion? Okay, so seeing none. Let's take this to a vote starting with Dave. Yes, Nick. Yes, andreas okay, he's not here, Aaron, yes, Mike, yes, tristan, yes, ej, yes, John! Yes, Evan Evan is not with us Clayton, yes, Rachel, yes and Ryan. Yes, okay! So, and I am a yes, so the motion passes unanimously all right. Thank you very much. Thank you all very much be well. Thank you. So, moving on, we have one item for our discussion on which we may decide to take an action. Let me tell you a little bit about the the origin of this this project, so this is concerning the Park Avenue Malls and, as you know, or as you may know, the the train shed that is located under part of the Park Avenue Malls has deteriorated to a point of real grave concern. As such, we know that the MTA at some point will have to actually repair the the train shed in order to do that they are going to have to rip parts of Park Avenue, because the train shed is located right underneath going hand in hand with that disruption. We also know that there is a number of new developments in the newly rezoned east Midtown that are adjacent to park Avenue and are going to require to actually grip some of Park Avenue, and this is an opportunity also to address the disrepair of the train shed. As you know, also, there is that there was a a governing group that was formed as a supporting tool of the eastmit Acemitan rezoning, and the goal of this governing group is actually to raise funds when air rights are being transferred within the east Midtown district and use these funds for the public realm. So I felt that, given that you know all of these parts are sort of, you know proceeding at the same time at different paces vastly different paces. But nonetheless, at the same time, and given our engagement for the public film, I felt it was really important to make sure that we have a position on how we wish for the the moles to be addressed going forward. So we've had discussions with the governing group with you know other groups that are present in the area, and you know I felt that it would be good that community board five has an official position so that when the time comes for the you know ripping off of of Park Avenue and the reconstruction of the malls, we do not end up with a DOT telling us. Okay, you know here's some asphalt and we'll put a couple of trees, and here are the malls. This is a great opportunity and you know as disruptive as it is going to be, and you know we do not know what the timeline is going to be. But you know it is going to be disruptive for quite a while. It is wise and prudent and hopefully will realize it was smart to actually start thinking about it and start being a you know, a force for making suggestions prepositions on how the moles should be addressed after they ripped so that we do not end up with something ugly when we do have the opportunity to to really have a vision and make this. You know this area a real part of the public realm, so we have with us fred Cerullo who yes he's still there. I was looking for the little vignette. I'm sorry so Fred is the head of the Grand Central partnership and, as such, he, I think the Grand Central partnership, I think, manages two malls fred has been very involved with a number of property owners whose properties actually are facing the malls, and he knows quite a bit about the the the ownership, the jurisdiction, the governance of of them all. So I'm very happy that Fred is with us. Thank you fred for your patience and if you could tell us a little bit about your your experience with the malls and what the you know, various property owners that are part of the Grand Central partnership envision and how you see a better future. Oh fred, you're, muted, sorry about that everybody. I was just saying. Thank you layla to you and it's great to see everybody on the committee, it's nice to be able to talk to the this particular committee about this important issue like in the in the neighborhood and what it means not only for CB5 for the Grand Central, Partnership District, but obviously for the city, as I think we all can agree. Park Avenue is an iconic corridor in the world and obviously deserves an equally iconic and respectful future. So I'll do my best to share all that. I know and try to address all the issues that you raised. Layla I mean you hit so many of them on the head. You know you use the word that the term that this is an opportunity and there's no question it is let me just sort of frame this, for I guess discussion and I know many. There are several of you who participated in the Midtown east rezoning process on the task force very familiar with the fact that, as part of the rezoning, there was a recommendation which I know this board also considered when it supported the initial concept plan, which became the concept plan and one of the items that sits in that plan and is still alive, has to do with expanding the Park Avenue Malls and sort of looking at Park Avenue in a new way as part of potential funded projects that can grow out of continuing reinvestment in the Midtown East area. Under the rezoning. The what we did not know at the time was that Metro North was planning this incredibly extremely important, but also overwhelming project that, at this point, is sort of calendared for at least two decades, which I think, as we all know about. When sort of government agencies can, you know, throw a number out in a time frame. We all can be concerned about the fact that it could be 30 years that Park Avenue is under major construction, and that, obviously, is a is a concern on a lot of levels that I'm sure we will have a lot to talk about in terms of the impacts during construction. But what we really wanted to focus on and what the stakeholders at Gcp wanted to focus on was what opportunities were now on the table for us to be thinking about the Park Avenue Mall. Since, as layla indicated, the reconstruction of the train shed will require at any point in time the demolition and literally the removal of one two or potentially three malls at a time and, as I understand it, from the homework that I've done, that's required because there will be the mall over which they are working or under which they are working. But then the mall to the north and the south of that mall would be used to divert traffic, because it is the city's plan that it will always be some flow of traffic going north and south along park. So at any point in time there could be three malls that are impacted, and so there's sort of this idea of you know obviously there's a short- term plan for what happens to the malls. And then how do we deal with the future of the malls? Knowing a couple of interesting facts that there is 80 percent, less public open space along per employee in a commercial district along park than any other commercial district in the city? And we all know because I think what made the second phase of east Midtown rezoning. Successful was that sort of the re- look at it focused on increasing and enhancing the public realm, and so we know that that's an important priority for all of us, and so we're really looking at this one of the stakeholders along Park, Winston, Fisher principal at Fisher brothers. I'm sure you'll remember about two years ago, just in sort of without any of us, knowing that Metro North would be doing what it was doing, but to really pay tribute to park Avenue and also to tap into the creative talent of new yorkers and around the world had a competition that sort of generated some really amazing ideas. Some of them completely will say off the wall even but really creative ideas about you know what could you do with this public space because right now, let's face it as beautiful as the moles are they're very ornamental. There's no activation to the malls, there's no place for people to sit and enjoy them. There's no programming beyond public art displays that do take place in the malls, but there's really no activation, and we all know that we're really desperate to find public space in this community. So this was an opportunity and kind of spun off into a working group within the bid and the stakeholders we did meet with the two community boards, all the elected officials, the members of the governing group, to talk about what we should be doing in terms of thinking ahead and being ahead of the curve, because Metro North has a lot of responsibility that they must handle with respect to the malls, including the restoration of the malls to some degree, and so with that said, I think we are at a point where Metro North I've. I stayed in touch with them during the sort of stay at home Covid-19 period, the 270 park and Metro North are working on the mall right now in underneath the mall right now, I'm in front of 270 as part of the Jp Morgan Chase Project, Metro North is developing and dealing with the city, as I am told, and have learned about sort of the core things that the mall should have like irrigation. These are very important to us, as managers of them all irrigation power weight- bearing ability- and so this way, whatever they become and whatever the community wants to embrace, as the future has at least the core requirements to be able to do things that right now, we really can't do. As you know, if you go to park, there are overhead wires trying to light the Christmas trees, there's no irrigation system which does not help the train shed. You know rusting issue because of how water actually accesses the malls and does not really have any place to drain except below. So we've spent a lot of time trying to build a I'll say a coalition, but really just a neighborhood based grassroots effort to pay attention to the malls and obviously there's a lot of options for what could be could be done here, but the long term is it. We're really focused on what the design, how to do the design for the malls- and you know there was there- were about four core goals or desires that we learned from in dealing with all the people that we interviewed and sat with, which you know included also the fund for Park Avenue malls, the Design Trust Mas, never mind the elected officials and the government agencies and community boards, five and six, but you know walkability, accessibility, activation, some sense of cohesiveness and also, very importantly, some maintenance and operation governance. That makes sense. Layla referred to the fact that I understand this issue. I do between 46th street and 57th street, which is the geography of the malls that are subject to Metro North's, long- term construction project, they're, all they're all managed by different people, they're funded by different people. There's absolutely no one place. You can go, we do our best to bounce around, but we actually only plant two of them. Private owners are funding contractors to come in and do the ones in front of their building. The irony is no one knows how this was structured. I have no idea how Gcp became the 52nd to 53Rd and 53rd to 54th managers. No one knows, and just recently we learned that, while we all believed that the Parks Department had was the city their jurisdiction over the malls, it really is D.O.T, and so because the walls are in the public, right- of- way and while Park certainly has an interest because of what the malls actually represent. It is city DOT that has ultimately the legal jurisdiction over the mall. So we've been trying to figure all this out because I think in the long term the two critical issues that we're really pushing for is one a really good design and we believe that really involves bringing in you know doing an RFP bringing in designers, landscape, architects who can really be creative and bold, and not to have this to be your traditional city, capital project. I do not think it works. We also need someone who could understand how you do something in a temporary phase and how you build it into a long- term. Permanent phase and the other is about like looking at governance, and how do we create some accountability for what goes on in the malls for programming and maintenance and operations? And so that's where we are. I can tell you that before pre- coded- and I think this was probably presented to the committee or the board at some point in time- D.O.T was putting together a visioning session which was going to be in person at some point in the spring of last year because of Covid-19 and obviously all the rules that we're still following with respect to congregation and occupancy and crowds. They have developed a visioning session that they are going to release shortly. We're pushing city Hall to do this, to do some sort of a virtual public visioning session to get the input of the public about what do they want to see? We think that's really important for the public to weigh in beyond just speaking through stakeholders that have, you know, perhaps a similar interest, but we have to broaden the base of the idea. So getting the visioning session done getting somebody getting a real designer in here that could help create the amazing future for Park Avenue and then studying and trying to figure out some sort of a governance and maintenance and operation structure, so that in the long term, there's accountability, consistency and we can rely on the fact that the malls will always look like what they deserve to look like. So that's sort of the update from where Gcp has been in the story and the work that we've been doing and what we believe to be happening next. But we do know that the clock is ticking in a sense because Metro, North and Jp Morgan Chase continue on the project at 270. And you know at some point there will be the need to actually deal with, at least that mall or the three malls. That sort of you know between 47, 46, 47 and 48. So anyway, and obviously I look forward to continuing to work with all of you, I mean the board has been amazing. Well, we work a lot together on so many issues for Midtown, East and and enjoy that and look forward to continuing to work on this really important issue too, because this is this is a legacy project. This is not necessarily something we will see tomorrow, but all of us will be part of a huge legacy project for the city and for this neighborhood. Thank you so much fred yeah. You know, as you said, this is. This is a really important project, and so members of the committee, you must be wondering why we thought parks had jurisdiction. We know that DOT does and now it's coming to the land, Use Committee and there are actually two reasons. The first one is that the great impact and leverage and hope that we have is that community board 5, as you know, is a part of the governing group of East Midtown, and that you know this governing group's job is really to allocate funds, and the governing group is directly tied to the land. Use Committee, so that you know that there was a direct connection there. The other one is that you know the the chairs of both the York Parks and the Euro transportation committees do sit on land use, so it's always a good, a good conduit so that we can have these these conversations that involve you know a sort of like broader vision and and other agencies. So what I think would be really useful for for the board. Is you know to do embrace a vision and to you know, I think, there's great value in saying something: that's pretty simple! That is, you know pretty obvious if we have the opportunity to have a vision on what the malls should become, if we have an opportunity to allocate funds and to advocate for the allocation of these funds that do exist, it's not and a hypothetical. Oh, you know, let's see what the budget will have on that particular year. The money is there, it is in the bank, it has not been spent. Yet. I think that we community port five should take the position that we want funding directed to the malls and that we want to be involved, and you know, hopefully, help create a vision that serves the needs of our district and the mo the beauty of the mold is that you know they're pretty big. It's not just you know a couple of blocks and they do not have to all look the same. Some can be active, others can be a little more passive. Some, it can be. You know very user friendly. Others can have different purposes. Some can be. You know, allow some modulation, you can, you know, build something, a stage or something organize events. You know that serve the other, the community. I do not know like goat Yoga on one mole and then the other one can be. You know bow quartz, although I do not and I'm just throwing some random ideas. I will certainly share the results of the competition that was organized by the fisher organization. That was, I mean they came up with ideas that were just absolutely hilarious. If I recall correctly, you know there was like a shark water tank or something you know really quick, almost like yeah, but really you know giving a sense that you know a great creative minds can actually come up with. You know a great way to activate this space that currently is beautiful, but is not serving the needs of of our district. So the goal tonight, if the committee is on board with that, is that you know so that we do not have to revisit each time. You know reacting to oh the governing group, things that you know we should be spending the money here or you know other groups and stakeholders. You know decide to go a certain direction. I think it would be useful that we community board five get on board with this idea that many from the governing group should be dedicated to the design and improvement of the mall in a smart and judicious way. You know it's not a matter of just you know, spending money and then realizing that you have to rip the walls again, because you know the timing and phasing of the MTA construction requires that and also you know, being involved with what this vision should be. So those would be you know, hopefully the the two statements that we can make tonight: a location of funding from the the governing group and a real involvement on the the vision and design of of the moles Clayton. You have your hand up yeah. Thank you. Thank you. So much and thanks fred for being here, it's great to see you virtually and oh, my god, the years that have been spent on with the east Midtown rezoning and the governing group and the talking about the malls and a million other projects yeah, I'm glad to have the opportunity to crystallize this and move this forward in some way, even though we all know like you said this is a legacy project and I hope we're all you know alive when it actually occurs, but so layla in general. Absolutely yes, I would be 100 on board with issuing some kind of state, I'm sure it's a resolution or a letter or whatever people think best about the funding and the process, the involvement of the public. But I do want to kind of add some finer points on from personally from my input, I'm not going to bury the lead. I think this whole conversation really ballasts what we've been talking about lately with Mas's proposal for a proposed director of public realm. It's a perfect example of the spaghetti bowl mess of so many public spaces in our city, and I just wanted to note that, as we communicate about this topic moving forward, it could also be a great opportunity for us to keep pushing for that position, absolutely the design process. Yes, I do agree that someone involved who can oversee this in a smart way with an RFP and all the rest. It would be very advisable. The idea this bidding is being a city capital project. The DOT at the helm is like nightmare on Park Avenue and the process. Yes, a public visioning session that all of that great ideas, the having a master plan for governance and operation maintenance, absolutely makes perfect sense. When I start getting a little nervous personally, when I think about a mall that is working better after a redesign in New York City, I immediately go to Allen Street on the lower East side, where up and down they just created open space in the middle of the mall, all the way down and some of it curves and there's plantings and there's benches and people can just sit and whatever and in Midtown. It feels like a beautiful way that people could just sit and have their lunch outdoors and create actual new open space. That is almost park-, like that's very exciting, but the word activation makes me like I'm allergic, and so I would caution any of us using that word without being more specific about what we mean, because technically activation could just mean opening up waking up the space and having to be usable for people but events and programming and then more permitting and a coffee, kiosk and all the rest of the mess that we went through with the pedestrian plazas. We could really be opening up a massive can of worms, so I have a lot of concerns about that and I would not want language of our support to indicate that we necessarily believe, since we have not really heard this issue, that we want to have commercial activation in the Park Avenue malls. That is something that I would not be on board with. But aside from that with the general idea, I'm absolutely on board yeah very good point, and I think that you know that that's exactly like having a position from the get- go is really going to give us an edge so that we do not have to be reactive. We do not have to go like, oh, my god, but we do not. We can basically say it from the get- go. You know this is what we envision. This is what we need. This is what is important. This is what we do not want a finer point too that, because the bid would be involved, I mean who knows how this would play out as far as governance and if you'd still have those two blocks or if you whatever, but programming, is separate from activation like when a bid does programming at a pedestrian plaza, that's a much different impact and tends to get obviously a lot more community support. So there's a there's needles to thread here, so I did not mean to paint a really broad brush with that, especially if the bids involved and be responsible. I understand that there's a lot of conversation there. That would have to happen sure, and that's fair. I think the term which came up from the all the interviews we were doing really was not about commercial activation. I do not think anyone really intended that it was more about converting it, where you could interact better with the space that kind of an activation which right now and you described Allen Street, which, if I was able to which I do not have, but you know, photos of the malls a hundred years ago, literally, the moles are a hundred years old right. Now, that's what they looked and they had exactly that model, and you know now they're just planted areas and inconsistently planted areas with very different, depending on who's funding them very different styles. So I that's well well stated, and I understand exactly what you're saying I do not think there's any. You know again we're all on the same page on this. So great. Thank you. Ej, you have your hand up yeah. I won't. I won't take a lot of time reiterating all the great points that have already been made. You know I'm 100 on board with all the points that have been made already as well. I'll just point out that you know Tne has been has been brought up to speed on the transit and transportation and street level aspects of the plan by DOT. We've received a presentation, it'll of course, be 10 or 20 years of overhaul in this area and it'll very much, you know happen on a rolling basis and we, of course, do not want to see the the malls end up as an afterthought, or some kind of ad hoc, ultimate treatment or presentation. You know on Tne we talk so much about needing more comprehensive vision and comprehensive planning in in transportation vision, and that includes pedestrian space. So you know better than activation might be this idea of pedestrianization and better. You know pedestrian space for for not just moving around, but you know eating lunch and creating you know, as the city shifts some traffic and travel lane space to other purposes. You know this is a perfect opportunity for there to be actual vision and design behind it. And you know if you look at old pictures of Park Avenue, it was, of course you know a pedestrian thoroughfare. You know like a grand cathedral just for pedestrians, all the way up, Park Avenue, which you do not see anymore, and so it seems like a perfect opportunity for for the design of this area to Jibe with the larger trends of of the city in an intentional way. Yeah. Thank you. Ej dave, hey Kelly's, you have your hand up yeah. I do not know if you can see this or not, but there it is that's the ball how it used to like. I was looking through all my books, but once you see the speaker that's in front of Saint Bartholomew's church, but whenever I, when I first saw that picture just wow, that's the way it used to look and it'd be so much fun. Great idea count me in yeah I'm laughing David, because I can't I'm looking for it now, but I have the same. I have the same one. So I love that picture. It's inspiring great okay. So I think it's fair to say that the the committee is on board with this. With this position, no one is objecting. I'm sorry, I'm trying to open the chat. I think Ej just dropped a. I just shared a shared, an article with that photo and a couple others, oh great. Thank you. Thank you, okay, so I am always inclined to do resolutions more than letters, but you know I'm not married to this idea. Do you guys have any thoughts on whether we should issue a letter or a resolution? A resolution is stronger. Okay, any objection to a resolution, no everybody's on board, okay, just making sure that I do not ignore our members of the public as I'm going to open up the floor to members of the public. If you are still here with us and you have any questions or comments and you want to share any of that with us. Now is the time. Okay, I do not see any hands raised. So, let's wrap up this discussion, so we will basically pass a issue, a resolution stating that we want funding from the governing group dedicated and advocated for the redevelopment and design of a beautified and much improved park of new moles, a fully comprehensive design, with vision grabbing on the opportunity created by the refurbishment and reconstruction of the train shed and urging all the city agencies and various stakeholders to get on board and as this evolves, we will continue to be involved in what this design and what this vision should become, and we will add language specifically to your concern, clayton over our objection to commercialization. While we also strongly support a activation that is of non- commercial nature. So that's the terms of the the resolution that we would pass all right. That's amazing, all right fantastic, so we are going to take a vote just for the sake of it. Dave. Yes, Nick, yes, Aaron, yes, Mike, yes, Ej, yes, John, yes, Clayton, yes, Rachel, yes and Ryan, yes, fantastic, and I will mention that you know. Of course we will continue to work with the other committees. You know I felt it was a good way to tackle this statement of intention through the languages committee, but you know I certainly appreciate that it is also you know very much a parks, Ntna issue, so I think we're going to share ownership with this baby. With all of that said, the no more items I think for us tonight, thank you fred, so much for joining us. It was really very oh. Thank you for having me thank you, and the meeting is adjourned. Thank you very much guys have a good night.",
            "summary": "This vote of the full board will become the official position of the board and will be sent as our official recommendation to the BSA and any other relevant parties, such as our elected officials or city agencies, and the discussion item will proceed on a similar format, except that we do not have a formal presentation, but we will follow the same order where we will have a question period for members of the committee.\nThe project is a proposed hotel that is located at 58, 60 West, 39th street, and we have the team of applicants present with us and if you want to take it from there and give us your presentation, great.\nThis is an application to the board of Standards and appeals for a common law vested right to complete construction of a hotel development at 58.\nIn this case, the foundations were not complete, so the developer's recourse is to apply to the BSA for a vested right.\nNew York law says that a developer is entitled to a vested right if substantial construction and substantial expenditures have been completed prior to the zoning change and also where the developer would suffer a serious financial loss if it is not permitted to continue its project under the prior zoning.\nThe application includes materials demonstrating that the developers spent just over 11 million dollars on the project prior to the zoning.\nYou know we're looking at two to three years, pursuant to the uniform land use review procedure with really no guarantee of success, because we do not know if the building is designed, we'd even be able to meet the special permit.\nI also want to point out that this application is to vest a 31 story, hotel development that you can see here, because that is what was approved by the department of buildings at the time that the zoning change went into effect.\nAssuming that this application is approved, the developer intends to acquire excess floor area from the parcel to its west, which you can see here and to cantilever over that parcel right.\nWe believe that this enlargement would be permitted as of right and the larger developments again assuming the vested rights application is approved and the zoning lot is enlarged would be a 34-story hotel with approximately 173 rooms and 62,000 square feet of zoning floor.\nPart of the rolling also says that the the ruling stands that they were worried about inappropriate architecture and that whatever hotels that were developed in the neighborhood show some sort of respect or coordination with the local buildings and from what I can see from your drawings and your pictures and the actual neighborhood itself.\nThe cantilever would be constructed pursuant to the acquisition of the development rights from the parcel of the West, as I mentioned, but you know with respect to the architecture and issues of supplies of hotels in the area.\nDid recognize that hotels that were under construction would have an ability to vest they put a special vesting provision and they acknowledge that even developments, not meaning that special vesting would be able to rely on the standard vested rights, which is essentially what we're doing.\nAnother question from Clayton go ahead, so I have many questions, but the one that I just wanted to ask right now was also about the cantilever you blew through that somewhat quickly, but I believe that the logic you laid out was that, because the zoning is different in the lot above which the cantilever would exist.\nSince, the point where the zoning tax change went into effect, has any work happened on that site, or has it been completely stopped and shut down construction stopped?\nYou mentioned that the the audit that you ordered on the office development profitability versus the hotel profitability showed a serious loss, right, correct?\nIf I read the the application- And, the report correctly, it looks like there is a large hotel development on 38th.\nThis development, emerging zoning laws and putting those rights into our building.\nThe underlying zoning of that particular lot requires that any new commercial or hotel building be set back from the lot line in order to give a 20-foot rare, yard.\nYou know the principle is pretty simple: when you have a change in the way you can use the land and you had a vested interest in doing a particular project and you spend a lot of time and money and then all of a sudden, boom.\nLet's say that you know this hotel is already halfway up the ground Basically, the way the BSA now I'm, referring specifically to the BSA and not other municipalities in the state of New York.\nThe BSA has looked at these cases, which I mean it happens all the time you know The zoning What the BSA looks at is how much money was spent and the way the rules are, you know excavation- should be completed.\nIt, is exactly the same thing for the exact same reason, the exact same zone, zoning text, a main amendment that basically passed and that we supported wholeheartedly and so warmly- You know with great enthusiasm, because we do believe that hotels as a conforming use in a manufacturing district is not appropriate as of right and it can be appropriate by special permits so that we have a chance to address all the concerns that hotel development poses in our manufacturing districts, not to say that they should not be built and we're very clear in our recommendation and our support of the zoning change.\nSo you see certain vested rights cases where sometimes it was a smaller developer or smaller project They did not realize the zoning changed and was not paying attention to anything or did not have any sort of records, and they do this stuff on the back of a napkin.\nWe've clearly demonstrated that we've completed excavation all support of excavation, and we have made you know: significant progress, substantial progress, potential, construction on the foundation, and it's all It's all in that in the application.\nWhat you see as the mechanical was actually a shell space that we intend to locate the 20,000 square feet that will be transferred to this building after the Cantilever air right is purchased the twenty thousand square feet It seems when you, when you look at the subsequent pages and I'm, not going to suggest one second, that we do that, but it seems that you're deducting this area from your usable occupiable.\nYes, so right, I do want to explain that you know there was a reason for putting the mechanical force.\nYou know that the applicant has a vested interest and that the vested law applies here, that they have spent enough money and that they have completed enough of the building to justify continuing building the building.\nYou know whether we like this building or not, or you know other aspects of it, but it's really to determine if we believe that there was enough construction in terms of you, know, like substance and investment put into this building, and also whether this particular type of development, a hotel, 31 story with you know a very different type of you Does that deviate from the new zoning or not?\nLooking at this, and considering this you know very specifically and sort of narrowly on the question of the BSA application.\nAnd, that to me is the main point that I would want to hear more from my fellow committee members, because I do not believe that finding justifies granting of the waiver I you know, I won't say that you know on the various questions that you know the BSA application, raises.\nQuite a you know an accomplishment to start construction in sometime in or like to be issued a permit in July and then to be 75 70, complete with foundations.\nYou know, a commercial building that is conforming use or a hotel that is non- conforming.\nI think that the route of the BSA permit is actually not the proper one, and I would really encourage the applicant to look at other options, whether going for conforming use with a commercial building or exploring the other.\nYou know I think in this case there's a number of questions such as the timeline of the foundation and, as you said, to me, it also kind of comes down to whether or not it's complying with the with the spirit of the rezoning and the contextuality of the of the area.\nIf we believe that the route for the applicant is actually to pursue a special permit with the Department of City planning, then in essence we are not in favor of the BSA action.\n, so I think I think the motion you know if I hear the comments from the a number of members is to actually recommend denial of the the BSA action and instead to urge the applicant to consider a conforming use or to consider a special permit under the existing zoning of this particular lot.\nWe also know that there is a number of new developments in the newly rezoned east Midtown that are adjacent to park Avenue and are going to require to actually grip some of Park Avenue, and this is an opportunity also to address the disrepair of the train.\nOther groups that are present in the area, and You know I felt that it would be good that community board five has an official position so that when the time comes for the you know ripping off of of Park Avenue and the reconstruction of the malls, we do not end up with a DOT telling us.\nYou know this area a real part of the public realm, so we have with us And it's great to see everybody on the committee , it's nice to be able to talk to the this particular committee about this important issue like in the in the neighborhood and what it means not only for CB5 for the Grand Central, Partnership District, but obviously for the city, as I.\nI know this board also considered when it supported the initial concept plan, which became the concept plan and one of the items that sits in that plan and is still alive, has to do with expanding the Park Avenue Malls and sort of looking at Park Avenue in a new way as part of potential funded projects that can grow out of continuing reinvestment in the Midtown East area.\nWhat we did not know at the time was that Metro North was planning this incredibly extremely important, but also overwhelming project that, at this point, is sort of calendared for at least two decades, which I think."
        }
    }
}