{
    "YoutubeMetadata": {
        "author": "MCB10",
        "channelId": "https://www.youtube.com/channel/UCVgO39Bk5sMo66-6o6Spn6Q",
        "title": "June 2020 Senior Task Force Meeting",
        "publishDate": "2020-06-29",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB10",
        "normalizedName": "Manhattan Community Board 10",
        "twitterName": "Manhattan CB 10",
        "youtubeChannelName": "Manhattan CB10",
        "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
        "twitterHandle": "@mancb10",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": "changed live 9/13/2020"
    },
    "properties": {
        "fullTranscript": "Morning, good morning, Denis, how are you good? How are you thank you? We assigned you now fossil jet like last. Stop that's okay, I've got you I! Think yeah I got it gotcha you good morning, everyone good morning hi. How are you thank you, I'm, quick question: did you were you able to get into the virtual class nightbat time because I think I was no I wasn't home, but I will try, but thank you for following up on it. Okay, no worries any time: okay, good morning Debra. Can you hear me yes, who's that yes I'm trying for the first time? Can you see me so I figure the same thing: okay, Monica you are, we heard from Sydney. You can see their names right, yeah, I'm, looking at William click on video and click on your microphone. Okay, we got you we see you. Can you hear me yeah, just one second, Monica, hey James, take your microphone off! Okay! All right! James! Hear me! Yes, lifestyle! You know, use the slide into a bohemian kind of like stuff morning. Yeah you're on yes, I, know a good morning thanks so much for including me in this meeting today. I'm really happy to be here great. Thank you, James. How you doing good can't complain? What about you? Yeah I, have to say I'm doing pretty. Well, you know a lot going on, but you know good stuff. You know hey who says that was Verner over there right and I. Think that was a furnace yeah! That's right! We have altered my Alton okay, Joyce I saw you from me. Oh Joyce is here? Okay? How are you good Veronica welcome good morning, everyone yeah okay, a lot of people 80 people so far and we I love it. We are still here, thank goodness so I guess I'm! So wait. You know just a 10:05 to see and then we can get started. What about my phone? People do. I, have a liver, you're supposed to call it and Florence the morning we have an interview tomorrow. Somebody said Verna. Yes, that was me: William, hey, mer, hi William. How are you I'm very well? Thank you said you hear yes the morning I'm here. Okay, that's you with the last three numbers, one: five, yes ma'am! Thank you I say a chickens on Isaiah. Are you there? Okay, I, see you I, say: okay, you're on mute, but good morning, I say good morning good morning: okay, guys I'm hearing okay, we got 21 people, so that's a good start. So I just want to welcome everybody. It's a community board sensing the task force. We are into June already so I'm almost well. We are after year after year is finished, so we got to check out let's what we gonna do for the next after the year we halfway there so I, don't know I, don't know if we like this race, a so we'll see, but we are all here we made it. Thank goodness thank God. So that's one of the things that we should be grateful and proud of. You're gonna have two guests. Today: Isaiah Jenkins he's from the mayor's office and I've spoke to him about senior related issues. So I welcome his answers and his comments and also William from Harlem abacus for seniors and our task force. Members he's gonna talk about our next step and what the future, what the outlook hold. So thank you for that. Mr. Hamer, so I just want everybody to just like introduce yourself. I'll just call your name, because I know we have different boxes here that we see, and you could just tell us who you are where you from and then we could start so in my next box. Next to me is writer right. I could just say with your from I good morning again. Everyone for Ana Arthur with did New York City Department for the aging. Thank you very aren't: 16 Fort Washington Inc. Thank you! Colette your army. We gotta go to the next name. Okay, I go to okay. Now she is that I just talked to flowers just cause. She said she can't get through some with the phone numbers or something: okay, all right: okay, well: young you're, next William, Hamer executive director for Harlem advocates for seniors. Okay, I see you Danielle way less when I think she's our guest, so William, so we'll get okay Danielle! You could introduce yourself hi. My name is Daniel way. Summa care consultant at the Alzheimer's Association in New York City chapter okay, thank you, James Oh, James, O'neill, International Federation on Aging. My microphone is needed. How come that's happening here mara? We can hear you maro. Okay, you got a voice. You got a hit, something we doing introduction so I tell you when I get to you, go ahead: joy, Thank, You, Joyce, Veronica, I, mute yourself, so you can introduce yourself hi good morning. Everyone Veronica Noelle regional manager at emblem health, neighborhood care in Harlem, Thank, You Alton. We miss you alternate to dis yourself. Alton weeks, combat Navy, vet and columns veterans advocate Thank, You Meryl. Now you viewed, it could do a mute yourself and introduce yourself alright, we'll get back tomorrow, Linda Jones, okay mo you introduce yourself now. I can't hear you, okay, we'll get back to you Meryl. Can you hear me at all Deb? Yes, yeah, okay, well, Carol from the seniors and I'm so glad to be on this open call. This morning, all right, Thank, You, Linda good morning, all Linda Jones today I'm, the director of thank you. Thank you. Shattuck. Is there setting your muted, yes, Shattuck Mitchell district manager, Manhattan Community, Board Tim? Thank you rich richard almond, ather brando senior center. Thank you, doctor Thank You Donna. Where am I? Okay, this Alan there's Alan. If you're there, how could you a mute yourself I'm here with Keith Allah Allen director, the Hamilton green senior center? Thank you that Lindsay at agenda duce yourself, Valencia, okay, Valencia you're, me no say it again: I'm Valencia from Ryan Benjamin's office. Thank you very much, somebody with a phone number that ends with seven to two Monica. That's me, Monica Debra I'll get my computer to work. I'm, a-saying thinking, I, don't know how to operate this one as efficiently as the one at Kennedy Monica water outside director for sent to Harlem senior citizen, centers, pink, Thank, You, Monica, okay, I'm on the page, - did I get everybody. Okay, I'm with somebody yeah I didn't call Sydney. Are you there? Yes I'm here? Thank you so much Deborah and good morning, everyone, a Cindy Moy from pescetarian Senior, Services, PSS, Thank, You Sydney. Thank you. Okay, it's anybody! I didn't call, okay, so I say yeah Isiah! Yes, okay, so I said you are our first guest. Could you tell us where you from and some of the questions that we talked about was senior related about the air conditioners about the laptops and just about senior stuff in general? So I say you got the floor. Sure. Thank you good morning, everybody. My name is Isaiah Jenkins I'm, the Manhattan borough director for northern Manhattan, mayor's office, and so in terms of senior resources. Right now the two big ones are the air conditioners and the tablet the air conditioners. So we've already given out over 70,000 air conditioners and the way that the air conditioner program works folks cannot apply for the air Guzman's. So that's a big thing folks are asking you know a lot of questions about how can I get on the list? The list is been de listed, a predetermined list and it's being built from ACC's that deal with seniors who are low income, so cases with HRA with NYCHA with DIF to programming. Those are the easy season that would identify the seniors who need the eligibility and then eligibility of those some criteria based on things like income, and so those agencies who already have those folks on their list because they interact with them, see programs. They are reaching out proactively to set appointments with folks so that people can come in and install the air conditioners tablets work in pretty much the same way, the only big distance between the tablets and the air conditioners. These tablets are only for tonight for seniors, so night does the work of reaching out to seniors in the complexes so who are listed on the leases and all tablets in terms of other senior program, I mean that supreme those are pretty much the big major ones, but if folks want to see any other types of resources being offered to seniors I'm happy to take that information and follow up with other agencies, so I understand, I, say: yeah, oh I understand cuz, my internet is getting low, but you're gonna see me in a minute. I understand I say it that you have to have a certain group that you probably care for first, and we understand that you just can't say blanketly everybody. You have to put try amateurs there, but I also understand that they are seniors. Who are there are seniors who low income and maybe have a dollar more than what the government say. You know that you make that you can't get into a program, but we still low income pension, so nothing is going to raise and we still need help. We still could use Macy's these locally used laptops in this world of isolation. So how do we I know? We can't change the parameters right now, but there are still hundreds and hundreds of seeing is that still need help, but ACS and that's ops and stuff like that. Don't prevail that don't really qualify because we make a dollar over with the income level is. So how do we do? You have like another list of a backup list, a plan this where we could be a part of that or just that it would always go to a certain group another. You know- and that said yes great question and you know we did talk about how seems to make a dollar over the limit or excluded from something, but that doesn't mean that they don't need the resources well and I've been advocating for them to expand on some of limits, especially income limits and raise those, but as of right now really a lot of it due to the financial crisis, the city and they're not expanding those thresholds yet, but we are still advocating for more because we're hearing from we're hearing this from seniors from Harlem Queens all across the city, though we're still working to see what we can do, can I ask a question: I, say: we've called hundreds of seniors among our three sensors, we've, probably called close to nine hundred seniors and many of them eligible, but we're giving a very surprisingly high percentage of seniors for whom the air conditioners are not working properly or not installed properly. So the biggest problem seems to be that the water, the condensation I, assume flows back into the house and they keep calling us back us at the senior centers I mean back saying it doesn't work, so I would highly recommend that you have the vendor give number to the clients, because we're going in circles calling 3-1-1 to get the company to make the necessary adjustments. Okay, I'm just taking some notes. I'll, definitely follow up with folks to make sure the air conditioners are installed properly and I. Think that's a good idea, leaving the contractors contact info with the seniors for follow-up because yeah we don't want to patent Mountaineer Debbie. Thank you! Hi Debbie, yes, Isis, William, Hamer, so hey yeah, I'm, very troubled by some of the conversation that I'm hearing, because basically it seems like everything is targeted to nature my seniors and there are a lot of seniors in our community who are not living in NYCHA who still qualifies, who are not being reached, and the fact is that it just seems like there's a lack. There's this tunnel vision and I mean I. Think that the certainly night you folks need services and support, but you know the broader perspective that I don't ever hear coming out of City Hall has to do with the broader community. It's always nicer. It's always you know the low-income senior or the low-income, older, adult and I'm just wondering whether or not this is an issue that we might want to try to raise to another level, because so many folks are being excluded and I understand the financial crisis with the pandemic, but money can be found. You know if there is a commitment to really see to it that you know we can reach more of our senior population. Cuz Nigeria is not the whole game in town. That's right! You know so I'm just wondering if that's something that community boards and others might want to take a look at and Isaiah you on the call to see if that could be a conversation, because I, don't think anybody's really talking about it down there at that table. You know because it seems like everything that comes out is just really focused in one direction. This is Verna. This is Ron I. Just want to quickly totally in agreement with what William said, because I receive a lot of calls from the seniors about the a condition and the tablet, and they are not in NYCHA residents and have no idea what to tell them, because, based on the fact that it's bit towards the nature, residence I cannot tell them all. Yes, you Paula fine, but you can get it because you're not in an item building so yeah. It is troubling because that's you know concerned about. It goes a step further because it also isn't reaching everyone consistently. An item, that's correct. So, for example, I went into the central location at 120, West 140th on Wednesday and the seniors from the building came and spoke with me and said that only a certain percentage of the people in their building have received either air conditioners or laptops. The majority of them haven't even received calls right and I. Think that's also pretty consistent. I mean you know, I think we all know the kind of drama and chaos that occurred with the food distribution program right. So they're people still waiting to get called to get food right now. We're talking about you, know, laptops and we're talking about. You know. Air conditioners and people are waiting to get a call who's following up. You know, what's the what's the plan of action, you know what's the process, you know if people aren't getting called and they're not being reached, even those who are part of DIF durand, nature, yeah, so yeah, it's just a problem, so I can begin to address that I. Think everything you said is super valid I think we do need to again. We do need to expand the pools of people that we were able to offer these services to. But unfortunately you know just like the majority of city services. When resources are limited, we do need to target folks who, in our view, are the most in need, and that's always going to boil down to the lower-income folks and granted I think the threshold for this. These programs, in particular, are a little low, but you know for a lot of these programs, especially the get food program. These programs really didn't exist before and we were like building entirely new systems overnight. So you know I've heard a lot of reports of particular seniors and buildings who didn't get a call or nobody reached out to while the neighbor was offered the tablet and the air conditioners- and you know none of I buy alongside I, can't say that any of the systems that were working with picked they're definitely not perfect. They definitely have their faults. I think the people doing these jobs do are overlooked folks at certain times, and that's why I want to offer myself if you have knowledge of seniors who live especially to the United facilities, who have it can offer the resources, please feel free to. Let me know where those seniors they have identified. Those seniors to me and I will follow up and be sure that they reached out to and I wanted to say the exclusive focus on Knights or residents. There is a lot of that. A lot of programs are made available. Your rights who nicer residents I've been talking with them about expanding the tablets outside of NYCHA folks, but one thing that they've told me is that the city has given out a Guinness world record amount of tablets between seeing your tablets and tablets for the kids for remote learning. The tablet supply is really running thin, so I understand that there is a need and that need is always going to be there and we're always going to work to meet that need. But I can only speak to where we are right now and right now. We can only offer the tablets to 9:00 to seniors, and we can only offer the air conditioners to seniors who make under certain income threshold who arm have been touched programs between HRA, dicta and nature. All right, thank you I, say I think Donna Gill. We want to join a discussion. Yes, thank you very much for joining us and I have some questions. First of all, who make made this determination, and it seems that there are a lot of seniors that are not being addressed in the situation, so I think we need to know where are these discussions and when can we join because, obviously they're not enough people in the room or any your representation in the room that goes beyond NYCHA residents, and it doesn't speak to the senior at large. So if you can get information for us where we can join these discussions, maybe they can broaden their scope and take into consideration some of these issues that we're having right now. Thank you. So Deb can I just chime and I want to just give a classic example of what Donna is just talking about. I have been asked several weeks ago to be an advisor to New, York, City, Task Force on racism and healthcare disparities. You remember the task force that the mayor put together and they actually came and I did. I spoke to several people, while they were going through the process they actually put out their report about a week and a half ago and I was sent a copy of the report that came out from the city and read the report forward and then I said, there's something wrong here and so then I'd kind of flip through it from the back, and you told the taskforce report, if you ever did a chance, take a look at it does not have a section in it exclusively addressing the issues of older adults, everything from crime, criminal justice, it has health, it has education, it has youth, but not a section that deals with seniors and older adults. This is the major City document that came out. I actually called and complained about it, and you know there seem to be some chagrin on their part to the fact that you know they really didn't single out seniors and I said. How can you house possibly have a report like that in this pan climate, with the vulnerable nature and susceptibility of older adults to all of these issues which all intersect with racism and healthcare disparities? And you don't put a complete section in that report, and so that's - Donna's point. You know I said to myself who there could not have possibly been a senior representative at that table. I, don't know who was on that task force, but you know to have a report coming out like that. It just spoke to me and said well who made up that task force and a loud substrate report to come out without seniors being addressed. All right, that's good! I! Don't get it! That's -, hey Murph! We might at the table right so being made there's some time. We are cut out of certain decisions and stuff like that, though Isaiah I'm sure you would get back to us as far as we already had this conversation me and him during the week about senior issues when I invited him to come to because I want everybody to hear. What's going on, I also asked him if he could be part of our committee. Well, you are there I'm sure here, I'm Sunni, okay, I also I told we meet once a month. If he could also be a part, he said you wouldn't what he can, because we need to know what's coming out of the mayor's office. We need to be a part of the conversation, so these are the things that we are that we will do so. Thank you, everybody who William burner Donna. Do we have any more questions? Father, yeah, I, just have a quick question is Lorna I said: do you know how many tablets have been distributed? Thus far, hey Myrna I do not have that for you, okay, thanks. Okay, thank you guys. Any more questions for Isaiah, okay, I say we're gonna fight you back cuz. The conversation. This is gonna, be a continued conversation that we want to have because it's important, oh one, other thing up there and we talked yesterday. We were at a meeting also the community for 10, and somebody mentioned the Moose that was hanging on a tree at Marcus Garvey park assassination. So could you tell us about that? Please? Yes, so the latest is again D, so the NYPD. So let me start from the beginning for folks who may not be aware on Tuesday, a passerby found a noose hanging and I believe was the fire tower at Marcus Garvey park, and the NYPD was called to the scene. The NYPD investigated. Their final determination was that the noose was left over from a construction project which was completed in October of 2019 is that the noose was being used to hoist materials to the higher locations and they just never removed it. We are myself and some other city hall. Folks we are pushing for more of an interim more of an investigation. It seems a little suspicious and we've heard from several folks that- and you know folks on this call please feel free to. Let me know if you've ever, if you've passed by Marcus Garvey park and ever noticed a noose there since October, but we are pushing the NYPD to do more investigation and also the governor has weighed in on the noose and he's directing the State Police look into the noose as well. Thank you. Thank You si any questions about the Hat, so it's still under investigation, but this is what they came up with. So far was something left I'm a construction project. They did just I think complete the tower the bail I think up there or something so I, don't know. Let's see yeah, you had something no I'm just I'm going along with William saying because we have a lot of l, DS arm senior citizens is not in nature and they need a lot of help. So I go along what they are talking about. Okay, thank you. I actually got shot chicken you still there. Yes, I'm here. Okay Sachi had asked me before the meeting and we talked about it right now. Some of our meetings, the community for 10. Since we are on zoom', we have the capacity to go to face book life, so our meetings could be recorded on Facebook so and it would be public stuff that people want to see yeah. You know what we do and that's okay, because we are a task force amount of committee. I got handed guys ice. If you want to go on, Facebook lies, Facebook, live need, the public could click on community for 10, I, believe Facebook, page Shattuck, yes, and then they'd be able to just see the meeting. Yes so be open to the general public with object. I'm gonna be ours all right, so they would not be able to talk right now with us, but they would be able to see the whole meeting whenever they want till they have to do. Is click on so I said: I need to get permission from you guys if well them that you want to go public in life. I Deborah this is Verna. I on may have to get permission in that I'm, not too sure seen it yeah. Okay, that's why I asked to them, because I said I had yeah right. So we will talk about it, so it won't be Facebook life today, but we will talk about that end of the conversation. Okay, cuz I know some of them probably have no problems, and some, maybe so we'll talk about that. Okay, so our next guest and, like I, said Harlem abacus for senior and part of the senior task force members- and we talked about this too offline about what the next step will be for seniors. What our outlook will be so go ahead, mm-hmm well, all right! Good morning, everyone Deborah, forgive me a brief opportunity just to go over some things and I know that there are a lot of folks here who know a lot of this information. I'm gonna, just kind of quickly summarize it, because I really am more interested in getting feedback and having some dialogue about next steps and I can just share a little bit about what we're doing as an organization, and so I'm gonna do that in five distinct, real quick areas, one is food all right! Everybody knows that right now. The issue number one issue is to make sure that seniors have food. Oh yeah and right now for me seeing all of what's happening across the country. I cannot even imagine why anybody in America would ever again go hungry because there just seems to be so much food available, but the key is getting the food to the people who need it, and you know one of the things that we've been able to do at the sites where we are currently providing supports. Is we've been able to tie into like four majors food distribution organizations? One is the world kitchen that some of you may be aware of the other one is the Food Bank Salvation Army Westside campaign for hunger, and you even have, and now you have the diff to get food program. So you know, we've been able to. You know, get our seniors and the people that we work with in the community tied into one of those distribution, resources and coordinate that so that they are getting those foods at the respective sites and I would imagine. Many of you are doing the same. The thing is that the food quality obviously varies, because some of these groups provide groceries. Some provide prepared, meals and some provide bulk food. You know staple food and so there's it's kind of a mixed bag, because sometimes you get seniors who don't want prepared meals, a senior will tell you, know: I, don't want nobody, bringing me a prepared meal, just bring me some groceries. Let me do my own cooking, because sometimes it gets a little tricky and but you know, I think that right now, the for food I'm not sure again, the issue is making sure everybody has food who needs food because the food is available. The question is identifying and making sure we, as a group collectively and within our community, know how to find those people- and you know- that's done through associations, your block associations- and you know, whatever networks that you have so that we can make sure that people get food. One of my big concerns and the big concern that we are now beginning to address with my organization at these sites is health and wellness. My concern is that I just have a real concern about the even thinking about seniors sheltering in place for the next three to five months and not being able to get out safely not being able to exercise and move, and we all know that is a recipe for disaster and that's a challenge for and I know. There are a lot of senior center providers here and I think that a lot of all of us we understand what do we do right now? Everybody is trying to wrap up and do virtual programming. Obviously that's what we have to do. What we're doing is we just had a virtual program. Last week with the Alzheimer Association, we had like 12 seniors on the video call. It went well but then the issue of who doesn't have a tablet. Who does have a tablet? You know who knows how to get on. You know it's, but again, you know many of us are funded to do this work and I. Think that's also one of the challenges that we are confronting at least I know we are as an organization. We now have contracts to provide work. Those contracts were sculpted before the situation, and now we have to kind of retool to figure out how we're going to serve and provide services to seniors. At the same time, you know, spend the money appropriately that we have been contracted to provide these services and I'm sure you know some of the Senior Center folks might be in the same situation in terms of just contracts. But again we are wrapping up. We are putting together a robust schedule of virtual programming. Everything from you know as little Fitness yogurt exercise. You know we wanted to we're getting ready to do a dance class online. We want to do some crocheting online, we're actually trying to put together with a couple of partners, a virtual dance party, okay, online and we're also looking at as an organization, because we have a little bit of flexibility, we're trying to take a look at even trying to do some online stuff in the evening so that you know we can kind of just come in and one evening you know and just kind of do an entertainment program for seniors on a Friday or a Saturday night. You know something different, then you know what we do sometimes during the day, but again I mean the box is wide open in terms of just what we can and cannot do, and how do we actually do that and I think it might even be very helpful for us to try to partner more to try to do some of this stuff collectively. Obviously, the issue of Technology raises up. I mean Isaiah talked about the technology issue. That's a big concern, because so many seniors don't have tablets, and many of them will call and I know that there are a number of people on the call. It's pretty much, not the same. If you're trying to do a program right, I mean listening to a meeting is one thing on the call, but if you're trying to do a program- and you want people engaged, then those who don't have that technology class mm-hmm that tablet it kind of leaves them in the lurch right. And so how do we address that? You know what do we do and are there any other thoughts and strategies about that? And then the other thing is just that internet access, yeah I mean you know how many seniors have internet access. So even if you get a tablet, you know who's gonna pay for the internet access. You know, I mean most of our notes and older adults are on fixed incomes right, so they don't have all of the exclusive high-end cable stuff. You know so that that's an issue and then, as we heard earlier, that issue is being dressed. You know and pretty nicely for people living in nature right. So nice is getting the tablets they get in the air conditioners they put in the internet service. You know you know, so all that's being done because they know that is not available to a lot of folks. But what about the others out here? Who we are trying to engage in support? The other thing, too, is and again I like to get some feedback on this particular perspective is that I want to get I was talking to a group of my senior committees, the other night the other day and everybody said well, can't we do a walking Club. You know, you know what the weather's nice can we get seniors out and we fight figure out a way to do it. Walk in the park safely. Is there some way we can isolate a section of the park? You know during the day, so that is only exclusively for seniors, just like they've done with supermarkets and banks, you know so that seniors can get out and take a walk, do a little exercise and maybe even have some programming outdoors. You know with people safely social distancing and wearing masks, you know, but one or two people at a table, but I think we've got to really focus in on that, because I am so frightened and concerned. I know of seniors right now who have not been out of the house in five months five months. They have sheltered them because they are petrified one. They understand if they can't, if they get contact with this virus, for many of older adults who are vulnerable, it's what it's one and done. Okay, some of us we might have had it, we might contact it and we might be able to get through, but some people is going it'll be one and done so there's they have every right to be concerned, and we have every responsibility to understand that you know if they do go out and if we try to do some type of outside program- and we have to obviously put some things in place that would isolate that group comfortably so that they can at least feel the sunshine and finally, I would just say you know we worked on the food we were working on. You know a lot of other things. Let's not forget that our older adults need joy and laughter, they need joy, laughter and engagement, and we and how do we do that virtually the best we can? Are there any other ideas out there? What are other people doing? This is a time when I think we all need to really be sharing ideas, collaborating and figuring out ways so that we don't have our older adults sitting up in these apartments throughout the summer and maybe even to the end of the year, if they don't find a vaccine, and so that's what I would like to say, I think next. Steps for us is real collaboration, communication idea, sharing and partnering, because there's a lot of stuff that's going on and you know we have some, we have a responsibility at least I feel it I'm sure many of you on this call feel it. So you know I'm gonna, stop at that point. You know I just wanted to give an update on some of what we are doing as an organization, some thoughts that we've been working on and challenges that we've been confronting and just make a pitch to this group to say you know, hey guys, let's think out of the box here, you know this is this: is gonna get I, don't want to say worse as I'm, not a pessimist, I--once I'm, not gonna, say it's gonna get worse before it gets better, but it's gonna be a minute before we have any large group gatherings of our older adult population. That's it well! Thank you, William! Thank you! That's emotional person with us the different items that you talked about, so it's food, hmm I, think basically there's a lot of food all over, but you just have to know where to go and where to get it. You have to know that the public schools you see have breakfast and lunch grab and go. You have to know that the all shoppings and other places have food I'm outside of a lot of different developments and agencies. That's giving away food and people are there with the shopper cards and getting the boxes get produce so, but you have to know where to go, but in our area there's plenty enough food. If you could go out in this also, if you call 3-1-1 know about you know, get food program. If everybody can get food program, they do home deliveries door-to-door. You know in the senior centers I think they still. They hook this up with different other places to get food delivered, mm-hmm, so I think that's just wonderful, mm-hmm, I'm, sorry I just want to quickly say something with regard to the get food fabulous presentation, William I, the get food program actually is run by the mayor's office and not the Department for the aging I just want to clarify that, because I know people senior still do call because people are telling them to call us, but the food is literally out of our hands. We still try to refer them to three one or the other thing. If they're a member of a Senior Center, we urge them to call the Senior Center and they the Senior Center, would assist them in probably filing the complaint or making the necessary arrangements. I just wanted to say that I think there are some of the food problems that still has dictor name on it, but this is what we were told: okay, yeah good point right. So that's good yeah text, that's I'm, still a major problem that I know: I've talked about with other seniors, some have computers and laptops, and they don't know how to work it right say. Even if you give somebody a laptop or whatever and give them Wi-Fi, you still need somebody to show them how to train. You did training me and I know what the center is most of the center's had computer classes and some people took them and some people said nah, that's you know we don't want it well, I'm sure that everybody wish that they had some type of training or classes in computers, because that's what we're doing now, that's what the world is today, so I'm still helping people. My phone I'm talking oppressed just do that. Do that I've been it's time, gonna be for the first time because they didn't know their new phone could do FaceTime and it's running you can see each other, so we still need training on how to use these devices once we get them anyway. Zoom was new to me. I didn't know some until this incident into the fire right. So a lot of us, a pajama, bottoms I, know that just see what everybody got on the bottom I know: I'm, sorry Deborah, just one is there something quickly? Neither I correct me if I'm wrong, because I got the impression that oats will be training, the seniors who get their laptops and it should be getting one year of internet service free. Yes, this one year and after that, then what but I just want. You know the senior soo who eligible for the laptops and I've received them will be get. You know, they're probably started already a training from oats mm-hmm. Okay, that could be all of the tablets, are internet enabled. So you don't need a you, don't need to have home internet. They really come internet enabled just like the remote learning lab. Now they internet ready. All right, thank you know so can I just make a comment? No I want to add to the conversation on technology and then I'll make a comment on get food, but first on technology. So the vast majority of our seniors, a don't, have the technology. What they do have is a phone and the majority of our low-income seniors have the free-foam the limited minutes, limited use, phones, and if they don't use them, then they have to reapply it's a whole complicated mess right now. So what we're finding is the only thing we've been able to do technologically so far is conference calling because since they do have phones and do know how to use the phones we're linking together between two and five seniors to have conversations with each other, but I think it's a serious issue that I really wanted I, say and Verna to hear in terms of how extremely limited knowledge is and the actual technology resources of the seniors that we serve. So that was my technology piece, so supporting very much what you're saying William and what we're all saying about. You know yeah. It's nice that we're targeting the low income, but the lack of communication is a mental health problem across the board. I also want to comment on get food and in a few sentences, I have tried to get myself out of the get food program for two months and I'm still getting food, so the entire authorized enroller ability to communicate. We get food. That complaints mean anything doesn't seem to be working because I'm using myself as an example, I, never replied, forget food, I didn't want get food, I've been begging to be off, get food and Here I am two months later still getting food. So when the seniors complain about it, all I can say is yeah I know, I mean so I think it's really important to identify that we're using resources poorly and that we need to be more careful and more thoughtful about what we're doing, because there are people who are on the list to get food who don't get it, and there are people like me who are not on the list. The get food list says I'm not list, but it's two months and I'm still getting food, so there's definitely a gap and how the actual systems are working and I. Don't think that actual gap is being addressed. Thank you for anybody else want to comment on Hamer's. What are you talking about? What we have hema talked about. I, look forward to all the virtual activities, he's planning, yeah I'm, trying I'll tell you I'm working on it. You know I got a little money here to do it. You know, but it's it takes a little. You know this is all new drugs right. Also I think you can also if we want to share two different things, because I know some of the senior centers they have physical fitness every three days a week. We do a regular schedule zone exercise. That's great! That's three days a week. We also do a lot of art classes. We also I know one of the classes or one of the senses. I've Shakespeare have the Opera and different things storytelling life stories, so there's different people different types of topics that they have already. You know now, as we go through the summer and you're doing virtual planning, if you want to include the District Attorney's Office for any presentations virtually. That is such an easy thing for us to plug into so. Please keep us in mind. It will be more than happy to do virtual presentations. That's part of our program, -. We want to continue our education and informational workshops as well. So certainly we will reach out to you Linda to get you on that schedule. Perfect. Thank you, yeah! That's the Sidney bear city boy: Sidney. Are you still there? Yes, I am I'm. Sorry I was muted I. Okay, you're amazing I know you have a lot of programs and stuff. So maybe you give people an idea of what programs you have virtually yes, so no thing, Thank, You Deborah and you know Thank You William for all of the virtual programming that you've shared your Center. You know which is very exciting and we have started a while ago, the virtual dance party, every Friday at one o'clock and it's very organic. It's just basically a Spotify list and people were just calling with requests. You know so I've got a lot of Aretha. Franklin I've got a lot of the Prince voice. You know you know different. You know types of international music, you know R&B soul, funk you know, and it's great because with Spotify they're sophisticated algorithm gives you songs that, let's say, if you put in a certain title or artist, don't recommend songs based on your playlist. So they say you know if you like this or maybe they'll enjoy this you know so it really makes for a very interesting, a playlist that differs from week to week. That people, you know, can, you know, add to- and it's just wonderful and different music experience every Friday that people look forward to start off their weekend. But, aside from the virtual dance parties we've, you know like William mentioned, we also have, you know, exercise different types of whether it's a chair or aerobics meditation. We do health topics like you know, and it could be Covid-19 or not, but a lot of it in this climate is a kovat related specifically for older adults on. You know how to deal with the social isolation, vision and aging a lot of the stress and stress and anxiety. So you know just too icky older adults. You know healthy and mentally engaged. You know like during this pandemic and also we've had you know: arts and crafts classes, so how it works. Is we if we get at least ten people, then we partner with it could be like an insurance company that will sponsor the event. They will detonate a drop-off point at a center where and it could be anywhere like in you know, Manhattan or the Bronx. You know a center, that's convenient to where a lot of the directors and corners could just go to. They will drop off the supplies. So let's say you know, because I work with ten PSS centers in Manhattan and the Bronx I'll ask them one so who's. You know interested in a butterfly painting class and if I get a lot of interest in, let's say Harlem I'll, let the sponsor know well. Three of the centers are interested, and here are here's a participant list for each Center, and it's all in you know Harlem, you know. So we have eight people interested. You know from PSS farm Fred, seven people interested you know from PSS King towers just so we would have PSS King towers, being decentralized location from where all the members could not only pick up their weekly food pantry box, but also pick up their supply, a material box for the butterfly painting class. So a lot of coronation, I class that I wanted to pick up supplies pranks, brushes and obstacle what we gonna play so we're gonna do a butterfly painting. Thank you sitting to keep going. Yes, absolutely and so I would email everyone, a zoom link on when the actual butterfly class will take place. So it's two different dates. One date is for the members to pick up their supplies and the second date is for the actual zoom class, where you could follow along with the instructor online, because you already have all your materials right, but you just want to make sure that the day the members pick up their supplies is also the same day as the pantry box or any food that you're giving away just so they don't. The members don't have to make unnecessary trips. So you know everything is all in one box, whether it's their absentee, you know ballot or it's the census forms. You know we or any fliers we print out and we put it in the box just so all the members have it all in one go, and we just try to be efficient too, because we wouldn't want. You know that the members you know just keep going, you know in and out unnecessarily I just wanted to say you know what was just mentioned towards the tail end of your comment. Cindy, which is very good, is the issue of the census that seems to have been lost in all of our conversations, I mean the census has been delayed, I think they're going to be trying to wrap up over the summer and September. But you know I mean we've got an election next week, I mean I, don't know how many people, even you know, I'll, go to participate in that I'm sure that's gonna be really dal, but the census is still an important issue and the question is, you know: can we collectively? Are we doing things individually to kind of wrap up interest? Because right now you know interests around. The census is like taking the backseat to do everything not only Cove in but the black lives matter, and you know the cultural changes going on, but you know Cindy just mentioned the census. I mean, then you know what are we doing about the census in our community? We know yeah William, some of the food away places they put fliers in the bag. I know when I picked up I shopped it he hasn't been in there to remind people, don't forget the census. We also we have a health or wellness committee here in the neighborhood and we put up flyers in our buildings on every floor, reminding people about the census and it's not too late and every voice counts. I. Think the last time Nina White was with us from Assemblyman Altera's office. I also think the PSAs they're running are excellent. I've, seen more of the PSAs running on the major networks. The last time Shinnecock and I had seen previously right. I just wanted to say that it's been extended to October 31st. So that's a you know a date that we need to. Let people know because most people I've spoken to think that it's over. They don't realize that it's still time to William Haman. We definitely push the census and early voting and absentee voting as well. We push that very heavy and we don't encourage people to wait to fill out their census. We want them to do it now. The remaining of the please fill out the census, because we get a lot of funding. We get to senior citizens program and a gravities fund comes from the census data, so we always push for the census. That's really big and representation, because in 2002 in from the census data, we ended up losing two electoral college votes for a presidency. So now, instead of us having 31 electoral college votes, we now only have 29. So that's really important that we complete the census and I always tell people, because some people are afraid to fill out the census because they're thinking, if they fill out the census, the management office will know how many people live in their apartment. So we just have to let them know that this information is confidential and it's literally easy. It only takes about ten minutes to complete and it's ten questions. So please encourage people that you know so, please fill out. The census is important so and so vote. Yes, that's correct right! That question was: yes, I, think you do that a presentation with the census at one of the meetings that yeah Brian senator Brian Benjamin's office. Yes, that's correct! Thank you. If anybody else who happens to close up or talk yet who we have right about that and then also you know, our office is open eyes helped. You know some seniors fill out the census over the phone, so we're available we can fill out now what's new again about this census is that you can fill it out online or via the phone. So if you have seniors who might feel uncomfortable and filling it out on their own and just tell them to call our office two one, two three four one, four three zero and I'll put in the chat as well and we'll do it for them, and also and I, can connect you afterwards Deborah, but about furring Griffith, because she's been helping a lot of seniors at Fred Sam's to complete the census and I think she would very much like to assist esplanade on that front and then also their portion that you all had mentioned some in Taylor. Out of his church is also offering food so that happening day, Friday from 1 to 2 and that's on West 146 Street. So you all can you know, grab food there and I'll, throw it on in the chat. Yes, wonderful produce! Thank you. This is James. Ok, I'm, going to for training next week for the census, seniors in particular in Harlem, make sure that they fill out the forms and give them any success, as we can so I start training next week and I, don't know when we're actually gonna be out there in the field, but it should be sometime in July help people out, Oh Drive, that's excellent, J Ryan, thank you and for those of you who are interested in getting your kovat 19 tests. I did mine on Monday and receive the results, the negative results yesterday, and so basically, at any Health and Hospitals facility, you can get it free of charge and it may be a half hour and Shawn I, don't know whether we finally were able to help you not, but if not go back, there's never any very many people there at the place on 118th Street. Oh they fit me. They trusted me and my dad that day, I made a fuss, but no they trusted us and we always all came back negative. Thank goodness yeah! You got yours yesterday, the same day you got yours, so that was that was only two days only two days to get the results right. I justed at convent and on the blood test for the antibodies, and they send me the results of next day on my phone that I didn't have some antibodies. I was negative, so I am still susceptible to the fire. Okay, what you gonna do yeah so Allen, some carpets, how you doing thank you for allowing me to join. It's been amazing, listening I've learned so much I'm gonna be reaching out to several people for access like the art class and all of that okay heard about it as seniors would love that right and I mean I'm, not you responsible for content I'm directing the center. Yes, so thank you for joining us a long time coming, but I'm Gladys. Thank you for having me. Thank you. Do we hear from everybody Joyce? Are you doing we heard from new Joyce you gotta unmute yourself, you press them press the button Joyce. We can't hear you I mute yourself. Okay, we'll get back to Joyce near me. Oh yeah, we got you yeah. Thank you very good, distinct, ticketing, okay, and what is different right. Everything is very interesting. Okay, good I wish you guys were in Queens, because we don't have those services that you have in Manhattan. Okay, I'm glad everybody stayed well. Thank you! So Monica you still there. Yes, sir I'm, still here. Okay, so have everything going with you. It's been a struggle alone, trying to make sure that we keep up with everybody. We're constantly doing wellness calls and wellness checks, and now that I have the AC survey going out. I just want to say to everyone that does the list for the ACS come directly to us at the sentence from dista we have no control over who is selected, I, don't I, don't know how they come up with, who is selected, but they send us a list and they access to make these cold calls to the seniors and that's how we're doing in Central Harlem. We should be going virtual by the end of July we're going to try to implement all of our classes and programs virtually by the end of July I'm working with the private organization to get donated slightly use, iPads and tablets for seniors who do not qualify under the dista in the nature program, so I hope to not hearing something by July 15th from this organization, in terms of when the arm distribution of these iPads will start and with that, the determination will be up to basically me or the new executive director. By the way we have a new executive director central column. Okay, yes, did you say what I don't know if I can I can say at the time, but by next meeting I'll be able to tell you? Okay, hmm I, know Monica, you busy, you got four sites, so I know you have a lot to do. I know you tell them. You have a lot of meetings all day, long so I know you're, very busy, yeah Deborah a question for the senior centers in terms of the programs that you will doing these programs just open exclusively to people who are registered in your centers or the programs potentially open for anybody in the community who sees a flyer and who wants to click in. Can they get into that kind of class or how is that? How does that work for the senior centers? Well, William was what we plan on doing at Central. Harlem is we're going to use our website as our launching point? So if you log into the Central Harlem website, you'll be able to go into it in any class shoes of your choosing, so there will be open to everybody. So it's open to the community yeah, because I think one of the things I was alluding to is that you know the more of these types of programs if they are not exclusive to the senior centers because of contractual obligations or things of that nature, then more marketing and opening up to the community might just get more people engaged I mean, so we could be doing a service to more and more seniors who might just want to click in and join a class, even though they are not a member of the Senior Center or even my organization. Just in time that will come because I know some of my exercise class or one in particular that we have a couple of times a week. I'm started with like 10 people and then 20 and our internet is messing up. So we have no office overloaded or you know like what the problem is sometimes slows down. Mm-Hmm, we don't know if you have to get like a a big zoom. I know some. There are some free zones and there's some zones where you pay and I guess it holds more people, you're, I, guess freezing the presume only holds 40 people right. Okay, you've got to go to the next level, which is the Bible. Basically, you could then put a hundred people on right hundred. You have to go to the next level right exactly so right. So when ten, it would five. But that's more people comments it's breaking up. So, as you know, we're learning yes, how many people could get there? Is anybody I didn't Veronica? No Ellie you still there Muraki! Yes, I am hi. Are you doing for Annika? Well? How are you? Okay? How is your organization getting along with the stylist we're doing? Well, we've been home since March our sights still have not opened we're, hoping that they will open the ending of August latest beginning of September, but right now we're you know. It all depends on the we're. Colvett is when we do open, because we're making plans to do preventative measures. Unfortunately we're you know. Typically, we usually have all of our classes we're not. We are having well I, do have a bunch of resources for classes that were send that I can sent the group back to the Corps for some SilverSneakers programs and some other exercise classes that individuals can participate at home. We are looking to move some of our classes that we usually had in our site that were in person virtually or you know, we're just trying to figure out how to still keep the community engaged. I also wanted to send with the email I wanted to send some information on the services that we can still help with members and non-members. So, for instance, if anyone has anyone that is in need of snap is in need of any kind of state-sponsored programs has any food insecurity needs any kind of mental health services or social worker. We do have a social worker, on-site and they're, not exclusive emblem health members. So if someone does not have emblem health, we can still refer them over to our social workers and anyone that does have emblem house if they still are in need of any kind of customer service issue. Customer service assistance or to speak with anyone I'll be sure to include our direct number, which is not the typical call center number. So if anyone needs help, they can call that number directly and they don't have to worry about. You know putting in any kind of information or waiting on hold a live person will answer and we're just you know: we're maintaining and hoping to be back on site soon and working with people, which is you know, the things that we like to do was just you know, adjusting and working through it. I did receive a lot of information from everyone today. So thank you and I'm going to take the resources and information that I learned today back over it's my co managers, so they can share with their teams as well. Thank you for what I heard you have a question. I have a piece of information that I think everyone should be aware of, which is the dista has designated the senior centers that have more than 10,000 square feet to become cooling centers. This summer the City Department of Emergency Management has said that they will open if it's over 95 degree heat index three days in a row. They are not expecting to have extended hours. An hour are at 16 a Phillip Randolph site. What is 10,000 square feet and will be one of those sites. They will have limited number of seniors due to the social distancing, everyone will have to wear, masks, etc, and the city is planning on setting up transportation to other less busy sites if the sites get overwhelmed by number of participants for those of you that are also in Washington Heights, the arc Fort Washington Senior Center site at one 74th and Broadway will also be a cooling center site and I believe that you guys at Kennedy are a site right. No, not at Kennedy but be active. Louis will be one of the clear intent. I knew it was one of your one of your location, great Thank, You, Monica you're, welcome from Thank you Thank You fern. For that cool mistake, that's good! Thank you! Who didn't speak at Merrill? Are you there marrow? We don't have maro notify me. Oh I think fern has covered most of what we're doing most of what we're doing and most of what we're bumping up against today, Phillip Randolph Center, the one note I want to add. We recently posted a case worker position. If you haven't seen the job posting and think you might know someone I'll put my email address in the chat. Can you hear me back to you, okay, I'm, trying to keep this unmuted go ahead? Okay, so thank you! Richard. You have a case worker position available. Thank you. I think you sent it to me. I think I said. Thank you for sure. Okay, thank you! Okay, Meryl! Yes hi! Everybody I'm! So very glad to hear well the most interesting information today or we. Our wealth of information is correct. I've been giving out food at the Frederick Samuels center here on 44th Street and Lenox Avenue with Diane Blackwell and I, find that the food is wonderful, is tasty. Some of the restaurants I've come aboard like sisters on 24th Street, they offer Madison and the food is absolutely delicious. Our problem is getting something to drink. They were giving us those little cartons of juices for a while and they stopped and right now we can't even get water. So if anybody knows of any place that we can donate those little niblets of water instead of the big bottles of water because they waste them I'd be very happy to know that we had someone there on Tuesday. She came with a computer and she was doing the census for people who have not done the census. Yet it takes about seven minutes and I'm surprised. We had about 11 people to come in and have the chances done pick up a meal to go, and we had a little snacky food as my niece and call it and they were on their way and I got a great idea because lotta folks was like well. No I don't want to be bothered and was like be bothered, be bothered, be counted. Let's you know, let's all get in the mix here, and so that's really great, but I don't know. If the lot of these places are giving out food, are they giving out water? Are they giving out drinks? That's why I need to know right now. My second thing is I. Had a donation of incontinence pads about seven boxes of them and I, don't know anyone who really you know, uses them at the moment, but I think my greatest idea is to give them to the Senior. Center appeared near the out sailors, Church 146 Street here I think between 7th and 8th, and maybe they can use them. But if you know anybody that really needs some, it can use some please get in touch with me, because I've got pads all over the place now Thank You Meryl. Thank you for that, and thank you for helping giving out food. That's important in that snow. Just give me some water, Japanese water need water. I know they give out water active at the public schools when they give out breakfast and lunch. They give out milk and a cereal and a fruit group fruit, and then they give out sandwiches and water and juice and stuff so I know the school's, give out water and juice and beverages, but I, don't know. I can't recall of the other places before I have to get off the question about the food. Do some of you know what is the time frame for some of the food distribution programs, because I've heard that some of the programs are going to distribute through august's some may go through September, some will go until they run out of food. They don't have known losses and so I think that's something. We need to keep in mind that some of that that's currently being provided to seniors is going to run out, and if some of these programs you know terminate which many of them are planning to do or expect it to do. There is one program that we've now tied into, which is the food bank program, which is the state's lamento food program that is available as income-driven, but that program you know, will last for you know for a year and that that's an ongoing program that provides a monthly distribution from the food bank right. Some of the other programs are scheduled to end right. You know all the church stuff and you know so that's something I think we need to write your where what's the next step after that, yeah I cannot be sustained. It's right enough, I find out from the mayor's office Isaiah to about the programs that they have and when would they would be completed. So that's it. That's important, also started or the plan B when that is here was thank you. So all turnout, you, there I think alton less I'll turn. Okay, so anybody have any other questions before we adjourn. Yes, I just have two announcements Brenna. So when everybody gets around to it out of nose, okay, so I just I just want everybody to be aware of the project card program which is known as prep. Correct it's operated by the New York Foundation and from and funded by the Department for the aging, this transportation program, usually upper by taking seniors to wherever they want to go in groups, but because of kovat, it's not reduced to one senior car so to speak, and that is for a senior seniors who have medical appointments. They will get an opportunity to use the Fred program right now. The group programs have been temporary postponed temporarily sorry, and then we have our social isolation program and I know. That's like one of the major problems and I know. William had mentioned that in terms of the seniors being in their homes alone and in an effort for us to and amplify our social isolation program, we have a public service announcement outside there and we get it quite a bit respond, but I just want to take a few seconds to play, so everyone can hear it and, let me know I would forward the arm fro the link Nebra. So tell me if you can hear it properly. Okay, you can do something about it in just ten minutes. That's right! Ten minute phone call to an older, New York wonders, share a story, a recipe, a few moments, they'll both feel better and here's an idea you may enjoy these calls so much you'll want to do more. I'm a friendly visit volunteer call to one to EG NYC, see how good it feels to share a ten-minute phone call with someone. This is lin-manuel, Miranda call - and to aging NYC. Today. This message is brought to you by the New York City Department, for the aging, that is our PSA I, don't know if you heard it yeah, we heard it okay and the link and you're getting in response. So that's a good thing: okay! Berta! Thank you for that. Okay, anybody else before we adjourn did I beat everybody. Thank you guys, informative. This was wonderful. We usually break for the summer I'm community, but err which is July in August. But since we're having a lot of zoom meetings on the chicken community that we will continue, so we would have a meeting thanks. My guys, all right. Thank you thanks, Berta give it to me right now. So I can write it down. Can you tell it to me now I can write it down. Okay, everybody later. Thank you.",
        "summary": "But as of right now, really a lot of it due to the financial crisis, the city we're hearing this from seniors from Harlem Queens all across the city and they keep calling us back us at the senior centers That's a good idea, leaving the contractors contact info with the seniors for follow-up because yeah we don't want to patent Mountaineer Debbie I'm, very troubled by some of the conversation that I'm hearing, because basically it seems like everything is targeted to nature my seniors and there are a lot of seniors in our community who are not living in NYCHA who still qualifies, who are not being reached, and the fact is that it just seems and I mean I Think that the certainly night you folks need services and support.\nYou know if there is a commitment to really see to it that you know we can reach more of our senior population, so I'm just wondering if that's something that community boards and others might want to take a look at and Isaiah you on the call to see if that could be a conversation, because I, don't think anybody's really talking about it down there at that table.\nJust want to quickly totally in agreement with what William said, because I receive a lot of calls from the seniors about the a condition and the tablet, and they are not in NYCHA residents and have no idea what to tell them, because, based on the fact that it's bit towards the nature, residence I cannot tell them all the seniors from the building came and spoke with me and said that only a certain percentage of the people in their building have received either air conditioners or laptops.\nWe do need to target folks who, in our view, are the most in need, and that's always going to boil down to the lower-income folks and granted You know I've heard a lot of reports of particular seniors and buildings who didn't get a call or nobody reached out to while the neighbor was offered the tablet and the air conditioners- I think the people doing these jobs and I wanted to say the exclusive focus on Knights or residents Your rights who nicer residents I've been talking with them about expanding the tablets outside of NYCHA folks.\nand it seems that there are a lot of seniors that are not being addressed in the situation, so I think we need to know where are these discussions and when can we join because, obviously they're not enough people in the room or any your representation in the room that goes beyond NYCHA residents and it doesn't speak to the senior at large I have been asked several weeks ago to be an advisor to New York, City, Task Force on racism and healthcare disparities.\nThose contracts were sculpted before the situation, and now we have to kind of retool to figure out how we're going to serve and provide services to seniors At. The same time, you know, spend the money appropriately that we have been contracted to provide these services and some of the Senior Center folks might be in the same situation in terms of just contracts, we're getting ready to do a dance class online and we're also looking at as an organization, because we have a little bit of flexibility, we're trying to take a look at even trying to do some online stuff in the evening so that you know we can kind of just come in and one evening and just kind of do an entertainment program for seniors.\nOn a Friday or a Saturday night You know something different, then you know what we do sometimes during the day, but again I mean the box is wide open in terms of just what we can and cannot do, and how do we actually do that A big concern, because so many seniors don't have tablets, and many of them will call and I know that there are a number of people on the call, and you want people engaged, then those who don't have that technology class mm-hmm that tablet it kind of leaves them in the lurch right The other thing is just that internet access I mean you know how many seniors have internet access Even if you get a tablet, you know who's gonna pay for the internet, access You, know and pretty nicely for people living in nature.\nYou know in the senior centers The get food program actually is run by the mayor's office and not the Department for the aging I just want to clarify that, because I know people senior still do call because people are telling them to call us, but the food is literally out of our hands and I know what the center is most of the center's had computer classes and some people took them, and some people said nah I'm still helping people it's time, gonna be for the first time because they didn't know their new phone could do.\nOne date is for the members to pick up their supplies and the second date is for the actual zoom class, where you could follow along with the instructor online, because you already have all your materials right, but you just want to make sure that the day the members pick up their supplies is also the same day as the pantry box or any food that you're giving away I think they're going to be trying to wrap up over the summer and September You know I mean we've got an election next week, I mean I, don't know how many people, even you know, I'll, go to participate in that I'm sure that's gonna be really dal, but the census is still an important issue and the question is you know:?\nWe have no control over who is selected, I, don't I, don't know how they come up with, who is selected, but they send us a list and they access to make these cold calls to the seniors and that's how we're doing in Central, Harlem I'm working with the private organization to get donated slightly use, iPads and tablets for seniors who do not qualify under the dista in the nature program, so I hope to not hearing something by July 15th from this organization, in terms of when the arm distribution of these iPads will start and with that, the determination will be up to basically me or the new executive director a question for the senior centers in terms of the programs that you will doing these programs just open exclusively to people who are registered in your centers or the programs potentially open for anybody in the community who sees a flyer and who wants to click in Can they get into that kind of class or how is that?\nTo is that you know the more of these types of programs if they are not exclusive to the senior centers because of contractual obligations or things of that nature, then more marketing and opening up to the community might just get more people engaged I mean, so we could be doing a service to more and more seniors, who might just want to click in and join a class, even though they are not a member of the Senior Center or even my organization Just in time that will come because I know some of my exercise class or one in particular that we have a couple of times a week.\nWe are looking to move some of our classes that we usually had in our site that were in person virtually or you know, we're just trying to figure out how to still keep the community engaged So. For instance, if anyone has anyone that is in need of snap is in need of any kind of state-sponsored programs has any food insecurity needs any kind of mental health services or social worker We do have a social worker, on-site and they're, not exclusive, emblem health members If someone does not have emblem health, we can still refer them over to our social workers and anyone that does have emblem house if they still are in need of any kind of customer service issue, Customer service assistance or to speak with anyone : we're, maintaining and hoping to be back on site soon and working with people, which is you know, I have a piece of information that I think everyone should be aware of, which is the dista has designated the senior centers that have more than 10,000 square feet to become cooling centers This summer, the City Department of Emergency Management has said that they will open if it's over 95 degree heat index three days in a row."
    }
}