{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Full Board Meeting - September 22 2020",
            "publishDate": "2020-09-23",
            "shortDescription": "",
            "lengthSeconds": "2:05:22"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "AOyx0EBEdf8",
            "fillerWordCount": {
                "uh": 373,
                "um": 259
            },
            "readTimeFullTranscript": "70 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "park": 20,
                "school": 19,
                "week": 18,
                "compost": 18,
                "dollars": 18,
                "chat": 17,
                "work": 17,
                "information": 17,
                "money": 17,
                "state": 17
            },
            "wordCountSummary": {
                "school": 7,
                "students": 7,
                "work": 6,
                "session": 5,
                "park": 5,
                "funding": 5,
                "buildings": 4,
                "programs": 4,
                "money": 4,
                "budget": 4
            },
            "fullTranscript": "All right go ahead. I had to start the recording again sorry about that. Okay, are we ready? Yes, okay, great? I just love zoom okay, good evening everyone and thank you for joining tonight's School Board Community Board, three full board zoom meeting before we get started on our and we start with our public session, which is the first part of our meeting, and I'm going to ask that our first vice chair, Michael Moreno. Please explain the zoom guidelines. Sorry, so again, folks welcome to our meeting. So, as I mentioned earlier, Chat box is being used right now, mainly for attendance purposes. So if you are a member of the public just type in your name and any affiliation into the Chat box- and let us know that you're here we do this for attendance purposes. If you have any technical issues during the meeting and need some technical assistance, you can put that in the chat box as well. Those are the only two things that we're using the chat box for actually I lied. There's a third thing: we're using the chat box for if you are a representative of an elected official and your elected official is joining us. You need to let us know in the chat box so that we call them call on them and do not call you. So those are the three things we're going to be using the chat box, for we will not be using the chat box for back and forth conversation or side conversations about items that are being discussed. If that starts occurring, we will turn the chat off. We want to keep the meeting focused on the actual, visual and audio part of the meeting and not the chat box. Turning into another meeting other than that those of you who signed up to speak in public session, I will be moving you over to a panelist so that you can make your comment and then I'll move you back over when you're done. If you are a board member or an elected officials, rep or an elected official- and you wound up as an attendee instead of as a panelist just raise your hand and either myself or Linda will move you over into the panelist. I believe that covers everything Alicia. Thank you Michael, okay, so I just want to explain what public session is for community work for the visitors that we have that have never attended a community board meeting. So the public session is an opportunity for members of the community to address issues or concerns about our community and it's a timed respectively. Two minutes. We ask that everyone, please honor the two- minute rule so that everyone gets an opportunity to share and we can move the meeting along and so forth. Okay, so if you are a person that wishes to speak during our public session, you have to submit a speaker form on noon month by Monday the day before the full board meeting noon before full board meeting. Okay, that is when we submit our speaker forms and so that we have an opportunity to look them over and prepare for you to speak if at this time now we are going to oh and the instructions and the and the instructions and the form are found on our website. Okay, on the community board 3 website, so please go to the website and find the form. Thank you very much. Okay. Now we're going to start it off here we go first. Speaker tonight is Kelly overview Kelly over Bay hold on sorry. I have not moved her over yet give me two seconds: Kelly are you? Where are you Kelly? I saw you earlier there. You are okay, hi Kelly hi. Thank you for giving me a moment. Thank you, miss detzer. For getting back to me. I was not really clear what to do, but I'll just tell you. Oh, I had written down notes, so I'm going to have to exit out of the full screen, so I can see them sorry about that. Okay, I live in the east village. I live at 58, St Mark's place the building next door. To me to the West 56 St Mark's place has been very problematic in terms of really, in my opinion, egregious noise. They have several outdoor spaces in the back in the middle of the block, and we've had problems with this building over the years. Lately they flared up again, the people with the street level back decks and the outside space in the middle of the block are throwing really large parties, which I suspect it's possible. They may be charging. There are upwards of 50 people, they amplify music. This goes on for hours. There are also nightly gatherings on the roof, with kids, where they're drinking alcohol and screaming it's a noise problem for sure it's also a safety issue, especially with the roof and the parties and the gatherings there are no social distancing or mask wearing. So it's also a public health issue. In my opinion, we have been neighbors have been in touch and we're organizing we're getting contact lists together, we're in touch with an NCO noc. I do not know NCO officer from the police, Mr Condi and you know not much is being done, except that I just wish. I hope the board could maybe help compel helm management to hold their tenants accountable, because, especially in the time during Covid-19, when we all have to be home, it's just very stressful to have to deal with that and I'm also concerned, because, if mark's place has been zoned suddenly to be a restaurant bar, you have like 10 seconds. I would like to know if they've been zoned to be a outside door bar club, because if they have not that's the way, they're behaving okay. Thank you. Kelly Susan would like to respond to you. Okay, Susan, you're, muted, yeah, I'm sorry so Kelly is I just emailed. You know we'll work with you to follow up with the police. We actually just got a new commanding officer yesterday who have not met yet, but I will be meeting with him, and this is a frequent type of issue that we need to deal with. So we will stay in touch on this. Okay, shall I email you or expect to hear from you or you? Could you could not expect to hear from me, but give me a you know about a week, because I want to wait and to meet with the new commanding officer. Okay, do you mind giving me his name? If you know it off, I do not no worries, then. I look forward to emailing with you further. Thank you so much for your time. Thank you. Also kelly. Okay. Our next speaker tonight is Rocky Chin Rocky. Can you hear me? Yes, okay, great okay, I'm Rocky Chin, it's great to be here. The zoom format is very interesting and I'm a resident of governor gardens. We have a few of our members here on the Community Board and you probably know Grouvenir has six 21-story buildings that are on montgomery and Water Street, just acrosss from the Fdr drive and the southernmost portion of the East River Park and Pier 42.. We love this park and I'm sure all of you and the board love this park. So I speak tonight in support of the lower East Side Ecology Center's compost yard. I'm a compost, person myself, but this yard is a very important part. I urge Community Board 3 to pass a resolution calling upon the Parks Department mayor, De, Blasio, Ddc and orr, to ensure that the lower East side, ecology center be included in the East River coastal Resiliency planning process and the compost yard be included in all posted information about escrow and written into all escrow documents regarding the park. Escrow's moving ahead and we've been through a lot of agony over this, but at some point the ecology center is going to be forced to leave Eastern Park and it has no guarantee from the parks Department that the compost yard will be allowed to return to the park after construction. I understand that the construction drawings that are out for bid do not show a compost yard. This must be corrected. The lower East Side Ecology center has been a fierce advocate for and a dedicated steward of the East Road park for over three decades. The community compost program has served as a pioneering model for other groups to start food waste collection, programs, acrosss the five boroughs and acrosss other cities in the nation. The ecology center should be included in the planning process. Regarding the final design of the compost yard and working with the ecology center will result in a better final design, put the compost yard into the written documents and, let's work together to make for a better part. Thank you. Thank you. Rocky. Next we have David Block velocity. Thank you like Rocky. I want to speak in favor of the lower East Side Ecology Center's compost yard. I think if we take a step back- and I should mention- I'm a president- live in Hillman housing on Grand Street and if we think about why we're having to essentially destroy East River Park, or at least it has been decided that we have to destroy the park because of climate change and one of the ways that we can combat climate change is by composting, and so there's some. I would say in the fact that we it's okay Linda's taking care of it. So I think there's some irony in the fact that the compost yard is not currently included in the plans for the Redesigned East River Park. I think it's important number one encourage local composting and number two from an education perspective. So I think this is very important and would echo Rocky's support for this project. Thank you, David you're, one, all right. I believe the next person is Harriet Cohen Harriet. Are you on so I'll write his name hi? My name is Harriet Cohen I used to be a public member of the board, I'm a long time. Community resident, I fell in love with East River park, many men many years ago, when I tried being a runner at the fifth street track at the time it was near my home on East, 4Th Street running never became a passion, but walking has become a constant over the years. Now I live a little further downtown at Grand and Essex. My love for what East River Park has to offer has only deepened during the last six months and Covid-19 and I'm a dependent lover. It became my go- to place, or it is my go- to place for walks reading meeting up with socially Dis meeting up socially distrusted, friends and importantly, composting. I'm truly grateful for the lower East, Side, Ecology Center, or all that it has done to help our local environment and especially its composting stations. Now I carry my composting with me on my walks to East River Park. I want to say that it is imperative that the composting station currently located in the park within close proximity to the entrance at Corleas Hook Park, must become a permanent park when the when East River Park is rebuilt for coastal resilience. Composting is another important aspect of rejuvenation and environmental enhancement that is so sorely needed. Someone has said that composting is not compatible with a new park, but for those of us who live within its locale in public housing, the co- ops, the Mitchell Llamas and the tenement buildings, we know the importance of having this resource within proximity to our homes. We have an important personal relationship with the park and composting we are its Guardians community board through should urge the parks Department to re-, explore and reconsider the need to include an accessible composting station and Harriet. I hate to cut you off honey, okay, I know you. I think you got it okay, thank you, harriet, okay, our next speaker is Ellen Garvey, hi, hello. I am speak. I live in hillman houses and I'd like to speak also in favor of maintaining the composting station. That's now located so easily accessible to Corlier's the corlier's hook entrance to the park, and I speak both as a garbage bringer, because it's a very convenient place to bring to bring that garbage and to be aware to make ourselves aware of how necessary it is not to add to the burden of the city's already overstressed collection system, and this is one way we do that, and it's one way also. We make ourselves aware each time we do it of how important that circle of life is. I think, we've all become more dependent more aware of green things in our lives of the trees of plants than this Covid-19 season. Everybody remarks on it and this is a way that we and children also can start to see how that's built. Now I speak also as a member of the helmand yard, one of the three gardens along Broome Street that have reclaimed a trash area for flowers and vegetable gardening and just contemplative space. Much of that gardening is done with the compost brought from the composting center in the East River Park, and to lose that to lose that also incredibly necessary green space that we have that's in the especially if we lose the East River park. We need to be able to enhance that green space in our small, those small pockets of green all, so it's a short supply on the lower East side. So I am speaking everybody else. Rocky Chin made clear how that has to happen and Harriet Cohen already explained more about what the place of the Lord's psychology Center is. I just want 10 seconds as a user of the compost itself in the garden. Thank you. Thank you. Ellen okay. Next, we have Joyce Ravitz. Can you hear me yep? I want to thank everybody for at the Community Board and I wish I saw you in person. As I did many years ago, I have lived near the East River park for almost 60 years. Now I live even closer for the past 30 years cb. I want to urge the people in CB3 to have the city change the plans to include the lower East Side Ecology Center in compost, part in the plans for the new park. The short- term, thinking responsible for getting rid of the compost center should also be gotten rid of, and we should have the compost center. For all the reasons the last few speakers have spoken about. Thank you very much. I did it in less than a minute. Thank you! Joyce. Okay, Michael we had a person named Howard, Hui, Huey yeah. I need to move him over hold on one second, all right, howard. You should be able to speak now. Howard, are you there? Oh sorry, hi. My name is Howard Huey from nubc neighbors, united below Canal Street, and I would like to thank CB3 for their help in our fight against the borough- based jail near Chinatown. It's been a long fight. I know you supported us I'd like to thank your land. Use committee, along with Susan stutzer and the rest of CB3 for passing the resolution in joint league with CB1, it's been, as I said, it's been a long battle when we started this fight. A lot of people said it was a done deal and we're wasting our time, but it just proves that if you have a sound, unjust cause and keep on fighting, we can beat the goliaths in this, which is New, York City in this case, and we did win and we stopped the jail. So I just want to thank CB3 about it. Also judge Kelly in his ruling had mentioned CB3 and said that one of the most affected areas was Chinatown, which is part of CB3, and they should have been part of the community engagement. So I just want to mention that and thank everybody for the help. Thank you, howard. Okay. I do believe that was our final speaker for tonight. Okay, can you can you hear me Michael? Yes, okay, so I do believe that was our final speaker for tonight for the public session. So we are going to close our public session and now enter into our elected officials. Report Michael. Take it away sure. So. Folks, I'm going to be running the elected officials report again, if you're a rep, we're going to give you two minutes and we're going to time that as well, if you're elected is on just let us know so far, I've seen in the chat that we're going to be joined by Deborah, Glick, Brad, Hoyeman and Gail Brewer at some point. If there's anybody I missed, let me know: Senator Kavanagh is here Senator Kavanaugh awesome. So right now is there anybody on from the mayor's office, Andrew you're with us? How about public advocates office all right Luke? Are you with us from the comptroller's office? Yes, I'm here! Thank you so Luke Wolf City, Comptroller Scott Stringer's office. I hope everyone's doing well back to school is obviously top of mind right now. So I'll just briefly spend a minute speaking about our work in that capacity, which included the controller joining many community residents at the rally in March last week where he spoke about the need to make sure open school safely. The comptroller also released his 2020- 2021 back- to- school guide, which has a lot of really valuable information for parents and families, including on how they can engage in their school on virtual learning, health guidelines for multilingual learners, students with special education needs and that's available in English, Chinese and Spanish and I'll make sure to drop that in the chat, and I please spread it to the rest, your school communities, as I hope that is helpful for them, as they start this obviously challenging and unprecedented year. The comptroller also has been focusing on the need for to make sure we see homeless students. So there are a hundred thousand students experiencing homelessness in the city and we're pushing the DOE and the mayor to appoint a point person for the student population. So we can address the specific issues to them, which includes the unreliable internet and city, shelters, the location, accessibility of learning, bridge programs and making sure that, if students want to request a transfer to a school closer to their shelter, they're able to do so to make sure that school and education is more accessible for those families. Similarly, on the note of internet, the comptroller is pushing the same companies who offered the free internet to students last spring. To do so again, this fall. It's only becoming more important that students have access to internet at home and we think that companies should need to step up and do their part to make that a reality. Lastly, to end on a positive note, at the start of the Covid-19 pandemic, the comptroller announced a prevailing wages initiative in order to hopefully return money back to workers which was stolen from them or not properly provided to them by their employees, and we are happy to announce that we have returned over 2 million dollars to workers, Acrosss New, York City, and it did a number of different know. Your rights workshops for workers acrosss the city working with a bunch of community groups, so that's absolutely big when we have more work to do there to make sure that all workers get their fair share, but we're happy that we've been able to turn two million dollars so far. I will drop our back to school guide in the chat as well. My email address so, please feel free to reach out. If there's anything else, I can do to help you all thanks, Luke appreciate it: we're going to backtrack a little bit! Sorry about that and we're going to go to some of our elected officials that are on with us, so we're going to start with Senator Cavanaugh! Hey. Can you hear me yes great? Thank you very much. I realize you have a busy meeting and lots of speakers I'll try to be brief, but you know thank you for continuing to have these forums in this virtual world they're in and thank you obviously Susan and alicia for all your work and all the members and staff of the board. A few quick updates on local issues, the rutgers tube. We had a public forum a week a week and a half ago to discuss the mta's preparations for that. The work has now begun and you know we're interested if people are having there there's a you know. A website specifically dedicated the project on the MTA has we'll drop the link in the in the chat. But if people are having ongoing concerns about how that's working and how the you know, the mitigations and alternative routes are working. We'd like to hear about them. The MTA has been pretty responsive and again joined us for this forum, so everybody could hear directly from them. I did have the experience on the weekend of walking into a station and there was no, it was announced. There was no service at all. It was supposed to be part of the alternative for this, and I was very disturbed until I realized that was a result of the derailment, which was obviously you know a big, very disruptive thing. Unfortunately, you know not no fatalities, but a couple of other updates. I I'm glad to see so many people here supporting the lower East Side Ecology Center. I also support keeping the compost yard in the neighborhood, even if it can't remain on its current site and making sure that it is returned to the park as soon as possible when the park is completed and I've joined all of our local elected officials in expressing that very strongly to the city and so we're waiting for further conversations with them. About that. I also just note I that you know the jail decision which, as was noted, really does have a wider effect than the individual community board in which it's located, and I you know had made this point repeatedly that if you start a process with one site and you do this scoping and then you this, you know the scope of work and then you decide to build a different building on a different site and probably that all that initial work is no longer a valid basis. For what you're doing proceeding. You know repeatedly told the city that that was among the rule, at the basis for the judge's ruling that took the rare step of you know, void, annulling and voiding. Basically, all of the approvals of that jail site. So that's going to be an ongoing conversation, but I think you know it's an example of the state of the city rather really not not taking. You know, community engagement and their own processes seriously. On the legislative front, we had our second hearing on discrimination in the housing market. This was originally spurred by some very great investigative journalism in Newsday that demonstrated that there is very common and very bad practices going on in the sales market, among brokers and sales people of homes among island we've had testimony that makes it clear that it is not just a long island problem and is not just related to the sales markets, also the ongoing discrimination in the rental market. So we had our second hearing. Last week we took the unusual step of subpoenaing all of the people that were mentioned in the investigation, who declined to come the first time this has been delayed because of Covid-19. We had scheduled this as an in- person hearing in April. It had to be postponed, but we did have dozens of witnesses come. We went to court during the hearing to compel a few additional witnesses and we have our third hearing this coming Friday on this, and we do have a package of legislation that really is intended to strengthen New, York's statutory commitment to fair housing. I'm happy to talk about the details of that. If people are interested, the continuing on housing, the eviction moratorium, the Good News is, I think, since the last time I was with you all, it has been extended the bad news. It's only been extended until next Wednesday September 30th, as I think I've talked about here before. I believe that we ought to do a statutory version. I have a bill that would extend it through January 20th, I'm also the co- sponsor of a bill that would extend it further, sponsored by my colleague, Zellner Myrie. Those bills are also pending in the assembly, but in the meantime we need to extend this. The courts have exercised the power to do that and should continue if necessary and the legislature. The governor should step in if necessary, but we need to make sure that we stand for the principle that nobody should be evicted from their home. During this ongoing crisis, there was a to confuse matters. The CDC announced its own version of an eviction moratorium. It is broader in the sense it affects the entire United States. It is not as comprehensive and not as protective as the state moratorium. So, although it's helpful, if we were to allow the New York more term to expire, it is not sufficient and it we should still proceed with a state level moratorium and again I've been urging that this not be done piecemeal, every 30 days or so, but that we do a longer longer period. At least you know, at least through the end of the year, the on small businesses. Similarly, yesterday the governor announced an executive order extending the moratorium on Covid-19 related commercial evictions until October 20th again one month and he's been doing those in short spurts. That is again good news, and I will continue to urge that we not wait until October 20 20th to extend it in this case. They, the governor, waited until September 21st to extend a mortgage from that expired on September 20th again, I think it'd be better if people, if the courts and the parties potential the business owners and property owners all have greater, you know security and advanced notice about what's going to be in place to protect them. I think my staff has talked about the Covid-19 small Business Recovery Lease act, which is our effort to combine to link reductions in property taxes with long- term, affordable leases for businesses. Happy to take questions about that. We did have. I think, a formal announcement of that since your last meeting and I've gotten a lot of support from small business owners and lots of other folks all around the state all around the city. So we really are pushing that we've. I think again probably talked about this before, but we did take a lot of steps to make the voting process easier during Covid-19. Please, if you are planning on voting, if you're planning on running absentee, please request your absolute about as soon as possible and send it on in where you know the post office is going to be even in the best of circumstances, it's going to be challenging to get those ballots processed. Of course, some people suspect there may be other motives, at least in some parts of the country around the post office, but really, if you're planning on doing it. That way do it soon, and I would just remind people that early voting may provide an opportunity to do it at a convenient time that may avoid crowds which, of course, we all want to do continue to do during this time. I'll, similarly fill out the census. If you have not done it, it's September 30th. Please tell your friends we're still at 59, you know completion rate, which is a few points lower than the national average and jeopardizes 700 million dollars in at least in money in public 700 billion dollars in public money plus numerous other. You know congressional representation, other things just a quick public service announcement. We are having a town hall tomorrow. It is on civic youth, civic engagement, it is from seven day pm. We have great panelists, I will be moderating, but letting the young people do the talking it's aimed at people in high school and maybe college or a little bit older. It should be really great. It's it'll be online zoom, interactive, fun. Please tell young people to join us and we do have a team community board member who's going to talk about the joys of community boards as well. I think I will stop there. As always my staff and I are available to assist you. I think our director of community Affairs, Chantal Cabrera, is here tonight and I think she'll share her contact information in the chat and I'm happy to have questions or comments. We've got a couple of questions for you, Senator Trevor, Holland, just a quick question and it won't be answered- probably here, but unfortunately, your the Ruckus tube meeting was held on the same night as the parks meeting, which discussed the East side, coastal resiliency and the two bridges waterfront. So my first question is that a meeting available online for us to watch yes, it is the entire thing is available in English, Spanish, Mandarin and Cantonese, and I believe it is linked at the mta's site, their information site on this and we'll get it to and we apologize for the scheduling conflict. It was very challenging to get the MTA and everybody together for it. That is it's. I we go I'll put it in the chat. If that's okay and the second question is, did they discuss the air ventilation fan, that's at rutgers and South Street, or what you're doing work on for sandy related work? It was. There was a lot discussed. I do not believe that specifically came up it's possible. It was in one of the slides. There were a lot of slides that showed lots of things going on, but I'm happy to you know, follow up with you and have that conversation and get you know whatever information you need about that sure. Thank you great. Thank you. Michelle Cooper Smith. Thank you. I'm Senator Cavanaugh for coming tonight. New Jersey just announced that it's going to be taxing millionaires. When are we going to start doing the same cuomo's budget director responded that the cumulative tax rate in New, York City, would be higher than the new energy tax rate that's being raised, but like we need money. So what are we? What are we going to do about that? I agree with you. I I've avoided kind of hanging, my hat on any particular tax plan. We need substantial amounts of revenue. We had been until recently hoping that the federal government was going to come through with its relief package. I will say if the federal government does not come through with relief. The choices we're New York state is going to have to make are going to be really ugly, even with our best attempts to raise revenue. But I support there's a number of options. I'm formally supporting a proposal tax, it's basically taxes, unrealized capital gains of very wealthy people. Usually you do not pay taxes on that until you know, you sell the assets, but lots of people's fortunes have grown very substantially during this, so that the proposal that I'm supporting there would generate five and a half billion dollars and again that should be realizable immediately. Income taxes tend to come in. You know later, because you know you tax, taxing future income, so there's a variety, there's a whole bunch of proposals. My colleagues and I have said it publicly. The leader of both legislative has said publicly. We are not going to cut our way out of this, we're not going to get all that we need from the federal government. Whatever we get from the federal government, we need to do substantial, progressive revenue aiming at people who are still doing well to make sure they're paying their fair share. So I'm with you, I do not want to you know the budget direct does have a on a technical level. Has a point. You know like we have a city income tax, so our highest marginal rate on income is higher than the Jersey rate, even with their new thing. But you know there are a lot of people doing very well who are not getting taxed enough given the crisis. So I'm with you. Thank you, yeah. Thank you. Senator cavanaugh, all right we're going to change things up and go in like a wacky order tonight, because it's what I feel like assemblymember click there. We are okay, I'm unmuted, first of all for those to whom this is appropriate. A very happy and healthy new year and the Senator covered the abysmal census rate, and we have to do something we will suffer for 10 years with less representation and significantly less federal dollars. Once all of the dust settles, if we do not get our numbers up, so if there are people you know who are, you know, left the city to stay with their in- laws somewhere. That has a backyard, so the kids could go outside, they can go online and they can register their census at their Manhattan address and we need that desperately. So if you know anybody who's taken off, we had fun marching around the lower East side, with an incredible drumming core to drum up interest in the census, but we are still lagging. I intend to vote early, my wife and I made that decision that we wanted to make certain that our votes were in on election night, we're concerned about someone claiming that they've won when the votes have not been counted and attempts to stop the vote. I still have PTSD from Florida in 20 in 2000, so we do not want bully boys going around trying to stop the vote. There was an attempt to harass people early voting in Virginia, so we want to make certain that everyone here has the opportunity and that every vote, regardless of how it is cast, is in fact counted. If you get an your early ballot and you get concerned about the the post office, you will be able to take it to an early voting or on election day to turn it in. That will be another opportunity and you can. I've talked to the board of elections. If it is an absentee ballot, it has to have the envelope with the signature and the date you can turn in your elderly neighbor's ballot for him or her, and we, I just finished a seven and a half hour higher ed hearing on financial aid. Everything is facing a 20 withholding they're, not calling it a cut because they're hoping they can backfill that 20 for tuition assistance for various opportunity programs eop. Those are programs that help educationally and economically disadvantaged young people to go to college and provide additional services like mentoring, tutoring and counseling, and those students actually graduate college at the same or higher rate than students who have been accepted based on their academic achievement. So those programs are incredibly successful, they're very small, but if we want to see students the number one reason students do not graduate is economics, so their financial hardship. So if we want to see students retained, persist and succeed, using those strategies costs a little more money but in the end students graduate closer to on time, so they get to work sooner and our tax dollars are actually best spent because the students actually graduate so expanding those support services. Those wrap around services are incredibly cost efficient, we're working on some environmental issues. I have a new bill that would require existing and any new wind turbines to have one rotor painted black. It has been demonstrated that reduces bird strikes by 70 percent, and this has been a terrible year in the west for migrations. Birds are dropping out of the sky from smoke inhalation, so whatever we can do to protect work is important, and with that I have a lead, ammo ban on state land, because raptors will frequently find lead pellets, and so we have their approach, a protected endangered species, raptors and bald eagles, and they are dying from lead poisoning, so they're not getting shot directly because that's a ban, but they are scavenging and they're dying from lead poisoning. So we wanted it out of our gas. We wanted it out of our paint, but it's estate lands. We allow lead ammunition to be used now. Everybody is obviously very deeply concerned about the future of the Supreme Court New York's women will be protected in the event that Roe V Wade at some point is overturned because we have passed the Reproductive Health Act, which guarantees that right in New York state but 38 states. I think it's 38 at this point have an automatic trigger that a constitutional right for the first time would be overturned and eliminated. It would be the first and only time that a right would be taken away from Americans and that right it will still be protected in New York, but it is quite horrifying what what we are potentially faced with on environmental protection. Enviro. You know endangered species, clean air, clean water, so I would just say to everybody vote and if you have extra time- and you are interested, there are a myriad of ways in which you can participate in the electoral system, and I would urge people who are terrified to take a little bit of your time in the coming weeks to reach out to your fellow Americans and work to see that New, York is and and the rest of the world is protected. So the CDC has made it clear to get about vaccines. Masks are the number one way that you can stay safe, I'm really proud of new Yorkers. I walk around and I see great compliance. I drove, incidentally, through the edge of Pennsylvania, did not open the windows and never stop because nobody was wearing a mask and I drove back into New York and everyone was wearing a mask people walking their dogs or whatever, and I felt so grateful to be a new yorker. So thank you, one and all stay safe, fill out your senses and vote. Thank you. Thank you. Assemblymember. Are there any questions all right, seeing none? I'm going to go to Senator, Brad Hoyleman hi, very nice, to see everyone. Thank you for having me tonight. I hope everyone's doing well. All things considered given the last week and the last six months. I wanted to acknowledge our first ever community board budgeting selections and thanks to Community Board three, where we funneled our capital dollars through the approvals process from local community boards for the first time kind of a take on participatory budgeting. That's used, of course, by City Council members. We decided to leverage our community boards to see if we could get some good ideas for our capital dollars and I'm proud to say that, as you requested from Community Board three, that the funds of a quarter million dollars be used for Campos Plaza Community center. We have awarded that and we also are allocating an additional amount for a total of 550,000 to complete that project for improvements, which, of course, we all know, is home to continuous youth and family programs. So thank you to the board for your time and care engaging with caroline wexlebaum, who headed up our whole cbb. We call it cbb process and I just wanted to give a big shout out to her, because she's been managing a lot of different agencies as we ascertain the viability of different projects. So thank you again and you can read more about it on our board report. I secondly wanted to follow up on my colleague, Assembly member click and share both her concern and gratitude first, gratitude for the assembly member for passing the Reproductive health act, which is going to protect New, York women from any externalities I'll phrase it as such, with a new Supreme Court appointment. And secondly, I wanted to acknowledge, of course, the passing of Ruth Bader Ginsburg. I organized a letter, along with 23 of my Senate colleagues, demanding that the U.S Senate leader, Mitch Mcconnell, wait until the winner of the upcoming presidential election names a nominee before holding any confirmation proceedings, obviously where the state Senate, not the United States Senate, but I figure any voice and every voice needs to be heard at this point in time. Third wanted to thank the organizers, Cc one elias Reddy, Louis Cida, for that great March that we all took along with Council member Rivera and Assembly members. Julie knew Harvey Epstein and Gail Brewer and our controller and the public advocate to demand that we have investments in our public schools. So they can reopen safely it's about revenue and, if we're not getting it from the federal government, we're going to have to come up, come up with it ourselves, whether it's through bills, that senators, Kavanaugh and Julie knew and Harvey Epstein are proposing or the piedo tear tax that assembly member click, and I have proposed that taxes, luxury second and third apartments worth five million dollars or more most of those who own these. Second and third apartments, at that rate, are not paying their fair share in our opinion, because they're not paying New York City income tax. We hope to change that and then finally, I want to mention some new legislation that I introduced a bill called the fighting underground racing and our streets act which stands for furious. And yes, it took us a very long time to figure out that acronym and it would authorize New York City to operate speed, cameras basically overnight and on weekends. In areas where there have been hot spots for illegal speed. Racing part of the bill's component is to listen to community boards to raise the red flag or the checkered flag. If you will about speed racing in their neighborhoods and it comes on the heels or the wheels of continued complaints from residents all over the city about a drag racing. The complaints are basically five times what they were just a year ago, and it's because thrill seekers and just you know, complete asses- are taking advantage of empty speed streets to drag race into speed race and to endanger the lives of motorists, Pedestrian, cyclists and keeping us up all night. I do not know about you, but I hear it at all hours of the night you can read an op- ed that I wrote. Anili rozic from Queens and Brian Cavanaugh's, former chief staff, is the sponsor in the assembly. I look forward to passing that legislation. Thank you. Everyone, like Deborah, said: wear your mask, stay safe vote and fill out the census. Thank you, Senator. I want to make a joke about drag race puns, but I won't you know. Drag racing has a lot of possibilities in the planet. We can all learn something from Rupaul Alicia. You had your hand up for a moment. Did you want to make a comment? You good all right, so we're going to go. I just I just wanted to say thank you to the senator as well. Thank you Senator Hoyman, because I know that Campos Plaza is in desperate need of that money for the renovations I mean. I grew up going to that center and a lot of the kids in the neighborhood. Still you know they look forward to going there after school and making sure they have a safe place to play and everything. So thank you, so very much you're thrilled to send it to send our tax dollars our money to that effort. We have another question from Olympia Kazi Olympia. Thank you. So, as Luke said and Brad, I want to thank you all, because indeed you all came very strongly in our March. I want to make sure that everybody understands this. March was organized by four mothers in the district and the reason for which- and it was supported from all the incredible local organizations, and it is important that this is understood by everybody, because the media narrative right now is that we, the parents, just want to send our kids to school, and it's the lazy teachers or it is this and that the reality is the conditions right now are truly unsafe and dangerous and kids are put in harm's way, especially the neediest kids in our district that need to be in school, and this is a completely inappropriate. So what I wanted to mention is that, especially at the state, the way in which you can continue to support us is also in the short term. Governor Cuomo is the most problematic person. We know, then, in inadequacies and in capacities of our mayor and our chancellor, but the governor is the one who's right now just released the funds he was withholding. After until September, but the funding for October, he still is threatening of withholding, and this is just funding we would normally need to operate if a pandemic was not there so for the pandemic, we would need additional funds so the whole meaning of that March. That we did was that we need more funding in order for the future of New, York and all of new yorkers today to be safe, and so please fight for us for existing funding and in terms of taxing there is yes, like many others said for the first time I am with New Jersey because they had the guts to do the right thing and also consider Senator Jackson's bill, because funding for public education has been inadequate for years and any budget cut that may happen now. It will take years for us to reverse, and this is we all know it's 80 people of color in our public schools. So this is a huge issue of equity and fairness for our city. So thank you for coming, but please keep doing the fight because we need you, especially at the state level. Thank you olympia just to respond. I could not have said it better myself. I think you said it all. I know all of my colleagues on have different proposals for revenue raisers. We really have to make some hard decisions, but at the end of the day, it's not going to be so hard because we're talking about protecting the most vulnerable innocent children, the foundation of our democracy, which is public education. So, thank you. Thank you, olympia for all your work. Thank you, Senator. That's the last question we have for you. Thank you for President, Gail Brewer. I see that you're on. Do you want to speak now, or would you rather keep listening in Dale? We can't hear you yeah, I'm asking you Gail. Do you want to talk now or do you want to keep listening into the other reports? Gail? Are you there I'm here yeah? I can hear you now you're cut out again with this one: okay, you're going to switch computers. All right, I think we lost her. I think she's switching computers, so we're going to go to Assemblyman, Harvey Epstein. Thank you and I'll be quick. So when Gail gets back on and we can write to her- and I also just want to really wish everyone for those who are celebrating a happy new year for folks who do not know the week between Russian Yum Kipper is really a week of reflection and atonement, and so you know if it's been a tough weekend and a tough six months, but hopefully, as we move into a new year and 57- 81, we will maybe reflect on the bad past year and look forward to doing more the ecology center clearly a critical part of our neighborhood, and that the board has been really important and strong about this, and we continue to the loss of Ruth Bader Ginsburg. You know it's hard to. You know the fathom what the our Supreme Court will look like with with the president filling that seat, but it's something we're going to have to manage and deal with. You know post no post November, so it's something that's going to be in for the ride. Sla issues there's been ongoing problem in our neighborhood people know. Obviously, two sides- one is: you know, you know everyone's out in the street. There's more noise and the flip is local businesses being shut down by the state liquor authority. It's a concern that we have- and I think you know really during this pandemic and businesses are struggling. We've seen continuous businesses shutting down every day. You know you know whether it's my dry cleaners or you know places like Odessa or you know, they're, just it's just tough. So I think what we can do is support us businesses as much as possible. I understand that we want them to follow the rules and I want them to follow the rules and but at the same time we have to balance losing small businesses that really hire local people. So it's a tough balance and I know the community boards experience that I know Alex has sat through more delay committee meetings than anyone I've I I've met in my life and so she's fabulous, but same time we can't lose our local businesses and I think we need to do a better job olympia. Thanks for the work on the rally and for you know, people like you, we had a fabulous turn of hundreds of families coming out to talk about the safety in our schools, and it's clear. You know on the day that we were having a rally that the mayor realized that he was not ready to open the schools on the 21st and I'm not clear we're ready for next Monday. Either I've been to numerous classrooms in the district, where windows do not open or they're shilling windows shut. The teachers already complaining. There's two calls in the classroom with the windows open we're going to have kids in winter code sitting in classrooms with it's, I'm not sure. The plan we have in place right now is going to work, I'm pretty clear, it's not going to and then we're going to be in a position that we're not. We can't plan further ahead and we had a plan that we were like: okay, we'll be remote until January and focus on high needs, kids and kids with special needs or kids with ieps. We could have had a plan for this like push back a weekend, realize the problems we're having that's just going to make it worse and worse so yeah. You know, I hope that we figure out a better plan and is not the one, the mayor's proposing and reopening next week, but if it is we'll see how this plays out, I think less than the 700,000 kids who are scheduled to go and are going to go in because I just do not think people feel like it's safe talking to a teacher today and they had two kids come in for pre- k. So we have all this opening in a pre- k and a school and two kids are showing up. So I think we have to be smart about it and use our resources well and I'm not I'm not clear we are, but we could really focus on kids with special needs and high needs and english language learners and giving the individual attention that's necessary to the population. So, a couple weeks ago, the housing agency Hcr proposed rules around major capital improvements last year, with the leadership of you know, assembly. Member click and Senator Cavanaugh Hoyleman we were able to pass most sweeping housing legislation and limited major capital improvements. A housing agency then proposed regulations or policies. Excuse me that are not in comply with the legislation that we passed. So I know I testified I had signed on from about a dozen or my colleagues saying that they need to withdraw what they propose. I know Senator Kavanaugh men are with me. They need to comply with the laws we passed and they're not, and that's going to have potentially negative impact on many tenants, acrosss the city and acrosss the state. I do not wanna, you know, go over the issues. I've already raised I'll visit, one more point of army in Criminal Justice Town Hall on September 30th, so it people can sign up with our newsletters in the chat. People can look at it. Aura is here you can talk to her about it. We made some important criminal justice reforms and then we rolled back on some bail, which I think was deeply problematic, but we've seen over the last couple weeks- is that we're incarcerating more people instead of less because of the role back on bail, so we're putting more people at risk of Covid-19, and these are people who were being arrested for non- violent defenses. We need to have substance, criminal justice reform and there are lots of bills that we've been talking about, whether it's halt, solitary confinement and ensuring that people who are aging in prison get released because they have low recidivism rates, we're spending billions upon dollars on incarcerating people who could be productive members of society. We let them out. The question we keep having to answer for ourselves is: what is the purpose of incarcerating people? Is it as the Corrections Institute says as it is? The department of corrections says it's for corrections or it's for punishment. As for corrections, we should look at corrections. We should expand educational programs, we should expand services, Drug Rehab, and we said one people are proving that they've corrected their behavior. We should give them a pathway out. We do not do that now and we need to do it I'll. Sorry, I'll end on the one point around budget justice, because Olympia raised a really critical thing: sorry about that, we need billions of dollars. We have 14 revenue bills that all of us have sponsored whether it's some member clique or Senator, Welbeck or myself- that we're either sponsoring or co- sponsoring they could bring in billions of dollars to New York state just alone. With a with a millionaires tax, we could bring 5.8 billion dollars and we could catch up to New Jersey for New York state, so New York City has additional tax, but for New York state we could do that and for people who are not in the city, we should do that, and people who are in the city they'll pay a little more there's nothing that proves that people leave New York City, there's no documents. That say we raise taxes to leave because we have higher taxes now than New Jersey and they have not gone there yet so they're, just trying to catch up to us and they're still not going to Jersey so New York is where people want to be. We can do this, we can do millionaire sex. We can do mezzanine debt tech, we do pit or terror attacks, there's so many things that do not impact 99 percent of us that can result in not cutting 20 percent of our school aid in October or November. We've already talked about Keaney Deborah Click, and I went around here for hours today. We heard from person to person to person about class sizes that are triple to double. Cuny faculty have been laid off, cuts acrosss the board, and this is because we are not raising revenue. Revenues got the answer. I would encourage everyone to call the governor today tell them to raise revenue sign on to our bills, and then let's get us back into session, so we can pass those bills. Thank you. Thank you. Assemblymember. Are there any questions? Carlin, yes, hi harvey! Welcome! Back to the criminal justice reforms all right, it brings me a case. Randy santos killed four men at Chatham Square last year. He now he was built up. He was bailed out for a second violent assault, all right so wha. What guarantees are there that you know further reforms won't release more violent people out there, mistakenly yeah, so the bail reform. We did not talk about violent offenses. If someone engages in a violent offense, they can be kept on bail and let's be clear, that bail is just a poverty attack, so people who have money right, even if they engage in violent defenses, can always get released. So basically, you're saying if you're, poor and you're you're accused of murder is one standard and if you're really wealthy and you're accused of murder, it's a different standard. So I think we need to have standards that make sense. We should not be based on people's incomes. The second thing is: when people engage in violent offenses people should be. We should be incarcerated. That's unfortunately, what the system requires for people should you know we do not want people to kill anyone, but if they do that's the criminal justice system for and so no, we do not want recidivism, but the kid who's standing on the street corner who's like selling Marijuana and gets arrested or the person who takes a loaf of bread from a store because they need it or someone who steals an Amazon box. Should we should those people be staying in Rikers island? I do not think so. We need to get those people released. You know, and we were doing. We were on a really good path earlier this year. Unfortunately, the bail rollbacks that we instituted in April has put us down on a negative path and it means that more people will be separated from the kids and more people will become homeless and more people will lose their jobs because they're being kept in jail, and just because you are let go does not mean you do not have to stand trial. You still have to stand trial and you still can be incarcerated at least you're out until the trial, unless you're engaging in a really violent defense in situations like you're talking about people engage in those kind of violent defenses. Those people do not get released on bail unless they have money. Well. Okay, I was addressing the part where the bail reform package passes. The state legislature, which, actually they were violent offenders, were actually being released without bail. Okay. Now I totally agree with the you know the shoplifter you know and other low- level non- violent offenses, but you know we have. We have people committing shootings out in Brooklyn and there was people those people are not getting released without bail. Those people are not that we did not say. Murder was not a category that was excluded from bail. It just was not attempted murder. Thank you assam. Remember, bro, President Brewer! Thank you. Everyone, sorry about coming through the problems. All right there's a couple of things number one I think in terms of the jail you've heard some, but there was a meeting today with the City Council and the mayor's office, and I hope that they come to the Community Board. Also. I think that, obviously the issue of environmental impact statement was not addressed according to the court, understandably so, but the mayor's office feel they can still do outreach and so on and so forth. So we're going to make sure that there's as much community engagement as possible and the city is going to appeal and we see where it goes. They obviously can not start construction break ground, but it seems like they can they. The city can do everything in between. There were a lot of questions, and if you want more, we can answer that. Second, just some good news is oh, I do not have a lot of good news this time. I know people are really cheerful, I'm not so good at that, but the chai spot, which is in board too. It's a restaurant, it's on my street and they were one of the winners of our charming outdoor dining contest and just to say how important these kinds of supports are. This is a wonderful chai restaurant owned by a pakistani woman. She also sends sells wonderful crafts. You may know it, but what is interesting is just before she was announced. As a winner. She was planning to close the restaurant and the only thing that kept her going was the fact that customers showed up after the announcement her owner is fabulous. He has cut the rent. So it's good news in terms of a wonderful owner, a wonderful restaurant, a great store, but you can see the margin that people are operating on and, I have to say it was almost crying knowing that a small act kept them open, but it is hard, as you know, oh the schools. You know we are all working until recently. The city had not spent the money that we allocated a year ago and billions and millions of dollars for the school, so they. Finally, after New York Post story agreed to spend the money. It's all for technology, it's all for the devices that are in such demand. So, as we speak, our office is working with. You know almost all 400 schools in Manhattan trying to get the devices figure out the chromebook issue. It's a nightmare to be honest with you, and now, of course, are they going to spend the money that was allocated this year for technology? Meanwhile, schools are struggling just to get those devices on Tuesday, which of course, is the 29th. The next opening day we're going to be at almost every school. In Manhattan we have hundreds and hundreds of volunteers everybody's welcome. You can sign up on our website giving out information about the census, as you can imagine, and certainly all the other PPE and what's going on information, I think that it's a very it's an important time to be supportive of the parents. The Precinct barricades letter, which you know basically said unleash the streets that are closed at the precincts. It's got a lot of discussion from reporters asking the mayor about it. Some have retreated some have not so I just want to let you know. We have not stopped working on that. I had a meeting today with all of the bids and community chambers of commerce and so on in the borough Manhattan, and I would say that they are frustrated, is the issue that I hope that you will look at. You are very supportive of your small businesses in Community board 3., it's everything from what kind of heater am I supposed to use and if I have to have this kind of heater, what does it involve? The fire department says one thing: Con Edison is going to work with me or not on my electric heater. Are there enough heaters for everybody? What's the date that we have to end our indoor? Is it really the I mean outdoor? Is it really the 31st? Are you going to extend it? Is it 25 or maybe 50, and there are hundreds more issues? We did a letter on September 17th about small business. I hope you got a copy. If not, let us know- and we are going to do another letter listing all of these issues- that small businesses are concerned with the list is very long seniors. We, as you know, focused on them getting food during the entire pandemic. We are continuing with the opportunity from the top of Manhattan to the bottom of Manhattan until the end of this month, with fresh direct making sure that the NYCHA seniors get food. My understanding is that food program and Susan may know this is going to switch over to diphtha, and I hope that works, but I think that's something that should be very closely monitored, because the seniors need the food. The senior centers are not open. When are they going to open and all the issues of seniors and their existence? I think, is some going to pay a lot of attention in terms of your board. 70 Mulberry Street we're paying a lot of attention to it. I know there's a lot of discussions about preservation, building new, not and we're going to have a stakeholders meeting and you're very involved with that, and I appreciate it. The census, it just is like a challenge every minute, so we did mail with the League of women. Voters 35,000 postcards to those who came as a list public from the board of elections, the board of election states. These are the people who requested an absentee ballot in other parts, not New York City, although they are New, York, City, Manhattan residents. It's gotten a lot of positive response, we'll see how many really say. Oh, I need to fill out a local, not my temporary residence. I need to fill it out again with my Manhattan residents. We also sent, as I might have mentioned to you- 280,000, postcards to underrepresented census tracts. We also gave up money from the governor to individual groups working many of them in Chinatown, and we just got a list from the U.S census of buildings that are not getting entrance to and we will go over and figure out, which is what community board we have eight days to go, and so these buildings absolutely need access. I know there are some in door three, so those are some of the issues that we're working on and I thank you very much for all your efforts you are making in your community. Thank you, Michael. Thank you. We've got a couple of hands raised for you, we'll start with Trevor Holland hi Gail. Thank you for everything you do. I just wanted to mention something and try and be as brief as possible. Considering the sessions can be quite long, but recently the appellate court ruled against your and your case in the City Council's case on. So my first question is to you is: when is when? Are you going to appeal and if you're not what's the next step, what the appellate court has said is that petitioners could have taken steps to amend, okay, there's only a resolution. Let me just finish that petitioners could have taken steps in men's, owning resolution to prohibit buildings of the scale or sought to change. There was only classification of the true bridges neighborhood, that's exactly what the Community board has partnered with community groups to do so. Those are my two questions. Okay, I probably need to have the we're definitely going to appeal, but I want to get the time frame for you and we'll certainly have lots of discussions about the zoning resolution, because I certainly understand your point so to be continued, but a hundred and understanding. Thank you very much trevor and I, but I want to thank you for your zoom on or your question about the party boats, because now I'm stuck with that problem every night. So thank you, Trevor Tyler chan, yes good evening gail, I have a question. I have a question about the 70 Mulberry Street stakeholders meeting. Is that open to the public and if not, why I think it would? I will find out. Usually they you know, maybe not to be on the task force, but certainly because I know the community board is represented, but let me find out, I do not know the answer to your question I'll find out. Thank you, but the community represents okay. Thank you. Gail has any other questions all right. Thank you again, gail all right, so we are going to go to our representatives now from elected offices. I'm assuming there's no other elected officials with us. If so raise your hand, let me know otherwise we're going to start with Siobhani from Eulen's office hi. Can you hear me? Yes, we can awesome, so I will make it quick, but one of our updates is that last week eulene hosts an education webinar with a school in Taiwan who was doing a full semester in person because of how they were able to handle their Covid-19 response. It's fully safe. So she hosted that to learn and have a Q&A about how we can bring that into our schools. She then released a statement on schools, reopening and the need for the city to work with teachers and families and hear out what they need and what is important for them moving forward. So that's something she's very committed to hearing everyone out and seeing what we can do to make sure that it is the safest possible. So that's a big thing that we've been talking about in our office. She also spoke at a CUNY round table earlier in the month to discuss the need for CUNY funding. I mean amid the pandemic and budget cuts and all of that CUNY really needs funding, especially given the fact that nearly 80 percent of CUNY students are people of color and removing that resource from an already underserved community would be truly devastating. So that's something she's been advocating for as well. She also hosted a press conference along with Senator Brian Cavanaugh and council members, Keith powers and Brad lander to discuss their small business relief bill. She believes that it is urgent for legislation to be passed to support our small businesses as the economic devastation of this pandemic continue. Finally, she spoke also at a press conference to call for emergency legislative session. There's been a lot of great legislation put forward that really works to support our community, but none of that can be passed if the legislature is not in session, so that is something she's been very vocal about and then just finally, as per usual, we're still doing PPE distributions, that's like our main focus when we're in office. So if you know of anyone who needs PPE any groups, any events that you'd like us to distribute at please feel free to reach out I'll, put my contact in the little box and that's it for me. Thank you, Siobhan. Are there any questions, just a reminder, folks, the questions at this point in the meeting for elected officials and their representatives are only for community board members. We unfortunately do not allow members of the public to ask questions just community board members from this point forward. I do not see any hands raised from community board members, so we're going to go to Victor from Carolina Maloney's office. Victor you there all right. I guess not so we're going to go to ling Shea from hello. Yes, oh victor! Yes, so who exactly is appealing the the ruling of the for the jail? I'm sorry! This is the wrong Victor Michael! It's the wrong victory! Okay! I do not know who moved him over. I'm sorry, Victor Montenez! Are you on okay? So we're going to go to ling shay from Winkstar, I'm sorry from movie over last where's his office good evening. Everyone, I'm here you know on behalf of Congresswoman Lydia Velazquez. Well, first thing, I'm going to say is like repeat it. Many times is the census. The congresswoman hosted a census, Zoom Town Hall last week, where you know some of you guys were you know, probably there. So, as the current, you know, as the current rate and as you know, projected by the current static statistics that, as we know it, New York stands to lose, perhaps one to two congressional seats and so and then also because of cover 19. A lot of people have moved out of the city, but we know a lot of people will move back. So if you know anybody who's, you know who's outside the city at the moment, but we'll move back later on, please tell please help spread the message. Those people should fill the census, for you know for New York, because they they're, probably in their second home but they're, going to come they're going to come back to New York later and the co. No right now the the con, the House of Representative, has passed the heroes act which contains you know adequate. You know which contains funding for rental assistance, for example a hundred billion and which, and then these assistance would offer you know, would cover you know: public housing and the section eight residents that you know would you know which it's far I would not it well, we can not call it adequate, but it's far more adequate than the bills. That's floated around by Senate Republicans and more adequate than the CDC eviction moratorium. You know which does not really does not cover a lot and then, as we know it. Currently, the house bill is not going anywhere with the current Senate and it it's all depending on the November election, and it's all it's an all- out effort to make sure that we take back the Senate. So we can, if you can wrap up, please I'm sorry if you can wrap up, yeah, sorry and and then and then lastly, and then the congresswoman is working on a bill to you know to eliminate voter suppression in some of the key swing states and that's update thanks all right. Thank you all right, Isabelle from Colleen Romero's office, hi everyone good evening. I will keep my updates quick. I know that we have been talking about the census for a very long time, but I also know that there are many bicycle lovers and cyclists on this call. So I wanted to flag for you a cyclist for the census event, this Saturday with Council member chin and a few other local organizations if you're interested in attending or volunteering. I will post that in the chat and a few legislative updates, Carlina held a hearing yesterday in regarding the Covid-19 response in New York City Jails with the committee on criminal justice, and she will also be holding a hearing shortly about the test and trace program in New, York, City and finally, as others have mentioned, Carlina joined the March for safe schools recently and if you or anyone you know is experiencing difficulties. As I know, many people are with the schools with remote learning. Please do not hesitate to reach out to our office if you are in need of resources or information. Thank you. So much thanks, isabel Mary. Oh sorry, we have a question from Olympia: go ahead olympia! It's a quick question more like a reminder. Basically, I was stopped in the street by New York Juan yesterday, and they were doing a reportage about Charizard Hill. So the situation, as you know, has further deteriorated. Now there is a huge hole in the sidewalk. There is a constant glass moving from the wind, etc. In three weeks we have the anniversary of the blizzards promise to bite back, so we're counting on you, whatever extra pressure you can put, because this is both a safety issue and you know a legacy issue and a community issue. Thank you. Can I briefly respond of course go ahead. Thank you. Thank you. So much olympia I just wanted to let you know we followed up about the whole DOT has reported to us that they would be covering it temporarily immediately and then long term as well. So if that continues the whole, please let us know- and just thank you so much for bringing it up. We continue to put it to us, put as much pressure as we can on the mayor's office and LPC. Thank you so much thanks, isabel Alicia, okay, yes hi! Thank you isabel. Thank you so much for coming out tonight. So I just have a really quick question. If you could ask the our Councilwoman rivera, please ask her vouchers that are 90 days. I do not know what the extensions are being permissible for them, but right currently right now they're giving these 90-day vouchers from the shelter system to find apartments which, at this time is not feasible for many of them during this pandemic. So I'd like to see what we could do to help the homeless a little better with those vouchers that they're giving out it is very restricted as to how they're going to find housing in 90 days with the vouchers and they expire within the time once they release them. That's it they got 90 days and then and then it's I do not know so, if there's any way that we can support them with an extension or even listings or whatever I do not know what we can do, but please ask our councilwoman to look into that. Thank you, Isabel Marian, from Council Members Chin's office. Are you on hi, I'm harmony I'll, be speaking for Marianne? Awesome good evening, everyone, so I'm just going to provide you with some updates on from our team. So yesterday, Councilmember Chin chaired a council hearing on senior center reopening and we listen to our senior center providers share their concerns with the recently released senior center concept paper, especially around the lack of transparency on the future of senior centers, their capacity to serve food, how to engage isolated seniors and what funding is being secured to best position them to do their work. Our office has been working with providers to fight for the necessary guidance and resources to continue serving and advocating for older new yorkers as the pandemic continues. As we approach the last week of the 2020 census Outreach, our office is also partnering, with Asian American Federation, Cpc, Afv and Council member Rivera's office to host the census. Caravan this Saturday from 11 to 20 pm, we'll be giving out free one- month, CitiBike vouchers to volunteers or those who fill out the census. If you're interested in signing up to be a part of the caravan I'll drop a link in the Chat box over the past few weeks, we've also organized census, events with immigrant social services, the Chinese Progressive Association, Hamilton, Medicine, House and more. We hope to do more to maximize participation. On the topic of school reopening. We have been hearing your concerns, which is why our office has been working with schools and city agencies on open space applications for learning, following up on ventilation, concerns and expediting fdny inspections of learning labs. We've also been advocating for schools to receive the necessary guidance from DOE to reopen safely. Lastly, the community first food pantry, a partnership between our office and the local non- profit ua3, continues to grow in size and we're always looking for more volunteers to help us in our efforts and I'll send a link to sign up in the chat box below. Thank you harmony, any questions all right last call for public advocates office or the mayor's office if anybody's on. If you can raise your hand all right, and that concludes our report from elected officials and I'm going to hand it over to Michelle Coopersmith for roll call and voting on the June minutes. Thanks Michael David adams, June of July, I believe it's June July. Sorry, the agenda is the light, but I think I bought it on their journey already. Okay! Yes, I'm here thanks your own altman; yes, Jesse Beck, yes, Dominic, Berg, Dominic, Berg, okay, Lee Berman! Thank you! Carlin Chan! Yes, Jonathan Chu! Yes, David Crane! It does not work. Yes! Thank you! Felicia Crookshank! Here! Yes, thank you! Felicia Eric Diaz! Yes, Alex saraconovacus! Yes, thank you. Shirley fantasy, okay, Ryan Gillum, yes, Deborah glass, yes, gordillo! Yes, Herman, Hewitt, Herman, Hewitt Herman! Thank you trevor Holland! Yes, Linda Jones! Yes, Valentina Jones; yes, Tatiana Giorio; yes, Lisa Kaplan; yes, Olympia Causey; yes, Joseph kearns; yes, Michelle, Cooper, Smith, yes, Melee! Yes, thank you! Wendy Lee, yes, Alicia, Lewis, Coleman, yes, David Louie; yes, Michael Moreno; yes, Alex Militano; yes, Michael Perlis; yes, Tariq Ramos; yes, Paul Rangel; yes, Carolyn, Redcliffe, Carolyn, Ratcliff you're on mute! Yes, thank you! Damaris Reyes! Yes, Richard ropiak. Yes, thank you, Thomas Rosa, yes, Robin Chatel, yes, Heidi Schmidt, yes, Larissa Scheinberg, yes, Clint Smeltzer, yes, Anisha Stephen, yes, Sandra Strother, yes, Josephine Velez, yes, troy! Yes, Rodney Washington, yes, Kathleen Webster, yes, Jackie Wong, yes, Ricky Wong! Yes, thank you! Thank you Michelle and thank you Michael. So a few things I want to just again thank everyone for attending tonight, if you're just tuning in. Thank you so much for coming out, and I want to wish a happy new year to our jewish neighbors and those observing the high holy days. I also want to thank our elected officials for their continued support and our community leaders for their fearless fight for saving our community and keeping us well grounded in this neighborhood. As a reminder, our schools in district 1 are still providing free meals for the public. If you come to the school from 7:30 in the morning to 1:30 in the afternoon, you can still get three meals at one of the local schools that are open after those schools are closed. Once the children arrive at school next week. I believe Friday is the last day for the 7:30 to 1:30 set food distribution. After that it will be from 3 to 5 P.M, and there will be only three schools in the district that will be serving in those hubs. So we will keep you posted I'll, probably get some information directly. Once I get the information from my supervisor. Okay, the board of elections is hiring poll workers. So please, if you are interested in the electoral process- and you think that you have a little stamina to stay up for 14 to 15 hours and work the polls on election day, it would be great to have you call in the board of elections and register yourself to be a poll worker. Do not just be you know, do not sit on the sidelines work that day. If you wish to do something, you know observant and also vote. Please vote. Okay, I'm we're going to be convening the NYCHA section, 8 subcommittee on 1021, if you are a full board member and you wish to join that subcommittee, please email me as soon as possible and let me know my email address- is cb3chair. Gmail.Com, please let me know, especially for the new members that have not have not had an opportunity to really check it out. I encourage everyone, that's interested, come check it out. It's on zoom. You do not have to leave your house so just tune in and that's again on October, the 21st okay, so we know we have elections coming up. We are approaching our community board elections for our executive committee and so during we're still in the midst of coving right, so we're still in the pandemic. So because of the pandemic, we are in need to change things up a little bit. The way we operate the way we do our election. We had a. We still have a task force for the bylaws and we are going to because we never dissolved the last one. The last one was we had a minor clarification back in January, and so they we still have that bylaws task force, which is comprised of the executive committee, and so we need them to make a change a little amendment to the bylaws to for us to vote electronically. So that is what I needed to tell you tonight. Also Linda is going to share with you more about the nominating committee. That's it I think. That's all for me. Let me just double check. Oh and also one last thing, I'm sorry. I would like to remind everyone. Please continue to show up for your committee meetings. We are still on zoom and you can even call on your cell phone. Please show up committee members show up to your committee meetings if you're unable to show up to your committee meetings and you feel like you are going through like work, hardship or something in your family. Please just contact your committee chairperson, so they are aware that you will not be in attendance and they are not constantly wondering where you are okay. Thank you so much, and I wish you all well, I'm going to turn it over to our district manager for her report. Thank you so much. Okay, thank you. Alicia, just first, a few brief announcements. We have received a few complaints about the speaker form. We appreciate getting the complaint, so we know there's a problem and we have already changed it, so it will be easier to submit wanted to give some information regarding charis. As people know, the Department of buildings has not been incredibly responsive in the way they've been inspecting. There have been a lot of complaints about people obtaining access to the roof. So at my district's last district service cabinet meeting, we were not able to get any further response from DOB, but the fire department has agreed to inspect the roof and see if there's a way they could prevent access to the roof. So I will keep you updated on that. I want to let people know, there's been a trend recently for cars being broken into. Please be very careful not to leave anything in sight in the cars we've had continuing to have many complaints, Covid-19 related issues, one is people you are seeing on the street, some of whom are homeless, some of whom were formerly in programs for substance abuse or other services that they were receiving. There are other issues that are impacted by Covid-19 are a lot less sanitation. Pickups. We've seen huge piles of garbage, particularly right next to restaurants, which is totally budget related with there's a lot less parks maintenance. I think parks has announced that there are 30 percent short on their staff because of people being out ill along with having budget related issues and another complaint we're hearing a lot of and which is one of the public session speakers spoke on, is loud parties. People are not going to bars so they're using roofs or backyards or apartments, and the only way we can deal with this is by working with the precinct. So I'm hoping that will be successful, and I also want to go back to Brad Hoyleman's announcement about compost, plaza we've been trying to get improvements or reconstruction there for so many years. It's incredibly a big deal that he not only allocated the funding but also allocated other funding, so the complete reconstruction will be done and I particularly want to thank Caroline and his office. It was a tremendous amount of work to deal with the bureaucracy between NYCHA and the state. So I want to thank her for her help on that. I've been asked to explain how items get on the agenda, so I will give a short report on that and for your reference. This is on our website under member resources and member resources and office operations. First, we get most of our items from city agencies such as mandated notifications such as ulurps or SLA notifications or city agencies, showing us plans such as park. Redesigns. Often, a community board resolution is required and this fulfills the role of the community having a voice in the decision making. There are many times informational items from local nonprofits, such as when we got our first Marijuana Dispensary or new community services or programming. The agencies will generally contact the office, and then we confer with the committee chair, other items are reserved refer to the office are by the office to the committee because of service delivery problems that indicate a systemic problem that needs to be accounted for or needs a community board resolution. One example of this in the past was the K2 drug problem. The resolution asked for a policy change that was then all 12 boards voted on this same issue. Another example was was the Houston Street reconstruction, and that was three years overdue, and there was a vote on that from the from the committee which got attention from the mayor's office and really made a difference. Sometimes board members will have a proposal to ask the board for support, such as for traffic improvements or residents who form a friendship group, maybe for a park we may have local organizations such as Community Education Council, coming to the board for support all the items sent to the office other. Those from city agencies are first discussed with committee chairs so that we have decisions finalized before the executive committee and sometimes items are deferred until a later date, because the agenda is full with time-, sensitive items and also it should be noted that some items may not be agenda. Items such as service delivery, issues that are really enforcement or something that's not within the jurisdiction, such as private civil matters. So if there's any people still have questions about that, please feel free to contact me shoot me an email. If we want to necessary, we can also set up a time to talk and in October you'll notice. Are you when you get the October agenda? You will see that we're voting on budget priorities, for that will be for the fiscal year 22 that will be starting next July and we'll talk about them in every committee, but just to give a brief overview, we will vote on 25 expense items and 40 capital items. Expense items are items such as programs, staff, salaries, supplies, small equipment, capital budget items are physical improvements to infrastructure such as sewers, roads, buildings, land acquisition, major park improvements and major equipment like trucks in September. The community boards consult with the agencies that deliver these services to get information to research. All of these, and then we will submit each committee will vote on priorities for their committee and they will be collated for the full board and there will be a ranked list voted on at the full board, and I just want to mention a lot of people find this confusing with part of the City Council participatory budgeting. This is very different. The City Council participatory budgeting is taking a bucket of money from the city Council that each council member has and deciding on how that money will be spent for the community, as opposed to the priorities which are saying how each agency will spend money on their budget lines within that agency. For our community happy to answer any questions again. If people want to shoot me an email, I'm happy to go over it with anyone and if there's no questions, that's it. You do have a question: okay from Sandra, yes, Sandra! Go ahead, unmute yourself! Ah, no! Actually my question is for you Alicia, I'm sorry who's going to be chairing the nitrous section, 8 committee. Currently it's Jackie and myself, oh okay, all right you'll be sharing the position. Great, that's great! Okay! Thank you! Okay! Thank you! Susan, okay! Next I'm asking I'm and I'm sorry I do apologize. We did not have the nominating committee here, but instead of exec we're going to ask that Linda are you there? I am here, okay. I wanted to give a report right. So essentially, this meeting kicks off the season of nominations for our community board. We will be voting in November. I will be sending out an email very shortly to remind everyone in the community board that they may nominate someone for any one of the executive offices or one or more, they can nominate themselves or they can nominate another person and I'll. Let you know the rules for all that the nominating committee will it begins meeting now and we will be working on the input we get from everybody about who is suitable for the offices and we'll be reporting back at our next meeting with? Well, I'm not sure if we'll have candidates, yet maybe we will. I can't remember: David is out there he'll remind me, but that's how it goes and we vote in November and the amendment that the executive committee or the task force the bylaws task force is working on, relates to our permission, to do something other than vote by a paper ballot, and we have not chosen the mechanism yet that covers it. Okay, thank you, Linda. Next we have parks and recreation, waterfront and resiliency. I do not know what to do up trevor- I'm usually number nine at 9:30 and trying to be brief, but I'm going to be brief. Also at this time we did not have any resolutions, although we did have a very long meeting about the entire waterfront in CB3. The Good news is that most of it is funded and is under or will go under construction to protect our coastline. The two issues that we still need to talk about- and it is on the agenda for next month- is the Ecology center's compost yard and the Brooklyn bridge esplanade, which is not funded for committee members. I think this will slow down a bit since we covered a large portion of escr- related items over the past few months, including the marathon discussion about construction, which was needed, I think going forward. I do not think we're going to have as long a discussion on for Escr, especially since we've established a community advisory group or it has been established. The board did not establish that. We will still talk about in some detail the bmcr or the Brooklyn montgomery coastal residency plan, but the design for that is 75 percent done, and it's latest to start construction next year. Any questions I do not see any hands no hands. Thank you. Trevor Health, Seniors, Human services me hi, hello, okay, so well at the last meeting we discussed district needs just like many other committees. At our October meeting. Like all the other committees, we will be voting and discussing and voting on our the budget priorities that relate to our committee. I also wanted to let people know about another agenda item. We will have a presentation from an organization called the alliance for positive change. They actually have been in this community a long time. Their former name was lower east side harm reduction center, which many of you may be familiar with. They provide services to those who are recovering or need to recover from substance abuse, so they were at 25 Allen street they're, moving to 35 east broadway, which is between catherine and market, and so they will be giving a presentation on the new programs and services. They will be providing at their new location. So if you're interested in learning more about that, please come to the meeting just to make everyone aware there they came to our board two times in the past year with you know, request for support on their new location, which we had voted on and approved, but you'll be able to hear more about their programs there. They just opened up in September at the new location. So that's October, the 8th! Thank you. Thank you! May, okay! Next, we have SLA. We received all the stipulations that were filled out as part of resolutions. I have one amendment which is just to awareness clause in a resolution for Hakka Cuisine Llc 11, Division Street. I can't remember what number it is Michael in my agenda, but the it's not as to anything substantive. It's just a correction as to number of total seats and number of seats per floor in the I'm. Sorry is the right one. I'm sorry what'd you say Michael. Is this the right one? Yes, it is thank you so in the second, whereas clause, which is the one right at the bottom of the page, so it would be amending the number of total seats from 100 to 94 and with eight tables and 42 seats on the ground floor, seven tables and 52 seats in two dining rooms. On the second floor, and I already typed out the amendment and sent it to Michelle in advance of the meeting. That's it does somebody have to second the amendment or move the amendment or just ask. If there's any objection, any objection, I do not see any hands. Thank you, Alicia. Okay, thank you, Alex. Okay. Next sorry, landmarks did not meet right, correct, okay, thank you. Linda and land use hi good evening, so Lenus did not have any wrestle in the last meeting, but we had an information session on 70 Marbury street and there were two major opinions. Some from that meeting first is to ask d cars to provide the details of the engagement process, such as time frame and number of meetings to the public and also to move forward with a preservation assessment immediately. So I contacted dcas after the meeting and d cars shared with me that there will be at least nine engagement meetings for stakeholders and they also agree to prophesize the engagement information once it is confirmed, but they also insist that they would conduct the preservation analysis after the engagement. If that's what the community chooses to do so, I'm, following up with elected offices, to see what we can do with that. I also want to give a brief preview about our October meeting. Land news is going to review the Grant Street View Development application. So anyone who is interested in this topic can come to our meeting and, as Alicia mentioned a little bit earlier, we are going to hold Nycha's a committee meeting in October and NYCHA officers will come to our meeting to give us updates on resilience, programs and also general services. I understand the preservation. Trust conversion is really important right now, however, we still have a little bit of time, so we are going to put it on the meeting after October and that's all for me. Thank you. Thank you. Jackie Transportation Alicia there's a couple of hands raised. Oh, I'm sorry, okay, I see Olympia, okay, Olympia and then Carlin go ahead. Olympia. Thank you, so Jackie. Thank you for giving us the updates. This process has been a little bit incongruous around what our committee has voted on, then what the city did when what the committee received so right now you just mentioned that Dicas has decided not to do any preservation evaluation until they get feedback from community engagement, but we had a clear. You know two to three meetings at this point where clearly the community came out and we did a razor requesting that so should not the community board be saying about like are not we that's why we take all this time away to represent community, and we ask for that. So this is very for me. It is concerning the way because has been behaving with back and forth with our committee yeah. So that's why I'm also following up with the elected officers, to see what we can do, but thank you for that input. Okay, Carlin! Yes, okay. I attended that land Use committee meeting last week. I think now I would suggest that. Can the community Board or the Community Engagement Committee, asked the caster? Stop the clock on the ninth day engagement period get the structural analysis this way the Community Advisory Board has the information you can make a better decision when you have all the information, why make a decision and then go back to do the analysis, it's kind of backwards? This question was discussed multiple times and we. What we can do is that we're going to bring the information to d cast to see if they would consider reconsider that decision to do the preservation analysis before the engagement. Okay, thank you carlin and thank you Jackie. Okay. So now we're going to go on to transportation good evening, everyone there's no resolutions for us to report on. It was just an update from on the Avenue B open street, with Fdny and D.O.T, on the call about whether there's been some improvements going up, Avenue B for Fdny. There has been some slight improvements as what fdny discussed, there's also questions from the community in regards to some of the pattern, the parking spots and things like that and now continuously to try to help the improvements on Avenue being going forward and we'll wait for DOT to come back, probably November with those answers. But that's it. Thank you. Thank you. Paul, okay and our last committee, economic Development, thanks Alicia, hi everyone. We have one resolution for economic development. It's a pretty short one. It's a resolution to return. Sidewalk cafe application fees, so a number of businesses, particularly restaurants, have applied for sidewalk, cafe licenses and are sort of stuck in a process that is not really moving forward, and this is just a request for the department of consumer affairs to return those fees that can range up to a couple of thousand dollars, because small businesses could really use that money during this time, Meganisha Stephen. What is that? What was that sorry? Somebody unmuted themselves? I took care of it, go ahead. Okay, I do not know if there are any questions about the resolution or any comments or changes. Okay, I do not see anybody's hand no hands, Anisha cool, okay! Thank you! So much. Okay, I think value wanted to say something. Was there new business? You need to vote first? Okay, sorry, we need to take a vote. Roll call vote, Michelle, Okay, David Adams. Yes, thank you you're on Altman, yes, Jesse Beck, yes, Dominic, Berg, Lee, Berman, yes, Carl and chan; yes, Jonathan Chu; yes, David Crane; yes, Felicia Crookshank; yes, Eric Diaz; yes, Alex, Sarah, Conovacus; yes, Shirley, Fantasy, Brian, Gillan; yes, Deborah Glass; yes, Andre gordillo; yes, Herman Hewitt; yes, Trevor Holland; yes, Linda Jones; yes, Valentina Jones; yes, Tatiana; yes, Lisa Kaplan; yes, Michelle, Cooper, Smith; yes, Maylie; yes, Wendy Lee; yes, Alicia, Lewis, Coleman, yes, David, Louie, Ellen, Liu, yes, except for SLA number. Four present voting. There's a group that I work for the print one of the principles of one of the principal's other businesses: Michael Marino; yes, Alex Militano; yes, Michael Perlis; yes, Tariq Ramos; yes, Paul Rangel; yes, Carolyn Redcliffe; yes, Damaris Reyes; yes, Richard Ropiak; yes, Thomas Rosa; yes, Robin Chatel; yes, Heidi Schmidt; yes, Larissa Scheinberg; yes, Clint Smeltzer; yes, Anisha Stephen; yes, Sandra! Strother, yes, Josephine Velez, yes, troy Velez, yes, Rodney Washington, yes, Kathleen Webster, yes, Jackie Wong, yes, Ricky Wong! Yes, thank you now, I believe a value. Yes, I represent. Oh sugar. Okay, I represent the community board three on the World Trade Center Committee, and so they have in the past. Community- based organizations have provided letters of support. What they want is that they want a letter of support for their application to extend the World, Trade Center Health registry for another five years, beginning in July 2021, and the letter needs to be submitted by October 15th to the public affairs manager of the New York City Health Department and World Trade Center Health registry, so community- based organizations have done it in the past and if you're interested or your community based organization, it might be something that you want to do in terms of extending support and extending the funding for another five years. Okay, thank you. Okay, val, thank you. So much is there any other new business anyone like to share anything okay, Carlin hold on. Let me just make my TV. This is not a new business, but I made it. I'm late for the public session. I just like to extend an invitation to everyone on the community board. There's a public candlelight, visual for the for homeless men who were killed at Chatham Square. Last week, it's on October 5th, from 6:30 to 8:30 p.m. There will be no speaking, no politicking, and it's just for come by and light a candle or something. Thank you. Thank you Colin for that. Can you email us that, because that would be great like we could have shared that I do not think he means. Last week, though right there was no one killed there last week last year last year, okay last year, thank you for that clarification. Anyone else have any new business. They wish to share at this time. Okay, any old business at this time. Okay, that being said, can I have a motion to Adjourn tonight's meeting motion Second everybody's ready to go. Thank you so much have a great week and stay warm everybody and stay safe. Okay, bye now.",
            "summary": "Thank you Michael, okay, so I just want to explain what public session is for community work for the visitors that we have that have never attended a community board.\nThe public session is an opportunity for members of the community to address issues or concerns about our community So if you are a person that wishes to speak during our public session, you have to submit a speaker form on noon month by Monday the day before the full board meeting noon before full board.\nActually, just got a new commanding officer yesterday who have not met yet, but I will be meeting with him, and this is a frequent type of issue that we need to deal.\nWe have a few of our members here on the Community Board and you probably know, Grouvenir has six 21-story buildings that are on montgomery and Water Street, just acrosss from the Fdr drive and the southernmost portion of the East River Park and Pier 42.\nI urge Community Board 3 to pass a resolution calling upon the Parks, Department, mayor, De, Blasio, Ddc and orr, to ensure that the lower East side, ecology center be included in the East River coastal Resiliency planning process and the compost yard be included in all posted information about escrow and written into all escrow documents regarding the park.\nBut at some point the ecology center is going to be forced to leave Eastern Park and it has no guarantee from the parks Department that the compost yard will be allowed to return to the park after construction.\nSomeone has said that composting is not compatible with a new park, but for those of us who live within its locale in public housing, the co- ops, the Mitchell Llamas and the tenement buildings, we know the importance of having this resource within proximity to our homes.\nWe are its Guardians community board through, should urge the parks Department to re, explore and reconsider the need to include an accessible composting station and Harriet.\nI want to urge the people in CB3 to have the city change the plans to include the lower East Side Ecology Center in compost, part in the plans for the new park.\nI, hope everyone's doing well back to school So I'll just briefly spend a minute speaking about our work in that capacity, which included the controller joining many community residents at the rally in March last week where he spoke about the need to make sure open school.\nThe comptroller also released his 2020- 2021 back- to- school guide, which has a lot of really valuable information for parents and families, including on how they can engage in their school on virtual learning, health guidelines for multilingual learners, students with special education needs and that's available in English, Chinese and Spanish And I'll make sure to drop that in the chat, and I.\nWe can address the specific issues to them, which includes the unreliable internet and city, shelters, the location, accessibility of learning, bridge programs and making sure that, if students want to request a transfer to a school closer to their shelter, they're able to do so to make sure that school and education is more accessible for those families.\nIt's only becoming more important that students have access to internet at home, Lastly, to end on a positive note, at the start of the Covid-19 pandemic, the comptroller announced a prevailing wages initiative in order to hopefully return money back to workers which was stolen from them or not properly provided to them by their employees, and we are happy to announce that we have returned over 2 million dollars to workers, Acrosss New, York City, and it did a number of different know.\nBut you know thank you for continuing to have these forums in this virtual world they're in and thank you obviously Susan and alicia for all your work and all the members and staff of the board.\nWe, had a public forum a week a week The work has now begun and You know we're interested if people are having there.\nSo, that's going to be an ongoing conversation, but I think you know It's an example of the state of the city, rather really not not taking.\nIf people are interested, the continuing on housing, the eviction moratorium, the Good News is, I think.\nThe governor, waited until September 21st to extend a mortgage from that expired on September 20th, again , I think it'd be better if people, if the courts and the parties potential the business owners and property owners all have greater, you know security and advanced notice about what's going to be in place to protect them.\nIf you are planning on voting, if you're planning on running absentee, please request your absolute about as soon as possible and send it on in where you know the post office is going to be even in the best of circumstances.\nThat way, do it soon, and I would just remind people that early voting may provide an opportunity to do it at a convenient time that may avoid crowds which, of course.\nPlease tell young people to join us We do have a team community board member who's going to talk about the joys of community boards as well.\nAre we going to start doing the same cuomo's budget director Responded that the cumulative tax rate in New, York City, would be higher than the new energy tax rate that's being raised, but like we need money.\nYou do not pay taxes on that until you know, you sell the assets, but lots of people's fortunes have grown very substantially during this, so that the proposal that I'm supporting there would generate five and a half billion dollars and again that should be realizable.\nYou know like we have a city income tax, so our highest marginal rate on income is higher than the Jersey rate, even with their new thing.\nIf we want to see students, retained, persist and succeed, using those strategies, costs a little more money but in the end students graduate closer to on time, so they get to work sooner and our tax dollars are actually best spent because the students actually graduate so expanding those support.\nYou know: endangered species, clean air, clean water, so I would just say to everybody vote, and if you have extra time- There are a myriad of ways in which you can participate in the electoral system, and I would urge people who are terrified to take a little bit of your time in the coming weeks to reach out to your fellow Americans and work to see that New, York is and and the rest of the world is protected.\nYou know they look forward to going there after school and making sure they have a safe place to play and everything.\nMarch was organized by four mothers in the district and the reason for which- It was supported from all the incredible local organizations, and it is important that this is understood by everybody, because the media narrative right now is that we, the parents, just want to send our kids to school, and it's the lazy teachers or it is this and that the reality is the conditions.\nThat we did was that we need more funding in order for the future of New, York and all of new yorkers today to be safe, and so please fight for us for existing funding and in terms of taxing Like, many others said for the first time: I am with New Jersey because they had the guts to do the right thing and also consider Senator Jackson's bill, because funding for public education has been inadequate for years and any budget cut that may happen.\nThanks, for the work on the rally and for you know, people like you.\nBut if it is we'll see how this plays out, I think less than the 700,000 kids, who are scheduled to go and are going to go in because I just do not think people feel like it's safe.\nThey'll pay a little more there's nothing that proves that people leave New York City, there's no documents.\nYou know we do not want people to kill anyone, but if they do that's the criminal justice system for And So no, we do not want recidivism, but the kid who's standing on the street corner who's like selling Marijuana and gets arrested or the person who takes a loaf of bread from a store because they need it or someone who steals an Amazon, box.\nRemember, bro, President, Brewer!, I, think in terms of the jail you've heard some, but there was a meeting today with the City Council and the mayor's office, and I hope that they come to the Community, Board.\nWe are going to do another letter listing all of these issues- We, as you know, focused on them getting food during the entire pandemic.\nMy understanding is that food program and Susan may know this is going to switch over to diphtha, and I hope that works, but I think that's something that should be very closely monitored, because the seniors need the food.\nWe also gave up money from the governor to individual groups working many of them in Chinatown, and we just got a list from the U.S census of buildings that are not getting entrance to and we will go over and figure out, which is what community board we have eight days to go, and so these buildings absolutely need access.\nLet me know otherwise we're going to start with Siobhani from Eulen's office.\nShe then released a statement on schools, reopening and the need for the city to work with teachers and families and hear out what they need and what is important for them.\nI mean amid the pandemic and budget cuts, and all of that CUNY really needs funding, especially given the fact that nearly 80 percent of CUNY students are people of color and removing that resource from an already underserved community would be truly devastating.\nThere's been a lot of great legislation, put forward that really works to support our community, but none of that can be passed if the legislature is not in session.\nIf you know of anyone who needs PPE any groups, any events that you'd like us to distribute at please feel free to reach out I'll, put my contact in the little box and that's it for me.\nThe questions at this point in the meeting for elected officials and their representatives are only for community board.\nThose people should fill the census, for you know for New York, because they they're, probably in their second home You, know which contains funding for rental assistance, for example a hundred billion and which, and then these assistance would offer you know , would cover you, know: public housing and the section eight residents that you know That's floated around by Senate Republicans and more adequate than the CDC eviction.\nThe house bill is not going anywhere with the current Senate And it it's all depending on the November, election, And and then and then lastly, and then the congresswoman is working on a bill to you know to eliminate voter suppression in some of the key swing states and that's update thanks all right.\nI do not know so, if there's any way that we can support them with an extension or even listings or Whatever Thank you, Isabel Marian, from Council Members Chin's, office.\nOkay, I'm we're going to be convening the NYCHA section, 8 subcommittee on 1021, And. That's again on October, We are approaching our community board elections for our executive committee, and so during we're still in the midst of coving right, so we're still in the pandemic.\nIn the cars we've had continuing to have many complaints, Covid-19 related issues, one is people you are seeing on the street, some of whom are homeless, some of whom were formerly in programs for substance, abuse or other services that they were receiving.\nI think parks has announced that there are 30 percent short on their staff because of people being out ill along with having budget related issues and another complaint We're hearing a lot of, and which is one of the public session speakers spoke.\nThere are many times informational items from local nonprofits, such as when we got our first Marijuana Dispensary or new community services or programming.\nMembers will have a proposal to ask the board for support, such as for traffic improvements or residents, who form a friendship group, maybe for a park we may have local organizations such as Community Education Council, coming to the board for support all the items sent to the office.\nWell, at the last meeting we discussed district needs just like many other committees.\nI also wanted to let people know about another agenda.\nThey came to our board two times in the past year with you know, request for support on their new location, which we had voted on and approved, but you'll be able to hear more about their programs.\nAs Alicia mentioned a little bit earlier, we are going to hold Nycha's a committee meeting in October and NYCHA officers will come to our meeting to give us updates on resilience, programs and also general services.\nYou know two to three meetings at this point where clearly the community came out And we did a razor requesting that so should not the community board be saying about like are not we Why we take all this time away to represent community, and we ask for that.\nThere has been some slight improvements as what fdny, discussed, there's also questions from the community in regards to some of the pattern, the parking spots and things like that and now continuously to try to help the improvements on Avenue being going forward.\nThere's, a group that I work for the print one of the principles of one of the principal's other businesses: Michael Marino; Okay, I represent the community board three on the World Trade Center Committee, and so they have in the past."
        }
    }
}