{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCnSXdCNbGIrWH0l1yC3YULw",
            "title": "June Community Board Meeting",
            "publishDate": "2020-06-26",
            "shortDescription": "The Brooklyn CB 8 general Board meeting via Webex. June 11, 2020"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 0,
            "um": 1
        },
        "wordCountFullTranscript": {
            "board": 42,
            "meeting": 24,
            "community": 22,
            "committee": 21,
            "question": 20,
            "people": 19,
            "questions": 19,
            "meetings": 16,
            "chat": 15,
            "members": 15
        },
        "wordCountSummary": {
            "land": 7,
            "board": 6,
            "use": 5,
            "meeting": 5,
            "committee": 5,
            "people": 5,
            "applications": 4,
            "business": 3,
            "slack": 3,
            "resolution": 3
        },
        "fullTranscript": "And edge contracts with the city do tea with MTA and enjoy transit, which is less relevant to you guys so I have an interest. Obviously in transportation policy and land use. I live in Crown Heights on Park Place between strand and New York I've lived in New York since 1985, but I've been in and out of Crown Heights for the last ten years, depending on how many babies I had how much space we had I agree with district manager. George I just want to note that move on to Robin Callahan and just give everybody that's coming on board a chance to introduce themselves to the group. Mr. Callahan, hey everybody, I live in I, guess, sort of each Crown Heights and on Prospect, near Utica, lived here for about four years. I keep the chickens at Imani, community garden at Diamond. Schenectady. That's sort of I've had some acquaintance with the with the board in the past before joining, because we we've had some land use issues. So if I know we're not supposed to have a committee assignments ready yet, but land use is something that I'm very interested in Crown Heights. That in public safety or issues that I'm pretty interested to get and involved in professionally I work for the New York City independent budget office city agency. Nobody knows about and just here to do what I can. So. That's me that is wonderful idea was one of my favorite agencies. Okay, thank you very fun of you. - next up is Kevin Farley. Mr. Farley, are you with us I guess not so then we will go next to a Jeannie, Harris blenman. Haven't they properly join us later? Moving on to the Barbies here, I, don't know: wife aren't Farley's here, I, don't know, I can't make him a panelist. Sorry having issues with Sal Farley's here he's having issues with center. Ok, Farley. Can you hear us? Ok, well, yeah suggest. Mr. Farley, you can put any comments he's like into the chat function and we're monitoring that as well. So we can share that from there. I guess: we'd, better move on one. We have one more to go. I came here as a black man George. Can you tell if I Genie Harris one man is with us? Okay, moving on to Mario remain president no calvess, Mikkel Stein's, no, okay, Harmeet! Your super deal, no she's, not! She has a long kimberly, Watson she's, not here, okay, so we can welcome them at our September meeting. Then it's just glad we're just glad to have more people more worker bees, so to speak. Welcome all new members. Thank you. Thank you. Thank you. Our last executive committee meeting mr. witherwax who's, the head of Robert witherwax, was a head of the environment, sanitation, Transportation Committee, also volunteered to work as the board's acting secretary till the next election in 2021 and so I. Thank you very much. Mr. witherwax. Mr. witherwax is also the chair for the process of heights, Neighborhood Development Council and he's a gold star worker bee and we're so glad to have him in this community. So moving on district manager. What's next on our agenda here, we need to do a roll call. We need to do a roll call. I would ask mr. witherwax to proceed with that. I did see his face earlier or missed am I am Here. I am here ready to proceed and I? Thank you for your kind words and I will do the roll call Kier mone Allison, when you hear your name unmute just say here into Andrews Desmond, Adkins, Lisa, Atkinson, yeah, Wayne baby is present in the chat having connectivity issues as well. Ben James I saw miss James here, so I see miss James, yeah, Julia, Boyd branch. Mohammad president miss Boyd is here: I saw HondaJet Boyd is here. Miss branch, Mohammad she's also here having difficulty excellent. Mr. Bucholtz here mr. Callen. So here Charles here is Koli Daniel. Mr. Ellis Farley, we said was in the chat. Miss Ferris, miss Paris is here mr. Frasier Rasmus Gabriel yeah. It's Gibbs present this Granville yeah. This hair blenman miss Henry Henry's present. Thank you. Miss Jordan is Kinsey Misco miss laser, miss the main, miss Mahoney, this or mr. Nicholson's Kirk Oh mr. cuca mr. Kaji yeah mr. saxx mr. Saunders so co-captain statement. Superval is Tait hall mr. Thurmond yeah mr. Todd is here: Miss Tyus mr. Bocconi, here miss Watson, miss Weatherspoon witherwax present miss young, miss zuniga. We have 27 present at a 49. That's a quorum Thank You mr. witherwax George. Next item hello, mr. Mann has a question: can we only answered all questions go into the Q&A sections, which are they out right now come in come September. I have my name way. They removed you as of June. Okay, amazing I might as well not listen in. This is a community meeting. It's open to the public and your you've got good standing to be to attend and contribute to the design action items we have for tonight or two items for the Executive Committee of resolutions were continuing business about a process for membership, recognition, slack and land use, so Miss Georgia. We start with the resolution. Okay, this resolution is to confirm the authority of the State Liquor Authority and sidewalk cafe, review committee slack and the land use committee to work to act for the full board and it's been circulated to the board members and I'm reading it as we go now in recognition of the suspension of the interest and meeting requirement of article 7 of the public officers law included in the governor's executive order, 2-0 2.1 issued March 12 2020. The committee discussed confirming authority of the slacking land use committees to act for the full board until regular meetings begin again, a motion made by mister witherwax and seconded by mr. Ellis. The committee approve the concept and the language now presented for affirmation at this world board meeting is as follows: whereas the current state of emergency and the restrictions on in-person meetings implemented by EO 2-0 2.1, to prevent the spread of the deadly Kobuk 19 virus have made regular full board meetings impossible and whereas two committees with regular adjudicatory responsibilities, the SLA sidewalk, SLA and sidewalk review or cafe, review and land use committees continue to hold virtual meetings to give the board the opportunity to respond to applications that have been submitted. Having met March, April and May, with June meetings scheduled and whereas all committees, with duda Kotori responsibilities, either currently or arising, acquire the affirmation of the full board for the authority exercised thus far during 2020, as well as authorization to continue to act to the full board. On the extant circumstances, when the full board is either unable to meet during government restrictions due to government restrictions or to achieve a quorum due to technological impediments, when the full board is not scheduled for meeting be there for resolve that the full membership body of community board a grants executive authority to any committee with an adjudicatory responsibilities during a state of emergency, notwithstanding any associated technological impediments that prevent a forum and whenever the full board is not scheduled to meet, are there questions on this resolution again I asked? Are there any questions on this proposed resolution in the chat? It's nothing as of yet Miss Tyus I'm trying to follow if there's any hand raised, does this have a time limit? Wouldn't we need to do it today, I'm speaking I'm, sorry, this is this. Is robert callaghan I just wanted to know if this resolution has an expiration date or if it is continuing until it is repealed, it's circumstantial, as described in the Rezo itself? Whenever there is a state of emergency, then we will revert to the powers that we're asking to be affirmed through this action. I also see. Mr. Mickelson's has his hand raised Mikkel stay. Yes, that was actually from earlier when I was trying to get your attention. James no questions. Thank you. Thank you, okay, so mr. Callahan do you have any other concerns on the time limitation? No, that's it. Okay. What we are planning to do is to include this authority in the bylaws we're reformed the bylaws committee. We have to set a schedule for them to meet and we will follow this language into the bylaws so that it doesn't become a sticking point going forward. The agency say this is not over and it won't be over until we have a vaccine or some sort of therapeutic cure. The recent demonstrations and openings and other states they're seeing a rise in the incidence ISM infection, so we may not be business as usual. What may be a wave form kind of a few months ago, so we need to have them a way to continue to do business. Thank God, our elected representatives are rising to the challenge. The mayor just issued a statement offering $3,000 to run food restaurants throughout the city to help them stay open. So, on the local level we have help coming in. As you know, Governor Cuomo has set certain restrictions on people being evicted and people not being held to task for payments, so Miss Tyus, I apologize, but we're having some feedback and I think it's coming, maybe from Miss Ferris that she also had her hand raised hi, miss Ferris to see questions. Okay, thank you, I guess that was maybe an unintentional sorry. So please continue mr. Iyer sorry for the interruption. That's okay! So if there are no more questions on this proposed resolution, I would ask for a motion on it. Make a motion to accept the Commission's James Ellis. So I can't promise Auggie Thank You mr. Ellison mr. Saunders. Mr. witherwax. Would you please the acceptance of the resolution? Ah once again, so when I call your name, please unmute and say yes or no, if you can't do that, please register your vote. Yes or no in the chat. I can see your name and I will count your vote. Alison to the resolution, miss Andrews! Yes, the resolution Haley was a yes miss been James. Not yes, no and I can't look at the both I'm. Sorry, what's that mr. Ellis I'll happily monitor that. Thank you. Miss Boyd, this branch maja mr. Bucholtz. Yes, mr. Callahan, yes, miss Charles, yes, who's, calling miss Daniel. Mr. Ellis, yes, mr. Farley miss Ferris mr. Fraser. Mr. Gabriel, yes, miss Gibbs, yes, miss Granville, yes, miss Harris, Blenheim employment. Is it that says you can't hear anything. Peppa Henry, miss Jo, miss kinzey Misco, this Lazich miss la main, miss Mahoney, mr. bliss teams. Yes, mr. CooCoo mr. Kaji I have an affirmative, yes for mr. Prez Thank You mr. Raja Thank You mr. Ellison Thank You mr. Farley, mr. saxx. Yes, mr. Saunders, Mississippi Hill mr. Paul, yes, Thank You. Mr. Todd tires. Yes, mr. cocconi, yes, miss Watson, miss Weatherspoon; yes, miss winter Bruckner, yes, mr. Whittier, miss Zuniga Gail brings Mohammed said yes in the chat as well. You hear me princess Benton said yes, thank you, Miss Ben James, just to go over who I know? Is he missed? Boyd, miss Danielle, I didn't get your vote. Thank you. I'm. Miss Ferris, I didn't get your vote. Thank you. Did you get my vote was this? Is that mr. Atkins welcome I? Didn't I, didn't hear you, sir? Now? What are you mr. Atkins? Where is he hopped in and popped out again, mr. Saunders, what was your home is? Can you repeat, let's just say the motion passes missing Raji and Saunders as well. Yes, Saunders hasn't. Yes, I! Have the motion passing 26 a ver, no opposed abstentions. Thank you all very much. This will make everybody's life a lot easier and we will get through this together. Thank you again and we're moving on to the next item of business from the executive committee on membership, miss George as district manager. Would you please speak to this issue? Membership? Yes, miss Cole! Okay! The issue here, though, is that she hasn't been coming to meetings appointed in September. 2019 she's never attended any meetings, as per the bylaws sent her a letter regarding her attendance yeah. As for the bylaws, she never responded. We waited the response, so the next action, according to the bylaws before the full floor vote, that's what we are today. So are there any questions on this motion to remove charges the charges because a set of charges, but a comment to board members you're burning one up, miss Eunice cow, so good on you guys. Thank you. Okay. The executive committee accordingly is through this meeting this evening is recommending net she'd be removed based on non-attendance. Is there any member present? Who would want to defend this absent member misko? Unesco I do have a question yes reaching out to misko Kimani speaking. Has it been two different possible email addresses and phone numbers - misko? We sent her a written letter and we followed up with the email that we have on record from her Julian ale, Community Coordinator at community woody. Just one other comment that mr. gliniewicz, we don't take this lightly. We don't like taking volunteers off of a volunteer organization, but we need to manage our quorum numbers and if we have people who just aren't going to show that makes it harder a harder burden to bear for the rest of us. So we need to keep our forum where it's properly calibrated. We need to have 50% of the group's the room at any given time to do business. So if we have four or five who that means we have to have 25 or 24 instead of 23 or 22, to do business, so it just makes it harder. So thank you, I'm glad, you're speaking up and asking questions mr. Allison, but even with a misprint, a typo in her email address, she did make out an application to join the board. She contacted either the borough president's office or her council member and she put in the application, so she could be coming. She could have been coming to meetings from last September to this past February meeting in person without the need for us - call her behind her email her to come to the meetings, because all the information is on the community boards website and as mr. Weatherwax with mr. witherwax said, we have to have a majority of the members present to do business officially as a forum. So we have 50 members, then we need to have 26 people in the room to do business. Okay, that's where we are and I would ask that the board support the recommendation of the executive committee, as laid out by the facts of when the record to remove miss Coe. Is there a second one? Looking for the motion, I ask for a motion to support this recommendation. This is good for coming. Is there a second I also just flagged that miss James raised her hand on the function? Are you so did you have a question? Second, the motion? Okay, so we have the a motion on the floor and unless there are any other questions, are there any other questions I'm what he has to a rope horribleness to remove miss Carla? Give me none, I, guess or say miss before please unmute. When you know your time is coming, say your yes or no to the question and if you can't speak, go to the plan. Mr. Allison, yes, -! Do we move? Oh thank you miss Andrews, mr. Atkins! Yes, thank you! Miss Atkinson! Yes, mr. Bailey was a yes in the chat. Miss Ben James. Yes, this point. This branch, Muhammad yes crash Muhammad, is in the shed. She said. Yes, Thank You mr. buckles. Yes, mr. Callahan, yes, miss Charles. Yes, thank you. Yes, thank you. Mr. Ellis. Yes, mr. Farley was a yes in the chat. Miss Paris, Thank You mr. Fraser, mr. Gabriel, miss Paris awful thing. Yes in the chat yeah loud mr. Gabriel, yes, miss Gibbs lose miss Gibbs, miss Grandville; yes, miss Harris, blenman, miss Henry, yes, miss Jordan, miss kinzey, miss cow last chance, I said yes, who is that miss laser? Thank you Miss lemon, yes Mahoney mr. Nichols teens, yes, mr. pukka, mr. Raji. Yes, mr. saxx, yes, mr. Saunders, yes, miss SoCo mr. Stayton. The super bill miss Tait hall, mr. Thornton. Yes, mr. Todd, yes, Miss, Tyus, yes, Tony, yes, miss Watson, miss Witherspoon; yes, miss Wedderburn. Mr. Witter wax. Yes, miss young, miss Zuniga. The motion passes 29 in favor, zero posed; 0. Abstentions. You mr. Weatherwax, thank you all four very unpleasant tasks, but it has to be taken care of now. We have a report from the slack Committee which met on March, 2nd and also on April 6th and May 15th. Mr. Ellis, mr. am I just should I just be reading from the reports sure one second all right. So this SLIC committee met on March, 2nd 2020 of at the downtown in rehab center, prior to the pause caused by kovat 19 pandemic. The committee also met remotely by the freeconferencecall.com on April 6 2020 and via WebEx on May 15 2020. The committee approved the following applications renewals at Bergan projects at 899, Bergen Street for a full license: damos taco, 733 Franklin Avenue for a full license. Norrish ty at 6:37, a Vanderbilt Avenue for a beer wine and cider license good luck at 689, Washington Avenue for a full license happiness, lounge, 14:58, st. John's Place full license; Underhill cafe and grill 707 6/0 Dean, Street, Pier, 1 insider eat, Morris, 145, Brooklyn Avenue at beer, wine and cider Dutch boy, burger, 618, st. John's place for a full license; Sloane's barbecue and elbow room at 267, Flatbush Avenue for a full license: sweet Brooklyn Bar at 6:08, Nostrand Avenue for a full license silver eyes at 636 park place for a beer wine and cider license. The committee voted also to support. All renewals are we breaking separately mr. George or do this is one this is Julie Emile. It was my understanding from my conversations with Miss Georgia messiah's earlier today that we were going to vote on one item just to approve all of the boats, from both land use and slack. Okay. Great thank you. So I will continue to read out my report and then we can add land-uses report and ask for motion to ratify those efforts. Is that how I'm understanding that miss neele? That's? What conversations came to that was a conclusion of the conversations. Yes great, thank you for that clarity. All right, so continuing on with our report of applications approved new applications for cafe in Annie at 105, Kingston, Avenue and 755 Dean Street a full license with live music and no outdoor space. The support res room was renewed from when the applicant last presented at the board in 22, December 2017 and the applicant states that details have not changed. The initial support was on the following: understanding of hours of operation, Sunday 8:00 a.m. to 2:00 a.m. daily 42 seats, all performances to end by 11:00 p.m. an adequate soundproofing to be installed. Additionally, Nostrand social at 7:06, Nostrand Avenue for a full licence. Small-Scale patron dancing, live music, DJ stayed choose a catering facility, a restaurant and no outdoor space support was renewed when the applicant last presented before the board in October 2018 and the applicant states. The details have not changed. With the exception of the removal of the rooftop garden, the initial support was the following: live music and DJs outdoor rooftop, with 52 person, capacity, three levels for the restaurant and cabaret 39 tables with 148 seats and three bars, one on each level with 44 seats, maximum capacity, 198 approved hours of operation, closing 2:00 a.m. Sunday through Wednesday closing 3:00 a.m. Thursday through Saturday this 500-foot exception. Community benefit was mentioned that they would be offering broadway-caliber performances brought to the Unity's senior centers, focusing on jazz performances, well, host, lunches and brunches during the week and as a family and wedding gathering location, hiring young adults and training with entrepreneur sessions working with the bed-stuy restoration, Workforce Development Program from within the community, and also a capacity for handicap section with six seats for performances and lifts to be built. No third party promoters would be permitted. No liquor bottle service in any capacity on any floor at any time other than wine, and no outdoor music item number three louis quattro rios 7:59 Nostrand, a beer wine and cider license. This was renewing the support for the beer wine cider application for the aforementioned establishment. Support was renewed from when the applicant last presented before the board in April of 2018 in the applicant state. The details have not a changed. Business hours include closing that portion at 9 p.m. was an alteration application applied for super power at 7:22, Nostrand Avenue for an extension of hours of operations to 4:00 a.m. daily. Additionally, there was a sidewalk cafe: application for bar meridian at 406 prospect place a cap on seating at 18 seats, 12 on Grand, Avenue and 6 on Prospect place, an hour's ending at 10:00 p.m. Sunday through Thursday and midnight Friday and Saturday. Thank you. That's the end of the SLA activities since marches meetings and thank you, ms Neil, for putting these summaries together so that they can be covered by the affirmation of the resolution we just passed. So that's on the record. These records are available through the community board office and the community board website. The same type of activity happened for the Land Use Committee. They were the three meetings you got booted out of CNR on the night of March 5th and watched over to st. Gregory's Church and there, and we discussed the a couple of projects it's all listed in the materials that have been sent out to the board members. I hope you all had a chance to look at that online to the certificate of appropriateness, flat, no.3 Sterling place. We discussed the community benefits agreement for the Grand Pacific rezoning, which is part of the inground project, and we discussed a handicap ramp for 1370 Dean Street. All of this was done. March April, May and on June 4th just last week discussed a major project that was laid over to July, not the first. There is a second Thursday because when you await the July 4th holiday and hope the new members who interested in land use will be able to come to that meeting online July 9th regarding the project, so that those are the past projects that the affirmation of the resolution we just reviewed will cover. Are there any questions on these two committee? Summary reports and I see a hand raised by Miss. Young Oh was that intentional sorry, yeah I, think she was here. I thought she was at a TDC presenting oh okay, I'll join. She just don't join. Thank you. I just wanted you to know that I had just joined. That was all okay. Welcome! Thank you! So the next item or there any question, is I, see a question. I think an attention from Miss Debbie, Brown. Okay, question: Debbie Bowen, yes, does any okay I'm a BBA resident I think she's tied. That's why I have this is Debbie Baldwin Spinelli she's got a long history with the Community Board a former chair Transportation Committee years ago. All right so I think Glade. The Angels is also joining us, but she's on the phone she's on her phone. Is your question for her from her miss Andrews. You would have to put your question in the chat. If you can wait, she signed it. Okay, I just made her panelist Wendy Andrews has joined us. Okay, miss Andrews. Do you know when st. John's center's gonna be open? The question for Miss Bowen was asking about. Does any concerns or issues have any land use for heat? Ranchi meeting was laid off or - no I think it's just someone needs me to stop I think miss Andrews. Can you meet yourself, - I, just muted her. Thank you. Okay, mrs. Bowen Spinelli. The Hebron project was laid over to July 9th online same time. 6:30 everybody will get a notice, it'll be posted on the calendar on the community board website. Okay, any other questions on what we've covered so far. Okay, so then we'll move on to reports from other committees still do we need to take a ratification vote on those litems? Yes, we do in the we need to follow the action items. All right, then I call for an omnibus motion to support the items that have been reported out by slack and land use. According to the listing on the items distributed by the board office, so moved it's good, please call the roll and I'm the bustodian with a summary items reported missed, is I. Have a question on the motion. I believe miss been James, yes, question! I can see you can shake your head. Okay, sorry for that interruption, all right! Third, time's, a charm! So again you know where your name falls in the outfit. Please unmute be ready to say. Yes, we can't see your ear. You please you can at one of us will record your vote. Mr. Allison, yes to the verification. Thank you Miss Andrews! Yes, mr. Adkins, yes, thank you. Yes, mr. Bailey, he says yes, miss Ben James, yes, miss Boyd, this branch Mohammad. She said yes in the chat she said: yes, Thank You mr. Bucholtz Jess, - Callahan, yes, miss Charles, yes, coley, miss Daniel! Welcome back mr. Ellis. Yes, mr. Farley says yes, miss Ferris welcome back Gabriel. Yes, thank you. Miss Gibbs, yes, miss Harris blenman is Henry. Yes, thank you. Miss Gordon, miss kinzey I can skip that. One miss laser yes, LeMay Mahoney Riggins, yes, mr. polka, mr. Rutley yeah, yes, mr. edgy, yes from Adam mr. sax mr. Saunders, so co-captain statement in this super bill. This tape, all mister. Third, yes, mr. Todd, yes is Tyus, yes, the cony! Yes, thank you. Yes, oh this Wedderburn miss young. Yes, so sorry from miss zoo negara, we have 30 in favor opposed no abstentions. Thank you very much mr. witherwax, and thank you all for supporting the work that these committees have been doing over the past several months. In the face of technological challenges like we never knew so moving right along again, I asked if there are other updates or reports from other committees that we should know about cause. We have two hands up. I, don't know if they want to questions princess, been James Cowell this and Debbie Deb I, don't know what you did yeah if I may I think those have been addressed there just haven't been, they haven't either lower their hands themselves and be lowered by the host. Thank you. If I'm mistaken, please speak up not on my count. You correct. Thank you. Are there any other elected representatives that we should hear from I know Lipkin joined us. We have a few new board. Members also joined us, so you may want to go again. Let me make our no panelist wait. She is she smiling in the lips of movies. I can't hear her there she is I have so many people think you can unmute herself I know live in the microphone. I can't get to her what's happening. Ayana can't hear you he's talking she's talking. Why don't we do this? She needs to unmute herself muted sound of mic on connect to audio. Do you have that option? Okay, maybe we should move on and check back with her huh she's nodding her head affirmative lis. Sorry for the complications miss lipkin there, any announcements we need to make Miss Tyus I'd like to just remind all of our participants and our board members. If they haven't already to complete the census, our community is drastically and woefully underrepresented. Every year census is made so I encourage you to ask your neighbors and family and friends nearby to complete the census. So we get an accurate representation of our community. Mr. Ellis is critical crucial and it's something that people who really need to pay attention to I just want to add that for the business that we just went, ten thirteen seventy Dean Street has an LPC meeting coming up. Will hearing coming up on June 30th LPC is thriving as we are to continue to do business fairly and openly, so they are having Friday tutorials for their Tuesday hearings. So you can sign up. You can go online and register it with LPC the Landmarks Preservation Commission to get a toriel on how to attend their meetings and testify they want their testimony in the Friday before awesome, I own your website. Do the tutorial find out how to submit your testimony submitted the Friday before the Tuesday meeting and then attend the Tuesday meeting? Okay, so that is 1370 Dean Street coming up on June 30th, which is an applicant seeking a 100% return on their investment at that building, and in order to do that, they did four apartments which brings them under the Americans with Disabilities Act and requires a handicap lift in front of the building in a historic district. Long story short I would like to remind everyone. This is Michelle George - to remember to vote voting in New York early voting begins on June 13 and if you have already Requested a absentee ballot, please do so our no Lincoln wanted to mention. If anyone still needs food, please email, a lipkin, a Lipkin council, DOT, nyc.gov, quick, word, sanitation committee. We will not be meeting in June. Our next meeting would have been in two Tuesday's from now. So we again in accordance with board policy, we're not going to be meeting but I hope it hasn't escaped anyone's attention how vital the streets of Community Board eight have been these last two weeks: tour the marchers the protesters with thronged Flatbush Eastern, Parkway, Vanderbilt, Atlantic, Barclays Center. You know if this is. This is one of the reasons we have live in a city and enjoy our streets so much the ability for us to get together and test and make our voices heard. Some bloating is one very important, but I just want to give a shout out to your sweets. Thank you. Both very much district manager, Georgia, is a very key reminder. Vote I. Think the last day to request an absentee ballot is the 13th. If I'm correct yes, and we want to do that. If you have questions, you should be able to find out about people, you don't know about that are on the ballot by surfing the web, especially the Kings County committee website. They may have some information there or one familiar with, and please do that and also respond to the census, something yes. So everything is closed down, they're working, they're doing stuff inside, but everything else or the program stuff has been placed on hold of course, but you know it thinks something happened during this summer, I would kind of out let the community board know when they start opening up and doing all the other projects. As you know, the capital projects had probably been on hold because construction has been placed on hold until last week. I think they started going back to work so I, don't know the status or some of the capital projects we were working on, but I don't get an update by next week and find out what's going on, Regina Kinsey is was not unmuted. It's difficult to unmute people that have said I, don't know phone numbers, but he's on the call I believe you can you're able to unmute yourself. Just the host has the ability to meet people in mass to keep the volume levels controlled where the speaker can be heard. Can you do that with a phone call? Yes, you can, but yes, you can but you're the person after I think you have to do star. Six or something I can't remember, but yes, you can, but you have to do it. Okay, thanks miss Jaymes check-in that and have that information prepared in advance for next meeting. If we're still continuing this manner, all right, we're winding down unless there's something else, the project for 959 Sterling place, he brought the Land Use Committee application to go to the LPC for a certificate of appropriateness was laid over to June, July, 9th and notice will be issued. Is there anything else that we're forgetting users are not I'd like to say something? It's not that you're, forgetting it, but I want to say it and I will follow it up with an email which I said: I was going to do. I'm. Sorry, Debra young I didn't raise my hand because I can't figure out I, don't know where the hand thing is, but anyway, okay can I go. Oh, yes, okay, fine I, just wanted to be clear. I just want to say that I know that we may have not may not have an option, but there were a lot of complaints from the community members who felt that they were not welcomed and accepted and able to participate in and the last land use meeting because of the difficulties in the challenges. They gave me a laundry list of concerns that I will put in writing to the community board and they want to be able to attend. They feel they have a right to attend and they have a right to be heard and they feel that was not a fort. That opportunity was not afforded to them via this platform to sharing and I will follow it up with the concerns that they shared with me. Thank you. You're welcome. Miss Ferris has a question about absentee ballots. Yes, okay, number one on the absentee ballot application didn't apply to me. So I was wondering what do I do? What is the questions? Number one? Okay, I'm requesting interest rates an absentee ballot and check one of the reasons: absence of County or New York City on Election, Day temporarily, a minute illness or physical disability or duties related to primary care, one of its cheering whatever burned just checked on illness, because kovat 19 is the reason that you're going to use okay they're, considering the concerns about Kovac 19 to be quote: unquote: illness, okay, English son, but they're gonna- set because it's sending it to everybody to have a choice to do it anyway. So whatever you choose, it is gonna be acceptable. So it's okay! Thank you. The other questions hanging out there. We need to hear from the new board members that joined us. Wait did mark I wanna just give an update on the publication quickly. Please yeah! We haven't had no meetings for a couple of months to the pandemic, who's in communication with the 77 preset. So during protests we're pretty fortunate that we didn't have no property damage or personal injuries. According to the 77 preset, the 77 priests in also had protesters that was at their precinct. In the month of June. Everything went along peaceful and orderly so that when they went along good for the month of March was pretty quiet in the community as a whole. April that made they said that there was a pickup and shots fired in the community, so that was a concern and in reference to the staff of the 77th priests and they had 14 approximately 14 officers that had tested positive for the kovat or the Colvin like they have all become recovered and the staff is back up to regulus capacity lucky anything else. Mr. mayor about asked about information about early voting and I will put a link to information that I found online in chat voting. You want to share anything else for other people who may need that information. It just says: I'll read what I'm reading it just says that early voting for the June 23rd primaries starts on June 13. There's a poll site locator that you can follow through with. Thank you yourselves. That's very helpful. Are there other questions concerns play great time here? Yes, mr. Thapa observed this afternoon that the police barricade a Park, Place and Brooklyn Avenue has been removed. Likewise, the barricade at Park Place in Kingston Avenue I sent photos to the community fairs over sir Mike neopolitano and he responded promptly to order to the. But are you saying that those streets were supposed to be closed and now they wrote? Yes, that's exactly what I'm saying they were closed. We were closed several days last week when I went by, but today I noticed they are now open and no one's aware why they were reopened. It could be some polite, motorist removed the barricade and no one bothered to return it, but they are seven precinct property and I'm, assuming the seven precinct should be involved in getting them returned. I, don't know, I also noticed that they were supposed to have an blockades on rorey Avenue between Saint John's and Eastern Parkway and checked a couple hours ago. There were no blockades present at all, so this is part of the safe streets safe, something program, I believe that mayor's Institute it's our conversation earlier today, I reached out to do tea and I'm awaiting their response regarding the barricades being removed. So once I hear something from COC I will let you know: I have a raised hand, mister, the Kona tea and then I'll miss Wedderburn, just a just a cue people on open streets, I just wanted to I just wanted to say that we noticed in Prospect Heights on Underhill, Avenue and Carlton Avenue. There were days when the barricades were not being placed, they were still there, but they were not being put up on the street at 8 o'clock in the morning. We attributed that to the police being preoccupied with the demonstrations and we some VOT that the residents could put the barricades up themselves if the police were not there to do it. So if you see in the Crown Heights open streets and the barricades are lying there on the sidewalk, you might just ask the OT if it's okay, to just go ahead and put them up. I thought. That was the reason these open streets had to be sponsored by an organization, because the organization members would now be responsible for opening and closing the street. That's how I understand it to be. That was the first rollout of the program, but they expanded it to include streets manned by either deity step or the precinct step yeah. The second round of the second round here, especially in Brooklyn, mostly had streets that were maintained by NYPD. Okay, thank you all miss letter, Byrne hi everybody just as on we can all stay in place. Children haven't had the opportunity to go to school this year. The do-e has a target date of September 10th, the school opening, and it's going to be very different from what it has been in the previous years. They're, putting an emphasis on enhanced health transforma inform transition, blended learning. They are considering a rolling pause start, so any number of variations and looking into building operations. So, as this is fleshed out, I will send the report to the board office and the board office can in turn share it with the UM community board and the community at large how's. The Buckholtz in here. This handout I want to put my hand, I mean I, would just say very briefly that I work, my professional job I work with sidewalk improve the team at D-O-T and I understand that citizens are encouraged to restore the barriers whenever they want to and there's no prohibition on doing it. That said, I have not had good luck in maintaining the barrier at Park Place between Brooklyn and Kingston. I believe it is, but I have I have I have been told by DoD personnel, but if the barrier is not up in the morning when it should be, if you feel free to put it back up, that's all well, it sounds like you're, a good person to ask among Sterling place between New, York and Nostrand, and we have a SAPO permit approved for the first Saturday in August for our annual Kids Fun Day. You know we just closed our little strip, Sterling place between New York and Ostrom in the kids, ride their bikes up and down the street, so I. Imagine that still gonna be okay. I would assume if you have, if you have a permit that was already granted I know the individual with whom I work. We have staff who work in their office, so they send me the timesheets. They have a lot of things going on these days. But as long as you have an act permanent, you should be fine. Thank you. I have a question. Yes, the question / request, not so sure mr. witherwax, at how we could proceed with this for the last month and a half I've been walking. Eastern, Parkway and I noticed that on the eastern end, east of cross and Avenue, there are no directionals on the ground for bikes and walkers. Once you cross an avenue, you have directionals for the bike, riders and the walkers, not that everybody adheres to them, but I think that, under the certain circumstances it would be helpful to have those further east, because there are a lot of people out there walking and I. Don't think people know how to manage where to walk, how to walk to avoid the bikes yeah. That's a great question, the short answer: it is the bike lane on the median technically crosses from the north side of Eastern Parkway to the south side of Eastern Parkway at classic so technically bikes. The official bike lane is only on the southern median from class and East, so there wouldn't be markings on the north side median from classes. That would only be from class into the West. But your point is still well taken. I mean we share the streets. We share the medians we share the spaces I would support exploring how do we get some signage, even if it isn't on the ground markings that makes that clearer reminds people awesome, negative interactions? Okay! Well, let me just so for clarity, I'm, not talking about the northern end versus the southern end, I'm just talking about the eastern end versus the western end, because people are walking on both ends, but there are no directionals at whatsoever. East of cross, an avenue did I, sorry, I'm, sorry or east. Of course, an avenue was an avenue going all out to Rochester going east I could only speak going east from Clausen Avenue to New York Avenue, because that's where I start to walk, there's a BH medians of Eastern Parkway. There are no white markings on the meeting. That's the only Lane is on the cb9 medium. That is very true. I've walked that to the subway station for years, so what they did was put down different types of brick down the middle of the south side of the Eastern Parkway median, and they used to have paintings of bicyclists on the wide side of that brick divider in the middle of the median on the south side decent properly going to the train station. Okay. This is a good point just from the interest of safety and they contribute I'll share the space. Why don't we put some markings down sign some way on the north side, east of classes? It would be a wise thing to do. North south, east and west I'll reach out to you tomorrow, exact location and we'll touch base with DLT. Mr. Merrill put a question in the chat regarding the locations for early voting and I will email those locations to everyone either tomorrow, on Monday, very good I know for a certain date or date. Certain Brooklyn Museum is one I, don't remember the listed I'll email. The list out to everyone. Ms Gibbs, has a question: go ahead, there's more hello! Yes, it's more, but I'm common for Miss Tyus question in reference to her permit. The city has technically held a moratorium on all permits. If you, even if you have an approved, permit contact your sample office as well as your local precinct officer, green and Pia Louise have been rather busy like the rest of NYPD, so I'm called in before you stop making any preparations because the city hasn't made. It has put a moratorium on all city permits because of the situation that we're currently in so before. You start planning in purchasing stuff contact them first. This is a good possibility. Your permit has been hold you. Thank you. He actually didn't plan together just to close the street, so the kids could run up and down same principle as open streets just close the street and let the kids ride their bicycles in the roadway and no gathering to eat together and large numbers, or anything like that. Thank you. I would suggest cold and cold priests indirectly and explain exactly what you said and the way they can keep it down, because otherwise a permit to ride the streets is aka a block party and there's none of that, so just give them a call reach out that was all I had to say in our newsletter that we send out today you can find poll information in that newsletter. We mail be emailed it out to you today. You should have it in the email. Thank you. I've also included a link to the site locator by that you can plug in your address and find the closest one in the chat. Okay. So we all want to know where early voting is got a vote. Unless you want to see president Trump reelected, we have the new board members. You want to go through that I think we stopped it. I Jeannie Harris blenman, hello, Alison, Lisa, Atkinson, Jeonbuk holes and Robin Kalyn, robert callaghan, so anyone else is on the chat. That's not those four! We still need to hear from them. Hello, just you know, ask you know, tell them what you want to hear what you want to know. Yes, welcome to the community board and thank you for attending our list. Here we go through the five new members and tell us, as we call your name please. Let us know a little bit about yourself and if you decide which committee you can check with district manager George and see how that will work for you, whatever Committee you want to check into, but for now just tell us something about a little bit about yourself. Miss Eugenia, Jeanne, harris blenman. Would you go ahead? Please? Yes, my name is I Jeanne Harris blenman I live on Park Place between those two new New York Avenue I've been here for 51 years. Oh, my goodness, my neighbor is mark. Turton Johnny Graham drew what I kind of say. I've met some majority of the people on the community board because I've been in different groups in different organizations, I said I haven't decided yet what well group I wish to be in yet I haven't decided. Yet it's still up in the air, but thank you and I appreciate it. Thank you for joining this is such a fun group there's so much to do. We welcome all volunteers. So again, there are two committees that meet over the summer. That's the State, Liquor Authority sidewalk cafe review committee. We call it slack, you lift out the arse and won't be slur and the Land Use Committee so and those dates will be posted on the community board calendar a website and will, of course be using a virtual meeting platform WebEx. So those are two you could work with over the summer and then, if reception for September over the summer talk with ms/ms Georgia, a district manager or Ms Neil, our community liaison, and they can help. You pick a committee. So thank you again. Our next up at describing themselves is Mary old. The main are you here: okay, all right, so we'll move on to calvess, Nikhil Stein's, yes, good evening, everyone. Thank you Miss Tyus, my name is call this Mikkel Stein's I'm, a relatively new REM residence in Crown, Heights I, moved here about three years ago, I'm originally from Toronto Canada. Thank you. Thank you very much. I I'm really pleased to be on the board and I feel really very honored to be on the board. To be honest, I work as an urban planner in Community and Economic Development and I'd like to burn most skills to the table and help improve the neighborhood in any way. I can. My main interest would be participating in economic development or youth development committees and I look forward to working with everyone better. Thank you. Thank you. Thank you very much. Okay next is Carr Misha superval and she joined us yet don't think so Oh. Lastly, we have Kimberly Watson hello, hi, I'm, Kevin I'm, a licensed social worker I would like to be born and raised right moves away when I was 11 and came back at the age of 25, I actually did participate. Last year, but I didn't know, I had like an underlying health issue and work-related stress that ended up in Kings, County hospitals like two months at the time, I was a part of I had like one more meeting and then I would have been underneath an Education Committee. But then all of this crisis started happening to me and then, when I wanted to rejoin pandemic happened so I'm. Here now, I would like to still be a part of the youth and education committee and I did. Are me connect with Sharon? So you know continue our work and I think if the summer committees need folks I'm willing to participate on slack during this time, but I don't work for the New York City Department of Education in the office of safety and development as a social, we're becoming fearsome. We're gonna have a really fearsome community board here. Watch out. Okay, this is great. Thank you very much. George is there anything we should be covering before we start to wind down, I just received a phone call from district leader, a Lobby she's, actually on the phone with us and early voting. You have to be assigned a polling site, so she just sent an email to the board with instructions of website. So I will be blast that out tomorrow. Thank you, okay, Miss Tyus. We also have it was at mr. Callahan I, don't know if he had did he have a chance to speak earlier. Okay, I just got a notice in the chat about this. Okay he's our Imani chicken keeper right now, I recall, think sorry, mr. Todd he'd already spoken all right, so keep saying we're. We missing only missing. Anybody is something we should be covering because we won't be getting back together as a big group until September, we should emphasize how good we are, keeping meetings, -, 90 minutes or less. Thank you, mister, where the wax, oh okay, and before we decide to separate ourselves for the rest of the summer, except for those two committees. The bylaws committee needs to agree on a date to get together to fold all of this loosely generated materials and to something cohesive that we can work with and defend as we go forward to a new world, because I don't think this is over. I think we're going to see a lot of digital meetings and we've grown virtual meetings and we're going to need to nail it down. So people don't feel disenfranchised like to be community residents felt coming into here on giant land views project in the crown versus director speak. We need to be able to make both our pointed community board members comfortable, very comfortable and adroit, with using this new platform, because it's not over ditto for the casual community board meeting attendees who come for one-shot projects, and so we need to work on that because that's not gonna be over either I. Don't have any ideas right now, other than periodic training sessions similar to what LPC is doing for your hearings. Any comments on that suggestion. It's a moment of silence and I. Don't have a comment on that. But I have a comment: a suggestion to the board members. We published a monthly newsletter. Please take a moment to read the newsletter. A lot of these questions were answered in the newsletter. Just take a few moments. We put a lot of work into a lot of work and research into putting our monthly newsletter together. Please take a moment to review the newsletter. We email it to you. It's on our website at Brooklands, cbh org. We try to keep our website updated. Take a look at the website. Read the newsletter. Please read the emails that we send you guys we send out emails, please read them, read them thoroughly. Cuz! A lot of the questions are answered in emails and then we get on these WebEx over in the meeting. If people ask the question: where is this? Where is that and we sent it out so please take a moment to review all the emails that we send you fire into a meeting and go through the website because you post a lot of these information points on our website. So it's there. We do it's a it's, a very good job. We have a list of new legislation that was just passed. That's in the June issue of across the board recently passed legislation at the state level. So what if you really do want to take a closer look at that? Thank you. District manager, George, okay, there's another business I motion to adjourn his office that she's on call she's on online, but on the phone. I guess I could say something Karen's from the DA's office that on call and she would like to say something: okay, he has to unmute herself. We knew her okay. She just texted me back. She said I would like to let the arm CB know. Hi I'm I am on call just saying, hi and I'm in office. What hold on it just went off you let the CB know that I am on call just saying hi and our officers walking up 25 percent in the office. So she said the officer is working, but only 25 percent of the staff. Is there the DA's office and healthy and sick regards from the Dean Street Dean Street square block; Association no Mizzou Nagar a quick recovery from her illness. So that being said, I'm gonna close the meeting you guys, please keep an eye on all this construction that is going on, that the permits are rescinding but they're still working. Okay, my thought for clarity. Phase one of construction began again this week on Monday Thank You. Mr. Ellis, certain projects have been given a green light to start that does a good job with posting permits and saying who's on who's off. So we could. We can do that so again, unless there's something else close the meeting and thank you all for coming and I. Thank you enjoy your summer. She never do come back.",
        "summary": "That in public safety, or issues that I'm pretty interested to get and involved in Professionally I work for the New York City independent budget office city agency.\nIt's open to the public, and your you've got good standing to be to attend and contribute to the design action items we have for tonight or two items for the Executive Committee of resolutions were continuing business about a process for membership, recognition, slack and land use.\nThis resolution is to confirm the authority of the State Liquor Authority and sidewalk cafe, review committee slack and the land use committee to work to act for the full board and it's been circulated to the board members and I'm reading it as we go now in recognition of the suspension of the interest and meeting requirement of article 7 of the public officers law included in the governor's executive order, 2-0 2.1 issued March 12 2020.\nThe committee approve the concept and the language now presented for affirmation at this world board meeting is as follows, whereas the current state of emergency and the restrictions on in-person meetings implemented by EO 2-0 2.1, to prevent the spread of the deadly Kobuk 19 virus have made regular full board meetings impossible and whereas two committees with regular adjudicatory responsibilities, the SLA, sidewalk, SLA and sidewalk review or cafe, review and land use committees continue to hold virtual meetings to give the board the opportunity to respond to applications that have been submitted.\nAs you know, Governor Cuomo has set certain restrictions on people being evicted and people not being held to task for payments, so Miss Tyus, I apologize, but we're having some feedback So. If there are no more questions on this proposed, resolution, I would ask for a motion on it.\nThank you again and we're moving on to the next item of business from the executive committee on membership, miss George as district manager.\nI would ask that the board support the recommendation of the executive committee, as laid out by the facts of when the record to remove miss Coe. A second one?\nThe committee approved the following applications renewals at Bergan projects at 899, Bergen Street for a full license: damos taco, 733 Franklin Avenue for a full license.\nIt was my understanding from my conversations with Miss Georgia messiah's earlier today that we were going to vote on one item just to approve all of the boats, from both land use and slack.\nSo continuing on with our report of applications approved new applications for cafe in Annie at 105, Kingston, Avenue and 755 Dean Street a full license with live music and no outdoor space.\nThere is a second Thursday, because when you await the July 4th holiday and hope the new members who interested in land use will be able to come to that meeting online, July 9th regarding the project, so that those are the past projects that the affirmation of the resolution we just reviewed will cover.\nMr. Ellis is critical crucial and it's something that people who really need to pay attention to I just want to add that for the business that we just went, ten thirteen, seventy Dean Street has an LPC meeting coming up.\nLet the community board know when they start opening up and doing all the other projects.\nWe were working on, but I don't get an update by next week and find out what's going on It's difficult to unmute people that have said I, don't know phone numbers, but he's on the call Just.\nUnless there's something else, the project for 959 Sterling place, he brought the Land Use Committee application to go to the LPC for a certificate of appropriateness was laid over to June, July, 9th and notice will be issued.\nI just want to say that I know that we may have not may not have an option, but there were a lot of complaints from the community members who felt that they were not welcomed and accepted and able to participate in and the last land use meeting because of the difficulties in the challenges.\nIt sounds like you're, a good person to ask among Sterling place between New, York and Nostrand, and we have a SAPO permit approved for the first Saturday in August for our annual Kids Fun Day. Their bikes up and down the street I would assume if you have, if you have a permit that was already granted I know the individual with whom I work.\nMr. Merrill put a question in the chat regarding the locations for early voting and I will email those locations to everyone either tomorrow, on Monday, very good I know for a certain date or date.\nUs know a little bit about yourself and if you decide which committee you can check with district manager George and see how that will work for you, Oh, my goodness, my neighbor is mark.\nIf the summer committees need folks I'm willing to participate on slack during this time, but I don't work for the New York City Department of Education in the office of safety and development as a social, we're becoming fearsome.\nSo people don't feel disenfranchised like to be community residents felt coming into here on giant land views project in the crown versus director."
    }
}