{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB1",
            "channelId": "https://www.youtube.com/channel/UCjXB7nX8bL2U2sje8d212Yw",
            "title": "11/17 Waterfront, Parks & Cultural Committee 2020",
            "publishDate": "2020-11-18",
            "shortDescription": "",
            "lengthSeconds": "2:11:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB1",
            "normalizedName": "Manhattan Community Board 1",
            "twitterName": "Manhattan Community Board 1",
            "youtubeChannelName": "Manhattan Community Board 1",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "twitterHandle": "@CommunityBoard1",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "AxY3Hq649FA",
            "fillerWordCount": {
                "uh": 220,
                "um": 260
            },
            "readTimeFullTranscript": "78 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "space": 79,
                "banks": 68,
                "bridge": 59,
                "park": 58,
                "parks": 42,
                "skateboarding": 28,
                "place": 25,
                "spaces": 22,
                "skateboarders": 18,
                "security": 17
            },
            "wordCountSummary": {
                "space": 25,
                "banks": 23,
                "bridge": 20,
                "parks": 15,
                "park": 15,
                "security": 6,
                "skateboarders": 6,
                "recreation": 5,
                "skateboarding": 5,
                "friends": 4
            },
            "fullTranscript": "Yeah I think we're good to go okay, so good evening. Everyone and welcome this is the November meeting of the waterfront parks and Cultural Committee of Community Board one. Thank you all for being here. Let me quickly introduce a couple of people who are with us as they always are. We have Andrew Zelter, he's the co-chair of the committee and we have Diana Suitai who's, the director of land use and planning for the community board. So with that, we have a few items on the agenda. Let I need to walk you through them, but we actually are going to rearrange the order of items we're going to start with what had been item two, which is encouraging the formation of friends of groups for parks in community district, one I think the reason we're undertaking. This is probably clear to most of us, because the city is in a very difficult budget situation, as is the state and everyone else, and there is a distinct likelihood and there have already been reductions in the numbers of workers assigned to our local parks to maintain them, etc. Community board, one does have a number of these friends of groups that have emerged over the years and they do a good job to help maintain their park, help lobby on behalf of their park and organize events and do other things so I think it's something that we should try to encourage as a community board, and but we do need assistance from the Parks Department. So with us tonight is Kyle Kelly he's with us part well, you'll have to clarify this Kyle. Are you actually associated with partnership for parks, or are you just a general community affairs person for parks? So why don't you just introduce yourself and then take it from there? Kyle, no problem! You hear everybody hear me yes good evening, everyone, my name is Kyle Kelly, I'm a I'm. Actually, the outreach coordinator for partnership for parks, so I do work for partnership with parks, but I'm mainly on the park side of things. So that's why it's great that I'm here tonight, for those who may not know about partnership for parks, partnership with parks is a it's like. A joint organization between the city, Parks Foundation and the New York City, Parks Department, so we'll be actually celebrating our 25th year this year. Unfortunately, due to everything that went on, we didn't we couldn't celebrate the way in which we wanted to. We had a great mural and everything set up in arsenal so that everybody who comes and visit the arsenal could see it, but you know we're going to take things virtual, so yeah, so just to go based off. To give you a little bit about partnerships like I said before we are private public partnership, where we have a non-profit society and a prophet side and me being the outreach coordinator, I bridge that gap between the community and the parks, Department and the city parks foundation, and vice versa. So our main goal here, as we me as outreach coordinator, is to help these groups in these parks in the different districts. I oversee park, districts, one two and three. So that's my role there. We help with many different things whether it comes from programming understanding how to start a group. Once you get a group, once you get a group learning about funding, helping groups become 501 3cs. We also offer 501 3 sponsorships. We hold the money for you guys. We do offer grants of partnerships, we help with website development and we help with just creating a website in general. So say you have a website already. We can go in and help you spruce a few things up. If you feel there's a need and if you don't have a website we'll help you get a website, we help with promotional items such as flyers and pamphlets, just so that you guys can be a fully functional group. Our goal here is to you know, have as many resources and around in these different communities and we feel like friends of groups. You guys know your community's better than we would you guys live there so forming these friends of groups so just forming a group in general, a group of people who may just want to clean the park. Every couple of weekends is a huge help to us. Like Paul, said right now, with the pandemic heading. Usually, we have a huge number of seasonal workers that come in through this from the beginning of the year throughout the end of the year, and when the pandemic we weren't able to hire any of them. I think like we did. Last year's our numbers were really slim and lava parks took a big hit and, as you guys can see from the trash accumulation to when we got hit with that that storm where the trees went down and there were trees everywhere, I know me living in Queens. It was ridiculous and I know other parts of the Bronx that my other colleagues live was out of control and especially just in Manhattan me coming into the city, just to see how things look hectic as well. So that's pretty much what we offer and, of course we work with all the surrounding city agencies, so any resources that we may not be able to help you guys with you, try to go out there and find the resources for you guys we're pretty hands-on. We offer a lot of these different webinar classes once you decide that you want to be. Somebody wants to be your friends up group. We go through a whole line of meetings and workshops to get you guys to make. You guys feel comfortable about the next steps. In what you're about to take I can say. Last year, I was able to form a friendship group down in district three, not too far from so Lane. Park and they've been doing this thing, because it's my park day, it's a thing that we do planting bugs plants, all anything you could imagine. We do I mean in Manhattan on the Manhattan side. We do it two times a year. We do it in the spring and one in the fall. We usually do. We do one big project around the whole barrel at one time, so every park from lower Manhattan to uptown is doing a project at the same time and we were able to do it this year, of course, with the regulations that were put in, but we made it happen, so that's Mariah. Well, that was good. That was very good, so if the community board were to send out information to or offer to help different people in our district who are interested in forming these types of groups, you would be a person who would assist and work with them and give them the know-how of how to go about doing what they want to do. Yes, sir, like I said, we've been rocking out for a while now and we receive a lot of different groups, and you know district one is my district that I don't get a lot of groups from, because this just depends on how things are placed like I. Just did one with City Hall Park friends of City Hall Park, so they just did their first. They just did their first, like partnership with parks. It's my park last week and it was great to see and then one thing we do is not one thing: we do a partnership. We try to. Let you guys connect with all your. You know district managers, regional managers, anybody that can be an assistant because yeah we are helping yeah we're helping you guys with the programming, but when it comes to major issues in the park, you should always know who your district manager is. You always know who your manager is and you guys being CB1. Your regional manager is Therese Flores, as you guys may know, and Jamal Patterson. Who is your district manager? Yes, okay, so let me let someone else go Andrew. You have your hand up. Why? Don't you take it away? Sure thanks Paul and thanks Kyle, that update is very helpful. I just I think this is a very timely subject and I just wanted to share my experiences. This fall with various recreational activities that we put on for baseball and softball and no surprise, given the inability to bring on the seasonal resources, combined with the fact that the ball fields were sitting idle, pretty much all of the spring and through a good part of the summer, when they did start issuing permits that the parks department, the fields were just really a lot of to bring into a playable state and that's not a meant as a criticism at all, but simply that we're an environment where the resources are so stretched. The ability to keep these parks almost at a bare functional level is a bit of a challenge. So I think it's incumbent upon the community to consider how we all can get involved. Even post Covid-19 yeah just step in and support I know we, as a league are coming forward with helping to purchase maintenance equipment, doing some painting of the facilities around the fields, and it's just been an incredible community experience for our kids. So I really like this topic and hope that we're able to embrace it and advance it and that's something that we've seen throughout the whole borough once the pandemic hit, and once we realized that you know, people really want to get involved. We've seen a large number of just community residents coming in and stepping up, especially when it came, came down to the trash removal, and you know at the time we weren't able to remove as much trash as we used to due to the fact that we didn't have our seasonal workers. So some of these parks, like you said it just didn't, look in the best in shape like that, like we knew it was supposed to look so the fact that we're able to get community residents, people who you know care about their part to step in and help that's big, and we hope that continues like you said throughout this pandemic, and you know after you know it's over. Do you have a list of friendship groups? So, oh funny, you mentioned that we're. Actually, that's our next big project right now that we're going to work on we're going to do a gi map, all the friends of group throughout the whole Manhattan, and it was it kind of raised the red it kind of rated flag in my head cause I was like wow. You know we work with all these friends of group. Why we didn't have one you know prior, but you know we just get so wrapped up in our work. We don't usually be. You know, think about that, but we're right now we're working on a map to map out every single district and to map out every single friends of a group in the parks in which they are you know using. So we don't have it right now, but that's something we're working on diligently at the moment. So once it comes out we're going to make it available to everybody to have access to, because we feel that be a great tool for people who not only want to know about the friends of the group might want to get involved, enjoying that friendship group just to do like a volunteer project with them. I mean I'm sure, I know of a number of groups and I'm sure others on the committee do Diana. Does the board have a list of these types of groups for board? One I bet we do somewhere, but I mean ground, for it is Dm yeah. No, they were and the thing about it was. There was like a little it's like a little outline of every community board, and that outline has some of the old friends of groups that might have been there prior, and you know due to time some of those friendship groups aren't as active as they used to be so things like that. What we realize need to be updated and that's what we're doing right now in the process of updating, okay Kathy did you want to say something? Yes, sorry I needed a minute on mute, hi, Kyle I was wondering if you were aware of the daffodil project and okay, and is there any for those of you who don't know it's not going offer from the Dutch to provide daffodil bill bulbs, free planting in the parks and commemoration of 9:11. and I'm wondering if you're doing the 20th anniversary of that event is coming up and they did not do the distribution this year because of Kobig. But I'm wondering if you have any plans in the works with them. Well, like I mentioned yeah. Well, like I mentioned a couple of minutes ago. We have this thing called it's my park day and that's the fall time. As usual, we have a green acre fund, grant that we use and we go out and we purchase like 20 to 30,000 different bulbs, and you know we did that this year and unfortunately you know we only do it probably two weekends in that in the fall time. So we did it the first two weekends of October. We did the distribution of the daffodil bulbs and the focuses and all the different bulbs. So right now we don't have no more because, of course, you know, we don't know how we're going to be able to get them and just to speak on what you said about the daffodil project. I will look into that and to see if there's any updates that they might have, because on our end, because we try to work hand in hand with them, because a lot of our group utilizes utilize the daffodil project, to get that for those especially around the full time, and we usually try to understand when they're going to do their distribution. So we can do our distribution, but we haven't I, haven't heard anything back from them yet so, once I hear something back, I can try, to. You know, send a message out to the community board to give you guys an update. Thank you. No problem. Okay, I, don't see any other committee members with their hands raised. I do see. One message that was put in the chat and I said: what are the plans for the broken banks and what would be a realistic way of getting life in the state parks in New. York I can't really speak on the Brooklyn banks, but I can address probably the getting lights in some of these parks. That's something that then, when you say lights, you probably mean like the bulbs- and you know just the overall lighting of the park. That is something that we've been working on: to try to get some more get our lights out parks brighter at night, because we understand probably walking that night Tom can be a little dangerous in some areas with you know, without having no power and all our parks do offer power with our power lines and our light posts. But that is something that we are working on right now and getting our lights put up on there. Okay, any other members of the public trying to or wish you to ask a question. I see: Neil Mossberg could I'm kidding? Can it anyway open up at skate parks that just that depends on that park and the park supervisor on on whether they want to open them? I know right now, due to like I, said anything when it comes to a comfort station being closed and not being open. It all goes back to the staffing issue, so yeah, but sorry Neil, no problem yeah. This is Neil Mossberg, I'm the chair of the old Seaport alliance and we've done work with other parks in the neighborhood, particularly peck slip. We took it from gravel to you know where how where it's going today, I think Brooklyn. Banks is actually a pretty important piece of the city and I think you know, especially now you know New York's, taking a beating, left and right on a public level and I would like to know you know what type of working group to your point before it's something that I'm pretty passionate about growing up in the city and I. Think you know I'd like to find out more about bringing the resources to bear, including you know, including money from personal members, corporations and other places. There's you'd be surprised about the people that once skated at Brooklyn banks how successful they've all become some more than others. So I'd like to learn more and possibly something offline, maybe not even here Brooklyn banks is something that's important to me as a resident of the neighborhood and as a true New, Yorker, okay. Well, what I'm going to do is I'm going to put my email in the chat right now, so everybody can see it. Some of these questions that you guys may have I can easily get you guys some answers once we, you know, get offline here, because I have a numerous amount of resources from the people who I work with in the district. I know you guys, I, don't know if you guys know Steve Simon, Steve, Simon, Therese Flores. They are great resources for the map, for the whole entire park manages Manhattan but parks in general, but I'm going to put my email in the chat so that you know once if I can't answer the question here, I can try to answer it after the meeting is done great. Thank you. Okay. Let me just make an announcement that the next item on the agenda is a discussion of the bridge banks and the future of it. I'm trying to get it reopened as well as another space that we call the dugout. So any people who are here for that hang in there for another minute. A couple of minutes we'll be right to that item and be discussing it. So that has been a priority Kyle just so you understand for the community board, they closed the Brooklyn bridge. Banks was, you know, served not only the community, but people from way outside. It was one of the most popular skateboarding parks in the world and it also had other recreation spaces in it as well, but the parks department I mean D.O.T closed it in 2009, and at that point they indicated it would reopen in 2014. Well, here we are not reopen and now they're telling us it may not reopen for another quite a bit of time, but I'll get to that in a couple of minutes. Well, you're, muted, oh well, I'm sorry! I have class at 6:30, so I have to go soon, but what I would do is I will send an update. I will send an update email with Steve Simon. Ask him about Brooklyn banks and see if he can give me an update and I will shoot that response back to you guys. For some reason, it's not letting me put my email in the chat, but I did email. My my email over my email is kyle.kelly at DOT, Parks.Nyc.Gov, hi Kyle, it's fanny here I'll play the chat for everybody and they don't have the the ability to chat everybody at once. So I'll do it. Thank you. So much and I hope you guys have a great evening. Thank you for coming and board members. Don't hesitate to think this over and try to talk to your neighbors about supporting our local parks. Thank you, Kyle. You have a crazy thanks for joining us, no problem. Okay. So why don't we move on I know we have quite a few people here who are interested I think mainly in the Brooklyn bridge banks. Let me give a little background for people who are less familiar with the Brooklyn bridge banks, as well as the other area that we're looking to take and reopen as recreation spaces for the community as you've probably heard me bellyache for years. But it's true, the east side of Community board one is not, does not have a lot of recreation space, particularly active recreation space, particularly for youth and others that are a little beyond you know, toddler and playground age, people who want to ride a bike or fly kite or ride a skateboard or do any other activities, basketball, Et cetera. So we are always trying to rack our brains to truck to come up with spaces that might work so the two spaces that we're going to talk about tonight. One is the Brooklyn bridge banks. So, as I said earlier, the Brooklyn bridge banks- Diana- maybe you could well I, unfortunately, I didn't come up with any I, could have come up with all kinds of pictures of hundreds of skateboarders there skateboarding and doing their thing, and it was quite a scene for many years in community board one. It basically was on the south side of the Brooklyn bridge between Pearl Street and park row, so right adjacent to the arches, where there was a red, brick plaza and that's where it basically came. People created it themselves. Frankly, eventually, the city did come along and built some basketball courts and other courts that served the community and again in 2009, the D.O.T came to us and said well, unfortunately, we have some repairs. We need to do on the bridge which is going to necessitate the closure of the space, and at that point they were telling us, or they were estimating that in five years it would be reopened. Well, let me read you a memo. We've been going back and forth with D.O.T, we tried to get them to attend this meeting and they just would not. I am not really happy about their attitude and their approach, but maybe this memo will give you the idea of where they're coming from on this. So this is a memo they wrote after I had gone to Tammy and the community board to try to you know, impress upon DOT to come to the meeting. So here's this is from Ed Pinkar from New York City D.O.T. Thanks for your patience as I reviewed this issue with my colleagues. As you know, the city closed the area at the Brooklyn bridge, unofficially known as red Brick park in 2009 for construction and security purposes. The space provides access and staging for work on Dot's bridge Brooklyn, bridge rehabilitation contracts which seek to keep the iconic broken bridge now past 135 years in service in a state of good repair, maintenance of the bridge is a constant process. At present, DOT rehabilitation contracts are focusing on various elements of the bridge, including rehabilitation of the structural arches in Manhattan and Brooklyn replacement of several bridge systems and the repair of the suspender system and main cables. This work is projected to continue through 2033. Please note that, while our I guess he left out, while there are intermittent periods between construction contracts, when the area is not fully used, overall, work will be near continuous for the next decade and beyond. Further, as previously explained by my former Borough Commissioner Sanchez, in coordination with NYPD. This area is closed. Security zone is a closed security zone. The space known as the dugout is an essential D.O.T off-street facility that houses several operational divisions, including our bridges facilities, roadway repair maintenance and fleet divisions. These crews perform daily work from bridge preventative maintenance to roadway resurfacing that helps keep the city's transportation network moving forward, D.O.T plans to add additional operations to the space in the near future, including contractor operations to minimize our footprint within other areas of the community. Please let me know if you have further questions. Okay, so let me just go on for a bit. Needless to say, this, coming back from D.O.T he's trying to shut the doors as hard as humanly possible, with a response like that. Well I for one I'm not ready to just accept. You know what he says and I think we have to. As many people on this community board know, we don't get what we want unless we fight very hard for it, and it sometimes takes years and years to accomplish these things. Hey Hudson, River park didn't come about. In a day there were lawsuits, there were all kinds of protests and it took decades to get it built, but it's magnificent today, Diana, could you just put up maybe a couple of those slides that I prepared for you to show all right? First of all, I prepared this one just to give everyone some idea about the areas we're talking about, especially if you're not familiar so the Berkeley Bridge banks as I described, is the area circled above that runs under the Brooklyn bridge, arches under the broken bridge, roadways, approach, ramps, etc. Adjacent to the arches and, as I said, it runs from pearl to roughly spruce or park road. The dugout is a space further down the Brooklyn bridge, as you see it on this drawing and that's adjacent to a street called Robert R Wagner senior place, and if you don't know, Robert Wagner was a former mayor of New York, but anyway he got a street named after him. This is actually the dividing line between boards, one and three. So this space is again under some of the approach, ramps and roadways, and certainly in my observations for years and years, I rarely see vehicles as Mr Pinkar indicates using it and needing it. You know, I guess they do have a couple of trailers there, but I guess that raises the question: are there other places we could find for them? Even maybe around the Brooklyn bridge is a very big large space. There are places on either side of it that may be more accommodating and would enable the community to rECABture some of these spaces. In my opinion, and I did invite I, don't know if anyone from board three is there is with us. I did invite board three to join us and I invited Ix, Alexa Torres Aixa Torres Sorry from who's the President of Smith houses, which is located just on the other side of the bridge, because if we are successful, especially with dugout, that would also I think be able to serve their community. So with that I know, we have one. Member of our community board who's very interested in pursuing this project. So maybe what I could do is call on her first and that is Rosa Chang she's, a relatively new board member again, introduce yourself to everyone and tell them what you've been doing about this and Rosa is probably the one and the reason why we have over a hundred participants in this meeting tonight, because she reached out to some people who want to see especially Brooklyn beach banks reopen, but with that, let me turn it over to Rosa. Thank you, Paul, and thank you so much for your support in following up on this issue and I am absolutely certain that, with a strong hard, possibly long fight, we are going to get this it back into public hands and to me this is public land and it's public land that in a neighborhood has very little public space. This is we're talking about, like essentially four acres here and just for a sense of scale. Washington Market Park is just over two acres, so there's so much potential here and we just don't have, as you said, space in our neighborhood for kids to go out and play ball or soccer or bike or skate for people to just you know chill out near the water and what makes this bridge, maybe not as great for a a standard park, makes it actually perfect for a whole variety of multi-functional uses, because it must because it is landmarked and it must stay open, but it still provides. I mean that spaghettiness of onramps and off-ramps actually provides rain cover and provides snow, shelter and and I just see so many possibilities there for our neighborhood I. I'm frankly outraged that the DOT and the NYPD did not. You know. Cowardly did not bother to show up just to correct you sorry to interrupt, but we do Rodney from the fifth precinct is on the call. So if we do have any questions about security, we should pose them to him. Oh Rodney, thank you for coming. I'm sorry I, you are not a coward, then could you please tell me well I guess I should finish this and then I will ask my question because I as Paul said, I'm totally new to this community board and so I. Don't understand the history of the security issues and whether or not they are still relevant today and I would like to challenge that for the DOT. You know I when I walked by that site, the other day I counted and there were seven DOT vehicles and there were 21 personal vehicles parked in there, and that was it there's so much space there and they're using it for personal parking. Now, if they need set, you know space for seven DOT vehicles, fine, but they don't need the entirety of four acres for seven DOT vehicles. That's just wrong, and this is the Brooklyn bridge. I mean this is an icon. It that's known the world over to represent New York City and it has I mean I, wouldn't go there now during the daytime or night time, because it's like it's a horrible place and you feel like there's a risk of getting mugged and there's nothing there to go to and it's so uninviting. But it could be amazing if it was well done and people were there and people had a reason to assemble there and I see that as a public park and I see that as serving our skateboarding community, I see that as serving our parkour community I see that as serving our children, there are public schools there that desperately need space for children as they age up. I, see that for older residents and open space, doing Tai, Chi and yoga outside movie nights. You know right under the Brooklyn bridge, overlooking the East river I mean there's. We have the most amazing draw there already, which is the bridge itself, and we are just letting it lie fallow as a parking lot. And it's to me it's just it's they're, stealing from the community, so that they can have private parking for their cars and I. Just I feel like that is just so wrong and they're. Also spending. You know how many millions of dollars to renovate these vaults that are under the bridge and what are they going to be using it, for? Is that just going to be like more parking, because that to me also seems criminal anyways? So you get my point of view on this. I think it could be amazing. I think our community needs. It I think our children need it. It's a once in a lifetime opportunity and I think we need to fight really hard to get it back. Okay, that's it well said Rosa, and we definitely need you and people like you and your enthusiasm to try to make this work. Did you want to try to pose your question to Rodney before I call on some other people? Sure so I guess my question: hi Rodney, hello, is what are the security issues because to me when somebody says that the Brooklyn bridge is a security issue, I'm thinking well, how many you know hundreds of vehicles travel across that thing every day, why is the underside of the bridge more of a security issue than the actual bridge itself and couldn't it be planned with or dealt with in such a way to maintain its secure ability, while still leaving the bath vast area underneath it open for public use? Hello? Can you hear me? Yes now, I can okay, this is officer Rosado, I'm the NYPD fit precinct community affairs officer and I cover Chinatown Nolita little Italy, the municipal area and also 1pp, and the banks that we that we're discussing now from what I've been told and I called I called the headquarters security today, and we had a conversation about what is the problem with the security they said that they haven't haven't revisited the security for that area, because they've been told by D.O.T that it's going to be under construction for such a long time. The NYPD wants to give back whatever areas that that they can give back. It's not a problem now. The only issue here. The only issue here would be that DOT has the construction at this moment and there's also certain areas of the park that might need some security barriers to eliminate people. Maybe I know there was a time where the skateboarding community used to jump over the wall into traffic onto the road bed. So small things like that, that's not I'm sure that can be an issue that could be solved, but a lot of these issues I think they can be solved with DOT installing fencing and a lot more lighting in the area. We have a ton of security cameras in that area for security purposes. If DOT or whoever can give us more lighting, we will be able to have security more in depth and also when it's time for opening to reopening the park, the NYPD would do a security assessment of the area and see what it looks like right now. The NYPD doesn't really need to go in there because it's offense off, so they don't know what the vulnerabilities are going to be. So that's another thing that we haven't crossed that road because they haven't opened it up for the public, but the triangle park across the street is was renovated and that's wide open for the public use and the only time that it gets closed off is when we have a lockdown of the facilities. If we have protests or instances like that other than that, we don't do. We don't lock that up anymore can I hi Rosa, it's Elizabeth Lewinson can I interject as well and just add something to what the officer just said. I am pretty sure. At least this is the way it was 10 years ago, but I am pretty sure that the Brooklyn bridge is considered a terrorist target and so putting any park underneath it, or at least in vulnerable areas, could open up the bridge to potential terrorist attacks. I just know that having worked at NYPD counterterrorism about a decade ago- and it was certainly on the target list- so I think this I mean I- would love to make at least some of it. You know, but I think that we need to talk to the counter-terrorism bureau and find out. You know what areas are off limits for that reason alone. Well, Rodney, when you spoke to headquarters or any of the people from that division on the call no well. What I'm doing here is I'm getting all the I'm gathering all the information to see what exactly wants what the community wants to do and then I'm going to relay the information back, but before anything happens or there's any opening, they will do a vulnerability assessment of the area. That's all going to be included, but with with no opening on the table, they haven't. Really. They haven't really gone back to the idea of assessing it since it's closed off to the area right now and Elizabeth. I would just note that you know. Obviously, the enhanced security measures throughout lower Manhattan took place after 9:11. right, but this area remained open until 2009 when construction was needed to be done, so that seemed to indicate that it was not considered such a major security threat at the time considering it was open immediately after it never closed to my captioning. Not before and I'm available, you know the NYPD I think we need to officer Rodney. Is that your is? I'm sorry? Is that your name? Yes, okay? Is it the liaise with the counterterrorism unit and find out from them dig a little bit and find out from them? If there's a terrorism concern here with this park, I mean I, just think we need to go and go that route before you know we try to do anything. We need to check that box. It's just my personal opinion on this. You know just to make sure that you know I wouldn't want to do all this work and then someone come back to us and say well sorry, we can't because it's a terrorist target and, like I, said it's a very large piece, but you know maybe some parts of it you know are available to us and maybe some parts are not so I. Just wonder. We should probably ask that question. Well, that's one of the purposes of tonight you raised it. Thank you, okay, yeah, well, I. What I will do from here is I'm taking notes and the other thing is it's a big park, it's a big area. So when the NYPD, we have a special unit that they'll assess the vulnerabilities of that terrorism and that'll, be part of that will all be part of that and I want everyone to know that the NYPD will do a vulnerability assessment of the park in the area because it, the pillars of the bridge, are obviously near the park and the major roadways are above the park, but that will be part of it. But right now they haven't really gone that far because they haven't been warned or told that the park would be opening anytime soon, I think once we let them know that it's on the horizon, then we'll be able to push for something like that. Okay, let's keep going to the members of the committee Joe that sounds like you I'll! Let you go next. Can you hear me now? Yes, okay, I, just wanna, let everyone know. In the past the department of transportation has been the worst agency to work with, so it could come to the police, say: okay, but we're still going to have to fight with the department of Transportation and Paul. You have experience so I think you know what I'm talking about. Yes, we will need to either find other spaces for the vehicles and other operations that they have. We should work. We need to work with them, but they have to be cooperative in that effort and they haven't been in the past. Well, we will try to change your minds. We will work on it. I will twist someone's arm. If you want okay, not yet. Okay, Andrew is next I'll, go down the list Andrew and then Alice thanks, Paul I, guess a couple of comments. You know given that they started construction, I, don't know 2009 or 2010 and they're projecting a 2,000 30 something completion date. It just doesn't seem to pass the red face test and I do think. It's worth the fight and Rosa I'm happy to join in the fray with you. So count me in question: I have there ever been any design plans or schematics for how this park might be developed and if there are I, think it'd be helpful to dust those off? If there aren't I think it'd be helpful to consider how, as part of the fight, he might come forward with some ideas as to what the park could look like and I. Don't think it needs to be incredibly detailed, but just some visual that perhaps we can lead with and then my last question look it's worth the fight. I, don't know how far we'll get with the fight, but is there a strategy? Is there a plan b strategy where perhaps we use this as leverage to identify other areas and push parks and the city to focus on building those out to meet the needs of the community? I guess we'll have to you know, take it one step at a time. I think we want to try to go for this space again and somebody who knows the spaces in this side of town. There aren't a lot of options. You know right around here, I mean unless Howard Hughes wants to give that space to the community and build a park there. We don't have too many open spaces that can be turned into parks. You know I posed questions D.O.T that they didn't even answer or try to answer you know such as do they really need to close all the areas below the bridge if they're working in an area of the bridge on the cables that are miles away, it doesn't make sense to me that these areas have to be closed indefinitely. We need to find out they to my knowledge. They were rebuilding the arches there and rehabilitating them, which is fine. We need to find out- and that was one of the things I asked them for a status report on that project and where they are, and then we need to get answers to many of these other questions that we do have and that are coming up tonight and Paul just quickly. Do you know, did you ever see or do you know if any development plans or drawings for what could be in that space were ever prepared from a park perspective we're talking about two spaces? First, the Brooklyn bridge banks had been a park area, so it already, you know, had a layout of basketball and other courts, and obviously a good portion of it was used for skateboarding as well. So I don't know if we have to totally reinvent that space. Maybe we just need to dust off what seemed to work fairly. Well, in the past, the other space no and I know Rosa had some ideas about trying to perhaps set up a design. Competition on that and I don't know if anyone else has anything on that. But I know Alice knows a lot about those types of issues and she's a landscape architect. So Alice. Why don't you take the point? I'm not a landscape architect, but thanks Paul, just a lovely architect, but thanks no I just wanted to say the obvious, which is to probably start to transform this into kind of a little bit of a politically motivated agenda and put this into a resolution. I don't know if it's tonight or next time or whatever, but you know, I, think we need to get the electeds on board with what is obviously a really frankly obvious and great idea and has a great deal of support. So I just wanted to consider how that you consider that for tonight or soon- and you know I, don't forget that part of this also could have an environmental component. You know a lot of these spaces that we talk about in this board. You know small, very small spaces like traffic islands, need you know greening, and so this is another argument for this space to become a green area that could really help the community in more ways than one and I think. That's an argument that could resonate with you know: environmentally conscientious political types, so I just add that into the pile and hope that we can maybe put this all as point by point with the pros and cons in a resolution. That's it thanks Paul and I'm also very happy to help as Rosa knows. Okay, that's great! Thank you for your support, Betty K! You need to unmute yeah. Thank you. I need to turn both on I just wanted to make a point of information that I think people have probably forgotten. The community board has already passed a resolution that does involve this space. I'm going to remind people. There was a time when we asked for increased space on the Brooklyn bridge for pedestrians and cyclists. One of the Whereases in that was that the DOT work with the winners of the New York City, the competition that was held for reimagining of the Brooklyn bridge, something sponsored by City Council and the winner was the Brooklyn bridge forest. So if anyone searches it you'll find the Van Allen Ellen Institute actually ran the competition for the council. Brooklyn bridge Forest won, they have a film online and you can see their international design. Architects have already designed what to do with the space as well as the funding for how to do it. So I would encourage people to take a look at that, and also you can work with. In fact, the primary in that group is someone who illusion knows from the peace corps, so he has a personal contact with that person as well, but I suggest you talk to them and see what you can do, because that contact has already been made with the DOT to please work with that group, and it does involve this space. Great okay, thanks, Betty sure and I tried to paste this in. So people could see it in the chat but I it doesn't work. What you're, having trouble with I don't have a way of said that send button isn't on so I can't do anything with it. Can you email me buddy and I'll put it in the chat for everybody sure just so, people could see the website where they can see the film. Thank you sure. Okay, let me see it looks like I've called on all the members of the community board who have their hands up. So with that, let me start taking some people from who are not board members who have their hands up: Tony, Hawk, New, York hello. How are you doing this is my name is Leo Heiner, I'm a professional skateboarder from New York, most people in New York know me: I've been skating, the Brooklyn bank, since I was literally 10 years old, so I went to school for architecture and I used to skate that place like every single day. So you mentioned the Brooklyn bridge forest and it looks interesting, but if they're going to try to take out the just, no, the reason why the Brooklyn banks are so special, which is how it's naturally made for skateboarding kind of a tough kind of stuff deal but I see everyone is really trying to make this happen so that we can get the space back for the public and I really appreciate it. So yeah I mean there's any way that we can try to get it going so that we can get the space back to the skateboarders and I know. There's basketball, courts and there's other things there and, like those things, definitely need some real rehabilitation. But the actual Brooklyn banks, like the actual embankments, are pretty much amazing. It's world class like the whole world, knows it and also another thing about the terrorist threats. I mean the arches has always been pretty much closed and there was never really access the whole time that I've skated there for, like the 10 years, that I was able to skate there. There's never been access into the arches and I've never seen any actual crazy situations go down, but I do understand that concern, but I think that there should be. There could be a way to get this back to the public and maybe do something amazing for not only skateboarders but for like the whole community, without taking away the skateboarding aspect of that space that because in reality the skateboarders make it really special. That's all I got ta say also, maybe some lighting there too, that way like at night it's safer and they don't have it. People don't feel unsafe to walk through there and yeah I mean skateboarding is olympic sport. So it's time to try to make just start. You know helping skateboarders like being able to practice aside from the skatepark, you know. Thank you all right. Thank you. Okay and I should have mentioned in the up front that we generally tr ask the public to limit their comments to one to two minutes if they can, and with that, let me call on Richie hi how you guys doing great I just want to thank you all for taking the time to listen to feedback from us. First of all, I think that this is not only a landmark for New York City, but an element that's being lost here is that it's also a cultural landmark for the skateboard community, so I kind of wanted to take a moment to talk about that when, when Leo was mentioning about the skateboarding and the shape of the wave one of the things that sets this physicality apart from some of the skate parks that exist today, which we didn't have back when the banks were open, is the perfection of the imperfection of the actual wave where everything is built to perfection at every spec at every new park. There's something asymmetrical and imperfectly perfect about this wave that made it so attractive to so many people. It was not meant to be written on yet all the youth of New, York and surrounding boroughs and areas wanted to come there to exploit the imperfection of it and, from there created a whole new culture, it's different than any other local park where everyone who lives uptown plays basketball in their local park, or maybe you live somewhere in Gramercy and you have your local residents. This actually was so interesting. It brought people from everywhere and that embodies the inclusion and like diversity of New York and in a city that's becoming constantly over gentrified there's something so inclusive and diverse in the community that is drawn to this that I've experienced things there that we've never experienced anywhere else in New York City in my lifetime, because it really embodies that special cultural melting pot. Now I went there as a child from a I guess, you could say, like a in income challenged home and I met everyone there from kids that lived in the projects, the kids that lived in mansions and from there I learned you can do the diy thing. I met so many kids from so many different perspectives and point of view, people that launched their own skateboard brands, I learned, hey, maybe I can silk screen my own t-shirt or paint my own board. It created such a community that today, I'm a designer and I work for a major fashion. Brand, designing clothing and I feel if I never went to the Brooklyn banks and met these kind of people and this cultural landmark. If it didn't exist, my life would have been very different than it is now. I think it would have been very humdrum run with a mill, so I think for the community and the future of the youth of New York, as it continues to get more gentrified. It's really needs to be looked at as a cultural, landmark and I. Think the future generations need to experience this because it is a disappearing element of New York City. Okay, thank you. Let's go sorry. I got ta get back to my list here. That was Richie. So let's go to Rob Magliero hi everybody I'm going to actually plug this from two angles. So first I agree with Leo and Richie I actually grew up in New York city I grew up in Pennsylvania, but I grew up in a skateboard community. My family actually owned a skate park in Westchester Pennsylvania, so I feel connected to the Brooklyn banks, even though I never skated there, because it is so iconic and for all the reasons that Richie and Leo just said. But my second plug in my connection to the Brooklyn banks is that I'm actually a high school principal at the building across the street, so I opened the high school for emergency management. It's in the Murray Bertram Building, and we have been dying to use that space for the seven years that we have been there. I'll echo what Rosa and everybody else said like there's no work that happens there on a day-to-day basis, I walk past the space every day. It's used for personal parking. There's, no reason why that space couldn't be cleared for skateboarders for the public, it's a it can't be moved to somewhere else. We can't just build another park like that space is unique to New York City. There's four schools in the building it houses, 2500 kids, like we could have been using that space for the past seven years for pe classes. I'd like to also add the high school there that my school is in has no windows so having a physical space right across the street would be essential for our students, many of whom skateboard or many of them play basketball. Additionally, like in the pandemic, we could have used that for outdoor learning. So there's like a lot of uses for like the immediate community, which I see as a community leader right across the street every single day, I like actually greet students and look at the Brooklyn banks as they come in every single day. So you know my connection is deep. There I would just like to say like to Rosa to you Paul and anybody else on CB1 I actually used to be a member on CB3 I. Don't can't balance the time out now between being a principal and being on CB3, but what I will say is I'm happy to put in the time for any advocacy that needs to happen to open the space because we could really use it. One other thing that I'd just like to say and I know you try to stick to two minutes. I was talking to a friend today who works for the federal DOT and she was saying that if they're accepting federal dollars through the New York City D.O.T they're required to do an assessment of the recreational impact around the space. So, if they're accepting federal dollars, that may be something to press them on in terms of like have they really seen the impact that it's had on the recreational space for everybody in the broader community, especially because there has been a decrease in space in outdoor space in CB1 since 2010. so for what it's worth like? I know that was long-winded, but I'm happy to drop my email into the chat and you know continue on a working group. I'm sure there's hundreds of other skateboarders and people on here who would be happy to organize to make sure that this thing opens because I don't think that it's going to happen, if we don't have people putting pressure on the local elected officials and coordinating as a community and there's clearly a lot of support in this room to open it back up. Thank you, rob I, think your participation in this effort would certainly make a difference. So thank you. Okay, let's go next to Neil Mossberg, yes, I thanks! So just talking about the space and just listening to everyone's frustration and we've experienced that at the Osa as well, but we did run a pilot program. We worked hand-in-hand with D.O.T with a program they had called under the l. So there is the opportunity and we did bring in outside funding right, so the Osa partnered with corporate it was a public private partnership and that's the direction that you I think that if you want to bring back Brooklyn banks, you know arguing with the D.O.T about what they do with their trucks is pointless. There are other government agencies as well that nobody's brought up. Pd was super supportive. Just so everybody understands we were at the entrance to the police and they were super supportive. They worked with us. They were really advocating for the use of the space for the community, so before everybody I think you know just jumps on the fact that you know it's just dead space for D.O.T being trucks as somebody that actually worked with D.O.T placed the structure there. D.O.T couldn't even get power, so that was just one of the challenges that moved there. So I don't want to be a broken record here, but again I think the opportunity exists. You know, I have a I'm partners in something called Frank 151. So skateboarding is important to me as well, but I can tell you. The solution is not going to be throwing rocks and complaining about DOT and Pd and people not doing it. I've seen renderings done by professional architects in this community working hand in hand with globally recognized skateboarders who are worth tens of millions of dollars. I've seen the plans. I've seen the project passion brought to the table unsolicited just because there was a saying all the stuff, that's being resignated by the skateboarders here that iconic Landmark Association for New, York and skateboarding, as well, so basically again, I implore CB1 to work with the community on this, because you will not like the whole community is underestimating the power and the assets of people that once were considered the french. That fringe represents companies like Supreme, which just sold for two billion dollars. Alex Corporate, is a partner of mine was help founding it. So I'm just saying don't just look at it one way this is a whole new type of endeavor and again I. I'm sorry! Clearly it's very it's a passionate program and I appreciate everyone's time. Thank you, Neil, okay, Lauren Michelle hi. Can you hear me yes, hi? Thank you so much for all the time and all this positivity that you all have been taking. My name is Lauren Michelle, I'm the executive director of the Pablo Ramirez Foundation. We are advocates for skateboarding and are currently growing. The Brooklyn skate garden in Brooklyn and I agree with Neil a hundred percent and I want to just thank you, Paul and the community board, one for being such positive advocate of this opportunity to grow the Brooklyn banks. It is a new York icon, it is a cultural icon. Everything Rosa you said about so many possibilities to create a public space is essential and the opportunity is there as a community. We need to come together. We need to open up more communication within the elected officials. We need to work with DOT. We need to work and support your board and, as a foundation, the Pablo Ramirez Foundation is willing to be an advocate to help bring skaters in New York City together to make this dream possible to bring back and save the Brooklyn banks. Thank you, okay, thank you, and you should also leave your contact info. Thank you. I'll share it in the chat. Okay, thanks, Steve Rodriguez, can you hear me? Yes, hey how you doing I just want to thank everybody at the community board and everybody called in I've been skateboarding at the Brooklyn bank since the early 1980s and it's a place that is close to my heart, a place, that's close to the skateboarding's heart and had a huge impact on my life, given that it's a space, it's very unique to New York City to the space it's at and I'll. I've already spoken with Rosa at the community board. I gave her a little tour of the Brooklyn. Banks gave her a little history of it and just want to say I'll. Do anything I can to help make this happen to work with whoever we need to work to make it happen, and my son also skated at the Brooklyn banks he's 10 years old. His name is Shiki and he also wanted to say something. Thank you yeah. So the Brooklyn banks is super fun place and I really love it, because it has a lot of history and it's been around for such a long time, and so many people have skated it had it's so unique because there's no other really big bank spot like that in New, York really- and it's just so fun because there's so much space there, so many people can be there and it won't be all jammed up. So yeah I really love it all right. Thank you very much guys. That's all I really have to say and Rosa has my number we're here to support and I just want to thank the community board once again for everything that they're doing I appreciate it. You're welcome and thank you both Paul Van Orden. You doing. Can you hear me? Okay? Yes, my name is Paul Van Orden I grew up skating, the Brooklyn banks in the 1980s and it transformed and changed my entire life. I wound up riding for a skateboard company as a professional for a short period, traveled all over the globe and have just had such a positive life experience from all the older skaters who taught me how to skateboard there in the 80s and I now live out in Portland Oregon, where we have built a skateboard park system where the city is going to build 19 different skateboard parks, and that came out of my lessons. I learned in New York in growing up and having the Brooklyn banks as a cultural asset. So I am very excited to do anything. I can to be of assistance with your efforts there to protect and save the Brooklyn banks from any possibility of going away in any way, and if there's anything I can do. I have spent many hundreds of hours on advocating for public skateboard parks and am happy to volunteer in any capacity that I. Can I've done numerous studies on noise at skateboard parks and how it impacts the community as an acoustical professional and I'm happy to offer any time or energy I can, even though, I'm all the way across the other part of the nation, I'm just amazingly supportive of your efforts to recognize its cultural asset to New Yorkers I was a kid from Jersey City in Newark, and I'd come over on the train, and so I just want to. Thank you for your efforts. I know how much hard work it takes to get here and I. Just also wanted to say that the element as you're hearing from other skateboarders of what the banks are is a cultural asset as it is, and I would just encourage you not to change it too. Much, because that's what makes it the magical place that I would see as a teenager, kids traveling from all across the globe, just to come there to skateboard the Brooklyn bank. So I just want to thank you for everything and thank you for opportunity for all of us at skateboarders to be able to speak to you today. Great. Thank you. Let's see I think I'm up to Garrett Gutierrez hi. Can you guys hear me yeah, okay, so I actually grew up in California, but seeing the Brooklyn banks and skate videos and magazines did more than selling on skateboarding I would argue. It sold me on New, York City as well, and, to be honest, it's one of the reasons why I lived here now. I know that there's been some petitions that have been circulated, one receiving about 45,000 signatures and that's only a small testament to what this place means to the skateboard community worldwide. Preserving the banks would not only guarantee that this space will continue to be used, but also that will be appreciated to the fullest extent by both citizens and visitors of New, York, City and I know that the department of transportation likes this free parking and the possibility of more storage space, but considering local school leaders. Council members, NYPD and various New York City residents, myself included, are all passionate about opening the banks. That just demonstrates how important this issue is to so many people, I also think it's safe to say that you will not have any trouble getting volunteers to help out with this endeavor for whatever that's worth, but yeah I, just I, guess just to finish, I mean seeing the banks fenced in this way, pains skateboarders across the world and wastes additional public space that could and should be open to all New Yorkers yeah. That's all I got thank you all for for your support. Special shout out to a council member Rosa Chang keep up the good work. Let's save the banks, not council member. Yet, but maybe let's see Amy Ellington hi. Can you hear me all right? Yes, excellent! Thank you Paul! Thank you, Rosa! Thank you both! So much for your time. The Brooklyn banks is not only and I is not only iconic but pivotal in the history of skateboarding in New York, the skateboarding community drives culture such as fashion, art and technology. It's hard to connect with any of these industries without hearing someone say: I used to skate or I'm a skateboarder skateboarding establishes work, ethic, morals, values and self-respect, more than anything, I have seen being in skateboarding for over 25 years. I am honored support to support such an amazing community. Reopening the Brooklyn banks would once again provide a safe space where like-minded people can get together to skate and to rebuild community. We look forward to the opportunity to represent New York globally through skate photos and videos showing the true New York. We love so much. Thank you so much for your time. Okay, Amy Ellington. Yes, oh that was you sorry Jonathan Cosinic evening everybody. Thank you Paul. Thank you to everybody on the board for opening up to comments really appreciate you taking the time to hear all of our voices. I'm going to reiterate some of the points. I've already been made. I grew up right outside of the city in New Jersey, but grew up going to the banks. I think one perspective I can offer that's a little different. I'm an awful skateboarder always have been, and unfortunately, never grew into it, but I think the thing that set the banks, apart from every other skate park in New, York City and continues to or could continue to, is, its ability to be a mixed-use space, I loved skateboarding and, despite my fact, that I wasn't very good on a skateboard. I would often go to the banks and it was an opportunity for me to sit and watch and be a part of skateboarding culture and see my favorite pros, come to town and watch all these people and be a part of the community in the same space and I got after my own passions in that space, which was drawing sketching one of my own talents and the connections that I made at the banks and the work that I did there and the things that I learned propelled me into a career in design. Arguably without the banks, I wouldn't have the job and the career that I have now and the bank's being closed now. I would say not as only disappointing to me personally that I can't go and visit them again, but I would say significantly more disappointing, knowing that there is a decade worth of kids. Just like me that were robbed of those opportunities that I had how many kids could be in a similar situation that I am and aren't because they didn't have the banks. So during that, it's going to continue to be closed for another decade seems not disappointing, but untenable. So I appreciate the work that everybody on the call is doing and just want to reiterate how important that work is. So. Thank you for your time sure thank you. We have about six more speakers. I would just say if you're, basically going to repeat what's already been said, I think you get the sense that our community board is rather supportive, but we will call on you if you'd like to be heard, but try to make your comments brief, James, Mcdonald, Hey, thanks everyone for being here. My name is Jimmy Mcdonald I, don't want to repeat what everyone else has already said. Obviously the Brooklyn banks is iconic feels like it's one of the only places left in lower Manhattan that isn't just for office workers to eat lunch. You know it's obviously iconic for skateboarding other american cities used to have spaces like this Philadelphia had Love Park San Francisco had a marcadero, but these places are gone now, they've been torn down and the Brooklyn banks is one of the only spaces left like this in American't, just New York City. So it's inspiring to see everyone here who wants to help save the banks, and you know just the fact that this conversation is on the table is really great to see. So, thanks for letting me speak, thank you. Jimmy Matthew Plasman, hello, yep you're, on yeah, I'm actually from just north of Boston and I, went down to the banks for bike jams, probably about 10 or 12 years ago, and I'll say: there's really something special about not just the place for regular users, but for events like that which could obviously have a lot of opportunity for mixed events that could incorporate the entire community, because those moments are something that you know: people as they grow older, don't have opportunities to be a part of, and they really do keep people connected and I've met. People down there just for a day and I can still send a message to them just because we met there at that moment. There's a deep connection there, so I think that that's another special part of it where people would be more connected to not only the sport of skateboarding but I ride, Bmx and those are Bmx jams, but all sorts of different. Who knows what artwork other sports? It just has an incredible opportunity for people to have communal events where everyone feels like it's a special place and I think that that's a great opportunity for the city and it's one of the one of like the go-to places. When you go to New York City, you meet there and that's that's something special. So I think that there's a lot to learn from using that as an epicenter for people to get to know you New York as well. So thank you guys for all your work. I look forward to seeing what happens in the future and for helping out. Thank you, Jonathan Becker, hey how you doing yes, hey guys I just wanted to say thank you for everyone for joining, I'm a student at pace University and about six months ago, my friend, David and I saw that construction started up again at the banks and we were just super bummed and we decided to start the petition and within the first week it got then the first day it got 10,000 signatures, I think two or three days later it was at 20,000. another week or two is that 30 and then a month or so? Is that 40 and now it's past 45,000, and we also contacted Steve Rodriguez and he's been helping us out a lot and Rosa got in contact with us as well. So there's just an immense amount of support and I think the most important thing about this is that the community is willing to work with DOT and whoever else needs access to the space. We just want to make sure that it's also accessible to the public because it has so much rich history to it. Yeah. Just once again, thank you to everyone for joining and if any contact info I'll just put it in the I'll just put it in the chat, I really appreciate it and whatever needs help, I'm super down to help out. So thank you for all the support and everything okay looks like Guido is next hello. Can you hear me yes, okay. First of all, thanks for thanks for all of your support and thanks for listening to all of us, I know that you've listened to a lot, and you know there have been a lot of similar ideas, I'm going to try to just put mine in really quickly and concisely, so it doesn't take up too much time. I come from the older set, I'm in my 40s. I've been skateboarding since 1984. in 1986 I had seen a skateboard video that was a promotional video for what was what amounted to the most popular skateboard brand. At the time this company called pal Peralta. So in this promotional video there's a section where the pros meet up with some of the New York skaters and skate the Brooklyn banks. That was the first time I saw it. I was 13 years old and I said that's New, York, that's right across the bridge. For me, I was growing up in New Jersey an hour away, I found out where it was and much to my mother's chagrin, I hopped on a train, New, Jersey transit and found the Brooklyn backs after two trains ate it over there and it changed my life. It was then, and always the spot to go to in New York, City, Steve, Rodriguez, I also know, and at one point years several years ago he asked me in a text message: what's the most famous skate spot world and without hesitation, I fired right back a text that said the Brooklyn banks. It is the most famous skate spot in the world. It should be saved. Every professional skateboarder goes to New York. They stop at the banks to skate the banks, and now we can't it's not available. Let's get it back. I appreciate it. Thank you. Okay, two more Rpz, there's a soup in the middle in the back, hey yeah I just wanted to say that I grew up skating. There and I remember events like back to the banks and many mania down to Nelly us. We used to escape from Brooklyn banks down to lower East side Skatepark, and it was honestly one of the best times of my life. I. Think one of the important parts is to keep a lot of it. The same you know like maybe fix the courts, and but everything was almost everything there was skateable down to the stairs that were whole on the other side across the street and I just think the floor was what made it. You know the tiles on the floor and you know I think it's important to keep it, how it was for the skate community yeah. Okay, very good, thank you and Ramon hello. Can you hear me? Yes, okay, I have basically the same story from the guy to two calls about calls ago, but instead of the New Jersey transit, it was a greyhound bus from Buffalo. So it was a little bigger of a trip, but I was so inspired by going to the banks that me and my friends from Buffalo would do that treacherous nine hour. 10 hour bus trip just to get to that spot and from that day on I can just tell you that it's been known as the mecca of skateboarding in the United States. So if that means anything to you, I mean I, know I'm basically saying the same thing as everyone else, but when I felt this myself but I know when other people saw them taking bricks out of the banks, they were pretty much tearing at the fabric of New York City skateboarding. So that's that sums it up and I'm happy that you guys are on board to try to keep this institution going and thanks a lot. Okay, I guess: I spoke too soon. As I said, we were out of speakers. More people have signed up. I again. Ask you to keep your comments brief, so we could get to discussing whether we want to do a resolution or not. Okay, so am I up to Cosmo hello. Thank you for doing everything you're doing for everybody. I don't want to harp on anything else. Anybody has already touched on besides the wonderful history, but while the world's tearing itself apart skateboarding is a unity, it doesn't matter where you're from what country, what religion? What race you are. There is a sense of unity, no matter where you are from, and that was built and raised by for me and my friends at that banks and, like the last gentleman just said when the bricks were being taken out, it hurt a lot of us and all I want to say. Is it's a place of unity? It's about building it's not about destroying, while everything else around this is a little messy right now. There is something beautiful and organic about that place and fame part of me to switch. It would be a shame if that was taken away from everybody. Who's never got to experience that kind of unity, and that's all I really wanted to say, and thank you for everything we really appreciate what you guys are doing. You're welcome and thank you. Barry Scott, hey thanks, everyone for all the hard work and for all the eloquent skateboarders. Speaking to this, it's really awesome to hear everybody's stories. Yeah I just want to say that like skateboarding is a common language and it's the Brooklyn banks, where we all come together to write our stories. As the previous speaker noted, you know we come from everywhere. You know the Brooklyn banks is the melting pot under the bridge, but I want to just get to the nuts and bolts I, don't think, there's a lack of passion here. It all boils down to brass tacks and politics, and it sounded earlier like there were a number of avenues, political interests that may not have been tapped and I'm really curious to know how we can leverage all of the skateboarders here that are interested and who we apply pressure to so for those who are involved on a consistent basis, I see some numbers and some emails I'd like to reach out and hear how how we can leverage all of our voices to apply pressure to the people who need it applied to so that we can get this done. Thank you, okay. Thank you. Next up is Josh Friedberg hi. How are you doing? I? Will keep my thoughts very brief. My name is Josh Friedberg, I'm the CEO of USA skateboarding, we're the national governing body for skateboarding in the United States. Our focus has mainly been on the olympics coming up next year in Tokyo, but we also support all of the grassroots of skateboarding and the Brooklyn. Banks is a cultural institution in skateboarding and in the world that needs to be preserved and made available to skateboarders. Again beyond that, when I was a kid, my parents got divorced. My dad moved to Staten Island, so I used to take the ferry over when in the mid, 80s and skate the banks, and it opened my eyes to what the world could be and beyond that we're here to support this effort in any way possible. So please feel free to reach out I'll leave my info on the chat and thank you very much for the work you're doing. Thank you I Anita, but Drago hi. I'm not sure. If you can you hear me? Yes, okay, thanks I, my name's Nina I, actually discovered riding Bmx in the early 2000s and Brooklyn banks was one of the first places that my friends took me and I came to know it like everyone else has spoken earlier that this is an iconic spot, not just in skateboarding, but just in action sports. It really bridged the gap for the you know, just like a place literally where we can all come together and you know I grew up on long island. You know I had to do the same adventure taking all the trains and you know sneaking out to go get there, and you know I've watched it closed down over the years before 9:11 after 9:11, and it's just kind of heartbreaking when I come home to visit now to see it shut down, but just not even being used. You know it's just roped off and that's it. So I'm really appreciative of everyone's hard work came together here. I'd love to see that space get used again for something positive like this, because it's really changed my life. It's been awesome. I've traveled all over the world and made friends everywhere, a professional bike rider now, thanks to those times at the banks, so I'll wrap it up, but thank you again, yeah I'll be in touch put my info in the chat for, however, I can support. Thank you, Gerald Forsberg. Yes, I'm going to try to keep this short, so I am not a skateboarder. I'm kind of just as I was just telling my wife this morning. I think I want to learn how to skateboard now, but I want to say that I live in CB1. I've occasionally walked through this area, and I've often wondered what the history was so I. Thank everybody this evening for sharing this history. I also want to say that I'm excited to hear that CB1 is looking at this and I think that, specifically, especially from hearing tonight I want to hear. I would like to suggest that you know wave for the skating community, as others have suggested, should be at the forefront of the agenda and also I want to talk about the vaults I did some research into the history, and apparently the bridge designer Roebling had originally designed the eight interior spaces as retail space I think it might be feasible to consider discussing that with DOT and perhaps I understand it was. They were also used for storage for alcohol storage years ago in particular, but that you know there's no reason that this couldn't become a wonderful place, similar to Anchorage I, believe Anchorage place over under the Manhattan bridge on the other side of the river, where we could perhaps make some funds to maintain the park. Thank you. That's all I'll say thank you. Larry is next hello. I'm out here Ohio. Thank you for having me I just wanted to say: I definitely support the banks, that's one of the places that I was able to go to and meet up with a lot of the awesome professional skateboarders. It definitely is a place to bring people together where they can stay out of trouble and, if not have a good time- and it was just such an a wonderful place to go to New York and that was like I never been to New York before and that was the first place. I went and it really helped me really get to know what New York is kind of like, and it's a really great melting pot and cultural meeting point for the city of not just skateboarders, but just people who just like to just kind of get together and just see, really meet our artistic sport. So I'll try to keep this Bri. I'm going to keep this pretty so, but I really appreciate you guys giving us a chance and not just shutting this down completely at least I believe we can all work together and make this happen and I with rewards for skateboarding I wouldn't be here today. So definitely I'll put my information out there. If there's anything, I can do to help. Please let me know, because I really think Brooklyn banks should always be there for everyone to come. See at one point or another, okay, very good, thank you and Robert Serafin hi Paul. Thank you for letting me join this evening. I think this is really wonderful for him that you guys have put out there for everybody in the community. So I am part of the skateboarding community. I visit the Brooklyn banks, often and I'm probably guilty as a lot of the people on this call are during the time where it's been fenced off. I have made my way over the fence to partake in its wonderful glory. I was just there yesterday as a matter of fact and I was speaking to one of the people who was working on the site and I got this very unique part of history that I had never known about there and I got to find out about it and as they were taking out and demoing a lot of these areas, they were finding ship remains and ox bones. There used to be a leathery. There was a hospital. There was a school, there was a fallout shelter during the cold war and, unfortunately, all of these artifacts that were getting pulled out all ended up in the garbage, along with all the bricks, so I think there's just this deep-rooted history that lives there. That I didn't even know about for all the times that I had been. There was all these other things that were just beyond those red brick. Walls that we used to fly by on our skateboards I would love to bring my children there and experience what I experienced today in the skate parks, which is an acceptance of women, children of all ages and creeds, and it's amazing, the community that we have built in New York and it's amazing. The way everybody is welcome and nobody is turned away and I think giving this space back to them, we'll just make it grow and continue it on to the next generation and I, don't want to take up any more time, but I just think. It's amazing that there's so many deep-rooted stories in there that are being lost right now and I wish that they would continue going forward. Thank you, okay. Well, thank you all for those great comments that you gave us I think you did provide a lot of very good information for the community board to know those arches by the way were businesses in the past where shops and it was part of lower Manhattan and in fact, there's a at some other point. Maybe we'll talk about reactivating those arches, because there have been plans in the past to reopen them as cafes and others other types of facilities for the community, but that's not for today's discussion. So let me get back to the committee we're going to end the public session now and committee, so actually Paul sorry, this is Rosa, could I just interject one thing? Yes, so thank you. Everybody who spoke I mean I'm so touched by the support and and the personal memories that you guys have all shared. It's amazing I just want you to reach out to me if you're interested in supporting this effort, so that I we can keep in touch with you. Diana has posted my email address in the chat. So it's it's right. There just email me and then we'll keep in touch, so we can keep this moving forward and not let it just bye. Thank you and thank you Rosa for bringing all these people over to the community board to share their interests and to talk to us about this. Thank you rosier, an amazing organizer. After two months on the community board, you could give some lessons. Okay with that, let me go back to the committee. You know at first I didn't really think we should do the resolution tonight, but I think now. I am more inclined especially heard these strong comments from so many people and as well as members of the board and the fact that there's no harm. This is a position that the community board has already taken through our budget requests. We've already put in for these projects to be built, so to do another resolution would just be reinforcing that and again talking about the importance of these spaces, the iconic nature of them, the cultural, all the things that were said that I, won't repeat now so is- are the members of the committee interested in doing a resolution? Yes, oh I think it makes great sense, I guess the only thing and you may have referenced this I just think. It's important to look back at the resolution that was mentioned earlier on this subject, just to remind us or guide us as to how we frame this resolution- and it may in large part, be quite similar, but I think it's helpful just to refresh our memories. Sure, okay, so basically I, guess I will then I don't have a resolution ready for tonight, because I wasn't really ready to do one, but it would basically reinforce our storm support to see both these spaces reconverted back into park spaces as soon as possible, and that we're certainly willing and eager to work with D.O.T to look for solutions to their issues that they may have, etc. Paul I'd also like to suggest that we maybe amplify the mission here at tad and in addition to opening, what's there kind of receives some information as to how this gets integrated into one police plaza how one arrives and exits from this area. That's a really troubling connection. That's really never been resolved and I just think. It's an opportunity to look a little more carefully at the urban scape of this whole area. A little bit I, don't know if that's possible as part of this plan, but something just to consider and also to consider that the use you know, albeit with the skate park, but that you know, of course the other park uses and other potential uses are also noted as well. Yes, yeah I agree thanks yeah Paulus Mark. Could we also make mention on the resolution of what you talked about with the stars that used to be there and revisiting the arches, and all that would you can we learn about that? I guess so? I, don't I mean I, believe that's a good idea, but we can make that just although or something that, whereas the board in the past has expressed interest in reopening the arches and that should also be considered yeah. We can follow aggressively down the road. Okay, Bethany you're, trying to get yeah two comments. One is when Rosa first presented I had more of a vision of a multi-use space that could include a playground or some you know quieter areas and I was just fascinated by the commitment of theaters and history of that area. But I guess one question: is there room for both or would it the nature of the activity in the space have to limit it to skateboarding activity? So that's one. What we want to think about and second possibility that there are some objects of archaeological, potentially significance that tell the story of the site struck me and I know that I worked at Henry Street settlement and you know when we were doing renovations. We hid an old cistern in the backyard and it was basically historic trash in it, but we called the South Street Seaport and they sent an archaeologist up and pulled out a lot of interesting things and I've seen that at other historic houses and sites- and you know maybe treasure, but maybe it one of those arches ultimately tells the story with the remains that were found of what once existed there. So I think there is an office or somewhere in either state or city government, that you can call when something like that is found and get some professional help with it. Yeah no I was troubled when I heard that story also, they should obviously protecting and preserving those elements and those artifacts, so I think we should definitely mention that at the resolution, I should also mention that we are going to try to probably have a follow-up meeting with some of the leaders of these agencies to start the conversation there, because that seems to be the way they want to do it so that and all of that great easy. But if we have a resolution in hand, all the more I think it's all the better I can respond to Kathleen's comment about what the space has the potential to be I mean the space that we've been talking about. The most this evening is called, you know, the Brooklyn bridge banks and that's on the North West side of the of the basically the three blocks that this area runs under, but it there's actually four acres in those combined three lots, and so, let's say there's you know a whole chunk of it. Even if you literally took out half of it, which you wouldn't have to do. Frankly, but let's say you're being super duper conservative, then that still leaves you with two acres. That's a huge amount of space, and so I think that there is absolutely the potential for this and I think there that it should be way more than just a single sport or two sport facility. I think that it is multi-purpose space that can be used during the weekday hours for schools that are in the neighborhood, as one of the speakers said, I think there's a real need for that in our community. I could see it as being you know, a fresh food market on the weekends and being an event space for the community and, being you know, space that is flexible and able to be used by whomever as they need it to be used and I include passive recreation. Frankly, as part of that, because it is such a significant space and I would also say that the vaults and the passage area you know between the the north section and the South section provides for a lot of varied experiences of it all with it all of it. With you know these amazing views of the bridge and the water to the Brooklyn side, I mean it's so special, but it just frankly it's just a dump right. Now, it's a parking lot dump, and but it could be so magical and so I just want to get it there, but I totally think it could be absolutely everything and Kathy I would just note that in the past it did serve other groups other than the skateboarders, so it certainly can and should be that well. Thank you for clarifying that. That's I live on the West side: oh hi, I'm quite familiar with it. Hey Paul who's, this! It's Andrew, quick question for you. Is there any value in getting a better sense or read on the petition that was referenced and maybe somehow incorporating a reference to that position as a demonstration of community support in the resolution, I think the community board actually Tammy found it and sent it to me so, okay, we do have it, so we could certainly look it over and reference. It sure got it. Thank you, Diana you're, taking notes. I hope always thank you, because I'm missing some of this stuff and I just want to re reiterate to the committee that we're talking about two spaces here. Obviously the speakers here were or users of a space that had served this community for many years and great rare collections, but we're trying to create another space as well in that dugout area and I, don't know if anyone has any questions on that, it's pretty straightforward, I guess I do and maybe Rosa can answer it. I, don't know the air that well, but I certainly know it. I know that I guess it's about 15 years ago the city had closed the area to bake a large I think it was almost a three acre green area in that area and at that time I think it was Steve Rodriguez that you know worked with the city, if I'm not mistaken, with the parks department to ensure that the area would be skateable. So I would be interested at some point if we could be provided with a plan that just kind of lays out where all this is and how one gets from you know street level to plaza level and all that just so that we can kind of get closer to. You know understanding just that point Paul, which is where one where the park would end and the other park would begin and such so I don't know anyway. That would that might be helpful to all of us as you go forward. Just have something very visual I see some. The petition is now posted in our chat when this was open. Was it under department of Parks purview that no I think it's always been D.O.T? No, oh I! Maybe I'm wrong. I thought parks was involved, but many years ago I can't be certain. So don't read to that I, don't recall 100 all right. Does anyone want to just take a quick look Diana? Why don't you just put up those the slides of the other place? Just so people know what I'm talking about. The other space is located as I said, it's basically at the end, where the bridge and South Street meet up pretty much go to the next slide. If you could okay, this is the Brooklyn bridge banks, so this you're familiar with next okay. So this is an image that depicts this other area that is again on the arches, just big, fixed off area, as you can see from this photo, not many vehicles. There are a couple of trailers, so that's the second area, I think we have one other view of it. If you want to see it doesn't really show much, but just shows that you know there's the gate, as you drive down Robert F Wagner senior place to access that space and gives you some perspective. Okay, so it sounds like based on the comments, we're ready to try to approve a resolution that we will have to draw up and we'll have to figure out how maybe we could try to share or we'll just have to work on it. Is that agreeable to the committee? Yes, okay, so you heard the element largely that we want to put in it basically urging DOT NYPD to work with the community board. Make these spaces park spaces et cetera, we'll make some of the specific points. Okay, so yes, I've never been a skateboarder in my life, but I can tell you this stopping there and just watching the thing was beautiful. It was a ballet in motion and it's just happening right there on our streets and I. Think that's worth saving. That's all I agree. Okay, so does someone want to second the resolution? Okay, so resolution? What's that, would you read the resolution? Please I really can't because I didn't write it. You can't vote on a resolution that isn't presented Paul. Well, so do you want to delay this for a month? I guess he's right about that. But can you can it kind of I? Think you'll probably give us a summary. It's you know I'm the same way about this about you know things need to be done, procedurally correct, but it seems non-controversial which is a plus I, don't think anyone's going to vote against it, but maybe just go through a little bullet point there to help us out all right Diana since you've taken better notes, probably than I have do you want to. Can you read off some of the things that you have written down? That would likely make it into a resolution at this stage. Sure and I think. The big point here is, like you said that we want the the DOT NYPD parks department, to the extent that they're involved are elected officials to all work towards this common goal of returning this space with Brooklyn bridge back to the public, the Brooklyn banks and the state park has been talked about a lot tonight, but we're talking about you know space, that's additional to that and for mixed-use purposes that serve the community in a holistic way. The shops particularly were mentioned. The vaults, the archaeological component, those are some of the specifics that I mentioned. If there's anything else, please let me know, but I will reference back the dog in case, there's anything that I missed reference. All the speakers that we got, who spoke so well of it. I would mention Murray terms, interest specifically I. Think that's good I would mention that again. This will serve multiple communities, including community board. Three, if we could look, let everyone look at you. Excuse me, I'm sorry, all right, so I and obviously we're going to throw in there that the skateboard is a cultural institution, etc. A local iconic place, and maybe some of the remarks that David just had about how it's just a wonderful place, even if you're not a skater to observe, could we also include something about the somebody had mentioned that there needs to be a recreational impact statement or review if they're, accepting federal dollars for the bridge. I think that was a really great point. Yes, I would throw that in Rob Magliaro, that was the assistant principal at Berntrum, said that if getting federal dollars, which I can't believe they're not they need to look any loss of recreation, space and impacts on the community etc, so clarify because Rob just messaged me that it's the principal from the Urban Assembly School for emergency management, which is located in Murray Berkeley, okay, Murray Bertram, has multiple schools inside that facility at this stage Paul do we need to do any verification on that point of federal funds, or do we know that I would Diana if you could verify that maybe call the congressman's office, and that would be great, no problem. Okay, any other comments or additions. Paul I, just I guess I just need some clarification from somebody, the large areas that are surrounding this, that have chess tables and a lot of greenery and such what? Where does that fit into this equation of opening things, because these are all closed off right now, these park-like areas that are there that are I, know I, don't recall any chess tables or anything like that. Maybe they were, but they were. Does anyone else Joe? Do you remember anyone else? They actually are there they're on the section between park row and Madison, Right North, oh okay, now I know what you're talking about I believe that area was I, hope I, don't get this wrong called the small banks, that's where, like the kids or the newbies, would learn to skate. Maybe so I believe that that's what that was. Yes, so is that part of this plan or not? In other words, are these going to be resurrect? I mean these are passive recreational areas that were quite lovely. I'm just curious how this fits into this part of the plan? Absolutely okay, well, I! Think you better identify it in the resolution and I also would like to add the part about trying to move from one level to another to clarify and respond to the overall urban plan. However, it goes forward so like we're adding things yeah, we make a place that doesn't look like a mugging paradise as a way to exit the Brooklyn bridge from the pedestrian point of view. Right or one police plaza I mean most people, probably don't realize you can actually get from one police plaza down there and probably have rarely done that. That's a really critical artery that doesn't really is totally unresolved, so I would advocate for that to be included here. Also, if we're going to be looking at this- yes great so basically just Diana, just so you're clear we're talking about the swath of land on the north and the south side of the Brooklyn bridge and all of the spaghetti ramps. You know around it going all the way from park row and extending all the way to South Street and between Robert F, Wagner senior place to Frankfurt, Street or Dover Street, and also I, guess, Robert F Wagner turns into an avenue of the finest yes and so rose. If I'm understanding this correctly sorry just interrupt so this is all owned by the. This is all the jurisdiction of the department of transportation, with no jurisdiction from the department of parks and recreation. Yes, as far as I know, this is okay. You know what I'm going to throw in parks. Department too. I got a series of messages here that folks, who wanted to do events needed to get parks, department, approval I, don't think it hurts to add them in just to cover ourselves in that way, this is a can. These things can be a bit of a jurisdictional puzzle. Okay, absolutely thanks! Merrier! Thank you, okay, so we're going to say in the resolution. You want the full Brooklyn bridge bank recreation and open space area restored to the community. Okay and I. Guess we should throw something in with community involved in the design and of the these new spaces. Okay, anything else, all right! So Diana you take the vote. It seems like there's pretty wide consensus on this. Unless there's any objection, I'm just going to call for any opposed, abstaining or recused can I interfere for one moment, I, don't disagree with anything said, but I am concerned with an existing resolution and the work already being done with the DOT I would take a deep breath and try to coordinate with that find out where that group is in their discussions and then just coordinate your effort maybe delayed a month, but nevertheless, rather than having conflicting resolutions coming to the D.O.T from CB1 I. Don't think there would be anything conflicting because that was taking up. There was talking about the spaces on the bridge itself. Not this. It wasn't beneath the bridges it was. They were developing a park space underneath if they went after the whole Brooklyn bridge forest proposal, which is what's asked now it may be, nothing will be taken from it. All I'm saying is take a breath and see if there's a coordination issue or not because there might be and Paul that's what I was referencing with respect to taking a look at that resolution, just to make sure we have full understanding of its breadth and scope well and what's been done since September well, what's in conflict, if there is I, also thought it was only the top part of the bridge, but as Betty says it's the it's all of that encompassing area. There is a design plan, that's been generally accepted or acknowledged, and what we're talking about would run counter to that design plan. Well, they were looking at the lighting and they were looking at the arcade to reuse. That area as I recall. So you know it wasn't about a recreational piece of my knowledge, but anyway, I don't know what it was a fairly valid point to look at the resolution. I think that's yeah and talk to the team to see what discussions have gone on since it was passed with the D.O.T and it made it, and it may be that we end up with a conflicting resolution. If that plan that Betty's referring to doesn't save the skateboard area, all right, you want me to read you that resolution not for nothing Paul, but the it's been called the question in second: didn't we shouldn't even be having this discussion. Well, that is true. Well, is it kosher just to give us a few of the salient points without interrupting the resolution? Momentum? All right, you want to hear the whole thing or just be it resolves I think to be it resolve your result. Cb1 strongly urges D.O.T to give cyclists and pedestrians more safe, designated space in which to commute and to enjoy the broken bridge. Further resolved D.O.T should engage with Brooklyn Bridgevar's team to develop a plan that implements as much of their winning reimagining Brooklyn bridge entry as possible, and three that be it resolve. D.O.T should add the creation of more pedestrian cyclists space on the Brooklyn bridge to their master plan. I, don't know it doesn't seem to be anywhere in conflict with what we're trying to accomplish here. The second bullet potentially does again I can't I, don't know if it does without having the actual force plan. In front of us all right committee, if there's a problem, it will come up at the board meeting, so we can get on with this vote on this and if there's a problem and from a procedural standpoint, the question has been called and seconded so with that I guess: I will just put it to a vote. Okay, given that I'm just going to do a full roll call, so we make sure to do this precisely Goldstein. Yes, Andrew Zelter, yes, Mark Camarusso, yes, Alice Blank, yes, Rosa Chang, yes, Wendy Chapman, yes, Kathleen Gupta, yes, Elizabeth, yes, Joe Lerner, yes, Dennis Michalski, yes, Anthony, Notaro, I, don't think Anthony's with us, Bob Townley, no Bob, Richard Corman, yes, David Sheldon, yes, okay! It is unanimously in favor. Okay, thank you committee. Thank you Diana. Thank you, participants, okay, so with that we do have one additional item to go through that is Hudson River, Park, Advisory Council recent meeting regarding pier 76 and I will turn it over to Andrew, to remind you of where pier 76 is etc. Paul. This is the last topic. It is okay. Yes, we had one more, but it was. They asked us to delay it until next month. Okay, that's fine! We talked about this a bit at our October meeting. The fact that Hudson River Park trust was reconvening the task force that had been assembled to consider a and holistic plan, as it pertains to development of pier 40 and pier 76. Pier 40, as you may all know, is at the West Side West, Street and Houston, and is the offices of Hudson River Park trust, there's parking on the pier and there's also a very large athletic field at ground level and on top of the roof, and there have been plans that have been presented that call for a commercial development of some sort on that peer that would bring in revenue to the trust enabling them to create a sustainable long-term revenue stream. There was a blueprint that had been created in terms of a potential framework for development plan that had the support of electeds and went up to the governor's office. The governor kicked it back, saying I, don't just want to consider pier 40. I want to consider pier 40 and pier 76 in combination, pier 76. Again, as many of you may know, is at 36th street. It is currently predominantly the tow pound for the mypd. It also is the home of the I think classic car club on the southernmost portion and what came out of discussions regarding pure 76 was essentially that NYPD was essentially required to develop a plan to exit pier 76 by well as early as possible, but if not sooner than the end of 2020, they would start paying rent on a monthly basis and I believe it was a million dollars for 2021 and it escalated to 3 million starting in 2022 per month that whole workforce process had been tabled as a result of Covid-19. That group was reconvened back in October and because of the climate resulting from Covid-19. The notion of a commercial development and plans for potential large-scale commercial footprints is not necessarily certainly not the most opportune time for that. So the scope of the discussion turned to again focusing on getting the NYPD off pier 76 and essentially opening up that pier for interim uses until such time that a more robust commercial plan is a viable option that went to Community, Board, 4, Waterfront and Parks Committee I. Think two weeks ago there were representatives from the governor and the commissioner themselves of parts Department and Hudson River park trusts and not surprisingly, there was unanimous support across the community Board Waterfront and Parts committee to take action to push the NYPD as hard as possible to vacate. They have not yet identified a location that they can vacate to, but community Board 4 is quite keen to see pier 76 opened up on an interim basis for some type of community recreational and passive space. There are no plans specific plans as to what that will look like interim uses need to be better defined, but that's really going to be the scope of focus if you will over the next few months as it pertains to really what are the two largest peers for park opportunities. Enhanced park opportunities in Hudson River park more to come on that I have not seen a notice regarding a second meeting, I think they're processing. What came out of CB4 and I expect we'll hear and see more in the coming weeks. Thank you, Andrew Good summary I was also at the meeting yeah they're, trying to advance things, as he said, they have to move that car a toe pound anyway. Any questions comments on that report. I had a question: if no one has anything else on this on the last item. Just a quick question on that the plan or designs for that rotary. If we got anything yet or can we obtain anything preliminarily of what they're proposing? What do you, when you say the rotary? What are you referring to last topic that was on the agenda for tonight? I believe Brooklyn, bridge arches, they're I, don't think there is a design to rebuild the space at this stage. No I think mark is referencing the Holland tunnel Rotary the postponed item. Oh, is that what you're talking about yes did? Do we have anything on that can be emailed? No, the applicants just asked for another month to that they would be better prepared to do that. Presentation in December, so I agree. Well, maybe Diana I don't know if you can maybe contact them and they can maybe give us some preliminary heads up on what we're going to be seeing, if that's possible, sure I can reach out to them. Thanks and just a heads up I believe there was a story in the Tribeca Trib on what they're planning there so I'll look it up, look for it! Okay, anyone else have anything before we move to adjourn all right. Well, we did well thank you committee and compared to a lot of other committees who are doing pretty well getting out at 8:13. Okay, you all have a great evening and a good weekend coming up. Thank you, Paul good night. Thank you. So much Paul.",
            "summary": "Let I need to walk you through them, but we actually are going to rearrange the order of items we're going to start with what had been item two, which is encouraging the formation of friends of groups for parks in community district.\nLike I said before we are private public partnership, where we have a non-profit society and a prophet side and me being the outreach coordinator, I bridge that gap between the community and the parks, Department and the city parks foundation, and vice versa.\nYou guys know your community's better than we would you guys live there so forming these friends of groups so just forming a group in general, a group of people who may just want to clean the park.\nReally slim and lava parks took a big hit and, as you guys can see from the trash accumulation to when we got hit with that that storm where the trees went down and there were trees, everywhere, I know me living in Queens.\nAnd I know other parts of the Bronx that my other colleagues live was out of control and especially just in Manhattan me coming into the city, just to see how things look hectic as well.\nSo if the community board were to send out information to or offer to help different people in our district who are interested in forming these types of groups, you would be a person who would assist and work with them and give them the know-how of how to go about doing what they want to do.\nYou know district one is my district that I don't get a lot of groups from, because this just depends on how things are placed like I.\nThis fall with various recreational activities that we put on for baseball and softball, and no surprise, given the inability to bring on the seasonal resources, combined with the fact that the ball fields were sitting idle, pretty much all of the spring and through a good part of the summer, when they did start issuing permits that the parks department, the fields were just really a lot of to bring into a playable state and that's not a meant as a criticism at all.\nI know we, as a league are coming forward with helping to purchase maintenance, equipment, doing some painting of the facilities around the fields, and it's just been an incredible community experience for our kids.\nSo the fact that we're able to get community residents, people who you know care about their part to step in and help that's big, and we hope that continues like you said throughout this pandemic, and you know after you know, it's over.\nYou know, think about that, but we're right now we're working on a map to map out every single district and to map out every single friends of a group in the parks in which they are.\nOnce it comes out, we're going to make it available to everybody to have access to, because we feel that be a great tool for people who not only want to know about the friends of the group might want to get involved, enjoying that friendship group just to do like a volunteer project with them.\nI was wondering if you were aware of the daffodil project and okay, and is there any for those of you who don't know it's not going offer from the Dutch to provide daffodil bill, bulbs, free planting in the parks and commemoration of 9:11.\nI will look into that and to see, if there's any updates that they might have, because on our end, because we try to work hand in hand with them, because a lot of our group utilizes utilize, the daffodil project, to get that for those especially around the full time, and we usually try to understand when they're going to do their distribution.\nAnd I said: What are the plans for the broken banks and what would be a realistic way of getting life in the state parks in New. I.\nWe understand probably walking that night Tom can be a little dangerous in some areas with you know, without having no power and all our parks do offer power with our power lines and our light posts.\nI, know right now, due to like I, said anything when it comes to a comfort station being closed and not being open.\nWe took it from gravel to you know where how where it's going, today, I think Brooklyn.\nAnd I think you know, especially now you know New York's, taking a beating, left and right on a public level.\nYou know what type of working group to your point before it's something that I'm pretty passionate about growing up in the city and I.\nThey are great resources for the map, for the whole entire park manages Manhattan but parks in general, but I'm going to put my email in the chat so that you know once if I can't answer the question, here, I can try to answer it after the meeting is done.\nIt also had other recreation spaces in it as well, but the parks department I mean D.O.T closed it in 2009, and at that point they indicated it would reopen in 2014.\nDon't hesitate to think this over and try to talk to your neighbors, about supporting our local parks.\nLet me give a little background for people who are less familiar with the Brooklyn bridge banks, as well as the other area that we're looking to take and reopen as recreation spaces for the community.\nBut, it's true, the east side of Community board one is not, does not have a lot of recreation, space, particularly active recreation space, particularly for youth and others that are a little beyond you, know, toddler and playground age, people who want to ride a bike or fly kite or ride a skateboard or do any other activities, basketball, Et, cetera.\nWe need to do on the bridge, which is going to necessitate the closure of the space, and at that point they were telling us, or they were estimating that in five years it would be reopened.\nAs, you know, the city closed the area at the Brooklyn bridge, unofficially known as red Brick park in 2009 for construction and security.\nThe space provides access and staging for work on Dot's bridge Brooklyn, bridge rehabilitation contracts which seek to keep the iconic broken bridge.\nThese crews perform daily work from bridge preventative maintenance to roadway resurfacing that helps keep the city's transportation network moving forward, D.O.T plans to add additional operations to the space in the near future, including contractor operations to minimize our footprint within other areas of the community.\nAnd Rosa is probably the one and the reason why we have over a hundred participants in this meeting tonight, because she reached out to some people who want to see especially Brooklyn beach banks reopen, but with that.\nWe just don't have, as you said, space in our neighborhood for kids to go out and play ball or soccer or bike or skate for people to just you know chill out near the water and what makes this bridge, maybe not as great for a a standard, park.\nWell said Rosa, and we definitely need you and people like you and your enthusiasm to try to make this work.\nSo I guess my question: hi Rodney, hello, is what are the security issues because to me when somebody says that the Brooklyn bridge is a security issue, I'm thinking, well.\nWhy is the underside of the bridge more of a security issue than the actual bridge itself and couldn't it be planned with or dealt with in such a way to maintain its secure ability, while still leaving the bath vast area underneath it open for public use.\nWe will be able to have security more in depth and also when it's time for opening to reopening the park, the NYPD would do a security assessment of the area and see what it looks like right.\nThis is the way it was 10 years ago, but I am pretty sure that the Brooklyn bridge is considered a terrorist target and so putting any park underneath it, or at least in vulnerable areas, could open up the bridge to potential terrorist attacks.\nAnd I want everyone to know that the NYPD will do a vulnerability assessment of the park in the area because it, the pillars of the bridge, are obviously near the park and the major roadways are above the park, but that will be part of it.\nI think once we let them know that it's on the horizon, then we'll be able to push for something like that.\nIs there a plan b strategy where perhaps we use this as leverage to identify other areas and push parks and the city to focus on building those out to meet the needs of the community.\nI think we want to try to go for this space again and somebody who knows the spaces in this side of town.\nAround here, I mean unless Howard Hughes wants to give that space to the community and build a park.\nYou know if any development plans or drawings for what could be in that space were ever prepared from a park perspective.\nFirst, the Brooklyn bridge banks had been a park area, so it already, you know, had a layout of basketball and other courts, and obviously a good portion of it was used for skateboarding as well.\nI. Don't know if it's tonight or next time or whatever, but you know, I, think we need to get the electeds on board with what is obviously a really frankly obvious and great idea and has a great deal of support.\nLet me see it looks like I've called on all the members of the community board who have their hands up.\nMost people in New York know me: I've been skating, the Brooklyn bank, since I was literally 10 years old, so I went to school for architecture.\nYou mentioned the Brooklyn bridge forest and it looks interesting, but if they're going to try to take out the just, no, the reason why the Brooklyn banks are so special, which is how it's naturally made for skateboarding kind of a tough kind of stuff deal.\nI mean there's any way that we can try to get it going so that we can get the space back to the skateboarders.\nI mean the arches has always been pretty much closed and there was never really access the whole time that I've skated there for, like the 10 years.\nThere could be a way to get this back to the public and maybe do something amazing for not only skateboarders but for like the whole community, without taking away the skateboarding aspect of that space that because in reality the skateboarders make it really special.\nI think that this is not only a landmark for New York City, but an element that's being lost here is that it's also a cultural landmark for the skateboard community, so I kind of wanted to take a moment to talk about that when.\nMy family actually owned a skate park in Westchester Pennsylvania, so I feel connected to the Brooklyn banks, even though I never skated there, because it is so iconic and for all the reasons that Richie and Leo just said.\nI'll echo what Rosa and everybody else said like there's no work that happens there on a day-to-day basis, I walk past the space, every day.\nI'd like to also add the high school there that my school is in has no windows so having a physical space right across the street would be essential for our students, many of whom skateboard or many of them play.\nI like actually greet students and look at the Brooklyn banks as they come in every single day.\nI'm sure there's hundreds of other skateboarders and people on here who would be happy to organize to make sure that this thing opens because I don't think that it's going to happen, if we don't have people putting pressure on the local elected officials and coordinating as a community.\nI think that if you want to bring back Brooklyn banks, you know arguing with the D.O.T about what they do with their trucks is pointless.\nAnd I want to just thank you, Paul and the community board, one for being such positive advocate of this opportunity to grow the Brooklyn banks.\nThe Pablo Ramirez Foundation is willing to be an advocate to help bring skaters in New York City together to make this dream possible to bring back and save the Brooklyn banks.\nAnd I know that the department of transportation likes this free parking and the possibility of more storage space, but considering local school leaders.\nI, just I, guess just to finish, I mean seeing the banks fenced in this way, pains skateboarders across the world and wastes additional public space that could and should be open to all New Yorkers.\nThe Brooklyn banks would once again provide a safe space where like-minded people can get together to skate and to rebuild community.\nAn awful skateboarder always have been, and unfortunately, never grew into it, but I think the thing that set the banks, apart from every other skate park in New, York City and continues to or could continue, to, is, its ability to be a mixed-use space, I loved skateboarding and.\nI would often go to the banks and it was an opportunity for me to sit and watch and be a part of skateboarding culture and see my favorite pros, come to town and watch all these people and be a part of the community in the same space.\nAnd I got after my own passions in that space, which was drawing sketching one of my own talents and the connections that I made at the banks and the work that I did there and the things that I learned.\nI would just say if you're, basically going to repeat, what's already been said, I, think you get the sense that our community board is rather supportive, but we will call on you if you'd like to be heard, but try to make your comments.\nLove, Park, San Francisco had a marcadero, but these places are gone, now, they've been torn down and the Brooklyn banks is one of the only spaces left like this in American't, just New York City.\nIt's inspiring to see everyone here who wants to help save the banks, and you know just the fact that this conversation is on the table is really great to see.\nThink that there's a lot to learn from using that as an epicenter for people to get to know you New York as well.\nThink the most important thing about this is that the community is willing to work with DOT and whoever else needs access to the space.\nIt was then, and always the spot to go to in New York, City, Steve, Rodriguez, I, also know, and at one point years several years ago he asked me in a text message, what's the most famous skate spot world and without hesitation, I fired right back a text that said the Brooklyn banks.\nBut I know when other people saw them taking bricks out of the banks, they were pretty much tearing at the fabric of New York City skateboarding.\nYou know the Brooklyn banks is the melting pot under the bridge, but.\nI would like to suggest that you know wave for the skating community, as others have suggested, should be at the forefront of the agenda and also I want to talk about the vaults I did some research into the history, and.\nI went, and it really helped me really get to know what New York is kind of like, and it's a really great melting pot and cultural meeting point for the city of not just skateboarders, but.\nLet me know, because I really think Brooklyn banks should always be there for everyone to come.\nI think you did provide a lot of very good information for the community board to know those arches by the way.\nYou know, the Brooklyn bridge banks and that's on the North West side of the of the basically the three blocks that this area runs under, but it there's actually four acres in those combined three lots, and.\nThe speakers here were or users of a space that had served this community for many years and great rare collections, but we're trying to create another space as well in that dugout area and I, don't know if anyone has any questions on that.\nSo you heard the element largely that we want to put in it basically urging DOT NYPD to work with the community board.\nYou know things need to be done, procedurally correct, but it seems non-controversial which is a plus I, don't think anyone's going to vote against it, but maybe just go through a little bullet point there to help us out all right Diana, since you've taken better notes, probably than I have do you want to.\nIs, like you, said that we want the the DOT NYPD parks, department, to the extent that they're involved.\nAre elected officials to all work towards this common goal of returning this space with Brooklyn bridge back to the public, the Brooklyn banks and the state park has been talked about.\nA lot tonight, but we're talking about you, know space.\nYou know what I'm going to throw in parks.\nYou want the full Brooklyn bridge bank recreation and open space area restored to the community."
        }
    }
}