{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB2",
            "channelId": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "title": "2020.09.25 - CB2 Finance \\u0026 Personnel Committee Meeting",
            "publishDate": "2020-09-25",
            "shortDescription": "Brooklyn Community Board 2 (CB2)\\nFinance \\u0026 Personnel (F\\u0026P) Committee\\nThursday, September 24, 2020 // 6:00pm\\nremote via Webex\\n\\n00:00:00 - Welcome \\u0026 Process\\n00:00:22 - Roll Call \\u0026 Introductions\\n00:02:44 - Approval: Agenda\\n00:02:59 - Approval \\u0026 Discussion: May 2020 Committee Minutes\\n\\n00:07:10 - Budget Discussion\\n00:15:13 - Digital Strategy Budget \\n00:45:00 - Old Business\\n00:52:30 - Community Forum\\n00:52:43 - Motion to Adjourn to Executive Session"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB2",
            "normalizedName": "Brooklyn Community Board 2",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCcQ_OayNaOsqLAr1RRDHtsw",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 178,
                "um": 111
            },
            "wordCountFullTranscript": {
                "meeting": 36,
                "budget": 34,
                "zoom": 32,
                "committee": 28,
                "year": 24,
                "staff": 23,
                "meetings": 20,
                "money": 19,
                "things": 18,
                "motion": 14
            },
            "wordCountSummary": {
                "budget": 10,
                "committee": 9,
                "money": 6,
                "year": 4,
                "things": 4,
                "staff": 3,
                "office": 3,
                "questions": 3,
                "board": 3,
                "chair": 2
            },
            "fullTranscript": "Oh good evening, everyone, my name, is leonard jordan and I'm the chair of the finance and personnel committee and also first vice chair of community board 2.. So we're going to go with introductions. I guess I guess I don't know what direction that we're gonna go in, but let's start with well: okay, well, rob rob paris, district manager, hey meredith, secretary of the committee, barbara saller gringer; second, vice chair of the community board: okay, betty hi, I'm betty feybus, chair of youth, education, cultural affairs, okay, so we have some others with us. Fred hayes, he's muted red we're going around for introductions so brett, okay, he unmuted brett we're introducing ourselves. Okay, let's we'll have to come back to brett gustavo gosavo, just introduce yourself. That's all these people are shy. Today, hello, my name is tiffany. I'm a student, okay, you're, a student, okay, welcome, tiffany, zachary smith, hi guys. My name is zachary smith. I am covering community district 2.. You, a bunch of you, may have seen me on other board meetings. Just listening in okay, welcome, zachary and brett hi, I'm brett! I live in the community. I just wanted to check out one of the meetings. Okay, all right welcome all right. I think we got everybody except for gustavo and well. We have two of our staff members on also so can I have a motion to approve the agenda. I move to approve the agenda, ms all, in favor, aye, okay and the review of the minutes. The may 20 may 20th minutes. Is there a motion to approve? I had some questions about that sure I don't want to do that now or well. I was gonna, make a motion then second, and then we could go with all right. Is there a motion to approve okay, miss fly, bush, miss zelda, gringa and discussion about the minutes, barbara right under number, seven new business. It talks about approving the purchase of three standing desks for the office. I wanted to find out if that was taken care of oh some of the items that we ordered during the spring, while lots of workers all across America went from their offices to their homes and there were supply issues, and so those three desks were ordered, but they have not yet been received. Okay, so that's good to know. I just really had one typo on agenda number three. It says review of the minutes that would take place. It should be at future meetings. Do the minutes will take place? Would you say at it needs a t, okay and then on a similar question under number: seven have all the sneeze guards and that sort of thing been purchased. We do have sneeze guards. We do have masks, we do have a cleaning supplies the. What am I missing? Excuse me: there's one code, there's one very obvious: Covid-19 related purchase that I can't think of that is backward, the plexi barriers. No, we have the plexi barriers all right, but it's good to know that these items work in both cases and then just under that number. Seven. On the third page, the paragraph where it says mr singletary amended his motion, it says miss mcrae. Second lead the amendment and seconded. My guess is that's not really what happened? No, which one is that barbara. Now what all right number seven is kind of big. Is this the second paragraph? Sorry, it's the third paragraph. Third paragraph okay, it says mr singletary amended his motion and then it says miss mcrae. Secondly, the amendment and seconded oh okay, wait a minute, I'm missing someone else. Mr singletary noted that the norm doesn't allow for technology all right. I don't see where it says. Mr singletary. Second, oh I'm sorry, there's another okay, all right! I'm getting confused here! This is a long one. It should just be. I guess it's. Mr singletary made the motion and then miss mcrae seconded second of the amendment yeah. It probably should be second amendment. Okay, mr singletary made the motion and miss mcrae seconded yeah right. Okay, so I guess miss fibers amend your motion to accepting the minutes with correction. I move to accept the minutes with the corrections stated. Okay and this five bush has seconded all right all in favor all right, four zero. All right thanks a lot barbara corrections. So the next thing on our agenda is budget update. So I would just refer. We don't have a paper document, so I would just refer to mr paris to give us some information as far as how we doing with our budget so far, so we're a week away from the end of the first, the first quarter and we have spent essentially no money at all. We have an outstanding bill from fiscal year, 2020 that we'll need to pay, but because of a couple of things, one there's. No, I'm the only staff member in the office so we're not using materials buying and drinking water, etc. So there have been no purchases. For that reason, and then a couple of our regular vendors have moved to a new system with the city, and getting that set up is a lot has, is proving a lot harder than the existing fms financial management system. Okay, so we just have one bill: that's outstanding for this year, yeah, that's correct! Okay, we do. We have any do we owe anybody any money from outstanding invoices, just this one outstanding invoice for the the software that allows the staff to access the server and the office from their homes, okay and so far in the first quarter, so in the first quarter, so I was just like so thank you very much. Does any other committee members have any questions for mr paris about the budget? Okay, I would just like to ask- I guess I guess at least for our finance and personnel committee meeting. I don't think I mean it may not be. You know effective to have one every month, but to have a a document that gives us the budget where we stand. You know expenses and what's left out of the budget for the fiscal year. Every time we have our our meeting for the finance and personnel committee I did. I did ask carol ann for that, but when she revealed to me that we had spent no money, the reconciliation would be the budget has approved remains our entire budget right. No, I understand okay and plus we're coming out of this Covid-19 19 environment, and I don't understand what's going on, but as we move forward, because at least we want to make sure that we're. You know we're spending money. Well, not so much that we're spending money appropriately, but that if we have money, that's maybe it could be allocated somewhere else where at least we're aware of it. You know what I mean, so that's why I wanted to make sure we get a report. Well, just you know, just while we're on that topic conceptually, the committee might want to think about how it might reallocate funds because, as it looks now, we are going to have unspent money later in the year because we're not spending money on, say the meals for the executive committee or where we have bought no office supplies. So you should, you know, in sort of broad terms, start to think about how else you might want to spend money, because it is quite foreseeable that there will be unspent funds in the first half of 2021.. Well, I have a question about that on the flip side. Of that, do we anticipate that our budget might get cut? I think it is a very real possibility that in the January financial plan of the office of management and budget may just reach in and take some money out of the budget, he did that last year. I'm wondering if we should talk about. You know priorities in the budget. Well, this is the this is the reason why I want to have a document that has all the oh yeah so and this way we can see it and then we review it and then see where we can reallocate you know. You know funds to take care of certain expenditures, because mr paris is correct. We haven't been buying any meals for the executive committee, we haven't and not that they're, not exorbitant expenses, but there are some things that we haven't some funds that we haven't expended and I don't think I guess in the short term it doesn't look like we are going to so we can. You know, discuss that. Certainly any other questions from mr penny yeah. I do so sometimes in these budget cycles their recommendations to purchase more stamps, or you know, postage things or paper, or things of that nature that you can just keep and use when you need to, because it is likely with the city's budget situation that money will be taken away. But if we have a closet full of paper and stamps, I'm just suggesting that, but it could be yeah anything that the people who do the work might need. So are there those types of materials that could be kind of purchased and stashed away for bad times? There can be. That is a a paradigm that we follow. We did that at the end of the last fiscal year, however, so we're pretty well set in that regard also, there's a fair amount of money in escrow with pitney bowes and the amount of postage that we use every year gets smaller and smaller every year. Yeah postage and paper is one of the things that we use a little since we do a lot of stuff with electronic communication. So it's not a lot of, and we haven't been meeting committee, the at least the executive committee meeting and even the the general meeting has been electronic. You know so that we don't. We don't have to print out a whole lot of stuff, so yeah, but you're right, miss fivers. There are other things that we probably could think about reallocating, ultimately or, and additionally, I know that other groups have figured out what their I don't want to say surplus, but the money that they might indeed have and say. Well, each committee could have a certain amount to spend. You know on appropriate things based on a plan that would be approved by the executive committee or the officers or something that would enhance the work of outreach of the community board. Okay, I think it also ties into the next topic, the expenses for the proposed digital communication yeah. Well, I want to I want to make sure we're finished with the budget update first. So any other questions concerns about that. Okay, then we'll move on to the next one. The other thing also, we have to do folks is to think about dates for our meetings, because this is the last scheduled date that we did. I think, last year, all right, so you know as we move forward. So the next item on the agenda is the expenses associated with proposed digital communication. Mr singletary welcome you. I know you had asked to put this on the agenda. Did you have anything to say before this? I think you're, muted, len good evening good evening. Can you hear me good evening good? I wanted to make sure that, given the presentation that the office made about the enhancements for technology and the presentation that taya gave when she walked through the use of social media, that, while it was laid out as mr paris has shared on the screen, what those expected expenses would be that, given that we are in a fiscal management period, we wanted to make sure that we, as a committee from the financial aspect of our purview, look this and review this with some level of expense management to see what can actually be done. What will really matter to expectations and, more importantly, while there's a series of options there you know is this something that the budget can withstand? If we just start small or can we handle? All of this, that's want to make sure we had a chance to review it and figure out. What's the right solution for us all right, that's excellent! Because that's exactly you know, since we're not spending money in other areas, are we able to do some of these things here? When do we have to make a decision on this? Is this something that we have to? The timing is up to mr singletary? Okay, I'm sorry, I'm a single terry yeah! I was going to answer that. I don't know that. Do we do we need to rush. I do think that we should, you know, be methodical and really go through this with a fine tooth comb, but given the demand from board members and the community, you know you know if we could get it done sometime within early fourth quarter. I think we'd be fine to do it in that period. Okay, so that would be good, especially so rob even more so then we would should have our budget so that we can determine you know what monies we have and what monies we can start to. You know I guess, reallocate and look at some of the at these items and see if these are all to do, we can do them all or that we can do some of them. So you know the committee left a fair amount of money in reserve last year. I think that you have plenty of money for most of your dreams. You mean everything is on this sheet, you mean and beyond and beyond, okay, but we still need to there's some other things too, because miss fivers had an idea too that she, you know, wanted to bounce around to the committee I will, I will look for. I will look for the budget yeah, no yeah, I'm talking about for the next meeting, that we have all right. So the next meeting that we have we might be able to. We get the budget in advance and we're able to discuss it intelligently because we'll have all the numbers. You know there and decide on some of these things here or maybe all of them. You know they all I mean they're all necessary and they all look good to me. The only thing is I was just thinking about. Can we sustain it over time because once we get into this, I guess we would these are these will be expenses that we would have every year? Is that correct? Not probably not the figure at the top, which is the largest of the numbers, but the rest of the numbers would be recurring expenses, okay, because the one at the top says nine hundred dollars per year. The remote server access, that's true, but that was that was something that we purchased in order to allow staff to work from home. I you know the optimism has become less optimistic over time, but I don't think that we are living the rest of our lives. The way we've been living them for the last several months. Okay, all right does taya have anything to add to this hey. Is she still on hi, mr jordan? I just nothing to add, except that the gray boxes actually indicate tools that have already been purchased. Oh, I hope that was good. That's good to know! Oh okay, all right, so the grades are oh, so all right, I got you okay. So, for example, many of the internal tools are tools that have been in the district offices toolkit for many years already. Okay, so that's I'm sorry! Maybe I must have missed that. So are we having a conversation about whether we want to spend 180 a year for zoom? Was that mr singletary, I said I missed the point that the items that are in gray are things that are already within the yes, the boards. So what I'm? What I guess, what I'm asking is? Are we really having a budget discussion about 180 a year for zoom? I I'm not sure why you wanted to discuss this particular aspect this that what you're looking at is basically a snapshot of the total cost of communications, both internal and external, for the office. So, let's back up a minute when we, when we had this conversation- and we can do this offline- I said it would be great, but I want to run it before the financial personnel committee from a budgetary perspective. Perhaps I missed it, but at no time until now was I aware that the items that were boxed in gray were things that were already covered and utilized within the office. That being said, the only other item that is not in gray on the screen that I'm looking at now is the cost for the tool identify the zoom at 180 a year. Is that correct? Okay? So I go back to my earlier statement. The budgetary discussion we need to have is whether or not we can afford to spend 180 a year. Is that correct? Okay, that's what I need to know. Thank you, okay already in the budget. Now, if the city is approving zoom, would that replace webex and would the city be paying for it or even if the city approves it and it replaces webex, the community board is going to have to pay 180 dollars. So barbara, you sound a little faint. What I think your question is whether or not the community board. If they approach a zoo, can they replace web? I don't know that we would replace webex, but I think what zoom does is offer and I'm going to use my words, perhaps a more user-friendly tool to communicate from a committee and community board 2 perspective, and then there are certain features that are a little user friendly in zoom that could accommodate, perhaps a larger general body meeting, but the preferred tool from the city of new york is webex and say or rob if I'm wrong in my statement, please correct me, but that's my understanding. No, you are correct, mr singletary, and I had a conversation with. Do it on behalf of the Brooklyn district managers, about switching to zoom. That might be something that do it is comfortable with in the future, but they are not there yet, and so, if we were to move to zoom, we would incur that expense on our own mm-hmm. Thank you, okay. I guess I had another follow-up question there too, because I thought that the city said said that webex was the only approved remote meeting application that we could use. You know, let's say, for official meetings in that the zoom applica I mean that they didn't really trust zoom because of the security situation yeah that has been their policy and continues to be their policy. However, as part of my conversation, I did point out that there are a number of agencies that are using zoom, so that seems to contradict the official policy. Okay, all right and then also it could be used. Let's say: well, okay, we could there could be other uses for zoom, also not even at just at official meetings. So let's say communications between staff workers or committee chairs, or something like that right. Okay, all right good and mr jordan, if you, if you would like, I have brought up the budget. If you would like to look at that, I can do that. Well, you know. I see what the committee thinks. I think we would like to probably look at that beforehand. Right now I mean, if we did it right now, I think it would take. It would take an inordinate amount of time, because you know we'd be asking a lot of questions. I mean this way I'd like people to be able to prepare their questions beforehand, and then you know we can discuss it. You know at the next meeting because I think well actually, as miss singletary said, the only thing that we're really talking about is additional 180 for zoom, which I don't think is going to be a big discussion. You know so I mean what does everybody else think I I'd like to see the budget and then maybe you could send it to us. Well, yeah, so we'll look at it. I'm gonna have to talk about it a lot, but it would just be good to see it. I think the budget is what the board approved in last year yeah beginning of the year and, as I said, we've spent nothing so right. You know. If you I just thought you might want a refresher about how you had allocated the funds and taya has there. It is so. Let me let me make a suggestion: why don't we if rob, if you could send it out to all of us all right and then we could discuss it at the next next regular meeting? All right, you don't, oh sure, whatever okay, I mean that's what it looks like thanks for sharing the screen. You know, but I mean you know. I think people would want to look at it first and develop their questions in this way we could save time, but when we have the discussion, okay, I'm not understanding they'll be asking you how much money did we spend on this? Why you know which one which line item is the one that we haven't been spending a lot of money on. You know that kind of in the future. So the answer to all these questions are: we have spent no money in the first quarter of 2021.. I got you okay, it's there, mr jordan. Yes, yeah! Do we need to just or allow or make a motion to allow the staff to purchase zoom now at this meeting, or is there a reason why we wouldn't do that? If you know I'm assuming that it appears on that grid, because the staff would like to have access to zoom yeah- and you know hearing first- that we really haven't spent anything in the first quarter at all. It sounds like there's room on whatever line that expense would appear on to and if it's going to help make their lives easier. I'd say: let's discuss allowing them to do that now, rather than wait until the next meeting, it's just a hundred and eighty dollars. Unless I'm misunderstanding, okay along those lines, one of the things you need to think about is two different buckets. Meredith you're, absolutely right. If we're talking about just affording the ability to have the staff or the budget accommodate that expense, you're, absolutely right. What I'm that clear on is, if do its position is webex is their preferred method of communication, although, as mr paris indicated there are other agencies choosing to use zoom, what does that mean for us right? I guess if I had any reservation, it would just be to get a little clarity on that. If that means, we can just go it alone and just do whatever we want, and that's what that translation is I'm okay with that? That's really more of what would you know, allowability in one bucket versus the expense, the expenses in a different bucket and to your point, if it's just about approving that and adding it or deducting it from the from the budget, then you're right if the chairs still desire being mr jordan, that that's something we want to do, I think we'll send our purview. I just want to be clear. We approve of something that we later would be told we can't use. I just want to be clear on that yeah. You know it. Isn't it isn't that we would not be allowed to use. It would be that we would have no support from do it. When we have problems with webex, we don't have to go to webex. We can go to do it and do it sort of acts as our agent. It's also possible that we could purchase boom and use it only in certain contexts where we feel comfortable using it. If we feel like, we don't feel comfortable using it in a meeting where the general public has been invited, we could continue to use webex and just use zoom for certain other meetings. Thanks rob that's helpful, thank you, okay, and what I was thinking and also what I was thinking of also is that we may have some other things that we want to do with the budget so that studying the budget, formulating our questions, we can make decisions, probably by the next meeting, we'll have all that information that we need in order to make decisions as to how much we're going to spend or reallocate from what was what was on the budget, the approved budget before so. My question is: if we purchase zoom now, I know the the district office people have meetings, you know virtual meetings. Would they then use zoom for their virtual meetings and would they find that more conducive to their meetings than using webex? I think webex is much better than when we started using it. Just you know it's a lot easier to do certain things on zoom, like change your name, you know. Well, I mean yeah, but oh so rob what do you use for your staff meetings? Webex, we do use webex, okay, it's the only it's the only platform we own right, so I mean I thought, maybe you'd do a conference call or something like that, but all right, so I mean you know either way I don't think making our decision at the next meeting is going to really. You know, push things back anymore so and then we have to determine when can we use zoom and when it's not appropriate to use zoom, because I, from what I understand webex, is still the application of choice by the city of new york. So all right! So, mr jordan! Yes, I don't want to belabor this, but I think that's correct. The webex is the preferred platform for public meetings, but if the staff wanted to use zoom to zoom with each other or for other meetings that were non-public facing that's allowed, that's my understanding from the explanations provided by staff here and just from you know, sort of being involved in other things. So it's I think it it's mostly up to you know. I mean I don't know, I guess we can, if there's further clarification needed, we need to be specific in what we're asking. So the staff knows what questions to ask, so we can have that, but from my perspective, if the staff will is asking for zoom and it's only 180 and it would make their lives at all easier, if it doesn't matter, then I don't need to push this, but if it is something that would make their lives easier now, I would still move that we allow them to make this purchase at this meeting rather than wait two or three months. I agree with meredith. Okay, well, all right, but this is the first I'm going to tell you. This is the first thing. I'm hearing that zoom was actually absolutely necessary for the staff to conduct business. Is that I think we're saying it's absolutely yeah. I don't think it's absolutely necessary, but I think they've, given us a presentation of their sort of you know. Full package of you know a full digital communication strategy in which zoom is included and from what I'm gathering this was presented previously at another meeting and now we're seeing it here, which I am definitely making the assumption. That constitutes a request, but staff, please interject, if it's not something that you really want, but that's how I'm interpreting its placement on this table? Well, I guess my understanding was because this is the first time I've seen it. I wasn't at that meeting. I don't know, I think mr singletary was there. I wasn't at that meeting. So I wasn't. Oh that's right. That was a general meeting. I didn't make all right, so I didn't you know. I wasn't aware of it until I saw it here today. So does anybody else have any thoughts of that? You missed a singletary yeah, listen! So when this was done, this is that came out of the conversation I had that was presented to me about what this staff would like to present as a way of enhancing the technical capabilities, including social media and everything else, and I said, okay, fine. This is great. Let's show it to the general body meeting which we did and then once my understanding of that there was some expense to be able to present that that's how we got here, mr jordan. It is fully within the prerogative of you as the chair that, if even if for no other reason, you want more time to review it, then we delay it. That's not to you know, contradict anything that was suggested by the other members of the committee, but as a chair you get the final say. So if you want a little more time, just even make yourself more comfortable with it and we take more time. I mean we don't need to go back and forth all night about this yeah. That's true I mean I really don't have I mean I prefer zoom myself. Let me ask another question, though, how it was presented to the general body. What was the? What was the response? What did people feel about? Everybody was excited to know that we were giving consideration to broadening our resources, particularly to be able to say that we would put have some form of a social media presence and, if you think about how we communicate today, it's really through form of email distribution to you know whoever's on our mailing list. But this would allow us to be able to leverage partnerships. It would allow us to communicate in more current streams, such as the category where we have external it's an opportunity to create a twitter account and just give brief information, instagram facebook internally to the office as a way of reducing paper and being more efficient. There are tools that are available through on google drive, there's ways to set up and communicate within the office, which you know the staff has already done today. They've communicated and stare and share information, largely because we're in a remote environment through google drive, there's several use of resources. They use through microsoft, like team, where they're able to communicate with each other in chat. That is another tool outside of just zoom and webex that are afforded to the to the staff. So they've already been moving in that direction and also to go one step further. They've created an alias where it allows for board members to be a little more paper free in the sense that there's a way that they can create a url that makes it real simple to mask all of the other paths that get you to share the information and once again makes us more efficient. So upon that presentation from taya representing the office and looking at what was highlighted in yellow at one thousand four hundred and four year, my understanding at the time was that, while that course doesn't seem exorbitant, we wanted to bring it to the financial personnel committee, which is rightfully where it belongs, to make a decision on how to move forward. Okay. So I just want to ask one other question and whoever has the answer to it. So it says here: zoom will be used for remote meetings. Can I ask what remote meetings staff meetings? That's all well originally or initially? You know, I think, from my conversation with do it they may be coming around to the idea that zoom can be used. More broadly they're not there yet, but I think the hope is that we can purchase the application now use it in whatever ways we feel comfortable, and if do it does become more open to using zoom. We already own it and we're ready to go okay, so right now the only people that will be able to use it are the staff members. If we purchase that you know, I think, that's you know, sort of a policy call for the community board in my conversations would do it. I didn't really come away feeling like they had rebutted anything that I said to them about other agencies using the product they just sort of fell back on. The official policy of the city is webex is the preferred product and the one we officially endorse yeah. Now. What I'm saying is that within community board, two, the only one that the only folks that would have access to it are the staff that right? If that's, what we decide yeah well, it was presented. That might just be the beginning. Look at it as a pilot. You know also, if I can sort of redirect the conversation you know. Zoom was one of many features here and because it's the one product that isn't already paid for you know, the focus of the conversation has been about zoom. You know some people on the staff feel strongly that it's a much better product. I think you express the same, mr jordan, but you know what taya presented at the general meeting was an overall unified digital communication strategy, and I think that what you know what the staff would like to do is work with the board to put that in into motion- and you know I think we'd almost be willing to table discussion on zoom and focus instead on our ability to broaden the tools that we have for communicating with the public. Okay, what was listed in that proposal? Rob taya. Can you go back to that summary page, this page, mr paris? No, the one that lists all the products in the course that one, thank you so rob. Are you saying there are items that are not on this list? That, perhaps should be that you want to talk about. Is that what you're saying no, what I'm saying is, can we can we start moving in the direction of board consensus about using social media and other tools to better communicate with the public, as you can see from the screen, many of which are at no cost to us? Well, I think it's a separate conversation right. Well, it is a separate conversation. I'm trying to change the current conversation to that one. The response from the board at the meeting indicated that they wanted us to move in this direction. I didn't think there was any question about that. It was just a sentiment so especially you know just to put it in the right context. No one visibly had any adverse reaction to the presentation. I think everybody, you know the majority for those who showed some kind of reaction either on screen or verbally, was in support of it, but it was never a vote taken. It was just a presentation as part of the chairs report. Do you think that's something the executive committee should be voting on? I think this is a is it's an expenditure that should come out of the finance and personnel committee right, the approval of the expenditures for the budget. You know, I think I think barbara is asking if the executive committee should discuss broadening the use of social media tools for communication with the public. Is that right, correct? What we've heard is that these funds have already been allotted, so there are no there's no cost to using social media. So it's not really something that you know impacts us. You know the budget, it's more a decision about strategy yeah from the board perspective, using social media, not we're not talking about zoom anymore. I guess we're talking about using things like facebook as a as a communication tool yeah, and if I can interrupt, I think, that's a broader discussion. I think that how we got here is that this one item that was on there for zoom all right- and that was the that was the issue. I think everybody felt that they said well, look why don't we disapprove that and it and it will, it will grow and be useful as we move forward it was that is. Did I get the? Is that a consensus of the committee? No, not at all what that's not said it wasn't. No, I think I would like to make a motion that we approve this expenditure today and that we purchase this and so that the office can start using it as soon as possible. I think I thought that's what I said, but when he just said that's what I said. I'm sorry if I didn't, if I misunderstood what you said: okay all right, so in order not to belabor this does somebody want to make a motion about. I just offered one the specific expense of the remote meetings for zoom 180 a year so barbara. Yes, I move that we approve the expenditure of 180 a year to purchase zoom ability. Is there a second a second, I miss five bush all in favor, yes, okay, any opposed or abstentions. Okay, so that motion carries, and so you're authorized to do that. Well, taya and rob thank you: okay, the old business, any old business from before. Well, I would like to discuss some of the topics we talked about in closed section, an executive session last time. Well, wait a minute that was an executive session, barbara yeah. I don't think we're going to discuss that in an open meeting. No, but you just asked about- and I'm just mentioning that I would like to discuss that. Okay, we need to go to closed session exactly all right if you have something to discuss as far as that's concerned, is there any other old business? Okay, new business is that we have to finalize some dates for our next meetings. Okay, so September November is a meeting month and the next meeting month would be february. I believe, is that right rob that's your call, I think by february we should have the January financial plan. We will know whether our budget has been reduced and we will hopefully have a budget number at least a preliminary one for fiscal year. 2022. right, that's what I was thinking of, because we need to present to the general meeting a budget for the next fiscal year, which probably would be in April well, usually March or April, but some it went to may last time and so february. Two three four April and let's put a tentative date for may so we usually have the. I guess it's the fourth thursday of every month. Does that not interfere with any committee meetings february 25th is free exactly you have thanksgiving so that wouldn't be good right. You could do it yeah, no November. We would we'd make that a little earlier. Let's see that's, it would be the 26th. What about November 19th? That's the night of the transportation committee meeting okay! Well, maybe we could go to December, then oh boy, no December, it doesn't work and the 17th is that's. Probably a committee meeting also right. Well, let me remember, is there? Is there a day in in that week of the 16th 17th, 18th 19th that might be free, I'm sorry, I've lost track of which month we're in November, tuesday, the 17th tuesday, the 17th? How does that work for everybody any problems there? I think that's fine, okay, so that doesn't work number seven I would say glenn. The 17th does not work for me. Okay, okay, we could either do November, but since thanksgiving is so close, we can do December. Also right is that right. May I offer a suggestion? Mr singletary, I mean mr jordan. Yes, how about monday November 30th, that's right after the holiday, though right that is, we will have recovered, I'm sure. Well, I don't know. Does that. Is that? How does that work? Everybody? I don't know about other people, but this year people may not be doing much. You know traveling or festivities, so I think it's fine. Well, let me just see is November 30th. Does anybody have any issues with November 30th, I'm not going anywhere? Okay, so pencil in November, 30th and after that December January february 25th february 25th is not a conflict and then April. What about April 21st? The 21st is the land use committee meeting but thursday the 22nd is free. No I'm looking at the wrong ear. No wonder I'm sorry about that was my fault. April, the April 22nd, that's what I meant April 22nd and then I just wanted to make a date in may, just just as a precaution may the 20th okay is the meeting, is the transportation committee meeting? Am I looking at is that's a thursday? It is a thursday, but it's the third thursday, not the fourth. Oh I'm sorry may 27th sorry about that. May 27th conflict for anybody. Of course I mean you know. If we can, if something comes up, we can always try to get an alternate date. So we have well September is now this is that meeting November 30th December, I'm sorry february 25th, these all thursdays for April, 22nd and may 27th, okay, anything else! Now, barbara! You said you wanted to discuss something I mean I see in this webex platform. If we, if everybody logged we wouldn't be able to, you, know right rob, we need somebody on here to run the meeting. Oh okay, yeah taya can transfer the host to one of the six. They can make me the host and that will keep the meeting going. Okay, all right! That would be good thanks. Mr singletary, I appreciate that you'll need to use the participant panel to ensure that it's just the six of you, okay, do we right do we have to close the meeting to the to the public? Well, if we're going into executive session. Yes, now, let me ask: is anybody on that's on that has something to say before this committee? Okay, all right, so we're gonna be closing out. So I just asked everybody to log off. First of all, you may have a motion to adjourn the meeting during the regular session and we're going into the executive session all right. It's five bush and this robert zelegringa all right. Okay, we'll just wait so taya. Could you transfer the host to mr singletary? Okay, very good! So was it so I do have one quick question, given that we are about to enter into executive session, we are allowed to stop the recording correct. Oh absolutely, I forgot about that yeah. Actually, mr singletary, could you pass the host privilege back to me or maybe you could stop the recording on your end. I did not stop the recording before.",
            "summary": "Okay, well, rob rob paris, district manager, hey meredith, secretary of the committee, barbara saller gringer; second, vice chair of the community board: okay, Betty hi, I'm betty feybus, chair of youth, education, cultural affairs, okay, All these people are shy.\nJust this one outstanding invoice for the the software that allows the staff to access the server and the office from their homes, And so far in the first quarter, so In the first quarter, so I was Does any other committee members have any questions for mr paris about the budget?\nWell, just you know, just while we're on that topic conceptually, the committee might want to think about how it might reallocate funds because.\nAs it looks now, we are going to have unspent money later in the year because we're not spending money, on, say the meals for the executive committee or where we have bought no office.\nSo, you should, you know, in sort of broad terms, start to think about how else you might want to spend money, because it is quite foreseeable that there will be unspent funds in the first half of 2021.\nI do so sometimes in these budget cycles, their recommendations to purchase more stamps, or you know, postage things or paper, or things of that nature that you can just keep and use when you need to, because it is likely with the city's budget situation, that money will be taken.\nYou know on appropriate things, based on a plan that would be approved by the executive committee or the officers or something that would enhance the work of outreach of the community.\nYou know the committee left a fair amount of money in reserve last year.\nAnd I'm, going to use my words, perhaps a more user-friendly tool to communicate from a committee and community board 2, perspective, and You are correct, mr singletary, and I had a conversation.\nSo, let's say communications between staff workers or committee chairs, or something like that: Okay, all right, good and mr jordan, if you, if you would like, I, have brought up the budget.\nI mean this way, I'd like people to be able to prepare their questions, beforehand, and Think I I'd like to see the budget I think the budget is what the board approved in last year.\nIn this way we could save time, but when we have the discussion, okay, I'm, not understanding they'll be asking you how much money did we spend on this?\nWhat I was thinking of also is that we may have some other things that we want to do with the budget so that studying the budget, formulating our questions, we can make decisions, probably by the next meeting, we'll have all that information that we need in order to make decisions as to how much we're going to spend or reallocate from what was what was on the budget.\nYou, know, I think, from my conversation with, do it they may be coming around to the idea that zoom can be used.\nThat's you know, sort of a policy call for the community board in my conversations would do it.\nI. Think that what you know what the staff would like to do is work with the board to put that in into motion- You know I think we'd almost be willing to table discussion on zoom and focus instead on our ability to broaden the tools that we have for communicating with the public.\nThink barbara is asking if the executive committee should discuss broadening the use of social media tools for communication with the public.\nNo, I think I would like to make a motion that we approve this expenditure today and that we purchase this and so that the office can start using it as soon as possible.\nThat's what I was thinking of, because we need to present to the general meeting a budget for the next fiscal year, which probably would be in April well, usually March or April, but some it went to may last time and so february."
        }
    }
}