{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 October 2020 Clinton\\\\Hell's Kitchen Land Use Committee",
            "publishDate": "2020-10-26",
            "shortDescription": "AGENDA\\n1. Update: Radson to Provide Design and Environmental Review Update on the Slaughterhouse Project - 495 11th Avenue\\n\\n2. Discussion/Vote: Statement of District Needs and Budget Requests for Fiscal Year 2022\\n\\n3. Old\\\\New Business:",
            "lengthSeconds": "1:40:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "b-XkU0OUk4E",
            "fillerWordCount": {
                "uh": 270,
                "um": 338
            },
            "readTimeFullTranscript": "57 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "building": 50,
                "space": 49,
                "design": 39,
                "housing": 31,
                "street": 26,
                "project": 23,
                "hotel": 22,
                "tower": 20,
                "plaza": 20,
                "base": 18
            },
            "wordCountSummary": {
                "space": 15,
                "housing": 12,
                "street": 11,
                "building": 7,
                "design": 6,
                "plaza": 5,
                "spaces": 4,
                "center": 4,
                "hotel": 4,
                "years": 4
            },
            "fullTranscript": "Janine, I'm not sure how do we get the screen here to screen share for the presentation? Not yet I just want to introduce us first, I see you are you on. Are you on street? Are you on Speaker, View or gallery view Jd up in the top right? You should see a button that says Speaker, View or gallery View Speaker View makes the speaker more prominent gallery view shows everybody. Well, if you hover over the top right corner of your screen, yeah you'll see a button gallery view or speaker view. No, it does not say it there. It is. Ah yeah got it. Thanks, Paul, you betcha, then, when you have it on Speaker view. Here there we go now it's coming Yay thanks Paul, I see a couple. Lauren George is here twice well welcome and welcome. Lauren. I have lauren here three times. I think it might be the way the link worked. Okay, now everybody's coming out. I think we have more in a quorum here. So can I be heard pretty clearly yeah? Okay, good evening, everybody, I'm Danielle Noland, I'm the chair of the health kitchen, Clinton land use and Zoning committee of Manhattan Community board 4.. This is our monthly meeting for October 2020 and the we have two items on the agenda tonight. One is the budget priorities and the other is a development, can't remember the name, something called the slaughterhouse, which we're going to review again now, as you all know, we are being running this meeting remotely and it's being recorded and transcribed. So you should know that. So I think the way it works. Everybody stays mute during the presentation and then when we have questions, I think you can raise a little fist. If you have a button or just raise your hand, I'll try to get everybody in order as best I can sometimes it messes up, but we'll try and if they're any members of the public, we will certainly get to you and you can ask questions as well. So are there any questions about how we're proceeding so far? If they're, not I'm going to start off the meeting by asking Bob Benfado to discuss our contribution to the budget priorities, if we have any Bob, has a speaking engagement a little later on. So I'd like to get him up first, so we can go through that and then we'll go into the presentation. Bob all right thanks! This will be that we can do this. Pretty quick. Can you everyone hear me just to make sure and lauren George by the way looks like Richard bears, but just saying that we had two capital budget priority requests from this committee last year, one was listed as a priority, one by the presumably approved by the full board and another one is priority, was listed as 14. I'm going to ask Joe about them, though I think they also came from the housing committee. The first one was harborview, the harborview terrorist site, yeah, absolutely I'm assuming. We still want to keep that and that's still in limbo, right yeah and one that was 14 was senior affordable, rental apartments and the multi- family preservation loan program for 560, west and 500 West 52nd street. Yes, those are actually now in the Hp pipeline, okay, but we should still keep it in the they're not funded yet all right, then we had a couple of continuing support, meaning they had gotten funding, but we keep them on the the list for continuing support. One is for the apartments to build on site. Am I wondering which one that is slaughterhouse site that was listed as a assuming? We want to keep that one, there's no ranking for the continuing support. This is continuing support. The other one is four blocks. Five and six of the bella object park which, even though it has been funded OMB is not releasing the funds due to the pandemic. They're only doing condemnation right now, money they got from development, air ride sales, there's no money for a design at present and the other continuing support was 705, 10th avenue and the MTA site 806 9th Avenue, I'm assuming we all want to keep those. So if anyone wants to add anything to the capital budget. Otherwise, I would take a motion to approve motion to approve every second dude, all in favor there's the expense requests, but that was capital expense was all primarily, I think everyone's going to say yes for extra funding city budget, I mean it's not going to go anywhere, but you maintain the habit of requesting the number one request for the board that came from us was more funding for building code enforcement at D.O.B and to raise updating the DOB website as a priority. Yeah Paul, you have a question yeah. I just want to share what we spoke about on the Chelsea land use committee. There are two issues that came up. One is given the fact that we're facing a financial crisis that next year's budget, the 2022 fiscal year won't have any money in it. We're talking about limiting our requests for things that go beyond public Safety, public health, education and housing. So any additional budget requests we're just not even going to put in because it looks you know, as Bob just pointed out there, ai not going to be no money, so it ai not going to be funded. So why? Even bother putting in the request and just be respectful of being respectful of the fact that we do have a budget crunch that we're facing second issue that came up was we after saying all that we want to talk about a way to look at zoning regulations such that waivers, become easy enough that if there's a lot of commercial space that can be used as homes and housing locations, and it violates zoning regulations that there's a mechanism in place for reusing empty space, particularly in Hell's kitchen and Chelsea, that could be used as something different than currently exists in the zoning regulation. So we're looking at a lot of empty office space. What could be done with that space in the upcoming years and would that maybe provide housing opportunities, but if housing is not allowed in a particular zone that we allow for that to happen in some way and to do a study as to what needs to be looked at to provide usage for currently empty spaces. Thank you. Those are the two things we're discussing in Chelsea yeah, so Paul as a matter of zoning in commercial areas. You can build housing and you can convert an office building to housing, as of right. Storefronts can be converted to housing as of right. So I think you better temper your request. The only location we have in our district is in Hudson yards and a few areas where you can only build commercial and that's the commercial spine along 34Th, Street and 33Rd street. So I think you're asking for something that already exists. We should probably go back to a little more research on that yeah. I appreciate that we will I'd like to talk to you about it directly, joe because okay, thanks Paul thanks Joe, just to think historically, even when the city's been in bad times, we went through this in 2008 2009 we've tended to always still list the priorities, because if you do not then you're sort of starting over again with the city the next year, it's always good to keep them in the pipeline. You know they're going to say no, and you know, there's no money, but you keep it there until it gets funded in theory, so Bob. What do you? What you're saying, if there's new priorities or new things that are on, we should list them as low priority, but we should start having them on record yeah, put them on record. Thank you, so yeah, okay, thank you very much and the only other one we had was on capo on sorry on expensive defense budget was the study, the impact of not requiring commercial gyms to obtain a special permit for physical culture establishments. Okay, there's always a split no annuals committees over that. But do you mean that's when there were commercial gyms right, yeah, okay, so thanks Bob, we'll see you soon, yeah, I'm here till 7:30.. Okay, I'm going to ask the slaughterhouse crew. Has everybody put their name in? Yes, they have great. Thank you you're way ahead of me, so I want to welcome everybody from the from everybody, from ransom and from Fox and Fowl and John or Lauren who's going to leave us off in this discussion. Introduce yourselves welcome back and who wants to who wants to take it? Thank you very much for inviting us. I see our presentation is already up. Is this? Is this being controlled by Community board 4 by it's not being controlled by me? I think so yeah. I think I'm controlling it, so you can just let me know when to switch the slides. Okay, I mean okay, fine sure, so thank you very much again for inviting us. My name is Jonathan Butler, I'm with rads and development, we're the co- developer of 11Th avenue. What I would like to do this evening is present a brief overview of the project. I know a lot of you. Members are familiar with the project, but for those of you that are not or need a refresher, we will go ahead and do that and then the reason why we're presenting is an ask for three things: one we would like to share. You share the most updated design with you. As last time, we met Community. Board 4 had a few comments. We believe we've successfully incorporated them so want to briefly run through the design again share with you, any updates we've made and hopefully there to your satisfaction. The second action we would like to take is that we are subject to the preliminary approval by the Public design commission, because this site in question is a site that will be in ownership by the city and then will indeed be needed to the developer entity. In doing so, we will need a letter from the Community Board stating that the project has been presented to you generally. This is done through euler. However, we are coming to you prior to euler, so rather than a resolution being passed by the Community board during the technical euler process, a letter would be sufficient. It could be addressed to the city to the public Design commission directly us as long as it mentions the Public Design Commission, and that you're, aware of the current design in its current form, are accepted of it or have other comments. That was. That would be our second ask, and the third reason we are meeting today is we'd like to go through the public Plaza on 39th street, which is directly south to the site prior to meeting. We have not shared any designs. We are now at a point where we are ready to do so. This part of the site is not under city ownership. It's under state ownership through the empire State Development corporation, so it is being taken through a different action than euler. It has been, it is going through the DOT revocable consent. Therefore, we believe that the public design commission would not have any overview of this site because it's state land on city, land and pdc is a city agency. Nevertheless, this is our first intro to the design of that public space, and we would like your input so just to be clear if there are comments to be shared with us. Based upon that design and presentation, we asked that not be included in the letter to pdc only comments and questions that really address the developer site. So with that I'd like to move on to the s. Okay, so again, I know a number of you are familiar with this site, but just for addressing this site to the public and to any members unfamiliar with the site, we are proposing a two- tower design coming out of a five- story base you are oriented to the southeast of the site. Looking northwest directly to the south is going to be the hotel tower and to the north is the residential tower. The residential tower will consist of 350, affordable units. There's no market rate component to this all units will be affordable and of those 350 units up to 100 units will be supportive on the base. We are proposing a office space, that's on the second third, well, third, fourth and fifth floor, and also a supermarket. That would be located on the ground floor and in the basement. Okay, this is our current time frame that we were working with. We are currently within the Eis review. We are active in working with DOT and DEP. We wish progress would be quicker. However, with everything going on, we are confident that we will be able to reach a euler certification by May of next year. With your help and the borough president's help, we will have a ulip approval by December of that year and that will put us in a position to close on the on the project in quarter two of the following year and started construction immediately after so with that. If there's no other questions I'd like to hand the presentation off to Fx and Dan Kaplan to update you on the design great. Thank you. Thanks, John and good Evening committee members, Jd and Party I'll just go through a sort of recap of sort of how we got to where we are just in terms of precedence and so forth and looking at the at the surrounding area and then really show you some latest developments and some changes that we've made in response to your input and others. When we first got engaged in the project, I guess about six eight months ago we were really encouraged to look at the the context and of Hell's kitchen and not of Hudson yards and to make this a hell's kitchen building and if we can go to the or and yeah. Thank you perfect. I think thank you janine, and you know something that was more rooted in the context. Something had some texture. Some materiality you know was also from our point of view, not a Hudson yards building. In that we want. You know we did not want to do an all glass building from an energy responsibility, point of view and we're really limiting ourselves to something like 35 glass here. So we looked at the context and there's some beautiful buildings here. There's texture there's materiality, but none of them are high rises really, so we looked at other. If you go to the we looked at other buildings, and I should say that the hell's kitchen, really it's sort of the west 30s context- is really sort of a almost like an industrial deco context. When you really peel off everything- and so we looked at other taller buildings that were of that same ilk, including the ones in your community board, with the Ralph Walker Tower on the right and like the materiality like the profile, the triangular profile, like the verticality, the craft- and we also frankly like looked at the empire state. It was about the same time and if you take off the top and bottom of the United of the empire state, it's really a very straightforward building. So we barbed the materiality of a sort of limestone, color, pewter spandrels and look towards the sort of red window frames there, which basically serve to warm up the building. So with that basic background, then we started going to work on our building. If you go to the please Jenny next one after that too, so these are building blocks and I'll then work out to sort of the rendering of the two buildings together. So the first thing we did it. If you look at this slide in to the right, there's a sort of three- story, high frame and so the limestone frame, the pewter spandrels, which are the horizontals between the building windows, the sort of the reddish window frame and then we've added an accent, brick, which is sort of a gray, rust, color, glazed, brick that acts as an accent, and so this sort of cladding, if you go to the, is really about the outsides of the building that face outward. This is the hotel module. If you go to the it's, the residential module, which is three stories tall, which shows a sort of texture and shadow of the building again the same the same palette of limestone and pewter colored, precast, spandrels and vertical accent, brick red window frames, then, if you go to the really the other flavor we're dealing with, is the part where the buildings face them face each other, and we looked at those triangular piers in the Ralph Walker building and we looked at, we decided like if we did a glaze brick pier with these angles. That would really serve to create a lot of verticality and also create some shading and shadowing. We also, if you look at those sort of triangular forms in the middle, that we call them bird's mouths or cuts they're little medallions that add a little scale to the building. So if you go to the as we work our way out- and you see so almost these two are like this image and the images a couple before I almost feel like are like fabric swatches, and now you really see how it they look and if you go to the you see how it and the one after that you see how it is deployed over the entire building, where the limestone colored Precast is outside faces as the building steps back and tears back up and that the darker more warm rust, gray, color verticals are in the middle facing each other. And if you go to the please a little closer in, you can see how the two systems interact with each other. With the lighter outer shell, we call it sort of facing outward and then the the inner feeling sort of cresting up and creating the sort of art deco reference tops and then in between our are just a sort of a reveal of horizontal glass. So if you go to the it shows, views on the left is from 40th street and 10th. Looking west, you see the the hotel on the left, with its glassier base and slowly transitioning to more solid top and then the residential building on the right. One of the changes we've made is we and you'll see this in a bit? Is we've moved the residential entrance to the corner, the so that and also added more solidity to the base of the corner, so that you know, based on input from some of you all and just general, that you know that you, when you walk into that residential building, you feel like you're walking into a residential building and not into a glass box or anything like that, and the gap in between the two buildings would be the commercial entrance to the to the market. The center slide is looking southward on 11Th, Avenue and 43rd, and you see that the residential building is a very classic form that steps up and the top are those sort of fingers of the verticals coming up and then on. The right is from the park looking east over the new Javits expansion and there you can see how some of those medallions really create a little bit of a playful pattern on the building. Next, one of the things we wanted to bring to your attention was, as we've developed the design it it's really more or less stayed at the same heights of the residential's gotten slightly lower and the hotel's gotten slightly larger. This is not due to floor area changes. It's really due to Florida floor height modifications, but we're really dealing more with more of them equal tower heights. At this point, we just wanted to make sure that was that was clear. So so we want to know, I want to go into the base where the building really meets the ground, and so next. So this is a corner of 11th and 40th. What we've done here is created more solidity to the base and because this is the base of the residential building, so there there's no two- story. High expression every floor has a has a limestone colored spandrel we've also brought down that glazed brick highlight more and you can see the red frame of the of the windows and at the bottom, is the residential entrance. We'll show you in a zoom in a moment of that, but what we thought was nice about this is that again, it's separated from the glassier more, let's say commercial feeling base of the of the hotel. It's at the corner, which is very convenient. It adds some life to that corner and it's actually, the doors are facing 11th, but the but the. But the lobby really occupies the corner and has its own canopy the piece in between we, which was glassier the last time you saw an iteration of this we've toned down and, like I said we I think we made it appropriate to its commercial character by making it the entrance to the supermarket. Go to the this really shows the various entrances working from the right. The police garage entrance, which goes into a ramp into the middle of the building, the loading dock for the building next to it, the police parking and it's another roll down door, the residential entrance at the corner and then moving to left the retail entrance and the hotel entrance facing 11th. If the shows a zoom of the of the residential entrance- and I think you could see the materials coming together here- you know it's still we're still developing things, but I think it it's feeling more detailed at this point. So working from the center of the slide is the residential entrance with. We thought that if we take the same sort of rust, color of the window frames and make that the canopy so that there's weather protection at the residential entrance and then the sort of limestone colored precast frames with it with their detail and the brick glazed brick highlights coming down again. So it's less glass, more texture! That's really comes down to the ground. If you go to the that sort of contrasts this with now. This is south looking north, the sort of hummingbird view, we call it overlooking the the hotel entrance and the hotel base. You can see even on the hotel side, we're bringing down that that brick pattern, but it's a little glassier, it's a little more commercial feeling which I think is appropriate to its use and it separates it from the residential feeling to the north please. So this is now looking at the building from 39th and 11th you're looking north West, and you can see that the okay, the residential engine, is far to the right and then really what this is. Really the the hotel base multiple entrances on 11th. There will be a restaurant entrance at the corner facing 11th and then windows that go along the side that go down to the left on the screen adjacent to the public space. The last thing I want to say about this and we'll turn before. I turn it over to star White House on in terms of development of the of that public space, which you sort of excuse me in sketch form on the left right behind the white car. Is that one of the things we've done to the base here is as it moves up at each floor or each tier, it gets progressively more solid, so it's a little glassier down below and by the time it gets up to the tower. It's a gradual transition to that 35 class. I think it makes Sen. I know they're two distinct parts, the building and the open space. I guess it makes sense to run through the whole thing and then go back unless Jay do you feel differently? Okay, so hi? So, okay, so the is just again, it's really saying: what's what and I think I've already described it so I'm going to turn it over to our collaborators at Star, White House, as John said, you know, this is really the initial first pass at the design of the public, Plaza and they're, going to take you through some of the thinking and constraints and initial diagrams so who from Star White House is doing this. This audio is not very good. It's very helium yeah! We can't hear you really. Would you by chance have a pair of headphones available with a microphone? Maybe yeah, if not yep yeah, if not I'll, give him a minute. If not I'll, I will do my best to play Steven whitehouse, but to everybody watching on YouTube. The atmosphere has not changed. I'm going to have to switch this out. I believe you want me to start Steve. I can start yeah. Why do not you do that? Why do not you go ahead because your audience is perfect yeah, and I think that if you go to the first slide, we can we can start, and I think that Jonathan introduced a lot of this already, but just understanding the the site considerations based on the various ownerships that are involved surrounding the site, so one being that the plaza is part of a Map street and then subject to the New York City D.O.T revocable consent. So there are some design items that are following those design requirements. The land, just south of the plaza, is owned by New York state and operates out of a port authority easement next to the vent tunnel, which we'll talk about the plaza is intended to be a public private partnership to be maintained by Radson, and we want to also provide a safe entry to the Javits center, as well as a space adjacent to the hotel and restaurant, and we also are going to respect the existing infrastructure. That's on site. So if you want to go to the so just taking a look at the site context and where we are and understanding the pedestrian and local, the local pedestrian circulation. So these are just two spots, one along 39th street, where this, where our plaza site is located. Looking down 39th street towards the site, there is a lot of bus queuing that occurs there so taking that into account with the design of the plaza and as you can see, 39th and 11th on the corner, this large masonry wall and just understanding that that's these are the areas across the street and down 39th street. You can go to the so also understanding the future of this area and the Hudson boulevard park. So it's our understanding that the the area up to 39th street will be an upgrade park that is currently in design and anticipated within the next five years or so to be opened and then potentially in the future, this land bridge that would go over up and over the tunnel entrances, but for now also assuming that or for now, under the assumption. In terms of our design that between 38th and 39th street, there will be this public park that will have a connection with this local plaza here, the next one. Okay. So taking a look at the surrounding bike lanes and proposed bike lanes. So obviously we have the large Hudson river greenway over on 12th avenue. There is proposed new bike lanes going along 39th, Street and 38th street in either direction, and then bike lanes along 11Th, Avenue and 10Th Avenue. So it really there is this large bike connection in along the site. You go to the next one, so just understanding the future connectivity of this area, taking a look at sort of all of those factors. The bike lanes that we've discussed and the pedestrian circulation coming from Hudson, Boulevard, Park and street connections via crosswalks across the north side and south side of 39th street, as well as crossing across 38th street, and going up towards along the vent structure and running to the plaza the next one. So we took a look at the health kitchen, Hudson yard bid design guidelines and are using that as a basis for our design, understanding the different geometries within this area between Hudson park and the high line, and there is this sort of organic geometry and some harder lines with the high line nearby and understanding that as part of the design go to the next one understanding the materials in the guidelines. So this is from again from the big guidelines it seems like and looking at the Hudson boulevard park. There's this mix of just standard D.O.T concrete. Also, this granite cobble that you can see there a mix of wood and stainless steel for furniture and then also this pop of the sea green movable furniture there that we're trying to incorporate all of these elements into the design to create this cohesive vocabulary of materials in the area. Kristin keep going, but do I sound like I'm on helium now, yep, you're, good? Okay, that's better switch computers, okay, Steven White, House Sign, though okay, that does much better. Okay, you can go to the next one, taking a look at the different future potential for plants all of these different plants, both ornamental some evergreen plants they can handle both shade and sun, so that those would be picked specifically for the for the site conditions that we have there. You can go to the next one, and these are some of the furnitures that have been laid out in the bid guidelines using these metal planters and again this wooden metal and metal benches and, following that sort of see green pop of color, that seems to be throughout the big guidelines. So these are all just pieces that we've taken out of the guidelines that we hope to integrate into the design. To, like, I said, create that vocabulary within the area go to the Steve. Do you want to jump in at all yeah I'll jump in now, and what we're looking at is a map of what would be maps 39th street owned by the state going through the gray area would be the revocable consent area directly attributable to us, and we have this unusual arrangement of utilities there, because they were all moved to the south side when the Lincoln Tunnel was built, so that sewer line, which is usually right on the center line of the streets right next to the vent structure. So this is our sort of pallet. If you will it's a space that goes building the building, but our revocable consent proper, is only to the middle of the street and we've sort of dealt with that looking around. That is the plan. On the left- hand, side of the javits of how it is the expansion is laid out. The Orange arrow is the planned employee entrance to the javits. So that would expect to get regular daily traffic whenever there's a show or setting up or breaking down and the other to the best of our knowledge. The darker maroon arrows are all emergency egress. There is an easement around the port authority, vent structure. That requires it to be clear and there will also, of course, be fire egress out of the jabbets around there. So if we go to the next, and but within this space we wanted and within the rules of the revocable consent, which is its own sort of rules, we wanted to create a sequence of experiences. There's a 10 foot setback from the property line required, but the notion there's an entry there that it's more involved with being right in off the street, catching your breath sitting down, there's a little dashed lines across the center line. The notion is that those would be a CitiBike, not CitiBike. Excuse me, the D.O.T bike racks, the city racks that could be used by visitors and also employees going to the Javits sort of central zone. That is intended to be more social with movable tables and chairs, and then this box with these are raised planters and some larger plant material. They revocable consent requires there to be this clear path that goes through it. We wanted to make it both experiential. We also wanted to make it feel very public. It's not up against the building. It's not way out away from the building. It splits, this public space and sort of makes both sides of the public space feel public, and the other thing, quite honestly, in terms of the design that we have to deal with, is the revolt or the vocal consent. Being revocable means that the stuff there has to be able to be removed. So we can't really plant a lot of things in the ground, we're limited to what we can put in a permanent way, and so that's why we're building it up with planters and furniture and trying to make a sense of space going through there. If we go to the which is more of a rendering of what we're doing there and we're showing just two materials right now right out of the Hudson yards, Hell's Kitchen bid book the notion that there is a granite paper which is sort of that biomorphic shape and a standard concrete. Are there two standard materials, some of the you'll, see them in Bella Abzug park in the same sort of a way, and you will notice here that we are showing or suggesting the notion of extending pavement not obstructed, but extending a special pavement and a feeling of a place across the revocable consent line. This would be have to involve the consent and agreement of adjacent property owners which we've not yet begun, but to make it feel like a bigger space than just this sort of half of the street next to the building and to make it feel inviting we thought was an important thing to explore. So we have the raised planters, these granite pavers bench seating. There are windows that open up from a retail space in the building. It's intended to be a restaurant, but this is not being shown here as restaurant seating. This is being shown as a public place from one end to the other that culminates at one from the street and with a regular traffic we expect going to and from the Javits employee entrance, even in addition to members of the public and passing tourists and javits visitors and everyone else who may be wanting to use this space as a respite next, so this in essence trims it back to what is the exact dimensions of the revocable consent? We're being asked to work with, as I said before, if we can work it out with the adjacent property owners we'd like to extend the feel of it, but if we do not at this point, this is how this particular approach and design would play out and that's what we brought you today for the plaza interested to see initial thoughts about what you think is desirable in this neighborhood and whether or not we are providing it or what other thoughts you may have- and I think that is our last slide in the presentation- is not that Right Dan and Jonathan. So turning it back. I guess thank you, the committee, thank you for presenting, so at this time, we'll leave it up to the Community board for any questions comments you may have: okay, janine can janine there, we go John, Thanks and Kristen and Stefan. That's a very thorough, well thought out concept and Dan Kaplan. Thank you for the aesthetics of the design. It's always a pleasure, it's like being in class and learning all that stuff. Thank you for that. I'm sure we're going to have a lot of questions go. First delores hi, I just wanted to say I had expected to have fatigue from this project. We have been trying to get this going and I was very pleasantly surprised. I thought the redesign really responded well to the last meeting. We had and guess what that was, the last community board meeting we had in person pre- code. It was March. I do not know what was it like? 13Th, oh, that we had that meeting, and I think that in such a short time, you've really responded to the comments from this board. But, more importantly, I think the design itself is so thoughtful of just what is already here and distinguishing itself from Hudson yards, and I always also very encouraged by the ideas that you're bringing together for those public spaces and those connecting spaces and thinking very forward of what our community would look like five years from now, as we redesign a lot of this part of the city. So thank you for that and I appreciate so much that I was so surprised that I'm actually excited about what you displayed on the screen. So thank you for that work, but I will say, however, the most important part of this project for me has always been about the amount of affordable housing that we have been able to put into the project and, as since those those items have not changed, I can't see anything at all that I can complain about at this time. So thank you so much for the presentation, thanks dolores there's, still time to complain later, when I'm sure they're going to be comments, just raise your hand, so I can see you Joe, yes, so Dan and the team. Thank you so much. You really responded to our specific design, questions and moving that lobby. I think made a huge difference. You've anchored the building better, bringing the brick down everything is. I have only one comment on design: how about that right? I'm ears! Okay, so could you please put up on the screen janine the straight on shot of the building of the elevation. Sorry give me one second, but I mean you've really moved this so dramatically ahead. Thank you. So much guys, I think, you're looking for slide, I think it's slides. 18. that one yeah that one okay, so the thing here is, you still have the building floating in the residential tower on the southern corner, where it changes from the limestone color to the brick, and that also, I believe, is set back I'm not quite. I could not quite see from the rendering. I think it is right a little bit about five six feet. Yes right, so that's the only thing I think that makes this look odd, because it's a very tall, skinny building and then it seems to float the other side hotel steps up. It's a normal thing. This is a very sort of like of the and Dan. I know I always say this to you. It's of the moment. I'd rather be less of the moment and be durable for a long period of time, so become Jd's iconic thing that he hates to talk about right, just figuring out a way to get this anchored down somehow. So it does not feel like this big white, 50 stories or 40 stories is floating above this solid brown, brick. Any thoughts on that. Well, you know thank you. We we've been looking at it and it's something you know. I know you were you've raised it before too so I'll just tell you why we did it and there's also one on the West side as well, if you notice, so we really see these two buildings as like, as if they were once one and then pulled apart, and I know what you did and I think- and it really I think, there's something nice about bringing down the inner filling of that glazed brick down to the ground in the in the way we've done and the other thing about the corner. You know the it is recessed and part of what we've been trying to do with these recesses is, as you pointed out, in other words, that the darker area is that we're bringing more light into the courtyard and the views so that that's one of the reasons. Those are those undercuts. You know we can further study in terms of coloration and so forth like that, but I think the stepping of the plan is really what's the prime driver, I'm less concerned about the stepping on the southern tower. It's the that being the residential and you're, really sort of doing bluntly a little bit of a gimmick, so it looks like something and it just makes the top portion float when you live there. You do not want to float so I'm going to ask you to look at it, because I am, I feel very strongly about this element here of somehow. Maybe you bring just a corner section of the brown brick out to anchor it down something, so it does not read that it's just it's very much of this content. This is all over west Chelsea. You know you. Can you go back to two slides? I think it's two slides yeah, so I mean that gives you a sense of the dimension of it right. So we have you know, as we've developed, that it used to be much glassier, and I think you can see the area and I do not have a. I can't use my pointer here, but the area right under the undercut is now that same vertical brick and it I do not know it seems to anchor it a little bit more in three dimensions than it did before, like I said, we'll take it under advisement and we'll see what we, how if we can just look at the corner, yeah all right I'll, speak later about the open space when you're ready for that great- and I do agree with you- the moving of the of the lobby makes just a ton of sense. I think it's better for everything for the okay, thanks joe we're going to go in order, I think Dale was first and David Solnick, then Chris and then Brian so Dale. Take it away thanks. I have a few questions about the presentation going back to the first block that had like the Axon metric that had the what was residential and what was hotel and the and the how the base was broken out in terms of commercial space. I did not see any place where the the program space for the supporting housing was located. Should it be on that diagram? Where is it the supportive housing is in the residential tower and it's accessed from the same lobby and it's yeah it's in the base of the residential tower the base, but the lower the lower? I'm sorry just to be clear, it's a lower. I do not remember how many like 15 or so floors of the of the residential tower. Why is it separate wait? Can I just follow this through so that you're speaking about the units themselves, I'm wondering about the program space like the support functions of the supportive housing, whether it's like common rooms or employee offices, or what have you there will be a supportive housing office located within that tower. We have our servicer in place, cucs who's used to managing this scale and has gone into some neighborhoods that have some some different markets and affordability, and I think they're well equipped to do this, but there will be on- site services they'll, be inside the residential tower among the interdispersed, supportive housing units. Okay, so it'll be on one of the residential floors. Yes, right now, right now, it's planned for the fifth or sixth floor gotcha, okay, thanks and then I have to say I like the vocabulary that you developed that you pulled from archetypal buildings in our neighborhood and beyond. I like the way you applied it to the a project of this scale. I happen to disagree with Joe that I think that the massing scheme that you've developed is quite modern and works well, within the context of these more traditional building type of building materials. I was saying you know I was whispering in somebody's ear at the last meeting in March, like look at the twin towers along the upper West side, and I think you've done something more contemporary and different, which is to consider them the mass and the void you know joint, like I almost feel like you did not design two towers. You divine designed a void in between two towers, and I appreciate that as an as a somebody with you know a little education and architecture. So there's that I also had a question about the plaza. I appreciate the constraints. The design constraints of that Plaza is that Plaza grated it at all, or is it relatively flat right now there the drains in the existing street rather unusually, are right down the center line, so at least our initial intention, this is before talking to DOT or anyone else on a technical level is that it will be graded, very gracefully and gradually from the building face out to that center line and sheet drain to the middle of the road gotcha. That's the concept right now. I also like the relocated where the lobby wound up. I think it is. It works better. My final question is about the roof treatment. You said that there were. Could you I think I missed what you were describing for the bulkheads? I mean I like them, but I do not know what I'm looking at exactly a kind of like a series of pointed elements at the bulkheads yeah. So we are, you know in our developing the design right now, but if you recall- and maybe you could pull up that same slide, we were just that perspective. We were just looking at janine, but basically the we're talking about a and the next one, please, I think, is the zoom in yeah, so we're basically the center port. What you call the void part of which I like of the building, is these vertical glazed piers and when they get to the top we're sort of shaving them off at an angle almost like thinking about like oh, I see yeah, they create these sort of v shapes we're developing that now, just you know, change the terminate the building create a little light and shadow create a little. You know termination. But again it's you know we're just working on those that level of detail now, but that's something the that's the direction we're heading I like I mean I know how hard it is to resolve a rooftop in New York in the New York City landscape. I, like it it's kind of spiky, it's kind of punky, yeah and just in between will be just you know. Just so you know it's really a louver screen in between those piers for mechanical and things like that, so it it'll feel very curious. So there's the cast stone, spikes and behind it a screen like okay. There you go thanks for that clarification, you're on mute jd. Thank you, Dale David, Solnick you're on me, too yeah yeah. I had two questions, although I think you've satisfied one of them more or less. Could you go to that slide? 18, which is the first, I think was the first slide you showed in the first question. Is that 18 not yet there yeah? Okay, so I mean actually. My comment was about again about the top looking at the left one, but I, but I think I understand it better. So I'm looking at the left image those spikes, if you want to call them that grow very naturally out of out of the one vocabulary, but they look like they're glued on the right tower, but I think I now understand that they're not they're, not extending from that more limestone material they're extending from the other vocabulary, but behind is that you hit the nail on the head. Yes, if you look at the image on the far right, you know the tower on the left is the residential and you see that there's a setback between the main, like center volume of the building and to the left, the limestone volume which is lower and then it. The thing is: if you go to the one in the middle, the image on the middle that you do not you, it's like. I think it's like a 10-foot setback, you're, not reading that 10-foot setback, because it's collapsed right. Okay, yeah, but it's a real change in plane. There I do not quite is quite as flat as this drawing yeah I mean. I think I think. Overall I mean I do have one other question which was about the plaza, but I think overall, it's you know much improved from what we saw in March yeah, I mean dramatically the one thing about the plaza was I did not. I did not really get any feeling for the plaza to tell you the truth. I mean we saw a plan. We saw, you know some furniture in there and but yeah I mean I'm an architect. I can take a plan and visualize, but I'm not I'm not getting any reading on this because you know is there: is there anything from the ground? You know that shows the context, there's obviously not only the context of your building but the tower across the the vent across the street, which is pretty dominant in that in that space as well. So you know really nice. I think the answer. The quick answer is that we have not developed those ground level views yet in time for this presentation, so we're starting with plan. And, yes, we will be studying its relationship to the total volumetric space and to the facade of the building as well. So will we see that David we still got to go through euler, so we'll we're going to have another crack at this multiple cracks. I want to add that Plaza is not subject to the euler. I do not think right. Somebody else want to clarify that. It's not correct this is this plaza is part of a DOT revocable consent, so it sits in the bed of a street that is under jurisdiction by the state. So our process, right now, is that we're still discussing with esd regarding even planning this this space. We also have the southern portion of the street bed, which would not be in our scope to design. We would hope that there would be some coordination in terms of treatment that would be coordinated with that, so it would feel like one plaza, although there is emergency access, egress, etc, related to the port authority there. So what we really want to do, I think, in this presentation, is share sort of our first thoughts around programming this space, if we're, if we're lucky, to do so with esd, because otherwise it would be pretty much a driveway, a pretty poorly no program space. So it's under it's been our interest that it's programmed and programmed well, which is why we want to take on management of this public space. You know I want to just share any sort of thoughts and concerns that the community may have with us so that we as we advance our drawings. We can take that into consideration. We understand that there's going to be a variety of type of uses for this space and, as Kristen mentioned, there's going to be javits employees coming through here, but it's also going to be used by many tourists, many people who are visiting New, York City for the first time, staying at the hotel, visiting the Javits, Center, etc. So we want to be cognizant of these two types of uses and make sure it's planned accordingly, thanks John, thank you David. Are you any more questions? No, that's it. I mean. I do hope that we can do that. Again, I mean, even if we're not officially part of the you know, approval process that it's obviously an important element, a very important element to the community, absolutely David. Thank you, Chris, Lebron evening, everyone thank you Jd, so I actually wanted to bring up what was going on with the pov in terms of on ground, with the plaza. So thank you for clarifying that lauren that there's multiple stakeholders involved. There was a mention of a change in design for increased air and light. Have you been able to do any like simulated computerized study on a 365 like light study, to show any significant change increases in life for that neutral area and then other than that? I just want to say thank you for doing this presentation and dolores. I think we met March 11Th March 13th was a Friday thanks, Chris Yep Brian Webber. Are you there, brian? Yes, I am okay, you're up pal okay, I have to say the last meeting March 11th. Thank you. Chris was the last time I was with a large group in public. I am so pleasantly surprised by where this design has come. Since then. I really think it's in a much different place and I'm very excited about it. I had two questions. I think a lot of them have been answered in previous questions, but the two that I have are about the surface materials, the glazed brick and the window frame color. Is that window frame color more of a rust color like a quart and steel or is it a is a bright red and what is the color of the glazed brick and is the hope that the glazed brick would pick up reflections of light throughout the day and give that sort of sheen that you would have in some of the older deco buildings? That's question design question one and the other question is the void between the two buildings. What is on that? Is there any programming on the horizontal section or the landing? Is there an outdoor area there between the two buildings, or is that just mechanical and roof? So well, thanks for your comment, so the first, the materiality, the the yes, the glazed brick, we are we're getting samples. Now it's a we're in that stage where we're gathering this really specific samples. As you can imagine, it's a little bit difficult with a with the everybody dispersed, but we're doing that and the idea is exactly, as you say, is to create something that has a sheen to it. That does change during the day. What we are looking to do is get something that has a sort of combination of Charcoal, gray and sort of warm rust color. So it has a little bit of warmth to it. It's not cold, it's more warm, but you know we are again that that's the intent trying to find a brick that does that is harder. So what we're in the process of that in terms of the window frames, the idea is to be subtle, like subtly red, not in your face red, it's hard to render these things. But right, I think if you look at the empire state building, not many people, think oh, that has red windows, but there's this under lying warmth that comes through and then finally, in terms of the rooftop. So in between the two buildings, you know we are working out the programmatic issues now, but there's there's a volume there, that's a common space. Well, it's like amenity space for the for the hotel and a hotel ballroom outside of the footprint of the two towers. There may be some open space adjacent to it, but on the roof of that ballroom, what we're proposing is a is just a really like a passive green roof. So look down on it. It's green we've done some perspectives and other things, and it just seems it seems like there's other outdoor places. That would be more comfortable to be in. So thank you for greening it yeah. Absolutely we would do it, but I will also say one of the good things about the new raft of codes that have come through is that either you have to have for majority of the roof, either green roof or photovoltaics, and it's a really good thing. It really is thanks. Brian. Thank you. Paul Devlin, unmute Paul. There you go. Thank you. This looks like great development and thank you for the presentation. This is my first time seeing it so this likely came up in a previous presentation, but I want I did not hear anything about it today and knowing that Joe and Dale are on this committee, I'm sure it was raised, but on the presentation you had a loading dock of one door between the police station and the police parking lot and one loading dock door does not seem like it'd, be sufficient to provide access for trash removal, pickup for Ups deliveries for fedex deliveries for all of those systems that we now try to get off of the streets and sidewalks in any new development. So what sort of structures exist internally to support trash and deliveries for both buildings? Great thanks, I believe that the okay so the door, it showed one door, but it was a double wide door and it I believe it has frontage for two births. If I'm not mistaken, we can as test yes, so we've basically met the code minimum for the for the hotel, and you know the residential have obviously trashy trash, compactor and so forth. So so there it's not one, but it's two. It's two births with one door: yeah, okay to code does not necessarily you know, make me feel happy, but Joe, I'm sure that you have kind of a warrant of passageways in the ground floor of the cellar that we went through on these other plans. It's really pretty expensive, okay yeah it was. It was not presented well here, and it was only one door for two buildings, so I just want to make sure both buildings have access to adequate systems to get this stuff off of the streets and sidewalks we're happy to share more those plans again with you and your team. But yes, there is access to the hotel through a series of tunnels and yes, well. Meeting code is not would not be the overall goal. The challenge here is that we have a multitude of programs and only two sides of the site to play with in terms of accessing those programs. So to the north, we have the loading dock and we have the parking entrances for the to accommodate the NYPD. So when we've had to have long drawn out conversations with D.O.T and even limiting those curb cuts there and then, of course, we have all the pedestrian access to the co- working space, the residential entrance, the supermarket and the hotel entrance. So it does not give us too much latitude to create more loading dock as we would have liked, but but we're confident that this will be satisfactory. So just the point of clarification, the tunnels are vehicular tunnels underneath are they pedestrian tunnels? It's basically a passageway in the in the seller, the base, so that so the hotel, supermarket and housing towers are all have two loading docks that then unload and pedestrians carry goods between the buildings. Underneath yes like they're, yes, that's correct right: no, it's not people Paul, they can load and they can move stuff through the building through various passageways. It's not like they're carrying something I mean these are very large passageways and packages, so forklifts and pallets of stuff, but not trucks. Moving through, you have room for two trucks for a supermarket, a housing tower and a hotel tower two berths to provide access to goods for all of that for both delivery and removal of trash. It does not sound like it's adequate to me, but I'll look forward to reviewing the plans and we can continue the conversation. The site is 125 foot deep, 200 feet wide, but only access on 11th and on 40th no accidents by 39. so and we have our constraints of the police whole operation on top of it so we're there, this site is so ridiculously encumbered. You can trust me. They have squeezed every single possible use here to make it work. It is unbelievable. The sort of layering that's been done in this project so far and we've given them hell about it. So I again I apologize it's my first time seeing it and knowing that Joe and Dale are on this and reviewing it. I'm sure that I'm going to be the least vocal in those issues than them thanks, Paul Dale. Thank you. I think you had another question. Dale awesome! Sorry! No! I I'm good. It was it got answered. Thank you. Thank you. Thank you. David Stolnick yeah. I mean it's a follow- up to the other one I mean we're not going to see piles of trash bags of trash on the on the sidewalks is right. Is that is that correct? And how will you answer yes, because the trash will be containerized inside and then removed via these? You know these loading dock via these vehicular access ways. That's right! You typically see this on how towers are operated. Well, there's going to be inside access. So while trash is collected, there'll be an interior section where the trash is then consolidated into larger containers and it'll about be probably situated before it goes out right to when the garbage truck is able to access on West 40Th and pick up the garbage thanks Joe, you had your hand up on the garbage issue. We need to remind to refer you to Manhattan, plaza works. Sanitation has a program for containerized gardens where a different truck comes from very dense, high- rises and we've worked that out with a number of places, including Douglaston, on 29th street. So it's so. You have to program that in to make sure you design for it Dan, because that's how this kind of density of housing will not work, otherwise, so they'll be compacted and we'll look into the containerized approach, one more question on the housing program and then the public plaza all right, Joe hold on I'll get to you, but Leslie had his hand up Leslie yeah. I had a just a quick question for clarification: will there be disburse throughout the building, affordable housing and supportive housing if they're not segregated? In any way? That was my question Joe you want to take that yeah. I mean I am concerned about the way you presented because we have never talked about a non- integrated building. This model has been done successfully throughout our community and throughout the city, and we do not- and I think we're going to say- please return to us in a way that does not say the support of houses on the lower floors and the other affordable housings above it. This is an integrated project throughout and that's what should be presented only and if that's not how it's happened so far. Come back and tell us some okay yeah, you know poor door runs with four floor and integration. So, yes, the project will be integrated. I will say that the unit types for the supportive housing are currently studios and ones yeah, of course. So that means that there may be a common line that the units fall into as the lines will be situated, studios and ones. So they may. There may be some condensing in terms of the line. The way the lines run, obviously we're not going to use two or three bedrooms, but but overall they'll be interdispersed right, but there'll be studios and ones for the other part of the affordable care, so they can be up and down the tower. Yes, so one of the things that you're going to have to prepare coming back when you do euler is like a stacking plan that lists floor by floor, the types of affordable housing. So there's no question, because that is something that's a huge issue in our community yeah, as this will be 100. Affordable projects there'll be a some version of an MIH requirement, so we'll have a stacking chart accordingly. So we have not developed that yet, but we absolutely plan to do so and that will be available prior to any loan. Closing thanks John, I think David you've got a one, more question and then Chris. I think you had a follow- up so David Selnick. Are you there? No I'm! I got it answered: okay, Great Chris Lebron! Thank you again, jd going back to supportive housing studio, one student, one bedroom. I know we talked about in this past, but we have increased population of new Yorkers who are not home what specific programming or who is being identified for the supportive housing. Do we know right now and do we know how many families are in need of supportive housing that would actually necessitate something larger than one bedroom, because in my experience with working for the coalition for the homeless, a big problem is that we only look at studio in one bedroom. When there are single moms out there, single parents out there, families out there, individuals who have suffered from Dv, who necessitate something larger than a one bedroom and oftentimes they get sent out to places like Newark or yonkers. So is there a stomach for a few two bedrooms available, specifically two single family households db victims of that nature, so we we've discussed the type of supportive population we'd be able to include here, unfortunately, the way in order to have the proper staffing to meet the specific services for a supportive housing population. It would be very difficult to have multiple programs, so social workers that specialize in Ev Survivor services versus social workers that specialize in alcohol and drug addiction. Sometimes there's overlap, that's not always the case. So with this strategy, we wanted to do one thing and one thing well and through discussions with CB4 leadership, we were discussing cucs and that they would be adequately able to service those with their mental illness. Alcohol for this project in terms of statistics around the need for social services. It's growing. We all know that we as an affordable housing developer, are doing a number of other projects that are serving other specific needs, including Db survivors. So and then I think the Covid-19 crisis has just exasperated that. I think we're going to see a lot more need if that's even possible in the years to come for supportive housing. So we are aware, but right now we really wanted to focus on a specific service to provide adequate services to those with mental illness out of college drug addiction. Certainly I appreciate that John. I only bring it up because cobit has changed what's going on at home. Additionally, we like services that may require a little bit more hands- on maybe kit glove approach may not be something that we can do in the future. I do not know what the timeline for this project is, but certainly we're looking at social services being approached at in a different way because of Covid-19 as well. So second question there to Social to the social service projects is: has there been any adjustments in your programs? Currently that would make this a post- pandemic or pandemic minded program, friendlier where we are ensuring that these towers are not hot spots clusters in the future yeah. So there's a number of items that we've taken into consideration and that one is with the engineering plumbing making sure that all units are really well ventilated. Looking at a really high degree of air circulation that you might not normally see. In other towers, we are pursuing leed gold for this project, so that would create some high design in terms of air ventilation within the units. Another programming change we made or are considering in light of Covid-19 is just the way people live and work. You know we, I think, even with a vaccine coming and hopefully in the next year or two, I we do not see that the way people lived and worked prior is going to go totally back to normal. To that time we understand that, there's probably going to be less commuting more families, more individuals are going to be working from home at least part time in years to come, and for that reason we looked at our community room space and what we're considering to doing is programming one as a business center. Something like you would might find in a hotel where it looks like a co-. Working space, but it's for residential use, it's equipped with Wi- fi and the normal appliances you might find in a co-, working space, computers, etc. So a tenant of the residential tower could go out there. Use that escape the. I guess. The distractions we'll find at home use the business center to work and then come back to their unit all without leaving the building. So that's another item we looked at and we're continuing to explore how we can best program this in line of code. I appreciate the consciousness and that thank you thanks Chris, I'm a little flabbergasted. I want to say if you think we're going to be locked inside until the end of 2022. When you start construction, let's just make a suicide pact right now I mean we'll get back to being human beings again and by the time this building is open. What is your opening date? Guys 2023 2024 right, so there is a future. Let's remember: Joe Cbd's change and the use of cbds have changed already, and things are being projected for different use and that's what I want to make sure that we understand that as we live on top of each other, we have a future. We do so holistically, that's all Mr Jd. Can I speak to public space all right, joe? Yes, so public space, a couple of things, one is your base. Information is really bad and old. That plan you have is nothing to do with the park. Today. You should get the updated base information. There is no pedestrian bridge flying over 40th Street to 42Nd Street. That's all long gone, pull it out of your documents. It makes you look like you have not done your full research. Second, the question of the revocable consent is quite interesting. You should be in contact with Bob Benfatto from the bid. We recently got permission to plant trees in the middle of a sidewalk on 10th avenue, between 37th and 38th streets, and that is a revocable consent and that was from D.O.T and from parks. So I think, there's a little bit more ability to do something in the ground here, so we have a fuller plaza that gets built. The second part, is you have an easement from the port authority. The easement I doubt is about. It must have some specific language, but, as you know, we work well with the port authority. This has to be into one large 60 foot wide plaza, not a 30 foot a little bit of granite paving, so we should be sitting down and plowing those fields now to make sure this is a nice full, open public space you guys are being so modest and careful seriously. Where are you working on the upper west side? No, this is health kitchen. We can figure this out, and so I think we got to be a lot more ambitious and whatever pushback you're getting. Let us know Lauren George, because- and you know, port authority has a very strict policy about that air vent, but yep there's all kinds of ways to get to where we're going right. Yep because other people want things from this community board for other issues, and one of those agencies is the port Authority of New York and New Jersey. So we should be talking among ourselves on what to do and in the last three years, and then Jd will appreciate this. Always we do have the original cowhead sculptures from the slaughterhouse and we are talking about working one of them into the park, possibly one. So, let's look at into the oh absolute part, so let's look at the possibility of something actually getting put near the site from which it came. That would be a remarkable thing, as opposed to just being a fountain down in Chelsea. So I just put that out to the landscape designers to follow up on and Dan is well aware of this also, I love the cows and the second, your encouragement that we have still have a lot to learn about what specifically these overlapping agencies will. Let us do in the space and they will always start with no right lauren, thanks, Joe and public art cow's head public art just consider it janine. Do we have any callers? Is anybody calling in there is one person I'm going to put them over, so they can speak? Okay. Thank you. Welcome. Can we if you're, muted, unmute, mysterious person tell us who you are so since I made you host you're going to need to transfer them over? If you go on to the participant section and then it's 16 right and then you go to attendees yeah and then there's a phone number that ends in 164 with their hand up. I do not see it. Yes, I do here it is yeah. If you hover over them, there are some options. Okay, nobody has their hand up yeah, which one is it's on the phone Jd first, I know the first one yep hello: they have to press star, six can press star six. So we can hear you yes good evening. It's Craig Lynn from Phk, Block, Association and worldwide plaza. How are you I'm very good identify yourself again, we did not quite hear that sure Greg Lynn from Hk Block, Association and worldwide process. Okay, welcome greg! Thank you. I wanted to say thank you to Dan for this presentation and also for the Clinton health kitchen, land, Use Committee, for hosting this specific meeting and discussion as a 15-year health kitchen resident. I'm excited about this project and appreciate the architecture and some of the mirroring aspects of the american, copper building and some aspects, even the frankieri in here within a mix of modern art and traditional feel, so I'm definitely excited from that perspective. It does mirror some of the other areas within the city and we're merging that, together from what we have. So thank you for that. The second piece is as reiterating what dolores even mentioned earlier in the call as well, is the sheer number of affordable housing that will be available to the community based on this project. So I appreciate that as well, but furthering that specifically, I wanted to go back and revisit some of the questions specifically again on the amount of common spaces and such for the supportive houses, supportive housing, that's being integrated and specifically understanding that we're now in a covered world and the need for inter interior, but also exterior common outdoor spaces. Whether it be you know, roof top plotting, gardens and or other spaces for individuals to congregate within the building facade, but not externally to the surrounding walls, how that is being integrated or what plans might be for that to help those supportive housing, individuals for their rehabilitation and social service suspects and the second question. Well, I have it before I mute as well as you know, is there or is there plans to give priority to families and individuals who are currently living and working within the Hk and Clinton area for these types of availabilities? Thank you. Thank you. Greg good questions. Sure so outdoor space or access to outdoor space is something that we're exploring. There is, as I'm sure you can imagine some constraints, given that the scale and massing that we were given to work with so rooftop access, Et cetera, is something that we can look at. There's, unfortunately, not a lot of terrorist space to play with. So we are a bit limited there, but we are looking at ways to best program interior combat space as well, but a rooftop outdoor space is something that we're hoping to implement into the project, which I think you mentioned something about the top of the ballroom, which would potentially be a perfect space for that yes, yeah, the common area in between the two towers that would be on top of the base right now. That would be a shared program space. I think we are at least going to landscape it. So it is something that's a little better to look at than just mechanical rooftop space, and we are looking to pro to see if we can program that there are some challenges with that, but it's something that we're still exploring while we're in while we're in design the other. The other part of your question is the is, I guess, relates to a community board preference. We will be discussing with the with some of the city agencies in the next couple weeks regarding regulatory agreements etc, and how that would be structured in cases where there's capital funding there's generally a 50 community board preference that would be imposed during lease up. I'm not sure if that would be invoked by the city, but it's something we can certainly look at in terms of navigating our efforts towards lease up to focus to those John. I'm sorry, it's there required is no question. There's a 50! This will be run through the city's. You know lottery system, there's a 50 community board preference, so that is not like a maybe you have to navigate so right, we're just looking to see what kind of teeth would be there on such a preference and making sure that it's being able to be invoked. Okay, I think you're giving everyone an impression that it will not be subject to the standard lottery procedure with a 50 community board preference, and this project will not proceed anywhere in any public discussion without that, so please do not even raise it as a specter of possibility. Okay, thank you. Thanks, Joe, thanks greg for your questions. Thank you Ron. Thank you. Everybody David! You still have your hand up and Chris are you? Do you still have questions? Chris Lebron? Oh I'm good! Thank you! So much! Okay, jd! I think the host lowers the hand. Do not they after somebody asks a question. You can lower your hand too. It's okay! I want to wrap this up. I want to thank everybody John. I just have a question and also Kristen and Stefan. I wish you well in negotiating with all the property owners. I have a question to John. 11Th Avenue is a terrible avenue to cross in that area. I know we keep bringing this up, but that certainly is going to make a big difference. You're still working with D.O.T trying to improve that. Yes, that's right, we are, and recently we've seen some promising plans in the mix regarding crosswalks and access, nothing that would be able to be shared publicly. Yet I mean it is within dot's jurisdiction, but I can tell you that is in the works and that I believe, when we're out of this it'll be improved great thanks, John and Kristen and Stephen Stephan. We certainly, as Joe said, would be happy to try to help out fulfill the bigger dreams about that plaza. So is there any way we can? We can see more iterations of your plans and maybe help you out with port authority. If we you need some muscle, would that be possible John? I think that look we'll try we'll keep pushing and rolling, because we we'd love to see keep working with you. If we can John do you need a letter? I mean we've written about 35 letters. Do you need you just use some of the old ones or do you need a new letter? I love all the letters that you've written us. I really do, but unfortunately, I'm going to ask for at least one more at this time right. That just speaks to that. We presented to you on October 14th and it's specifically for the Public Design Commission's preliminary review under normal times. This would just be part of your resolution that you would do during euler. This is not a normal project, so not normal times, so something that says the effect that we reviewed the design list. Any comments that you may have collectively regarding it, and so that way, we're able to proceed with our preliminary approval and able to move forward with euler thanks John and the letter goes to Pdc yeah. The board's done is before John. We have projects that we look right to ppc all the time. Okay, so dolores. I see your hand I'd like to make a motion, especially considering that the last letter that we wrote was concerned about the lack of community consideration with the design. I my motion is to write a letter specifically saying that the reworked design has responded well to community concerns and needs. I honestly do not think the letter at this time needs to go into all the detail that we normally would. I think that we should be highlighting some of the areas that we have of most concern, which spoke to the programming and ensuring that there's not a poor door and that it still incorporates all of the previous things. We wrote in the 35 letters that we've written over the last few years, but I do think it's important that we memorialize this, because the last letter we wrote was to correct this misnomer that this was not what the community needed. So that's my motive. We should really just put a list of bullets and the changes you made that we all like. So it's clear because Pgc looks in detail hold on. We have a motion to write a letter. We have a second any questions. I do have a question John and we in the letter you do not want a discussion about the public area. The park is that what you said no you're welcome to discuss it yeah as you're aware we're in the just the start of this, and we do hope back to you soon regarding our advancement of the design. Our feeling is that it just would not be appropriate. Considering pdc is a city agency and the part of the plaza is located in an area owned by the state, so we just to make this process if at all, simpler for a complicated project that we just do not feel it would be appropriate for the public, Design Commission to comment on state property, but you're welcome to write the letter. However, you want and share your opinions. I would offer that. Let me write two letters once what about vdc another one, just giving our preliminary response on the open space to the developer? That's all that would be perfect, so Joe, okay. First of all take that as a friendly amendment to my motion jd. So we we are. Writing two letters. Is that my second, the that amendment in that motion for two letters, two letters? Okay, all in favor of Joe, writing two letters. All in favor of us writing two letters right about the project right. Anybody opposed anybody present not eligible again Dan Lauren, Richard, Bass, Kristen, Steven, everybody John! Thank you so much for this presentation. This is just gratifying to be able to work with you all and move this project along. So thank you all so much for coming. Is there any other new business that we need to discuss, or would somebody like a mosh, make a motion to adjourn motion to Adjourn? Do we have a second? Thank you all so much everybody keep well and keep your families well. Thank you. Thank you. Thank you. Do your census! Thank you. Everyone vote.",
            "summary": "They got from development, air ride, sales, there's no money for a design at present and the other continuing support was 705, 10th avenue and the MTA site If anyone wants to add anything to the capital, budget.\nThink everyone's going to say yes for extra funding city budget, I mean it's not going to go anywhere, but you maintain the habit of requesting the number one request for the board that came from us was more funding for building code enforcement at D.O.B and to raise updating the DOB website as a priority.\nWas we after saying all that we want to talk about a way to look at zoning regulations such that waivers, become easy enough that if there's a lot of commercial space that can be used as homes and housing locations, and it violates zoning regulations that there's a mechanism in place for reusing, empty space, particularly in Hell's kitchen and Chelsea, that could be used as something different than currently exists in the zoning regulation.\nBut if housing is not allowed in a particular zone that we allow for that to happen in some way and to do a study as to what needs to be looked at to provide usage for currently empty spaces.\nSecond action we would like to take is that we are subject to the preliminary approval by the Public design commission, because this site in question is a site that will be in ownership by the city and then will indeed be needed to the developer, entity.\nThat would be our second ask, and the third reason we are meeting today is we'd like to go through the public Plaza on 39th street, which is directly south to the site prior to meeting.\nBased upon that design and presentation, we asked that not be included in the letter to pdc only comments and questions that really address the developer, site.\nThe center slide is looking southward on 11Th, Avenue and 43rd, and you see that the residential building is a very classic form that steps up and the top are those sort of fingers of the verticals coming up and then on.\nThe right is from the park looking east over the new Javits expansion and there you can see how some of those medallions really create a little bit of a playful pattern on the building.\nI turn it over to star White House on in terms of development of the of that public space, which you sort of excuse me in sketch form on the left right behind the white car.\nAnd I think that if you go to the first slide, we can, we can start, And I think that Jonathan introduced a lot of this already, but just understanding the the site considerations based on the various ownerships that are involved surrounding the site, so one being that the plaza is part of a Map street and then subject to the New York City D.O.T revocable consent.\nThe land, just south of the plaza, is owned by New York state and operates out of a port authority easement next to the vent tunnel, which we'll talk about the plaza is intended to be a public private partnership to be maintained by Radson, and we want to also provide a safe entry to the Javits center, as well as a space adjacent to the hotel and restaurant, and we also are going to respect the existing infrastructure.\nIt's our understanding that the the area up to 39th street will be an upgrade park that is currently in design and anticipated within the next five years or so to be opened and then potentially in the future, this land bridge that would go over up and over the tunnel entrances, but for now also assuming that or for now, under the assumption.\nIn terms of our design that between 38th and 39th street, there will be this public park that will have a connection with this local plaza here, the next one.\nThe bike lanes that we've discussed and the pedestrian circulation coming from Hudson, Boulevard, Park and street connections via crosswalks across the north side and south side of 39th street, as well as crossing across 38th street, and going up towards along the vent structure and running to the plaza the next one.\nI'll jump in now, and what we're looking at is a map of what would be maps 39th street owned by the state going through the gray area would be the revocable consent area directly attributable to us, and we have this unusual arrangement of utilities there, because they were all moved to the south side when the Lincoln Tunnel was built, so that sewer line, which is usually right on the center line of the streets.\nSo, we can't really plant a lot of things in the ground, we're limited to what we can put in a permanent way, and so that's why we're building it up with planters and furniture and trying to make a sense of space going through there.\nThis would be have to involve the consent and agreement of adjacent property owners which we've not yet begun, but to make it feel like a bigger space than just this sort of half of the street next to the building and to make it feel inviting we thought was an important thing to explore.\nThis is being shown as a public place from one end to the other that culminates at one from the street and with a regular traffic we expect going to and from the Javits employee entrance, even in addition to members of the public and passing tourists and javits visitors and everyone else who may be wanting to use this space as a respite next.\nThink the design itself is so thoughtful of just what is already here and distinguishing itself from Hudson, yards, and I , always also very encouraged by the ideas that you're, bringing together for those public spaces and those connecting spaces and thinking very forward of what our community would look like five years from now, as we redesign a lot of this part of the city.\nGive me one second, but So the thing here is, you still have the building floating in the residential tower on the southern corner, where it changes from the limestone color to the brick, and that also, I believe, is set back I think it is right a little bit about five six feet.\nI have a few questions about the presentation going back to the first block that had like the Axon metric that had the what was residential and what was hotel and the The how the base was broken out in terms of commercial space.\nWe have our servicer in place, cucs who's used to managing this scale and has gone into some neighborhoods that have some some different markets and affordability, and I think they're well equipped to do this, but there will be on-site services they'll, be inside the residential tower among the interdispersed, supportive housing.\nIf you look at the image on the far right, you know, the tower on the left is the residential I mean I.\nYou know that shows the context, there's, obviously not only the context of your building but the tower across the the vent across the street, which is pretty dominant in that in that space, as well.\nWe, understand that there's going to be a variety of type of uses for this space and, as Kristen mentioned, there's going to be javits employees coming through here, but it's also going to be used by many tourists, many people who are visiting New, York City for the first time, staying at the hotel, visiting the Javits, Center, etc.\nThis is my first time seeing it So. This likely came up in a previous presentation, but I want I did not hear anything about it today and knowing that Joe and Dale are on this committee , I'm sure it was raised, but on the presentation you had a loading dock of one door between the police station and the police parking lot and one loading dock door.\nWhen we've had to have long drawn out conversations with D.O.T and even limiting those curb cuts there And then, of course, we have all the pedestrian access to the co, working space, the residential entrance, the supermarket and the hotel entrance.\nYou have to program that in to make sure you design for it Dan, because that's how this kind of density of housing will not work, otherwise, so they'll be compacted and we'll look into the containerized approach, one more question on the housing program and then the public plaza all right, Joe hold on I had a just a quick question for clarification: will there be disburse throughout the building, affordable housing and supportive housing?\nSo one of the things that you're going to have to prepare coming back when you do euler is like a stacking plan that lists floor by floor, the types of affordable, housing.\nWe know right now and do we know how many families are in need of supportive housing that would actually necessitate something larger than one bedroom, because in my experience with working for the coalition for the homeless, a big problem is that we only look at studio in one bedroom.\nWe all know that we as an affordable housing developer, are doing a number of other projects that are serving other specific needs, including Db, survivors.\nI. Think we're going to see a lot more need if that's even possible in the years to come, for supportive, housing.\nMore families, more individuals are going to be working from home at least part time in years to come, and for that reason we looked at our community room space and what we're considering to doing is programming one as a business center.\nIt be you know, roof, top plotting, gardens and or other spaces for individuals to congregate within the building facade, but not externally to the surrounding walls, how that is being integrated or what plans might be for that to help those supportive housing, individuals for their rehabilitation and social service suspects and the second question.\nWe are a bit limited there, but we are looking at ways to best program interior combat space as well, but a rooftop outdoor space is something that we're hoping to implement into the project, which I think you mentioned something about the top of the ballroom, which would potentially be a perfect space for that The common area in between the two towers that would be on top of the base right, now."
        }
    }
}