{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCUR3i_hvk3-3i8vtrPg6v1Q",
            "title": "Transportation Committee",
            "publishDate": "2020-11-11",
            "shortDescription": "",
            "lengthSeconds": "2:54:05"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "b1RzDydQ0hI",
            "fillerWordCount": {
                "uh": 286,
                "um": 399
            },
            "readTimeFullTranscript": "107 min read",
            "readTimeSummary": "15 min read",
            "wordCountFullTranscript": {
                "street": 123,
                "traffic": 80,
                "streets": 55,
                "enforcement": 38,
                "safety": 36,
                "cars": 35,
                "speed": 30,
                "vehicles": 28,
                "end": 27,
                "precinct": 26
            },
            "wordCountSummary": {
                "street": 35,
                "traffic": 27,
                "streets": 22,
                "safety": 15,
                "cars": 11,
                "space": 10,
                "precinct": 7,
                "officers": 6,
                "parking": 6,
                "speed": 6
            },
            "fullTranscript": "Handed camera now, okay, livestream is successful, give it another minute and then I'll start letting the attendees in all right. I'm going to start the start, letting people in oh and I should make. Thank you I. Think yep, everybody hey there hi there hi there hey, doug, hey Andrew, hey Doug. Does it get cold there in Verde Park had a couple of pigeons over my head, I'll have to change the seasonal yeah. This particular area that I am with this verde of course means green right, and so it's changing it's quite lush, but now rats right. That's right! It's good! Maybe it's time! I change my background and Andrew. That's a great faux background of a bedroom. It's almost like you're! Actually in a bedroom. Yes, I'm just kidding it's a living room is how does it work with the phone? Hello? Hey? Why do not we get started? It is 6:32. According to my clock, everyone welcome to Manhattan Community board sevens Transportation committee meeting for November. My name is Howard Yaris, I'm one of the two co-chairs, Andrew Alpert he's the other co-chair and I guess Andrew will take turns going back and forth, but before we get started the task I, like least in the whole evening, is there someone on the committee who'd be willing to do the minutes for the evening. Do not raise your hands at once. Anyone no one's dying to do this. Barbara says yeah Barbara's hand. I do not know whether it was accident or not, but barbie are you willing to do it? I'll do the? Thank you. Thank you so much. You have my undying gratitude. Okay, angela, we'll just take, turns going through the agenda. So the first item up is a conversation about traffic enforcement. The captain and I hope I'm pronouncing this right. Warby from the Nypd's Transportation Bureau Captain Warby, yes good evening also deputy chief Michael Palecki may be on the line. I know he was out in the field, so he may. Chime in the connection, may not be good, so he might be able to hear us and also maybe contribute so captain if I do not see him in the list of people who are in the meeting. But if he could identify himself some way, we'll be glad to promote him and hear from him, and we thank you for coming as well thanks. So much absolutely so, I'll just kind of tell you how I got here, I'm from the transportation bureau, which is located at one police plaza and as the community board is aware of over this past month, we've been having NYPD collaboratives. You know, sessions with the community, and recently we met with many of the residents and community boards of patrol borough, Manhattan north, and we understand- and it's good thing, that there was some questions that the community board raised at some of these listening sessions with the community, where you're able to speak to higher ranking members in the police department. And as you see it was a streamless process. They were able to forward your information right to the transportation bureau which specializes in traffic safety, that's our world and put me in touch with executive members. Obviously, Mr Robbins is here of your community board. So I was very fortunate to speak to this team and I'll. Give you just a quick overview of kind of what the NYPD transportation bureau does in regards to traffic safety, and then we can maybe hear some more of your questions and concerns. So obviously, maybe you guys did not know that the NYPD has a centralized bureau designed just for traffic safety, aka vision, zero, while each precinct such as the 20th precinct and the 24th precinct, have a precinct traffic safety team. We have a centralized team as well that kind of oversees all the vision, zero efforts, all the traffic safety efforts on both the streets and the highways pertaining to parking enforcement, truck enforcement, highway patrol and, of course, your average vehicle and traffic law violations committed on the street. You guys are probably happy to hear that we're in really constant communication, constant collaboration with the patrol borough, each patrol borough headquarters as well as the precincts. We conduct constant follow-up with them. There is constant data sharing. I know that was one of your questions. Was there ever a disconnect? Would the let's say the 20th precinct know what is happening in the 24th precinct because, as we know, certain streets, certain avenues throughout the entire city and they're in every borough, the collision prone locations can do not stop at a precinct border. They continue and it's best when both precincts can address it because, as we know and I think you guys also raise this- that drivers do not just stay in their one zip code, they travel from boroughs from different states. So we look at this as a city-wide, if not a statewide, and we collaborate with a lot of city-wide and state-wide partners to ensure that someone who maybe lives in your area and drives to Brooklyn for work or lives in Brooklyn and drives to your area or vice versa, or any combination of those understands the importance of once. They get behind that wheel. That lives are literally in the balance there they're operating a heavy piece of machinery, and they must be extra careful for bicyclists for pedestrians. We know how many school children and it's it was true before the current pandemic situation, and it's of course very true right now, so I did want to at least let you guys know that your voices were heard. The community's voices, the community board's voices, have been heard at the highest levels of the police department and fortunately we can have this session to just explain a little bit further to you, so I could open it up for any further questions. You may have. Thank you for that introductory passage. Sir, can you tell us our officers dispersed on the basis of need, or is there a predetermined amount that each precinct gets sure, so each precinct will have a traffic safety team and on average the team usually consists of four to five officers and they are deployed at kind of on a data driven approach to where they're needed most and, of course, the sector officers as you're familiar with the response. Auto officers can also assist in traffic safety. I think we I when I spoke to Mr Robbins on the phone. You know, I think we both agree that as a patrol officer who handles the 911 calls sure you could be focusing on a traffic condition and then be called away to a missing person, a domestic situation or any combination of other 911 calls which will take you away from that traffic. The traffic safety officers for the most part of their day, provided is not a huge emergency. Have the ability to really focus on a specific condition, be it failing to yield to a pedestrian failing to yield to a bicyclist, speeding or other local command conditions that are brought to their attention? Thank you. Thank you. I see, Sarah yeah thanks. Thank you for coming tonight. It's really interesting to hear about this and apologize. My ignorance, I just want to make sure I think you just answered my first half of the question, but just to be sure so officers who are not traffic safety officers can still make traffic safety stops like if they see something while they're on patrol is that right? Absolutely they can and frequently do that's the bulk of the enforcement got it and then for the traffic safety officers, those that are specifically assigned to do that. Are they armed and it sounds like they probably are, because they can then be also called to do. Other things is that right? Yes, those are armed police officers not to be confused with the traffic agents, and I'm glad you brought up that point. Miss lind because we do have approximately 3,000 traffic agents throughout the city, and these are the light blue shirts that you see and they mostly address parking violations which, as we know, can contribute very heavily to traffic safety, be it blocking a bike lane double parking, someone in a crosswalk parking on a sidewalk, so that is a whole nother aspect of traffic safety that I'm glad you brought up great. We have Ken Coughlin, followed by Doug Kleinman hi. Thank you for coming to speak to us. I was I, wanted to ask you about speeding. I know you mentioned it. Speeding is the leading cause of death for pedestrians and cyclists, and motorists in the city and a study was done about 10 years ago, estimating that somebody could speed for about 3,500 years in New, York City and not get caught, and so I'm wondering do you address speeding and what is the situation with speed cameras at the precincts and also in your unit sure? So, as you correctly pointed out, speeding is a major cause for determining the severity of the collision. As you know, if a pedestrian like you mentioned, is hit at 40 miles per hour, which would be over the speed limit on the street. Ninety percent of the time nine out of ten of those pedestrians will die if the pedestrian is hit at 25 miles per hour. That's why the speed limit they now have a 70 chance at surviving. So speed is a major focus for the NYPD. If you, if you were to go on, maybe traffic stat 2.0, you will see this year in particular and last year as well. A large majority of our moving violations, hazardous moving violations are speed related and that does tie in with the speed cameras you're right, which are controlled by the Department of transportation. So I certainly do not want to take credit for those, but even though that there's more and more speed cameras in each neighborhood, especially by schools, we still continue to focus on speed enforcement, maybe not just where that speed camera is set up. We do not want to. Since the speed camera is covering, you could say that particular post we go on to another post, so we work hand in hand with the speed cameras. Clearly, a machine can issue more violations than an officer, but certainly we play a big role in speeding. We can check them to see if they have a suspended license to see if they're, intoxicated or any or anything else like that I heard Hampton, while you're on that subject, captain while you're on the subject of speed that can raise, does your department have any input with D.O.T as to the placement suggested placement of speed cameras? You know what we do work very closely with D.O.T, including on the speed cameras. However, I know they're mostly engaged with a lot of the community boards. The elected officials and I know they're somewhat limited where they can go based on the radius to a school and how many could be at one location. We do not get too deep into it with them, but I can truly say that our bureau meets with the Department of transportation, almost on almost on a daily basis. I would say about three to four times per week about a wide variety, a wide array of topics and something as simple as a neighborhood based complaint. So your complaints are heard at the highest level of DOT as well. Thank you can I just introduce something about speed as well. I have seen on a few occasions and I know I'm not alone in this a huge caravan of people on alternate vehicles. I do not know what they're called they look like: motorbikes, okay, blaring down the street, going through red lights and I've seen police stand by and and not do anything. What what's going on with that? Okay, it sounds like you're referring to something. That's maybe three-wheeled part motorcycle. Yes, exactly is those even legal spider. Some of those are the ones that have license plates. They are then there's the all-terrain vehicles, which might be known as a quad, something you might would see on like a dirt road. Those are not legal. We do take motorcycle enforcement very serious and there are certain times where you're right, where a vehicle may be speeding so fast that we do not engage in a pursuit at that particular moment, because it may further endanger that person, who's, speeding and now other community members like that person may be going. Let's say 50 miles per hour down the street and let's say an officer does see him and if we were to pursue, he would then start maybe driving on a sidewalk, especially with some of these all-terrain and alternative vehicles. So we do try to be tactical in our approach to apprehend them and I. I've seen plenty of videos, especially in Manhattan northern Manhattan. In your area, some of it is extremely concerning I will say: enforcement action is taken against them, clearly, not as much as we would like, clearly not as much as there could be, but enforcement action is absolutely taken against rogue motorcyclists, okay, but what I'm talking about is a caravan of literally dozens of these vehicles brazenly going through red lights and not being stopped at all, or it was a colossal menace and I know there are other people who've seen this I just do not know. What's I did not see any I've never seen anything being done to stop it. I was just wondering if your department is aware of this menace. We're absolutely aware I've seen many of the same videos. You have I've seen it in person often times when it's, let's say 100 of these, and that is not an exaggeration. You know dozens okay, maybe a hundred I agree. There are certainly high volume many times we might not be able to stop all 100 and maybe we're able to get a few of those who were able to stop safely and that's the key. Who can we safely apprehend without further engaging in a pursuit? They are really loud too. You can hear them blocks away. You can hear them in New, Jersey I think it is also a quality of life issue. Yes, just a follow-up question on the speeding: do those precincts have enough speed guns or are there some precincts that I think we had? One precinct tell us, they had no officers trained in how you use them sure. So I can confidently say that all precincts have enough. What's called Lidar guns radar guns, if they ever needed more, they know who to call we we've had we distributed hundreds of them and there are an appropriate amount of offices in each precinct trained, especially those traffic safety officers. As you might imagine, speed enforcement takes a little extra time to kind of set up legally to observe the vehicle and issue the violation. It's not it's, not something that can just be observed, like a cell phone or a seat belt violation. So a lot of that speed enforcement is handled by our traffic safety officers in the precinct. Okay, we dug. Finally, you got to go well howard. You stole my thunder, which was exactly the same question. I wanted to ask and I, and I'm going to add to it a little bit not to be redundant but I observe these rogue motorcyclists and atv nightly. This has been going on for months every single night, almost without exception, multiple times a night, because they will go up. Amsterdam down Columbus down broadway up, broadway and I have been in close proximity to them. I do have videotape and photographs, many of them are not registered vehicles or if they are they've removed, their license plates for obviously for concern of being caught. I think it I have been actually in conversation with police officers and actually higher ranking officers, while they've gone by and literally said, Hi fellas and there's nothing, they can do we're not allowed to pursue them. We're not allowed to do anything. So what I am I understand how dangerous a pursuit can be and I understand the rationale for not doing it, but I would actually ask you respectfully captain is there what can be done? You know, there's an old expression, there's nothing faster than a motorola and what type of intelligence, what type of methods can you use to apprehend these rogue bikers I, even dare call them bikers, because I do believe. It's not going to be a question of when or if it's going to be, when there's going to be a fatality, if there has not already been accidents that are unreported, so I I'm. This is not something that is once in a while. This is nightly multiple times a night, yeah I hear it. What type of techniques can you use and to do to, and also I'd like to follow up just to say to date? How many of these bikes have you taken off the streets? How many arrests and citations have you issued? Let me just pull up a few things. I'm going to begin with letting you know that there's been 43 motorcyclists this year that have lost their lives, 43 motorcyclists that have lost their lives and, as you might have hinted upon, these individuals may ride between burrows the individuals that you describe riding. Maybe a hundred or two dozen or three dozen at a time may not live in this particular community board. They might not live in the 20th to 24th precinct. So once again, it brings us back to our point that this is borough wide, if not city-wide. These are individuals that may come from the Bronx over one of the smaller bridges and 43 of these individuals have lost their lives and, as we also may have pointed out, when they get into a high-speed collision with a vehicle they're, usually on the losing side of that collision. When we see these 43, it's not that they're hitting other bikes. Some have hit pedestrians, yes, but it's mostly them either hitting a vehicle or wiping out and losing control of their vehicle enforcement. Wise one of the best tools in our toolbox is prevention and towing. These unplated unregistered vehicles, while they're parked, is one of our better tools. This way, we do not have to pursue the person that would endanger them or someone else, and when we bring this unregistered unplated motorcycle to our toe pound, which we have in each borough in order for them to get it back, they have to come with the license plate, the registration, the insurance, the proper license. So I do not know if you saw that video by former police commissioner Bill Bratton, where he crushed the motorcycles in a bulldozer. So that is one of our best tools. As far as how many motorcycles we towed and how many summonses we issued I would actually have to dig a little bit for that data. I will say one thing: we are fortunate enough to meet with what's called the Motorcycle Advisory Committee, which is comprised of experienced professional motorcycle riders that own schools, so it's being addressed from a community aspect as well. However, these motorcyclists are very professional riders, we're having trouble reaching out to these youths that would go out there blast their music disobey red lights. Ride on the sidewalk have no license no license plate and have really disregard for the community that they're I do not want to say that they live in, but that they're riding in and visiting it. So the million-dollar question I could use help with is how do I reach these individuals, because I really do not want to put them they putting themselves in the morgue, and we do not really want to put them in the criminal justice system. How can we correct these guys and put them on the right track and that's the million-dollar question? I, unfortunately, do not have the answer to it. It's a following. Just for clarification. She said: 43 people have lost their lives and I'm very sorry to hear that. But are we talking about 43, law-abiding motorcycle licensed drivers? Are we talking about 43 of the rogue unlicensed riders? There is a split. There is a split because we we've had some very professional riders that were out for a Sunday afternoon ride, especially in the spring, and they unfortunately wiped out when they made a turn on, say the Cross Island Parkway. So it is a split I would say about 50 and of course we never blame the victim, but yeah we've seen it where they've had a stolen bike, no license no registration, no insurance. That kind of speaks to maybe the road rider, and then we've had some individuals that were ultra professional, had been riding for years. Everything valid and they were just out for a weekend ride, maybe visiting family or friends in long island and on their way in say, Queens or the Bronx hit a guard rail or went down on a wet pavement. So it is 50 50. all right and my last point, I won't I, do not mean to monopolize this and I really appreciate your time and be being here this evening. I guess the just for clarification. Obviously the point was made. Speed is deadly and clearly the risk of someone perishing the greater the speed it exponentially increases. But I would also like to add that when someone is going the wrong way, if someone was going the law, the lawful speed of 25 miles an hour but happened to be going the wrong direction and collided with someone else who was going the proper speed, you now have a 50 mile, an hour collision head-on collision and right, and so there is a huge problem with not only these motorcycles that I just mentioned, but there are bicycles and other alternative vehicles that are going the wrong direction and may hit each other or a pedestrian or a motor vehicle. So the opposite direction doubles the speed and that's just something, I'm very concerned about you know doug, I'm glad you brought that up about the bicycles, because each time that I'm fortunate enough to attend these type of community meetings, many people raise the issue about the danger of delivery. Cyclists. The danger of bicyclists, maybe going the wrong way running a red light and I hear that I've heard it so many times and I just checked the data in Manhattan north and this year, 84 of pedestrians that have been injured in collisions were injured by motor vehicles, trucks, suvs cars, etc and 16, and not to say that 16 is nothing have been injured by bicyclists of the six people that we've unfortunately lost in northern Manhattan to traffic deaths this year, five of them were killed by a car truck Suv, and one of them was for what it's worth killed by an electric bicycle. So I would never minimize that, but the 84, the eight out of ten, the eight and a half out of ten of pedestrians, that injured seem to be injured by the vehicles. Cars, trucks, suvs. So that's kind of where we focus our enforcement, but trust me especially from persons in community board. Seven. By the way we've heard it, the motorcycles are going up, Amsterdam avenue right now, I do not know if you can hear it I believe it, especially since the weather is 68 degrees during the winter. Naturally, we see a drop in motorcycle fatalities and come April, especially in April when they're unfamiliar with the writing. It is so I do not doubt that, but we do have an enforcement plan in place and we need more help. Thank you very much. Do you ever take license plate numbers of motorcycles that you see operating in an unsafe or or a bad manner, and then follow up with the owner of the vehicle we do. We do. It takes a long time to develop a case like that. But yes, let's say right: now we see a motorcycle or a car going committing an egregious violation. We will take the plate. We will then see where that vehicle is ready to. We will tow that vehicle and then, when the owner comes to pick it up, we will address the situation with the owner to determine who is the individual responsible that behavior? It can be, as you know, very time, consuming yes, and what is the penalty for operating a motor vehicle without a license plate? Okay, so operating a motor vehicle without a license plate would actually be a summons. It can be a parking summons if we see it parked, it could also be towed, and if we see it the person driving, they would be stopped, they would be summonsed and they could also be temporarily impounded if that was the only violation and temporarily impounded meaning they. The person gets their vehicle back at some point. They would, they would have to come to say the precinct or the tow pound with the license plates, and we would be more than happy to return it to them, provided it was not stolen or something, and how many, how many violations of that sort of behavior before you actually confiscate it for good? You know what I do not believe. There's a threshold of when we confiscate the vehicle permanently, because that is someone's property. Usually we would do that for Dwi is when we take a car and we would initiate forfeiture proceedings or if it was used in a crime. Let's say it was transporting right now we're going off traffic safety, but the only time we take someone's car and not give it back would be like a drinking and driving situation. Yes, okay, we have other hands followed by Natasha, followed by Barbara Adler. Okay, yeah captain started a discussion on what I was going to ask about. Excuse me, which is bicycles. My understanding has always been that when you're operating a bicycle, you're subject to the normal traffic rules, you have to go the correct way on a one-way street, stop for red lights, yield to pedestrians, etc. Do you or does the NYPD or your unit, have any any policy when they observe bicycles, going through a red light or a stop sign or the wrong way? And just for some context, we've had many discussions at this committee and on our board on bicycle, related issues, bicycle lanes and enforcement and operation in the parks, etc, and we've actually from time to time, had cyclists, who very candidly have told us that you know if an intersection is clear, they do not see any reason to stop and wait for a red light to turn green or stop at a stop sign, etc. So, again, do you have any enforcement policy? If you, if one of your officers sauce, saw somebody going through a red light on a bicycle, would they would they stop them? Would they summons them? Well, you are correct to say that, for the most part bicyclists, including throttle-powered, bicyclists, are subject to the vehicle and traffic law. However, there has been some recent legislation that allows bicyclists to temporarily stop at a red light and then be guided by the pedestrian indicator. It's called the leading pedestrian indicator. There are certain locations where a bicycle must stop at the red light. However, when the walk signal for the pedestrians that traveling in the same direction turns on the walk sign, it allows them to go through that temporary red light. But I know that's not exactly what you're talking about at a minute. This allows them to be more visible and to get a little bit of a head start, but I think what you're talking about is when, let's say the light, is green, going north and south and say they would go through a light east and westbound when they when they would have their walks off and obviously they are, they are subject to enforcement. And, yes, we do take enforcement action against that now we have a finite amount of resources and in the precinct we encourage our officers to really focus on protecting the bicyclist, protecting the pedestrians from the vehicle, as we mentioned earlier, most of the injuries to bicyclists and pedestrians are based on vehicles, not all of it, though not all of it. So most of our enforcement and I testified to this about 90 97 of our traffic summonses are written to motor vehicles, cars, trucks, suvs and then about three percent, as I testified to are written to bicycles. So we still want to correct the condition with bicycles. We want them to stop at the red light, and even you know, the most staunch advocates agree that they should stop at red lights, not be on the sidewalk. So that is where we focus on. We focus on the cars trucks, suvs committing a violation, but yes, we do focus on the bicycles that commit violations that time we try to go through a lot of education on that to inform them, especially as more delivery. Cyclists are in the pandemic and stuff like that. I think that covered most of your points there. Yes thank you Natasha and then Barbara Natasha hi. Yes, thank you very much for being here tonight. Captain I had a few questions. First of all, could you talk a little bit about the recent budget cuts in the department and the reform actions and how those have affected your team from doing their job on a daily basis? My second question was about e-vehicles. My understanding is that they are still illegal and I'm, but you know, I see them more and more on the street I think since the pandemic began, many people invested in e-vehicles, and so I was wondering. If you can talk about enforcement against them, are they truly illegal or are they now accepted? Are they legal and the third thing I was not going to I did not even have this on my radar, but since you just spoke about this change in legislation about bikes and the red light- and you know it just sounds like a very confusing rule, not very intuitive, and I'm wondering what sort of education or outreach you've done in the community in for both like motor vehicle drivers and the biking community, to make them aware of this change in legislation, because I certainly was not aware of it. Okay, thank you sure. So I'll start with the first one about the budget. I would I would probably defer this one to maybe some of the even higher ups in the department, but what I can say from our bureau? Yes, there has been budget cuts, but we have remained laser focused on division, zero mission, and now more than ever we must do more with perhaps less. We must realize that this is reality, and we must realize that now we have to alter our enforcement strategies, and that is why I said without a finite amount of resources, it is now more important than ever to really be focus on the locations where bicyclists and pedestrians are getting injured and deploy our resources there. We do not know what next fiscal year budget will bring, but I can say is we do not watch the budget? We do not watch the bank account. Of course we must be fiscally responsible, but we get the budget and we act on that budget. Sure, of course we wish we could deploy more officers for traffic safety. Every unit wishes they do. I'm sure the Narcotics unit has their things, but from a transportation aspect we will continue to serve with every resource that we have, even if it's a slightly less amount of resources, and we will be more fiscally responsible than ever, not that we were not in the past to make sure that we stretch our resources and stretch that budget to every community across the city number two, the e-bike legislation, so it can be a little bit confusing November 23rd is when these micro mobility devices officially become legal on the streets. Now it was already signed into law, so they are legal today, but they are still subject to violations today. So technically one of these throttle-powered e-bikes could be eligible for a summons today, but you know we realized that in about two weeks, I'm looking at the calendar literally two weeks from yesterday, they become fully accepted fully legal. So what are we doing? They still must stop at red lights, they're. Just like a bicycle they're, just like a car. They must stop at a red light. They can't ride on the sidewalk. They can't ride the wrong way, so they would. They could still get a ticket like that, but we do not want that. We want them to comply with the rules and regulations for their safety and also for the pedestrian safety, because, as I mentioned, there are still more incidents than we would like, where they do contact the pedestrian, and that was that 16 in Manhattan north and that's nothing to Scoff at that is still about dozens of people that have been injured and I do not want to make light of. That is still dozens of people that have been injured and those are preventable collisions those are preventable collisions, even though those individuals, with the exception of one, did not die. Those injuries are still significant. That's a doctor's visit. You know if it's an elderly youth, whatever those people may now be mobility limited themselves. We definitely do not want that. As far as legislation we it's kind of a pending legislation, some of the newer one. There is a lot that comes out and we do we do we put it on our twitter page. If you happen to follow NYPD transport, you can go there now, you'll see one about the new rear seat, passenger seat belt, the rear passenger seat belt requirements. Hey! Is it something that you know to broedcast? You know across the nation? No, but it's important and it's something for motorists to know it's on our twitter page I know the newspapers had it some of the newspapers had it, but that's usually the way we get it out there through social media through meetings. Just like this, hoping that you guys can leverage your community board and I see, there's 67 participants that everybody can share on it. Some things are cyclist, specific, which we do more outreach in combination with DOT to some of the biking. Organizations such as the bicycles being allowed to use the leading pedestrian indicator at intersections that are equipped with it, where they can use the pedestrian walk signal to get that seven or eight second head start, but yeah legislation it can change and we always take whatever avenues. We can: okay, who's next Barbara yeah hi. Thank you. My question really concerns number three and our agenda tonight. Having to do with West End Avenue open street, but I'd really like to ask you this question in case you're not here, but if you will be here, I can ask it later on. Oh, you might be best to ask it now. Okay, I've noted that there are barriers at the end of each street, but cars are whiffing through there and they're zigzagging back and forth, and they are really treacherous. I do not see many pedestrians there anymore, since the weather has cooled, but I'm wondering if enforcement is being done there, because it just seems like a disaster waiting to happen so yep pretty familiar. What we're referring to throughout the city. There are these shared streets open streets where it is for pedestrians to exercise more space in their community and vehicles are allowed to locally access it. For example, if someone had a pickup drop off delivery or they lived on that block, they would be able to access the block at a five mile per hour. Speed limit right, so there would be no summons for necessarily accessing the block. However, exceeding the speed limit on that block and the way you describe it and I do not dispute it, they might be going more than 25 miles per hour, let alone more than five. Well, five is permitted. Correct five is perfect right and the way you're describing it I think they might be going 35 so right either way, it's unacceptable. We do work closely with the community partners. Now, I'm not ultra familiar with this and I'll. Let you maybe address it later. I see the other precincts are on here about how it's staffed, sometimes the Community board or a bid. You know, I kind of you know are involved with them. Citywide and I. Some of them are managed by various bids community boards and some are managed by just residents of that block who move the barriers at eight A.M and eight pm. So this is something that you know could be follow-up. It's not unique. The program is very beneficial. Many people like it but clearly in order for it to work perfectly, which it must we need to tweak it. Thank you. Okay, we have Steve Brown I. Just was just adding that where we're, we really appreciate the captain's time, but we're running short. So if we could keep the questions to an absolute minimum, anyone who's spoken if you've spoken already, we I'm sorry. We can't have a second round of questions and we'll take some questions from the community, but we really have to move beyond the first item on our agenda. Do my best to be cooked to be quick howard. Thank you. I just wanted to bring up one use case that I think is specifically unique, particularly with Covid-19 and the outdoor seating, and that is delivery. Vehicle and I bought this up a couple times. Delivery vehicles, particularly the electric ones, going the wrong way in the bike lanes. I think it's very dangerous and it also particularly when you start to get long barriers where there's wood up against the delivery and it's a left or right and I do not know what the stats are, and maybe they do not. They do not justify it yet, but you know: there's no stat for people falling over there's no stats. For my myself and I'm a big biker, you know my son just saying: I do not want to bike anymore because between six and eight he's I do not know if it's come up. I'd like to just bring it up. People know I brought it up in this meeting before I. Just that specifical specific thing and specifically going the wrong way. I think is a challenge, and you know I understand that 85 percent of the people are our transportation and should do so, but I do think it's a case that you know I just wanted to bring up that. I. Think it's a challenge, particularly with the new the new outdoor restaurants point made, and we definitely want to keep the bike lanes clear unobstructed. So they do not have to go around cars, but we fully support the safe operation of bicycles. When they're around pedestrians, no question it's a difficult enforcement issue. Why do not we do a couple of quick questions from the community and Peter Arson, his first barneson, I'm sorry, Artisan! Sorry, you have to unmute yourself Peter, yes, hi thanks very much for being here and thanks for letting me ask a question: we have an open street for restaurants and we are seeing cars coming through there. We've also had the experience with the motorcycle groups, the atvs I guess. My main question is that I know that this is not something that the local precinct is going to be able to address. Is there an alternative that you see? I had posed the question of whether the the parking meter police could be engaged in this I do not know how that could happen, but I'd be very much interested in hearing whether you have any other alternatives. Sure there's definitely a lot to unpack there and your suggestion about maybe the traffic agents manning them that has reached the highest levels. It seems the most successful, open streets and open restaurants, programs and I know. Not. Every community has the resources to do this, but some of the photos that the community sends me it seems like, especially with the restaurants. There is an individual, maybe that's from the bid that kind of takes control of it and sets up the barriers at the beginning of the shift, or maybe they just designate. Okay, Peter's restaurant. Let's say your peta's restaurant and Eric's restaurant on Mondays Peter's restaurant is responsible for setting up the barriers and just assigning a staff member to make sure that they have not been compromised and then maybe on Tuesday, it's Eric's restaurant and then myself and one of my employees periodically check. That seems to be the best practice when it comes to open restaurants and I'm fully aware that there's been some incidents where a car has actually hit a a seating arrangement in a restaurant. Think, thankfully, there's not been really a serious injury, although all injuries are, of course serious, but not a life-threatening injury so far. So that is something that we're monitoring. I can't say it's been an epidemic, but it has happened. The pizza place on the Upper, East side comes to mind and a few green point green point in Brooklyn, yeah green point sunset park, there's been some been some ones, so I run the Columbus Amsterdam bit and we do that with a stretch of Amsterdam this past weekend, I lost six police barricades, they were crushed under vehicles. I was hit on a bicycle as a bicyclist, where I refused to get out of the way of a car, and they hit me. But that was my choice, but it is something that I'm seeing more and more with cars just going very fast and it's, but it's not just cars. It is also the electric vehicles and the motorcyclists and I'm just feeling a real need for increased enforcement. In some format. Point well-made, speed enforcement is at the core of the Nypd's traffic safety program that and failed to yield to a bicyclist fail to yield to a pedestrian. Those are our leading causes, speed and fail to yield. Thank you, sanjeev then Ira and then Richard. I'm sorry, I'm sorry, I'm sorry, there's Andrew rose I promoted a couple of people in anticipation of your calling on them, so they could be heard. So that's all said: Andrew Rosenfall is next and and I believe that Sanji wants to talk about 73rd street, which is a very different item. That's not on the agenda, so that probably has to be new business. Okay, so Andrew Rosenthal I'll be quick captain thanks for joining us today. Thank you. I have a car that I used to keep in a lot pre-Covid and now, I'm doing alternate side of the street. Dancing and I seem to be the only one doing the dance so I go out and move my car and I look at the block and nobody else does, and so the street sweeper comes by everybody's sitting in their car, but nobody moves and the street sweeper can not do anything and just goes up the block down the middle of the street, and this happens again and again, there's been virtually zero enforcement. The only tickets I see are for cars, where no one's sitting in it, but there's no ticketing for people sitting in their cars and not moving. I've seen that, on my block too yeah we've had a new group was formed this summer, one block on the upper West side, I'm reading from the West side right. The 280 volunteers have adopted over 100 blocks so clearly there's a street cleaning problem and I think it's very fixable, absolutely Mr, Rosenthal I, hear you and one of one of our more common summonses for parking violations is the alternate side, because it's so common and I appreciate you bringing this to me. I was looking at the numbers and it looked pretty significant to me, but it I take your word that some, maybe traffic agents are maybe passing over vehicles that are in violation that have someone sitting in it. I think a good answer to that would be in a good response, and a program going forward would be to instruct that person to move not given the summons perhaps, but since they are capable of moving move and I know, there are talks as I know. You guys are involved in about somehow shortening it where when the street sweeper passes, maybe the cars can go back, so the people are not waiting in the cars but right, but that was the old way, but what's happened now? Is people literally do not move? Virtually a hundred percent of the blocks are filled before the street sweeper comes and consequently no street sweeping is happening in my neighborhood I mean I've. Seen this on numerous blocks as I sit in the car, I can see three different blocks and they're all the same. There is nobody vacating a spot for if even five minutes, something I need to fix. Absolutely that's a very clear answer: I need to fix that okay I mean I. Have videos and pictures I can send if you care no I do not dispute it. I take your word on it. Lisa Orman was the next one and then we go to the next round and we're running it's 7:19, so I do not know how many more we can take just rich robbins. It will be the last speaker on this. Can you hear me? Yes, okay, great captain. Thank you. So much for being here tonight, you're a breath of fresh air for safe streets advocates. I'm curious if you're working on educating your colleagues within NYPD on double parking and abusing placards and parking on sidewalks I, really think that people lose faith in the police when they act above the law, and it would go a long way if they were actually part of the solution instead of part of the problem. Well, I'm glad you voiced that point because I made it a point to read all the comments it looks like there might now be up to about 38 comments and I know. Some people did not get to speak and I wanted to make sure that you guys are confident that I will at least read all the comments here. So I believe number. One was your point. Maybe it was you who typed it about officers improperly parking, be it their personal vehicles or their patrol vehicles and, quite frankly, more needs to be done. You'll hear it from me, while in you know, placard enforcement is taken against this. More needs to be done. I see photos all the time. There are obviously websites and twitter pages dedicated just to improper parking with placards, and it's a bit more than just an education. It's a constant follow-up and the good News is I believe that it's fixable it's a problem, that's fixable! We can fix this problem and I definitely know. The leadership of the NYPD is fully on board, as is the chief of transportation, a newly appointed chief who is absolutely focused on building this community trust by us, leading by example. If me and I always use myself, for example, if I'm going to park my car in a bike lane, so I can go get a cup of coffee that is setting the poor a very poor example. It's endangering a cyclist and clearly I need to correct it or be held accountable now. Okay, we all know that if there's an emergency in a building, you know a golf, a bit of robbery or an assault. I need to get into that building and I can put the car there. But that's not what we're talking about. That's not what you're talking about you and I are both talking about convenience, someone parking improperly on a hydrant to sidewalk, because they have a placard and they can and they do it out of convenience and I can definitely say this bureau. The transportation bureau takes the lead on that and has to lead by example. So in a word, I hear you you're right and more needs to be done, and it starts right here with me and it and it is getting done, but it needs to expedite. Thank you. Captain mark you're calling the remaining yeah Ira Gershwin Horn was next. Let me I'm sorry. Let me get to Ira and rich wanted to speak and yes so and I see. Bob Robert Sva has his hand up too. So maybe those three speakers and then we'll call it a day. Okay, we've got ta and everybody please move along because it's already seven twenty two and we have not gotten to the West end. It was a good conversation. Now you've been terrific Sir. Thank you for joining us. Thank you. Thank you. Captain, okay, first question, I, think they're. All yes and knows: does the police department consider itself overwhelmed by traffic safety issues overwhelmed? No, because we know that the burden is heavy and we must do more and we have some great partners. We have some great partners DOT with their speed, cams the taxi and Limousine Commission, and many other partner agencies, the sheriff. So no we're not overwhelmed, but more needs to be done, and you know I have a question about whether cam you talked about taking license plates and a gentleman before me talked about park cars not moving for street sweepers and he was offering videos and I would just think the street sweepers should have a camera with them and take video as they're going a gopro just stuck on constantly taking videos. I know those bosses have that the MTA buses have that, I'm not sure if sanitation looked into that it's very low tech, very low tech and on an open street a bicycle can't go the wrong way like on East on West 103Rd I could get a ticket for going east 103Rd on a boy. I mean. Are you talking? Was there a summons issued, it almost sounds like maybe you're going to no I I've. Never I would not. I've never seen a policeman probably issued to a bicyclist on an open street for going the wrong way. Of course, it's where it's more of a park more of an open space than a street which is subject to the vehicle and traffic laws, so I would I would kind of say. That is something that we won't really have too much of. Thank you captain. That's it! Okay, thank you, so Robert and then rich robbins, and then we're going to move our agenda right. Yes, okay, captain I'll be very quick right and my question is a two-part question: I'm a block away from Amsterdam at 96th street and on a regular basis when the barriers go up, I, see cars, stop at the barriers, angrily, get out, move the barrier and go in. Apparently they live in or dropping something off the people off at 97th street okay. So what is the a that's the problem? What what's that about, then is? Are they within their rights? They do not. They do not come out again and put the barrier back up. You know they're pissed off and the part two is that on that particular open street between 96 and 97, you have a holy name church across the street. You have key food and then you have cvs. So it's like dead air and broedcasting. So why is there barrier not beginning at 97th street, where you have the asian restaurant? You have Malikon, you have this and that and the other thing and that they're very busy dining venues. So that's my two-part question. So the access to 97th street for people who live there and why the barrier 96 and not 97th street. The second part of that question is kind of so localized and I. Won't. You know what I kind of look things from a city-wide level, all the boroughs and I'm obviously familiar with 96th street familiar with Amsterdam, but as far as some of the restaurants and the key food you mentioned, I might not be able to answer that. But, more importantly, the way the program is. There are no restaurants. There's no outdoor seating there, yeah I, just do not have the knowledge to really answer part two of that question, but part one I feel might be the most important one. So a motorist can access local access to pick something off drop, something off on that block on that block. So let's say there there's a barrier and they need to drop a person off, make a delivery or pick something up on that block they can go, they can move the barrier temporarily and go in and then I guess that's a million dollar question in a perfect world. They would then get out of their car again and then move the barrier back to the way they found it or a community member and not, you know, I, understand they're, not employees of this program, which is obviously something they're working out. I see some of the comments written here. A community member or a bid, member or whoever or resident, would move the barrier back, which is a lot. That would be a great what you're suggesting I think would be a great solution, a community volunteer and you give them a nice white shirt. You know in a cab, I've seen them just with to raise and lower the barrier. Fair, yeah I think that's the perfect world thanks. Let's move ourselves along here, I'm sorry to be the guy to do that. So how are you called on rich and then we're I know there are other hands in the in the the cube or we're going to have to move our agenda because everybody wants us to get to West End Avenue, yes, rich great! Thank you very much and I want to mention you. We have great partnerships with both of our local precincts, the 20th and 24th precincts. Nonetheless, I asked a question at the the listening tour that the NYPD pd did of commissioner shea. That included some concerns that I have about just the ability of the local precincts number one, as captain Warby mentioned I expressed concern that there are not many officers in the local precincts who have radar training. There are also very small areas, and it's not it's great for community policing. It's not necessarily, in my mind at least the best for traffic enforcement, because within two minutes someone can drive out of one precinct and into another, and also you know, the precincts are not just as equipped with data access and analysis as citywide is and through that I was put in touch with captain moravi had a great conversation and invited him to join. This meeting really appreciate your joining us definitely want to keep the dialogue open to see how we can play a role and coordinate our efforts, both with analysis and prioritization and with D.O.T for street design. I really love the data driven approach that you're doing with the transportation bureau, something that I've really tried to bring to our our community board and I think the more that we can work together and really use data as a way of figuring out how we should prioritize what we're doing and how we can help you and vice versa. That would be great one example, I mentioned when we spoke was we've had some issues and Andrew Alpert has been for years trying to get D.O.T to put up signs as cars drive into our neighborhood. Just a lot of them are coming from, especially out of the neighborhood, but even out of state, and they might not know about the no right turn on red. They might not know about the 25 mile per hour. Speed limit and I think the more that we can coordinate with you and work together to try to get D.O.T to institute our top priorities. The more effective we both can be I would also love to do pilot projects with you. We love to be guinea. Pigs we'd love to work not only with the precincts but with NYPD transportation and with DOT to make our streets safer and, as you can tell, we have a very engaged community which you know can be a really good thing, and for that reason, if we can do pilot projects, having said that as engaged as our community is, you are especially popular so do hope that you come back, had a really good conversation with you and just want to. Thank you once again for joining us great guys. I know you have a big agenda, I'm going to obviously kind of log off and I'm going to go through, looks like another. 35 messages came through this way. I can take in what you guys wrote and I'll leave you with one thought that you know we deal with a matter of life and death. These lives that are lost in traffic deaths are just as important to us as someone who is a homicide, victim or murder victim. When we do an investigation for a traffic death, it is a homicide level violation. This is a matter of life and death and I want everybody to know that all your concerns are important, be it something is I, do not want to say it simple, as someone not moving their car for a sweet, a street sweeper or to a speeding vehicle that could unfortunately rip a family apart by injuring a child or God forbid, even worse to a child which I won't even mention. So we hear you, we hear this city and a lot more work needs to be done and we are in this for the long run, I do not care what the budget is. I will be here. Thank you so much. Thank you so much. Thank you. Captain pleasure having you thank you I apologize to the folks who had raised their hands to speak, but we're we got to move our agenda so I'm going to lower those hands. Sanjeev Mehta is somebody who has new business for you, Howard and Al and Andrew. So when we get to that, we will, when you get to that part of the agenda, we'll call on him then, but I'm lowering the hands now. Okay, thank you mark go ahead. Item number two on our agenda: is expansion of the city's open storefronts program to allow retailers to use street space you've all heard the announcement from the mayor's office. I am sure this is in response to pockets of Covid-19 throughout the city and the ability to help store owners, maintain their business and not have just vast areas of empty storefronts, so they can put some of their goods out on the sidewalks and perhaps even do some transactions out on the sidewalk and thus avoid having people in a small confined area within their stores. I do not know if Bci committee has sounded off on this, but this is probably an item that we would. We would normally do jointly with them, but this will involve the taking of some more sidewalk space. I do not know how many of our merchants will participate in this, but it is the law of the city right now and we're open for discussion on this proposal mark. Do you know if the eti has weighed in on this our resolution back in May? Well, I? Guess it was adopted in the June full board meeting called for the use of creative use of outdoor spaces for both restaurants and for other small local retail businesses. So we are already on record as supporting this and given the pending. Given the number of people who are asking questions about West end Avenue I do not know what more you need to do other than announce the program and unless there's comment or concern that the community has about this I agree. I think we baited on this. The the program that they've rolled out for retail is more limited than the program for restaurants and I. Do not see a need for a resolution on this I. Just think everyone needs to be aware of this. I think everyone is already aware of how what a desperate situation much of the retail is in and I hope this program gets expanded in the way we've called for it to be expanded and it brings some life to the retail space. That's the only howard, the only the only issue might be in the case of restaurants. Some restaurants have actually, with the approval of their neighbors, taken space in front of those retail stores who were not restaurants, and you know in the in the in a few cases. Perhaps somebody will want to reclaim that to do their outdoor, but I do not think it's a big issue. I do not think it's going to be a big issue. I do not think that many retail establishments are going to want this space anyway, but again we're on record it's being in favor of it. Hopefully, the city will do what it can. Since this is not really a controversial issue or we're not adopting a resolution, we have two hands raised. Why do not we try to address this quickly and move on to the issue that is going to attract two hands in the in the community, so okay, Barbara and then Ken and then we'll get to the community? Howard I think you already actually answered this, but I'm most familiar with the stores in the Columbus avenue bid, as you know, and those merchants have merchandise which is so pricey that they're not going to bring it outside they're trying to make this their stores as open and as as accessible as possible, so that and only allow one or two people in at a time and I think you're going to see that pretty much throughout this district. This is a big issue, ken hey yeah, it just seems a little unfair, maybe there's an equity issue here that restaurants are allowed to use curbside space in addition to the sidewalk and or struggling businesses or not so well, Ken. The reason. The reason is that restaurant you spend more time most folks do in a restaurant than you do in another kind of business, and that could be the the reason for the additional space. But if it's, if a business, could you know if they could thrive by being able to use curbside space which they might then I? Think we should do it? Well, I'm hopeful we'll have a vaccine fairly soon and again, we've called on the city to do it, so our voice has been heard too quick. Actually we have only one hand. No, you have two. The first one is: I'm sorry, I'm promoting them in advance, so you can be ready to rock and roll okay. Then you call them okay, so encore dalal, followed by Sandra Smith hi. Thank you. So much. Can you hear me sure: can you go ahead all right. Thank you short comment. I just wanted to thank the Community board for all its work on the program to have restaurants and stores have store, have curbside and street uses. It has completely transformed the neighborhood and gotten us through a very dark time. The upper West side has never felt more alive to me. I've been a member of this community for years and I am so excited to see our streets change from being private storage for p, public storage for people's private property, their cars into something that actually can benefit. The entire community I know there's a lot of interest that you guys have to balance but I think you're doing a wonderful job. It really makes it feel, like a brand new city, and it's so magical to see so many people out and actually enjoying the streets. So I really want to commend you and I hope that even as Covid-19 goes away, we continue to think about how best to use our public spaces for the entire public. Thank you. Thank you blizzard, one more. Yes, Sandra Smith hi there. Thank you for having me. Do you hear me sure, do a little louder, Sandra a little louder, please a little louder. Okay, do you hear me now much better? Thank you. Thank you for taking my question. I. Think it's a great idea to you know to open this up to more businesses on the stores storefront. But my question is more with than what happens to the transportation. All these stores are very heavily a lot. A lot of track. The streets like Amsterdam is already honestly. I live on Amsterdam in the past six months. It's crazy between the trucks and the bicycles and the school buses that are double parked. Ups fedex I mean, if you're, going to start opening up more space for the stores and the restaurants, which is great, then you're going to have to balance it out and definitely reopen West End, Avenue and I appreciate I know that you guys are going to go back to Western, Avenue and I appreciate the fact that when Kobet happened it was necessary, but the parks are open. The playgrounds are open and there's not one commercial establishment on West, End Avenue. So to me, it's more of how that. How are you going to balance that you know if you're going to open this all up, then you need the pedestrians to feel safe to walk and shop and eat. Thank you. That's a perfect segue to our an accident item which in fact is West end Avenue I will concede. I am not an expert on this subject. Is there someone from the NYPD who can tell us exactly what the plans are with regard to West End Avenue Mcconnell did Colleen hey, so it's colleen from D.O.T. So with West end open street, our partner is the local precinct and we had reached out to them and they had committed to putting out the barricades and removing the barricades, but I believe there might have been some issue with you know having to do this on a daily basis. I'm not sure, but maybe NYPD can elaborate more on this. If they're there detective mcdonald can you can you hear us? I know detective Mcdonnell is with us, but it took us a while to get to him so maybe he's doing other duties. We never had community partners for West End Avenue. That was our understanding. Was we had barriers delivered there, but we do not have community partners who set up anything. We take our resources to open it up close it at night and then maintain the barriers as best we can by ordering more from the barrier shop, but it was not. It was not ours to handle originally what was explained to me colleen, you want to respond to that or not necessary, so I mean whenever, with the open street, in order for us to do this, we have to have a partner. So it's possible, maybe detective mcdonald, is not aware of our competition. I'm you know, I would have to find out. I would have to go back and find out from my colleagues who actually do you guys mind if I jump in here, not at all go ahead. I think I can explain the discrepancy and thanks for bringing this up and I really want to thank both the 24th precinct for putting up and doing taking care of the barricades when possible and I want to thank the people who live along West, End Avenue, who have written to me about their experience with West End Avenue. So this was one that actually fell through the cracks between the 24th precinct, D.O.T and City Hall, and my office could be to blame completely because I was asked what streets I'd like to see be used as open streets, and this again was what in April when they just started. The open streets program and I recommended west end. App I was given parameters which was basically nothing with a bus route on it, and so I recommended west end avenue between 87th and 95th and 96, and so they went ahead and did it without their being appointed. Anyone to oversee that particular stretch and it fell on the pd to do that, which I think is really unfair. When you look at the one that Peter Arnstein runs on Amsterdam avenue in front of his bid, it's very successful and it's because it's very successful because his bid is paying attention to it all the time. So on this one. We're in a very different situation and I am really was really glad to have it during the summer months and into the fall. But the burden has rested on the NYPD and there we've asked the people who love the West End Avenue open street program if they would take responsibility for the barricade, because that's really at the heart of the issue, and so far we've not heard back about that which is too bad. You know, if there's a group that takes responsibility, then it would work I see a lot is going on in the chat and I just noticed that too, if I could interrupt so I'm sorry I, just wanna I, just wanna. We did not have ground rules at the beginning of this meeting, but our general ground rules are that we are. We are constructive and productive on our discussions. Wow is there a reason, I'm yeah and we're awesome. I do not quite understand some of these comments. Let's not, let's not go down that rabbit hole unless instead, let's all agree that we need to be productive and positive, and also to stay on the topic of this meeting, which is West End Avenue, which a lot of people have been asking for to be heard about. So please, let's not go down. Another path: let's have a productive discussion about West End Avenue. Thank you, yeah I mean I I'll, be very clear. This has been a great success and people loved it, especially during the summer. That's no admission. It's just how things work so I. You know if there's a group who's willing to take responsibility for it. That'd be great. I'm in touch again just trying to look at the chat and not look at the chat at the same time about a half a dozen people, or maybe 10 have emailed me saying: please keep it open and not with cars, with no solution with no solution to addressing really the problem of taking minding. You know cars going through the barricades, so I walk through that area, as do a couple of my staffers on a regular basis. So we have a good handle on what we're seeing there and the real. There are real safety concerns, especially around 97th and Riverside drive. Helen. Do you know what the plans are for Western Avenue? What do you mean? What the what the status of that open street is going forward? I mean this they're asking me to find somebody to take responsibility for it and if I can't find someone to take responsibility for it, it's not I mean I that the question is answered. You know my office can't and never has done it. Nor have we ever been asked to you know. Detective Mcdonald has and the two four have done, yeoman's work doing the best they can when they it's really not their responsibility. So you know again, unless the community who lives there, wants to step up and take real responsibility. I do not see another option. You know because I think at this juncture, and certainly for winter, we want to go with safety first and I'm just getting overwhelmed with emails. Saying that they're seeing cars whip through West End Avenue, not realizing, there's a barricade hitting a barricade, whatever it is and I know there are people who just love it, because I'm getting some of those emails as well. Is there a time frame involved? Is I'm being asked right now? This conversation has been going for the last two weeks and I've been trying to get the community to step up if even just on weekends, but you know everyone's at a loss because no one is taking responsibility for it and if that's the case, you know. Ultimately the city is responsible and they have to do the responsible thing. Okay, yeah, it's colleen and in all fair honesty, I mean we need to have a partner, and if we do not have a partner, then the street will have to go back to the way it was and I know we're in discussion about this internally and with city Hall as well. Colleen is there, do you have a time frame I? Would you know what I would probably have something for you by Friday? Let me get back to you by Friday, because I know tomorrow we're off so, let's see by Friday, if I could just add one of the community folks brought up the issue of congestion on Amsterdam earlier and even prior to the closure of west end Avenue from 87 to 96 Amsterdam avenue even prior to the seating of restaurants. In the street had come down to one moving lane at times due to double parked delivery vehicles, double parked other vehicles and what have you and I think closing of West End Avenue may have made sense when Riverside park was closed and it was the height of the summer and everybody wanted to be outside, but once school resumed at Ps, 75 and fewer and fewer people were using, the open street and traffic was starting to build on other northbound avenues. I think it started to make less and less sense and I certainly understand the need for a community partner to move the barriers, but I'm thinking that as the cold weather is coming and folks are not going to Wanna. In fact, I hope. The restaurants survive this winter with outdoor seeding and all of the special heating and plastic that they've put up. I'm thinking that it probably makes sense to restore West End Avenue to its former self. That's just my opinion and just to be clear. The responsibility is not just for the barricades I mean there are some streets between Columbus and Central Park West that are closed down by schools and there is school staff there all the time. Absolutely so, and West 75Th street for a time was closed between Broadway and West end. The the Black association took responsibility, which meant they had people standing there. So you know it's a it's a real job. Okay, we have a few a few comments from the pat from it from the committee and we also have two people from the community who want to give and emphasize short presentations. So why do not we hear from the four hands race on the committee? First right, howard can I just check I. Think detective Mcdonald wanted to say something: yeah, I'm thanking Mrs Rosenthal yeah. Can you hear me absolutely yeah? Well we're trying to figure out West end Avenue. Can we just get a definite answer to closing it prior to 8 P.M, because it's pitch black by 4:30 now I mean if someone can get in contact with the precinct, so we have it in writing. We like to try to shut it down. Maybe at four for safety, I mean it's pitch Bla, that's when the batteries sometimes get struck in the darkness. Sure it's colleen and I can I can look into that definitely yeah, because that would be a big help for us just for everybody. That was, that was a concern that came up with residents that you know pedestrians are crossing. Motorists are still traveling through the streets and they're not seeing the pedestrians as they're crossing and one last thing we're going to try to put a barrier on 86th street on the northbound side, because that would let people decide before 87th whether to go east or West to avoid it if they get to 87th street in West, bend they get into a choke and they have to proceed westbound on 87. Yes, I was also wondering why there's no notice to motorists south of 87th street well in advance that this is happening yeah, but I mean we wanted to put a couple up on eight six in the west end, so they can decide yeah, let that comes it's only for the open streets from eight seven to nine. Six, no I understand, but a motorist at 78th might want to know that yeah I understand that, but I mean just for our end. Adult precinct we'd have to worry about that. It's a big job and also just to message to the community look I. You know I'm being asked: are there any other black associations or streets that want to take responsibility, because the open streets program has been so successful throughout the city and they're loath to close them? But again, if it's not safe, it's you know it is what it is, but I put that out there to everyone. If other people, if there's a community group out there, that wants to take responsibility for a particular block or area, please just let us know let D.O.T know, and we can really move forward on that. Thank you. Thank you. Helen. Let me call on some of our committee members before calling on the public William Ortiz. Please thank you Andrew. So you know my position on this Western Avenue Street is pretty much the same as it was back in April in May that my concern is on safety and for emergency vehicles to have quick access to homes. You know we're very lucky to be in New York City now, and a lot of us would not have did not feel the same several months ago when it was the epicenter of the world of Covid-19 crisis and to echo Helen's point that it is crucial for us to have partners to control traffic. If we go back to our community board meetings, you can easily find on YouTube. You can hear us say that yeah we'll have partners, yeah it'll be easy yeah. We can we'll have volunteers fast forward to today. It is not really the case and if we can have partners, this can be something that's very successful, but it seems like it's very difficult to maintain at this point, and Helen has spoken to plenty of neighbors who love it, but it's very hard to find those who want to support it and be there and do the work and maintain it takes a lot of work to keep the community together. Look at the board, we're all we're all different, we're all diverse, but we all still want to be here and I. Think that's really beautiful and important. So I think this Western Avenue, open streets should be retired at some point or at least have a game plan on when it should be retired if Covid-19 crisis and continues to increase again. My point of concern is emergency vehicles how it affects drivers. Maybe at one point we can get hospitals and drivers of ambulances to hear what they would like to see in the streets and how closures like this would affect them. That's all I have thank you. Thank you. Thank you! Ken you're! Next yeah, it's I think it's really unfortunate. That we have to have a community partner to maintain what is unquestionably a safer street and I'm wondering helen I think there would be much less need for a community partner. If we did three things one, the barriers were larger. We basically have the minimum right now wooden barrier on one side, which really does not send much of a signal to a driver, also much better signage from D.O.T, that's larger and more prominent, more visible and also how about if we make it 24 7. Why do we need this? You know why not have the open street overnight really there won't be that many people out there, but you know that's not really the point. The point is: it's a safer street and a better functioning state, yeah I ken I. Like all those ideas, you know, this is something that was put together because of Covid-19, and you know we're in a time. You know I support everything. You're saying- and you know that, but I'm what's screaming at me in my head- is the feedback I'm going to get when I reach out to city hall about this you know. Have you seen the budget lately, we are not going to spend money on signage, bigger barriers. Number one and number two, the police are really should not be the partner on this one, because this is not their part of their job definition and it has been unfair to them this whole time so trying to navigate all those things, and you know to the people in the chat who are saying: oh I'll volunteer, you know it's, not one person saying I'll, be there I mean it's. This is a very serious. It's a it's a long avenue! There's a lot of stuff going on and you know for those who are interested in volunteering I would urge you to reach out again to Peter Arnstein from the Columbus avenue bid who, even in the chat, is saying that he's created his own signs and all the things he's tried to do to make it work, but again he's there all the time. What's the difference what's going on and then to there's someone in the chat which is just making some silly comments, Annabelle winifred, saying something about the streets are closed for security reasons. To prevent convicted sex offenders from approaching students, I mean that's just silliness. I do not even know how to respond to that. That's not even the in the realm of I do not know that you should Helen. We have. We have. A lot of folks are waiting to speak. Okay, yeah you're on yeah I'll, just be quick and helen, maybe just addressed it, but I was just going to mention. There's a lot of people in the chat saying and not just that they'll volunteer, but I see that some of them are saying they have an organization. So I just was wondering if someone could address exactly if they have an organization who they should be in touch with just so they can. You know it's great to see community members stepping up yeah. Thank you. Sarah and anyone can email me helen, helenrosenthal.com and we'll get that information on to DOT right away and happy to have a serious conversation about it. Thank you, barbara. My own observation and I know people will dispute this and I do not want to get into a debate over it, but I think this area was always really underutilized, even in the middle of summer. I rarely saw anybody using it during the time that I used it as a passageway to walk up and walk down. Now, it's really totally underutilized, so I completely support. Andrew and William. I am very concerned about the safety there, as I mentioned before, the cars are whizzing zigzagging through those barriers and somebody's going to be killed there and winter is coming. There's really no reason to have this anymore without a community partner, I think it we should really shut it down. Thank you, Jay. You have to do. Thank you. Okay, there you go so I'm really astounded at what I'm hearing from people who are supporting maintaining this stretch of west end Avenue I have not heard a person talk about the effect it has on the residents of West end avenue, of course, everybody's concerned with safety. If closing down the streets and eliminating traffic was the primary concern throughout the city, we could just ban cars and I know there are some people, including some on this committee- that would love it, but it's not practical. This street was closed. Call it an open street, but it's really closed because ostensibly the pandemic, and the rationale was that people needed more space to maintain social distance from each other and to have additional space for recreation, because at the time there were limits on park space. Nobody in our district lives more than two blocks from central Park or Riverside park. The sidewalks on West End Avenue are generally 16 feet wide. There is absolutely no pandemic covered 19 reason to maintain the structure as it is now. West damed Avenue is a major north south thoroughfare. We need to have accessibility and the street, be passable for police, responding to emergencies, for ambulances, for fire trucks, for school buses, for garbage trucks, for utility vehicles, for delivery, trucks for contractors and, of course, for normal automobile use for the people that live on West End Avenue, but nobody is talking to people who live on West, Bend, Avenue Helen said that people have contacted her office to say how much they like this I contacted Helen's office to suggest that the time has come to close this and open it up to its normal operation and what I received in return was a pro forma. Thank you for your interest. Email! That's not talking to people. Excuse me hell! Let me finish well, let's do it! The fact of the matter is that you know we live in a busy city and the traffic on west end, just like the traffic on all the other. Thoroughfares is going to exist and it's going to continue and as far as the use of this by pedestrians, anybody who lives on west end or has walked on west end or has observed west end can fully appreciate the fact that the novelty of this open street wore off in about two weeks and on any given day and I've, sent mark some pictures starting months ago. There is nothing but a trickle of pedestrians who could just as easily be walking on the sidewalk and as far as what's this particular picture shows what happens to be going on now, and you can imagine what happens when cars have to access this little bit of space. That's left! Now! It's! Yes! It's a safety hazard. You have to be semi-crazy to walk in the middle of West bend avenue with. What's going on now, I park a car in a garage on 89th street, I'm fortunate to be able to do that. I'd, never use it within the city limits, I use it to leave the city or to come back to the city. I've tried to be a good citizen with this street and I, pull on to west end and then right up, 90th street to broadway into the mess of traffic and the backup of traffic. That's become broadway last week, I pulled out, I turned the corner and what did I see? I saw a school bus, I saw a truck, I saw a van and I saw two cars waiting in the northbound lane on 90th street and westland Avenue for the light to change the light changed and not one of those vehicles made a right turn onto 90th street. They went around the barrier like a slalom course and I said to myself: am I crazy? Why should I go to up to 90th street to Broadway, so I just followed along to 96th street and got on the West side highway, along with the five vehicles in front of me, I confessed to that and that's what's happening not to mention the cars. Hey wait! We when we had a homeless person from the Lucerne who wanted to speak his piece. We gave him 15 minutes now. I live on West, End Avenue and, like the other residents of western Avenue, be they renters or co-op or condo owners. We did not sign up to live in a park or a playground. There are people now working at home who are disturbed not so much now, because now it's pretty much empty, but at the beginning, my kids, making noise by people standing around yelling and shouting. This is a residential street we're entitled to live on a residential street. This there was never any reason to have an open street on West End Avenue. There is not a reason now and it's time to go back to normality. Thank you, Stephen perfect, to follow Jay, but so listen I'll, give a couple sort of just agree with a couple people and give my opinions. Helen I live on. If you remember in the 80s, 86 and Riverside I think that when the parks closed and these opening open streets initiative opened, I was happy with them. I can tell you that Lucas and my son went over there many times in the middle of the day, because we were going to kill each other and threw the ball around and sat down, and there was people sitting in the streets and some I remember somebody in 80th and 89th used to bring a little pool out put his feet in and I think it made a lot of sense then, and if we hit those times again, I would support it, but I think now that the parks are open, you just do not see really any pedestrians there. If mark you want to pull up, I should I just mark two pictures at 73 degrees out today. Two o'clock I just happened to walk over there just so that I would have some contact, not a single person. This is what the street looks. Like I mean. There's nobody sitting in the street I never see anybody in the street and again, if the park closed up again, then I would say: hey, let's do this, that's I was I was very happy. You did that I was happy that street opened, but I think things have changed and I think that's what a lot of people feel about it and my I want to express a concern. Is you know if and you can see, there's lots of construction going on too up and down that exacerbate the situation, so I do believe now nobody uses it from a pedestrian perspective. If you're a kid you want to go to the park if you're one of those senior citizens that are in the over on the over on the west Riverside and in between everyone, goes to the benches over there and they're, lovely and they're being used, but I would challenge anyone to kind of go up and down during the day and kind of see people squatting out there in the middle of the day and that's what I thought it was for and if there's so, that would be my that's my personal feedback to you great timing. Thank you for doing it. Time is ready to. I did not even know that these were issues as well, so I think the time would be. Let's take it down and for any reason we close up the parks again, I'd be all for doing it, because I do think people need to get out and I just want to express one concern. If, for some reason that you do not, you know, there is a reason that you do move forward. I ask that you get a community partner. That's a local community person. I have concerns that people who have bigger issues have been advocating open streets for 10:15 20 years and that's sort of their platform are kind of coming into this meeting and coming into this area and are going to talk about why they should keep it up. I would not want somebody living in Tribeca who's, trying to sort of take control of this or an association that does that I. Think most of the locals think that this would be the common sense approach that I speak to, but I just want to be careful of people coming in and advocating that really are not local people and if you were to move forward which I would want you to do, but if you did make sure it's somebody and I look at what Peter does I've been up? There he's done a great job, I love it. You know, I mean and I love all these things. I just think this is just a different one. It's not the same thing. It's not being used the same way. Thank you. Steve we're ready to take some community voices on this now I do not can I just introduce. We have yes go ahead, I wanted to make presentations, one is tag gross and the other is Christina Whale. What do you want to just do those first and then we'll have comments from the show. This is you know, howard and andrew. It's rich I do not have the ability to raise my hand, but I had put in chat that I do want to speak. So I do not know and then Christina absolutely I'm happy going after them. I just want to make sure I get no go now: rich, okay, a few thoughts. Okay I mean. Obviously there are differences of opinions. I personally, love open streets, I'm lucky enough to live on one on West, 103Rd Street, and it's just wonderful to be able to walk with more space, to be able to have more space from people who may or may not be wearing masks, and in general one example. My parents visited today from New Jersey. It was their first time in New, York city since February, and the open street was great because they're at an age where they just can't be exposed to Covid-19 I know people are making an argument of it's a matter of parks versus streets, and for me, it's not because it's a matter of being able to walk and get around versus being able to go to a park, and you know, do park things in a park. People need to be able to walk around the neighborhood safely, and a number of people made an argument that, because fewer people are using them, we should get rid of them. That argument does not completely hold water, because people are not using them because they're not safe and you get a vicious cycle if they're not enforced. If they're not safe, people are not going to use them, but that's not necessarily an argument that they should be gotten rid of. Definitely, cars ignore the barricades. The supposed five mile prior speed limit and the local traffic only rule. In my mind, the makeshift barrier does not give the impression that that's a real that those are real limits and that there are consequences for doing what cars are doing, which is whizzing around the barriers and speeding down the streets and I do not think we've seen any enforcement, so there are not consequences, and so it's going down that vicious cycle. In my mind, it's not long-term sustainable for things to be so manual. We need long-term plans both for open streets and outdoor dining and assuming we keep the open streets, we need a more permanent solution. We need five mile per hour, speed limits. We need speed bumps where they're possible, we need enforcement and we need barriers that are permanent and do not require people to slide them in and out of the street. The idea of expecting drivers to move a barrier out of their way and then get out of their car and put it back ai, not going to happen and I was impressed that captain Murobi told people that they should move the barriers themselves. I actually did that when I was walking tonight with my parents and there's that feeling of like I'm moving a police barricade or is this illegal for me to do this and your fingerprints are on it now they are and there's a question of you know: how do we get something: that's more long-term, sustainable on any open streets that we keep in effect, because what we have right now clearly is not working. So those are my thoughts. Okay again. What now that we're done with the committee? Why do not we take comments from the community and we'll start with two community members who had short and emphasized short? This really can't go more than a few minutes tag rose and then Christina Weil. Why do not we start with tag mark? Do you have the the slides to share? Yes, I just promoted tag, so he can be seen and heard, and I just promoted Christina, so we'll take tag first and I. Think I know where his slides are so give me a second I. Do not need him right away. Thank thanks so much appreciate it and good to see all of you again. I just want to quickly agree with what, especially what Jay and Andrew were talking about. If you're a West end Avenue Resident, you understand that these open streets are not necessary and beyond the safety issue. That's happening where the streets are actually closed. Is the issue of safety and livability in this the border areas where I live up in the upper 90s? So what we suffer with is safety issues that are due to traffic congestion, caused by West, End Avenue Southbound being closed and we end up having people running the Zebra striping we end up having aggressive driving. We also end up having excess emissions. We have horn honking. That increases stress all of the things that really the committee often talks about in the sort of anti-car verbiage we you're imposing that on us and part of it is this open streets during the summer? It did not matter because nobody was here, but as soon as labor Day happened, we started getting these problems and we're not anywhere near the level of traffic that we would expect and we're at schools, I think they're, saying schools are only 26 percent and one of the big traffic issues for us is a school, so the West end needs to be open. It needs to be opened immediately it. You know it's a very wide easy to walk on street, so I think Jay like really Steve and Andrew. You know I think they really articulated those points really well I wanted to with you know, howard permission. You know, I first came to you guys a couple years ago to talk about the problem happening in the upper 90s with all this traffic and congestion, I actually met with Helen and with Marisa, and she went through detailed presentations which I showed you guys, photographs, videos etc, showing just how bad it had gotten, and that's one of the reasons. It's surprising that you guys agree that Helen agreed to, and you guys you know, acquiesce or give you the stamp of approval. To put this thing starting at 96th, street and I was hopeful that there's someone from D.O.T here that there may be someone from the 2-4 here that can just if I'll go really quick through this and show you kind of what the problems are. Whenever you have people trying to reach the highway or trying to avoid traffic on the highway or avoid traffic on Broadway, it causes massive congestion. So right now, for example, if you look at 90 actually it's listed as on your birth, 96Th, Street and broadway, there are people trying heading Southbound or trying to make a right-hand tourney I have that one circle in the wrong place mark, so people are trying to get onto the highway from Broadway at certain times of the day. All day, long now, on that southwest corner in a no standing zone are a huge fruit truck and a huge cooking truck of some kind. They in a no standing zone, those should be being ticketed and towed and moved out of there, so that there's another lane of traffic available for the right-hand turn, because, as you guys know, we also have on 96th street. We have the we have the construction project going on. So the construction project now is actually encroaching on not only taking the one lane they have but encroaching on another lane. So there's two areas right there which are causing major traffic slowdowns. Then, when you end up having any kind of southbound track well the result of all this traffic southbound, it will divert up it up at the top of west end and come down west end to try to avoid the broadway traffic, because there's only one lane getting through on 96th street effectively. Then, if you have southbound traffic on the highway, you have an exit at 95th street and now, with the exacerbation with open streets, people see that 95Th street eastbound is blocked, Riverside drive, southbound is blocked, and what they'll do is they will zip up? Riverside drive up to 97th street up the access hill at a high rate of speed come across. I'm sorry, 98th street come across 98th street and then be in gridlock and start blowing. Their horns running into they're, literally blue people on the Zebra striping, and you have all the people coming from 97th street, including buses now trying to make the turn on to west end, and you have two points at 98th and west end and 97th and west end they're completely gridlocked. So this gets exacerbated because traffic can't pass through 96th street southbound anymore. Then you have the issue: that's been ongoing for so long, which is the issue of right-hand turns at 96th street, even now with school, not really in session and crossing guards there sort of intermittently it's very bad and again backs up traffic, and this is happening a couple of times a day. It can happen on the weekends and all we're doing is we're encouraging aggressive driving, we're encouraging emissions to be let out and we're disturbing everyone's quality of life here on the in a really stressful way, on the upper West side and there's some very easy solutions to all this. You know one is open up, West end Avenue already. We do not need it closed anymore. It was great when there was no one in the city and the parks were closed. There should be like a no left turn onto Riverside off of the exit from the highway at 95th street people should not be allowed to get off the highway there and make a left to try to do that zip up and around. We also one of the really important things is. We have to figure out a way to put a right hand, turn arrow onto the onto that southbound at 96Th, Street West end in 96. There has to be a green arrow and there's no reason now. There's a left hand turn arrow. There's. No reason why the right turn in the left here and arrows can not go at the same time. If there are pylons put in the middle, it's basic driving, you make a right hand, turn into a right hand, lane a left hand turn into a left-hand leg and there's some. These are some very concrete thing: the enforcement of the no standing enforcement of these construction lanes, the opening of west end and then looking at signage, to prevent some of these turns and also to really look at doing this era. But in the meantime, please initially you can open west end and alleviate real safety issues for us that are up above this barricade at 96th street. That's it. Thank you tag now, we'll hear from Christina who also has a presentation and then we'll hear from community members who do not have their own preaching pages. Christina hi, my name is Christina Weil and I'm joined tonight with my colleague and Neighbor Jessica Spiegel who's been working with me, I just wanna. You know we all like data and I'd like to share. You know what some of the community are saying: Jessica and I joined together just two and a half weeks ago to we can just skip I think mark to maybe some of the slides that have the data on them. So if you go down a little further, tell me which slide keep going, keep going ten. We can start with ten I think so. Jessica and I as I said, started to put up flyers on the barricades on Weston Avenue. We walked up and down. You know the street western Avenue I. Think we've heard a lot tonight that the current instance of West End Avenue, open streets is not working, but I think that you can see in the data that we've collected and right now we I'm showing you data. From a week ago we had 275 respondents. We have well over 150 more responses. Since I cut this data, you have a very vocal minority who you know like a quarter of people who do not like this, and they do not like it a lot based on a net promoter score, but you have over half of the respondents who are nines and tens who do like this in some way and I want to. You know, keep going down here, just to show you some of the concerns that people have had people like the ability to have more space to seed, reduce traffic on West End Avenue, to have the opportunity to chat with neighbors in a safe way and a lot of people like that. The street is quieter. You know. If we go to the you can see some frustrations that people have had. These are things that people have brought up already, that people are ignoring. Drivers are ignoring the barricades that people do not feel safe, that the signage is not clear. We all can agree that the signage that is on these barricades right now, if the barricades are even standing, is not good enough and then. Finally, if you go to the last slide, people are curious about what else could be happening on these streets, and you know with all due respect to the drivers this, if it is done well, I think could be a really wonderful opportunity for for safety, for safe socialization, for people to have community, and I'm also going to add because I know this is brought up by many people who are on the committee. These responses are p, who live on Western Avenue. These are people who live in these buildings. I have their addresses they're on cross streets they're on Riverside. So it is unfair to lump in and say that all residents of Weston Avenue do not like this program, because that is not true and now, if we can go down a little bit further, Jessica and I are proposing with community support and right now we have over 150 50 people. Who've signed up to support the idea of continuing open streets in some way, not necessarily keeping it open on. You can go to maybe slide 15. We are proposing that perhaps the west end open streets be made weekend only in the winter. We agree that they're not safe right now. It is not safe with the commuters who are not paying attention to the barricades, and we perhaps you could in a modified scope, have it only open on the weekends. This would reduce NYPD. This would their manpower setting the barricades up. We could reduce the length to address some of the concerns about people being able to get onto the highway, I'm in that 95th to 96th street stretch, and if we could go to the you know, there are just some basic things that we think could help improve the situation. You could have double barricades on both sides, because, right now, cars are using it as a slalom course and on the weekend there is, you know, just less traffic. We could also, as people have said, have better signage, that just five miles an hour is I, think the most important thing here and to really help educate people that, yes, if you live on the street, you can drive through at five miles an hour and you can drop off a person. You can pick up a person, it's not that the street is closed. It's just closed to through traffic and Jessica and I have been talking to other open streets coalitions that are done on the lower East side that are in north Brooklyn. Some of the issues that they're facing. We really do hope that the community board will seriously consider this proposal to modify it. We agree it should be closed during the week and I. We are happy to share the data that we have collected with, so you can see with your own eyes what your community is asking for. Again, it's a vocal minority who are car drivers who and people who are frustrated with the rules. They have not been clearly articulated so I think that's what I have to say. I do not know if Jessica can somehow become a presenter and ask or add anything she has to say I just asked Christina are you do you live on? Do you live here on the upper West side in this area too? I do I live on 93rd and west end and I have to say the sense of the sense of community that we have built as a result of this open street and has been building since the spring I mean like so many people. We went out on Saturday to celebrate and 93rd in West 10 was an epicenter of people out. You know cheering and clapping on Saturday and I felt really fortunate to be part of a neighborhood and I think that the open street does help increase that sense of neighborhood. Thank you hi. This is Jessica. Can you hear me? Yes, oh hi, so yeah I, just you know, Christina did a great job. You know I think, and you know honestly, like we did. I live on 95th and west. Then so you know I. Think especially. You know. We see the rise in Covid-19 cases. So I understand. You know that people are saying: oh, it's great in the summer time, but you know I think winter time your apartment starts to feel small again. So I think you know, weekends would be great for us to be able to just you know, walk around and you know I know some of the other members had said that and I think that a lot of the comments that we even saw in the survey and that I've heard tonight are talking about well I, do not see people using it and it's a huge question of chicken and egg people do not use it. I do not go out there like I used to because people honk at me. People are trying to run me off the road. Quite frankly, so you can't use it right now and that's what we're trying to do, and you know we just started this process. So you know we're this. The idea that there's a community partnership like we like we, you know we just started this. So that's. Why we're you know we want to work with NYPD on this. We want to work with all the D.O.T on this and everything so I think that we're here for this we're trying to build that community, because you know when Christina and I met. It was just two of us and you know so I think that's why we wanted to come here tonight and show that you know, even in just a short time, we've been reaching out with surveys posted on the barricades, like we've already seen like a huge like outpouring of people who wanted to do that, and you know we had never heard that we wanted that people needed to be part of this. You know this just came to us and it was great and so I think it's great that you know I hope that you guys will consider this. Thank you. Thank you. There are a couple of other people in the community, who'd like to speak, Anthony Brown. You have to go and meet yourself anthony. Well, if anthony is not there, he should be there in a second give him a second anthony, unmute yourself. There you are, you almost did it do it again. Almost can you hear? Can you hear me yes, hi? My name is Andrea Katz and Anthony Brown we're married. We live at 685, westin Avenue and we wanted to say thank you very much for allowing us to hear this discussion tonight and to give Christine and Jessica a huge amount of support. We believe in the data here and the data talks a different story to the emotion here. So there is a subject: subjective versus objective content and we'd love to have the objective content, meaning that data help drive a solution here, whatever that right solution is and we're not experts, but if open streets is not going to continue. We'd like to ask that the actual traffic flow on West End Avenue be considered because for 30 years we've seen, traffic on west end become a fair nightmare, especially like at night when trucks, roll down, West, End avenue and buses roll down, Western Avenue. So in the event that open streets does continue great and there will be some solution and I trust Jessica and you know, and members of the Comedian and Christina to move that forward and with our support. But in the event it does not, could we please then table what actually happens with West end traffic, because Broadway is often empty and west end avenue crawling with commercial traffic at all hours? Thank you. Any other comments. Questions criticisms, mark thanks. I did want to weigh in on this just a little bit and I have just a couple of points that I'll try to do the thing where I add, without repeating what anybody else said. One of the concerns that I have with respect to the open street and I think that we talked about this last spring was anything that adds to the workload of the NYPD, especially at this moment is not something that I think is sustainable and so I think that we need to be very careful about about relying on the NYPD to do the work that I understand. The partner was supposed to do. I'm also concerned about construction, especially in the 90s on Broadway, there's a lot of different active construction sites there, and sometimes they require closing off travel lanes to traffic, so that cranes can operate or things like that. In those circumstances, west End Avenue is needed as an alternative, especially for southbound travel and I. So construction overflow is kind of an issue that we have not talked about here, but is unfortunately a necessity, and the last thing I'll say is that the in the rush hours in the morning in the evening there- and maybe tag referred to this so I'll- be brief on this, but construct but rush hour traffic on West, End Avenue, either going to or coming from the highway results in. A lot of I was up there this morning, just to take the take the pulse of it and it backs up from 96 to 100th almost every morning and and it also backs up going south in the evening and that results in horn, honking and congestion and so forth that I find problematic for for neighbors, and so so anyway. For those reasons, I, I'm very concerned about the weekday use of the avenue I had not really considered about the weekend. Those are my thoughts and I just wanted to share them. Thank you mark. The only thing I'll leave everyone with is Councilwoman Rosenthal has said: if anyone is willing and able to volunteer to man these barricades to definitely contact her office and with that colleen wrote that in the chat too right maybe cc, both people right can I agree, though, on this call as a message to colleen, although she may have to run it by city Hall. You know the notion of what detective Mcdonald recommended about closing it at four and yep yeah, and then the other thing I heard was that the groups who possibly could organize agree that it should not be open during weekdays. Do you think is that is this the lowest hanging fruit we can start with. Would everyone feel comfortable with that and no I'm, not a member of the Community Board mark. You should be asking that question, but I'm sorry, I have colleen here on the phone yeah I mean I, do not see why that should not be considered. I mean I. Think it's a great idea to even consider you know doing this on the weekends. If that's the case, I mean just as a compromise yeah, but can we agree the lowest hanging fruit is? Let's definitely can you can you make this happen like or do I need to reach out to the mayor's office? What let me discuss it with borough, commissioner pinkar I'll, send him an email after this meeting and we'll have an internal discussion and we'll get back to you in the Community Board. Okay, that'd be great, because I can't sleep on Friday with the response it just so exactly what is being proposed right now, I'm just hearing everyone. This is not a final at all, but hearing everyone. There seems to be universal agreement to open up West end avenue to cars during the weekday not have the barricades up. What was the 4 pm proposal to close it at four p to to open the street at 4 P.M, because it was it's so dark I see we're not seeing pedestrians right. Those seem like the two things that everyone agrees with and then we'll you know plea of course, if there's some sort of organized program for the weekend happy to look into that. Okay, thanks colleen you're, welcome councilmember and thank you Howard and Andrew and Mark and everyone. Thank you Helen. Thank you, Helen very helpful. Okay, the next, unless there's anything more on that next thing is follow up on outstanding business. Does anyone have any? Let me, let me add something howard. Okay. At our last meeting at our last meeting, we had a lot of folks expressing their concern over helicopter noise and what was causing it. If there was any enforcement I reached out to EDC, who, let me know that they are not in charge of mediating this, but they did say they reached an agreement with tour operators where there would be far fewer of them. I am going to reach out to stop the chop and anyone else who can get me the name of the current tour operators they see with binoculars, telescopes or whatever and see if that list concurs with what EDC thinks is operating apparently yes, andrew, if I could just add, I did do a call unrelated with the stop. The chop. People I do not know I. Think Andy Rosenthal was on the call earlier. I do not know if he's still on and wants to add anything but I, specifically in my non-cb capacity, had a conversation with the mayor of Jersey City, because a lot of these helicopters are coming from New Jersey, but not Jersey. City they're, coming from Linden I think well, they're coming also from Jersey City, and it was made very clear to me that it's you know federal issue, talk to the Faa talk to Congressman Nadler, so anything we can do on that front too. I just wanted to relay it. What did mayor phillips say he said, he's happy to help, but he thinks that it's a federal issue and we should you know, he's sort of so well. That's good. We've got to stay on this because it's rampant, it's not as it's worse than the motorcycle rampages that that you heard described earlier and it's potentially dangerous and we have to as they are and we have to get we got to get a handle on this I can also give you some updates on some MTA things. Apparently the anti-microbials and the ultraviolet light that has been tested out on the subways has not proven as effective, as was hoped, but the the new air filtering which uses electrostatically charged particles to clean the air, is becoming a wonder. It not only cures or takes Covid-19 out of the air. It even takes the common cold germ out of the air. It is being currently tested on Metro North and the long island railroad, and if successful and all indications are that it is, it will be put on the subways and buses and I'm guessing that even stores restaurants and theaters will one-up. Schools will want to put this in their ventilating system because it is so effective at killing these germs, so stay tuned on that one. Obviously, on the issue of funding the MTA, we are all waiting with baited breath to see when the transition will take place if the President-Elect can do some sort of interim funding. In the meantime, the MTA is investigating borrowing more from the municipal credit facility which lends to cities, but is allowing transit systems to also borrow money at a pretty low rate, not low enough. Some members of Congress are trying to get it lowered even further, so that when we have to pay this back, it is not even more onerous requiring even higher fare hike. The MTA is likely going to vote on its budget at its December meeting. I am told I'm getting a briefing next Monday that there will be two presentations, one with federal aid and one without and the one without is just horrific. Forty percent service cut on subways and buses 50 on commuter rail, 8700 layoffs, indefinite postponement of the mta's capital program. Nothing gets cheaper the longer you wait, and it's just a horrible scenario, so we're all very hopeful that there'll be some important and beneficial changes coming out of Washington Andrew. Yes, just want to add that if we do indeed have a change of leadership in Washington that things are looking much better for congestion, pricing I would assume. Oh yes, yes, the Department of Transportation has over 10 months now, not given the Mtn answer on what kind of environmental impact statement or environmental assessment. They need to proceed with that. It is abundantly clear that, with a new president, we will get an answer very quickly and that congestion, pricing and all the money it contributes to the mta's capital program may proceed not to mention taking much needed traffic off our streets. How quickly could congestion pricing be up and running? Do you think if we got an answer in January? Well, he only takes office January 20th. So if we got an answer by February, I think it could be in effect by the end of the year or maybe even September, depending on how soon or I think all of the the readers have been installed already in anticipation, but I will find out, that'll be very interesting, rich and then Doug yeah. A note, I put in chat I feel like we had a very lengthy and contentious discussion about open streets, and then we just abruptly moved on and I know we're not going to get to a consensus. We're not going to get to unanimity, but I think we need some board resolution that gets approved so that we have some guidance of where things go, and you ask: what's the resolution we as a board at the very beginning of the crisis, call for more open space? So what's the resolution that you are you're proposing a resolution? Well, we need to hear from you from D.O.T and what Colleen and Helen are going to find out yeah from the mayor's office and all of that yeah. It sounds like if there is not a partner, then there's nothing to resolve, but do not. Let me stop. I'm sorry, that's well. It sounded to me like there was kind of a de facto decision to make it weekends only to make it 4 P.M. There was not a discussion about seasonality. Does this? Is that a year-round decision is that just for the winter and then does it change and I think it would have more weight if we as a board, you know discuss especially those three things of you know: weekdays versus weekends, the time that it would close if they do stay open at all, and is there a seasonality component to this yeah I really appreciate your bringing those up and, of course, defer to the board when I spoke about it. I was assuming just for the winter months and that you know dependent on Covid-19 dependent on so many things that we re-evaluate when the seasons you know it starts getting lighter and it's a different situation again. It starts getting lighter December, 22nd, yeah I meant like may April, or maybe like so I, but you're right, rich I did not ask for anything formal. It's that's I turn over to the board and that's a question of. Would it have more weight if we did do something formal and obviously there's it's highly improper to propose a resume? Can we talk in order at this hour without public notice? First of all, this is clearly public notice. It was on the internet public. Second of all, there was public notice of it this day. I'm talking not a resolution. Okay, I'm talking I know, I'm talking you talking, you've been talking, hey, go ahead, rich, okay, and to be clear, that was not me who just muted Jay, but thank you. Whoever did so I think that you know, given that there's disagreement and different people claiming different views from the community I think that we should have a board resolutions that, as always, majority wins and I think you know if I'm in the minority so be it, but I think we need to have a view of the community. I'll refer to Andrew and mark I do not really see what we would resolve at this point. We need more information. There's a lack of a community partner. Yeah I would like the information yeah we're on record as being in favor of the open streets. So I do not really see there's what we can do at this point. I think Helen and colleen have a good sense of what the issues are and I think we should await more information mark and Andrew. Do you want to weigh in on that I agree with you, howard I would like to get more info, and and and also if there's no community partner, I think that answers that in many ways Doug did you want to say something. Yeah I mean well. I was going to say something before about about the opposite. Just that a neighbor of mine asked to me to mention that, apropos of possibly closing it earlier in the dark, there seems to be a problem. She lives on West, End Avenue, with her she's, a single parent with two daughters and says that regularly she hears cars striking the barricades at night and it actually has woken her up multiple times. So I am concerned about the lack of visibility and signage, and then now you know being that it gets dark at 4:30. My I would support shutting it down earlier, that's all and then, as the season comes back and the daylight comes back, but that was not why I raised my hand but on the new business I guess we're following up Andrew. Perhaps you have not answered this. What's that this is old, okay right, so this is actually all business. This is something we discussed last month. I do not know if Andrew, if you had a chance to go back to the board or ask about the enforcement of masks. I am concerned. Now we have an uptick in New York. We actually have a slight uptick in Lincoln Square and I am personally non-scientific observing on the M7 m11 M57 M51 M104 and the 123 subways I have yet to see a single MTA officer. Anyone approaching anyone not wearing a mask, in fact I actually on a southbound 104 saw the driver without a mask and very politely asked him why he was not wearing his mask and he told me in the most snippy of tones get behind the white line. He did not have his identification on I have his bus number, but he was not wearing a mask and he did not wear a mask for about three miles that I took. You give me give me that number when we're offline, Doug and but the question is what is: was he in his plastic bubble, though? Well you have the plastic shield? Yes, but yes, but my question I mean that's obviously seems to be an anomaly. Most drivers are protecting themselves and others, but I am I have yet to see any enforcement and I regularly see people without their masks and I'd like to know to date how many, how many summonses have been issued, how why we have an uptick now? Why? If we want the MTA, we want people to support the MTA and to come back and feel safe. Besides this incredible technology that you described, which I'm really excited about, where is the enforcement I am okay? I can answer you I have seen a few enforcer or NYPD tell people to leave without a mask. I saw one actually at the 96th street station the other day tell somebody you're not getting on this train without a mask. They left the station. Mass compliance is relatively high in the 97 to 99. Now, there's occasionally somebody who does not have their nose covered, unfortunately, or has the mask around their neck, which does not help anybody, but it's very high I would also give you the ease of mind that in a subway and bus there is a replenishment of the air so frequently and the Sam Schwartz company has even issued a report. You are much safer in a bus or train than you are in a in a store or a restaurant because of the times the number of times per hour that the air is replenished. So, yes, we want everyone to wear a mess, but it does not mean you're going to get something if you do not, but obviously we want everyone to wear a mask yeah and actually it was an Hvc specialist that told me and he's not an MTA HVAC specialist, but in the rear of the bus. There's a there's, a intake that pulls back the recirculated air if you're, actually sitting right behind the intake, all the air, that's in the bus is going to your face to suck back to then get recycled. So actually, if someone is not wearing a mask and they're talking, you know that particulate matter actually comes right back into your face, so I, just I just have not seen anybody doing it and the bus drivers who I've spoken to most of them have been very polite and kind, have told me that, unofficially, they are not allowed to really intercede with anyone, no they're not, but they can refuse, and they can call take the bus out of service, but that's obviously very impractical, so anyways thanks I can I can get you. The breakdown of enforcement on bus versus subway in a day or two people have to be safe and feel safe in order for the absolute impact. Thank you any other follow-up on existing business I have one colleen and at the beginning of September, the board asked for a better plan for 70 West 72nd street I was wondering what's going on with that hello yeah was to reconfigure 72nd to make it more pedestrian friendly, install protected bike lane right now, 72nd street is I. I'm down that street very frequently. Now my memory serves me I think we are still looking into that. Yes, our bikes division. Let me follow up with them. Actually that makes a lot of sense, Colleen yeah, and we asked for really a rethinking of the whole street. It just does not work the way it is now. When could we expect that to that plan? It's been over. It's just been over two months and especially given Covid-19 that you know there's much more use of the street and it's a major and his colleagues. Let me find out from Ted Wright and his colleagues and I'll get back to you. Okay, you'll get back yesterday really quickly. Colleen I also want to bring up the fact that we should definitely consider the m72 bus I recently took the m72 bus from 66 in Weston Avenue, trying to go to the Upper East side and halfway I gave up I got off on 72nd street road to city by across town, so riding the bus was not fun going through 72nd street, so I think a bike lane is good, but I think the bus is way more important to get fastest group of people across town. What was blocking the bus? Was it traffic or it was double parked trucks taking up the entire lane. You know there is a wall of double parked cars on both sides of the street. There is a wall of park cars and there was a wall of double park, traffic supporting local businesses and one lane for traffic to go through, which was the bus. So, as a person who rides the bike, frequently I find it more suitable and appropriate to have bike lanes on 73rd or 71st, not 72nd. It's too busy the streets are too narrow. It's we can do it, but we will just then the whole street would have to change completely, so I think the bus lane the bus is there I think a bustling would be more appropriate. In my opinion, we already fought. We already fought that battle. We had the Community board voted overwhelmingly for it and the the resolution included a call for more loading zones than 70 seconds. That's fine! I'm not calling for a new resolution, I'm just bringing a point of information for Colleen and the just the Department of Transportation to do more research. It's up to her to listen to our resolution. We will once we have a proposal, we'll come with all that information. Hey William. Thank you, yeah others have told me, and I've made the suggestion from where you were going from 70 from West 72Nd to East 72nd. It's actually faster to take a downtown two or three express to times square and an uptown queue to 72nd. And second, you would not believe how much time you save yeah I actually was considering taking the n66, but I had to be in 79th street, but guys this is. We have a lot to do here. Just let me make me add that colleen we really look forward to something great. None of us are traffic engineers. You work with traffic engineers, we're looking for something great any other new, any other follow-up. One has your hand up. Oh Helen, Rosenthal, our council member, oh helen I, just want to is Doug Clyman still on hey Doug I wanted to respond to something that you said just to have the opportunity to do it. We've looked in to the high percentage of Covid-19 cases in 1069, we spoke with the Department of Health about it, it's apparently two families. So it's not a community spread issue. It's literally two families there, the population there is pretty low, but it's nine people out of 260, some that were tested and all of that information. By the way everyone can find on what on the DOH website, it's really quite great. They get into details by zip codes. So for anyone listening not to worry about 100 69, there are some very worrisome, zip codes, but that's not one of them. Thank you. Thank you. We have rich robbins and then Jessica Spiegel from the community would like to speak rich yeah. Once again, we moved on and I want to propose a resolution, just see what people think about it, but number one. We continue to support open streets, we support making them weekends only for the winter. The daily ending time should be tied to sunset. We call on local partners to support the open streets. We call on D.O.T to add official 5 mile per hour in local traffic. Only signs we could discuss whether we want to call an NYPD to enforce the open streets. I did see someone posted in chat that they want nothing to do with it. So that's a question and we might want to ask Helen and DOT to consult with CB7 before making any changes so curious. If people think that's a worthwhile resolution and if so, if anyone seconds it, is there a second? If there is no second, we do not go ahead with it. Okay, Jessica Spiegel you're, going to have to unmute yourself. Jessica already spoke what oh sorry I thought it was a new hand, any other any other hands up mark, because I do not always see them. The there was a hand up before. Maybe we should call it Jessica quickly, just to make sure it's not on the same topic. So I'll just ask you to unmute this time. Oh, no, sorry that was not leftover. I did not know I needed to unraise my hand. I'm sorry very good. Thank you very much. So there was somebody who wanted new business and that was sanjiv. I'm sorry is it meta. Sanjeev meda I can't seem to find him now, of course sanjeev. Yes, do you have him? Can you answer him, but Sanji? Can you unmute I'll hear you here? He is, let's make him a panelist and I do have some slides of his if you'll allow me to show them, but it's a very finite issue and I do not propose. We spend a lot of time on it, but I think it's fair that we hear from him because he did try to. He has been hanging around for new business. Yes, thank you for the opportunity. There are two of us on this issue on this call. We represent five Riverside drive and 11 Riverside drive and we sit on 73rd street between Western Avenue and Riverside drive. Our building I am a director of the board of the building. Sits all the way from west end to Riverside, and five Riverside drive has about half the block on the opposite. South side of the street, both of our buildings have their main entrances on the street and not on the Riverside. There has been a long-standing problem that migrated to our street about a year or plus ago, where we get a line of taxi cabs that, during the covered, obviously went away, but it's starting to come back, and this creates a significant issue for our building, because on off often- and this happens regularly, whenever we have a lot of elderly people, ambulances can not get through on our building when cars are double parked and this double parking is created simply because of the accessibility of our street that the New York Police Department, somehow was ordained double parking legal on our street without any signage or any indication to the local community. Our submission is that it would be easier if this is what the city desires for them to allow these cars to go park on 72nd street or use Riverside boulevard south, which sees almost no traffic and the west side of that street does not block any building. There are a thousand plus people who live in our building and there's a significant number in these buildings across the street and our delivery vans can't get through the Post office guy has to either park on Riverside, which is a problem or he double parks on West End Avenue, which, at least in the rush hours, which is when he's sitting there for two to three hours, creates a huge problem on western avenue too. Is this only certain days of the week? Is this related to the mosque and its services? Yes, it is related to the mosque, but it started off as a Friday thing. Then it became a daily thing to the point where halal vendors started setting up shop on the street and yeah. Our fear is when you go back to full service levels, they're going to be there every day from 9:00 am to about 8 pm fridays. It gets really bad yeah Friday's the day. I expected it would be bad, but it's it is full every day of the week you can walk out anytime in the afternoon, and there is chaos on that street vans come in. They think they'll get through. They scrape the cars on the sides they try to back out. Children are coming and going at about that time from school. This is a major safety issue. Clary has brought it up. She lives right near there yeah. This is. This has to stop. I mean I. Do not know of how many other religious reasons people get I do not see this happening in front of any other religious community. The synagogues are open, the churches are open. You do not see parking all over the place simply to accommodate this and the police just simply says we're not going to do anything about it. I've talked to patrolmen, I've talked to cars parked over there and they say so. If there is an official city. Edict show me the legal edict under which this is allowed to change the signage on the street and say double park at your will and make it open for everybody. Then. So we have delivery. People coming in, let them be able to double park without getting tickets. Colleen. Are you still on, or did we lose them? You've heard you've heard this complaint before from there. I have I have how many times I'm you know, bolts back to enforcement. Well, are we going to wait till somebody dies because the ambulance can't get there? Hopefully not, hopefully not exactly then I will raise this with the we'll raise this with the 20th precinct again but signage may we may need certain kinds of signage too. What are you going to say on the sign that you are allowed to double park here? No double parking, not permitted. You know or set aside a space, like you said, on Riverside south, where they're Riverside boulevard south, where there are where there are spaces. It is a much wider boulevard, even 72nd street, where they used to park earlier. We used to see them parked there. Then the police started enforcing no parking on 72nd street and happily gave them license to park here, and all of this seems to have been very informal with no notification to the residents and world. So Andrew. Would you like me to just give the two minutes? Oh yeah sure helen I did not know you were yes sure, so there was a lot of community outreach. Actually, this became a major issue two years ago and the police flyered every single building on 70 west 73rd around you know from west end over to Riverside, West, 72nd and West 71St, and the decision was me and yes, it was because it is because the mosque is there and there are two mosques that driver taxi drivers can stop at once. Sorry, there's a fly a and one on the Upper East side, one on the upper west side. The upper West side is the one you live nearby and during the time of when the muslim ban started when trump came into office, there was a lot of discrimination against the taxi drivers and against Muslims in general, and there was crazy they. It was more the case that the taxi drivers came to the mosque on West 72Nd to pray yes, five times a day and the decision there were many meetings about this. I'm sorry if you were not involved, but there were many meetings about it and different solutions tried and what the NYPD finally came up with, as the best solution was to encourage the drivers not to double park on West 72Nd, because that is the entry to the highway, but to use Riverside boulevard freely and you'll see that there are taxis lined up there. They are only lined up, let them out, please let her finish now and use West, 73Rd and West 71St. Now, if you're saying that's, not happening and Clary's bringing it up again as an issue, we should I'm. You know appreciate coordinating this with the community board. We should bring it up again with the 20th precinct and you know we should revisit the issue, but this was an agreement made between the mosque, the 20th precinct and the neighbors to do just this, and you gave me Riverside boulevard as opposed to Riverside drive right. We represent, we represent the 73rd street, which is Riverside drive, not boulevard. Yeah we represent, 80 percent of the population is on the drive, yes drive. Yes, the point is that it was to be moved over to the boulevard and again is that a safe walk? If you parked on Riverside boulevard to get to the mosque, you do have to cross a lot of traffic, but there are no lights and what happens you have to cross one traffic light. If you park on the west side of Riverside boulevard, you can park all the way down to 60th street yeah I mean one of the problems. With this there's only one traffic light you would have to cross out. Let's let the council members speak, please you know it's 907. This and I do not mean to hijack your meeting. I could actually talk about this for a while, and I've been waiting all evening to get this issue tabled, yeah. No, we should and I represent a thousand people. You do not mean you've waited to get a table. You've waited to get it heard, which is what we're doing right now. Well, he does not want it tabled, Andrew, you're, great, so no I. We should bring it up again. I mean we have to I'm grateful that you would do that yeah. Let's talk to all the parties again, yeah and I would love Andrew. You know for your committee and howard to be a part of this that we are helpful. We absolutely will yeah I've seen this problem myself yeah and we will get back to you sanjeev, when we, when we hear news well, I, would hope you will get back proactively or maybe you can be invited to the meeting. You should come to the meeting sanjeev. Well, my contact details are now with you. Okay and right. It's a very simple email address at schwabhouse.com. We are a resident community. Yes, okay, we have 650 apartments and you know another 100. So across the street, yeah I mean we are talking about 90 of the population that is on that street and we do not feel we were adequately consulted or informed and I sit on the board of the building and I had no clue. You've heard if you've been on listening to this meeting tonight, you've heard that safety is a priority of this committee and this is a safety matter and we will be moving forward with it. Excellent. Thank you. Thank you. Thank you. This is the beginning of the solution. Ken has this hand up no okay, Chris I'll go ahead and yeah right. Okay, let me get him ready to speak, go ahead, Chris hi! Thank you. While we have the council, member and Miss chattergoon I wanted to get some help or guidance for the construction site on 65th and 66, which judge Ngron voided the permit for at the end of September. It seems to us in the neighborhood that we should be able to have the sidewalk and streets restored, as well as the crane taken away. There has not been work on this site for almost a year and a half, and now they have no permit so could and we've had a lot of support from CB7, and we appreciate that, but we're hoping that we can get some help or guidance from you on what we should do to move forward with this and if I could just add to I'm sorry hell. Just let me just add one more thing: you probably have it somewhere in your inbox, but we wrote a letter to the commissioners of the borough, commissioners of transportation and buildings, making the case that, since the permit was revoked, that there's no basis to have these obstructions on a very busy corridor, both the crane and the usual construction fence encroachments. So that's the back drop there mark. Thank you! So much. Could you bump that up and resend it? As you know, I'm between I just have a new chief of staff starting and so there are emails that are slipping between the cracks and I. I'm happy to help follow up on this issue. So thank you for bringing it up, Chris and, of course, you've done a yeoman's job on this Chris. Thank you and thank you for your help. Yeah anything else. I did now. I have my hand up okay, Ken, just getting back to the West End Avenue for a second would it be? It sounds like changing. The barricades at Sundown is going to happen, and so I'm just wondering if we could ask Helen and colleen if they're going to be doing anything beyond that to come back to us. First yeah that yeah, we would clear whatever information we have with the community Board yeah before a decision is made about the weekend or about the low hanging fruit. We're done yeah you're calling about the weekend yeah, definitely about the weekend. Sure absolutely, in other words the termination of it for just something else: yeah and can I get 100 emails a day, but text me you have my cell. So if I do not bring something up, just text me, it's not a problem. Okay, thank you. Do we have a colleen or anybody are there reflectors on these barricades? There are. There should be yes, especially now that it gets dark early, yeah, they're, very light, they're really hard to see. Yeah and they're, not I mean not by having Peter. You know, make his own signs and sure they're up and watching it every day. You know that's what's needed yeah and it does not sound like a big expense item. There's one more community member who'd like to say something k, Kojima I, hope: I did not mangle. That sounds right: okay, I unmuted! You have to mute yourself. Can you hear me? Oh, we sure can oh great hi everyone, I'm Ke Kojima I! This is my first time joining this meeting. So this has been quite interesting. I'll make this pretty short because it's gotten pretty late and I'm almost ready to get off this call as well. I joined today's call because I'm a new biker, I'm a new CitiBiker I've, never biked in the city streets before it's way too scary, but I also do not want to I'm because of the Covid-19 thing. I was too nervous about riding the subways and I've actually gotten quite used to biking now in the streets. So what happened? I wanted to share my experience with you about what happened to me. Last Wednesday I was biking out of the central park on 100Th Street and, as you know, that's an entry point or exit point that bikers can use. You do not have to dismount your bike. So I'm on a CitiBike and I'd like I was wanting to dock it on 100Th and broadway. There is no good and safe way for a biker, especially a new biker like myself, to go westbound from Central Park West, so I did take a chance and I knew that I was doing the wrong thing by biking in the wrong direction on 100th street, but I've seen tons of people do it and frankly, I was pretty much just following everybody else. Out of the park going west on 100th and I got stopped by cop in front of the 24th precinct and I got ticketed so yeah. It stinks that I got a ticket, but that's not really the issue that I'm coming here to talk about. I'm like the issue that I like to talk about is: has there been any conversation about biking paths that go westbound, that's safe somewhere like something that can be accessible by bikes between 97th and 106th, because I know that 97th does go westbound, but I've tried it and it's scary. There are there's traffic shooting across from the transverse and the the 97th street narrows once you hit Columbus avenue. So then you're, you know really tight in there with all the traffic and then going up to 106Th Street I mean there's got to be a better solution. Also, I think that I know that there's also a lot of complaints about reckless bikers and I'm one of those complainers too, like I, have biked up Amsterdam avenue and there are people on electric bikes. Whizzing downward I mean yeah down opposite the direction of traffic, sometimes they're on their cell phones. And so that's you know disconcerting as well. So I wondered if you know I got ticketed, because you know there's a lot of complaints about these reckless or dangerous. Bikers and I. Do not think it really I mean there must be. There must be another way to address those bikers other than ticketing. Somebody like me so anyway, those are just the points I want to share with you all. Thank you, Kay Ken did you did you want to say something? Yeah Kay is absolutely right, and unfortunately this is not in Helen's district, so we can't bug her about it, but but there is no place for a cyclist between 97th and 105th to go west and there is an entrance and exit to central park at 100Th Street, and there is a CitiBike dock at 100Th Street in Broadway. It makes a and their CitiBike docks along the way on 100th Street, so it makes so much sense to to put a bike lane there and the solution would be to put what's known as the counterflow lane and just make it legal for cyclists to go both ways there, and you know the one problematic section of it is where the priest, the bloc of the precinct and the fire department which, if anybody has been there, is pretty much a parking lot with double and sometimes triple parked, mostly police and personal police vehicles, and I'm not sure whether that all is necessary. But it certainly is necessary to have a westbound route at somewhere between 97th and 105th, because otherwise, cyclists are just using it anyway, and the police are just walking out the door of the precinct and issuing tickets when they feel like it, which, in this these cases is very unfair. So I would like to put this on the agenda for next month. Yeah. Thank you, Ken and Kay. I would like to make a more general point. There's a there's, a paradox about enforcement against cyclists. There are some incredibly reckless menacing cyclists out there, but they're, not the ones who are stopped by the police. Invariably, it's the cyclist who slows down at the red light, looks around make sure make sure there's no one there and then proceed. It gets caught because they can be caught they're going slowly, cyclists that menacingly goes through the and recklessly through the red light is not stopped in a way. This can even encourage more reckless behavior I do not have an answer. It's just an observation. I've had and I unfortunately, you're one of the cyclists that fell into that first category of not posing a threat. I saw your email and you know, and you noted that people went by while you were there who were who were going by in a reckless way, and the police did not do anything and so I think we need to think through, and this is it's late in the day in the night actually and we're not going to have an answer tonight, how we really reign in the reckless behavior and do not penalize the people who, although they technically violate the rules, do not really pose a threat and therefore potentially embolden other people to be more reckless and kay I would say: give the subway another try it's cleaner than you've ever remembered. Okay, I may do that. Thank you, but thank you for listening. We should all have options. We should all have an option. Anything else Andrew. Can we make sure that once the pandemic is over, the great returns I'd feel lost without it? What returns the grit on the subway? Oh the grid, yeah I, do not think so. I think I think we learned a lot with the cleaning. We're doing. I. Think that's about it for tonight. Unless anyone has something else, thank you so much have a great night and thanks for participating, take care. Yes, indeed, bye-bye bye, everybody good night.",
            "summary": "And it's good thing, that there was some questions that the community board raised at some of these listening sessions with the community, where you're able to speak to higher ranking members in the police, department.\nGive you just a quick overview of kind of what the NYPD transportation bureau does in regards to traffic safety, and then we can maybe hear some more of your questions and concerns.\nWould, the let's say the 20th precinct know what is happening in the 24th precinct because, as we know, certain streets, certain avenues throughout the entire city and they're in every borough.\nWe know how many school children and it's it was true before the current pandemic situation, and it's of course very true right now, so I did want to at least let you guys know that your voices were heard.\nCan you tell us our officers dispersed on the basis of need, or is there a predetermined amount that each precinct gets sure, so each precinct will have a traffic safety team and on average the team usually consists of four to five officers and they are deployed at kind of on a data driven approach to where they're needed most and, of course, the sector officers as you're familiar with the response.\nYou know, I think we both agree that, as a patrol officer who handles the 911 calls sure you could be focusing on a traffic condition and then be called away to a missing person, a domestic situation or any combination of other 911 calls which will take you away from that traffic.\nI think you just answered my first half of the question, but just to be sure so officers who are not traffic safety officers can still make traffic safety stops like if they see something while they're on patrol.\nMiss lind, because we do have approximately 3,000 traffic agents throughout the city, and these are the light blue shirts that you see and they mostly address parking violations which, as we know, can contribute very heavily to traffic safety, be it blocking a bike lane double parking, someone in a crosswalk parking on a sidewalk, so that is a whole nother aspect of traffic safety.\nIf a pedestrian like you mentioned, is hit at 40 miles per hour, which would be over the speed limit on the street.\nSo I certainly do not want to take credit for those, but even though that there's more and more speed cameras in each neighborhood, especially by schools, we still continue to focus on speed enforcement, maybe not just where that speed camera is set.\nLike: motorbikes, okay, blaring down the street, going through red lights.\nWe do take motorcycle enforcement very serious and there are certain times where you're right, where a vehicle may be speeding so fast that we do not engage in a pursuit at that particular moment, because it may further endanger that person, who's, speeding and now other community members like that person may be going.\nEnforcement takes a little extra time to kind of set up legally to observe the vehicle and issue the violation.\nA lot of that speed enforcement is handled by our traffic safety officers in the precinct.\nI'm going to begin with letting you know that there's been 43 motorcyclists this year that have lost their lives.\nI'm glad you brought that up about the bicycles, because each time that I'm fortunate enough to attend these type of community meetings, many people raise the issue about the danger of delivery.\nAnd I just checked the data in Manhattan north and this year, 84 of pedestrians that have been injured in collisions were injured by motor vehicles, trucks, suvs, cars, etc and 16, and not to say that 16 is nothing have been injured by bicyclists of the six people that we've unfortunately lost in northern Manhattan to traffic deaths.\nNow we're going off traffic safety, but the only time we take someone's car and not give it back would be like a drinking and driving situation.\nMy understanding has always been that when you're operating a bicycle, you're subject to the normal traffic rules, you have to go the correct way on a one-way street, stop for red lights, yield to pedestrians, etc.\nJust for some context, we've had many discussions at this committee and on our board on bicycle, related issues, bicycle lanes and enforcement and operation in the parks, etc, and we've actually from time to time, had cyclists, who very candidly have told us that you know if an intersection is clear, they do not see any reason to stop and wait for a red light to turn green or stop at a stop, sign, etc.\nI'm sure the Narcotics unit has their things, but from a transportation aspect we will continue to serve with every resource that we have, even if it's a slightly less amount of resources, and we will be more fiscally responsible than ever, not that we were not in the past to make sure that we stretch our resources and stretch that budget to every community across the city number two, the e-bike legislation.\nHaving to do with West End Avenue, open street, but I'd really like to ask you this question in case.\nAre these shared streets open streets where it is for pedestrians to exercise more space in their community and vehicles are allowed to locally access, it.\nI just wanted to bring up one use case that I think is specifically unique, particularly with Covid-19 and the outdoor seating, and that is delivery.\nI think is a challenge, and you know I understand that 85 percent of the people are our transportation and should do so.\nBut I do think it's a case that you know I just wanted to bring up that.\nWe have an open street for restaurants, and we are seeing cars coming through.\nMy main question is that I know that this is not something that the local precinct is going to be able to address.\nI had posed the question of whether the the parking meter police could be engaged in this I do not know how that could happen, but I'd be very much interested in hearing whether you have any other alternatives.\nPoint well-made, speed enforcement is at the core of the Nypd's traffic safety program that and failed to yield to a bicyclist fail to yield to a pedestrian.\nIf you're working on educating your colleagues within NYPD on double parking and abusing placards and parking on sidewalks I, really think that people lose faith in the police when they act above the law, and it would go a long way if they were actually part of the solution instead of part of the problem.\nAll, yes and knows: Does the police department consider itself overwhelmed by traffic safety issues.\nNo, we're not overwhelmed, but more needs to be done, and you know I have a question about whether cam you talked about taking license plates and a gentleman before me talked about park cars not moving for street sweepers.\nAnd I would just think the street sweepers should have a camera with them and take video as they're going a gopro just stuck on constantly taking videos.\nIf sanitation looked into that, it's very low, tech, very low tech and on an open street, a bicycle can't go the wrong way like on East on West 103Rd. I could get a ticket for going east 103Rd on a boy.\nI've never seen a policeman probably issued to a bicyclist on an open street for going the wrong way.\nIt's where it's more of a park, more of an open space than a street which is subject to the vehicle and traffic laws, so.\nYes, okay, captain I'll be very quick right and my question is a two-part question: I'm, a block away from Amsterdam at 96th street and on a regular basis when the barriers go.\nYou, know they're pissed off, and the part two is that on that particular open street between 96 and 97, you have a holy name.\nYou know what I kind of look things from a city-wide level, all the boroughs.\nThey would then get out of their car again and then move the barrier back to the way they found it or a community member and not, you know.\nOr we're going to have to move our agenda because everybody wants us to get to West End Avenue, yes, rich great.\nIt's, not necessarily, in my mind at least the best for traffic enforcement, because within two minutes someone can drive out of one precinct and into another, and also you know.\nThis meeting really appreciate your joining us definitely want to keep the dialogue open to see how we can play a role and coordinate our efforts, both with analysis and prioritization and with D.O.T for street design.\nThat, would be great one example, I mentioned when we spoke was we've had some issues and Andrew Alpert has been for years trying to get D.O.T to put up signs as cars drive into our neighborhood.\nA lot of them are coming from, especially out of the neighborhood, but even out of state, and they might not know about the no right turn on red.\nHaving said that, as engaged as our community is, you are especially popular so do hope that you come back, had a really good conversation with you and just want to.\nThis is a matter of life and death and I want everybody to know that all your concerns are important, be it.\nSomething is I, do not want to say it simple, as someone not moving their car for a sweet, a street sweeper or to a speeding vehicle that could unfortunately rip a family apart by injuring a child or God forbid, even worse to a child which I won't even mention.\nItem number two on our agenda: is expansion of the city's open storefronts program to allow retailers to use street space.\nI do not know what more you need to do other than announce the program and unless there's comment or concern that the community has about this I agree.\nHoward I think you already actually answered this, but I'm, most familiar with the stores in the Columbus avenue bid, as you know, and those merchants have merchandise which is so pricey that they're not going to bring it outside.\nI. Just wanted to thank the Community board for all its work on the program to have restaurants and stores have store, have curbside and street uses.\nI've been a member of this community for years and I am so excited to see our streets change from being private storage for p, public storage for people's private property, their cars into something that actually can benefit.\nIt really makes it feel, like a brand new city, and it's so magical to see so many people out and actually enjoying the streets.\nIf you're, going to start opening up more space for the stores and the restaurants, which is great, then you're going to have to balance it out and definitely reopen West End, Avenue and I.\nI know that you guys are going to go back to Western, Avenue and I.\nAre you going to balance that you know if you're going to open this all up, then you need the pedestrians to feel safe to walk and shop and eat.\nThis was one that actually fell through the cracks between the 24th, precinct, D.O.T and City Hall, and my office could be to blame completely because I was asked what streets I'd like to see be used as open streets, and this again was what in April, when they just started.\nThere we've asked the people who love the West End Avenue open street program if they would take responsibility for the barricade, because that's really at the heart of the issue, and so far we've not heard back about that which is too bad.\nAt the same time about a half a dozen people, or maybe 10 have emailed me saying: Please keep it open and not with cars, with no solution with no solution to addressing really the problem of taking minding.\nYou know cars going through the barricades, so I walk through that area.\nIf I could just add one of the community folks brought up the issue of congestion on Amsterdam earlier and even prior to the closure of west end Avenue from 87 to 96.\nThe open street and traffic was starting to build on other northbound avenues.\nAnd I certainly understand the need for a community partner to move the barriers, but I'm thinking that as the cold weather is coming and folks are not going to Wanna.\nI mean there are some streets between Columbus and Central Park West that are closed down by schools, and there is school staff there.\nMotorists are still traveling through the streets and they're not seeing the pedestrians as they're crossing and one last thing we're going to try to put a barrier on 86th street on the northbound side, because that would let people decide before 87th whether to go east or West, to avoid it if they get to 87th street in West, bend they get into a choke and they have to proceed westbound on 87.\nYou know my position on this Western Avenue Street is pretty much the same as it was back in April in May that my concern is on safety and for emergency vehicles to have quick access to homes.\nYou know we're very lucky to be in New York, City now, and a lot of us would not have did not feel the same several months ago when it was the epicenter of the world of Covid-19 crisis and to echo Helen's point that it is crucial for us to have partners to control.\nIt is not really the case and if we can have partners, this can be something that's very successful, but it seems like it's very difficult to maintain at this point, and Helen has spoken to plenty of neighbors who love it, but it's very hard to find those who want to support it and be there and do the work and maintain it takes a lot of work to keep the community together.\nSo I think this Western Avenue, open streets should be retired at some point or at least have a game plan on when it should be retired if Covid-19 crisis and continues to increase again.\nAnd, you know, for those who are interested in volunteering I would urge you to reach out again to Peter Arnstein from the Columbus avenue bid who, even in the chat, is saying that he's created his own signs and all the things he's tried to do to make it work.\nI have not heard a person talk about the effect it has on the residents of West end avenue, of course, everybody's concerned with safety.\nIf closing down the streets and eliminating traffic was the primary concern throughout the city, we could just ban cars.\nCall, it an open street, but it's really closed because ostensibly the pandemic, and the rationale was that people needed more space to maintain social distance from each other and to have additional space for recreation, because at the time there were limits on park.\nAvenue Helen said that people have contacted her office to say how much they like this I contacted Helen's office to suggest that the time has come to close this and open it up to its normal operation.\nThe fact of the matter is that you know we live in a busy city and the traffic on west end, just like the traffic on all the other.\nWhat's, going on now, I park, a car in a garage on 89th, street, I'm fortunate to be able to do that.\nAnd I saw two cars waiting in the northbound lane on 90th street and westland Avenue for the light to change the light changed and not one of those vehicles made a right turn onto 90th.\nThere was never any reason to have an open street on West End, Avenue.\nI think that when the parks closed and these opening open streets initiative, opened, I was happy with them.\nI can tell you that Lucas and my son went over there many times in the middle of the day, because we were going to kill each other and threw the ball around and sat down, and there was people sitting in the streets and some I remember somebody in 80th and 89th used to bring a little pool out put his feet.\nYou did that I was happy that street opened, but I think things have changed.\nI did not even know that these were issues as well, so I think the time would be.\nI have concerns that people who have bigger issues have been advocating open streets for 10:15 20 years.\nI, personally, love, open, streets, I'm, lucky enough to live on one on West, 103Rd Street, and it's just wonderful to be able to walk with more space, to be able to have more space from people who may or may not be wearing masks, and in general.\nIt was their first time in New, York city since February, and the open street was great because they're at an age where they just can't be exposed to Covid-19.\nYou understand that these open streets are not necessary and beyond the safety, issue.\nYou know, I first came to you guys a couple years ago to talk about the problem happening in the upper 90s with all this traffic and congestion.\nIf you look at 90 actually it's listed as on your birth, 96Th, Street and broadway, there are people trying heading Southbound or trying to make a right-hand tourney I have that one circle in the wrong place mark.\nThere should be like a no left turn onto Riverside off of the exit from the highway at 95th street people should not be allowed to get off the highway there and make a left to try to do that.\nIn the meantime, please, initially, you can open west end and alleviate real safety issues for us that are up above this barricade at 96th street.\nYou know the street western Avenue I.\nWe've heard a lot tonight that the current instance of West End Avenue, open streets is not working, but I think that you can see in the data that we've collected and.\nPeople like the ability to have more space to seed, reduce traffic on West End Avenue, to have the opportunity to chat with neighbors in a safe way, and a lot of people like that.\nIf you go to the last slide, people are curious about what else could be happening on these streets, and you know with all due respect to the drivers this.\nIf it is done, well, I think could be a really wonderful opportunity for for safety, for safe socialization, for people to have community, and I'm also going to add, because I know.\nWe are proposing that perhaps the west end open streets be made weekend only in the winter.\nWe could reduce the length to address some of the concerns about people being able to get onto the highway, I'm in that 95th to 96th street stretch, and if we could go to the you know, there are just some basic things that we think could help improve.\nYou could have double barricades on both sides, because, right now, cars are using it as a slalom course, and on the weekend there is, you know, just less traffic.\nAnd I think that the open street does help increase that sense of neighborhood.\nYou know that people are saying: oh, it's great in the summer, time.\nYou know I think winter time your apartment starts to feel small again.\nAnd I think that a lot of the comments that we even saw in the survey and that I've heard tonight are talking about well I, do not see people using it.\nYou know we want to work with NYPD on this.\nSo I think it's great, that you know.\nBut if open streets is not going to continue.\nSo in the event that open streets does continue great and there will be some solution and I trust Jessica and you know, and members of the Comedian and Christina to move that forward and with our support.\nSo I'll- be brief on this, but construct, but rush hour traffic on West, End Avenue, either going to or coming from the highway results.\nWe're not going to get to unanimity, but I think we need some board resolution that gets approved so that we have some guidance of where things go, and you ask: What's the resolution we as a board at the very beginning of the crisis, call for more open, space.\nAnd I think it would have more weight if we as a board, you know discuss especially those three things of you.\nWe want people to support the MTA and to come back and feel safe.\nAnd they're talking, you know that particulate matter actually comes right back into your face, so I, just I just have not seen anybody doing it and the bus drivers who I've spoken to most of them.\nThat, you know, there's much more use of the street.\nWe moved on and I want to propose a resolution, just see what people think about it, but number one.\nOur submission is that it would be easier if this is what the city desires for them to allow these cars to go park on 72nd street or use Riverside boulevard south, which sees almost no traffic and the west side of that street does not block any building.\nDo, not know of how many other religious reasons people get I do not see this happening in front of any other religious community.\nEdict show me the legal edict under which this is allowed to change the signage on the street and say double park at your will and make it open for everybody.\nI'm, a new CitiBiker I've, never biked in the city streets before it's way too scary, but I also do not want to.\nLast Wednesday I was biking out of the central park on 100Th Street and, as you know.\nSo, then you're, you know really tight in there with all the traffic and then going up to 106Th Street."
        }
    }
}