{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCBi2mrWuNuyYy4gbM6fU18Q",
            "title": "Top chat replay",
            "publishDate": "2020-07-21",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 93,
            "um": 188
        },
        "wordCountFullTranscript": {
            "people": 86,
            "committee": 62,
            "health": 48,
            "issues": 41,
            "lot": 36,
            "things": 34,
            "issue": 34,
            "meeting": 32,
            "care": 31,
            "thing": 25
        },
        "wordCountSummary": {
            "people": 20,
            "committee": 15,
            "issues": 11,
            "health": 10,
            "justice": 8,
            "issue": 7,
            "equity": 5,
            "hospital": 5,
            "program": 4,
            "things": 4
        },
        "fullTranscript": "My barbara rebecca lori, let me know when you're ready to be unmuted foreign. I forgot I had to mute myself. Well, I wonder if everybody should remain unmuted during this. Do you think so just to and then, if somebody gets a phone call, we can mute them just because there's not many people and we can get a different type of interchange, yeah I'll switch it up rebecca. Is that cool with you and laurie? Is that okay yeah totally? Okay, all right! Everybody is now able to unmute themselves. So I will mute whenever I'll meet people whenever it seems necessary, but right should be just fine. So hello, everybody, hello, hi! This is really good because not only are people on, but I've been getting emails, saying we've been getting emails, saying can't be there, but this is what we want to discuss. So I found that very exciting. Lauren rebecca you've been getting you got it from will and and brian did he send to everybody or just me, brian. No, I only got from billy and sarah okay, we have one more minute and then we'll get started. Can you hear me yeah? You can't okay, because I can't I can't I don't know this is weird, I'm seeing a split screen. Ah, because right now I'm sharing my screen with the agenda. Okay got it so as soon as I stop doing that, you'll all go back to your normal screens. Who was I hearing ellen? Yes, hi ellen, sorry, all right so in when anybody wants to know we have another minute to go, is wilma on. I know she usually calls in did. Is she not yet not yet, but I'll keep watching. Did she call you for the number today yeah, I texted the tour and a leader is going to be late, she's going to come, but she was driving. When I spoke with her and she said she doesn't think she'll make it by 6 30. okay, but she has something she wants to talk about. Also, so it's exciting that everybody has ideas, it's exactly 6 30. Do you want to get started? Give me that or should we wait another five minutes? Do you see anybody signing in will? Can you tell let me check yeah there's only a couple of people who have signed in who are not already here. Okay, so I will be muting you guys if I hear feedback from your microphones while you're not talking. Okay, just don't get yourselves back, but if it's to be too much, then we'll go back to yeah, we'll go back to the usual way. It's just that it's a small enough group and people want to interrupt or say something else. I you know I would like a dial. You know I'm hoping that there's a dialogue rather than a set meeting that as usual, you know this is specifically speaking. It's that type of thing see. If that helps once we get started, let's make sure billy can speak early because you know he has a pretty crazy schedule. Come I didn't read it. I just saw his email. Is he coming he's here he's here? Oh billy, you're, here, oh great, all right then I know his time is limited, so I want to make sure he gets the chance to speak early. Okay, then I'm going to get started then, and then anybody come in. We could go backwards. Okay, billy! How much time do you have 10 minutes, 15 max? Okay, then I'm just going to give a slight introduction. This is the health senior social services committee, which also includes a criminal justice or when one chair left alita asked. If that could roll into our committee. It wasn't a big deal back in those days and I think it's become a very big deal now. So we have a lot of issues to discuss. We call this meeting that came out of the land use meeting when there was a discussion about what should we do with about racial injustice, and I think that two things came out of it. One is there should be an overall committee anthony, I know you're going to be co-chair of it, so you could explain it if you would like a little bit more, but I think if that is more of a general discussion and then the committee meetings would be a much more specific thing. Housing would do things on housing, education and we would do something on health senior social services and criminal justice. Do you see it the same way? Anthony? Yes? Actually I do. I think that there's a kind of let's say overarching quality to the to the to I'll call it my committee, I apologize yeah, but I think each of the other committees have their own responsibilities to pay attention to all these issues, and obviously health, seniors and social services is a real, is a real logical place and criminal justice and criminal justice. Yes, sorry, I'm criminal justice, you know I mean I it it's. I think it's a some committees, I think, are to be honest. Like I mean I'm gonna pick on landmarks are less involved in issues of racial equality than other committees, but that doesn't mean that each committee can't in its own way try and contribute to, can try to try and contribute anyway. So I'm very pleased that there seemed to be a lot of interest. I did speak to people and write to people and people contacted us and sent information, so I think we'll start with the last part of it, which is criminal justice, because I know that's what billy is interested in well. Is there any chance? You could call wilma and say get on the phone because you're she was part of that. Also, thank you. Let me check to make sure she hasn't joined, but she hasn't joined. Yet, no so yeah I'll send her a text to make sure okay billy. So now I don't have to read your email right, you're, going to say what you had in your email, sure yeah no problems so and I'll try to keep this brief. You know the history a little bit with this committee, and this is something barbara and others know well, but we there's a public safety committee and was folded into this one, and so, in speaking with a few people on this committee, you know we were talking a little bit about. How can we think about a role in addressing public safety and criminal justice issues? I think there's a lot. That's on people's mind these days, there's a lot of talk about bail reform, there's a lot of talk of defunding, the NYPD, and what does that mean? You know, I think, a lot of people here defund. They think oh, no, more funding, as opposed to say a budget cut, which is happening to lots of programs and agencies right now. But what do these things mean and I think we could do events easily on bail reform? You know: did it go far enough? Did it go too far? What is bail reform mean? What is the purpose of bail? I think a lot of people, don't even you know, start from that point. We could have a whole event on the new york city, police department budget and I don't have a problem with doing those things, but what my email says- and I think this is the larger point that I want to underscore it's. I think we could really drive a larger conversation around. What does public safety mean in the year 2020? And I my personal view this will just be my view. Is we have a cramped definition of public safety? We often think of public safety strictly in terms of what the NYPD does, as opposed to say. What does it mean for public safety when you have youth employment programs, education, programs, health care, public health, mental health, investments in communities? You know we. I think there needs to be a larger conversation that defines public safety and almost looks at it through a public health lens. So I'd like to see us do that, and I think, given that we have the word health in our committee and that we have a public safety component. I think we're well situated to do that. So I'm getting a message that I should raise my camera angle a little bit, so I'm going to do that. Let me know if this worked. Thanks will that's it. I always you know, I don't know the art of doing the right situation. So, okay, I'm learning, but my bottom line is that we should discuss. You know how we'd like to take this on whether we want to do it in bite size. You know in september or October, here's an event on bail reform the next month. Here's an event on the NYPD budget, or we could try to get it all done in one event. That could really, I think, encapsulate a lot of this at once, and the last thing I said in my email is: if we do an event on any of these things, you know. Obviously we want a lot of points of view represented, so I think we could have someone from the 19th precinct. We could have someone from the Manhattan da's office. I would urge us to also include a public defender. I would urge us to include yes, formerly incarcerated person, and I would urge us to include someone whose expertise is more in social services, what it means to really invest in the health education, welfare of communities that, frankly, are often over police communities. You know you see over policing, but then you see underfunding and everything else, and so that's kind of my pitch to this committee for how we should consider taking on the criminal justice component. I can stick around for a few more minutes. I'll have to hop off, but I'm happy to touch base with barbara or anyone else later to see what you all think, I'm going to throw out a question. I agree with every. As you know, we talked, and I you know every one of your thoughts. The question is: are we better taking little modules where maybe we could come out with a resolution, and my hope is that we come out with something that says elected official mayor assemblyman, whatever we need a change and we want to be part of the change. An overall committee which I have to say our committee, the health seniors committee, has done big thoughts and I love big thoughts, but you don't come out and that's a question I'll have for anybody that comes in and talks about it. Yeah I mean what we hear now is that health equity is public safety, equity and we know that everything is connected. How do we deal with each one of them and then as a whole? Also- and I don't know I don't- I don't have an answer for it: do you billy or anybody else, that's why I wanted to mute people if anybody wants to come in and say something about it: nope, okay, really, yes anthony! Oh okay! I think there's a, I think, there's a very strong case for small bites here, because none of them are small bites, they're, all big issues, the sort of bail reform, defending the end, the defense defunding. Rather the police force. These are actually each of them by themselves are big issues, and I think that it's fair for us to sort of focus on a single issue at a time right, first of all, because it, I think, we're all suffering just a little bit from zoom fatigue. Yes and the shorter. We can keep the meetings the more focused we can keep the conversations I think the better off we are, and I think that billy's notion of having meetings that have someone from the da's office, someone as from the public defender's office. I know people through my son who work who worked at Rikers on issues with worked at Rikers on with rather sort of the most at-risk mentally at-risk prisoners, probably the wrong word but prisoners, and I think that getting a sort of perspective on what that what the criminal justice system means to the accused is, I think, very important, and I think that that's part of what we ought to be looking at. Certainly on this committee and certainly in the larger committee as well. I have an idea that just came to me: would it be what billy talked about with a big idea? Be better, I'm going to say your committee for better things, for what is it a task force, a committee whatever it is of this? Whatever committee? That's, I think, of a committee with overarching ideas within the particular parts and I'm afraid when we get into the other areas besides criminal justice, that we can, I mean, maybe we'll create 15 months in a year rather than just 12, because right, but maybe we would think of combining two things. I don't know I don't know, could it be bail, reform and defunding, or certainly defunding, and talking about other avenues for a pal program or youth program or a community watch program, or something like that? I think. Do you agree billy that certainly can be combined. I think do you agree? Does anybody agree? Everybody talk, yes, yeah. I agree. I agree and I think the only downside to taking it in small bites is you know it's just more meetings and if we're only planning to do it through this committee and have one meeting a month, it's going to take a long time to get to whatever the end goal is. If we want to treat it almost like the contact tracing series, where we have several events in more rapid fashion, then I think it makes more sense, but I'm open to dragging it out a little bit longer and I think small bites is probably the way to go, and I do agree barbara that you could combine some of these issues. You know if it's an hour and a half event, you can do 45 minutes on bail reform in 45 minutes on the police budget, for example, yeah. Why don't we figure out like the logistics after rebecca and your faces yeah I was just going to say I thought the contact tracing series went really well, especially because you know each meeting was focused kind of on a different issue and then the one where we wanted resolution we made sure to keep it very focused on what we wanted to address. So I think if we could kind of frame them, because I have a feeling we're going to continue with these zoom meetings for a long time if we could frame it kind of under that lens. I think we could actually get a lot done and maybe work with the other committee too, which I see has an overlap and maybe see what role they have and I almost see like one could be a feeder to the other. Do you is that possible? Do you think that one? Yes, I think there's a kind of- and I don't know I mean I haven't thought about this very much. I admit yet these fascinating people that go to bed thinking about things like this yeah. Sorry, I don't know I wake up in the middle of the night. Thinking about it, yeah and you know woman. I haven't spoken at all yet really we're gonna have to schedule a meeting, but I think that they, the you're right, there's a kind of role for the overarching committee, and maybe the issues that were sort of sort of we've immediately zoomed in on which have to do with criminal justice, essentially might not be the most important for this particular committee that this particular committee might be able to focus more or should focus more can focus more. I don't know what the right word is on something like health equity, that the problems that rich people have better access to healthcare, and so how do we? How do we help? How do we figure out a way to help everyone inc in our district? Absolutely get health care in the same way that the housing committee has to really dedicate themselves to thinking about housing, equity well, and but this is all part of it and we started with this because of billy's time. Yeah I wanted just is a leader on the phone. Yet not yet is she know about wilma, no yeah. I did. I don't know why what was said. I think pretty much what we discussed before the question that we're talking about all these issues about bail reform and all that, whether it should be an overarching committee or a small committee- and things like you know- and I think that it should be a smaller committee, because if you put bell reform- and you put issues like criminal justice and other things together under that that those issues it's too much, it's got to be broken down smaller and smaller, a smaller part, because this is such a wide range of problems right that can be worked on right. It does anybody on the committee or that's on the phone. I'm sorry I have to step back will is shelby from the from the council members office. Here, yes, kayla, okay, kayla, can you give us one? Second, just to finish this thought? Okay, absolutely! No problem! Okay, great! If everybody agrees that these are issues, because I don't want this meeting to go on forever and I have to tell you there's so many issues to discuss. Would it be okay? If we sort of brainstorm and maybe send emails, I don't know if we're allowed to send emails back and forth, but just organizing the committees like how to approach it. Would anybody object if it's not done at this meeting but later on? I think it's going to. I think we're going to be here to midnight if we hash out- and I think it's a good idea. I think that you should move the meeting on. We have a basic idea of what we want and we can take it from there at another time. We it's just too much at one time to discuss right now right we have some ideas and some things that came out of this. So we have something to work with that's right, so I think that the three main areas, and not that little things don't come off. It are going to be bail, reform. What is the funding mean and what should be funded? I'm going to put it that way. What are the other? I think you put it very well billy, the other public safety, things that are not necessarily police and what else can be done, and I does anybody not agree with me. I agree barbara and I'm getting a little nervous here, because, knowing that we may be playing for 12 months here, but we have 24 months worth of issues, and so I think we need to be realistic and I think perhaps the idea of having like a big forum where we could get a lot of people to talk about criminal, the criminal justice system. I know you want to come up with that with a resolution on this, but it may be that we need to plan for a big event to bring in a lot of people all right. I have another, I'm not going to just play a little bit and then go on to the next very large topic. Okay, can I be healthy? It might be social services, it is so many we have two committees. We have this overarching that wilma and anthony a co-chair, basically an injustice committee that's over, so we have to think about it, and my feeling is now please lori and rebecca. Tell me if you disagree, but it doesn't mean that members of the committee can't that we can't have two meetings one month where other people sort of take it over and do things with it. I mean I agree, but I also found just based on working on the contact tracing series that having working groups that aren't as committee dependent if you're very focused and interested in one issue, could be a good use. Okay for these issues to ask if we could go on to the next thing and wait barbara one second, can I just ask the questions? What is the the committee that you anthony and wilma are chairing? What is it called? Ah I talked to a leader. I talked to a leader this afternoon and I just think that anthony and I need to speak talk to each other yeah. I don't think we all can find an edge at the top of our heads in a meeting like this could come up with any plan. We should have contacted each other before the meeting anthony and I, but I did speak to a leader and I talked to anthony about it all right. So, but you are, you are the committee that we spoke about at the last meeting right when we had the big like what are we gonna do about? You know racial. You know issues, okay, all right! Fine! I just yeah, I just yes that is more of an umbrella where each committee is more of the individual issues. Elite is still not on. Then I'm going. Oh first of all, I'm sorry from ben caylos. I'm sorry, I keep forgetting names. Can you please kayla? No problem, ayla, I'm sorry! Yeah! Will you interrupt? Do you want to say something? Do you want to just interrupt us and give you a point of view? I don't know what so we I we spoke with den kaylos's office because he's how a council member and the last minute I spoke to them today and do you have anything to say or do you want to just listen and get back or I don't know? How is it? Okay, if I listen and get back absolutely, we would love that. Thank you, of course, I'm going to and lita said it's. Okay. If I tell what she had to say she spoke to me, I don't remember if it was yesterday- or I don't remember one day from the other to say that, will we be willing to do something on preparedness- and I said yes, but I think september is going to be a little too late and she's tr she's trying to convince us to do something in august on. Are we prepared- and I think we can nervously say no, that we're not if we have another spike, if you know a floral that kind of preparedness? Yes, I was wondering what we are, what we were prepared that type you know like what will the next round? What are we doing and there's been a lot of? I think it was a stringer that had some ideas, there's been ideas all along. That would be fairly quick. The leader has asked to have it in august, not no vacation this year. What do people think of that? How do you think close how we, who we would get, what we would get? I have no idea, I haven't, you cannot mute yourself, sorry is it in august the preparedness information well, but the reason august is because the feeling, the fear is, I know a leader. Has that fear and I have a fear about everything, so I will agree with anybody that has any fear that september is going to be a bad month. It's you know, we have to hope. That's not true, but certainly we should be prepared and one of the things that worry me is they're upping the number of tests, the number of tests, but you don't get the result so barbara can I can I say I would actually think it would be smarter to do this in the fall rather than august, because there isn't. Despite now it seems that the issue is that in the fall, there's a could be a spike. That's right, but are we prepared? That's why we need to talk about it? You want to talk about is: do we have a plan? Are we getting our labs up to date? Do we have enough PPES? I think I don't want. I mean and more people would be around. I mean people would be gonna go away in august to somewhere going away. I think that my vote, if there were a vote, would be september, would be a really good time or October, but september would be a good time. People will be around we'd have more of an idea of what's happening nationally right now. The issue is it's more of a southern issue but preparedness. I think the city is just right now, trying to figure out how to deal with now, rather than prepared. We might get better information in september. Just my opinion on the subject. Does anybody else have an opinion? I have an opinion on this okay. I feel that, while we're waiting in september as they expected a peak to happen around then- and also there are a lot of people that are all around or even if they're, at a different part of new york, upstate or whatever, we we're doing this this virtual meeting and they will be able to be in on the meeting of whatever we are prepared to talk about. I think it's very important that anybody have ideas about how we can not be so afraid for september October november, even if it happens, discussion for me discussing it on how I could possibly help myself in september October when it spikes. If it does spike, we don't really know, but I think it really helps to talk and plan and that's the problem is that nobody really plans and you we have an idea what's going on now and I was rapping all over the world, so we have an idea of I mean. Are we really ready to do anything? No, we don't even know what to do, but if we could discuss it become ideas, maybe somebody could come up with a fantastic plan. Barbara could I say that it seems like if you're going to do a preparedness session that you'd want to have speakers, and would they be ready to speak in august or would some other time be more appropriate? I have found that people are very willing because they don't have to travel. You can get somebody from chicago or California. That's right, yeah and people aren't going to vacate. I mean I mean they may be going to their vacation home, but I don't know, is anybody planning a vacation? No that? But that doesn't mean I won't be available. I mean I'm always I'm not issuing an opinion either way about whether or not we should meet in august. But as far as september is concerned, I think that the primary overarching issue is going to be what's happening with the schools, because that is an incredible incredibly large and impactful decision, because you know parents have to deal with. Are my children going to be at their school if they're going to be at their school? Am I going to be in danger? You know when they come home, the teachers are going to be freaking out because they're not sure if they're, okay and then, if they're not going to do it in school, then there's the issue of home care. You know and whether they are not. You know, there's just a whole, the whole mess of issues that in september are going to come to the fore. So I think if we are going to have a meeting in august, it should deal primarily with that, and I don't know that we can do that, because I don't think the decisions have made yet you know are made yet you know so people don't know anything. So I don't know education can the youth and education committee, that is in our committee. What she was saying was most it's the women and families committee. It's the you know: it's the elderly, it's also health. It is also could you make a subcommittee that go back and to look into the timing and some of the people that might speak on some of the social service, juvenile criminal culpability issues, because august is a lousy month regardless of pandemic? Yes, it's easier to corral people into a zoom than it would be to ask them to arrive in person, but I think maybe a subcommittee could begin to take make the preparations and I'd be happy to be on the subcommittee, and I mean meryl is our new second public member with ellen palovey. So this is rebecca and laurie, and this is meryl brodsky that has joined honor to meet you. Thank you so much for including me, of course, the more the merrier I just elitist here and she's raising her hand, so I just want to make sure we I am I thank you. I wanted to address what laurie had said, which is that peter patch and the youth, education and libraries committee is actually, I believe, in conjunction with keith powers office having a meeting on monday with representatives from DOE on the reopening of schools in the fall. So as far as far as what the DOE knows, hang those things are illegal and you're not supposed to be on the sidewalk on those. I want to hear you yelling at somebody without a mask also well. I actually think that merrill is right that you know the committee can do preparations in august and then have speakers lined up for september. It would be what is I know you had suggested august for the meeting. I don't know when you came on. Did you hear me paraphrase what you were saying and I hope I did it correctly is lead it back. I think she's still talking to whoever she was talking to still yelling all right wait. I just I just want to say so. The education stuff is should be and is being looked at by the youth, education and libraries committee. If there's something you'd like to do jointly, then by all means you should talk to peter about it, but right now he's doing something I believe with keith powers. Peter was set for monday. Keith is doing something on monday, so peter wanted to coordinate with keith, so so they're working on that it was your issue, and I don't know I was my issue. My personal thing and peggy was saying that she doesn't think august is a good time that if we get a peek, it won't be till september. What is your feeling about timing and I think for some issues I there are a number of community boards that are actually meeting in august, even though they generally don't because of things starting up again and issues that are really crucial. So I'm thinking, if you guys, want to do- and I would work with you if you're interested in working with me- something on preparedness, so that we look at what and there are a lot of aspects of it. But what should the public hospitals be doing? What could we be doing to ensure a more equitable? I guess virus impact and more equitable health care, Cuomo added 10 states today to the to the list of states that requiring quarantine. So now there are 31 states that doesn't look good for us yeah. So I think if we, if we look at this and try and figure out what do we need, what could people do? What could individuals do to prepare? You know not stocking up necessarily on toilet paper, but what other things could or should we be doing? What should the city be doing? I understand scott stringer I haven't looked at it yet said something about h and be needing to be better prepared. I know what happens on roosevelt island was a disaster with kohler. So do we want to have groups that make you sign religious proclamations before you could volunteer there, or even I guess, someone said be treated there. I don't know these are all kinds of issues that come up that fall within your very broad auspices. That's true. I think. However, I will say one thing and please I hope everybody understands my politics, but they actually treated people. Do you. I don't know if you heard how many millions of dollars went into the tennis club in long island and they barely, they were paying nurses, two thousand dollars a day to stay on their phone and look at facebook that they, it was totally ineptly run, and I mean this is when you have to when you're desperate the left right desperate. So it's there's a lot, there's a lot of stuff and a lot of lessons to be learned and a lot of application for things, because there is an awful lot of anticipation of a second surge, and I think if we deny it despite the quarantine stuff, we're really putting our heads in the sand and also labs the fact that they say tracing trace, you know testing, but if you're tested- and it takes eight or nine days to get the results back, it's not very helpful to do something with the labs. I don't want to pretend one thing that was done before I think we know we don't have any minds about that. I unfortunately passed by mount sinai during April 1st and it was horrible. We don't want refrigerated vans to throw bodies in anymore and it was horrible to see it was well even worse. That won't be going away very fast. I think it's important to have some kind of meeting in august, but the preparedness there's a lot of different categories and I think that we should start in august. I think you should. I think it depending on what you want to do if it has to do with Covid-19, then I think I think, on august meeting would be worthwhile people, even if they go on vacation if they're interested they're not going very far or they're, not getting planes and going to europe or asia mostly so, and people are around and there's a lot of interest in what's going on, so I don't know if there's something that you that you think is important and relates to the virus sooner rather than later, and the virus does relate to to racial injustice, because we know it was the black and brown communities right that were worse and it could possibly be grouped with other things along the way I know, maybe that but august is not right. Does anybody else think that we should not do it in august? To me to do it in september is missing the time span when oh, I think we have a meeting. I don't see anything wrong with that, certainly to touch base on everything that's happening in the pandemic. That's the and the quarantines of crucial issues, but I think it's also preparatory people have something they should think about it now as to maybe presenting it in august and maybe in the future december October actually making a rather than discuss this for the next half an hour or so why don't? We get a general consensus on whether it should be in august or september or October or 21 22? Yes, let's vote on this and end it right. I agree. I agree, I think it should be in august and if everyone is comfortable just because of some of the things that have been mentioned, that will any board member who can't go come for whatever reason it, because it is in august, we'll get an excused absence. Okay, great, I agree. I agree criminal justice. We have a hands full criminal justice. This is the first thing of health by the way just to get through with seniors, I mean, I think, that one meeting really should be on a model of nursing homes, and specifically, I guess, if we're doing racial justice with the public hospitals, what went wrong? What went wrong overall is the model of a of a nursing home, a model that isn't perfect anymore, or I think that could be maybe a little bit later in the year. I don't know what just what people think of that issue. That's been brought up. Also. Well, we've been doing research on nursing homes. If you want to do it jointly with the women's committee. That would be great. Okay. Fine, if you want to do it, I don't know. Okay, I'm going to just read what brian carrera wrote. If I have it, which one was his, he is an insurance person and he wrote he couldn't come and he said he did have two ideas. One is the expansion of telemedicine during and after Covid-19, and he has a speaker that he could talk about it. That certainly is something we could talk when we talk about what would the new health care be like and so on? That certainly would be, can be fit in. There is that telemedicine, and if we have somebody who talks about what it is and how successful that could be good, let me read the other one and then we could talk about it. The new york state health marketplace during an epidemic, that's changing and the government and the governors push to make a plan options more affordable. I guess what he's saying so you know what rebecca do you want to read what sarah chu wrote yeah sure? Let me hopefully my I've been losing internet and sometimes phone service on my phone. I do not know why technology hates me these days, so let me make sure I can open it. It's getting sick consuming. Also right good. I said your computer is getting sick of zooming, also yeah, I think so all right. So I can read what sarah wrote to us as we examine healthcare, seniors social services and criminal justice. I feel that it's hard to consider the issue of equity without asking. If we could examine universal access to health care, we are seeing job loss impact health insurance due to Covid-19, and the group of people who are just both disparately affected by job loss and disparately affected by Covid-19. 19 are black and brown communities. We are at once condemning them to both poverty and disease. To the extent possible, there must be a way to decouple employment and health insurance unrelated to Covid-19 19. This decoupling would also ensure that women get the health care they need without regard to their employer's personal preferences. Perhaps the committee could also investigate how universal healthcare accessibility could impact society as a whole? Can we collectively live better lives? If everyone can access the care they need? Aside from pandemic settings, it could impact vaccination rates, improve quality of life, improve mental health increase the capacity and resiliency of the workforce, ensure humane care of people in correctional custody et saying about cetera, can certainly fit in somehow wait? Who I'm sorry? Who is that from rebecca what sarah chu? Yes, that was the dex cullen? I agree with everything. Let me ask you this: do we think that elita will have any change of heart in the on the issue of dealing with health care? For all I mean I know, she's been really resistant to it, but I I'm just wondering if, like I'm right here, worried yeah I've actually been on the phone. So but that's okay! I don't have it's not a change of heart. You can deal with the issue. It's the long-term care insurance and the two viewpoints. I've encouraged the two committees to work together because you're looking at it from different points of view, and so that's if you want to work together, that's fine, but it's not a question of either everyone paying or everyone going, or only about people going on to medicaid. It has to be something that is more far-reaching than just one alternative. Whatever that alternative might be. I was not talking about that. I'm sorry, I'm sorry that I was not clear. It's not it's! Not we're not talking about the long-term care, I'm talking about the what's. It called the new york health care act. I'm not I've never taken a position that you shouldn't discuss that. I think you should I've taken a position that people are not interested in voting in a certain way without information they can't vote for it or against it in terms of a resolution. If they don't understand what legislation is or it doesn't answer their questions, that's my point not that I'm opposed to anything all right. I I'm sorry that I misunderstood. I thought that you were like against it. You know. No. The only thing I was against was an unnarrowed focus on a specific area of health care, but no okay, there just has to be adequate information and the ability to answer everyone's questions, and my recollection is that there were a lot of questions specifically. In fact, I asked sarah if she would be able to help us with it, and she said she does have people from. I have to look up from some health group that can work on it. I don't know if we want to read I'm not sure how to readdress it, and I know you feel so passionately about this. I I'm very passionate about it, but I don't think we should readdress that. I think we should address their. What sarah wrote, which is more the moral and the ethical questions and the real reality questions about linking healthcare to employment during this term kovid and health crises. So it's a different focus. I think we need to step to the side away from the new york health act and really address what sarah talked about, because that's much broader. I have a question of what's happening with everybody. In one day, thousands of people lost their job. I think we all know somebody who lost their job and what's happening to their health insurance. Is everybody going on obamacare? Will some of them go on medicaid? What is happening with all these people? And I think it would be very interesting to speak to it and realize the problems with employment-based insurance is your work. That would be great yeah. I think that's a an excellent idea, and the sooner that's one of these issues that I think that you should address sooner rather than later it's a pressing issue and it would be very relevant to our community yep. I think so. I think all of it is not to step back, but just because brian you know had mentioned tele telemedicine and again, especially given the context of this meeting. I wanted it on record that we can't address that without addressing the digital divide. So if that's a topic we want to explore, we need to make sure we're exploring all sides of it should be our committee or would that be a technology committee or some other committee? Is that something I don't know I mean? Certainly I think it can come from our committee, it's just if we address that in the future. We have to make sure that we're looking at some of the other issues involved right, and I think we can get people to do that. What other issues do people want? I also think on health on the health care end. I think we need to look at the changes in medicaid because it is disproportionately affecting people of you know the very poor people. There are people, and this is apropos of the nursing home. You know people of the committee looking into nursing homes. There are changes in medicaid right now that have that are seriously affecting people that are in nursing homes like you go into sub-acute rehab and for whatever reason, maybe you have to stay longer than three months and then you're being disenrolled out of the managed care company you were in and then you can't go home because you can't get the number of hours back because they're just not giving them any more, so people get stuck into the nursing homes once they are there and then they're forever in the nursing home, rather than being able to like stay as long as they need to in the nursing home and then go home. So the women's committee will be addressing that this fall. Okay, so do we? I mean we probably since it's the health committee as well. This is a health issue. We probably should merge with you on that. Yeah, we should do something differently. My question about the unemployment I have to assume this is affecting medicaid and we have. We don't have endless money for medicaid. What is that taken away from if people are going to go on medicaid to get the insurance? I and I don't know, what's going to happen with it and that's an issue that will affect the black and brown. You know the poor community as well. Medicaid has been reduced, so there was a whole committee on the medicaid re-thinking committee and they and they figured they carved out. They carved down every available wiggle room in medicaid. So where hospitals and doctors used to be, you know you could you could charge for one thing and there was some wiggle room in medicaid now, there's no more wiggle room and it's affecting patients and what I'm seeing in with pace with my older adult patients is that they can't get the number of hours of home care anymore. So if somebody, for instance, you have somebody with alzheimer's that needs to have somebody living in with them, but they can't get any more than eight hours of care, and that means that they can no longer stay at home. So they have to go into a nursing home. Then there's not enough. Space in nursing homes and nursing homes are just not good, so you're forcing somebody into a situation where they could have been better taken care of at home. Okay- and I'm not sure that you can answer this question, but I know from a like as a medicare beneficiary, I know that they have made a real effort to have people sign up for these advantage plans. You know, as opposed to traditional medicare, okay, and so my question is: are they doing that with medicaid as well like? In other words, if you have medicaid and medicare, are they trying to convince the medicare part of your coverage to go on an advantage plan? They are yes, because now I understand what you're saying, because yeah that's yeah can I just say together trying to emerge people together, medicaid and medicare, so that and then those advantage plans don't have network that you, the people need right so well would that fit in, because I would like to focus on the fact that this is a a committee for racial injustice that we're talking about today. Would that fit into it? Do you think, or that would be at some future time we talk about it. Generally, I mean it's happening now, yeah, it's happening, it was definitely it would definitely fit in and well. I've said it before, and I said it again. I think the redistribution policies will kick in when they have a vaccine and we have to distribute it to everybody, and I think simultaneously, that'll help alleviate this problem, which is fairly kind of systemic, because it occurs in areas that are poor, distressed areas, and so I think we have to look at something like that. God, willing, I think, there'll be a vaccine and there'll be a systematic way of distribution for people who wouldn't otherwise be able to afford it and or adequate care. So is there a way of separating this committee and trying to now go back to saying what a committee is? Should it be an overarching committee? Is it like? Should we break it up, anthony and wilma? Do you think part of it is what you would be doing and we should do more nuggets. I it seems like it's a very big chunk that we're doing did I make a suggestion sure I perhaps each one of us could take one topic and be the lead person on that topic and then go see if we can find speakers that could talk to that topic and that way we don't have to you know one person doesn't have to do all the talk. You know it doesn't have to find speakers for all the topics, so we just break it up that works. For me that sounds good, because I know that I can find people to talk to the idea of racial injustice in the medicaid system. Oh so great is that good faith I don't want to say it and how the and how the newest, how the changes embed in the medicaid system, the current changes are, are just blatantly unfair and just don't work. If we divide up, we can have two meetings a month baby, because I think we have lots of me right, good alita. What do you think of that is the lead on? Can you hear me something barbara? I think what you suggest. It is one of the more pressing things to be addressed now, which is health insurance. I mean that covers everybody in our community. That's an issue that every single person in our community is worrying about, and it doesn't matter if you're, poor or rich they're worried about it, and but it's so urgent with all this issue of lost jobs and what, if there is a second wave, more people will lose their jobs, so I think the committee would be doing the public a huge service. If you could have a session on finding insurance and how you do it, regardless of whether your old young, rich poor, but it's paramount on people, I think it's very important, because I I'm having a problem at high school september 33 at new york hospital, because nobody, I'm getting my doctors- is he's got retiring after two months he's tried to get a doctor out of those two hospitals to take my insurance. Not up now, one doctor would take me on yeah, then I'm forced to go. They told me to go to metropolitan or jacoby or which I know those are at those hospitals of the stupid school hospital. Yeah are mostly black and brown people that get the services, and it's not very good. A lot of the areas are not very good. Nothing old is not good. There's a lot of areas. I don't think, is that the new york hospital special surgery about a year and now just this th this day a couple of days ago, my doctor's retiring. I can't find anybody, that's going to help me at new york, hospital or hss, and that's all about money. If I have money, I want to worry about that. They'll pick me up in a minute. That's why I think it's my fear. That is just so unfair, I'm just wearing this from my experience. Try mount sinai because mount sinai had I had this a similar experience where I changed insurance because I went to an advantage plan, and so now I'm on the advantage plan, I could not find a primary care physician who would take my insurance, so I called the ms society, which has a really good like navigation department and they finally found someone, but she was at mount sinai. So now, all of my doctors, I was going to new york hospital, my entire life. My children were born there. You know everything was cool, but now I'm attached to mount sinai because they took the advantage insurance so well. The thing with me is they've been trying for three years to get me more than more than a year, at least to get me to get an advantage fair advantage care on the medicare part of advanced care. I refuse I refuse every time they try to get me on it because you get less services yeah and now? What about trying to encourage me? Oh you're, going to get more of this and what that's not true, once you get on it yourself, yeah they do a big sell and but you're right to stay on it. If you, if you can afford it, and you can stay on, you know the other, the the straight medicare. I definitely recommend that you do that, but I was just talking about people who will because I did switch to the advantage plan and I finally like many of the new york doctors, don't want to take it, which is you know, I understand, because they're not going to get not going to make money, but this conversation, this conversation underscores the issue here that there's a big problem about lack of information and it's getting to be quite urgent under the circumstances. Yeah, I'm going to ask him because she's the one that brought it up. I think what peggy is saying. I agree. I personally agree with that. This idea of just what sarah chu said, the idea of committee about our health care and how it has to change and the what's the problem with employment based and certainly medicaid, would come into it, because people that are not employed are going to go on medicaid, and I think that there's a relation, I don't think we need a separate committee for. Do you agree ellen? No, we don't. I don't think so repeat that last sentence, you don't think we need a separate one about medicaid. You know just what you were talking about. I think it could certainly be brought in this overall about why we need a change in our health insurance of how our healthcare- possibly, I think, that's a please start off with that. You don't have to get so granular with it and then future times. We can talk about it, but at this point there's about that- and I have one more thought that I would like really in some of my conversations yeah with medicaid and medicare you're talking the national issue. Should we be starting on the state issue rather than you know, try to climb up the hill? Why don't we climb the mount first before we go to the hill, although there is a portion, that's the state. Also! Yes right. I agree with cause not that it isn't a big issue. No, it is but medicaid is medicaid is run by the state, the medicaid, the decision, the decisions about what to fund and who to fund, and whatever is it's up to the state. I mean there are lots of states where you go like we're lucky that we live in new york right, because new york is a big, you know they have a good insurance department and they have, they are very. They are more generous than others. Shall we say in medicaid. If you move to you, know kansas or I'm just picking that out of the you know, ether, I don't know if kansas is a specific one that doesn't do it, but there are lots of states that, like really don't take the money or you know whatever, so it is it medicaid is definitely a state issue. No, it's definitely a state issue, but it's also a federal program. It's a big money. They get the money from the federal to start with and then they dole it out. There's a matching program where there used to be matching issues, but it's definitely more state than say medicare and it's also a question of locality. Matching new york city matching and it's always been a major issue for the states and localities who pay their fair share yeah. But I don't think this should all be about medicare and medicaid. I mean people need to know how to go on obamacare how to get you know, other kinds of insurance, absolutely that's the whole point yeah and if it comes up it could be more of a sideline and then later on to specialize. You know to have something much more focused about it. I think. Are you talking about it, because elita asked us to focus on issues, I think privilege and healthcare and equity, because we're a little unmuted, and I want to keep doing this. Let's just try really hard not to talk over each other yeah, because I'm getting abused, you're being abused, I'm getting confused about what are we going to be doing and what is it going to be? What was gonna be doing in august and we're getting stuck on big issues? And I didn't know this was like gonna, be like this august we're going to talk about preparedness. We have lots of topics we're talking about you do you do have lots of topics and actually, if you have an overarching theme, such as health, equities or insurance, or which is part of health equities or something you can have, if you want to do it as forums as hour-long, webinars or something you could do multiple ones. In a month, we had the small business care program every other week, so we're going to go to what they're interested in they're good they're going to participate in them. But it's a lot to deal with a lot of fear of breathing little areas. I think that each one and I'll go over the ed and I'm not saying medicaid couldn't be part of a discussion, but I personally feel that what sarah wrote was just such an important thing and that would be sort of a big meeting forum. I don't know what the word would be. We will write about been send it to everybody. I think, will rebecca keep track of everybody. That's here. Yeah always do well, but there are many issues and topics we haven't had time to address, and I just want to make sure they're on the record and we can see how we want to explore them in the future. There's maternal mortality. That is a huge issue. There was also a study that came out recently and I've been a little overwhelmed with some work stuff, so I haven't had time to read it, but I was very shocked that it was a study they wrote about it in the new york times that even among healthy children who undergo surgery black children are three times as likely to die than white. Children has nothing to do with they're, both equally healthy. In the beginning, that is scary and alarming, and it's just not right so there's all these other and maybe there's way more implicit bias in the health care system than we as opposed to new york hospital with a private doctor. So there are just lots of little. There are lots of aspects to this that we should just acknowledge and bring up at some point rebecca those two really can be combined. Couldn't they well. Could I say something here, because maternal mortality ought to be something with the women and families committee. It feels like because it's women and it's families and it's healthcare. So if you guys want to talk to each other and that's another way of doing more forums is to combine with other committees, like you did yesterday last night on the contact racing and the other the previous weeks as well. One other issue that I think elite was in my conversations with you, I thought of it and that's public health. I will tell you: I have a slightly different point of view than a leader. I will just tell you, I'm on the the the cab, the board of metropolitan hospital, and I've been very impressed with what they have well you're saying, no because you're talking. No I'm saying that I don't know why you why I'm being ascribed all of these horrible things, I don't disagree with you. I always talk about what you say, barbara about metropolitan hospital being right wrong. In fact, when I was talking to dr long's assistant, either this morning or yesterday about the contact racing, I said, and she asked what hospitals are in our district and she talked about metropolitan, and I told her about you and how enthusiastic you are so public hospitals are essential. You just they're made all right. So even if they're not good- and I really put colors, but some of them are good colors. I don't know if it's a nursing home, it's a long-term care, it's different than jacoby and elmhurst. Yes, but the public hospitals have been trying hard. They have money problems, I think they will be essential and then I can't remember which person I'm listening to but they're talking about more community health centers. Also to deal with more equity until we get some change, I think that could be an important topic to talk about. I don't know if it could completely combine, but I would think that could be a very important topic and I know rebecca that when I've been at meetings at metropolitan, they talk about mortality. You know death with pregnancy and birth, therapies, barnum and so on. I would ask that there be some kind of balance that there be some programs on prescriptive recommendations, policy issues and others on things like how to get insurance and how to deal with insurance and how to wend your way through bureaucracies or things like that are practical and informative, and that are not so much about public policy, but are educational and informative. And then you also have the public policy side of things, which is what you're talking about now. That's the only that's what I would suggest other than that it's all really up to you guys and I'm sorry for cutting in so but at the same time, if you're going to get a speaker, I don't think it should be. Somebody that's going to promote their company because we've had some speakers and they'll say I'm with such and such a company- and I do this and that and everything else. If we have speakers it should be non-basically non-promoting themselves or their companies. It should be the issue, but it could public. I think it could be somebody from the public hospital, but the public hospitals have problems no, but not getting a private person that works for a private company you're talking about health insurance, no just anything in general, because I think one night there was some meeting and some guy said I work with such and such an insurance company and it wasn't promoting himself, but he was promoting his company and basically what he was doing, we're just informational. We want informational information on what insurance are available, how we get it the pros and cons of the medigap, the many the advantage plans, the straight plans. We don't want the names of companies, we want information and facts. I totally agree. I went to a liz krueger one of her things that were presenting it was people that were presenting. My other question is: what about all these walk in small medical places that are springing up all over the place? I mean that's going to put a lot of. You know relaxation on the hospitals. So if people go to these places rather than the hospitals, then the hospitals can concentrate on more urgent matters rather than just people walking in with a cold or with a sorrow with just common things. So should we also be promoting these? Well, that's. I would call those communal, I'm not sure I would think those are more like communal community, but a lot of them are hospitals, so mount sinai, northwell they're, all springing up all over the place, I'm not sure how that would fit in with what I'm talking about. Who else has something to say about that? Well, those what are they? What are we going to call like emergency care? Centers? That's what you're talking about right cause yeah, okay, those emergency care centers, are actually promoted by the advantage plans and they recommend that you go to them. If you have something that they can deal with now, they can't deal with everything. Obviously they can't deal with like a true. You know emergency that requires you to be. You know, have the possibility of going, you know elsewhere, but for the everyday kind of you know, oh I've got like a little thing on my you know knee. I want them to look at that or I slice my finger or like whatever it is, those they can do and the advantage plans promote them by reimbursing you for more money than if you go to an emergency room. If you go to an emergency room, you get a little bit less money for reimbursement, so they're promoting those things and interesting yeah, and it's like if you, if you go to an emergency room and then you end up in the hospital they pay for a lot more than if you go to the emergency room and they release you from the emergency room. So it's a whole. You know it's a whole industry thing that they're promoting. That would take a lot of pressure off the hospitals, but the hospitals. Here's the thing that I that I understand about the hospitals is that the hospitals are really in trouble. Now, like all of them, are really in trouble because they make their money from like you know, optional procedures, and you know things that aren't necessarily you know for your health, but for like cosmetic things and things that are by choice. You know that that's where they make their money and since the copic thing, not only are they not doing those, but people are afraid to go to a hospital now because they don't want to be exposed. You know to the coping thing, so the hospitals are really in trouble and I don't know what the answer is. But I just know that, like that's a big problem- and I don't know if getting rid of their emergency rooms would help only because the emergency rooms they still do get reimbursement from the insurance companies and then, if they admit people to the hospital, then they have a patient. You know so it's yeah right. I do know, for instance, metropolitan hospitals called something I forget. Do they call it urgent care or something like that? It is basically like city md in their hospital and what's good about it. Is that if you go to city md with a bad stomach ache, and they think you have an appendicitis, they then send you to the hospital here they would you're in the hospital and they'll send you in, and I think that they're doing they were doing well. I don't know, what's happening now, but pre-covet they were just opening up and they were doing well with it. I don't know what's happening now I have. Unless do you have other issues I see rebecca? Well, you know, I think the main point of this meeting was to just kind of brainstorm, especially about issues related to racial equity and because I know we had talked about in the fall doing something on seniors and mental health during the time of quarantine. But I just wanted to see if anyone else who hasn't spoken had any ideas. I know I think I saw sherry's on. If you have anything you want to add or any of the people calling in who aren't members of the board, just because this was we ran this meeting a little differently and just a reminder for everybody that they can unmute themselves. Unlike our normal meetings, you do not need to raise your hand if you're on the phone, it's star six to unmute yourself and for everyone else. You know how to do it. Could I just say something rebecca about the mental health for seniors. That would seem to be something that had that might have some urgency. If there's a, I I'm very pessimistic about this about a second surge and another lockdown or something like a lockdown. Originally, we wanted to actually have that be our meeting this month, but based on the conversation we had at land use, we thought it was important to show that you know we're putting our money where our mouth is and not wasting time to focus on these concerns but seniors. But it's also a racial equity issue, because a lot of seniors who have more money, have access to private health, insurance and private therapists and private ways of dealing with with the quarantine, even like having access to technology and being able to facetime their relatives and their friends and being able to watch nightly opera streams or look at museums or find access through other mechanisms of staying in touch with people. While with the technology divide that you were referring to earlier, they people with fewer resources may not have that ability. So it's not. It crosses some different levels and you're talking about about social justice and providing mental health resources or helping people navigate. That would seem to have some significance, as especially with the merger potentially of more virus and more people staying at home again, and we don't know about their health care. It's all part of the same thing to me, but if you want to zero more in on the on the racial issues by all means, go ahead. There's a few agencies in the district that could talk to that very nicely. I mean that would make a that. Would make an interesting meeting elita, but should that be the digital divide, rather than the health? I mean you can't it's not! Oh, I'm sorry, because it you know it is par. It feels like the digital divide is part of it, but it's also people being able to afford what they can afford or having family members who may think okay. Well, maybe you want you want to spend your time taking piano lessons online or learning mandarin online and other people may not be thinking that, because they're worried about where they're getting food for their next meal. So it's technology, it's money, it's views of elderly people and maybe other communities view elderly people as not disposable, so I think elite. I actually think that the seniors are pretty well taken care of. They are very active in reaching out to their to their constituents to looking into looking into the community and seeing who's needy and who needs food. Getting food delivered, meals on wheels and all sorts of extra food has been flowing, I mean, but I it would make it interesting. It would make it an interesting meeting that we, you know, because maybe there are people that are being missed, yeah, because also peggy and gail had done some work on food in food insecurity and with this nationwide statistics and yes, the upper east side does look after people a lot, but there are also lonely people and the virus has special impacts and maybe racial lines, impact that I don't know it just it just feels like, and maybe everyone is subject to depression and anxiety and stress and all kinds of mental health issues, which is why Cuomo provided mindfulness and yoga and meditation and all kinds of stuff available at no charge for the public. So I don't know, I was just saying that it's not it doesn't have to be limited to a non-racial equity issue. But if there's nothing there, if there's no meat on the bone there, then there isn't and I'm mistaken and that's fine. I think the people. Yes, I think if there is an august meeting, I think the issues of the sort of charge of this particular committee should be directed in august. Toward some kind of excuse. Me some kind of a notion of preparedness for september, and yes, it's partly schools, or maybe mostly schools, but it's all of the other things that go along with it, as the governor may, in fact have said that there are 30 states that have to quarantine. But it's up to individuals to do that, and I think that I think that if we look next month, which is rapidly approaching at ways in which we as a community are prepared or not prepared for what will inevitably come in the fall. I think that it's very, I think that would be an important service for us to do and that's not necessarily tied to issues of racial equity, although in fact it might be as people as people who are either here or not here whatever. But the idea of concentrating on that in august, I think, makes a lot of sense. Yes, I have a suggestion unless we have more issues to bring up how about if at least the three of us work on getting, I guess you can a write-up of the meeting with some sort of agenda or a list of them pass. It around to everybody, that's here and those that sent in you know the sarahs and the billies and the I know, lynn never got on the line. Russell lynn is recuperating from surgery and I know she's very interested in it too right. Yes, I'm sorry, I was muted. Yes, why? Wouldn't it be? Okay? Absolutely I don't know, I don't understand law, so I just wanted to make sure and it's all public okay. I do think that, since we came up with this list together when we want to decide you know what forum or what issue we want to go after first, I do not believe it would be a violation of the open meetings law to meet individually or kind of have do many zoom meetings and we can plan those meetings and again I thought the contact, maybe I'm biased, because I was involved, but I thought the contact racing series working group went really well and I think we can do that for a lot of these issues. I would like one other thing: maybe what people would write back and said? I'm very interested in this issue, I'm very interested in this issue to be able to take some of the lead, because this is overwhelming. I know I know. Peggy has also we've done forums and everything they take forever. It's like a 50-hour week of working on that not anymore so much barbara, because they're really much shorter, they're an hour, maybe an hour and a half around you don't have to look around because even if you know people can zoom in, they don't have to travel right and you're, not looking for space and you're not, but most of us are not going on vacation. Unfortunately, so you know, people are home and august is just another month, no obligation on you guys, but if anyone would have me, I'm happy to work with anyone. I love doing these things absolutely yeah and I think the only the other important thing to note is that anthony and wilma will keep working with you and making sure your committee is involved as well, and maybe the coordination, maybe you'll say why? Don't we do this part of it or something? That's fine. I love your hair. Oh thank you. Thank you, I'm not sure if it's the front hair or the back hair that I use well, you know I'm not sure how long I'm going to keep it, but I'm seeing people in various ways all right. They have a nice summer, but no you're not going to have a nice summer. We have to work yes. So if there's nothing else to be said, no old business, no new business. How excited are other people excited too sure got some great ideas. Yeah. I just want to I just before you go. I just want to remind you of the way that a lot of us see community boards, which is, as I mentioned earlier, to educate, to inform, to provide ideas to provide a pathway to the government, and so these kinds of forums are all of those, because you can call in government agencies to appear on issues. You can have other outside speakers and they're all really good, and if you get a big audience great and if you just meet one person's expectations and make a difference to that one person, then I feel like we've done something. So you guys are all really. You have had great ideas. I feel like the short end of the stick, but just if you want to do august, that's great and you don't have to there's no obligation. It's really your committee. So forgive me for interrupting started right before you got on. I said I don't know, I'm going to tell you what a leader has talked about, so we already talked about it, and I think that I know peggy, you don't agree, but does everybody else agree? That august is. We should aim for august yeah. Prepare september, unfortunately- and I think again just what I said earlier- that we are totally- we totally understand that the board member can't come because they're not usually expected in august, and then I think we have it we'll be right to go for it. You're coming on vacation, you're, very jealous so show up so we're not jealous, and thank you everyone for coming and participating, and does anyone have a motion? I do I just go. Wait. Question quick question: are you going to send a google doc? Are you going to start a google doc about like ideas or like how like, what's the next step? What what's the next thing we should do? Should we write our own and send it around like? What do you want? Should we do the minutes on a google doc? I don't know what do you want to do? No, I think we every since this is a formal committee meeting we'll have to have the minutes and we'll work together. The three of us. I always take crazy amounts of notes, so we'll try and make sure everything gets listed, and that can be the starting point for if I can just make a suggestion, you may want, when you're, sending ideas around not to attribute them to anyone, so that there's no reaction to someone liking or not liking the person making the suggestion what I meant was, if you say I'm really interested in the preparedness one which I assume you are a leader that you would say, I'm interested in this or some sort of note, and if peggy says well, we want we put in nursing homes and peggy says our committee is doing this. You could be joint with us peggy. You know that type of thing or if ellen billy and wilma say I'm. You know I want to do the criminal justice part of it or that type of thing. That's what I meant I didn't mean to say somebody said no to this, but everybody else said no. I wasn't. I wasn't meaning that I was just meaning that when you're sending around idea like if you're just sending it around to just say these are suggestions that were made. How do you feel about them rather than saying that wilma and billy suggested or peggy or elita or somebody else, so that, let's just do it, but hopefully maybe some note yeah, just a list of primary topics? Generic topics would be fine that we think I have one more question, I'm sorry to be the question delayer of meetings this is actually for will will is this? Is this record, like I see on my screen, it says, live on youtube? Is this recorded at the same time? Okay, so then, I'm going to raise the question of. Is it necessary for us to have minutes since the whole yeah 100, yes, and that is by the executive order, we're still supposed to be making minutes? They didn't suspend that part of the open meetings law all right. I am not 100 sold on zoom meetings forever, as I've made clear in other meetings. But one great thing is, you know, unlike previously, when only our full board was streamed now everything is streamed. So that is one great thing, but we still need money is here for to do the minutes. I'll do the minutes. I don't mind doing minutes if everybody else helps, but I don't take notes. What I do is I listen to them. Yes, motion to adjourn. Second bye.",
        "summary": "This is the health senior social services committee, which also includes a criminal justice or when one chair left alita, asked.\nI did speak to people and write to people, and people contacted us and sent information, so I think we'll start with the last part of it, which is criminal justice, because I know that's what billy is interested in well.\nCan we think about a role in addressing public safety and criminal justice, issues?\nSo I'd like to see us do that, and I think, given that we have the word health in our committee and that we have a public safety component.\nI, know people through my son who work who worked at Rikers on issues with worked at Rikers on with rather sort of Probably the wrong word, but prisoners, and I think that getting a sort of perspective on what that what the criminal justice system means to the accused, is, I, think, very important, and I- think that that's part of what we ought to be looking at.\nThat's, I think, of a committee with overarching ideas within the particular parts, And I'm afraid when we get into the other areas besides criminal justice, that we can, I mean, maybe we'll create 15 months in a year rather than just 12, because right, I don't know I Could it be bail, reform and defunding, or certainly defunding, and talking about other avenues for a pal program or youth program or a community watch program, or something like that?\nBudget, for example, I was just going to say: I thought the contact tracing series went really well, especially because you know each meeting was focused kind of on a different issue And Then the one where we wanted resolution.\nYet these fascinating people that go to bed thinking about things like this, there's a kind of role for the overarching committee, and maybe the issues that were sort of sort of we've immediately zoomed in on which have to do with criminal justice, essentially might not be the most important for this particular committee that this particular committee might be able to focus more or should focus more Can focus.\nI, don't know what the right word is on something like health, equity, that the problems that rich people have better access to healthcare, and so how do we?\nAbsolutely get health care in the same way that the housing committee has to really dedicate themselves to thinking about housing, equity , well, I think pretty much what we discussed before the question that we're talking about all these issues about bail reform and all that, whether it should be an overarching committee or a small committee- And I think that it should be a smaller committee, because if you put bell reform- and you put issues like criminal justice and other things together under that that those issues It, does anybody on the committee or that's on the phone.?\nAnd I think perhaps the idea of having like a big forum where we could get a lot of people to talk about criminal, the criminal justice system.\nI know you want to come up with that with a resolution on this, but it may be that we need to plan for a big event to bring in a lot of people.\nTell me if you disagree, but it doesn't mean that members of the committee can't that we can't have two meetings one month where other people sort of take it over and do things with.\nI mean I agree, but I also found just based on working on the contact tracing series that having working groups that aren't as committee dependent if you're very focused and interested in one issue, could be a good use.\nAs far as september is concerned, I think that the primary overarching issue is going to be what's happening with the schools, because that is an incredible incredibly large and impactful decision, because you know parents have to deal with.\nCould you make a subcommittee that go back and to look into the timing and some of the people that might speak on some of the social service, juvenile criminal culpability issues, because august is a lousy month, regardless of pandemic?\nI actually think that merrill is right that you know the committee can do preparations in august and then have speakers lined up for september.\nI there are a number of community boards that are actually meeting in august, even though they generally don't because of things starting up again and issues that are really crucial.\nThis is the first thing of health by the way just to get through with seniors, I mean, I think.\nI, don't know what just what people think of that issue.\nOnly thing I was against was an unnarrowed focus on a specific area of health care, but no In fact, I asked sarah if she would be able to help us with it, and she said she does have people from.\nWe have to make sure that we're looking at some of the other issues involved, right, and I, think we can get people to do that.\nI think we need to look at the changes in medicaid because it is disproportionately affecting people of you know.\nThe people need right, So well, would that fit in, because I would like to focus on the fact that this is a a committee for racial injustice that we're talking about today.\nIf there is a second wave, more people will lose their jobs, so I think the committee would be doing the public a huge service.\nYou could have a session on finding insurance and how you do it, regardless of whether your old young, rich poor, but it's paramount on people , I think it's very important, because I I'm having a problem at high school september, 33 at new york hospital, because nobody, I'm getting my doctors- I know those are at those hospitals of the stupid school hospital.\nThis conversation underscores the issue here that there's a big problem about lack of information, This idea of just what sarah chu said, the idea of committee about our health care and how it has to change and the what's.\nAre you talking about it, because elita asked us to focus on issues, I, think privilege and healthcare and equity, because we're a little unmuted, and I want to keep doing.\nIn a month, we had the small business care program, every other week, so we're going to go to what they're interested in And I'm, not saying medicaid couldn't be part of a discussion, but I personally feel that what sarah wrote was just such an important thing and that would be sort of a big meeting.\nOne other issue that I think elite was, in my conversations with you And, that's public health.\nYou know that that's where they make their money and since the copic thing, not only are they not doing those, but people are afraid to go to a hospital now because they don't want to be exposed.\nIt is basically like city md in their hospital and Is that if you go to city md with a bad stomach ache- And they think you have an appendicitis, they then send you to the hospital here They would you're in the hospital Well, you know, I, think the main point of this meeting was to just kind of brainstorm, especially about issues related to racial equity and because I know we had talked about in the fall doing something on seniors and mental health.\nIt's also a racial equity issue, because a lot of seniors who have more money, have access to private, health, insurance and private therapists and private ways of dealing with with the quarantine, even like having access to technology and being able to facetime their relatives and their friends and being able to watch nightly opera streams or look at museums or find access through other mechanisms of staying in touch with people.\nIt's like a 50-hour week of working on that not anymore so much barbara, Because, they're, really much shorter You don't have to look around because, even if you know people can zoom in, they don't have to travel right."
    }
}