{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 ACES Committee Webinar",
            "publishDate": "2020-11-10",
            "shortDescription": "",
            "lengthSeconds": "1:53:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "bEL0joSZ7uA",
            "fillerWordCount": {
                "uh": 241,
                "um": 317
            },
            "readTimeFullTranscript": "74 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "students": 51,
                "school": 43,
                "news": 36,
                "kids": 33,
                "families": 26,
                "work": 25,
                "bills": 23,
                "street": 22,
                "bill": 22,
                "racks": 22
            },
            "wordCountSummary": {
                "students": 12,
                "school": 8,
                "work": 8,
                "culture": 8,
                "news": 8,
                "space": 7,
                "terms": 7,
                "racks": 7,
                "families": 6,
                "bills": 6
            },
            "fullTranscript": "All about, if you missed anything, just a couple of procedural items, the presenters will present and we'll turn back to the committee for questions and comments and then to the audience the public, if there are any we'll give them an opportunity to do that. Also we'll come back to the committee for a wrap up and see if there's any action items we need to take for that particular presentation. Please remember that if you wish to ask a question: click onto the participants at the bottom of your screen, if you're using a screen and just click onto the yellow hand, signal you'll, see the not the yellow the blue hand, signal the hand will go up and you'll be called upon to ask your question: if you're phoning in star nine to raise your hand and star six to unmute yourself, I just want to recognize Carl Wilson from Speaker Johnson's office who's here with us tonight and I will now turn this over to kit to lead us in the first two presentations thanks Alex getting a little bit of an echo there, we go we'll keep this short and sweet. Welcome everybody, as Alan said, we do have a good number of things on the agenda, so we want to obviously hear from all of you, but also to keep this moving at a steady pace so that we can be respectful of everyone's time. First up is going to be our friends at street labs, who are here to present about their homework hub on West 16Th Street Jesse. Are you able to move them over so that they can rock and roll I? Believe Leslie has moved over yep all Righty Leslie? Is there anybody else that I need to move over nope? Just me all righty, I guess I do not know how to start. My video I can start my video there we go now. Let me leslie I have not given you that ability to do so. Sorry now I got it all right. I do have my video going now. I can share some photos too, if that's possible, but I can just briefly introduce it and I'll. Then I'll take questions so I'm Leslie Duvall. Thank you for inviting me here nice to be here. I run a non-profit that I started with my husband about 10 years ago, called street lab and we work all over the city and what we do is we create and share programs for public space and we work in parks. We work in plazas. We work closely with the DOT, with the parks Department and with hundreds of community groups that are all trying to improve their neighborhoods through activating public space. So everywhere we go is by request at this point, and so I've worked in Chelsea before in a number of locations, mainly Chelsea park, a couple of the parks in Chelsea in years past this. What we usually do is we have these designed environments and we provide programs when Covid-19 when Covid-19 hit. We had to cancel a lot of our season that we had planned and we redesigned our program. So a lot of our programs usually involve a lot of sharing. We do reading rooms and art stations and exploring stations. We redesigned our programs and came up with a whole bunch of new ideas that we got started on right away when restrictions were lifted, on open streets across the city, working at play, streets, doing obstacle, courses different things, chalk, drawing anyway, this fall I was talking to a teacher about collaborating a teacher at the Urban Assembly school for science, math girls, it's in downtown Brooklyn, and she we were working on. You know what could we do together? She was telling me about the challenges as soon as schools opened up again of you know, of students remaining connected and, of course, you've heard these stories of families struggling to. Maybe you have this experience of trying to help kids with homework, so we came up with this idea of a homework hub outside, and this is what street lab does. We can create an environment almost anywhere a pop-up environment for programming, it's always staffed, so we tested this in Flatbush at a plaza all through October once a week, we did it on saturdays and we had kids come to get help with their homework. One girl from in the sixth grade came every Saturday. We helped her with her math. We had volunteers and we had my staff parents walking by were telling us. It was sorely needed. A lot of kids told us. They do not want to do homework on a saturday, so Saturday's a bad idea, but that was the day we had available anyway. The idea you know seemed to capture a lot of imagination and people liked it and so Chelsea market reached out to me and I've worked with Chelsea market before they have paid me to come and do programs in the lower level of Chelsea market last year over the winter. We did some of our pop-up programs there. So a lot of our programs are philanthropically funded. We get funded by the city, the Department of Cultural affairs. You know different agencies and then also foundations, but in that case Chelsea market paid us to do that work. In this case they are giving us some of their community engagement, grant they're funding us to create a homework hub on West 16Th Street. So they reached out to me- and they said, we've got this our idea for the winter, for these homework hubs is to. We were looking for places wherever there might be heat lamps. So you know the one we did in flat was closed down because the weather was beautiful in October, but now it's going to be colder last week was freezing today. Of course, you know we forget all about that, but but there's no heat there. So we said what, if we could continue this when people need it most, we still need to be outside. Students need to come together face to face, they need to get out of their apartments and away from the screens. Could we do this? Where there are restaurant setups with heat lamps? That was the idea. So we looked at two lo. We looked in Chinatown reached out to the bid there that I've worked with before looked at a couple of restaurants and then Chelsea market reached out. So what we're doing is now every Tuesday from two to five on West 16Th, Street, Right outs, next to Chelsea market using their outdoor dining setup, we're setting up a homework hub, a staffed environment where we are keeping the table separate, we've got masks, we've got hand. Sanitizers we've got staff to make sure it does not get too crowded and we're inviting basically we're inviting the community to use it. We, you know Chelsea market said: maybe we should wait a few weeks and do more outreach and I said. Let's get started right away because of the weather and the Covid-19 situation. Just do not know. What's going to come, so we got started, but I did do outreach. Last week last week was our first day last Tuesday tomorrow, we'll be back and I connected with Miguel Acevedo who's, the Tenant Association president at Fulton houses I also reached out to the tenant association at Chelsea Elliott houses and to all the PTA all the PTA groups in the schools in the vicinity. So I sent an email out to everybody about this. The group that's going to use it. The most I think is going to be the Fulton House residence, because we've hooked up with a wonderful woman who's been doing this all on her own, an after-school program with 15 kids that had to shut down in March because they were using the Tenant Association office. They have not met since March she's, desperate to meet up with her students again and continue her after school program, so she's going to bring her kids over she did last week. She got a few of them over and she'll, bring her kids and use the space, and just basically you know it's there as a social environment, but also, of course, homework help we'll have volunteers. There. We had someone stop by on our first date, who was you know, studying for her S-H-s-a-t and she just put her headphones in and was like great I'm going to sit out here and I'm going to do my work and she did her studying, and you know we have kids who are coming and they're just some of them are not doing homework they're just hanging out, but that's fine too. So now, I'll take questions. Folks, if you all have questions on the committee like Alan said, please use the raise hand feature just click on participants, I believe it is, and then you'll see it and folks who are joining us from the public. Once we hear from folks on the committee we'll shift over to y' all any questions for Leslie Sarah I saw you first and then we'll go to Judith hi Leslie thanks. So much for letting us know about this homework help I think it's definitely an awesome thing. What is the age range for the homework help or is it kind of just k through 12, and then people are there as far as anyone who can specialize or help with certain subjects within those age ranges exactly I mean we'll see what the needs are and if and if we're challenged, I'll figure out some way to deal with it. Some of my staff has been a little nervous about helping people with their math, so we've gotten some high school students who are recently graduated so actually the New York City NYC museum school, which is right across you, know right nearby, they're, sending a bunch of their high school students to volunteer, and so the other group that this is impacting is high school students who can no longer do community service. They have not been able to find community service opportunities as easily so I'm hearing from a lot of teenagers too, who are really eager to get those credits and also get out of their houses and engage. So we had. We did our homework hub in Chinatown just today, our second one and we had a bunch of teenagers come out and I'm hearing that they're pretty lonely and they want to engage so so I think it's going to be great for the teenagers too. So I did reach out to a couple. You know say to the high schools. Not only can you come and do your work here and meet up with your friends to do your work together in study groups or whatever you can help the younger kids with their homework, especially if you're close to the curriculum than people my age. So yeah, that's wonderful! Thank you! All right, we'll go Judith and then Josephine. Okay, thank you leslie. You answered my question because that's just what I was looking to find out. Thank you for all the information, but I was wondering. I work at the high school and I was wondering if the students could use it as a community service and I was just not clear exactly what time you said tuesdays from two to five. Was that correct? That's exactly right, Tuesday's, two to five yep and we're going to keep it going into December, and that's all I have funding for the moment. But we'll we'll see if it's you know if it's working I want to do it in January and February if we're not freezing and Chelsea market's working on the heat lamps, so they'll have those soon and just to clarify. You said the people that are teaching are helping. The homework helpers are volunteers, they are volunteers, yeah I have staff there, I would not say they're trained to be tutors. My staff, my staff, is experts in pop-up and engaging the public and making a safe environment. That's why I'm reaching out to volunteers but I have hired. You know a kid who just graduated from Stuyvesant to work for us, and so you know I'm getting some ringers in there, but and he's done tutoring, but yeah I mean it's really designed to be more of the kind of help, I guess as an alternative to parents trying to help their students, that's kind of the vision, but I'm welcome. You know I'm open to any ideas, and certainly you know any more. You know we can bump up the level of the of the volunteers. If you have any suggestions for me, so that'd be great I. Thank you very much. Can you put your email in the chat, so yeah we'll do that right? Now, I'm just very pleased to hear about this because I did not know anything about. It sounds like a great idea. We just started so great okay. Thank you Jerusalem. Yes, thank you so much leslie for this presentation. This is just a fantastic idea and I really hope that families take advantage of this. I'm wondering how many students are you looking to accommodate at each session every Tuesday, or can you accommodate and also what your response has been from contacting local ptas yeah I've gotten a couple of I've only gotten about two responses: the museum school and then there was another school that emailed me back and said. This is a great idea. Can kids, you know, can kids volunteer so I have not gotten many responses to those emails. I'm hoping the word is going around. We did also put something I think there was not something in the newsletter for the meatpacking district that went out. I contacted Corey Johnson's office as well anyway. What was the other question? The other question was oh: how many can we accommodate I would be happy if we had a crush of people and we had to say you know come back later or I mean the good thing about the setup. Is the tables are very. We have a long stretch that we can fill and use, and the tables are all spaced six feet apart. Chelsea market has set it up that way, and it is, those tables are underutilized from two to five on on tuesdays along West, 16Th street I think there's more people eating on 15th street, so the tables are available. So we could certainly have more people we're going to make sure that it does not get too crowded. I mean I, think they're still in Chelsea, there's the 50 person limit in other parts of the city, I'm having to contend with 25 in one case Flatbush for a little while it was 10 people, so my staff will be in charge of making sure we do not get too crowded. But I, I'm going to say that I just welcome everybody. We can manage the crowds. That would be fantastic if it were, if we had to do that. So at a time you know again the tables there's probably 10 or so that each seat, two people that are pretty well spaced out yeah and do you have like a flyer with all this information? Is there a website? Okay, because they're doing outreach yeah that yeah, absolutely very helpful, I think that middle schools for certain you know there are a couple in that area that I know one in particular, who could certainly use some of this help elementary? It might be a little bit hard because parents, you know they have to get them there, but certainly with the middle school. We can try to push that and I just want to at least make sure that they know that you're there. So, whatever link you can give us I'll certainly pass that along that's great, the link I just put in the chat, if you scroll down, there's all kinds of assets there for printing out flyers or doing social media posts and blurbs about it. You can also see where our Chinatown hub is yeah and also what was I going to say, yeah. That would be great, I. Think yeah, oh, the other thing I wanted to say was also if people know of after school programs that have been cancelled, I welcome, partnering, with Annie and all groups. So again, once we've created the space, let's use it any groups that want to use it. Please come and use it bring your students, you know so I'm open to everybody using it. Thank you. Yeah all right, Jessica has her hand raised. We have one question in the chat and I'm not seeing any questions from the public, so Jessica will take. You I will take the question in the chat and then we may be moving on to our next item. Great, thank you and thank you leslie. This is really great and it's very inspiring to see someone just taking action in the way that you are and I'm just curious. There are a lot of people on this call who are connected to students and educators, and I'm not one of them, but I am curious like what and maybe it's funding you alluded to only being able to continue this as it stands right now through December, but like what is it? You need to ensure that this is successful like what has you concerned right now, I think just participation, I would really love students to use it, and so I mean we just started last week and we had a couple of kids use it, and you know that was great, so I mean when you go through. You know when you do it, you just want people to use it, so I think yeah spreading. The word is great and particularly to- and you know getting a few people here- and there is fine, but also if there are groups that you know of who are looking for other ways to other. You know other ways to continue meeting in a safe in a safer way. That's outdoors. That would be great. That would be a huge help and yeah, and that's if that's if that works- and we have lots of kids using it, then I have an easy case to make to funders to continue it right and we know it works so then it would. It would all be clear. So that would be helpful. That's great! Thank you all right. The question in the chat is: will the heat lamps be electric or log a log or that there's propane I do not know about log ones? That's cool I mean I, know lpg I wrote lpg. Maybe it came out typo I apologize, but okay, which is propane, which is very dangerous, okay. Well, this is a whole issue across the city and I. Do not I do not know anything about heat lamps and what than the proper ones are Chelsea. I'm going to leave that to Chelsea market, to put it on their liability and their and their concern over their customers, so they will be they're going to be providing some heat lamps they're working on that now and researching it. I'm not sure what they're deciding I know in Chinatown. They've got a propane heat lamp, so they have that big. You know and I know the city has given me yeah. There's regulations are screwy with that, but yeah so you're aware you're putting your students at danger. If something goes wrong because it gets yes, I would try to steer towards electric or another method. Okay, I'll pass that on I'll pass that on. Thank you all right, friendly reminder for folks in the public. If you wanted to ask a question participants at the bottom of your screen, most likely and then Ray's hand is how you indicate that I'm still not seeing any so leslie I think you might be out of the hot seat, but just want to echo what other folks on the committee have said. This is a really inspiring program, and hopefully we can help spread the good words that more students and their family take advantage of it Jesse. If we have not already, can we blast this out through our email? Yes, I just sent the link that Leslie sent us with the flyer for the West 16Th Street location to our social media person, so she'll probably blast that out tomorrow. That's great there's any other connections that you think that we can be helpful with. Please let us know okay. Well. Thank you all. Thank you. So much thanks. Leslie appreciate you coming darren tonight and I hope that you are seeing a surge in demand very soon. I. Believe next up is our friends from avenues Jesse. Would you move them over to be able to speak to everybody? Please Morgan! Yes, hi. Can you all hear me? Yes, we can morgan remind me who else might bring you over from avenues: CEO lupin, our head of school Evan Glaser and our director of Admissions David, Buckwald, Great good to see everybody hi everyone. My name is Evan Glazer, I'm head of school for avenues, New York, it's so wonderful to join you. Today we are in our ninth year in the CB4 community in West Chelsea. Certainly, we strive to be good citizens, great neighbors and visionary leaders in education to prepare our students for a bright future. I am a resident in the local area and am really proud to be part of the community and to see the engagement of our school with the community in different ways with me. Today is Morgan Jones, our director of community engagement partnerships and also Dave Buckwald he's our director of admissions and enrollment in our presentation today, Dave will start off by sharing a little bit about financial aid and admission and participation of residents of CB4 at avenues, and then Morgan will follow. With talking about some of the engagement that has been going on over the last year. Hopefully, you've received a report that describes a little bit of what we have been doing and if you have not had a chance to read, it certainly check it out. After our meeting today, Dave thanks Evan good evening, everybody nice to see you all my name's Dave Buckwald and I'm in my third year in this role at Avenue. So I was with you in person for our last two fall board meetings and good to see many familiar faces. I know you got the report in advance. You probably have a sense of some of our statistics of our student body. I thought I would share. Just a few highlights around admissions and enrollment. Our CB4 residents comprise about 22 percent of our total student body, and that is consistent with prior years our CB4 students have been, on average about 27, more likely to be admitted to avenues than those who reside elsewhere, which is usually in the five boroughs of the city. Our financial aid program, which I know you know from past conversation, is exclusively need-based and we aim to meet 100 of the demonstrated financial need for families at time of admission, and that includes CB4 residents and how we do that is through grant, which is need-based scholarship, meaning families do not need to pay it back when a child leaves or graduates from avenues. We had just this past year, 21 new eight awards that were made to CB4 residents, and if you look at students who graduated from the from the Community Board families, who maybe moved out of CB4, there's a little bit more movement than normal, given Covid-19 and or leaving avenues, we ended up with a net increase of 10, more students who are on financial aid from our community board. Our investment in aid, as you can see, has steadily increased. Over the years we awarded a little bit under 12 and a half million dollars in need-based financial aid, in total, of which just over two and a half million or 2.5 million plus was offered to CB4 residents. I can certainly I, maybe might turn it over to Morgan for some highlights of our community engagement and then, of course, if you have questions sure thanks a lot David and again great to see the entire committee here, Alan great, seeing you again as well too and hi kit. Congratulations to the co-chair level here as well, too, and last time I saw everyone was in June as well, and thank you so much for the commendation from the full board as well so yeah as Dr Glazer mentioned, I'm director of community engagement and partnerships at avenues, I'm just over a year into my role, and it's been really a wonderful experience working with our school community here overall and partnering with community Board 4. yeah. As you can see from our report, the 2019-2020 school year has been one like no other for sure, especially with regards to the pandemic and so on. So while in the fall, it was really great to connect with the Holy Apostle Soup Kitchen and have our students perform for patrons there, as well as at the Hudson guild on a monthly basis connecting regularly with our elliot Chelsea house's neighbors, our fulton houses neighbors. Definitely when the pandemic hit during the spring- and that was during our spring break, a lot of our community engagement strategy changed and also we had many members of our community just wanting to mobilize and think of ways to help and if it were not for you guys in community board, for you all community board, for my goodness, I mean it's just. It's been a really great partnership to work with you all here, and a lot of those opportunities are listed in terms of what we've been able to do with you all, but even since June, since we were last here, we've still been doing some really interesting work as well. We've held two socially distant book fairs with the elliott Chelsea houses. One of them was as recently as this halloween, so it was really great to work on that. Currently, right now, we are having our seventh annual food drive with the St Clements food pantry, which is also within CB4, and, of course, I mentioned last year. We have a regular community design incubator that we work with for our seniors, where they come up with innovative ideas and ways to partner with our various community members through their curriculum and lots of partnerships with Holy, Apostle, Soup, Kitchen, Penn, South and other neighbors as well, and hopefully that will help build into that one day that we can all connect directly in person. But we'll continue to do what we're doing as far as engagement, virtually overall and I just kind of want to wrap this up by saying two quick things. One is an ask to you all and the other is another final thanks as well. Firstly, the ask is actually we have a seventh grade class, that's working on a portrait project and usually this Porsche project is you do a portrait and you get a story from various family members or people that you know in your immediate circle, but this year this portrait project really wants to focus on community, and so we've already engaged with the fulton houses and a couple of you here as well. But I'd love to get more members of the committee to join in. It's a really cool art and english project, with our seventh graders and I think it'll be a really great way to create an interesting relationship, an even deeper relationship with you all on the committee and then lastly, I really want to thank. Thank you all, of course, on the committee and the full board. But of course, Jesse bodine who's just been a really incredible partner on everything that we do super reliable, always great in following up and a lot again. A lot of the opportunities was because of him and through the work of this committee, it's just been so instrumental to helping us make sure that we are able to do really great dynamic, mutually beneficial work during these really tough times and get our students, our families, our faculty and staff, all together fully involved. So those are my points and if you have any questions, please feel free to. Let us know. Thank you, questions for the team from avenues. Nobody has one I do have one okay looks like I might be the only one bear with me on this and correct any of the details that I'm getting wrong, but I believe that avenues has created a program where a family or a group of families can get an avenues. Education in a pod setting I was curious if you know, because I skimmed the report, but I did not see it. Our CB4 families participating in that to any extent, and how does need-based financial aid play into that, offering that your school has started to make available to students and families. Sure I could maybe just jump in. We offered a variety of solutions, enrollment solutions for families who we currently serve at avenues, New York and that included CB4 residents. One of the big ones was for many families the if they had temporarily relocated our avenues. Online campus provided for some a different price point, but also provided the convenience of a campus that was designed to be online versus, say our avenues: New York campus- that switched into distance learning. Two extensions of that included the opportunity where some families could, as you suggested, perhaps form a pod they're, pretty small pods to perhaps have a teacher come to a family's home or apartment we also created and already had in the works, a micro campus of sorts, so sort of intentionally small to be about 60 or 70 students out on eastern long island. There are CB4 residents who opted in to participate in all of those programs, and there are CB4 residents who've received financially participating in the programs, one other just a sort of asterisk. There is we did. We are open. This fall with a lot of a lot of safety protocol in place, but we are open five days a week in person on campus for students who are in sixth to twelfth grade. They have the option to flex meaning they could possibly be in sort of a hybrid type environment. So we offered a lot of solutions to families and I do think. Cb4 residents were not different than residents of other community boards in the city and taking advantage of those opportunities. I do not know if I missed anything dave. Just to add one other point, so on campus, as David mentioned, we're going five days a week and we're now two months which is really fantastic. Can't the campus actually operates like a hundred different pods, so imagine you're a one-room schoolhouse Morgan's, actually leading one of the pilots. We have, you know essentially no movement within the school except in that core classroom, so the kids essentially have their own family at school as their podmates and then within that that's kind of what how they, how they spend their day. So we're running school very differently and the intention is to be incredibly safe and we're really proud and pleased that our community has been able to remain looks healthy. We have a question from Judith hi. Thank you very much for this information and I'm and my question is about the portraits within the community, because I also work at the high school fashion, and one of my colleagues is also doing a portrait within the community. So I thought maybe we could work together. So if you could put whoever's in charge of it in the chat- and we can probably network and figure out because I'll just send you her name or send her your names, but it sounds like she's getting a lot of people within the black associations and great people, so I thought maybe it'd be a good I. Do not know you plan on showing them somewhere or what are the details of that yeah? We definitely want to show them somewhere. I have to speak with, so it's the art teachers who are running this as two art teachers that are running the program, so I have to find out where exactly they want to show them. I'd love to show them community wide in some way, shape or form, given the community nature of this as well too and open a feedback on best ways to do that. But yes, please reach out to me I'm happy to connect all of that together. I am Morgan Jones at Avenues.Org. Is my email address, I'm putting that in the chat, but of course, a few folks here already know who I am so I'm happy please. Thank you Judith. Absolutely that sounds good I think my colleague who's working on it is doing this for her administrative license so I. I'm so surprised that you're doing the same thing and it's really a nice community outreach. Thank you love it. Thank you so much. Thank you. Okay! Could I ask you a question. Yes, absolutely hi, guys hi Morgan hi David Hi Evan. Could you guys a couple things just for edification for the for the committee members I'm going to just put in the chat a couple links to the letters previous letters which I think not right now, obviously, but whenever you guys committee members want to take a time to look at the you know the relationship that the board has had with avenues. I think it's helpful to understand where some of this all comes from and but I think, if you guys could also maybe go on a little more detail on your relationship, maybe with fulton houses and the work you guys have done there I think that would be beneficial to for the committee to understand. Oh okay, great I can go, I can start there. Yeah. There's lots of different pieces and ways that we work with the fulton houses overall, so I'll speak. Firstly, I meet regularly with Miguel Acevedo, probably on a bi-weekly basis, at least sometimes more actually and we'll talk about all sorts of general regular issues and check-ins, we'll invite him often to many of our classes. So he's actually visited the community design incubator class to speak about the fulton houses. I previously hosted a class about government and community relations 101 to some middle schoolers during the summer, and he was a guest speaker for our first session. We also held an art illusion project, where a group of our students, along with a group of youth from the fulton houses and our school developed murals and one of those murals, is hanging on 18th street right above the houses there and we're looking to try and place the other half of the mirror on our building at some point soon, once we're able to do that, we also visit their any time that they have some sort of regular tenants, Association meeting. We attend that. It's also an opportunity for us to share not only general information on what our community, what our community engagement work, we're doing with our students what's happening as far as that's concerned, but also an opportunity to share that. We also have admissions and you can apply for avenues and definitely do it and I'm more than happy to connect you with Dave and staff here directly to help you help walk all members of the fulton houses through the application process, as well as, if there's any need for this. But you know financial aid related process as well to allow the same information that David shared as well too we'll attend any events that Fulton houses, hosts, I, think one of the last events I remember, attending and actually Dr Glazer was there with me. It was a there's holiday event. There was a Christmas event that we had participated whenever there's national night out we'll participate and show up for that. Try and get as many of our students to engage directly with Mr Acevedo and the rest of the tenant association. Some of the students already know Mr Acevedo by name very directly, and so there's just all these various opportunities and ways that we'll partner with the fulton houses and so even though they're a little bit further away from our school per se, we're much closer to the elliot Chelsea houses. That's directly across the street, we're all within CB4 we're all neighbors we're all within Chelsea here, and so that's how we'll directly connect with Mr Acevedo and he's just been really a wonderful guy for the rest of the community there and we'll still reach out to other tenants within there as well, so yeah. We hope for more opportunities down the line to work more with him right now. Everything is kind of virtual, but he's been great on zoom through all the many zoom calls that he has going on, which I'm sure many of you participate in some of those same calls that he's a part of he'll still take some time to meet with us text me reach out to some of my colleagues even to come up with interesting opportunities and ideas and ways to work with our students and faculty staff. Sometimes even our parents as well our families, which is just a great way to work so and obviously the fulton houses are not the only ones. There are other groups like that they get similar connection and relationships as well, because we're all raw neighbors all right, I am not seeing any further questions from folks on the board when I clicked over to the public I did not see any raised hands there, so I think all that's left is. Thank you team avenues. We appreciate you all and realize that this is not the relationship that every community board has with an independent school in its district. So thank you for regularly coming back to our meetings. Thank you for being proactive about partnering with us, and other organizations in our community and I can personally attest to the fact that if you email morgan, you will reply very quickly. We go after whatever you're suggesting, so he dropped his email into the chat. If anybody has anything you want to put on his radar, thank you so much for having us, thank you for being so welcoming I. Think I'm turning it back over to you allen. Thank you. Thank you, gentlemen. Thank you again for coming in tonight. So we're going to switch over to arts and culture and I'm going to ask David Pinkis from our arts and culture group to maybe just give us a very brief intro into who's here and why they're here and then we'll turn it over to our attendees. Hey alan, hey everybody! So we there's two bills before city the City Council right now that Amy todderoff, who is the managing director of the League of independent Theater, is going to chat about and kind of, educate. We're looking to perhaps you know, get perhaps a letter of support from the committee for this open cultural ultra, open culture policy that we're going to hear about. She has a member of Jimmy and Bramber's office. Who is the sponsoring the bill so we're going to get a real kind of a real good look at the inside baseball and politics of getting this bill passed so leave it to Amy to to inform us all. Thank you, Amy hi David. It's so good to see you again and Alan and Kit and hello Carla from Speaker Johnson's office and the entire CB4 ACES committee. I really appreciate you giving me some time to speak today about these really important bills. I have had the opportunity to speak at an earlier meeting, so I will take this time to give you an overview of the bills and then turn the discussion over to Jack Bernatovics, who is the cultural liaison from Jimmy Van Gramer's office, and then, as David said at that point, we hope to have a lively discussion and earn your support for these bills for open culture. So the bills are numbers 2068 and 2034. collectively, they're known as the open culture bills that work together to activate public outdoor space for cultural organizations during the Covid-19 crisis. So first bill 2068 uses the open streets model, but instead of focusing on restaurants, it would allow cultural organizations to access open streets and other outdoor public spaces through a streamlined one point of contact permitting process and I can tell you. The current system is very convoluted. I recently went to a webinar that was just to list out the different agencies involved in getting a permit and that Webinar was two and a half hours long with no Q&A, so groups are really in need for a streamlined process there they apply for permits and never hear back, realize they're in the wrong department or worse, their promised permits and never hear back or the permits never come, even though the permits are promised bill 2034. The second part of this proposal organizes the events into a map style app that new Yorkers can use to find these events in their community friends. I can not tell you how many parents I've heard from who are desperate for ways to find safe outdoor activities for their children, that are educational and keep their kids mind stimulated through this pandemic. So this would be a very powerful tool to keep neighborhoods active. So in previous CB4 meetings by far the biggest concern shared by the community that I heard was the empty public spaces are contributing to what can be perceived as an unsafe environment. Our streets no longer have the foot traffic that fuels local economies and a sense of neighborhood identity. These bills solve that by getting people into their communities in safe ways. These spaces, when they're activated by small scale cultural activities, become spaces that discourage loitering and create and encourage a healthy sense of neighborhood ownership. So we understand weather is changing and outdoor activities are not likely to be viable much further into this year. Despite what we had outside today, and even with the announcement of progress on a vaccine, we know that we will still be in some state of quarantining through next summer, with a mix of working from home and home learning. Being the reality for the foreseeable future, so these bills offer alternatives to screen learning through outdoor readings classes, small scale, performances, the cultural activities are still bound by all safety protocols, including gathering limits masking and sound regulations. So no loud amplification and these activities, unlike dining, do not require you to take your mask off so to help visualist visualize this, because sometimes they think we just default to the Big Broadway scale model. This is not a bill for a 500 person cast belting out hello. Dolly that's not going to happen. One of our cultural organizations as an example is Pm2 productions. It's in CB4. It offers a 40-minute show for four to ten-year-olds that teaches the essentials of storytelling along with self-confidence. This shows presented in English, Spanish and chinese. Currently, there's no pathway for this production to be held outdoors. These bills would allow that production to move off the zoom screen into public spaces where families can safely engage. However, these cultural institutions need to be able to plan for their outdoor events for next season, which is why the we need these bills to come before a vote and be passed sooner rather than later and right now they are not quite scheduled for a vote yet so we really do need your support for them. Plus these cultural organizations are facing the same reality as all the other small businesses or operating at 25% capacity. If and when they're allowed to open, just does not cut it financially and they will be forced to close for good without some form of relief. Now we do not think these bills are going to solve their financial woes, but for them to continue to access the small amount of grants that are often the difference between closing and barely just making it even at the best of times. These organizations need to keep presenting work and engaging with their community. So these bills, let them do that which keeps them grant eligible, which gives them a fighting chance to stay open, and if the organizations can stay open and engaged, there's some incentive for those residents who might otherwise flee the city to stick around and stay in their neighborhoods. So one of my favorite things about this bill is that we all know it's no secret, that New York City is going to be facing a pretty serious budget shortfall. These bills offer a creative community based solution for some of these biggest challenges that we're going to face in 2021. Allowing artists, poets, visual artists and teachers to activate these public spaces creates an unofficial city workforce they become caretakers for these public spaces baked into the bill is the obligation that these groups ensure the spaces are clean and well maintained after use. So that is a welcome relief and a partnership for overburden City agencies. We know outdoor activity is better for the health of new Yorkers. During the Covid-19 crisis. We know culture increases the quality of life and it revitalizes economies. I, do not feel like I need to go into the larger picture of why culture is important, but we know open streets will work because we've seen restaurants use it this summer. It's just the logical conclusion that cultural events can be successful with this model as well. I think about the paint and wine type lounge that is already in existence in CB4 and I have one right outside my window that offers painting classes they're currently allowed to operate this class outdoors specifically because they serve food and drinks, even though people are primarily paying for the class. So why not allow an actual painting class to operate the same way through open streets without the burden of serving food and alcohol and that forces people to take their mask off? We are really grateful that council, member Van, Bramer and Speaker Cumbo have shown foresight in bringing these outdoor art culture bills. These open culture bills to New, York's public spaces, we're asking for CB4 support. We need to get these bills to a vote. It is imperative to the continued vitality of the heart of New York City, which I think CB4 really can qualify as one of the heartbeat areas of New York and with that I'm going to throw it over to Jack. Who is one of the key members of council member Van Bramer's team who helped write these bills and he can add his insight and answer any questions that you have hi everybody Jack Bernadovich here with council member Van Bramer's office, I'm council, member Van, Breemer's legislative director and cultural affairs liaison since before Covid-19, and since I've been working closely with cultural institutions across the city and through conversations day to day with those groups and artists was a need to bring culture to the streets of New York City. The city is a stage. Why do not? We have ways to allow these organizations and artists to bring it up to the streets easily. So that's what these bills are pushing for and Amy did an incredible job, explaining the heart and soul of these this package of bills and I'm happy to answer any questions about the logistics. The nuances the day, like the nitty gritty of it so happy to open it up to questions and then answer it from there and we also shared I shared the build language in the chat. The links for both are being updated, so I do not have a like latest edition, they're still being updated behind the scenes. So I'm happy to say what things the council, member or the chairs have committed to updating, but I do not have like the latest version available to share okay, all right. Thank you, jack before I go to the committee. I have really one kind of question. If you can explain, the bill has been there since August, so in terms of the process of getting these bills through. You've had several hearings from what it looks like on their website. What's holding it back, is there any pushback from other members on this? What's going behind a little bit behind the scenes, so to speak in terms of why the bill you know something like this should have popped out in you know, September or something or on publishing and fine sign. You know on the mayor's desk. If that's, where it's supposed to wind up I agree with you, we should have had this months ago, but with this, so we originally proposed the idea back in the spring, and it took some time to get a first draft of the legislation ready to share and to introduce we've had a public hearing on it. So cultural institutions, artists and supporters of this bill were able to present to the City Council and support it. And now we are in kind of the negotiation phase. We are having conversations with the mayor's administration about ways to make this work together, work together to make this the best bill as possible and we're seeking support from other council members right now. We have 16 council members signed on to the bill and the support of any and all is welcome and it helps push it forward as well and then also the sport support of the speaker as well, and helping move this bill forward too. Okay, so just what is it going to take to get the bill pushed? You need more council members to sign on to it. You need I. Do not you know. Just trying to get a handle as to you know what pushes this forward, obviously they're, not setting up a separate agency for this, so there's not a real financial problem with it. It's not part of you know. Maybe some you know street furniture of some kind to keep things in order, but yeah I mean I, agree. Allen, I'm wondering if we were to write a letter. If the committee decided to support these initiatives, who would the letter be best posed to just? Would you politically? Where do you think it goes to the mayor to corey, to to individual council members who are wavering? What's our best strategy for supporting this, the bills yeah well, first, a letter from CB4 would be incredible and very helpful for this and I would say to the mayor and the speaker of the City Council from the speaker's perspective. This is a piece of legislation within the council. He controls the political agenda for the council, so putting that on his forefront and his radar would be helpful and from the mayor's side the mayor, similar to open restaurants, could do this without legislation and legislation could come later to codify it and so they're the two who could help push this forward from just an idea and into implementation and something that cultural institutions would be able to greatly benefit from very cool all right. Let me go. Let me go to some other members of the committee. Jessica, you had a question yeah I can this is great and I think the open space concept is would be really wonderful. I mean I have a couple of questions that I'm going to focus on the app in particular and I. Guess it's the 2034 piece of this, which is like we just finished our own kind of discussions around budgets. Amy. You alluded to the fact that city budgets are incredible, going going to be incredibly challenged and I. Guess I'm just I'm hesitating. I'm feeling, like I'm less clear, why there needs to be an investment in an app like I mean I, get it conceptually, but is that really the most important thing like I do not know it just feels like there are a lot of people looking for things to do these days and I do not know that anybody's going to be downloading a city app to be connected to the most exciting things happening right now, and given this challenge of resources I, just hoping, you could expound upon that and also what kind of feedback you've received from those who have signed on about this about that piece in particular yeah. So for introduction, 2034 the app website component of this legislation. This is actually introduced by majority leader, Gumbo and so I can not speak on it as much as I could speak about the other aspect of the bill or the other bill. But I'm happy to answer as many questions as I can so with this. The idea about it or behind it is making all this accessible to new Yorkers, making a way for everybody to just quickly look and see. What's going on in their neighborhood, this is something we needed pre-Covid. This is something we need now and we'll use much further after too, so it's kind of getting it done now. So we have it in. The future. I think is one of the long-term ideas behind it and it will be more than just an app. It will be a website, a mobile and so before app is created, you'll be able to go online on your phone or computer and look at it from there, and the city will already have the data through the permitting system we already have it, which is make it transparent and public and available to people. That's the big idea behind it, but that's kind of like phase two of the open culture phase. One is the permitting system that allows cultural institutions to get out into the streets, use the streets and parks and stages and rehearsal spaces and bringing culture to the people. So it's a two-part thing, so we have introduction 2068, which is the permeating system and 2034, which is the app and to answer your question about questions from sponsors. There have been concerns about budget, but we are negotiating those within the council and trying to find ways to make this come to fruition and just have both bills. Work together, well, too, so happy to answer additional questions about that too. No that's helpful I mean it definitely has my support for the for the first half. The second half feels a little a little more challenging for me just to just justify at this moment, but I also recognize that when you're making policy, you are laying a long road and you're trying to set something up for a future environment, and so I can appreciate the motivation perhaps for doing that. But the realities are also just that. This is a tight budget year and people are hungry for this kind of content, and so I appreciate the transparency angle, but the just the the practical implication for me is a bit a bit harder, but I appreciate you answering the question. I think it's totally understood. Thank you. Jessica blake, you have a question. Yes, thank you for the explanation of the bills and you know I think this is a very important idea. You know my one question is: you know, I think for open restaurants. It's really clear what spaces each restaurant is. You know appropriate for outdoor dining, and you know I'm just wondering in this context how the public spaces are determined, and you know the usability of those spaces for the arts and cultural events are identified, and then you know which organizations or how organizations decide who gets which space in this context, so for the open culture, the purpity program of this, it would be overseen by the mayor's Office of citywide event, coordination and management or SAPO a street activity permits office, and they do this work already. They work with institutions to put on large small events in public spaces and we'd have them be coordinating with the parks Department. So all these public spaces are available for cultural institutions to activate with these programs and to apply for permits with, and so SAPO would be the ones overseeing this process. It is a self-certified application, but all applications will be reviewed and if there are any major flags questions, what have you Saipo and the city will be working with each applicant to refine them and to make sure that they're appropriate for the neighborhood they're in for Covid-19 times and also just making sure that it's fully feasible as well? There's no conflicts with any other city agencies, or anything like that. Yeah that makes sense- and you know, I, think prioritizing the kinds of arts and cultural institutions that are within the neighborhood that you know, they're looking for spaces is really an important one. So thank you, yeah, and to follow up with that of speaking with cultural institutions. The people that want to activate in their neighborhoods or in the city in general are the ones that want to activate their backyards. Their own neighborhoods they're not looking to go. Do a five-borough tour right now, they're looking to do a like neighborhood tour, hang out in their backyard work with their constituents and their people and allow artists in that neighborhood to make some money. Do a gig have a performance and do something in the street or rehearse as well. Hey jack. Has there been a successful implementation of this in any other cities or countries around the world? That you're aware of I mean? Is it? Is it easily kind of ramped up and accepted by people? Do we know anything about about how neighborhoods have you know enjoyed this kind of creativity? That's brought to them. Actually, I have not heard of other cities doing something similar to this. We would be the first and I think New York City is the appropriate home to do this first, because we I like to say the cultural center of the universe and so bringing culture into the streets of the city. It just makes sense and it's something that we should have been doing before and we'll be the first to do it, which is pretty cool. That's even worse, I believe. Yes, we will be the first city to do it exactly like this, but there are models in ghent in belgium and Montreal are also excellent models to look at if you're interested in something analogous, but we would be the first to do it in this specific way, which is very exciting. Thank you, Amy Jack. Let me see you mentioned the parks Department a couple of times. Have you had any contact with them and got any feedback from Clark's department and their willingness to provide space for you when the time comes? Yes, so parks testified during our committee hearing and with their thought about this and parks groups as well. These are non-profits that help coordinate certain parks throughout the city like friends of the highway, would be a good example of this. They are supportive of the bill. They want to bring arts and culture into the streets, they're just hesitant about gatherings and making sure that the spaces are controlled fully because they do not necessarily have the maintenance staff or extra staff or the funds to hire extra people to kind of control, crowds and control. Events like they normally would be able to, but with conversations with parks and cultural institutions. The idea is not to put on large massive parties or festivals. These are small engagements, and the cultural institutions would be required to oversee cleanup of the space and maintenance of the space after to make sure it is the same standard. It was at before and being a steward to the area that they're activating they're, not just there to do something and leave they're going to use it like they're borrowing is renting a stage or a theater they're, going to be tending to the space as well speaking of groups and gatherings, as there have been discussions regarding numbers in terms of the Covid-19 and expected winter coming along that sort of thing in the in the council and in the hearings. So this legislation would, it would fall under any and all executive orders from the governor and the mayor regarding to Covid-19, so any gathering restrictions. These would have to follow that. So we want to make sure that this is appropriate to Covid-19 and public health standards that we have right now, but we want to just create opportunities for cultural institutions to have this space available to them through this bill, but we just wanted everybody who's going to be additionally cautious of everything and provide safety plans as part of their application as well super Amy, any last words alan actually can I, can I make a point or ask a question sure thank you, Amy and Jack. Thank you very much for coming tonight. I just want to say to the group I think it actually is it behooves this legislation and the goal of this legislation that it is run through, sappo I think it's a really actually a smart move and sappo has got a you know. This is what SAPO does it's their expertise in this and, on all honest, all honestly, they're also very good at enforcing, and so, if someone does not following the rules, as we have seen in previous, you know street events prior to Covid-19 that all the street events you guys approve of and review they get shut down right and so I think that being in sappo is a smart move because it does coordinate. It has an experience with coordinating with all of the necessary agencies and making sure they do it. Jack in your understanding or and I apologize I might have not read it all the way through in terms of it going to suffer, though, we typically have the ability to at least comment on applications that go through SAPO any and all of them we usually choose probably 90 percent of them. We do not because they're you know their product, their film productions or their event, productions and they're, very small, but you know it's block fairs and street fares and things like that which their common community boards do comment on, or you know you know, review or send in a letter of recommendation or have a couple stipulations. Would you guys foresee that being a similar type of process for these? For these events, so with this program with open culture, it would technically within like looking at the city charter and kind of the nitty-gritty of it would be a different permitting program than traditional SAPO public programs, and this one would does not have a community board requirement as part of it, and there was discussions behind this and the idea behind not requiring the Community board. Oversight was similar with the open restaurants program. There is not necessarily a there's, not a requirement for the community boards to oversee all the open restaurants, applicants and making sure or who is applying for additional outdoor space, because there's a need for this. There's a need for restaurants to be able to take advantage of the space in front of their business and to be able to serve people and stay in business, and we saw it similar to cultural institutions. There's a need for them to go out of the traditional spaces that they can't perform in right now, the theaters the stages, the dance studios like they can not use these spaces right now, and we want to make sure that the city could be open to them in some capacity and turning it into a stage or rehearsal space. So that was the thought behind that part of the bill and the legislation but happy to have conversations with you further on this. There are greater concerns and then see what we could do from here. You know I, I'm not I. Do not I do not think there's any red flags yet I. Just I just wanted to understand that process, because our relationship with sappo is you know we have one and we routinely review. You know back when we had street fairs. We would continually review those speakers. David Pincus knows from his days on the Q of L committee and then I guess the only other thing I'd want to flag for the committee is obviously that you know transportation. Committee has done. A number has done a lot of work on making recommendations on the other open street programs, whether it be open restaurants and things like that and I just want to make sure whatever you guys. You know think about this program and this initiative that we, you know, take the time to coordinate whatever you know. If there's specific things I think if enough, if another committee on our board has said about either side streets or sidewalk use or things along those natures, we just want to make sure that you know it coincides with that cool I do not see any questions from the committee or from attendees I do not know if Amy, if you want to say a couple last few words and then I think I I had a rattling of a letter coming on. Well, first of all, thank you for giving us the time this evening. It is so appreciative my from our advocacy efforts. I can share that. There are quite a few council members who have enthusiasm for this bill, they're just waiting for the final draft of the bill before they sign on so we're, anticipating that the number of co-sponsors will go up, but you know we can't say for sure yet of course, and that might be more in Jack's knowledge base there. But the one thing that comes up again and again is that support from the community is what's going to get this bill over the line, and that's you all. You all have the power to do that. So a letter from you would go a really long way towards doing a lot of good in this area. So thank you so much. Okay, cool okay. So in that sense I'm going to ask if somebody wants to make a motion for a letter and perhaps some items that we think you might want to include in that letter. So we can have a general idea and who would like to do that. Well, I'll make a motion to support the two initiatives, at least to the extent of having them come to a vote and a debate at the city council level. I mean I, know their issues about budget. We do not know about I do not know if we have to completely. You know, throw all our support without knowing more about budgetary issues, which I think is a very reasonable point of view, but I think a letter of support to get this debated in front of the council. The idea that it's, the first of its kind in the country is exciting. I think that that using the testimony of both Jack and Amy, we I if we could distill some of just the talking points that we heard I, think that would be form a great basis of the letter. We could have an additional discussion, perhaps amongst ourselves, about community board involvement on sappos permitting, but I for one am kind of persuaded by the fact that these are theaters that are unable to perform unable to do business and they need access. You know that is going to be. You know you know, there's going to be, you know, there's going to be codes and regulations, but they need to perform and they need to get their work out there. So I'm for that, but I would base our motion to write a letter on the what we heard tonight from Amy and Jack I hope you do not do. I have a second okay. Anybody opposed okay motion passes. David I did see your your notation regarding transportation, I, think that might be something separate for transportation to take up once this goes forward, and there is a bill in there in terms of how they want to manage the whole street thing. So that might be something that that goes before transportation at that point: okay, okay, all righty. Okay, so that's unanimous super David, I'm sure you'll do you'll. Do the first draft yeah I'll put a draft together, I work with Sarah and with Amy, perhaps jack some facts and figures we can throw into it. But I look forward to getting something in a week or two to you guys: okay Alan, for the sake of the record, can we just get everybody to actually raise their hand or vote? Okay, all in favor raise your hand, please anybody against anybody. Abstaining! Anybody, okay, we're good! Okay! Thank you again. Thank you guys. Thank you. Thank you. Good luck! Good luck keep pushing so we're going to stay on the streets and unfortunately, it's not about beautifying the street in terms of adding culture or not it's about trying to get some of the clutter off the street. So I'm going to ask late to make just a brief intro give us an update a little bit and then we're going to hear from Colleen from Eot. Please like thank you ellen and thank you colleen for attending I know. It's always dicey to the agenda. Item number four on a community board meeting, so the presentation is about news racks and you know this is an issue that we've discussed at ACES as well as street life. Before you know, there's a constitutional protection and news racks serve an important role in the in the neighborhood by allowing people to get periodicals many times of local interest. But often you know what we see on the streets is that news racks are unutilized and unkept, and that can cause some sanitation issues as well as just taking up space on the sidewalks that, particularly now, without their dining and social distancing, really has never been even more valuable. So you know we had a couple of discussions. You know one with Colleen and her team at the Department of transportation. Initially, when we were trying to learn about this issue, we also spoke with the 34Th Street partnership about some of their work on standardizing user acts and with John Mudd from Midtown south on his prior research on it, and one of the outcomes was that you know we just needed to look around the neighborhood to report some of the issues and get a better sense of what the issues are, since there are regulations that the Department of Transportation has for these news racks, but to see you know the level of compliance and the level of remediation that the publishers are taking. So you know we do have a some slides in the in the dropbox. I do not know if we wanted to go over or if we were able to see some of these Jesse yeah, but like yeah I mean you know, that'll be great. You know, I do not think we need to deliver these issues so much, but in general you know we walked around the the hell's kitchen neighborhood, particularly around where I live. You know around 57th street, and this is an area where there's no bid in order to help maintain the use racks or to provide a standard use, rack design. So I just wanted to get a a sample of some of the news rack issues on this slide. You know we see you know if we can go to that slide with the seven news. Rack reports summaries, you know so I just got a sense of some of the news. Rack issues you know documented the 311 report numbers here and you know most of the issues have to do with no contact info, just because one of the regulations is for a news rack to have phone and email information of the publisher that has put that news rack up there, so you know several of them did not fall into that category. Then you know: I looked at these news racks in September when I submitted the initial 311 reports and then followed up in October and November to see the status of whether or not these issues have been remediated, and you know to the credit of DOT. All of these tickets were addressed in the 311 system and they all had a response, but unfortunately many of the issues did. You know five out of the seven issues persisted into November. Even after the the publisher received a notification from DOT, so you know, maybe we could just click through the following slides. Just you know see some of the issues. You know this one did not have a did not have a contact information. It was too close to the or closer than the regulations require. The curb cut. This one was initially chained to the the sign which is against regulation, and this one actually was remediated the next one. If you can this one also did not have contact information, and you know so this one persisted. If you go to the next one, which also did not have contact information number five was they actually remediated. I previously did not have any contact information yeah, we can just click quickly through five six and seven seven was a little different because it it was just continuously too close to that fire hydrant and then the next one was just a new one. Where you know, obviously that's problematic tipped over, not maintained, you can go to the next one. This one was just inaccessible, you know, so it seems which is not. You know part of the regulations, but it was not really serving much of a purpose behind the scaffolding and so on the last slide. If we can click to next steps, you know so the areas that I was hoping to discuss tonight, we're just you know some of the steps that community members can take to address the problem. You know I know three on one reports are important, but if some of the news racks continue to be out of compliance, you know what other steps can be taken. Secondly, you know I came up with some ideas on recommendations to improve the regulations. You know specifically right now. It's really hard for individuals or community members report. Unutilized news racks, you know so I think there might be a improvement where there's a specific number of days in which the news rack has to be refilled. You know, even if we say something the newsroom has to be refilled every two weeks. You know that sets a parameter around the utilization requirement from these racks. Secondly, you know, as I mentioned news rack under scaffolding, is within a very limited space on the sidewalk, and you know I think in that context it particularly tends to attract more litter. Third, you know we saw the picture of the news rack by the link. Nyc terminal, and you know, I think these rocks tend to be tipped over to become seating, particularly in that sort of situation. And fourth, you know, perhaps a weight requirement on the news rack would prevent them from being moved or tipped and then, as far as the information around muserats, you know I'm not sure that it's currently publicly available when publishers are refilling use racks. You know, I think the DOT might have a schedule for when the publishers say that they're refilling news racks, but I'm not sure that that's publicly available, I'm not sure it's also publicly available to see the news. Rack registration forms, so you know I do not think community members can verify if a news rack that they see is in fact registered. Third, you know I think there is information about the the timeline for when DOT checks on 301 reports about news racks. You know I think maybe that could be a little more publicly available on the 311 website and as far as I could tell the 311 app does not allow news, rack submissions within the correct category there so I think it probably since it's something that people probably are coming across while on the go. You know, I think that could be an improvement for the Department of I.T, and you know we had initially spoken a little bit about a coordinated street furniture project and I think you know that could also help to standardize how the news racks look on the streets as well. So you know I was hoping, for you know any feedback from Colleen as well as from the committee members. You know on potential improvements or things that you've observed in the neighborhood regarding news racks and you know, hopefully we can turn it into a letter with some recommendations for improvements on the on the DOT regulations and the availability of information about these news. Racks, hi blake. It's hi blake Hi committee members. Thank you so much for having me on this evening. It's colleen chatter, going from City Department transportation. So the last time we spoke with each other, it was in May and from what I can tell you is that nothing really much has changed other than the fact that I know that there is a draft legislation. That's been with the Corp Council for over a year and this legislation it develops time, place manner for allowing single racks on the streets and also talk about those racks that are designed by a bid and what happens when such racks are installed relating to the single rack. It does not include D.O.T installing standard news racks, but rather permitting others to do so. There's a lot more work that needs to be done and from what I know, my colleagues in intergovernmental relations have been working with city Hall on the legislation, and you know we do get complaints about the deteriorating conditions about news racks. You know in CB4, as well as in other community boards as well, and what we have done. We have encouraged. You know constituents to. Please call 311 because that's the best way to make and track all complaints that are made and our it department are the ones who are able to retrieve that information. Maybe there is something that we can work closely with 311 in terms of language, because I know keywords are very important with 311 and maybe that's something that we can take a look at and see what we can do so that when constituents call to complain about you know the condition of the Newsrec particular news rack. It does not take that long to get to the site to determine what the issues are, whether it's a news rack that does not have contact information or that's not being used or that that's no longer the publication is no longer in existence and I always encourage. Folks to you know, email me or email Jesse at the CB office and, let me know and we'll have an inspection done. Okay, I see, wendy has a question for you Colleen or a comment sure hi Colleen hi blake. So it's actually just more of a general comment in general, blake I agree with all of the recommendations you have there. I think the other one that I would add is that, given that so often we see an issue with the overturned news, racks in proximity to the link, NYC and I know you have a recommendation for them being farther apart, but I think we could also use link NYC, potentially as a way to get the word out that when there is a better work these that they should be if people see them overturned or unattended, whatever et cetera and then I also see Judith's comment around having just labeling on the news racks around like if it's not maintained call. This number call 311, which I also think is a great idea. Yeah, that's a great idea and you know blake. We welcome any suggestions that you have that you submit to us in a resolution to consider it that we can share with city hall. That would be most welcome. Thank you. You know I think that would be a good idea from my perspective anyway, you know if we're going to provide some recommendations. You know if nothing else, the just flag, that it's an issue of community concern, and you know I appreciate that the feedback as well wendy, any other comments, any questions so I think we should. We should try to put this into some sort of a letter. Like you got a lot of great suggestions there I think did we ever do? Have we ever done anything in terms of any sort of a statement or anything with to DOT about this? Would this be our first one looks like maybe David Warren has a question before we get to letter or no letter yeah. This might be a little out of order, but what is the procedure for for these news reactions? There's like high winds like a hurricane or something like that who's responsible for or a parade for security reasons. You know you do not want people believing the bombs and them and stuff like that. What is the procedure? How does that work with these news? Racks, more especially, would be related to storms or weather conditions who handles that. What do they do with them? So the publication, that's a really good question, so the publications are the ones that are responsible for the maintenance of their news rack. They would have to decide whether to put them out or you know, remove them. If there's a you know like you said that there's a storm, but in some cases some of these news racks are either bolted or you know we saw the one which is chained to the drive rail, which really should not be chained to a drive rail, that's illegal, so it's the publications that would be responsible for the maintenance and removal and putting them back. Okay. Thank you appreciate that you're welcome David Nice, seeing you oh great, seeing you thank you everything you do! Thank you and just to give you a heads up, I mean I know. One thing that came up is you know the violations that are brought to our attention, so the department of Transportation has 60 days just so. You know to respond to news, rec complaints when complaints are received they're inspected and if a news rack is not in compliance. A notice of correction is mailed to the publisher, allowing them seven days to correct the condition. Then D.O.T will go out there. They will reinspect between the 16th and the 28th day, and if the issue has not been corrected, a summons will be issued now an oath hearing will be held in approximately 120 days and if a new complaint comes in before a summons is issued, it's considered as a duplicate unless the infraction is different. Just so you know. So there is a process involved with inspection and reinspection and colleen are the re-inspections automatic, the re-inspection? We would go back out there. Yes, it's automatic okay. Is there ever a situation where the city will go in and remove these boxes off the street? For any reason, if they're no longer in existence, if the publication is, if the publisher is not publishing, we would remove them, we would have to confirm that and we would remove them. Yeah. Does someone from D.O.T check on these or is that up to the public? To you know again, it's complaint driven. If we get a complaint, we will go out there. We will check inspect. We will confirm if the publication is still in existence or not, and if not we'll remove them. I would want to say it's. We do go out and we inspect, but most of the complaints that come in are from citizens who you know notice something out of the ordinary we rely on. We rely on constituents to call us in and let us know if there's something going on all right sure. Thank you. Thank you, Kovin blake, anything. You want to add to this. No I hate that feedback and I would be interested in a letter, and you know I'm happy to draft that. You know, based on the feedback here and the other items that I had observed, yeah, but I think you've done some heroic work on this I think I think we can just take what's whatever the your presentation was put it on our letterhead and just send it right out, but I'm sure you want to do a you need a motion and a second emotion, and it's right here, emotion, emotional I have to say this is one of my easiest Community board meetings ever oh we'll have to do better next time. Yeah! Wait till you see the letter colleen just so you know, Jesse can voucher me on that. One colleen! You do heroic work also, except I'm still waiting for a sign on 22nd and 10th. But that's another story. I know you know what it's being looked. Do not worry we're looking at it. Okay, any did we vote on this. Okay, a vote to write the letter raise your hands, please very good, David Pinkis anybody opposed anybody of Spain present, but not eligible motion passes and blake need any help. Reach out we'll get a good letter going on this. Thank you very much folks. So at this point I'm going to turn this back over to kid who's. A little busy you know he's got his hands full. I'm going to turn this back over to kit for our last presentation bedtime and I'm turning it very quickly over to Josephine just want to flag on the front end that I have a question and some input from Maria who was not able to be here tonight. But Josephine is going to take a point on this last agenda item. Do we have Iris gersten here we do she's coming online right now, wonderful, so Iris Gersten is our district manager for students in temporary housing and she does great work and helping all of students in district two and in district three, actually, which is a very huge job, just maintaining all of their needs, especially now that so much of two-thirds of the learning has gone remote and many of our students in temporary housing are actually choosing to be a hundred percent remote because of just the great concern with Covid-19 and lack of health care, etc. So you know, we've been having some issues with the spotty internet connection, and you know this is not good, because these kids really need to be online and attending these classes. So I'm going to give it to Iris, oh you're, on mute iris. Can you invite Sharon Dylan? Oh you're, there hi she's here? Okay. What would you like me to address? Well if you could first address well, two things what's happening with the internet overall in the shelters you know, and how could we possibly be of help and also with the broken devices? Are they being replaced and what's really happening with that? Okay, I'm going to take half the question. I'm going to give the other half to Sharon in terms of the connectivity in district 2. Most of the shelters are in hotels and they're very high above ground, and there are towers nearby. So I'm not hearing about significant connectivity issues in those particular shelters insofar as the devices Sharon do you want to address this because I'll say something hi. Thank you, yeah, I'm Sharon Joe and I'm one of the directors of regional support for students in temporary housing. So I work with Iris as well. So in terms of connectivity, like Iris, said most of the shelters are able to access their t-mobile cellular signals. So there's it's like a two-prong thing: Wi-fi is generally not available in the majority of DHS shelters, so Wi-fi access is something if you've the mayor's recently announced that they're trying to address in shelters and that's a larger city. Dhs conversation that's happening right now. That I do not realistically think would address immediate needs, but they are exploring various options, our students generally. What we've advised is for them to have cellular enabled devices so through the spring, and even now, we're trying to prioritize students in shelters for cellular, enabled ipads and then that's the connectivity issue that Iris is referencing. Most of those hotels and shelters within district 2 and 3 are able to connect, and if they're not, we do have a set up with t-mobile to come out and assess. If there's any issues that they could then sort of boost signals in the odd parts of a building that potentially are not getting a signal. I am having that problem in district 3. In the older buildings, but not in district 2. when there is a problem, if t-mobile can not fix it, we have now switched over to verizon. So I can tell you in many shelters, there's an issue, but not in the hotels, go ahead, Sharon and then, in terms of broken devices. It's a work in progress we have ordered or diit is who we work through, and so, if a broken device needs to be fixed, then we are advising students to go through diit. We do meet with them weekly to sort of escalate, larger themes and just recently we have sort of set up like a direct, a more dedicated sth person within diit. So if a student or family calls, what we're telling our students in shelters is to say that they are in a shelter or that they are sth and that they would then be redirected to a dedicated person who can prioritize those students around those needs, so that has sort of been set up in the last week or so. If they're looking for replacement devices, we have ordered. Giit has ordered about 100,000 new devices. Those are all coming through school-based orders, so we do not centrally manage ipad requests, they go through the school, but we do track them and escalate them and try to advocate to make sure that students and shelters are being prioritized, since they generally need a cellular-enabled device and in those cases the unfortunate thing is: there's a backlog in getting devices so we're anticipating an eight to ten week, delay which I think at this point was through some of that and I think the orders would be coming in through mid-December, and so that is sort of the piece around replacing broken devices. I think that's both of those points. Okay, thank you for the that information. Do you actually have data on students in temporary housing and how often they're logging? In that's the first question, because I'm still getting calls like there are two shelters and see before that still have spotty internet and sometimes the families have to go down or the students will go down near the office. You know it's like in any apartment. Building right, certain areas will have better connectivity than others, so they may not have connected in their room. But if they go down where the office is, then they have connectivity there. But of course they can't do that all the time. So I'm wondering is the DOE collecting data on how much students are actually logging in from these shelters and then the second question is that: do you have data on where students in shelters are currently without a device without a working device, an internet enabled device yeah we collect data on both. So we have attendance data that we review in terms of students and shelters, I think when it comes to that piece around when they're reporting that there's still connectivity issues, that's where IRS has had t-mobile come out, and ideally that's when they're trying to address the majority of those if you're still getting. Those I would redirect this to Iris to see if there, for some reason there was a section of a hotel or something that was missed, because we do ask for them to specify like the back of the third floor, is where we're not being able to connect so that to your point, t-mobile could then go and see if they just need to boost a signal or, if that's some other larger issue, I think Iris would not be able to speak directly to the hotels that she knows of and if something's been flagged as a larger problem, that they can't just fix through a signal boost in terms of one minute. What are the hotels which are which facilities? Well, this it's a public call, but I can you know I could text you them later. I just do not like to give out the names of the shelters yeah. Please do thanks. Definitely, if anybody's ever hearing of sort of a connectivity issue that they think is related more so to just a cellular signal. So for your per your example, where a student is saying that, like my ipad works, if I go down to another area, please flag, those for Iris, so that we can continue to follow up and then t-Mobile and diit usually goes to the building to assess what's happening in the more specific we are in the area. The more targeted sort of their work can be in that sense. To your second question, around data we do have data on the students that are still waiting for devices, so we do have diit just recently shared a file on all of the remote learning device requests. So there we do get the data reports from the Rld reports to see sort of where we are at in terms of requests which have been fulfilled, which are still waiting, and we are disaggregating that at this point, so that we can also share with schools, particularly around those that we know will be waiting for at least another month that this student would be waiting for another month. And how can we support them in thinking through other ways of engaging in their learning through paper, packets or other asynchronous ways of having their school materials shared with them? Okay, so you're saying that students can actually be without a device for another month. That's a long time. Okay, I'm just thinking in terms of you know any letter that we may write from Community, Board 4. So two questions: how long does it take to have a t-mobile person go to a shelter and address the issue? That's the first question and then the second question is: could we as a board get access to the data and then that will help us decide whether or not this is you know we need to pursue this with a letter, yeah I at this point, I'm not 100 positive on the turnaround time for d for t-mobile they're, making their way through the list, so I think it takes about a week or so Iris, I'm not sure. If you have not been submitting 10 days, t-mobile has been going out and individually working with families. Now Diit has been sending out people to specific shelters to work with families. Sheltered directors have instructed families. If you need to be out of the building. Please leave your ipad, so we can look at it when there's concern. Every shelter has a list of every ipad with every issue that goes back to DHS, so we've identified where the issues are and we've tried very hard to work on those issues. We also need a compliant parent to work with us on those issues: okay, good Sharon, I'm sorry, no! That's perfect, because yeah so Iris is generally the one who's in the thick of it, communicating regularly between the shelters and dia with t-Mobile and on our end as well so she's able to answer sort of the more immediate questions. The second one was in regards to sorry, can you repeat the second part of the question, the data on broken devices, and you know how you know: families are actually logging on yeah. I can definitely get that to you. I'm trying we're trying to desegregate the rl. The most recent one around how many students are still waiting. The file is a little massive and we're trying to do some data matching between what we get from DHS in terms of the student ids on their end and then our Rld DOE report. So I'm hoping to be able to share that out with regional managers by the end of this week in in regards to who is still waiting for a device and how we might be able to advocate for alternative ways of engaging with them. So some of the things that we have potentially suggested is if schools have the ability and parents are interested, which is its own piece around trying to go into school, more regularly to be able to engage in learning it's a possible option. Some schools are exploring buying hot spots so that they can use non-cellular-enabled devices, so schools that have other chromebooks or computers and then purchasing hotspots with some of their funding. So we're trying to sort of identify alternatives, because another month of not being able to log in is not an option in terms of having students be able to engage with school. Another issue that I find is the lack of privacy and the difficulty concentrating when you're in a room and you've got several people in the room. Every school has title 1 funds and if they do not have title 1 funds, they have funds put away like title 1 funds and I am going to be speaking with every school, making suggestions on how they can spend that money, whether they choose to order headphones for kids, which I think is really needed if they want to order hot spots. Although I'm telling you in the hotels I, do not see a problem, but if you say there is I'm not going to argue the point and other kinds of supplies to enable kids to be able to learn better. So that's my project for right now, and this is like a hundred dollars per kid right, but there was money from last year that was not spent, so there's double the money. Yeah every school got an sth rollover for title one funds and then, if they want, they can access like their high needs, title one funds and other ones as well. So while there is a title one sth set aside, which would be duplicated double this year because of last year's rollover, they can also access sort of their title. One high needs funding as well for these sort of purchases we're being much more creative with title one funds for the needs of kids than we've been in the past, got it okay. So if Sharon could forward that information on the data to Jesse, that would be very helpful to us and understanding where to go from here and how we could best support these students. Yeah I will get you sort of the in the data on the students that are still waiting for a device and I can also share attendance data, though the attendance data does not just reflect inability to log in there's any number of factors, sort of related to the attendance piece right, because even before we went remote that you know the attendance was always an issue. So I understand that also, you know I think it's! You know. I've had parents who have wanted to. You know this idea about the hot spots and you know buying something like that, but the schools that the kids tend to attend on the West side- they're, you know at as I said, they're their title one school. So there may be some sth funding left over, but the ptas raise very little money. So there's! No! It's not like. There's a lot of money there for parents to be able to. You know PTA, to kick in to add to those funds. You know to buy a hot spot or something like that. So just to keep that in mind, definitely we have at least one other person in the committee who has a question josephine. Were there other things you wanted to ask? No that's it! Thank you. Thank you. So much for coming both of you. Okay now see you hands raised, so the question that I got in advance from Maria who was not able to join us I think we'll have to hold on she sort of wanted us to quantify how many students, how many families have connectivity issues have device issues, sounds like we're going to hopefully get that data, but I just wanted to share. That was with her question, so we're going to go to Jessica first and then wendy after that Jessica. How are you thank you, and obviously this is like I work at a nonprofit. I can appreciate how hard it is to take government dollars and make things happen in the midst of a crisis and a changing environment, but I'm also struck by if there are resources like what is the, what is the hurdle? That's like what are the? What are the top two hurdles right now that are keeping every student from having uninterrupted access to their academic curriculum like I, just I feel like I'm, not quite hearing, like obviously, there's no silver bullet but like what is the solution that we like? What is the hurdle? We need to try to overcome here. You want me to take that or you want to take that you can take it iris. Something I experience is in district 2 in the hotels. If you've not been in one of these shelters, it's one room with four people in a hotel room, so imagine being in a hotel room that you've stayed in a Marriott, a hilton two beds. You know a TV and a bathroom all the meals come in, so they do not have any kitchen to speak of so you've got these kids online and they're doing it simultaneously, and it's very hard to hear- and it's very hard to concentrate concomitant with that. You've got a parent that wants to get out of the shelter and is very motivated to work. And what does she do with her kids? One of the problems that I'm having right now. You know this is changeover week to go from remote learning to blended learning and we're recruiting families to do that, but in district 2, with the exception of downtown and the Hudson guild, there's no learning bridge program so I find that the I do not think that there are enough resources and space for the kids to learn in a healthy manner. That's my two cents. So it's not devices specifically it's I know: I! Really: we've worked very hard on devices individually family by family. We've sat with them. We've spoken with the spock at school, we've called people we've given new devices, then there's the motivation of logging on and people are very depressed. This is a second year and they're very upset by it, and you've got all these kids to room and I'm trying to attend to the needs of those kids and some kids are special, ed and they're, not getting services and some kids act out and then you've got the high school kids. If a parent goes to work, a high school kid has to leave the shelter, and you would hope that the child would go to school. But that's only two days a week or one week on one week off depending on how they decide to attend school, the families get phone calls from the teacher, the guidance counselor, the social worker, the family assistant me and the attendance person after a while they turn off their phones. When someone is not attending school, it's not just I did not want to go to school today, there's something else going on with the family, but the first thing you need is the access to the family to find out what that is, and then what you can do to ameliorate that, if they're motivated so family by family, that's what my team is doing right now. Thank you for that and thank you for that hard work. I commend. You I think one of the things that you know as Iris was saying you know it's the person-to-person contact and we lost that right when we went remote, basically with two-thirds remote. So if your kid is only in school two days a week, you're pretty much remote and now the DOE is, you know there was supposed to be different times during the year where kids could opt back in if they had decided to do. 100 remote. But now the cutoff has been moved to November, 30th I believe it is so after that point no child will be able to opt in even for the two days a week. So that's really going to be a problem because, as I say, you know a lot of families that I've spoken to they've been hit hard by Covid-19, so they've been keeping their kids, you know in the shelter they have not even been sending them for the two days, they've been opting for the 100 remote, which is a real really hard, because these kids really need to have some in-person time, and so you know, perhaps if the chancellor would at least make exceptions for these families and give them you know, maybe until the spring to decide you know. Hopefully there will be a vaccine and then these families will feel a little more confident about sending their kids to school, because right now, they're, not and if they close the window at November, 30th and say if your kids do not opt back in by now. That's it for the rest of the year. That is really going to have an enormous impact on these kids that are living in these shelters because then there's they have no option for them right, they're, just stuck in the in the shelters for the rest of the year. So that is something that could potentially help if the DOE is at least open to doing that. But I do not know if they will be one more question from committee member wendy you're up thanks super logistical question, but in thinking about the devices that are right now, only cellular enabled has there been any feedback or has there been testing on whether students are actually able to like to stream their classes, to connect to whatever portals they're connecting to through their schools as successfully as students who are with Wi-fi just thinking through the reality is often of connecting via data only and how that can be its own challenge. So just wondering if you guys have any feedback or data on that I have not heard of too many challenges. I think the larger thing is, if there's a like overall cellular connection problem, then we'll get that feedback. Sorry in that sense, but not in the sense of like delays or too many issues of just connecting to a class and having streaming or connection problems in that sense got it. So, basically, if you have a cellular enabled device, if are it's not working yeah? If your general signal is working, then you're able to engage for the most part, I think they'll still be. The one-offs, like any of us, have just exact issues, but there has not been any larger sort of issue, flanked in that sense. Okay, great. Thank you elaborate on that piece, a little bit windy. A lot of the software is designed to be workable on like a phone, and so if it can work on, you know a parent's cell phone smartphone. It can also generally work on a laptop or a desktop that is only operating off of a sell signal, not true across the board, and some softwares are more demanding than others, but that's been my experience. Any other questions for our friends from the DOE before we shift to community discussion. I have a request as a community board. If you, if you want my opinion on something, if you could push to have a Learning Bridges program open up in the 30s or the 40s or the 50s, that would be wonderful because we have nothing servicing the hotels now wonderful! Thank you! So much! Yes, we can do that. Okay, thank you. All right sounds like we have the beginning of the content for a letter. Is there anyone who wants to make a motion or any other questions, comments, knock jokes people want to get out into the universe. I make a motion to do the letter about the Learning Bridges center. Thank you, second, that all right all in favor. Anyone opposed any abstentions present. Not one obsession I'm here for the whole thing, so I do not want to make sense present not eligible Judith acknowledged anything yeah. Did you guys see I got to switch to president not eligible now that I think about it. Good point, okay, awesome, so I think it sounds like Josephine. You are down to be point on writing. That letter am I getting that right. Yes, of course, and I can reach out to Iris for more details. Thank you, yeah. It would be really terrific to get that data and be able to quantify the problem in the letter whenever y' all are able to share that with Jesse I. Think that is everything on that agenda item, and so we are moving on to is there any old or new business? And if there is no new business, we may be in a position to say 8:26 pm if it's time to Adjourn Alan anything on your end, horrific meeting, guys terrific meeting. Thank you all. Thank you. Good night have a good night, everybody emotionally good night, everyone good night, looking forward to reading these.",
            "summary": "We work closely with the DOT, with the parks Department and with hundreds of community groups that are all trying to improve their neighborhoods through activating public space.\nThe, most I think is going to be the Fulton House residence, because we've hooked up with a wonderful woman who's been doing this all on her own, an after-school program with 15 kids that had to shut down in March because they were using the Tenant Association office.\nShe's, desperate to meet up with her students again and continue her after school program, so she's going to bring her kids over.\nIf you all have questions on the committee like Alan said, please use the raise hand, feature just click on participants, I, believe it is, and then you'll see it and folks who are joining us from the public.\nSo actually the New York City NYC museum school, which is right across you, know right.\nThe other question was oh: How many can we accommodate I would be happy if we had a crush of people and we had to say you know, come back later.\nThe other thing I wanted to say was also if people know of after school programs that have been cancelled, I, welcome, partnering, with Annie and all groups.\nSo I mean we just started last week and we had a couple of kids use it, and you know that was great.\nYou know when you do it, you just want people to use it, so I think yeah, spreading.\nWe had just this past year, 21 new eight awards that were made to CB4 residents, and if you look at students who graduated from the from the Community Board families, who maybe moved out of CB4, there's a little bit more movement than normal, given Covid-19 and or leaving avenues.\nIf you have questions sure, thanks a lot David and again great to see the entire committee here.\nWe have a regular community design incubator that we work with for our seniors, where they come up with innovative ideas and ways to partner with our various community members through their curriculum and lots of partnerships with Holy, Apostle, Soup, Kitchen, Penn, South and other neighbors as well, and hopefully that will help build into that one day that we can all connect directly in person.\nYou get a story from various family members or people that you know in your immediate circle, but this year this portrait project really wants to focus on community.\nA lot of the opportunities was because of him and through the work of this committee, it's just been so instrumental to helping us make sure that we are able to do really great dynamic, mutually beneficial work during these really tough times and get our students, our families, our faculty and staff, all together, fully involved.\nOur, CB4 families participating in that to any extent, and how does need-based financial aid play into that, offering that your school has started to make available to students and families.\nI'm, going to just put in the chat a couple links to the letters previous letters which I think not right: now, obviously.\nWhenever you guys committee members want to take a time to look at the you know the relationship that the board has had with avenues.\nBut, you know financial aid related process as well to allow the same information that David shared as well too we'll attend any events that Fulton houses, hosts, I.\nSome of the students already know Mr Acevedo by name very directly, and so there's just all these various opportunities and ways that we'll partner with the fulton houses and so even though they're a little bit further away from our school per se.\nHe'll still take some time to meet with us text me reach out to some of my colleagues even to come up with interesting opportunities and ideas and ways to work with our students and faculty staff.\nEven our parents as well our families, which is just a great way to work so and obviously the fulton houses are not the only ones.\nThere are other groups like that they get similar connection and relationships as well, because we're all raw neighbors, all right, I am not seeing any further questions from folks on the board when I clicked over to the public.\nLooking to, perhaps you know, get perhaps a letter of support from the committee for this open cultural ultra, open culture policy that we're going to hear about.\nAs David said at that point, we hope to have a lively discussion and earn your support for these bills for open culture.\nCollectively, they're known as the open culture bills that work together to activate public outdoor space for cultural organizations during the Covid-19 crisis.\nWe do not think these bills are going to solve their financial woes, but for them to continue to access the small amount of grants that are often the difference between closing and barely just making it even at the best of times.\nOne of my favorite things about this bill is that we all know it's no secret, that New York City is going to be facing a pretty serious budget.\nI. Do not feel like I need to go into the larger picture of why culture is important, but we know open streets will work because we've seen restaurants use it.\nThese, open culture bills to New, York's public spaces.\nWho is one of the key members of council member Van Bramer's team who helped write these bills and he can add his insight and answer any questions that you have hi everybody Jack Bernadovich here with council member Van, Bramer's office, I'm, council, member Van, Breemer's legislative director and cultural affairs liaison since before Covid-19, and since I've been working closely with cultural institutions across the city and through conversations day to day with those groups and artists was a need to bring culture to the streets of New. The city is a stage.\nAnd I do not know that anybody's going to be downloading a city app to be connected to the most exciting things happening right, now, and given this challenge of resources, I, just hoping, you could expound upon that and also what kind of feedback you've received from those who have signed on about this about that piece in particular.\nIt will be a website, a mobile, and so before app is created, you'll be able to go online on your phone or computer and look at it from there, and the city will already have the data through the permitting system we already have it, which is make it transparent and public and available to people.\nThank you for the explanation of the bills, and you know I think this is a very important idea.\nAnd, you know, I, think prioritizing the kinds of arts and cultural institutions that are within the neighborhood that you know, they're looking for spaces is really an important one.\nDo a five-borough tour right, now, they're, looking to do a like neighborhood tour, hang out in their backyard work with their constituents and their people and allow artists in that neighborhood to make some money.\nThey want to bring arts and culture into the streets, they're just hesitant about gatherings and making sure that the spaces are controlled fully because they do not necessarily have the maintenance staff or extra staff or the funds to hire extra people to kind of control, crowds and control.\nIt was at before and being a steward to the area that they're activating they're, not just there to do something and leave they're going to use it like they're borrowing is renting a stage or a theater they're, going to be tending to the space as well speaking of groups and gatherings, as there have been discussions regarding numbers in terms of the Covid-19 and expected winter.\nWe want to make sure that this is appropriate to Covid-19 and public health standards that we have right now, but we want to just create opportunities for cultural institutions to have this space available to them through this bill.\nTheir film productions or their event, productions and they're, very small, but you know it's block fairs and street fares and things like that which their common community boards do comment.\nSo with this program with open culture, it would technically within like looking at the city charter and kind of the nitty-gritty of it would be a different permitting program than traditional SAPO public programs.\nThere is not necessarily a there's, not a requirement for the community boards to oversee all the open, restaurants, applicants and making sure or who is applying for additional outdoor space, because there's a need for this.\nThere's a need for them to go out of the traditional spaces that they can't perform in right, now, the theaters, the stages, the dance studios like they can not use these spaces right now, and we want to make sure that the city could be open to them in some capacity and turning it into a stage or rehearsal space.\nThe only other thing I'd want to flag for the committee is obviously that you know transportation.\nA number has done a lot of work on making recommendations on the other open street programs, whether it be open restaurants and things like that.\nIf, there's specific things I think if enough, if another committee on our board has said about either side streets or sidewalk use or things along those natures, we just want to make sure that you know it coincides with that.\nI do not know if Amy. And, then I think I I had a rattling of a letter coming on.\nThink that might be something separate for transportation to take up once this goes forward, and there is a bill in there in terms of how they want to manage the whole street thing.\nBut often you know what we see on the streets is that news racks are unutilized and unkept, and that can cause some sanitation issues as well as just taking up space on the sidewalks that, particularly now, without their dining and social distancing, really has never been even more valuable.\nWe also spoke with the 34Th Street partnership about some of their work on standardizing user acts and with John Mudd from Midtown south on his prior research on it, and one of the outcomes was that you know we just needed to look around the neighborhood to report some of the issues and get a better sense of what the issues are, since there are regulations that the Department of Transportation has for these news racks.\nDo not think we need to deliver these issues so much, but in general you know we walked around the the hell's kitchen neighborhood, particularly around where I live.\nYou know around 57th street, and this is an area where there's no bid in order to help maintain the use racks or to provide a standard.\nYou, know, I think the DOT might have a schedule for when the publishers say that they're refilling news racks, but I'm not sure that that's publicly available.\nSo you know I do not think community members can verify if a news rack that they see is in fact registered.\nYou know I think there is information about the the timeline for when DOT checks on 301 reports about news, racks.\nYou know, I, think maybe that could be a little more publicly available on the 311 website and as far as I could tell the 311 app does not allow news, rack submissions within the correct category.\nAnd I think you know that could also help to standardize how the news racks look on the streets as well.\nThere's a lot more work that needs to be done and from what I know.\nMy colleagues in intergovernmental relations have been working with city Hall on the legislation, and you know we do get complaints about the deteriorating conditions about news, racks.\nBut I think we could also use link NYC, potentially as a way to get the word out that when there is a better work these that they should be if people see them overturned or unattended.\nYou, know, I, think that would be a good idea.\nYou know if nothing else, the just flag, that it's an issue of community concern, and you know I appreciate that the feedback as well wendy, any other comments, any questions so I think we should.\nThis be our first one looks like maybe David Warren has a question before we get to letter.\nWe do she's coming online right, now, wonderful, so Iris Gersten is our district manager for students in temporary housing and she does great work and helping all of students in district two and in district three, actually, which is a very huge job, just maintaining all of their needs, especially now that so much of two-thirds of the learning has gone remote and many of our students in temporary housing are actually choosing to be a hundred percent remote because of just the great concern with Covid-19 and lack of health, care, etc.\nYou know, we've been having some issues with the spotty internet connection, and you know this is not good, because these kids really need to be online and attending these classes.\nIf you could first address well, two things what's happening with the internet overall in the shelters you know, and how could we possibly be of help and also with the broken devices.\nSo in terms of connectivity, like Iris, said most of the shelters are able to access their t-mobile cellular signals.\nThey go through the school, but we do track them and escalate them and try to advocate to make sure that students and shelters are being prioritized, since they generally need a cellular-enabled device and in those cases the unfortunate thing is: there's a backlog in getting devices so we're anticipating an eight to ten week, delay, which I think at this point was through some of that.\nWe have attendance data that we review in terms of students and shelters, I think when it comes to that piece around when they're reporting that there's still connectivity, issues, that's where IRS has had t-mobile come out, and ideally that's when they're trying to address the majority of those if you're still getting.\nFor some reason, there was a section of a hotel or something that was missed, because we do ask for them to specify like the back of the third floor, is where we're not being able to connect so that to your point, t-mobile could then go and see if they just need to boost a signal or, if that's some other larger issue, I, think Iris would not be able to speak directly to the hotels that she knows of and if something's been flagged as a larger problem, that they can't just fix through a signal boost in terms of one minute.\nSo there we do get the data reports from the Rld reports to see sort of where we are at in terms of requests which have been fulfilled, which are still waiting, and we are disaggregating that at this point, so that we can also share with schools, particularly around those that we know will be waiting for at least another month that this student would be waiting for another month.\nJust thinking in terms of you know any letter that we may write from Community, Board 4.\nAnd I am going to be speaking with every school, making suggestions on how they can spend that money, whether they choose to order headphones for kids, which I think is really needed if they want to order hot spots.\nSo I understand that also, you know I think it's.\nI, think we'll have to hold on she sort of wanted us to quantify how many students, how many families have connectivity issues have device.\nIssues, sounds like we're going to hopefully get that data, but I just wanted to share.\nBut I do not know if they will be one more question from committee member wendy.\nIf, your general signal is working, then you're able to engage for the most part, I, think they'll, still be."
        }
    }
}