{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Economic Development Committee Meeting - September 2 2020",
            "publishDate": "2020-09-03",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    District Needs Statement\\n3.    Review of Dept of Consumer Affairs non-return of sidewalk cafe application fees for suspended applications\\n4.    Report from Arts \\u0026 Cultural Affairs Subcommittee\\n5.    Vote to adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 48,
            "um": 140
        },
        "wordCountFullTranscript": {
            "issue": 27,
            "fees": 27,
            "district": 27,
            "people": 26,
            "arts": 26,
            "city": 23,
            "budget": 21,
            "funding": 19,
            "community": 17,
            "meeting": 16
        },
        "wordCountSummary": {
            "fees": 10,
            "community": 8,
            "application": 7,
            "cafe": 5,
            "applicants": 5,
            "people": 5,
            "arts": 5,
            "licenses": 4,
            "affairs": 4,
            "process": 4
        },
        "fullTranscript": "Oh, my god, ah hey sorry, I know I'm supposed to help. Are you gonna be able to help with video megan just because okay, there, I am sorry yeah I'll, be able to help out so, okay, I see where it says, pause and record yeah. I can here, let me admit, folks, yeah and then there's the waiting room. I see that yeah it's pretty and then we'll just need to record it once we start, but I just can't be I'll, be kind of in and out hi, hey guys, I'm gonna turn off my phone now: okay, oh yeah, sorry, and then what about joe? How do I make somebody host if I, if somebody needs to like share their screen yeah? So if, when you click on that participants, button on the bottom you'll see participants on the right yep and then you can kind of select the like. If you scan over their name, it says more and then you can. You can essentially make them a co-host or remove their co-host privileges. I don't so like I scanned over alex right and it says more and it says: stop video spotlight. Video. Allow record rename put in waiting room or remove. There's no like make co-host. Okay, I mean I'll, be on I'm just gonna have to duck in and out depending on. I don't think we're gonna need to make anybody else. Co-Host yeah, I think it'll be fine. I just was recording, then I think we're good right. We need anything. Am I a co-host by chance? I can make you on okay just so I can do that. Yeah done. No john is jonathan. Berger, hey richard! So anisha tell me when you want to get you know what hold on a sec. It is currently recording now, okay, great yeah, let's just give everybody yeah even another minute, all right, I'm gonna step away for a second okay thanks joe. I think we're good, don't worry about it. So all right should we get started. Do we have enough board members here yeah? I could do well. If you want, I could do let's say: yeah. We've got seven people on the committee right now. I think okay, so let's go ahead and get started because we do have a couple of things to do today. The first, if well, I guess, sort of housekeeping. If you are not a committee member, please write your name in the name and affiliation in the chat box, so you can have it for record keeping purposes. I circulated the august minutes so we'll do a roll call vote to approve those. If there are any comments about that, please raise them now. Otherwise, megan feel free to do vote for yeah approval. Okay, approval of august minutes initial season; yes, megan, joy, yes, alastair economicus! I don't think he's here: andrea gordillo, yes, herman hewitt! I think he's here joe kearns, yes, david louie, yes, alexandra milotano! Yes, richard ropiak, yes, rodney, washington, andrew comey, yes great, so we will move on to the next thing. I'm going to do things in a little bit out of order. Just to you know we'll go to the resolution. That's on the agenda for tonight. So one just sort of like bigger picture. You know if any of the community members have issues that you know they would like to bring to the attention of the full committee proposals for resolutions etc. Obviously, please talk to me about them. This was something that megan identified as a need in the community and proposed this resolution. You know we haven't as sort of a committee. You know we don't always see, resolutions that we both discuss and approve in the same meeting all the time, but we will have instances where this comes up. We can, you know, take a meeting to discuss it and then work on a resolution for the next committee meeting. I think there are different ways we can work on it, but hopefully this one is a very straightforward issue and the resolution is pretty straightforward, so megan, if you'd like to sort of introduce the context for it, and then I will bring up the resolution because alex made some comments on it already that were very helpful. Let me figure out how to do that. While you sorry so this is, you know, sidewalk cafe, licenses that are issued by DCA department of consumer affairs, so usually the process is when you're applying there's certain application fees when you're applying for the first time you know and they kind of range, between the 2500 to 3 000. But since Covid-19 happened, they stopped issuing those licenses, but they- and you know I had asked you know attorneys saying like: do they then like what are they doing with their application fees and they're, like oh they're, just going to wait because eventually you'll get issued that license, so it was like okay and then you. I realized the mayor announced last week that or whenever it was a few weeks ago that the open restaurants program was going to they were going to. The city was going to go with that versus the sidewalk cafes and I don't think that's forever, but that's definitely going to be for next year. So then, like the state city is still holding on to the applicant's money and there hasn't been any talk about them. Returning those application fees which is like you know, a significant cost, it's a few thousand dollars. My only concern is for the places that may close down and those in that mean time so that's kind of where it came from the city's holding on to this money and there's no talks of them returning it. So I you know I'd like for them to return the money to if the applicant so chooses the money to be returned, which I don't think I made clear at the end, so I might want to tweak that a little bit, but that's kind of where we're coming from and happy to answer any questions about that. This is the first time I've ever shared my screen. So let me know if you're actually seeing the resolution yeah. I can't really tell what's happening richard. You have your hand up, though, and I can't also see the people who have hands up so megan. If you see that all right, so richard go ahead. Okay, when the when the city opened up the process for the sidewalk cafes, I do not recall there being like all of us, I'm aware of several places that they're sidewalks, I never thought about a fee, I'm not sure how the city can justify it, except under the heading of long-term practice, but given everything that we're going through economically, I have no problem supporting megan's resolution asking that they returned these fees back to the applicants. What happens next year? Well, you know we'll wait and see, but at least help the people out now giving them those couple of thousand dollars back. That's all for me, susan and alex both have their hands up. Anisha alex go ahead and go first. My amendments were only as to form and grammar mm-hmm yeah, so weren't substantive in any way, so those are on the screen. Alex's changes, susan yeah. I actually very last minute sent some changes, but it was too late. I guess for you to see so I'm not sure it's totally clear that the current tables on the sidewalk are not sidewalk cafes and there's no fees for them. People that have sidewalk cafe licenses, because there's no cafes this summer had their fees returned. People who applied for a sidewalk cafe and the city did not process it. Those fees were not returned, so my change was in the the, whereas it starts during Covid-19 crisis. The city has suspended payments for sidewalk renewal cafes and returned paid fees. It did not include the return of sidewalk application fees for first-time applicants, because that's the only thing we're talking about is return of first-time application fees right because they suspended or they returned the renewal fees. So after that, what I would suggest is it did not include in that ad return of. So, if you're looking at the draft, that's on the screen right now it says, whereas, although the city suspended payments for sidewalk, cafe renewal fees during the Covid-19 crisis, it did not suspend sidewalk, cafe application fees for the four first time, applicants. What's the language that you'd like to change, did not include the return of that she's asking for it did not include the return of sidewalk, cafe, application fees for first-time applicants and we'll take out the suspend. Were there any other comments? Susan did you have another one? I like briefly saw your email and then megan was there anything else that you wanted to add yeah. I wanted to add. I wanted to add, because I guess I what I don't know how to put it, but I just thought of this before the meeting is: I don't want them the DCA just to return all the application fees and then to feel like businesses if they are staying, open kind of like lost their place in the line and aren't you know like what, if we get rid of this open restaurants program, you know in a year or two from now they want they still want to be like sort of in the line to get their sidewalk cafe license. You know if those come back, so I kind of want to add somewhere at that bottom, like if sorry open it up in my own computer. I can't do that. Yeah, therefore booze on community board, three requested consumer affairs refund, not all but sidewalk, cafe application fees to restaurant applicants who have yet been granted licenses who are like or who so choose to have their can. I say I don't think you can say, give me back my fees but keep my place in line at the right. No, I can't, like maybe say, are you asking for all of them to have their application, I'm starting to interrupt all of them to have their fees returned or just the ones who no longer want to be considered? Presently, I guess I guess if they, if they request it, they should get it back so either their business is in a really bad financial state right now and they could use that three thousand dollars or they feel like they're gonna they might close, and so they want. They don't want the city holding on to that three thousand dollars. When you know they're going to be closing the business anyway, so like also to restaurant. At the request of restaurant applicants, maybe at the request of restaurant applicants who have yet not yet been granted licenses, so I'm can. I can I make a comment. I think you're it's getting too almost convoluted, because now you're asking for like lots of different kinds of bookkeeping like with sidewalk cafes, they just returned everyone's. I don't think that they're going to be many businesses that are going to say hold my three thousand dollars until next summer, because I want to stay in line. I mean people don't have that much security. I I don't. I don't think we can have them returning some and not returning some and keeping places in line and not keeping places in line yeah. We could just leave it as a way as it was then and there's a the missing between that and department. So the last it says, therefore be it resolved that community board 3 asks that the department of consumer affairs refund all sidewalk cafe application fees. Two. So just then two restaurant applicants, two restaurant applicants who have not yet been granted licenses. So should we take out restaurants because there are actually other businesses that have sidewalk cafes that might not be classified as restaurants, necessarily like dunkin donuts, I'm just giving you an example or a coffee shop. You know they did they don't necessarily qualify as restaurants, but they still apply for sidewalk cafes, I think do they not qualify as restaurants, dunkin, donuts and coffee shops. I believe legally, they are, I think, legally, they are if they serve food. They just took out restaurants, it's fees to applicants who have not been okay, but if that is a problem, then it's restaurants is also in that first paragraph, whereas numerous restaurants were in the process of applying for NYC sidewalk cafe licenses before the Covid-19 19 crisis, maybe just swap out restaurants with businesses. Yes, okay, let's do a it's in the second paragraph also, I mean, I think it's fine to leave the paragraph that says you know. Restaurants are our businesses who are experiencing significant closings and are you know, having issues which is further down? Okay, so, whereas application fees for businesses applying for sidewalk cafe for a sidewalk cafe license are significant, ranging from 2500 to 3 000 for an unenclosed sidewalk cafe to more than 6000 for an enclosed cafe, and whereas the mayor's executive order, number 126 issued on June 18th 2020 and definitely suspended the issuance of sidewalk cafe licenses in favor of the NYC open restaurants program and whereas, although the city suspended payments for sidewalk, cafe renewal fees during the Covid-19 19 crisis, it did not include the return of sidewalk cafe, application fees for first-time applicants and whereas the department of consumer affairs that processes sidewalk cafe license, applications has not communicated with applicants about when their licenses may be issued or when their fees would be returned. And whereas restaurants in new york city have suffered incredible financial losses due to the health pandemic with many forced to close, therefore, be it resolved that community board three asks at the department of consumer affairs refund all sidewalk cafe: application fees to applicants who have not yet been granted licenses. Could I add one thing, I'm sorry sure where you have where they suspended the sidewalk renewal fees, it should be. I think that they suspended and returned sidewalk renewal fees right there cool. Are there any other comments? Emotional approve? Do we need to do a roll call? I think we need to do roll call, because it's being recorded right, mm-hmm, okay, okay, anisha, stephen, yes, megan, joy, yes, alistair economakis, oh dear andrea, gordillo, yes, herman, hewitt, absent joe kearns, david louie! Sorry, yes, oh all right joe got you alexandra. Melitana was that david or joe- and I was joking- this is david. Yes, oh great! Okay, thanks guys alexandra milotano! Yes, richard ropiak, yes, rodney, washington, andrew comey, yes on washington, oh hey rodney, how you doing okay great! So, let's move on to the economic development district needs and then we'll do the arts and culture district needs. Last. So can you see the economic development district needs? Now again I haven't shared my screen before so I don't know how this works cool. So we've made some adjustments in our last meeting and really about the definition or like you know, including what we thought. Small property owners are, and there weren't that many additional comments that I got from people. I added a bullet point around workforce development and funding local workforce development programs because of unemployment in all the things we heard in our last meeting. But for the most part you know there haven't been that many comments from committee members about any other major changes is wondering if there any other sort of final comments to this, where people feel like we are on this. If there anything else to do or add or if this is sort of in good shape, as sort of the final version I want it. I can't raise my hand, sorry because sure, but I know I look. I had some side conversations with alistar. I know he wants to bring it up, but he's not here tonight but- and I think susan could probably comment on this, but he wanted to bring up how the increased drug use on the streets, the drug selling and the drug use is acting as a deterrent to people moving into the neighborhood and also businesses trying to operate in the neighborhood, and you know he saw that as an economic development issue, and I tend to agree, I just don't know if there's anything that we could do about it within the DNS. Can I comment: let's go ahead, susan well first, I want to say that there is the issue which is separate. The homeless issue, the crime issue and the drug use issue are in human services, both in health and in homelessness and in the public. Safety and aleister is particularly concerned about in one specific area around 2nd avenue, and we don't we don't. There definitely is a problem since he first complained about it and I don't think you, I'm not sure if you've been on the emails, a lot of that. A lot of that problem has been cleared up. One of the reasons it's been cleared up is because there's now construction at nativity church, where a lot of people are staying, so people have moved there is no documentation to say that it's impacting the businesses- and I'm going to say I from my observation: it is not impacting the businesses there. I think it's a bad thing. It definitely needs to be dealt with, but I do not see it particularly. We have a lot of outdoor dining there and you have to have reservations they're as full as they can be, and in talking to other businesses I don't see it, I'm not saying that it doesn't impact any business, but I again I don't see documentation, we don't have testimony, we don't. We don't have anything to say that that's true, I also will add you know I live very close to alistair. I also see all of the issues that he's talking about. I do think that there is, you know it can be seen as an economic development issue. I don't think that economic, it's primarily an economic development issue, and I don't really think that it personally don't think it should be included in the district needs statement. I think it's safety or health and human services, I think framing it as being a detriment to business is just I think it's like the last issue about it or the last sort of intersecting point. I think it's it makes more sense in, I think other committees, susan, did you say that they're going to put it in the health and human services district? Well, homelessness and drug issue is in there. It's also the drug issue is I I'm trying to remember. I know I'm not saying the drug. The crime issue on the streets, which has definitely gone up, is also is in public safety. You know you have transportation, sanitation and public safety yeah I mean all of those. Things have affected my businesses to some degree, but I think I agree with anisha that yes, like if they're going in community board theories district needs statement anywhere, it should be health and human services. Richard I see your hand up. I am reluctant to ever bring anything in to a community board 3 discussion based on something that occurred outside, but within the last couple of days I had dinner in community board six very close tower border, and I saw two people who I knew at the restaurant. We had previously gone to another restaurant and I said gee I haven't seen you fellas there and they said well when they set up their outside restaurant. There were their outside tables, they had people coming by standing over the diners and negatively impacting them. So my friends said: that's why we're not going back to that place anymore. I don't know any particular place here within board three that has had the same kind of problem, but I could see it as impacting a business very easily. Somebody walks up to one of your diners and comes up to the table, and next thing you know people aren't coming back to that place again. We don't, but I would suggest I would respectfully suggest and request that the district manager bring it up at the at the relevant committee, whether it's health and human services or whatever. But I do think it's an issue: there's not much attention paid to it, but I do think it has an impact. The only thing I'll disagree with you is that there's not much attention to pay it's a huge issue. People are complaining a lot all the elected officials are working on it. It's at every build-a-block meeting every police. We all. I think we all acknowledge. This is a big issue. That's getting increasingly worse. Okay, thank you and, let's not single out one anecdotal issue for folks who didn't see. You know, there's garbage b, h, b, h, dairy had an issue today with garbage, because there was so much garbage in front of their business from people who had moved out of the apartments that it was causing problems with people frequenting their business. So I don't think we can. We should be suggesting that one particular issue, an uptick in homelessness and inevitably an uptick in homelessness. Can it can lead to an upcrease increase in drug use on our streets as a cause for people not moving into the neighborhood or struggling businesses? So I don't think it belongs here. It certainly doesn't belong here. There are a lot of negative things happening in the community that are impacting businesses and it's not because there are some homeless people on the street in front of the church in the nativity or in front of the luxury condos that were the side of the second avenue explosion. So move on laura you have your hand up so that'll be the last comment on this and then we'll go back to focusing on the district names. Yeah hi thanks. I completely agree with you know what everyone is saying. I just wanted to add that we definitely have had on the avema zoom meetings, a couple of merchants who are located on the lower street. Second third, between second and third, who have had active drug dealing going on outside their businesses, and that has been detrimental to their businesses. But it's drug dealing and I we have heard about it at the build-a-blocks and we do understand that that's a long, slow case to build and that pg is working on it, but I do see a detriment to the neighborhood, not in any particular issue, but in the reduction of city services, trash pickup, you know policing everything all around. I don't know if there's any, if that, if you have an interest, including that without particularly you know, tagging it as a homeless issue or a drug use issue. There's no question about the fact that the piles of garbage and the and the and the and increased drug use that's visible as opposed to six months ago. There's no question about it, but part of the increase in garbage is because people go to tompkins square park. People are taking food out they're sitting in the park. I mean it's unfair to blame conditions on the homeless or one particular issue. I could come up with a 100 reasons why the neighborhood's becoming more difficult to traverse every day, so I think we should department of sanitation, sanitation's actually pulled back. I don't. I don't know if I was trying to connect that with the homeless, not or but trust me major. I just want to clarify that. I'm not I'm not speaking about a whole homelessness at all. I'm talking about a lack of and of a reduction of services. I'm hearing from business owners that they're they can't get their garbage picked up as frequently as they could I'm hearing from I'm seeing it pile up on the street. I actually led a volunteer cleanup crew in thompson square this weekend, so I've dealt with it personally, you know I. If there's any way to address these items, it has nothing to do with homelessness. To me, it has to do with heavy use of our streets reduction of city services. Already, I'm sorry, susan, I think susan. I just want people to know these things are. They are very bad. There are a lot of complaints, but they are being dealt with first of all, as far as businesses having their garbage picked up. That's all private kate carter. So that is not the city. They should have no trouble getting their pain to have their garbage picked up. As far as a huge amounts of garbage on the street, it is a problem. There is a reduction of services. There is no money, so we're saying: where do we want to move it and garbage seems to be an area that people of people are concerned about it? The council office up here was getting a lot of complaints about it. It's very much kind of a localized issue in our area, we're suffering more from it than some other areas. So I was asked to bring it up in my district service cabinet meeting. I was also asked to put it on the agenda for October, but we decided October was too late because it's impacting the outdoor dining. So I was then asked to have the exec vote on writing a letter about it, which I have already discussed with alicia and paul, because paul's committee is transportation, sanitation and public safety, so this will be brought up at the exec I just want. You know. I understand that one of the sort of disconnects and problems is that people don't know what's being acted on, and you know I'm not going to say it's going to be taken care of, but at least there's going to be an attempt to have it taken care of. So I just want people to know. Yes, it is a problem and because of the productive complaining it you know, the board is going to try and act on it, so that my question is then, which is it sounds like it is being worked on, but then does that mean that we don't need to include it in the district needs or do you think it'll have more of an impact or help your work? If you include it included in the district needs? Well, don't forget. The district needs is for next July, it's not for now. So it's not it's. If you put in the district needs, it's not going to impact anything, that's happening now, and hopefully this situation isn't going to be. You know we're not going to be seeing the same situation, but you will be voting in October on sanitation budget-ish. You know budget funding and that's what this is. It's it's pickup services, but I just you know I just we have to kind of with all the huge problems happening now: kind of differentiate between acting on issues now and a district need for which is a different kind of problem that we're gonna that we're dealing with next July. Hopefully, the garbage won't be on the streets till then, okay, we can go back to the actual document and if anybody has any sort of final changes or comments to this, I'm happy to read it through. If that makes sense, it's kind of long though, and you all have basically seen it for three months now. So if there isn't any further discussion about it, we don't actually have to like vote to approve this right. Susan, no we'll be voting in October. We just kind of want to finalize it, get it in condition. If some huge piece of information comes up between now and October, you can add it, but we'll be voting on this and our budget priorities in October, but we're going to want to focus the time on the budget priorities, and hopefully this will be mostly done. Okay, great, so I don't see any other hands up about this, so we will move on to the arts and culture district statement, but if anything does come up for economic development, please obviously email me and let me know if there's anything to be added at another time. So do you guys see the arts and culture district needs statement up now great? So I will let carolyn introduce this. Her subcommittee worked on this at their last two meetings and then we can take comments and make changes. So caroline I hand it over to you all right. Can you hear me hello? Okay, basically, arts and culture workers and arts and cultural organizations of all sizes have been impacted and a devastating degree by Covid-19 19.. The performing arts sector is one of the hardest hit industries in new york city. There was an article today, I think, saying that sixty percent of theaters could close because of Covid-19 and the restrictions and the rents. The sector lost 69.2 percent of its total jobs since february of 2020, which has put cultural workers, including performing artists and administrators in a vulnerable position. Many gig economy, artists and cultural producers have had no income since March and were not able to access unemployment benefits for months. The continuation of unemployment benefits is uncertain, while prospects commissions and projects are non-existent. Since theaters venues and all live performances initiatives are indefinitely shuttered. The negative economic impact on the arts and cultural sector is anticipated to last for three to five years, depending on specter sector. Specificities, artists and cultural workers are the creative capital of new york are integral to the creative industry that is fueled by new york's tourism and export economy for years. Can we scroll down? Please? Oh yes, with the majority of programs and all live performances, canceled all arts and cultural organizations, and venues are experiencing drastic revenue loss and significant reductions in annual operating budgets. This has caused an inability to cover operating costs, especially rents and there's growing fear expressed for the very survival of many organizations. Arts and culture are important to the psychological and physical well-being of our community. At this moment of crisis, it is even more important that extra funding, support and resources are given to local organizations that focus on the population most impacted by kovic, which are low-income. People of color. Here are a few specific programs. The city could fund for 2022.. The city could collaborate with the community to create WPA style programs to employ artists and cultural workers for the next three to five years, as the impacted arts and cultural industries rebound DCLA should collaborate with DOE to create grants and funding streams for cultural organizations that provide support services, including remote learning and after school programs for local schools. Dcla and mome should create grants and forgivable loans, in collaboration with the small business group, with specific parameters that can be met from artist lawrence organizations, this funding could be used for rent relief payroll, as well as for creative, online and outdoor programming. Many local arts non-profits rely on city council. Discretionary funding for their operations and programming and fy 2020-21 our council member, received 98 budget cut drastically reducing funding for these organizations within the district. We are calling on the city administration to reallocate DCLA and other funding to balance this funding reduction to a district that has been right into a district that has been it's been recognized as a vulnerable area, given the concentration of low-income communities and marginalized groups. Many non-profit cultural organizations within the CD receive annual funding through the department of cultural affairs, as resources are redirected to respond to Covid-19 19. The city's annual budget has become more constrained so that support for small vulnerable arts organizations are not certain and cd3 neighborhood art venues. Libraries, community, gardens and parks provide local, often low-cost access to cultural programming and arts and culture should be integrated into the city planning projects such as designated arts and cultural spaces and new publicly subsidized developments. City hall should move forward in reacquiring chavez. Elbow gio is a non-profit community and cultural center. As stated by the mayor in the October 2017 town hall, a restored character heel can needed access for a local web for arts organizations, stakeholders and leaders that reflect the values of the communities they serve. The city should increase community participation and engagement with the community board regarding all new cultural community spaces and publicly subsidized developments in the district. Okay, thank you carolyn. So you know, I think there are from the last subcommittee meeting to now. I think you know we've learned that DPLA doesn't do the budget priorities process with us with the community boards, and some of the things in here are sort of budget focused. That may be better, as you know, specific and separate resolutions, rather than being in the district needs. I think you know some of these bullet points towards the end, so we can go through that, but I just wanted to open it up to see if there any other sort of general questions or comments about this yeah. I was just going to say that it's really good and they're all really good ideas, but I'm just wondering, like the funding stuff, I think, could either be separate resolutions or should be budget priority stuff rather than DNS. Sorry, I'm having a hard time raising my head. Should I speak? Yes, go ahead! Sorry, I sorry also my daughter is having a tantrum, so I may need to shut myself if she starts screaming again, so I mean I think we can rewrite it. If you think that I think there may have been some confusion about the back and forth of what the town should have been, but there definitely is huge needs in our district because there is a concentration of venues and artist workers, and so it is definitely part of the district needs if we need to rewrite it so that it doesn't is so that it's not so much aligned as a budget line or kind of like a fancy request, I mean we can we can do that, even though, strangely we don't have a meeting this month. However, I mean we can do it remotely and maybe submit it. You know we'll find the best proper way to do it because we bought it in October right. So we do have time to change it right, anisha, susan. What do you think is the best way to sort of go okay, you cannot do anything remotely. That's it's not at a meeting, because that would that's against open meeting law. No, what you meant is before the October full board right. We have time before the October full board, if you well. So this is the problem and you got to figure out how to work around it. So it reports to the economic development. So, ordinarily, you would have the committee work on it and then it would go to economic development, because economic development meets the first day that academy economic development meets one week after the full board. Meeting and open meeting law requires that you have to you, know, post everything for one week, so nothing could meet earlier. So what you're saying is? How are you going to vote on it at the next economic development meeting without arts and culture beforehand, and what you would want to be doing? First of all, I just want to say this is directly talking about current budget losses, that you know the council. Member has lost discretionary funds, so there's no funds for the arts group that can't be dealt with in this district. This district needs because this district needs is for the year starting next July. So if you want to, if you want to act on current funding, you need to do that in an immediate way. That's outside this, because the district needs is for next July. So I guess the issue is. How could we do this to vote on at the next economic development committee? You cannot have a forum of the committee working on it. I guess one thing I could throw out is: maybe someone or maybe two people, because that's not a quorum, could work on changing. Instead of talking about funding talk about the needs, you want funding for certain needs, so instead you could translate that into what are the unmet needs that you're concerned about for next year and vote on that next month, because I think your needs are buried in there in the funding issue. I agree with that because I think all of the pieces are here. I think it's literally just taking some of these bullet points and instead of saying the city should fund x, y or z. It's just saying there isn't like there isn't resources for something to happen, and I think it would be easy to sort of convert some of these into needs rather than the funding priorities. Now that we know that the DCLA doesn't participate in the or I guess we are, we knew, but I didn't know, budget priority process with us, and then we can also think, as the arts and culture subcommittee, about which of these more immediate needs should just be resolutions. That subcommittee is able to do you know over the course of the next few months, because they are more time sensitive than 20 fy20. Do I mean right now in terms of small businesses and arts? I don't know if you're following, but there is a huge lawsuit organized by the musicians against sla because they made it illegal for any ticketing events to be happening and talking of hindering them being able to make a living. They basically flat out outlawed sla, any ticketing in venues so like even a bar or something they cannot ticket people if they have a musician. So this could be something a huge overlapping thing among nightlife establishments and arts and culture yeah for sure. Can I can, I add one more clarification, and this is about anisha was talking about, but your priorities, the budget priorities we vote on- are budget lines in the agencies. If you put in a request- because this has happened more than once- if you put in a request for something, if you vote on a budget request, say funding for such and such program, that is not from the agency, but their answer is, and they do this they'll say this is not belong to HPD. This is a console discretionary fund funding and the agencies that we're sending the priorities to they have nothing to do with the council discretionary funds. Those are two separate funding area. Susan to that point, I think what came up in our committee is that, because the cats are gonna, have a huge impact and because a lot of the cancer discretionary funds actually fund a lot of the arts and culture organizations that cater the neediest kids in after school and arts and culture programming. So we wanted the city to step in and give extra help you know, but I think this is actually something we should do in erezzo, but it is. I agree, yeah I'd like to comment. I think that one. Yes, it has a huge impact on, what's going to happen to smaller arts and cultural organizations, because basically, they have traditionally been funded through discretionary funds through the department of cultural affairs. That's not happening, but you're talking about this is going to be for the following year. So how do you address the issue that all of these people who are impacted on by the laws of this funding for this year? How do we help them get into the next year? You know their needs are not going to be less next year because that's already been sort of demolished practically. What happened to them this year? It's a very difficult thing, I'm not going to say you know: we've never experienced this before so there's no easy answer, but what you're talking about is console discretionary funds, so it I would deal with it through the council members. You know they. You know they and the speaker determine with their limited amount of money where it's going. The agencies that we're sending our priorities to have nothing to do with that. That's more! That's! Strictly! Council- and you know you could do a resolution and send it to the council members and then use the resolution to lobby them. Basically saying we want you to change where your passive money are going. Okay, the problem, the lots of money are determined by the speaker. Apparently the other issue is there are arts programs in transportation and I think the department of sanitation that arts organizations and artists would be eligible for is there any way of including that and this that the food perhaps might be increased there? We have not had our budget consultations with them. Yet nobody put that question in on the budget, but we can try and get it in. I don't. I don't think they have a separate program line for that. I think what they do is when they they're looking at say renovation of a park they're going to include a certain amount of money in that renovation. For this art wall they don't have a special, a separate art budget line. So that is something when the project comes to the community board. That is something you lobby for in that project. Okay, but what about the department of transportation and the department? It's the same thing I will ask. I don't believe they have a separate budget line. I've never seen such a thing, but we'll ask okay. Actually I can answer wendy foyer is the assistant commissioner for urban design and arts in d.o.t and she runs the program, but I don't know what happened with the budget this year. So that's the line to ask about wendy foyer's budget, our meetings start in about two weeks. I will try and get the questioning. Thank you. Thank you, so carolyn. How do you want to move this forward? It seems like it's not ready to sort of be. You know presented fully to economic development, yet it seems like there is some more work to do just to clean it up, given what we have learned in the past couple of weeks. I think that you know we can work together to figure out how to change some of those bullet points and then present it at the October economic development committee meeting and then have the arts like have more arts and culture people come sub community members come to sort of weigh in on it then as well susan. Does that make sense to you also yeah? I think that's, basically the only solution I can see- and it seems very legitimate to me well, since that's the only option that we happen to have at this point in time. What else can I say? Okay, great. I think it should be pretty easy to do honestly, and I also think that we can figure out which resolutions can come out of this district which what can be taken out and be made into resolutions also, so you are still being able to work on all of the different issues they were raised. I think those are all of the agenda items for today. Are there any other questions comments. Anything on anybody's mind, that's pressing great, so we can do a roll call vote to end. The meeting yes motion to adjourn anisha, stephen, yes, megan, joy, yes, alistair, economicus, andre gordillo, yes, herman, hewitt, joseph kearns, yes, david louis, yes, alex alexandra milotano, yes, richard ropiak, oh sorry hold on one sec. I think I accidentally muted richard okay, richard yes, rodney washington, yes, andrew comey, yes, okay, all right! Thank you! Everybody have a good night. Thank you. Thank you, megan. I think you stopped the recording, not pause. All right, I'm not entirely sure honestly, olympia, I'm so sorry again that I didn't call on you. I couldn't.",
        "summary": "If any of the community members have issues that you know, they would like to bring to the attention of the full committee.\nI think there are different ways we can work on it, but hopefully this one is a very straightforward issue and the resolution is pretty straightforward, So megan, if you'd like to sort of introduce the context for it, and then I will bring up the resolution because alex made some comments on it.\nSo this is, you know, sidewalk cafe, licenses that are issued by DCA department of consumer affairs.\nSo usually the process is when you're applying There's certain application fees when you're applying for the first time you know But, since Covid-19 happened, they stopped issuing those licenses, but they- What are they doing with their application fees?\nSo I, you know I'd like for them to return the money to if the applicant so chooses the money to be returned, which I don't think I made clear at the end, so I might want to tweak that a little bit, but that's kind of where we're coming from and happy to answer.\nOkay, when the when the city opened up the process for the sidewalk cafes, I do not recall there being, like all of us, I'm, aware of several places that they're sidewalks, I never thought about a fee, I'm, not sure how the city can justify it, except under the heading of long-term practice, but Given everything that we're going through economically, I have no problem supporting megan's resolution asking that they returned these fees back to the applicants.\nDid not include the return of sidewalk, cafe, application fees for first-time applicants I wanted to add, because I guess I what I don't know how to put it, but I just thought of this before the meeting is: I don't want them the DCA just to return all the application fees and then to feel like businesses if they are staying, open kind of like lost their place in the line and aren't What, if we get rid of this open restaurants program, you know in a year or two from now they want.\nTherefore booze on community board, three requested consumer affairs refund, not all but sidewalk, cafe, application fees to restaurant applicants who have yet been granted licenses who are like or who so choose to have their can.\nSo the last it says, therefore be it resolved that community board 3 asks that the department of consumer affairs refund all sidewalk cafe application, fees.\nAlthough the city suspended payments for sidewalk, cafe renewal fees during the Covid-19 19 crisis, it did not include the return of sidewalk cafe, application fees for first-time applicants and whereas the department of consumer affairs that processes sidewalk cafe, license, applications has not communicated with applicants about when their licenses may be issued or when their fees would be.\nBut for the most part you know there haven't been that many comments from committee members about any other major changes is wondering if there any other sort of final comments to this, where people feel like we are on this.\nThink susan could probably comment on this, but he wanted to bring up how the increased drug use on the streets, the drug selling and the drug use is acting as a deterrent to people moving into the neighborhood and Also businesses trying to operate in the neighborhood.\nThink I agree with anisha that yes, like if they're going in community board theories district needs statement anywhere.\nThere are a lot of negative things happening in the community that are impacting businesses and it's not because there are some homeless people on the street in front of the church in the nativity or in front of the luxury condos that were the side of the second avenue.\nIt is a problem and because of the productive complaining it you know, the board is going to try and act on it, so that my question is then, which is it sounds like it is being worked on, but then does that mean that we don't need to include it in the district needs or do you think it'll have more of an impact or help your work?\nThe city could collaborate with the community to create WPA style programs to employ artists and cultural workers for the next three to five years, as the impacted arts and cultural industries rebound DCLA should collaborate with DOE to create grants and funding streams for cultural organizations that provide support services, including remote learning and after school programs for local schools.\nI think you know, we've learned that DPLA doesn't do the budget priorities process with us with the community boards, and some of the things in here are sort of budget.\nJust wondering, like the funding, stuff, I think, could either be separate resolutions or should be budget priority stuff rather than DNS.\nAre you going to vote on it at the next economic development meeting without arts and culture beforehand, and what you would want to be doing?\nBut I didn't know, budget priority process with us, and then we can also think, as the arts and culture subcommittee, about which of these more immediate needs should just be resolutions.\nHow do you address the issue that all of these people who are impacted on by the laws of this funding for this year?\nI. Think that you know we can work together to figure out how to change some of those bullet points and then present it at the October economic development committee meeting and then have the arts like have more arts and culture people Come sub community members come to sort of weigh in on it then as well."
    }
}