{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCNZyLULUQBp5e9Q1cKtvk6Q",
            "title": "Top chat replay",
            "publishDate": "2020-10-29",
            "shortDescription": "",
            "lengthSeconds": "1:42:15"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "bLnv23J9SyM",
            "fillerWordCount": {
                "uh": 298,
                "um": 214
            },
            "readTimeFullTranscript": "64 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "school": 146,
                "kids": 47,
                "students": 46,
                "learning": 36,
                "parents": 33,
                "day": 33,
                "schools": 29,
                "voting": 24,
                "teachers": 23,
                "events": 22
            },
            "wordCountSummary": {
                "school": 34,
                "students": 15,
                "parents": 12,
                "kids": 12,
                "schools": 8,
                "day": 8,
                "voting": 8,
                "children": 7,
                "learning": 6,
                "student": 6
            },
            "fullTranscript": "Well, we're at 6:30. I'm going to again begin a little bit informally, but with the thought that maybe a few more will show up in the next the next few minutes. Here we go and as I as I actually was saying a moment ago, let's see who else is here? Oh good, so people are showing up Brian, Pamela Paina. Thank you all for coming, and I see yes Mayo. Thank you. Thank you good to see you all David Jacqueline. Thank you. Thank you good. Well, back in college, you know they used to start the classes like seven minutes after the hour, because that's I guess how long it took us to navigate to get there, but I am. I am going to at least begin the conversation and, as you may have gathered you know. My thought for this session is to do what we can given the extraordinary circumstances. We're under dealing with the challenges of coped to understand, get some insight into where things stand. You know what is happening now going to ask Romney to provide some input as somebody who's. Actually, you know in the midst of the the system. I might say the swim swimming pool somewhere between the shallow end and the deep end. His father, Offier Seagal is a you know: you're a principal at your school, a principal at a school not in the upper Manhattan actually on long island, but can provide some insight and perspective in terms of what you know trying to navigate. These challenges looks like from an administrative perspective, and I do have one two others who may be showing up that can offer some other perspectives. So first, is to understand where we stand. Second, is to get input and conversation around what the particular issues challenges and concerns that people may have about. What's going on now and to the extent that we can actually identify this- and I do not know exactly what this would be I'd like to think about what we can do as a community and community board to be supportive of our parents, you know, and students, and also our faculty and our administrators, because everyone's trying to navigate this situation, which is obviously you know new to all of us. I like to say that one of my longer suits is coming up with bad analogies, and so my bad analogy for what's going on, is it's perhaps akin to being on the titanic, hitting an iceberg going underwater in a submarine and then going upside down and trying to navigate. You know icebergs and potholes. I know that I know that algae does necessarily work very well, but at least it tries to convey the newness and the degree of challenges that we're trying to navigate that. Frankly, we can't expect people to be prepared for at least other than what they might have come up with in the last. You know three six, eight months, because we had not confronted this before. Having said that, I'm going to provide at least some comments that I've gotten it's from a meeting that were held that was held with the chancellor actually a couple days ago, and some highlights that were recorded just to give a little bit of a snapshot at the extent that that's useful, which is that 48 of the students are now doing blended learning the rest are doing just remote. This is, there is a window, but it is- and this is, I think, relatively new news- there is a limited window within which parents can switch from remote to blended learning this coming month in November between the 2nd and the 15th of November and that window. At one point, I think they had thought that they could perhaps have that window open over a longer period of time or even ongoingly. Now it is a defined period of time in which you know, parents and students can make that transitional choice to blended learning, because the system needs to adapt to the different numbers of people who are adopting each approach to participating in our schools. The Learning Bridges site are still ramping up. That is the site that deals with learning disabilities and special needs. So they're, still working on trying to you know, bring that site up to a strong and functional level, they're still working on ensuring that all rooms meet ventilation standards they do have and have put in place a third day supply of PPE and cleaning supplies at at all. Schools. There's a hotline for principals if they need to get more. There was a statement that, to me is a little bit ambiguous that all school buildings and child care centers have quote access, unquote to nurses through health and hospitals. So I I'm not assuming that's necessarily on site, but it is. It is a resource that can be accessed as hopefully as needed. The chancellor and superintendents are doing some school visits, unannounced to try to understand that health and safety guidelines are being adopted. There are a set of issues around testing that says student. This is this is testing around the virus. The students can get priority at most sites, they're now using not long, swabs but short ones, which apparently have less discomfort, and students and staff are reportedly able to get results in 48 hours and now a few more particular comments there's a significant issue, as many of you may be aware in terms of Wi- fi connections in shelters, something that was obviously needed for those students who happen to be in shelters. They're working on that there's an issue with what you know: phone services they're using in the quality of coverage- and they honestly say they're working on Wi- fi is still an issue. All buildings are expected to follow the same health and safety protocols. If someone comes across a situation seems to violate appropriate protocols, there's a request that be reported in terms of grading systems. I do not have a lot of information, but does that say that the the city and state commissioners have agreed that they would not have standardized tests this year? Apparently there's an issue is where the federal government will grant a waiver on that which the federal government to date has not yet done. Let's see in terms of devices electronic devices that students may have and that may need upgrades, they simply say they're continuing to work on distributing devices. There's a shortage of devices worldwide and schools need to be reminded to distribute all devices not to keep them in house. So that seems like an appropriate recommendation, although it concerns me to some degree, because you would think that message would have been well disseminated. There's also an issue in terms of as more parents Opt for blended learning, that there may well be a need for more teachers and the Department of Education is working ongoingly to try to make available enough teachers to address that issue, and the last point I'm just going to mention is given that the scheduling issues for children's there's a question of how students will get food and they simply require a request that there be a report on anyone, not getting food. That arrangements are being made at each school to make food available. So, to the extent that's helpful, that's a that's a bit of an update from the chancellor's office in terms of in terms of what's going on where the issues are and what they're trying to work on, and I do want to say at the outset. I almost do not even know how to say this, but I do want to be sympathetic to the challenges that everyone's facing students, in particular teachers, in particular families and parents in particular, and administrative staff. In particular. Everybody is navigating what is obviously an extraordinarily difficult situation, and so my point of view is simply that our tone and our intent be to be as supportive as possible, not being bashful about putting issues on the table, that's totally appropriate and desirable, but that we, at least in our tone, try to be constructive and, having said that, I'm going to invite a member of our youth and Education Committee Rami Siegel, to give us just a personal snapshot of what his experience is in the in the system and romney. Why do not you start by just mentioning the school you're at and the circumstance you're facing yeah? So my name is Ramy Seagal, I'm a public member of the Youth Ed Committee. I live on 78th street in the district and I go to the Clinton school. It's in Union, Square district, two public high school and I recognize a lot of your faces, slash names since from our last meeting, which I spoke at as well. But if you, if anyone remembers what I spoke about last time, just as a follow- up to that, not much has really changed in the past month or so pretty much the past three months since back to school started, it is almost November, and so it's in theory that getting used to coming back to a remote school has passed. There's a supposedly a rhythm that is going on. There are not many that a lot of the issues surrounding remote learning have theoretically been worked out, but in reality none of that is true. Many students are still adjusting to remote learning, we're not seeing we're seeing teachers as well as students struggle on remote school or in just like the mechanics surrounding remote school, we're seeing at my school not much of a policy shift from where we were at last year with a with an emergency pivot to remote learning and so, and so that has a few effects. So, for instance, students are struggling. Students grades are falling. I've noticed of many a few of my friends who typically get straight a's, who are saying like hey. I failed this test wha. What like, are you struggling in the class too, and that is something I'm seeing across the board, and I I'm involved with student government with my school and we're also seeing that through student government is, is just a lack of outlets for students to vent or to to just state what is going on with classes, what issues they're having and then there's also students that are that are not being advocated for or not advocating for themselves. As Peter said those who are less fortunate. Those who do not have access to Wi- fi those whose DOE computer is not working very well. Those who are struggling with in- person school the hybrid approach and who are having problems with just sitting in class for sit in a classroom with a do with the door locked for six hours a day and we're seeing we're seeing a lot of that, especially at my school. I, as I said in our last meeting, I'm a fully remote student. I have not been to the building yet this year and I do not really have plans to just this. Past week. The DOE stated that there's only going to be one other opportunity for students who initially signed up for blended learning to switch to for students who initially signed up for remote learning to switch to blended learning. If you sign up for blending learning in August, when they first sent out that form, there's, you can always switch to remote learning. There's no penalty, nothing surrounding that, but the effects of a decision such as that will there's a short- term effect, which is that schools have to restructure their entire hybrid setup surrounding the number of kids that and that who initially signed up for remote and are now signing up for in- person and that's going to happen sometime around November and there's. I do not know if I do not know the exact date off the top of my head, but there's some estimates around thanksgiving time, but I'm not sure about that statistic. But then there's also another effect of what is going to happen three months from that deadline from when that form is due and students who stuff comes up at home and their parents, their parents who were unemployed now get a new job and can not have child character at home. So what is going to happen for those kids who need to go to in- person school in three months, but do not have the option to do that, and so there there's a it's. Definitely there's. Definitely a lot of aspects surrounding both hybrid approaches and a remote approach that have caused issues that are a being overlooked by Central Dle, because part of it is it's not their job to manage that. But then the other part of it is what can a school do from a school perspective or what can me, as a student, do or me as a person who is in student government, do to help those who are not being vocal or not being advocated for so yeah Peter? That's pretty much my update. I appreciate it and I do not even know if you can answer this question, but your intuitive sense I'd be interested, at least in sort of a brief sense. Do you have any sense of the degree to which, at least at your level, you're in 11th grade, there's a material difference or how you might characterize or try to characterize the difference between what you're experiencing as a fully remote student and what the hybrid students are experiencing, which I think is leveraging the same technology, but I'm not sure so right. So I can't answer this question in that. So my it's a very school- based approach, so back, as I said in our two previous meetings that it's really up to a school, so a school has to submit a plan to the DOE that says hey. This is how this is my safety plan. This has been approved by students, teachers Faculty, everyone administration. That says, how are we going to keep students safe in the building so and the deal we put out three or four cookie cutter programs that a lot of schools adopted? But then my school had a little bit a few modifications to one of the cookie cutter programs. So they kept the schedule of the DOE release, so there's different cohorts or pods or whatever you want to call it in my school and they go in. They have a two week cycle in that they go in probably twice every two weeks and when they do go in it's pretty much remote learning from school. So in my school there's rooms for of six to eight children with one teacher or one faculty, member and they're sitting six feet apart, masks on door, open windows, open sitting at a computer sitting at a chromebook sitting at an ipad or whatever we have going on in that school on a zoom class. If you are in person and you're in the same room as a teacher you're still watching on zoom you're, not watching in person, and it's really just babysitting a few teachers at my school have spoken to me off the record saying like hey this is this is ridiculous. Like some teachers have filed the medical exemption form at the dewey after school started, because they felt unsafe in the school building and that's not anyone's fault, that's not the fault of the school. It's just the fact that we as a as a full school system, as well as just as a full society, are not prepared to protect our teachers during the Covid-19 pandemic and during the second wave that we're experiencing right now got it. Thank you that that's certainly at least gives us a sort of a snapshot of what that environment looks like and feels like so Mr Siegel. Would you would you like to offer? Well, let me first does anybody have a particular question, I'd like to ask Rami I'll take just a moment if somebody, if it's your first time, joining one of our zoom virtual meetings for Cb-8, we take all of our questions through using the raise hand, feature Jane has her hand up right now, but you'll just find that through clicking the participants button at the bottom of your screen and then hitting the raise hand button once that screen pops up if you're on the phone, it is star 9 and then I'll go to the first question. If that's okay with you Peter, please Jane, please do great Jane welcome. I just want to say that I, as you guys know, I am a teacher in the d for the DOE a card carrying member of the uft, I feel extremely safe in my school. I feel that the DOE is doing everything they can to keep the teachers as safe as possible. We were all tested last Friday, there's plenty of PPE equipment. Special people come in and clean the classrooms top to bottom in the middle of the day. In addition to at night just wanted to clarify thanks, oh thank you very much and just the observation on that observation. Clearly, any observation we have is it's like a snapshot of a particular point in the system, and you know whether it's a you know something that looks like or maybe a deficiency or something that looks like something that's working, particularly well or managing to navigate this. Well, I mean obviously part of the challenge of managing a school system. Is you have you know an untold number of teachers and classrooms? Now some are virtual. Some are some are live but or virtual within a physical classroom that you're trying to manage and again where I, where I'm coming from, and the tone I'd like us to continue to adopt, is appreciation for all the challenges that both the parents and students, as well as the teachers and administrators are navigating in this. You know most challenging and difficult situation. Having said that, Mr siegel off here, would you like to give us a perspective of somebody trying to you know oversee the operation at a particular school sure, hi good evening? Thanks for having me, I am a cba resident, but I work out in long island great neck, I'm actually a principal of a private school there, so we're running it a bit different than than DOE and we do not actually have to follow all the New York state regs as much as a DOE school might have to. Although we did have to submit a plan by by August 15th to New York state stating what our opening plans were, just as every other school, public or private had to do so. All summer long I worked with my my colleagues a couple teachers and parents to set up a opening plan. I also have a board of trustees that I report to as the principal I report to board of trustees, and they are essentially my boss, but I am, I am my own boss at the school. So I open. We have a pre- k through eight and I have about a little less than 800 students that I'm in charge of with about 120,100, almost 130 staff members that I employ and run every day it's been, it's been tiring, I'm I do not know. I look tired. I I'm looking at myself in the camera. I'm like! Oh my god. That's me. I feel like one of those you know, presidents, that when they start the term they look young like Abe, Lincoln and then years later they look like they they've been through the to the ringer. That's how I feel- and it's not even been a year. Yet it's I'm tired. It's exhausting it's! It's very exhausting, there's a lot of things that we're juggling there's a lot of balls up in the air. I think Peter, you had said it earlier: we're juggling different policies from different people, meaning that we have a long Nasa County has a department of Health. The New York state has a department of health. We have our own committee of Health, which we hired two medical doctors and a couple parents to help us navigate through some of the new policies that almost come out every day and I think Romney said it pretty well that the different policies for different schools and they're all they're cookie cutters, but we are able to make it our own when we have to. It has not been easy. We've overspent, my well we've always spent almost over 800,000 this year on our budget for PPE equipment. We have not socially distanced. We went the route of barriers, we bought polycarbonate barriers for each desk, which is sort of plexiglas, but you're not allowed to use plex glass in classes anymore. Plex glass is highly flammable, so we actually have to go for the more expensive polycarbonate stuff which surrounds every student's desk, so they're in a clear cubicle almost and it it's pretty cumbersome and awful the and we have it for every desk in every classroom and we have up to most classes. The biggest class I have is 22 kids in a first grade classroom. Every other class is smaller than that. Probably average class is about 17 students in a classroom with two teachers in every classroom. I have a main teacher and assistant teacher in every classroom and then we've because of the sed. The State Department mandated social emotional learning. We've had to re- trigger our whole scheduling to make sure that we give social, emotional learning, at least in a long young degrees. We do it about twice or three times a week in our middle school. We do it on a daily basis. We actually have a scheduled period every day for social, emotional learning. I thought our first graders second graders or youngest kids would have the most trouble with wearing masks and being in this sort of cubicle, but it turns out that our middle school kids are probably the most effective affected out of all our students. Let me just put this way as an educator for over 30 years in many schools, including the DOE and being a principal in a charter school for four years and being an assistant principal for many years. Middle school is not about learning the abcs and 123s anymore. It's not about content so much, but it's about learning how to be social, how to deal with social emotional pieces of it. What we found is that we've stifled our middle school students to these individual cubicles, which is not socially good for them. They're in masks. They can't sort of be close to each other, where middle school students typically learn the taboos of life through social interactions. What is acceptable, what is not acceptable? What line they're allowed to cross what line they're not left across we've taken that all away from them, including lunchtime where we are socially distancing, lunches recess time? There is no recess phys Ed is yoga or stand in place and kind of throw a ball around. So we've we really took away that social piece for them and they're, probably suffering the most emotionally from this from this pandemic, the kids that are home so rami mentioned hybrid. We do allow hybrid learning in our school as well, so stu parents who are either immunocompromised or students that or parents are uncomfortable sending them to our school are allowed to zoom. I will tell you that the teachers are having a very hard time, teaching to you, know: 15, kids or 15, kids in front of them and then five or six kids on a zoom session behind them or in front of them. We have ad hoc technology, we have these webcams that are set up on computers or in the middle of the classroom, and then teachers are trying to make sure that they're reaching their students at home or reaching their students in these cubicles. So it's a kind of a it's kind of a mixed bag and it depends. We also pulled rolled out some policies to say in the beginning, I had policies to say that if you're out for a day or two, you should not be remoting into the classroom. We since have changed that policy, because parent we realize that if a kid is sick, we want the parent to keep them home. We do not want them to send them in back into two years ago, or a year and a half ago a lot of parents used to you know if the kid woke up with a slight fever or a cough or things like that they used to drug them up, give them some Motrin or tylenol and send them off to school, and they made it through the day great. If they did not make it through the day, the nurse would call them home. We do not want the parents to do that anymore, because any symptom could be a Covid-19 symptom. So what we've changed our policy is. We have a an email that we monitor in the morning I get to school about 6:30 7 o'clock, and I monitor these emails that my child rami is going to be remote today, because he has a slight cold or he has sniffles or he has whatever. It is we're encouraging parents to keep their kids home as much as possible if they are. If they have any symptoms. We also have an app that every parent has to fill out for every child before they send them to school. So they have to be honest with us and it's the honor policy where they have to check their fever. They have to make sure that they are honest with us. They do not have the sniffles. They were not out of the state that they were not anywhere near a Covid-19 positive person that they know of all sorts of thing questions I mean it's a it's a probably a 60-minute questionnaire, but they all have to fill out the app if they do not fill out the questionnaire. I employed a person in our school that calls every parent that has not filled out the app. We do temperature checks as they walk into school, and if a kid is feverish, we have an isolation tent. We put them there. The nurse is there early, I paid. I have to pay the nurse more money to be there earlier. We call a parent and immediately they get home. If a kid is sent home with any fever, they can't come to school within seven to two hours and they have to come in with a Covid-19 negative test. So we've been testing quite a bit. I have to say: Northwell has we have let we have a northwell hospital not far from our school they've, been very helpful to us. In fact, we were approved, as of yesterday to become a abbid like Abbott and Costello Abb Ott Rapid test center. So they set up five machines in our school to be able to test not just our own students, but anyone in the community that wants to come in and test a rapid test. It's about a 15 to 20 minute test and we've set it up in our school, which helps our students. The one problem with the rapid test is that the only way you could get tested is, if you're symptomatic at the point at that time, which is good and bad because now we're inviting we do not allow parents in our building whatsoever, but now we're inviting the public to come to our school and get tested. So it's kind of like a balance that we've decided that it's probably a good thing to be a host center, but we kind of figure out a isolation temp for them as well. All these things I mean you talk about. I do not even know what the kids are learning to be honest with you. I am managing so many different Covid-19 pandemic things, and not only that, but I am I am in a community that is still having big functions: weddings bar mitzvahs, bat, mitzvahs parties, birthday parties, they're having probably super spreader events. This is in great neck by the way so they're having these super spreader events and every Monday morning I get or Sunday night. I literally get bombarded with texts of pictures of these massive events that they've had indoors. So parents are sort of starting to rat each other out and saying look at these events that I know are happening, and you should know that they're happening as well and- and I have to mitigate the the outfall of those we do. We do have positive cases in our school. We do have pods, we've had to shut down pods. In fact, I have two pods out right now, because we had siblings that were tested positive and we closed down the pods immediately. We've had teachers that became positive and we've had to quarantine different sections of the school during certain times, and that's just that's just the tip of the iceberg, because the second wave is coming. Someone called me today, who is a business person in Europe, has a lot of dealings in Europe and he says we're we've been about two weeks behind Europe and he's like if you notice, France, just shut down Italy just shut down and Spain just shut down, so we're about two weeks behind them and our fear is we're going to have to shut down in a couple weeks as well. So it just kind of called me to give me a heads up of what's going on around the world. I see a lot of virtual hands up, so I guess will you want to run that and I'll answer any questions or if I can answer any questions and I'll be as open, and you know as I can, without giving away too many of the insider secrets, as I can all good, and thank you very much yes, so I'll start with Tyena, please dana everyone. So my I had a leftover question for rami. So I'll start with you Buddy. So thanks for sharing your perspective is really important. Ramy and just like really. I can read a lot about this in the news, but there's nothing like hearing directly from a student. So thank you. So you mentioned that you're involved in student government. I'm just curious if you can share a little bit about how just like the remote situation has impacted, in particular in high school sort of extracurricular activities and any sort of like all that additional stuff. So obviously, I'm cognizant of the fact that you said many of your friends have sort of dropped in grades, but obviously you know it's really important for college applications to stay active and a lot of different activities. So how has that been impacted? So you're? Definitely asking the right person for that so with without reading too much of a resume right here, I'm really involved in student life. At my school I was elected at my student government for the past two three years. I do not even know anymore, I'm the president of a jewish New union and we just resume so I'll talk about that club because that's it kind of important to talk about now. We just started last week we renewed started meeting again, and that was that was definitely a great start to the year. It is definitely very late for us to start last year. I believe we started like the first week of school, which so it's definitely impacted what my me and my team had planned for the year from a student government perspective, so the pro I'm as of right. Now I'm not the current president, but the current president is planning a town hall initiative, but as of right now, that's been delayed because of halloween, because of course we have to do halloween events because I'm sure that's more important than than the pandemic that's affecting us, but you never know and then also it's also adults around the world have lost jobs, there's no there's very few jobs available for adults, and the same goes for students, many students who typically would be working at this point, starting at 15 years, old, minimum wage jobs or just even volunteering for some opportunities or trying to get an internship. Those internships are very difficult to get at this point. Families that often relied on their children as they spoke about, I believe, before the summer is the summer youth employment program and how that was nearly shut down for the summer and how catastrophic that would be, and the fallout was felt because, although the program was still put back on track, there were still many students that were unable to get jobs through that program, because there's just no jobs, we do not have jobs in the city. We do not have jobs, we do not have jobs from companies. We the city's, not employing anyone. So that's definitely impacting it that that's a very serious issue in that extracurricular activities are very intense. My myself and a few of my friends have been have been volunteering for political campaigns, because that's one of the very few organizations that have been hiring- I know. Marco knows I see you, marco, and so so that that's definitely that's. Definitely one of the few groups that are hanging government offices as well they're. They are hiring. But besides that not much that's helpful and then my question for you Ophea. Thank you for sharing your perspective. I think. Can I just back up on that too. We canceled all of our after- school middle school programs as well, including all our sports programs, have also been all shut down. So any kid that wanted sports like it's terrible, because that's another avenue for some of the kids- and I know I know ramy- could see yeah, but sports and rami is also the editor of his Clinton post, which is the newspaper all those things have been really impacted. We have a school newspaper as well and that's why I bring it up. All those things have been shut down because nothing after school could happen, which affects a lot of kids who depend on sports, want sports and things like that. It's really difficult. So thank you. So my second question for you, oh fair, was whether you know- and I think it's different in the DOE. Obviously the chancellor and the mayor are leading a huge system and there's only so much they can sort of share in advance. But you know you're leading a big school that is, you know close to New York City. Are you and you're bored really, anticipating that essentially life, as we know it, and as you're leading your school will be the case for the remainder and entirety of the school year? Yeah we're looking at the entire school year. It's been we're. Looking, yes, we're not even thinking this year, we're thinking next year as well that unless there's a real good opportunity for some vaccination you're looking at fall. 21 of it's still being like this, I mean that they're going to be people that are that are still you know, so some people are immunocompromised or are scared or and I'm in a private school. So you're talking tuition and Rami said that we're losing jobs. You know a lot of our parents have requested tuition assistance. Now our tuition assistance works very different, because parents who apply to our school in November we actually just opened up November 1st, is our application, the start of our application year. You know gearing up for applications. When you apply you at the time you apply to our school, you ask for financial aid at that time. So last November people that applied for our school, the Covid-19, did not exist until February March in our in our place. All those parents that had lost jobs were now scrambling to figure out how to pay tuition. We did put out a huge you know bailout program for some parents. We knew that we're really struggling, but there's only so much money. We have in our endowment as well to be able to support that so we're going to feel it for quite a while we're going to feel it next year. Although our enrollment did climb this year, we had more kids this year than we've ever had, and the reason was because great neck public schools, fumbled in March April and may during their remote learning series when we closed schools essentially and back in March, they fumbled greatneck fumbled hard on their remotes learning, which we did not. We shut down 24 hours and in 24 hours I had to school back up remote learning fully for all 800 students, including our pre- k through eighth grade, and that was a huge I mean we asked romney. I was up for about 72 hours in a row. I did not sleep for three or four days, just making sure it all worked out, so they were impressed that we had a lot of applicants from great neck public schools come to us and say: well, you guys are doing such a great job, doing remote learning. We want to be part of your school, of course, we're a jewish day school and it's hard for us to say no to people, especially jewish members of the community, but we only have so much room in a physical plant if we were to reopen which we did so yeah. So I think I think we're in this for a long haul, and I think, what's going to happen, is, as we see cases pop up and these super spreader events or things and we're talking about herd immunity. I do not know if that's a thing or not anymore, we just kind of say, let's just all get it already in the school and that way we're kind of well covered, but that's not a good idea. Either there are people that are still dying from this thing, they're not dying at the rate that they were dying in March and April. Our community lost 26 members of our school community, meaning Grandparents Board members. I lost. We lost a parent to this to Covid-19, so we felt it pretty harsh in our community 26 members of our community have gotten Covid-19 and died from complications of kohit so which is terrible, but you know what you kind of forget about it as we go forward, which is terrible to say those funeral, some of those funerals which probably would have attracted probably close to you, know, 600 to 800 even a thousand people. We lost some pretty heavy hitters in our community to Covid-19, which would have attracted a lot of people to their funerals. Actually, we only had 10 people, a jewish minion that was allowed to go to their funerals, which was terrible, which was heartbreaking to these families or to these people, as the jewish community lost incredible people to this to this terrible pandemic. So yeah, I think we're in it for the long haul, unfortunately, and yeah I'm going to offer one quick comment, because you said something for you that struck home with me. I mean I, you know I invested I over invested in academics, but I actually think at least in recollection- and this is an amateur speaking everybody- I think the two most important takeaways I took from secondary school- I mean I went to a private school, but one was on the playing field when you get knocked down to get back up, and I mean that absolutely literally and the other was I was assistant editor of my school newspaper and the best part of that and the most memorable was writing headlines. But I now I now in my consulting almost always. I will ask somebody well. Do me a favor, give me the headline and then we'll worry about the rest of the story, which only to me underscores how important the out of classroom and extracurriculars are and that one of the things I'd like us to think about ongoingly as a community is what we can do to support our schools, and maybe it will be in some fashion, supporting you know, out of classroom extracurriculars now, next speaking, elita thanks Peter thanks will hi. Thank you guys for being here. Aside from how much you look alike for sharing all of your information and perspectives. So please forgive me because I may have missed something but Mr Siegel. Could you just explain this? The super spreader events that are occurring on the weekends when you get all of the pictures on Monday, oh Peter, you must put that dog away. It's so distracting, although adorable too bad, you can't do touching green, but in any event, it is really cute. What how do you deal with that? Do you just because, if you're letting people into the school and at the same time you're a testing facility, it seems and knowing what's going on in Europe, it just seems like a recipe for a shutdown with a lot of people being sick, and I assume that people have grandparents. People have parents, people have other others and from what I read in the times that it's even small events like small reunions, not even reunions, play days that schools, open and people feel that okay. This is great. Why do not? I have little Johnny a little susie come over for playdate with their nannies or their parents, and then they people have been getting more sick from those than from big events. So you have both those which you do not even know about, probably because they're, just regular things plus you've got the super spreader stuff. So how do you let people go to school when they've been at these big parties over the weekend and it takes days for symptoms to develop and they may not even be symptomatic. If I missed something, I really do apologize and again your honesty and forthrightness is so is so appreciated. I would like to say from the community at large. Certainly I do because we do not get a lot of honesty. So thank you. If I lose my job tomorrow, you'll hire me Lolita. I do not. I work up I've, I'm selling one. So I do not know what I could do. That's fine! I I'll work with you, but so the truth is it's been. It's been really challenging when we find out about a super spread event. What we do is we ask the we ask the host for the guest list. We actually literally call them up the next morning and say we need to see the guest list, because you know, if there's any of our parents that are on that guest list and their children are on that went to the event we automatically put them on quarantine for two weeks, whether they're positive or not, whether they've been tested or not. I do not care, even if they test and test negative. You, like you just said it takes. We realize it takes an incubation period about four to five days for actually just for symptoms to happen in adults, but in kids they they're asymptomatic. A lot of our kids are tested, positive or asymptomatic. What we've also done is we've forced our parent bodies to test every week. We have a test, I should not say every week we have a rotation of a couple pods test every week and it's a mandatory test. So what we've done is to sort of stop the asymptomatic kids from spreading it even further. So we have a sort of a rotation of kids that are being mandatory tested, but we asked for so. There was a an event this Sunday that we knew about. We knew before Sunday. We had asked for their plans a lot of a lot of our event. A lot of the events that are happening are happening in New Jersey by the way. Just so you guys understand. What's going on, New York state has a cap of has a cap of a certain amount of people that they're allowed in the halls in the in the. In the you know, the catering halls, New Jersey, has a has lifted or raised their cap. So what the people have realized that if they go to New Jersey they're allowed to have more people at their events, so they're going right across the bridge and are having these super spreader events there, because they could have more people. Now, some people are abiding by the rules right, they're having it outdoors, intense and masked up, but I'll tell you if you're, if, as soon as you have drinks and food, you have to take your mask off in order to drink or eat, and that's where the super spreader events are happening. A lot of these halls in New York state you're not allowed to have any dance floors whatsoever, but guess what in New, Jersey you're allowed to have dance floors, so they're going new Jersey and doing these events. Unfortunately, I can't stop them from having these events, but when they return, I could stop them from coming to school as a private school, I could say, let me see your guest list and we start calling literally calling these people saying you can't send your child to school for two weeks they have to zoom in now, I'm not punishing them. I'm saying out of out of the abundance of safety and caution. I do not want any of my teachers, God forbid, to get sick or any students to get sick or anyone to get sick, and that is the only way I know how to stop. It is by quarantining anyone that I know that's been at these events and by and large I have to say that the people have been pretty open with us too. They have shared their guest list with us, but now it's legwork for us I mean it's. You know. Instead of educating your child or your children, I have to now be on the phone for hours, telling them hey. Look. You are at this event. You can't come to school and now you're on remote. You know your child is doing remote learning and they were not doing so well to begin with, or they were not. We all had this. What we call the summer slide, we called the kobits slide. You know some of these kids have not been in real person learning since March, which we know that if you could look up any study the summer slide, the typical summer slide, most kids either plateau do not grow. I'm talking first. Second third grade: they do not. They do not grow over the summer, because it's not formal learning, so they have that what we call the summer slide, but the Covid-19 slide. These kids could not afford to be out of school for so long, and this is not school, I mean you know what we're doing here is not school. It's play school like it's, you know it's not the same thing, so it's really difficult, but yeah. That's what we're doing so. It's a hard! It's a it's a balancing act and it's really hard to tell parents that are paying. You know lots of money to send their kids to school and telling them sorry. You went to a wedding, and I understand it was your uncle's wedding or your cousin's wedding or your brother's wedding, but you can't come to school for two weeks, but we we've been doing a lot of that which is really troublesome and tough. We've had board members back us up, thankfully, but we've also had some board members. Have these super spreader events too? So it's kind of a difficult thing to balance and say to them. You know as a board member, I expect you to be a role model or a leader in our community, and that has not happened as much as we'd like to happen. Unfortunately, well you're definitely working a fine line and it's a it's a it's a very tough job, not to tell you what to do or make any suggestions. Although this is kind of a suggestion, you may want to think based on your parent body's approach to have programs on vaccines and how necessary they are and why people should take them when they do and also not it's not a substitute, definitely for what you're doing in terms of quarantining students who have been to these events or whose parents have been to these events. But New York state has a new contact tracing app. So so maybe that's worth looking into we're doing. Actually. First, a little self promotion. Cv8 is doing a program on that on November 9th. So you can get some information it could be. It could be useful for what you're doing, although again, we've done these programs and they say that it takes 14 days. That's why it's 14 days, because symptoms may not show up till day 11.. That's right, yeah right! So we've actually the DOH, because we had we had like a mini hot spot in our in one of our clusters. Doh have given us a direct link to the app the contact tracing app, we've, not forced, but we have almost mandated every parent to do it. I got I got ta say, and I got ta give props down to New York State contact tracers, I mean they've been at least the ones in Nassau county. I have a direct line to DOH. I mean I could pick up the phone and they will take my call at any time 24 hours a day and all I have to do is pick up the phone. In my I have a direct line to them and they've been tremendously helpful to us and have given us support to that. But, yes, we've mandated the contact tracing app to most of our parents to our parent body and we've used it to great extent, which is awesome. Thank you. I do not want to take up more of your precious time here, but I do really appreciate your honesty and the same for romney. It's always a pleasure to see you romney. Thank you. Thank you. Alita Sherry you I just did hi thank you, Peter and your and your committee for putting this meeting together. This is so important. Education is so very important to this community board. I participated in the budget meetings last week where we set our priorities, and education was right up there, where we advocated money for the construction of elementary middle and high schools. So so it's very important that we address this issue. One concern that I have several concerns, but what I wanted to mention was even with all this remote learning. There are so many children in our community that, even if they get computers from the school, that does not mean that they're going to have internet access. I mean your building has to be wired for it. So I'm going to throw on the table a suggestion that perhaps the schools should have centers where they have the kids come in with internet, where they can come and be socially distanced, but still have the ability to use computers and have the access, because even if you have a computer, you know if you do not have internet, it can't work. And then, as you were saying this physical about the pods in the in the suburbs, they've set up pods for kids to be able to interact, and perhaps that's something we should be fostering in our community where people can set up pods with a teacher and can work together, because I'm really concerned that we're going to lose this whole generation of kids. I mean not only the academic aspect of it, but also the social aspect. As you said, you know, without having all the after- school activities and that's kind of my question for Sofia and actually Jane because you're an educator too. Do you see, in addition to the loss of the year, and perhaps that an idea I know has been floated that we should require kids to take the year again, but this lack of interaction and growth? As you talk about, I had not heard the term the Covid-19 slide, but that's certainly a good one, and I would be curious, as he said, Jane and author, do you see that as a an issue as big as not having the academic? You know discipline that we're talking about curious as educators. What you think of that I'm very concerned about our other. This Covid-19 slide. We we tested all our for our kindergarten first, second and third graders already. Well, we did the whole school already, but we found to some canal test them, which is the standardized test to figure out their the children's reading abilities typical. Like I said in a typical year, you expect a little bit of a slide. You expect some of it, especially if there's kids that are and most these kids are not going to camp or doing outside events or do not have or kids. And when I worked in a city, you had kids that did not have access to books and their parents were working and they were in day care, centers or wherever it is and then have access to actual physical books. We saw slides, especially in the in the unfortunately, the poorer communities, and you saw that happening every summer and depends on the individual, but we're seeing we saw even in our own community and just because we're a wealthy community. They have the same the same issues that any community would have, but the Covid-19 slide. I'm calling at the Covid-19 slot is really big and I'm really concerned. I too shari I'm concerned about this lost generation of this Covid-19 sly generation that it's going to take us a couple years to catch these kids up to where we want them to be and what we need them to be and the more they slide the harder it is to get them caught up because we're just we're just running like on a hamster wheel. I feel like we're running on a hamster wheel, kind of thing just trying to keep up to what we need to do and then the more they they're quarantined and get kicked out of school or are hybrid right. So, let's talk about the New York's, the DOE hybrid situation, where kids only go to school twice a week in real life and then the other time they're at home, doing zoom, right and adding on to this point that and to your point, charity is this pod thing is that the way my school works is that the pods are six to eight kids, with a teacher and they're, not part of my school safety program and you're right. That is something very vital in your and, as you said, you're 100 right, if one, if that pod shuts down for my school, that's not a huge impact, because those kids can just do remote learning from home and it's not much of a pivot, but for his school, on the other hand, you're losing you're losing a hundred percent of in- person. Learning for those six to twenty- and that's part of the Kobe side, is the social interaction. So, if you have so part of learning is social learning so without he can speak more about this, but for younger students. 90, not 90, probably about 60 or 70 percent of learning, is social learning and learning how to be around other people. Of course, it's your abcs and your numbers and your math and all that yeah, but is it right, but I'm concerned learning how to communicate for yourself learning how to communicate to a teacher which is an adult and learning peer- to- peer communication and have you had the same experience? Well, can, frankly, I'm just more of an optimist. We've lived through depressions we've lived through the smallpox. We've lived through wars, I'm more of an optimist, so I can't really I'm not that pessimistic. I'm sorry! It's a different perspective! Okay, that's why I wanted to hear from you- and I also I'm not looking at Doomsday here. I I'm not a huge pessimist either, but I see the writing on the wall and I'm or no writing on the wall. How's that right, I'm on, I think you're underestimating the resiliency of both parents and children in our world out there Jane, I hope, you're right, I hope you're right. I guess time will tell right it's time will tell what happens with this. You know I think pre- covered times. We were losing a lot of our youth and I'm just going to say it again as a as a principal as an educator for 30 years. You know we lost a lot of our youth to the to the screens, which we know was impacting their socialization and I have two teenagers. My daughter is next door and Mommy's sister is a year younger than him and she's a sophomore in at lro, and I think we're losing our youth to the screen time and what we've done to them is just giving them way more screen time than they need to. I'm talking about is one of the top middle schools in the city. It gets its graduates into the top colleges. I you know, I'm sorry. I just can't I'm much more of an optimist. I'm afraid I'm going to have to sign off, but sherry I'd, love to continue this discussion. I thought the discussion might be focused more on the Upper East side, because that's where the community board is, but I'm and great nick is an extremely affluent, as we all know community, but I do appreciate the seagulls giving their time. Unfortunately Peter I'm going to have to run but sherry. I hope we can continue this discussion. Okay, thank you so much. Thank you. So after sherry, you have marco and then Elizabeth rose great marco. Ah, thank you Peter. I have two points. Should I drop? As should I come up with the two points, or I should I bring point by point. One is very specific and I need a help and the other one that's more technical, and I think I probably contribute in this discussion of the call. What do you think? Oh go? Well, go for both or you know, okay and then interrupted. You know go for one okay, so my first question is for the educators, Jen and just left, I'm very unhappy to hear that, but we have Mr civil. You have Peter. The question is, I think, Remy gave me the introduction that he said that many students have been dropping in grades, and that is true and I need really a lot of help. I just learned my daughter. My God daughter has problems in dropping the grades, so the question is what the especially the private schools she's in a private school in the upper side. What are they doing with respect to tutoring, especially the students that are failing, and I desperately I need because my God daughter is the mother- is sick in the hospital and the parent has to work two to two jobs in order to satisfy their income that they need? That's the and that's basically, the question. The first point: should I stop? Oh, I can continue on well, let's stop for a second see if we see if we thank you feedback on that. So I think Remy's father can answer me. I do not know if they're easy answers, but fear do you have any either. I do not know. I I'm not sure I have an answer for that. I mean look, that's you know. Jane was the optimist pessimist, I guess, but you know there is no easy answer. Romney said his friends are you know, and we know that that kids are not doing as well without formal education without in- person, education, we see that that's not a secret marco. I do not know how to answer that without knowing specifics, and I do not think there's the place for specifics about this specific issue. You know one of the things is I'm getting a lot of calls from parents who are in a very similar situation where they're like working parents, they have to go to work and their kid is at home and is not doing well on remote learning or hybrid learning. Or what have you and one of the one of the things I suggest is peer? Tutors get their friends to sit down with them in the evening. I know my like I said romney does not, and so we actually have a program in our school. I was never really involved with it, just because I never found the time, but a few of my friends are involved with the program and because we're very fortunate to have a high school and a middle school in that the middle school students really do look up to the high school students and we're we were seeing this pre- cove. It was. It was definitely always an interesting thing to see is collaboration, and the assistant principal at my school is very that is part of his t. Teaching slash administration philosophies that speak more about what you're talking about. So what I think he's saying is they have a peer, a peer sort of tutoring program, a peer- to- peer, so like I get partnered up with a sixth grader and I teach them math, and that is very valuable, especially in these. In these times it's I actually did attend a meeting back in March February when we first pivoted- and that was that was very a very different experience than seeing that in person, because it because I overzoom it's hard, it is awkward if you've ever been in a one- on-, one zoom conversation. It is very different than having a one- on-, one phone conversation or one- on-, one in person conversation, especially with things as sensitive as math, which is extraordinarily hard to teach on zoom, because it's very visual learning lots of symbols, lots of numbers that you have to see with your eyes and a lot of times, teachers need do not are not set up a with technology or the skill set to be able to teach that one last thing I would add, is things I recommend besides peer to peer and depends what age we're talking about, but for the some of the younger kids. I know this is against screen time, but there's been some really great. Khan Academy has really come up with it. First of all, it's free sal Khan, who start account Academy for his niece teaching math, has become a incredibly global company. That is free for all, explains to very minutiae detail on any subject. Now that you probably want to learn about Khan Academy is incredible. It does a great job. It is more screen time. It does not via videos but, like I said you could find any topic. What's really nice about Khan, Economy and the reason I promote it heavily for my student body from kindergarten. All the way up to eighth grade is you could watch it as many times as you want. No one needs to know, meaning that it's not embarrassing to keep pressing and I've done it replay and watch it over and over until you get it and if you do not like that, there's other one other YouTube videos that literally almost could teach you anything. You want to know, and you can watch it over and over now. Again, it's more screen time, it's more time on computers and if you have a good computer with Wi-, fi, then or internet access, I highly recommend those types of programs. Khan Academy is one of them. I excel the letter I x, l. The three letters is for Ixl ixl.com, it's a little bit older, it's a little bit older. No now they have now they have one through calculus. It's also pretty good. It costs a subscription fee, but it's not very expensive. I think it's under 10 a month, but they do a really nice job as well, explaining very basic details to kids that do not understand the and gets grades up and they they've been very successful at pivoting and doing remote learning as well, and I'm sure there's hundreds of other ones that I do not know about, but Khan Academy is the is the kind of the you know, the diamond or the standard industry. I guess piece that I like to use I'd like to offer just one comment, because I find it I find it more than intriguing. I mean I've long wondered whether there's a way for people I mean include myself, who could become tutors around material like that, and it strikes me. You know I do not know Khan Academy for sale, though I've heard of it that perhaps would also with a not just Khan Academy, but perhaps a you know, a tutor who's either another student or even an adult, or even you know somebody in retirement who's. You know, has a background to be able to master whatever the relevant material is to. You know help them navigate that, so I find that a sort of a possible. You know positive opportunity that I'd like to think about going forward. Marco, okay, the second part, that's, I think I feel more confident in the second part which basically I'm talking about the polymers on the On dividers Mr Siegel, you got ta, be very careful when you put dividers, because what it is you increase the problems of the means of eagles the longer. Do you make it the less? You are in compliance with the with the means of egress, and then you create other problems. You resolve the copy, but you create other problems and if the providers are not properly installed, marco, just as a background you're an architect right. Yes, I am so okay, just from everybody that does not know that information. So the issue is you got to be extremely careful, extremely wise. In that part, always you have to review Buddha, also professional, that understand what I'm talking about, and the second part is the ventilation in the ventilation. It's true that the yawns they are less susceptible to the cavity and the adults are marked susceptible to the virus. In that direction is basically a student best teachers and the t, I'm concerned with the teachers, the older they are, the more they're more susceptible for the virus and more probably going to die. So ventilation is the key or all of that because so far we have been seeing so many crowds outside with the cyborg cafes. Everything and no complaints are no increase on the on the transmission of the virus, so when you're going inside of the classroom, so you need the ventilation, but the ventilation is you can resolve easily if your school has a mechanical ventilation? The only thing you have to do is 100 fresh air, and then you resolve, but it's going to be the bill of the electricity huge, but it's like versus money. So, but if your school, like many public schools, does not have the central condition, that's create a problem. The problem is just only you provide, that's only heat inside of the room, and then you have to open the rooms, but how you're going to open how you ventilate that's the key or all of that, because in the way that I hear I'm not an expert in the virus, but I hear the virus when you speak, usually because the particles are a little bit heavier, they try to maintain on the lower level and then drop down within a couple of hours. That's what I hear so if that is the case, if you pull out for static pressure to the to the return up, then you create different mess or you open the windows to ventilate to the top, which basically, the issue is when you have inside warmer rooms, the heat go up and when you open the room because of the change of the static pressure between the inside to outside, it was going to ventilate to the top rather to the bottom. So it is a very tricky issue, a very serious and complex issue that you have to face since this old. What I said is invisible impossible to detect. So this is why many professionals are reluctant to step in that direction. So you have to. This is an paradigm right now, when you're exploring to have school inside of enclosed spaces. So that's I think I would like to mention this part and I'm very happy to comment anything about that, and thank you, oh well. The only thing I could I could add to this is that we did hire architects to install our barriers. We had our we part of our building. You're right is older, so we do not have a great ventilation system. We did buy MERV 13 filters for all our central air and heating exhaust. Whatever it is, I again I'm the principal of school: I'm not the maintenance director, I'm not the director of maintenance. There. I have a person who is the director of maintenance. I have board members that are also are not just architects, but are that deal with this with MERV 13 filters and other things I have? I listen. I only have so much bandwidth that I could deal with that as a principal I'm willing to do, because I'm no professional at any of that stuff- and I do not really do it. I do agree with giving the teachers as much PPE equipment as possible, whatever they need, whatever they want. We get them. We provide masks, we provide face shields, we provide gloves, we provide everything we can we actually we have a not. We do not have a large campus, but we have a big campus. We erected huge tents that cost us thousands and thousands of dollars. We put them outside our backyard and side yard. So anytime, we all our lunches are held outdoors, so we felt that anytime, like I said, kids that remove masks and are distanced. We have them outside. I encourage any classroom teacher that wants to take their kids outside to take their out to take them outside. We do not use any of our classrooms in the basement anymore, because some of the classrooms did not have big enough windows that we felt were that we're going to ventilate the room enough, so we close those classrooms off to kids. We do incur. We have very small groups that go in there. You know two or three kids at a time with, like our otp, that kind of stuff, our therapists that go in there speech therapists, but no large classes go down there. We had our art room down there, our computer room down there, our science labs down there everything's upstairs now in our no one, goes downstairs our library's closed. We shut the library down because again it was not a well-, ventilated area, so we did all those things that we felt we could kind of manage and support. That's all. I could speak to about that, marco, although that, other than that we did everything that we possibly could do with barriers. All our teacher desks are barriered up, including my own principles desk. We barriered that up as well with polycarbonate stuff, and we had architects come in and they installed it all. We did not do any of that. None of it was done in house all our MERV 13 filters were all done by experts that we've hired and that's why I said we're north of 800,000 of spending for Covid-19 compliant relief, so I'm going to move on just because of time, considering Elizabeth. Would you thank you Peter. Thank you. Thank you, Marco. Thank you. I Peter knew that I was not going to be able to join from the beginning of this meeting, and so I apologize if there. The questions, I ask are things that have already been covered: Mr siegel, if you are still there and taking advantage of your experience and your knowledge in your community, I think one of the things that is very challenging for all of us in New York City, is to understand the behavior of communities and groups who choose not to or who choose to continue to have large events who choose to not wear masks who choose to have these celebration events and attend celebration. Events that without the level of care and social distancing and mask wearing that, I think you know everybody on this community board thinks of, as you know, mandatory for good citizenship. Can you help us with the mindset of communities that do not? Because I think that's a that is a golf and a challenge for all of us. Yeah I mean it's it it's a you know. I can't tell you the mindset, because I do not. I agree with you, but you know I was standing on the voting line at wagner yesterday, for you know the 12 hours it took me to pre- vote or early vote whatever and they're. You know we were not socially distanced. We were not. Some people were not properly masked, they were, you know on. You know, chin. I see a lot below the nose these days right, a lot of blowing those or we you know chin diapers. We call them, but you know you see a lot of that kind of stuff, even in our own community. I do not know what the mindset is. I do not, I think, what they I think, people think- and this is this is my own opinion. I think what we're seeing is less people are dying, literally dying, as they were back in March and April in March and April. If you remember, we had a field hospital in central park. We had coolers ice coolers outside of Lenox Hill Hospital to keep our bodies cold enough, because people were dying, they would not decompose correct the military right. We had a boat pull up to Manhattan island because we could not control. We did not have enough hospital beds right, so that was back in March April may in June. It started. I do not want to say plateau because it did not plateau, there's still a spike, there's still spikes, but people are not dying as quickly or right. So I think the mindset is hey, you know and when I do not want to get, I know we're not supposed to get political on this thing, and I do not want to be political, but when you have a president that gets sick and comes out and says it's not a big deal, it's just like the it's just like the flu or look at me. You know no one. I know that is 74 years old that had Covid-19 that went to the hospital and was able to come out three days later after being on a ventilator and go look at me. You know it's not a big deal right. That does not happen in real life, so I think, and a lot of the my my community members in great neck and some community members here are who are non- believers of this or think this is a hoax or are thinking that this is not as bad as it really is. I think that's their mindset. I can't speak for everyone. I can only speak for what you're saying yeah all right. So, marco, I just want to address your question about your God daughter, very briefly, anything that you can do to get her to read a book that is probably the single most impactful thing that you can do. If you can agree that you will read the same book and have a phone conversation every day or every week the real, I think you know, there's reason to be optimistic as Jane is about the kids who are already on grade level, they're already engaged in their learning. They are all ready. They come from families where the focus on education is fairly strong and parents are engaging their kids in those kinds of conversations. I am deeply pessimistic about the families where the children do not have access to the Wi- fi. The parents are unable to engage with their children around learning and are unable to impart a just a love of reading. If you can get her to read, I will ha. I will be optimistic about her. That's great. Are you moving on? I really do appreciate your input Elizabeth. That was really. That was something we both should have said earlier earlier in the meeting earlier in the meeting read just read whatever it is read it remember. The old commercials reading is fundamental. Yeah commercials, we're going to we're going to be running, we're running a little short on time, so go ahead. Jacqueline, Swallow Jaclyn your question or comment hi. I actually work for the New York public library at the 67th street library. In this district and the library has tons of resources available for students. We have free homework, help free tutoring. The libraries are open throughout the city we have 50 locations open where you can place books on hold, come in and pick them up. We have virtual story times. We have virtual after school activities, check out nypl.org, there's so much on there and any students that are having trouble promote that site with them. It's going to help them. The library is still here to support all of the city, all the city residents, and especially the kids who are trying to learn in this unprecedented learning environment. We are here and we want to help so get in touch with your local library get in touch with your librarians, the children's librarians, the Ya librarians. They are all there and they are anxious to help you in any way they can in any format you need, except for in person, because we are still very virtual, but please get in touch with us. We are here for you to support you jacqueline. Thank you. Thank you so much for that. I really appreciate it and I'm going to want to underscore that at every session going forward. So thank you for that yeah. We, somebody from my library should be trying to attend these youth youth meetings from now on, so it'll be either myself or one of our other youth librarians, terrific Lisa. Can you unmute yourself? There we go all right. My name is Lisa hi, it's my first time attending one of these meetings. Thank you for all of your insight. It is my son is an eighth grader at Wagner middle school. He is hybrid. The principal there has done a fabulous job with the 1500 students that she has to manage to have actual learning. They are pretty short staffed. So there is not a lot of synchronous learning. It is disappointing he's in two regions classes- and I do not know, what's going to happen, if he's going to be capable of taking the regions with the limited learning, but just some reference from Marco. He has a group of friends that they meet during the periods where there's no work and they review concepts with each other, so they teach each other concepts in the algebra that they're learning to help each other through this. So I just wanted to give that reference, and I thought that was really great. He started that group with his friends back in the spring when the remote learning was a mess, but now it's much more organized. But the reason why I joined was, I wrote to Isabelle, because I did have a concern at in galbrewer's office because, as you all know, the lines at wagner middle school have been outrageous for early voting. I mean people, hundreds and hundreds of people during the school day are standing and entering that school. I did not understand what it meant when the principal had and the PTA had reached out to us to try to stop early voting at middle School. I did not know what it meant until I went to walk my dog at 7:30 in the morning before my son had to be there and there were literally hundreds of adults as Rami mentioned Mommy's dad mentioned no social, distancing, no masks and the children had to walk through those lines to get to school and the staff was out on the street trying to help students get into school and the reason why I'm attending this meeting is to ask: how do we in the time where not only is there a global pandemic, but we have to worry about the safety of our children. How do we address this because early voting does not need to be at Wagner Middle School, Park, Avenue armory is completely empty Lisa. I can actually speak on this so from both a student perspective and a political perspective. So for one, so my school is in union square and it's a brand new building, five years old. I think this is year. Five and it is ADA accessible, so wagner. Middle school is one of the few schools in New York Manhattan that is ADA accessible, and I did extensive research on this for my school, when my student government was brought with concerns the same concerns you were having in 2019 when early voting first started, the numbers from early voting 2019 were 8,000 on day one across all five boroughs. On last Saturday day, one of early voting there was over almost a hundred thousand people voted across all five boroughs. That is, I do not know the math of the that's like 12 times the record from the first time. It's happened so that so what so? That part of why wagner is selected as a site is because it's Americans with disabilities act. Accessible now wagner is one of six schools in Manhattan that is ADA accessible. My school was not selected as an early voting site for this year because they diverted them to another location in battery park. So if you live on 15th street, you are voting in battery park this year, which is outrageous but so wagner is also very special, because it is the number one point number one: most voters assigned to wagner middle school in all of New York City, so 108,000 people are assigned to vote at Wagner middle school for early voting and election day. That is over 40,000 more than the next ranking, one, which I do not even know where. That is even more of a reason why it's unsafe to have a hundred and eighteen thousand people screaming through school during the school day like I do not know who's entering this school. I actually, I have no idea. I do not I the for not only for my child's safety but the safety of the staff like 118,000 people, so our principal requested that we go remote because on election day it's deemed that it's dangerous to be in school, and so they have told the kids that they are remote that day, but this entire week our children have to be in school or they would be marked absent, and I called up school and said I will absolutely not allow my child to be in school when there are hundreds and hundreds of people entering school that day. So what I'm asking is I understand that it's ADA, but that's not my problem right. That's right! That's not my problem. That's not miss that the teacher the principal that school spent her entire summer working on social distancing cohorts as your dad did for 1500 kids and her staff and she's 38 people short on her staff because of their accommodations and if one of those people get sick, my child will not have teachers right because the teachers will be sick and there will be no one to teach so now I know early voting is going to end this week and there's nothing. We can do about it for this week, but early voting has to stop in the schools. I can provide more. I actually can provide a little bit of. I guess a solution to you so just today, just like probably six hours ago, at this point board of elections, the Commissioner Board of elections said that they're diverting they're voting they're voting next week, but it's pretty much confirmed that they're diverting a percentage. They have not specified what percentage yet of people from wagner middle School to Mary, Mount, Manhattan college and Mary Mount Manhattan college amazing friend of the Community Board as Peter knows, and as Elita knows. I do not know if she's still on and, as will knows, amazing friends of the Community Board correct, and so they have been, they have generously opened their doors to early voting. Now is that going to solve the problem? Absolutely not and there's serious. There were serious safety concerns. Last year when I was in school, and I saw random people walking through the hallways, using the bathrooms just using the bathrooms. How dangerous is that right? So then, this is Elizabeth, I'm going to jump in here, because in my former role as the Department of Education, the work with the board of elections fell under my portfolio. So I actually know a fair amount about this. The issue this year is that the early voting sites were decided, pre-, coveted and so by the time, and I actually do believe that the chancellor did attempt to get early voting sites redirected as a result of Covid-19. He was unsuccessful because the effectively the DOE had approved early voting sites with the board of elections sometime in the first half of the year, and I do not know exactly when it was whether it was entirely pre- covered or if Covid-19 had started, but everybody sort of assumed. We would be back to some sort of a greater sense of normalcy. The real issue is going forward now, for the future is putting pressure on the Department of Education and the board of elections to not allow schools to be used for early voting. That is going to be the issue, and I am sure that there are excess other accessible sites throughout the city where accommodations can be made, but that what really happened was it's just that the sites had been selected and the board of elections in there infinite capacities were not able to pivot yeah. I appreciate that it was pretty close, but in the light of gun violence happening in our schools all across the country. How does the city think it's appropriate for children to be sitting in school with strangers and staff walking in, like you got to see the principal on the street of Wagner on Monday morning, trying to separate the crowds to make a pathway through the hundreds of people for children to enter the future, so the criterion for early vote for voting locations and election day schools are officially closed and many schools are used as voting locations and it's frankly because it is one of the few groups of buildings with large quantity in every neighborhood that the city controls, and so that is why the city chooses to use schools as polling sites. So all schools are closed on election day. It's not a question of going remote or not going remote. On that day, schools are closed on election day right, we're fully remote. That day no school is closed. They're they're, not true, that's not true. We are. My school is open on election day. Yes, we're fully remote our clients, okay, so that is very new yeah. That is the first this year because of code. Yes, in all prior years, schools are simply closed on election day and the reason that they are closed is so that we can use so that the city can use the buildings as polling sites for early voting. They were supposed to choose sites where there is direct entrance to the voting room from the outside. So, for example, you know my regular polling location is Ps 183. The entrance is into the gymnasium, which is not does not allow any access into the actual school building and so early polling sites. They should have chosen locations where people enter directly into the polling room and do not have to go through hallways and do not have to access through other parts of the building they may or may not have done that. Well, no, that that's true for wagner. They go they're supposed to be going in through the yard, except that you have lines double lines twice around the block covering every entrance, but nonetheless, even if they're accessing a certain part of the school. Why are we allowing people who we do not even take I d from to enter the school and I'm all for early voting? I wish that I would be able to stand on the five- hour line to vote not be afraid of the crowds, but I just do not understand why we would allow this in our schools, when the board of Ed has closed schools traditionally on election day, because they do not they want. They want the access of all the people to enter, and then why would the principal be told she can't go remote for the entire week of early voting to make sure the staff and children were safe when the board of Ed is making her go remote on election day like? Why is it an inconsistent thing? That's my question just seems inconsistent logic. It seems unsafe in a time of gun violence in our country, where any Joe can walk in with any kind of no question. You are correct and it is incredibly inconsistent that it. That is an incredible inconsistency, and so what can we do like? How do I raise this? I wrote to the governor. I wrote to the I wrote a letter: the only person who responded was Gail Brewer's office and that's how I ended up on this call. I actually spoke about me. No, I think you as a parent- and this is coming from my former life at the DOE. You as a parent, should make the choices, what is responsible to do for your child and if they count that as an absence, you should write a letter and make sure it is in the student's file and the reality is at this point. Attendance is not going to be used for high school admissions. I can. I do not know what announcements they are making or have made about high school admissions, but I can not imagine under the circumstances that they're going to allow any high school to use attendance this year in a high school admission process yeah, so that that's your own, that is your only risk of being marked absent for a day yeah. No, it's not that it's just it's really just going forward like wagner does not want to be on an early polling site. She has 1500 kids in that school day when and when it goes back and when it goes back to being no Covid-19 God hold willing soon that you know when we have the democratic primary elections and early voting for the mayor, our kids are going to be in the middle of that too, and I do not know how contested those are start, putting pressure on the DOE in the board of elections now, so that you would not be an early voting site in the primary yeah. Let me let me make a couple of comments. First of all, you write to the chancellor. You do a massive group effort to the chancellor directly. No, nobody else is going to is important enough to have an impact. You do it to the chancellor. You copy gail Brewer, you copy the mayor's office. Okay and I was I was going to add the comment. Listen, I both get the frustration which is appropriate. You know bordering. I do not think I want to use the word anger, but anger would be understandable because of the risk that you're pointing to. I will say this: the best ally that I've experienced in anything that I've done in the city is Gail Brewer, because she will go right to the responsible party and actually, just today, I saw a letter from a student. I believe it was a student at Wagner. I think in eighth grade exactly on this point. It was an extremely articulate letter that came had been presented to gail, Brewer and I'm sure presented the DOE so a I will make this point in terms of our follow- up requests. You know of isabel and Gail Brewer I'd be happy if you care to forward a letter to either the Cba Board or to me personally, my name is Peter Patch by peterpatch Aol.Com, and I will both forward that and do my best to follow up with isabel and gail Brewer to press that point. Thank you. I appreciate very much for you. Hearing me out and I know wagner middle school will as well. I appreciate that and thank you for representing our interests on the Upper East side. Thank you for speaking up. We can't do it without people like you taking action and taking a stand. I think we're just about complete we're a little bit after I plan to complete by eight o'clock. If there's a burning share, I would I would entertain it otherwise. I really wanted to thank rami and afir both of you for essentially being our host and our panel of this session, because I think we've been able to at least surface some things and I'm going to resist saying I see light in the tunnel, but I do I do see some positive possibilities out of this conversation and that's certainly part of what I'm looking for, and I want to thank people like you lisa who are willing to stand up and express your concern. Intense concern, I'm trying to you know, modify my language, but it's totally justified, and I think this is what the community board should be here. For so I want to do what I can to support your totally appropriate request and I'll. Thank you. All for participating have a good night, be well and feel free to email me or communicate with the community board. Any issues that you want followed up and I will do everything I can to follow up with Israel and Gail Brewer, who, I think is one of our great public servants.",
            "summary": "I'd like to think about what we can do as a community and community board to be supportive of our parents, you know, and students, and also our faculty and our administrators, because everyone's trying to navigate this situation, which is obviously you know new to all of us.\nActually a couple days, ago, and Some highlights that were recorded just to give a little bit of a snapshot at the extent that that's useful, which is that 48 of the students are now doing blended learning the rest are doing just remote.\nIt is a defined period of time in which you know, parents and students can make that transitional choice to blended learning, because the system needs to adapt to the different numbers of people who are adopting each approach to participating in our schools.\nSo they're, still working on trying to you know, bring that site up to a strong and functional level , they're, still working on ensuring that all rooms meet ventilation standards they do have and have put in place a third day supply of PPE and cleaning supplies at at all.\nThere's, also an issue in terms of as more parents Opt for blended learning, that there may well be a need for more teachers and the Department of Education is working ongoingly to try to make available enough teachers to address that issue, and the last point I'm just going to mention is given that the scheduling issues for children's there's a question of how students will get food They simply require a request that there be a report on anyone, not getting food.\nOn, I almost do not even know how to say this, but I do want to be sympathetic to the challenges that everyone's facing students, in particular teachers, in particular families and parents in particular, and administrative staff.\nIt's in Union, Square district, two public high school If anyone remembers what I spoke about last time, just as a follow-up to that, not much has really changed in the past month or so pretty much the past three months since back to school started, it is almost November, and so it's in theory that getting used to coming back to a remote school has passed.\nWe're seeing at my school not much of a policy shift from where we were at last year with a with an emergency pivot to remote learning and so, and so that has a few effects.\nAre you struggling in the class too, and that is something I'm seeing across the board, And I I'm involved with student government with my school We're also seeing that through student government is, is just a lack of outlets for students to vent or to to just state what is going on with classes , what issues they're having Those, who do not have access to Wi-fi, those whose DOE computer is not working very well.\nThose who are struggling with in-person school the hybrid approach and who are having problems with just sitting in class for sit in a classroom with a do with the door locked for six hours a day.\nWill there's a short-term effect, which is that schools have to restructure their entire hybrid setup surrounding the number of kids that and that who initially signed up for remote and are now signing up for in-person and that's going to happen sometime around November Then there's also another effect of what is going to happen three months from that deadline from when that form is due and students who stuff comes up at home and their parents.\nWhat is going to happen for those kids who need to go to in-person school in three months, but do not have the option to do that, and Definitely a lot of aspects surrounding both hybrid approaches and a remote approach that have caused issues that are a being overlooked by Central Dle, because part of it is it's not their job to manage that.\nBut, then the other part of it is what can a school do from a school perspective or what can me, as a student, do or me as a person who is in student government, do to help those who are not being vocal or not being advocated for so , there's a material difference or how you might characterize or try to characterize the difference between what you're experiencing as a fully remote student and what the hybrid students are experiencing, which I think is leveraging the same technology, but I'm, not sure so.\nHow are we going to keep students safe in the building so and the deal we put out three or four cookie cutter programs that a lot of schools adopted?\nThey kept the schedule of the DOE release, so there's different cohorts or pods or whatever you want to call it in my school They have a two week cycle in that they go in probably twice every two weeks and when they do go in it, 's pretty much remote learning from school.\nSome are some are live but or virtual within a physical classroom that you're trying to manage and again where I, where I'm coming from, and the tone I'd like us to continue to adopt, is appreciation for all the challenges that both the parents and students, as well as the teachers and administrators are navigating in this.\nWould you like to give us a perspective of somebody trying to you know oversee the operation at a particular school Thanks for having me, I am a cba resident, but I work out in long island, great neck, I'm, actually a principal of a private school there, so we're running it a bit different than than DOE We do not actually have to follow all the New York state regs as much as a DOE school might have to.\nWe, have our own committee of Health, which we hired two medical doctors and a couple parents to help us navigate through some of the new policies that almost come out every day, That the different policies for different schools and they're all they're cookie cutters, but we are able to make it our own when we have to.\nSecond graders or youngest kids would have the most trouble with wearing masks and being in this sort of cubicle, but it turns out that our middle school kids are probably the most effective affected out of all our students.\nThey, can't sort of be close to each other, where middle school students typically learn the taboos of life through social interactions.\nThey set up five machines in our school to be able to test not just our own students, but anyone in the community that wants to come in and test a rapid test.\nOne problem with the rapid test is that the only way you could get tested is, if you're symptomatic at the point at that time, which is good and bad because now we're inviting we do not allow parents in our building whatsoever, but now we're inviting the public to come to our school and get tested.\nNow, our tuition assistance works very different, because parents who apply to our school in November we actually just opened up November 1st-is our application, the start of our application.\nWe shut down 24 hours and in 24 hours, I had to school back up remote learning fully for all 800 students, including our pre-k through eighth grade, and that was a huge Come to us and say: well.\nWhen you get knocked down to get back, up, and I mean that absolutely literally and the other was I was assistant, editor of my school newspaper and the best part of that and the most memorable Then we'll worry about the rest of the story, which only to me underscores how important the out of classroom and extracurriculars are and that one of the things I'd like us to think about ongoingly as a community is what we can do to support our schools, and maybe it will be in some fashion, supporting you, know, out of classroom extracurriculars now, next speaking, elita thanks Peter thanks will hi.\nIf you're letting people into the school and at the same time you're a testing facility, it seems and knowing what's going on in Europe, it just seems like a recipe for a shutdown with a lot of people being sick, and I assume that people have grandparents.\nPeople have parents, people have other others and from what I read in the times that it's even small events like small reunions, not even reunions, play days that schools, open and people feel that okay.\nWe actually literally call them up the next morning and say we need to see the guest list, because you know, if there's any, of our parents that are on that guest list and their children are on that, went to the event we automatically put them on quarantine for two weeks, whether they're, positive or not, whether they've been tested or not.\nSo I'm, going to throw on the table a suggestion that perhaps the schools should have centers where they have the kids come in with internet, where they can come and be socially distanced, but still have the ability to use computers and have the access, because even if you have a computer, you know if you do not have internet, it can't work.\nI'm concerned about this lost generation of this Covid-19 sly generation that it's going to take us a couple years to catch these kids up to where we want them to be and what we need them to be And, then the more they they're quarantined and get kicked out of school or are hybrid right.\nLet's talk about the New York's, the DOE hybrid situation, where kids only go to school twice a week in real life and then the other time they're at home, doing zoom, right and adding on to this point that and to your point, charity is this pod thing is that the way my school works is that the pods are six to eight kids, with a teacher and they're, not part of my school safety program.\nIf one, if that pod shuts down for my school, that's not a huge impact, because those kids can just do remote learning from home It's not much of a pivot, but for his school, on the other hand, you're losing you're losing a hundred percent of in-person.\nYou can agree that you will read the same book and have a phone conversation every day or every week the real, I think you know They come from families, where the focus on education is fairly strong and parents are engaging their kids in those kinds of conversations.\nI did not know what it meant until I went to walk my dog at 7:30 in the morning before my son had to be there There were literally hundreds of adults as Rami mentioned Mommy's dad mentioned no social, distancing, No masks and the children had to walk through those lines to get to school and the staff was out on the street trying to help students get into school and How. Do we in the time where not only is there a global pandemic, but we have to worry about the safety of our children.\nDo we address this because early voting does not need to be at Wagner Middle School , I can actually speak on this, so from both a student perspective and a political perspective.\nThis year, which is outrageous but so wagner, is also very special, because it is the number one point number one, most voters assigned to wagner middle school in all of New York City, so 108,000 people are assigned to vote at Wagner middle school for early voting and election day.\nHe was unsuccessful because the effectively the DOE had approved early voting sites with the board of elections sometime in the first half of the year, and I do not know exactly when it was whether it was entirely pre-covered or if Covid-19 had started.\nThat is going to be the issue, and I am sure that there are excess, other accessible sites throughout the city where accommodations can be made, but that what really happened was it's just that the sites had been selected and the board of elections in there infinite capacities were not able to pivot I appreciate that it was pretty close, but in the light of gun violence happening in our schools all across the country.\nDoes the city think it's appropriate for children to be sitting in school with strangers and staff walking in , like you got to see the principal on the street of Wagner on Monday morning, trying to separate the crowds to make a pathway through the hundreds of people for children to enter the future?\nSchools are simply closed on election day and the reason that they are closed is so that we can use so that the city can use the buildings as polling sites for early voting.\nAre we allowing people who we do not even take I d from to enter the school And I'm all for early voting?\nThey want the access of all the people to enter, and then why would the principal be told she can't go remote for the entire week of early voting to make sure the staff and children were safe when the board of Ed is making her go remote on election day, like?\nShe has 1500 kids in that school day when and when it goes back and when it goes back to being No Covid-19 God hold willing soon that you know when we have the democratic primary elections and early voting for the mayor.\nOur kids are going to be in the middle of that too, and I do not know how contested those are start, putting pressure on the DOE in the board of elections now, so that you would not be an early voting site in the primary First of all."
        }
    }
}