{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCEAZeUIeJs0IjQiqTCdVSIg",
            "title": "HHS Committee",
            "publishDate": "2020-10-28",
            "shortDescription": "",
            "lengthSeconds": "2:28:31"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "BnSv2rB3sew",
            "fillerWordCount": {
                "uh": 208,
                "um": 530
            },
            "readTimeFullTranscript": "89 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "food": 220,
                "meals": 43,
                "policy": 36,
                "program": 33,
                "seniors": 32,
                "information": 26,
                "programs": 25,
                "hunger": 22,
                "pantry": 21,
                "chat": 20
            },
            "wordCountSummary": {
                "food": 61,
                "data": 9,
                "pantry": 8,
                "meals": 7,
                "programs": 6,
                "policy": 6,
                "insecurity": 5,
                "research": 5,
                "experience": 5,
                "access": 5
            },
            "fullTranscript": "Hi Louisa hi thanks for sending me the link, great okay, there are five and a half of us, or, I should say four and a half and one bridge it should be the George Washington. Hmm. I think there were four given backgrounds: hi Robert. You know that you do not have to create yourself right. Well, I did not ask for this background. It just hey Robert. At the very least, the Brooklyn bridge. There you go. Is it still saleable? I sold it a few days ago, uh- huh I'll, take a second mortgage. What we call a mezzanine mortgage where I'll sell you a portion of what the lower level and hi Susan in commercial real estate. We call that a messaging mortgage so that so the overall item is so still. You can still make a buy into it as we say, but do not be deterred by rumors here that it's not for sale. It's on the market, so shelly I'm going to start the live stream and the webinar, so the panelists and the attendees can come in sure. That's great charles! You can hear us right, good response. Okay, Susan! You can hear us, excuse me: you're, muted, yourself, shake your head hi! Yes, thank you loud and clear. Thank you for telling me. I was unmuted okay hi good evening everybody good evening, good, to see you good to see you, susan who's. Coming from the World Economic forum, that's Elizabeth, Caputo! Okay, sorry guys! It's my work, I'm still at work, and I will change the profile picture before you start at seven. But I'm happy to see everyone hi, Doug, hello there, how you doing good evening good evening, hi everybody! Okay! Is that Stephanie. I glad you're with us. Okay, people coming in one at a time that means by nine o'clock. We should have a full house. Ah catherine, okay, can it shelly? Can you see me hear me I can see you hear you can every if you can see or hear if you can hear catherine say here: okay, so is everybody on the committee here, not all the committees, some of the committee Robert's here hi Robert Courtney's, here audrey was here yeah, I'm here. Okay, all right! I look like the Brooklyn bridge, but it's really the golden gate. Oh, is that what it is okay makes sense, Rosa good evening, you can not. You can unmute, you know, okay, what time is it a little after seven, okay, so shelly I'd like to kick it off just for a quick second, then I'll hand, the wall to you. If that's okay, of course, I'm going to I'll start after you speak mark with just explaining the agenda and then also introducing the speakers. That's perfect. Thank you. I just wanted to address the folks who are joining us from the community to thank you for joining us and to make sure that you know catherine will explain the agenda for tonight, but I think that there is there was a potential misapprehension about what would and would not be discussed at the meeting tonight. There is I've received a lot of messages from a lot of folks and thank you for commenting on the the budget priorities that were proposed at steering last week. The budget priorities are not on the agenda tonight, except perhaps for a quick update among committee members. The next time that we will hear comment on the budget priorities will be at a pre- meeting to the full board meeting next week on Wednesday and then the full board meeting itself, and we will have public comment before we take our vote on whether to adopt the budget, the budget priorities as preferred or as referred to the full board by the by the steering committee. That's not tonight. That's next Wednesday will be almost an hour of that in the pre- meeting and then also which is the budget hearing and then during the full board. We may not get to everybody because there's an awful lot of people signed up, but we'll get to as many as we possibly can we'll do it the best way we can and we'll do it before we vote. So I just wanted to make sure that, if anybody's here for that purpose, that you're not going to hang around without and then be then be disappointed. That discussion did not happen. So with that, I'm going to hand the ball back to the chairs of the committee Catherine and Shelley. I guess it's Katherine who takes it from here. Oh I'm, sorry, one other thing, and that is we've been having some issues with our chat. We will do our best to monitor it, but please approach the chat, the same way that you would approach speaking to any of us and to each other, which is whether you're talking to each other or to folks on the committee. Let's approach this as neighbors with mutual respect and mutual desire for the best possible result, and I want to say that at the top, so I'm not appearing to single anybody out. It is a general proposition that I hope we can all live with and live up to. Thank you very much I'll shut up now by the way Matt has joined us since she did a yeoman's job of focusing on food insecurity for our research, for our district needs statement and before catherine, because I want to say, she's done an amazing job, pulling it all together and working with everybody all along and bringing this together tonight on our number one priority. Yes, thank you to madge for the research you did that went into our district needs statement and budget priorities this being at the top of the list, so we're very excited to have experts with us tonight to educate us about challenges to do with food insecurity and ways to provide greater access for everyone to healthy food during this time. The way that the that it's going to work tonight is that each of the people that were are visiting with us and I'll introduce them in a little bit is going to speak for about 10 minutes, and there are, there are five will hold questions and comments until after everybody speaks then after everyone speaks I'll call on each member of our committee to ask follow- up questions. The goal is for us to kind of identify where we can assist or support their efforts in reducing food insecurity, and then we'll hear questions from the community. We're excited to have people with us tonight and I just want to say that, because I am speaking from my telephone, I can't see people's faces, except for those who are speaking so I'll call on each speaker in order and then and then I'll call the community board members, but I just wanted to let everybody know that I do not have complete visibility before I introduce the speakers. Shelley. Is there anything else that you want to add? I want to say that this became our the number one priority for our committee and the Community Board Steering Committee, and my own short experience with this over the past. Several months has been eye- opening just quickly. We put together a grab and go with the help of elected officials and others at 95Th street Ps75, and they doubted there would be a need within the first five weeks there were 30,000 meals distributed, but the reason there were so many were because people could not get to the meals. So we had the delivery team and other people came and got them. It was so astounding that the Chancellor Catherine Garcia, who was running food services, the former apartment, sanitation, commissioner and borough president Gail Brewer, came to the site to see what was happening. So the anticipation of what and the prediction of how little was needed was blown out of the water in people's minds. Once people had access, they not only needed the food because of unemployment because of inability to get out to get it because of economic circumstances. That could not be predicted for all types because they were parents who could not go out and feed the children. Three meals a day do their work at home and have their kids working from home. So the Covid-19 and Endemic has brought to light not only the current situations but the greater issues that many were not aware of. So I think this it came home to me that the problem was much greater than I had thought over the years and not just because it's this time, but because okay, so thank you Shelley. So I'm going to introduce our first speaker and let me also say that if I, if I mispronounce anyone's name, please correct me, because I would really like to get it right. So our first speaker from West Side campaign against hunger is Stephanie Sears, Mosher hi. Everyone. Thank you so much for having me this evening. So I'll just speak very briefly about West side campaign against hunger. Our organization has been around for over 40 years on the upper West side, we're in the basement of the Saint Paul and St Andrew Church on the corner of West, 86Th and Broadway, and that has been our historical home for the last 40 years and within that space we've served thousands of households of new yorkers from all five boroughs and in that space was developed, our supermarket style customer choice model for of what a food pantry looks like. So you know when you first think of a food pantry. It's a bag of pre- packed canned goods, not much nutrition in there, and but you know that's how it started, because that's what you know it was formed by a church community. We saw Anita in the community, but what they then started seeing was folks trading items out on the sidewalk, so I actually do not like tuna, but I love peanut butter and in seeing that exchange, recognize that how can we bring more dignity to the experience of accessing a food pantry and incorporate choice in that in the experience? And so can you hear me hear me it's fading in and out I'll do my best technology. So it's better perfect. So that's the model that westside campaign against hunger created and that has now turned into the to the gold standard of what a food pantry should look like across the United States and that's what we've been doing for the last 40 years and then Covid-19 hit and we flipped our remodel completely on its head. So I will say in our previous fiscal year we served about 11,000 households out of our two programs, so we have our 86th street market and then we also developed a mobile market, which I see Susan on the call so good to see you. We do partner with Lincoln Square Neighborhood center, an amazing organization and our the mobile market was designed to bring the experience of 86th street and that supermarket style on the road. We have a beautiful truck thanks to participatory budgeting funds through the council, Members Office through Helen Rosenthal. Thank you so much, and that truck goes around through northern Manhattan and the Bronx to bring food to people. However, again because of Covid-19, that truck is serving a different purpose now, but in that previous year we served about 11,000 households through those two programs, and our priority has always been healthy, nutritious food, but we always have fresh fruits and vegetables. We always have items that are you know, lean proteins, whole fresh dairy things that are that our customers really want and need to feed their families, and so now, in during this pandemic, everything is happening on a street level. We're outside on the street. You'll see us if you come by, we've got quite a setup and everything is now pre- packed. But what we have not lost is our commitment to healthy food and fresh produce. So in the last fiscal year which started July 1st 2019 through June 2020, we actually doubled our reach through our two programs and served about 21,000 households. We gave out 2.1 million pounds of food and over a million pounds of that was just fresh fruits and vegetables. So what we are really proud of is showing up during one of the most challenging times in all of our in of all new Yorkers lives and making sure that they had access to healthy, fresh food for to feed their families and we're seeing you know that pace has not stopped. That's going to continue. You know we are anticipating a very busy winter. The holidays are coming up, so we are going to be having our annual turkey challenge where our goal for this year is to give out 5,000, turkeys and holiday meals to new Yorkers in need- and there's thank you mark there's a flyer here. If you are interested in participating or getting involved, these are some ways that you can do so and we do have a coalit community coalition for anyone interested in participating and contributing to this endeavor. There's at the very bottom of the flyer, if you're interested in getting involved, you can contact our communications and development manager. Kyra Garfinkel at that address, so yeah we're just really proud to be a part of the upper West side and serving new yorkers in need during one of the most challenging times. Thank you. Next, I'm going to introduce Susan Matloff nieves from goddard, Riverside, okay! Thank you very much good evening. Everyone and thank you for the shout out. Stephanie. We love Labriska food pantry. It's really! It's really an exciting day and people love actually to socialize with each other as they're picking up their vegetables. As many of you are aware, the the upper West side is not the most affordable neighborhood in the in the city and for the 11 of our community members who are living on fixed incomes or at the poverty line. It's particularly hard to be in a position of finding affordable food when staples cost more than they are their supports, may allow so, for instance, if you're on food stamps, you get the food same food stamp allotment if you're living on West 95th street, as if you're living in say the south Bronx, where food may be scaled to a lower income population. So we constantly deal with hardship in the populations that we work with, and I should back up a little bit by saying I work with goddard Riverside community center and we run 27 programs in Manhattan, mostly on the upper West side in West Harlem, and we work with some of the most vulnerable populations in the neighborhood, including elderly people, young children, teenagers, homeless, people living with mental illness and people who are working to prefer. You know who are living in affordable homes, so we really found with kovet that what is usually a hardship situation for our population suddenly became a crisis. Goddard itself serves somewhere between two and three thousand meals a day in our congregate sites. But when things shut down, people were shut off from the food that we provide through our through our stake of centers, our senior centers, our after- school programs, and there were sudden with the cleaning out of the shelves in many stores, the removal of affordable items. People in some cases had their food stamps cut off and there was no office open to try to get their cases reopened. We were our phones were just flooded by calls from people who were saying. I have no food in my house, many seniors who were afraid to go out. Families who said I'm down to my last can of pears, and I've got four kids home. So we were, we were running food all over the neighborhood trying to just get out emergency supplies to people. Things have settled into a system after quite a few glitches, and I know there are people on the school who have been part of helping us resolve some of these challenges. But there is, you know actually noted there continues to be a tremendous need for food. The unemployment rate is very high. We've been running a direct relief program at goddard, where we can give out some emergency grants and one of the biggest requests that we get is for food assistance that people, particularly people who are abruptly unemployed, who do not yet have their benefits, so they've lost their salary, but they have not yet accessed unemployment. Benefits have been in a crisis situation and also people who are undocumented, who are not eligible for any kind of public benefits who are hardworking people and now, with the ending of their employment, they can't access food stamps or other kind of benefits. So we've been trying to fill that gap both with food and also with direct relief assistance. We find that I'm just looking at my notes. Fresh produce is a particularly hard thing to come by. You know, because, while we have many options, they're not always affordable, we love our markets, the green markets, but they're not always priced well for people in the neighborhood on fixed incomes. We do find the food the food, the fruit carts are often utilized by people who are of limited means. Certainly we refer everybody. We know to wisca and some of the other items are. You know, people shop, sales, there's a lot, a big word of mouth network that will say bananas are on sale at western beef go on over there. We have found that something that has become a food supply issue is that some stores are no longer delivering because of the robberies by of delivery people- and I know that they had a demonstration- the delivery people had a demonstration at the precinct not long ago, but just as an example in Amsterdam houses, which is a public housing development at the kind of southern end of the Community Board western beef no longer does deliveries, and so for some of our older adults who can't drag a heavy cart back from the store or families who are that are you know that may have a large household. They have to make many small trips or just do without heavier items. So that's been kind of a side issue and you know we know that there are people who are who are stealing because they're some people are stealing just because they're mean people and some people are stealing because they're really desperate to eat the. I think one of your questions was about how people access snap. We try to publicize that widely through our work and our centers, almost everything that we do, we advertise where you can go for benefits. I know that wisca does as part of the pantry. They also offer sign up while they're there. The hospitals have been providing information to people coming into the emergency room, so we try to do a lot of outreach around its availability. I think the issue with all public benefits has been trying to access in a pandemic when even public servants are working remotely has made things a little bit more difficult and even in if a case is cut off, it's just harder to get benefits because of the the fact that everything is being done virtually and not everybody has internet access to be able to to do that, and many of the places people would normally go for in person. Help are not functioning in person. The the question about the role of the community board: it's really great, every you're as a place to send people for information. We'll often say if you do not know where to go check out the community board, you guys are really good at communicating your email blast. The information on the website is really helpful, so any information dissemination- and I know you're always actively seeking it- is really helpful. Also about special events. I know at one point: for instance: Lincoln's center did a couple of food distribution days, and I know Mark sent the information around to contacts and that's really the role of getting the word out to people is really helpful and you never know where the word is going to land when you send it out. I think that also the role in fostering collaboration, sometimes you know many people in the school have said to us. You should go talk to someone, so they do really good work. So things like the collaboration that Stephanie mentioned with Wisco, is a really it's another role the community board can play is to make those marriages and those matches, as you encounter people who do good work, and I think the third thing is that we really have been relying very heavily on helping hands and donations and I think again the role of the community Board in putting out the word and soliciting community help so that people can support each other. I think those things have been really helpful and useful as well, and I'm sure I could think of a million other things, but that's what's sort of on the top of my mind as and you know, I'm open to any questions when we get to that part of the agenda. But thank you. Thank you so much Susan that was all very helpful and valuable information. Both you and Stephanie. So I'm going to hand it over to the reverend K carbon from Saint Paul and Saint Andrew United Methodist Church, okay with us. I do not know that K is with us, yet he said he might be. He might be a little late, yeah, no problem, okay, so I am going to hand it over to Charles Platkin from Hunter College New, York, City, Food, Policy center hello and where's Pam hi Pam Pam and I are working on a research project which I'll mention hopefully she'll still talk about as well. My name is Charles Platkin and I'm the director of the Hunter College New York City Food Policy center and I'm also a nutrition professor at heart of college. The food policy center has been around since 2012 and we work in sort of a variety of different ways. We do research actively we're involved with community based organizations. We have editorial on food policy, which is you know right around from around the country. We have a newsletter that is read by more than 15,000 people. We have probably monthly webinars now, as we used to have in person now we're having webinars, for instance, on November 17th. We have our first webinar of the season and that's going to be about restaurants and we're doing that with food tank, which is a food policy, think tank and tom Calico is going to be on with us and and several restaurant tours have been hardly you know very badly hit by Covid-19 and some activists it'll be a very interesting panel discussion and you can sign up and I'll sort of get the information. If you are passing along and I won't go into too much detail about the food policy center, you can kind of look it up and if you're interested you can email info at NYC, Foodpolicy.Org and we'll send you an annual report. It's lots of colors and graphs and it's easy to read through, but I will talk about one of the responses that we had to cover 19. and I'm just when I glanced on my left, I'm looking at some news and right around you know, March of the shelter and placeholders about the third week of March. We had been working on a project that we call foodscapes and it was basically where we would go into a specific community and look and aggregate all the relevant information into one report about that particular community. So it's things like what food pantries exist. What the demographics are, what the disease states, disease rates are and so forth. We found it very useful to do in 2017. I bet it was nudged by my staff obsessively to redo them, and I did not want to because it was a huge tremendous job. But finally, I acquiesced and the reason why I did was because I decided not to design it. That was really the big issue for us is the design process. So we kind of started the process, and this was back in November of 2019. So by the time- and I decided to do all of the underserved communities first, so they have lists of every supermarket every bodega and so on, they're, very comprehensive. So when we got a call from a partner in East Harlem right around the second week or right in the right, I guess the third week asking us what supermarkets were opened or closed. We were able to within an hour and a half, make all the calls. We have all the telephone numbers and locations of every single supermarket and give them that data and they posted it for their community in parliament. So you know sort of a lightbulb moment wow. This is really critical information. People can't get out. They do not want to go out. There are vulnerable individuals who are scared to go out, and you do not know if a food pantry is open, closed supermarkets delivering whether they take snap, which it just it was very it was very confusing times. Not that now is not, but even then was even more so we were able to with the 12 food schemes that we had already prepared and with a lot of work, create 59, neighborhood food resource guides and with the help of places like hunger, free America, share meals. We had a lot of partners, people it was so wonderful to have all of these groups come together and contribute their data in including on city harvest, which was incredibly helpful and instrumental and the founder of share meals who basically provided all the back- end technology. I had you know he called me the founder and said hey. I want to we're doing a vending machine project and he said hey. Can we talk about this? I'm like you're kidding me you're, going to talk about this, but we need help with so many other things and he was so wonderful about coming aboard and coming up with the technology. So we created what would seem like an Excel file and this technology automatically downloads to our website right for each particular neighborhood, with every single resource like food, pantries, Soup kitchens, whether they're open or closed. What hours and times they are? Farmers, Markets, grocery stores, home, delivered meals for seniors, grab- and- go distribution sites, so we operated all this data and then we updated every single day and we created an army of volunteers that are going out, they're staying at home and and using the telephone to call all these facilities, and we update this every single day and it's also updated from data that comes in from the city, from city harvest and from a variety of other sources, and especially the soup, the food Pantry data. So now we have these livable 59 food, neighborhood food resource guides for all of New. York City they've become models for other communities around the country, which is which has been really nice and we've. You know had close to 80,000 people that have viewed them since April first and you know, and use them as a resource to find information, they're also being used by organizations to provide their websites with data right. So we're agnostic, we'll give the data to anybody and it's easy to put on a wordpress site or wherever. So that's kind of some of the things we've been working on and then we were fortunate to be contacted by Dr, Pam Cook and who was on this call and her organization, and the objective was to do research and look at the impact of cobra 19 on the food system in New, York, City and regional food system from an institutional perspective and a community perspective. So the Tisch food policy center. I know that's not the name but just abbreviated and the hunter food policy center and the CUNY food policy center, and I would not say that we're competitive with each other. But you know there's healthy competition for funding and everything else. But it's been so wonderful because we were able to all work together. We got funding and it's been a completely marvelous and exciting process to be able to record what's going on in these horrible times in relationship to food and food insecurity and I'll, give some brief notes on food insecurity and then I'll pass them a time. So some of the things that I'll just take what we did is we lived a community and we did qualitative research interviewing new Yorkers and underserved communities. You know and the just to some fact that from 1.2 million now it's 2 million new yorkers that are food insecure. So it's significant impact over 19 has had for a variety of different reasons, but more interesting and kind of scary to me was that 30 to 40 percent and some reports of up to 70 percent of food pantries closed in what I can see- or my opinion is the worst time for a food pantry to be closed and there's different views on these food. Pantry closings. But one of you know our colleagues Nick Floydenberg who's, not on this call, but that is working with us as director of the CUNY food center. You know had mentioned to me in a you know. Previously we were discussing this that when a food pantry closes, even if it's in the basement of a church and may not serve thousands of people, it's still incredibly relevant because an undocumented person might be going to that and feel most comfortable there. People that are older may not feel comfortable starting a new relationship in a new food pantry. So this was a pretty. This is a pretty important fact, and also it was showed us that it was really important to make sure that there's good information out there for people so that they do not have to go out, especially in the height of code. We people were not wearing masks and infection rates were incredibly high in New York City, that people can go to a resource or make a phone call and be able to determine if a food pantry was open or closed or if they're, a senior and very vulnerable, and not wanting to leave at all where they can get home delivered and so part of our research has shown that information is critical and there was there's really a lack of it in the city of New York. Unfortunately, and I think that we try to fill that gap and probably needs to be a remedy around- that that's long- term and sustainable and that you know, food pantry closings were primarily in underserved communities, ironically right, which was something that we showed in our research and I'll leave it off at that. I just want to quickly glance questions see if there's anything else I can add. Lastly, so one of the questions is what populations in areas seem to be most affected and vulnerable to food insecurity. It's there are probably 10 to 15 neighborhoods. There are underserved communities in the south Bronx and Brooklyn and Queens and parts of Manhattan and Staten island that are that have been hit horribly bicovic 19, but they were already food. Insecure and what's happened is because of some of the research that the three centers have done and have put out there we're creating awareness around the fact that these problems were already existed. Okay- and there were not a lot of remedies that were going on and while community- based organizations contribute such a significant that gap filling okay and it's fantastic with what they do and the food deliveries that they provided and everything else, it's city state, it's a national, the federal city and state that needs to really focus on solving and working on poverty and food and security issues that it's really hard for charity to make a huge debt- and this was brought to me in a discussion with all burn. I thought it was really relevant who's. You know from hunger for America was a leader in the underspace, and he said you know that, for instance, the the Ebt cards that were given to every New York City student, those ebt cards, while it seemed like a waste to give it to families of means. The idea was that 75 to 80 of the families that received it needed it, and it was, I think he said it was an 800 million dollar program. Is that right then? Do you know an 800 million program by the federal government? It brought 800 million dollars into the state and it was 70. It was 70 some percent of kids that qualified before so it was definitely higher, so it was really worth it and it was also worth it to bring economics into the state. So I'll talk a little bit more about that. When I speak so sorry I'll stop there and thank you. Thank you. So much for all that information. I should say to the committee that I sent you data from the site that Charles mentioned on the upper West side food to the to the committee beforehand. I also sent the report that I am assuming is the result of your research, the New York Food 20 report. I shared that with the committee and we can post this on our website potentially links to both so that people in the community public can have access to it as well, but I just wanted to highlight for the for the committee that I sent I sent both of those things out to the committee before the meeting. So now I'm going to turn it over to Pamela Koch. Am I pronouncing your name correctly? It's said cook, but it's okay in New, York City, it's very hard, okay! Well, it's good for me to follow up after Charles, so I'm from the Lorientish center for food, education and policy at Teachers, College, Columbia University, and we conduct research, that is at the intersection of food and nutrition, education, practice and policy, and we translate it into resources for educators, policy makers and advocates, and our real goal is through education to give people the power to demand just sustainable food, and we believe that by doing that we can change the status quo. So just to build on a couple of things that Charles said is really what happened with Covid-19 in New York City. Is it exacerbated a lot of challenges and problems with the food supply and with food insecurity that already existed? As Charles said, it was 1.2 million people in New, York City that were food insecure before and it's now up to two million people. So it really just exacerbated problems that already existed and we are really lucky. As Charles said we, it was actually a funder. That said, hey, I think the three of you should work together to actually evaluate this, because so much money is being put into by government and by foundations to basically get food out to people and if we do not really try to capture what's working and what's not and what's needed and what could have been in place. It's a completely lost opportunity because we can't grow and learn from this experience to be better prepared for the future when we're not in a crisis mode and also for future crises. So, and it's truthfully our funding, we got funding to do this, but that amount it and rightly, is a small amount of what is being going into making sure that people get enough food. What I also want to talk about is that somebody mentioned- and I forgot if it was Susan or somebody before her about Catherine Garcia, who was the food czar now is not because she's running for mayor- and we also have a food policy office run by Kate Mckenzie, the New York City Food Policy office before Covid-19 hit and still is so much smaller than so many other cities. Food policy office: we need a much stronger food policy office that can oversee helping with food security, helping with diet, quality, helping food, retail and restaurants to be able to stay in business and keep the heart of what our city has and helping to understand food workers and making sure that they are cared for. So we need a much stronger, larger food policy office if we are going to be able to do that, I want to just talk a little bit more about what's called pebt or pandemic electronic benefits transfer. So this is really for all of the days that schools were closed. New York, City schools were closed 74 days last school year, there's only 180 days in the school year. So that's a pretty high percentage and the schools were sending home ipads and technology for kids to learn meals. School meals are part of the school day, so it was a service that parents were not getting that's why the federal government passed this, so it was five dollars and seventy cents a day for every child eligible to for free meals, because it was such a high percentage in New. York City, since 2017 school meals have been available for free for every student in New, York, City and part of that is to reduce the stigma. So it is not seen as a program just for poor children. So it's for everyone. So that's why this is such an important program and it did bring in as Charles said, before, 880 million dollars into the New York state economy at a time when we really needed it, it's actually now been approved for another year, so how it's going to roll out in New York City is not quite clear with what's going on now, but this is a program that we want to support and there was a lot in the news about like it's, giving it to families that did not need it. That was such a small fraction, and so there was a lot of ways that people who were lucky enough to not need. It could then buy food with it, the way that they were supposed to and then make a donation to something like the West side campaign against hunger or another group in their community. So this is government working for us the way we want government working, and so we really want to support this. I want to end with saying what we normally do when it is not Covid-19 and that is working with all of the organizations that work with school children around food and nutrition and supporting school meals and there's. Actually, we have a coalition of 80 organizations doing that. I know a lot of the organizations are working with the schools that are in your account, your district, your community board, sorry, and so we want to keep that happening, and a lot of those organizations are continuing to do education, whether it's remotely. However, they can, because those are sometimes some of the best opportunities for kids. They love going to the garden, they love cooking in school and we do not want school now that it's a remote to just become this just the learning part of it. So we want to keep school rich with all of these wonderful experiences so I'll leave it there. Thank you. Thank you so much I am now going to and I'm sure there's going to be a lot of follow- up questions for everyone. I'm now going to hand it over to our last speaker, the Reverend K Carbon Saint Paul and St Andrew United, Methodist, Church, yeah, hi. Sorry, I'm late! I'm glad to be here I'm going to share a little bit stephanie. I assume that before I got here, you filled them in on the real information about the West side campaign against hunger, I'm providing the sort of the background info so we're a little bit in reverse. I apologize for that, but maybe this will make it more tangible and clear about what what the situation is, what the challenge is, and so, if I can share my screen I'll just scroll down a couple of pictures that will make that work there, we go all right, so the West side campaign against hunger definitely probably told you started in the late 70s. This was a couple of years before I got here to the church of Saint Paul and Saint andrew. It was always a project of the community of the neighborhood. Somebody pointed out in the chat: this is a compassionate neighborhood. This is a place where people care about each other and so from the start, we combined with other churches and synagogues in the neighborhood and eventually created a super, a supermarket style pantry, as you can see where people could come and receive healthy food and receive it with dignity and be treated with dignity and also receive help in other areas of their lives. As you can see, it was popular and crowded. We made a vow about 20 years ago that whatever happened, we would never run out of food. There was one week where we ran short and had to close the pantry and people freaked out and said in the church, another in the neighborhood and said no. This is never going to happen again, even if we have to mortgage the church, which we actually did at one point, so that that has led to a dependability where people know if they come here, they will find not only an abundance of food but fresh food and a good attitude towards them, and- and we have a lot of volunteers, we had historically a lot of volunteers who were part of a community of people who received help from the West side campaign against hunger and therefore wanted to give back and so became volunteers and became the backbone of our program as I'll mention in a moment that had to change after a while. We also did not want to just supply food. We wanted to make it so people did not need to come to a food pantry for food, and so we started a couple of different job training programs, including the culinary training program, which you see here. Oh my, so all of that changed very quickly with the onslaught of Cobot 19.. The first thing that happened is we shut down the whole building, because there was an incidence of infection in the building. We had to clean the whole place for the low price of fifteen thousand dollars, and and then we we moved the operation outside for the safety not only of our customers but of the volunteer. Many volunteers who we needed to make the whole thing work, and so it took us a few tries to get it all right. But right now it's an operation that moves works fairly smoothly. Also, as I'm sure Stephanie told you, the need, the requirement for food just grew exponentially. We tried to still maintain our commitment to healthy food, a lot of produce. We had to go to more shelf stable produce just out of necessity. We did not have that much refrigeration space, although we rented a large truck a refrigerator truck, which makes you know too much noise and is not popular in the neighborhood, but it does keep the food fresh and available and we, in addition to our terrific staff, began using a different volunteer base volunteers, for who our traditional volunteers were mainly senior citizens. They were very much at risk, so we went to New York cares and were able to develop a wider base. The need continued to grow so that the lines were going around the block. It's not the way we'd like to distribute food. We like people to we like to invite people inside we like to serve them with dignity and respect. We also want to make sure we're addressing other needs. They have, whether it be for food stamps or insurer, health insurance for their children or whatever it is. So. We've tried to take all those services online, but right now it works fairly smoothly on site there. The thing is: with this a huge increase of food: we had to figure out a place to put it in it at first. We just expanded the food pantry operation to the whole of the lower level of the church and and began sorting through, as you can see, still a lot of fresh produces. We were able fresh, baked goods donated from different bakeries in the area and so forth, but then we decided that we had a large sanctuary and see it's 1200 that could at present seat nobody because of Covid-19, and we were not doing in person worship. So we began removing some of the pews of the sanctuary so that it could be used for other things and we use the rest of the pews for sorting bags of food that could be easily and quickly distributed, not only on site here, but throughout the city gives you an idea of what things look like currently and there it's actually a very good you know, makes a very good warehouse. We needed, as I mentioned, a lot of volunteers, a lot of younger volunteers, so the call has gone out there and it's been responded to and then the last thing, as I'm sure Stephanie told you we're serving people, not only we already had about 20 satellite sites throughout the Bronx upper Manhattan, but since Covid-19 we've that has grown exponentially and we've taken on partners like New York, Presbyterian Hospital make the road New York and quite a number of other sites where we've been able to sort pack and deliver food to those sites, and that's that's kind of the snapshot of what I got. Give you a visual as to go along with all the information. Thank you thank you. So much so I am going to call on everyone I'm going to start with shelly and then call on everyone on the committee. If you have questions for the speakers- and I should start by saying- thank you so much to all of you for the work that you're doing and for all the helpful information that you shared with us- and I also want to thank the those who are attending the meeting from the community, because there's been a lot of great questions that have come through the chat, so we'll also have time to hear questions from the community. Let me start by just suggesting to the committee that- and maybe Shelley can build on this and the committee members too, in terms of ideas that we write a resolution in support of what's needed and also the recommendations that are outlined in the New York Food 2020 report, which was produced by Hunter College New, York, City, Food policy center, where Charles is from in the Lori Tish Center for food education and policy where pam is from and the CUNY urban Food Policy institute. So just briefly, I just want to summarize the recommendations in that report, which just came out, I believe, on October 5th of this year. The first recommendation, which I believe Pam mentioned, was to strengthen and expand the mayor's Office of food policy. The second was for users create and man maintain a public data set of all food, pantries soup kitchens and other emergency food resources, and also for the city to provide simple technologies for emergency food providers to easily update their status, to expand economic stimulus, support focusing on small and independent food businesses that women people of color and immigrants own, and operate to monitor, retail institutional food and emergency food programs, impact on diet, quality and address nutrition. Related inequities, which occur because of income and race, develop food plans for future emergencies that include concrete steps to support high quality diets and ensure that all local state and federal benefit programs for workers are accessible to all food workers, especially those with lowest pay and lease benefits we might want to. We might want to add something related to the things that were mentioned by the speakers, including the program to provide funds that replace free and reduced price lunch and there's tons of ideas of what we could add from the speakers that we'll have in our minutes. But I just wanted to throw out that the possibility of writing a resolution in support and I'm going to hand it over to shelly, and then I'm going to call on the committee members in alphabetical order, so Shelley, okay, I think we've learned a lot and I'm sure everyone hearing it appreciated the terrific work that's been done by each group to provide food and to analyze the situation to enable better things to happen. I have two questions which do not have to be elaborated on too much, but I want to focus on your experience in terms of seniors and their particular needs during this time and how they've been addressed and, secondly, how those who are providing food are dealing with people who are diabetic, people who are need gluten, free or other dietary food because of conditions they have. So whoever would like to respond. Certainly appreciate it, I can address what I've seen of seniors. This is Susan Mattlofnievis from goddard Riverside. It's a group that I actually spent a lot of time trying to deal with, because we were used to feeding hundreds of meals to seniors from our congregate sites, and so we were immediately switched over to grab and go where seniors could come down and pick up their meal who would normally dine in a in the dining room. We were also at the time and reverend carpenter was hosting us to do this to we had a meals on wheels program where we were delivering 500 meals a day and the caseload of our home delivered meals, program balloons by 15 in the space of about six weeks and then department for the aging citywide said nobody can take any more clients. We were basically all put on hold, but there was an absolute explosion of need and we were you know. We were also, as happened with other providers when the when the pandemic first hit our supply, our food suppliers. Our raw food suppliers began telling us that they were having trouble getting drivers to drive into New York because of fear of contagion, and so we became concerned about our food supply. It actually never materialized as an issue, but it was. It was stressful, citywide, the the congregate meal. We were told to stop, doing, grab and go. Although we know many of our seniors went and got on school lines and got the grab and go through department of Ed, because that was available not only for families as children, but also adults. The city converted to a home delivered meal on what they called it. The get food program where seniors could request three meals a day as needed, and the in theory all of our senior center clients were supposed to have gotten a delivered meal. We went through three separate vendors. No one successfully got every meal to every senior. The lists were incomplete. We were not given the list of. We were told to call our members and tell them to expect a meal, but many people were not on the list to receive it, because there was an algorithm used that excluded many people who were actually most at need. So, for instance, if you had been in a in a rehab facility for a few months, you were removed from the list, so it was a hot mess. We tried to do as much backfilling on the back end. There is a continuing the get food program. It's stabilized people do get their meals. Some seniors have since opted out of it because they felt they got too much food. The meals were repetitive. I know we were delivering meals in one of the NYCHA senior buildings and a one delivery was nine servings of bean salad. I love bean salad. I could not eat nine servings in a week twice a day and the they were serving twice a meal, so it meant basically for that week you were eating bean salad for the week other than breakfast, and we've had quite a few reports, particularly from seniors who have gotten kosher, meals or other specialized meals, that what they're getting is pre- packaged self-, stable food. In some cases they can't open it. So you'll get a kind of tuna fish, but you're a very arthritic senior living alone, and you can't open it. So there have been. There have been issues with food quality. There are a senior meal is designed to fit certain common health challenges that seniors have so we're required to have no salt and my battery's dying. I'm going to go charge. I'm sorry, I'm on my phone there's supposed to be no salt high fiber. It's! We do not serve gluten free meals on that scale, but we do serve kind of diabetic friendly, I would say, but they're, not therapeutic meals. There are some providers that do provide what are called therapeutic meals, which I think is which are designed for particular dietary constraints, but those the requirements of the senior dietary standards were temporarily suspended during the crisis. The reason being there was just urgency about getting food out any kind of food to people. I think as much as possible. The vendors were asked to tailor the meals to a senior diet, but they were not necessarily required to comply with that, and so we got pictures of seniors meals that were all snacks. You know really highly sugared highly salty again. I think it's just what happens when you're caught unprepared, with without a system in place for something that was just unprecedented, and you know I think there were quite a few people of great goodwill trying to do the best they could, but without the organizational capacity you know, the first set of deliverers were sent out without routing sheets and we basically said: look we'll do the routing sheets. We know how to do routing sheets, but they just had lists of addresses and they were trying to figure out what they were. These lovely unemployed actors trying to figure out how to do a routing sheet without any experience. You know it's been challenging and I think that some of the solutions have been as frustrating to seniors as the as the bottom line issue and many seniors have tried to just make their own arrangements where they're able to so I'd like to share some information, because I was deeply involved with this, because we found that the city insisted that senior centers were going to handle the senior meals and you had to be a part of the senior center. At one point- and I pointed out being president organization that has two senior centers- that our people, our centers, were closed and that our workers were reduced and they were taking care of checking up on people. They serve. So with a little pressure, we're very fortunate that Gail Brewer's office, Michelle Warren, who was working for her and Mark Levine's office. I his chief of staff, worked. We worked together and got past the system and got people registered. Now the issue was getting them registered said we can get ten tens of people, tens. Hundreds of people who will register people, but it had to be done a certain way to bring it up to date, so we had the same issues. As you pointed out over time we ended up with 220 households being served, but people calling or texting every day. I did not receive my food on time. I got snacks, not cooked meals, etc. The bottom line is today, all a person has to do is call 3-, 1- 1 and they can sign up themselves, but people do not know that the information's not out so, for instance, I spoke to someone today who still has not been able to come out of her home all these months and went on the phone with her to call 3- 1- 1, and we basically got her cooked food, only no snacks, okay, we tried to bring up certain dietary issues. They said they do not know if they can handle it and they set up a schedule where she would receive them. The two schedules are five days or two weeks: five days, if you're not sure, if you're going to want to continue, the problem then becomes towards the end of the two weeks. If you do not call up and renew it the delivery ends, the meals are delivered nine meals supposed to be for every three days, so three meals a day and the fourth day you get your next supply and for many people it's worked, but it's been, as you described, sometimes a little rocky and not, as you know, not as smooth as we would hope, but people can now do it themselves. Those who may have difficulty we should be helping our neighbors create the 311, but they will register people directly now right. Yes, by the way they said up until November, first they're, not asking people's age they're not allowed to ask people's age, but they sometimes do so. I told people some people are seniors anyway, but they do not want to give a birthday, they said say I'd rather not say so, and they and they move on and they can get registered. Okay. So thank you, shelly and thank you so much Susan for your answer. So Audrey do you have any questions for the speakers? I did not have a question for the speakers other than to say I was overwhelmingly impressed with all of them and I loved your proposed resolution. The only suggestion I have is to put the numbers in so okay, the number it was 1.2 million before Covid-19 and 2 million now, and that's very important to let people understand the scope of the problem. That's very helpful excellent suggestion and those numbers are also at the start of the report. So we can. We can draw from that as well and from our research on the district needs statement. Thank you. So much audrey courtney, yeah. Just one question. I I'm concerned about what you said about the delivery: stopping because of the thefts. Do we have? Are that we're aware of workarounds or are there organizations that are stepping in to to address that, because that's that, especially for the elderly that seems like that would be or the disabled? That would be a problem yeah. I do not. I do not have an answer to that. It's something we only recently found out about. I think that people are doing personal workarounds. I know there's a few people within Amsterdam houses who run errands for other people, so there's been some mutual aid among residents. I really do not, but I do not wanna, because I I'm sorry, I do not know of any organizational responses. There are some volunteer organizations out there like invisible hands or helping hands, or I know there was one that started called Corona courier, that's early on in the pandemic that similarly are doing grocery runs for folks who call their numbers or email them for support in that area yeah. I think some of the grocery shopping services require that people have a credit card and many of the older adults particularly do not and just wanted to add one quick thing. I think that all the things you're saying you know we found in other communities as well in our report and our research, and you know what concerns me is that these are ad hoc measures, meaning if the city does not come up with. You know long- term intelligent, well-, funded solutions, you're going to see things like stopping after two weeks, it's very confusing for older people to have to deal with this bureaucracy when they're just trying to eat, and they think you know. I know I'm preaching together converted here, but I just think that it's just to make that statement and realize that it's one thing I say this all the time: it's one thing for the city or state to check a box and say hey we're feeding, people, it's another thing to say: hey we're feeding them. We know it's not the best food, not the healthiest food. We know that it's a mess that we're doing nine meals of the same food at a time. We know all this we're on it and we're fixing it versus checking the box. Saying hey we're feeding everybody, and I think that that's a really important key point here and I think that's what we're advocating for is making sure that the city does not say: hey. We've checked the box and we've we're feeding everybody, even though it's just a snack we're feeding everybody and that's the way. It's going to be versus hey we're, fixing this and we're coming up with ways to deliver produce, but again it needs to be organized. It needs to be. You know efficient and city wide or community- wide. But not you know. Oh this organization is going to. This is not everybody's opinion. It's just my opinion. I think that's incredibly helpful and and that it's that there's not just a system in place, but that it actually works and people are able to open their food and access it. So I think that's really helpful. Did anybody else want to make a comment at this point honestly, I agree with all of that and again that's why. First of all, this was unprecedented, as somebody said before, but not completely, something that we knew never thought could happen. We always knew that there could be a pandemic that would allow have everyone stay in, and so that is again why we need a really strong office of Food Policy, mayor's Office of food policy to have plans in place for that, so that it is about the quality of the food, and you know, especially when so many of these programs end up being long- term, if you're getting food to people for a week after a storm, it just get people food, so they can eat. If it's months and months and months, we have to be thinking more critically about what the food is and diet quality for the long term. Thank you is lolita on the line is lolita in the call. No okay madge. Do you have any questions for the speakers? Unmute yourself, Magic, okay, yes, the mayor's Office of food policy. Is that a short- term task force kind of thing, or is that something that's going to keep operating after the pandemic? That's the first part of the question and the second part. What is the relationship between this office and all the other half dozen officers out there that deal with food like Diphtho or the Department of Health, all those things? How is it all brought together so that it works efficiently or is it yeah good question? So the mayor's Office of food policy started in about 2010. I think so. It was here before the pandemic and hopefully will continue- and this is supposed to be the office that oversees everything and does all of the broader thinking. So it would work with difta and the senior meals and the Department of Education's office of food and nutrition services. So it would really, you know, coordinate and work with all of those and it's supposed to be more of the Umbrella organization. So hopefully it will continue, and hopefully it will be expanded to have a broader role, and that was there before so Catherine Garcia, who used to be with the department of sanitation becoming the food czar was temporary for Covid-19, but the Office of food policy has been there before. Okay, I wanted to know if, if mark has a question, I'm inserting you into our committee order- and I want to thank mark because none of these meetings would be possible without his coordination. So, thanks to mark- and you have a question for the speakers- yeah I'm the I.T guy- which means we're all in trouble- you know I only have I want to hear from. I want to hear from the other committee members and from the community. So I'm going to thank you for calling on me express my admiration for what we are hearing tonight and the needs that are being met. That may not be met in any other way and leave it at that thanks so much Robert. Do you have any questions for the speakers? I do not have questions, but I would say that, as Mark just said, I appreciate the forum and that its role as a kind of a regional educator, I mentor a program in the Bronx, and I coincidentally mentioned the West side food campaign in the presentation that we made. This is a program sponsored by Ae, Acd and children's village. It's called the family enrichment centers and it turns out that one of our main community leaders- grassroots, attended the West, Side campaign's, culinary program and she's a certificate, and she was my co- Presenter. I mentored her in the beginning, but I have friends who are working in senior food programs in Elizabeth New Jersey, so I just sent the message very quickly to my dear friend for decades, catherine, I said get onto this panel and not the panel but get onto this broedcast learn this so the world that we're serving as regional educators, absolutely astounding, not to mention the work that's being done by hunter by others by the way. That's my alma mater, you know, and but I would say to Courtney's observation that the buildings in the area which becoming more and more of the buildings, the aging buildings and where I live, we're all old. Now I you know, I do not know how to turn around and all of a sudden we're all in our 70s and 80s and 90s, and we established five six years ago, a neighbor to neighbor program. This is more before we ever even imagine. It was such a thing as a pandemic because of the people in the building who incapacitated, who can't get around and so on. So not just the whoever's, able-, bodied and ambulatory, and you know knock on the neighbor's door. If you have not seen a neighbor in a few days, you knock on their door and they might not be able to get any shopping done. So we have that sort of thing. That is the kind of grassroots organization. That's almost organic and it happens automatically when you have crises. So I do not think everyone necessarily relies on what the city agency is going to do, because you do it yourself and just not to take up too much time, but in my building, where we were struggling on the community board with expanding the nork program, my building rejected the whole idea of north program because we are surrounded by health facilities by social service and so on the upper West side in the 90s, and we said we do it ourselves, we do not have. We do not need to have somebody in the building. So the point is that your neighbor is your primary resource and your primary connection with the resources that are available to you, so that that's addressing courtney's point but the just overwhelmed. Someone else used the word overwhelm earlier and I'm just overwhelmed by the by the range and the scope of organized food, emergency programs that we offer and that what a learning experience it it provides to the to the region not just locally to the region. So I appreciate that great deal. Okay, thank you! So much Robert and now we have rosa. Do you have any questions or comments for the speakers? Yeah, I'm trying to write and think and but my question would be. I guess- for Mr Platkin is this stuff available in Spanish? Is it available in other languages or is it just in English? Yes, it is available in other languages, it's language appropriate for certain communities right. So not everything is in multiple languages, but the communities that were needed in this. So yes, we we've. We have not had an incredible support, voluntary support. You know people translating for us into multiple languages, people, volunteering, emailing and trying to help we've had we've had over. I think it's now 50,000 volunteer calls that have made updating these guys over. You know, since the since April first, so that's been part of it, people speaking various languages and helping and supporting and winking things out, it's almost that the guys have become crowdsourced in a way which is exciting. So I just want to provide a quick fact because there's been questions about this, which has to do with numbers of people who are food insecure on the upper West side in our district, it's ten percent of residents. I also heard it on the call today the number eleven percent there's it's the it. The percentage is fifteen point four percent in New York City as a whole. So I would like to to hand it over to shelly and mark to facilitate taking questions from the community from others who are here and then I think we should return to the conversation as a committee about a potential resolution. So we have hands requests for questions or comments. Actually, I see Doug Kleinman's got his physical hand up while we're talking about this, and so, while we shelly, why do not we take questions that either comment on the presentations of the panelists tonight or the resolution that's proposed by Catherine first and then, and then at this time? We'll do some more comments after that, so please, self-, regulate and Shelley. You call on people and I will unmute them. Okay, I do not. I do not sorry to interrupt you Shelley, but I do not know if you also want to take any questions that were in the Q&A list. I just I'm throwing that out there, because I know that there's a couple questions posted there as well: okay, how I'm trying to figure out how to identify people who are so right now I see one hand Erica Gerson, I can. I can call on her or do you want to take Doug first? Well, let's start with Doug, because we he was here and his hand, was up so I'll make this quick. I have some personal experience, having helped some seniors with the get food and white program and by the way I do, I did see first hand and I's the nine bean salads and lots of inconsistencies, but I've seen improvement. I guess the thing that I'm a little bit confused about it's so amazing to see how this is all coming together. It was obviously very ad hoc and I've heard from different seniors in the in the community about well do not call this program because there's better food here or more options here, so the 311 is the nice hub, but I've also seen that I guess various vendors participate in through the 311 system and they get food system. I've seen packaging that came from meals on wheels or packaging that came from elsewhere. So I guess I'm trying to understand how this is all integrated in you know. What does is it just simply to say everybody who needs it should call 3- 1- 1 and that's the easier way to do it or do you call meals on wheels, direct or any of the other fine organizations that are on this meeting tonight? You know, and also and as and just one other thing that was in the chat since we have so many suffering. Businesses in the World kitchen has been doing such an amazing job. Can we do that on a local level with CB7? Can some of the restaurants that may get funding privately or publicly benefit from this to then send their food? Through the program someone like to respond, I could take a stab at it. I think that I would not refer anyone directly to home delivered meals because they can't they're. You know they're basically frozen, so I think 3- 1- 1, going back to the comment that what we really need is a system. I think we should act as if there is a system and try to make it work when it does not. So I would recommend continuing to use 3-, 1-, 1 and then troubleshooting as we as we've been doing. You know, as we hear about individual situations that are not working to use those as opportunities to correct and work with the system, and I you know I have to thank all of our elected officials who have been tremendous allies in doing that. So that would be my overall suggestion and I think there has we have where we can. We've been very conscious of trying to support local businesses, but again, since we are essentially, you know, are not directly providing very much food. At this point we have some food programs that are reopening that there's been less opportunity to do that, but that has been part of our conversation and I also believe, as of November 1st, it may have to go back through the senior centers for seniors again, but there's not heard that about a half a month ago and have not heard anything publicly expressed since so I think we would have to order the food now if that's happening. So I do not. I do not think it's happening yet. I think one of the problems is information and education and everyone who can help them that way, including Community Board, is substantial because most people I speak to, I did not know- or I heard this or my friend got that and what is that and is that the same thing you're talking about it's it has been very confusing and just to clarify home, delivered meals is an ongoing program. People have to be. They need to be assessed by a case manager. It's an ongoing permanent program. It's not a short- term Covid-19 crisis program. So shelly shall I go to Erica Gerson then? Yes, please, all right Erica! You need to unmute hi good evening there you are okay, my kids want to know if there's a meeting every night. I do appreciate all of you who I can see as well as all the people who've taken the time to be on the call it looks now. I can see that there are 117 participants in the chat and there are actually some really great questions there that, hopefully, someone can look at there's a lot of data that people are asking about. I want to have a few points that I want to make. First of all, I really want to thank all of you for your great work. My family has seen firsthand some of this work through volunteering through donating through our children, touring the programs and it's wonderful to be in a community where people care so deeply for those that are vulnerable and those of you who do it every day from work. I really applaud you for keeping keeping going day after day off with all the challenges I want to say also with regard to the resolution. I could not catch all of it. There was so much that was listed. I think sometimes that can be a problem. One thing that caught my ear, that I would support, is the idea that there should be an accessible and updated database of all of the food assistance that's available. I know a lot of us for a lot of reasons. Do not want to give cash to people on the street, but we certainly do not want anyone to be going hungry and that's exactly the sort of thing that should be available even digitally. I know most people, even if they're out on the street asking for money. Many of them have phones and could actually look this stuff up or could use those NYC links to find it as well. So I support that, but perhaps not all of the other things that were listed on the resolution. I also really want to amplify the voice of Susan Matloff Nevis, and I think you brought to this conversation the role of street security and contributing to hunger. As someone noted in the chat, it's the issue of the lack of deliveries is critical for our seniors for our disabled population and also it's critical that our that our delivery people are afraid, like they're victims in this too, and I think it just points to the fact that I know people say we have to stay on topic, but I believe it is on top to talk about budgeting because it starts with street safety. If you do not have safety and treats nothing else can happen, people can't go out and get their food, whether it's to pay for it in a grocery store or to go to a food pantry and fill their bags. So I'm grateful that our community recognized that and put it as a priority. I thought it should have gone higher, but I think it all interplays. There was also something in the chat from Nicole metzger that I wanted to amplify. I know not everyone is comfortable speaking publicly and since I am I'll take the opportunity, she said that it was brought up at the meeting with police commissioner Shea last night that the night population is being disproportionately impacted by this. That, in addition to suffering as I was on a call, I think was it yesterday that we were on the call that, with their crumbling infrastructure with elevators that are not working, people can't get out so there's problem number one problem number two is that their crime is higher than everyone else. So you know you they're, certainly not going to get delivery people coming in and they themselves might not feel comfortable going out on the street. So all of this interplays together- and we all know that, as I said last night- for some reason, it was tagged as inappropriate. There's a finite pool of money. I have serious concerns about the people in our community and in our city that are facing hunger. I think catherine may even understated it. You mentioned 10 or 11, but that's people at the poverty line. There are people above the official poverty line who are still facing food insecurity, so that number, I'm sure, is greater and we have to think about the realities that our budget is not growing. Next year the city budget is shrinking, and so my question to the panelists that I would love a realistic answer on is given that your budgets will all be smaller next year and given that the need will only be greater next year, what will happen to these people, as I think at our about our budget priorities as a community? It's important to me that we not add programs, which is why I can't support everything in the resolution, some of which would add costs and ongoing costs to all of our ongoing expenses when we have programs that are that are going to fail, our people, as I think, is it. I do not know if it's reverend carpen okay, if a food pantry has to close and can't serve that last person, that's a big problem and we can't fail to deliver on things that we've already promised to our community. So if you can talk about what that gap is going to mean and what it's going to look like, if we can't allocate a larger percent of whatever pot we have next year to food insecurity, I just wanted to say one quick thing before you started: sorry that on the numbers that were given from this food stamp, of course, they're pre- code numbers, we do not have the customers. Okay, that's really helpful. Thank you. Thank you. I would just thank you Erica. That's a really good point. We do at West side campaign against hunger. We do receive a small amount of city, state and federal money, but the lion's share of our funding comes from private citizens in small amounts and big amounts, as well as foundations and so forth. So we really are. We are our finance, so financial sources go well beyond the governmental ones, thanks and they're increasing. I should say I mean people have been very generous in this in this time. Certainly good to hear. Okay are there any other? Are not some of these programs funded by government money? There is government money for all the programs, I think all the programs, but in case of West side campaign against hunger. Well, when it started our area, Policy Board used to give the foundational money, and but over the years it's not just been the government governmental money, it's been voluntary contributions by institutions and individuals and so on because of the worthiness of the project and how it's expanded so beautifully, and it's really the model across the nation. I wanted to say one thing here: erica those are the great comments and really important concerns. I think that one of the things that you know becomes so important is who your local politicians are and how they're going to be voting in the City Council. I think that the city council really recognized the importance of food and try not to completely wipe out some of the budgets this year, but it's going to get worse for 20. You know June 2021, when you know when they do the new budgets. I think that's a very important point and you know the city. Look it's going to be a lot of it's going to be politics. What the federal government does what government como does and who we elect as our next mayor and do they understand the importance of food in our community and in our communities and also you know the City Council members? I think, there's a huge amount of city council change coming up. I do not remember the numbers, but it's is it three quarters of changing yeah 35 out of 51.. I was right, 35 out of 51. yeah, it's tremendous, so you know again. I think that that's going to be important. The city council has a lot of power in the city of New York. I think that that's going to be critical. I think that food has not been prevailing to most politicians. There are some that you know the exception and I think it's about making noise around those issues which you know, I think and being an advocate and making sure that the candidates that are voting for mayor and the candidates for City Council that they have they understand the crisis. That's going on yeah and I'd like to say CB7. What you're doing tonight is a really big step forward in terms of establishing the importance of hunger as an issue in New, York City, when the upper West side CB7 says we think this is a number one issue that speaks loudly to those who make decisions. So thank you and one of the things that is that you know we talk about this. You know as food advocates all the time, but I'm not so sure that everybody kind of hears this language, that food is a basic human right. Healthy food is a basic human right and I just I do not hear enough talk with that. As the forefront you know, healthy food is a basic human right and it should be right at the top. It becomes a priority along with housing and education. Absolutely thank you. Thank you. So shall I call on the next person? Yes, please alrighty, so Erica, I'm going to return you to the attendees. If I can figure out how well maybe I'll call do not worry about it. No worries no you're fine, but I am going to call on Casey. Is it la and thank you and please unmute and address, and then, where did the preparation go? Okay, there's casey there. You are okay. What happened? Your ear, muted, try again! Ac is muted. There you go. Oh your showing is unmuted, but we can't hear you. I do not know what to say yeah there we go well done. Oh my gosh. I am so embarrassed that took so long hi everybody. My name is Casey La Rose. Actually, I'm a resident of the upper West side and very concerned community member. I have a bunch of questions that I guess I'll dig into the data later it looks like John is a part of the community who's, a data driven person, but my question is really around: how are we working or are we working together with the department of information technology, communications in the city and all of their smart city initiatives to tie the people that need food to the systems, to the restaurants and to potentially public and private partnerships? That could help? I mean I know, there's grub hub as a delivery service that has a round up the change to feet. You know to feed the hungry to me. It seems like we have restaurants that are suffering and going under. We have people that need food. We have people that are, you know able to deliver the food. So it's really just a matter of connecting the people with the food, and is there a way for us to do that using technology? That would help the restaurants that are suffering in our community, actually cook food and make it through the winter, because I feel like and maybe through the through the spring and early summer, if we could figure out a way to connect those dots using some of the technology that city has already invested in and they've created. Maybe there would be a way to route this through that and send it to send it to the restaurant, so they could make the orders and then they could actually generate revenue. Okay sounds like a great suggestion. Does anyone want to comment? Donnie I mean I can say so. I believe it began in April through the United Way West Side campaign against hunger was partnering with doordash to home, deliver pantry boxes to you know, in similar fashion, to the conversation around seniors, we saw a huge drop in the number of seniors attending our pantry, and so that was a solution that came through the United way. Unfortunately, that's probably a fairly short- term solution. You know it's still going on. It's. Their capacity is about 100 seniors a week. So that's what we've been doing, but we just do not know how long that will be a solution for our seniors. Similarly, through another initiative through helping hands and Uber eats same concept but again they're, you know they're, not long- term solutions or programs that we can rely on for our customers. Is it just because they're the contracts that are in place were only temporary or covered related yeah? Yes, through those funding streams through the United Way and through helping hands, they seem to just be for right now. As far as we know, they're just covered grants, because I feel there's so much about this pandemic. That gives us a chance to pause and rethink and say, okay. Well, maybe we need to start rethinking the way we use retail space. Maybe we need to rethink the way that a restaurant individually, you know, opens its doors and has its own staff. Maybe we need to be sharing stuff. Maybe we need to be sharing. You know the all of the investments that need to go in, so I'm I feel like this is two sides of the same coin, because if our community is essentially you know, has nothing that survives this pandemic, then we're going to be in much worse shape than if we try to take some of these programs, even if they're, temporary and covered related and figure out a way to pivot them into long- term solutions. But if we do not get through this period, we're going to be in much worse shape than if we do not kind of try to combine the short- term with the long- term. Thinking. Okay, thank you bye. Yes, please. I think that is an absolutely brilliant idea, and I know that next month I think the Hunter College Group or the city college group is going to have a conference on restaurants, and I think it would be wonderful if they could bring up at that conference, or maybe we could somehow interact with it and talk about restaurants, getting funded to provide food for people who need it and that way, helping restaurants and helping the people who need the food, because we would love not to see so many restaurants disappearing from our neighborhood yeah. That is that is one of the topics of discussion so and that that's on the 17th. So yes, we have been talking about that. In fact, one of the pre- interviews we did yesterday the restaurant was desperately saying the same thing. I know they did that with caterings city put out an RFP and a lot of caterers were providing meals for seniors and delivery programs and have they been successes for the restaurants? Have they kept them going? You know, I again. I think that you know we get snippets of information and you know we have to probably do a free information act and then contact each of these catering companies and restaurants that were contracted, which is not a bad idea to see in our phase two of our research. But you know I I've just heard anecdotal stories. That's it nothing. I know the business improvement districts like there's, I think two or three within the upper West side, and obviously I you know I'm since I'm thinking about the upper side specifically, but I feel like that. The bids are a good central place to go, which represent those groups, there's one in the Lincoln Square area, and I think that there's one in Columbus and then there's one on Amsterdam. I think like between 80 and 100.. To me the bids would be one place to go to get to those central places, but this could I mean if we do think about Ubereats, Doordash and grubhub. The three of those combined could probably I mean I know already that Grubhub is doing charitable. You know programs and actually giving people the opportunity to donate money when they order food and to me that would be. Maybe let's do that on steroids. So, instead of donating like a dollar or two, you say I'm going to order this and I'm going to donate a meal and then that money could then get put. You know we could do this all through technology so that it could be centrally distributed and then not only does not only help the restaurants, but it also helps potentially people that are unemployed. Who could help? You know, assemble the food, so maybe that could be. I just. I really feel like if you know, if we do not act fast as a community, this winter is going to be really horrible for everybody not only from a health perspective, but also to kind of keep that try to keep some of the businesses alive. I think this is a great idea. I mean I do have some issues with the donation part because of the consistency levels of consistency right, you know getting them. You know that concept of charitable narcissism. You know it's great to feel like you contributed, but it's it means in order to make a serious impact. It needs to be really a highly coordinated and well- funded. You know program right, I'm not saying that is not important that the charity is not important. I totally get it, but that's the really good practice. It's not a long term. It's not a long- term programmatic way to solve a problem. It's just kind of it's a stop gap, but I think that you know it could. Potentially there could be a pass through. That could leverage the you know: okay, yeah, and I think that you know- and maybe it's some combination thereof or something because people need you know part of food insecurity, is consistency and being able to know where your next meal is coming from right, yeah and that's part of it so again not to Pooh-, Pooh or squash. This really great idea. I just want to keep putting it out there that we need consistency. We need you know, programming. That is long term, because food security and hunger issues are not going away after there's a vaccine and there's still going to be high levels and when everybody's you know going Rah- Rah because you know covets gone, you know, a lot of the impact is going to stay for a long time after that, so just really important to recognize. Okay, shall we move on to the next person, all right that is helene mendicler, forgive my bad pronunciation and thank you casey elaine. Can you unmute sure? Okay, thank you. Hi, my name's helene, I'm a registered nurse. I have some I'd like to get some feedback from the group on. How do you coordinate with hospitals with we have a couple of rehab facilities? We have at least two area hospitals. How do you coordinate to make sure that folks who are being discharged have access to food they may be, and I know the homebound have to go through an assessment by case managers to get home delivered meals, but that is not meeting the needs of folks who are being discharged who do not always qualify as being homebound, but yet do not have access to food? There's been a medicalization of our social problems, hospitals, discharge planners I've, seen things of pantries off of Ers, so how we coordinating? How are we partnering with our health care facilities to address the nutritional needs of our of our community? Go ahead? Robert, yeah! Let me let me yeah. Let me share an experience I had two years ago when I went through my portfolio of health crises and my senior my aging health crisis, and when much to my surprise you know the discharge. Planner visits you at your bedside and what do you need in Yada and- and I have a perfectly good place to live? I have a son- I have this one I have House group and so on and so forth. So I was not in particular need, but she says well what about your food? I says you know I eat too much anyway and so on her own. She signed me up for a program under my Medicare, where I was entitled to free 14 days, food delivery, which was a massive amount of food because they would they sent two weekly packages for two or three meals a day, and this was no charge, and I says you know: is there going to be a? Is my premium going to go up, and my point is that there is that service through Medicare? In my case, it happened to be aetna, so I do not know if all of the carriers have the same service, but I would think it is, and you know part of her concern was that, regardless of what assurances I was giving her, I was still at that time, 75 years old and see she was, she was making sure, regardless of what how I, how I praised my son, how I praised my housekeeper, how I phrased the other one, they said no yeah we're going to cover you and no charge. I mean it was the shock of my life, not only that it was diabetic healthy food, because that's one of my issues, so no it was no salt. Of course, you can do what you wish once you get your food, but the food that was sent in was ample well- packaged you throw it in the fridge you throw it in the freezer and so that, while you're working with your person, that's going to be discharged and you're trying to get them into permanent services, that's only a one- shot deal by the way, because I try to subscribe on a regular basis and they only give it to you one time and I begged and the distributor and the planner was somewhere in Florida, and I called them I said: can I speak to your CEO and they transfer me to Oklahoma and I spoke to them says you know we're so happy that you're happy with what we did for you, but that was it, and I said what, if what, if you gave me a payment plan, would I pay myself? He says no? Okay, so not okay. So the point is yeah. Thank you. Thank you much! The while you're setting that person up for permanent, secure food delivery, look talk to your providers, your hospital social worker and see if the people that you're concerned with, if they're going to be or if they get offered. That's that very same service. That was right. So the program that you're talking about was offered through your Medicare advantage plan, and that is something that the government you know, gives them incentives to do these things and the goal is to keep you within the community and not for you to be readmitted. But there are certain, but there are folks who do not have access to those kind of programs, because they're either underinsured that they under the affordable care act. You do not get you know and you're in a commercial member. You do not get those types of benefits. If you are uninsured, you certainly do not get those benefits. If you're illegal, you do not get those benefits. So there's a multitude, so seniors in Medicare advantage. Plans definitely have an advantage so for programs that give them additional benefits. But again the you know. So when you talk about the underinsured and I'm sure, there's tons of folks who are going to be off of the commercial plants that will may or may not qualify for Medicaid all right, so this is looking forward. So I think there needs to be coordination, and it's not just for folks who are discharged. It's also for folks who go to the emergency room who go to their clinics, all right. What coordination do the agencies if godard gets involved or any other agency, gets involved with really partnering, with hospitals and health care facilities to help address needs of their patients? So since you've got, can I answer the question since you called out goddard? We work with 5,000 seniors when our seniors are discharged. We work with those seniors. We do not have the capacity to serve beyond that. You've identified, not a coordination issue, but a gap in services, and I 100 agree. There are not enough services for seniors if you're not associated with a program with the funding stream, there is no other there's no general safety net for people as they're being discharged, and I absolutely agree it's something. We've been looking at trying to address in the upper West side, but there's not everybody gets served. We do not have the capacity to go into a hospital and coordinate with discharge planning because we have three social workers. That's it serving one thousand. You know a really large group of people yeah. I want to explain Audrey Isaacs and I are on the Community Advisory Board for Mount Sinai West. That covers what was Saint Luke's and roosevelt. We're going to bring this topic up at our monthly meeting. I think was an excellent point. It was my understanding from previous experience with the hospitals that every person's being discharged had, regardless of ability to pay, had social worker arranged for these things, but it may not be so, and it certainly is imperative that we look into it. So I think we're going to address it to our local hospitals and systems and other health facilities that serve for rehab and other things. I think your point is excellent and thank you. Thank you very quickly. West side campaign against hunger has a new partnership with New York Presbyterian Hospital to address food insecurity through partnership with other community- based organizations where families patients who are being screened using the hunger, vital signs, screener and screen positive for food insecurity are referred to our program and they receive bi-, weekly distributions of robust, healthy food pantry boxes through a trusted community organization that they know. So that is a new, a fairly new partnership for West Side campaign against hunger, and I think it's a really exciting, really exciting investment that they're making in security. Great. Thank you. So I noticed that Charles may have to leave us shortly. We thank Charles very much for being with us. It is 8:50.. We have one more hand raised. So why do not we take that hand and then we'll go back to the committee for a vote on that resolution? Yes, so let me see this is Dan Tampkin, who I think I know who that is, but maybe I'm Mistaken Dan. Can you unmute and join us Dan Tampkin. You had your hand up. Okay, then, okay, Dan, I'm not sure I tried to. I pressed the ask to unmute Button. I think it's on your end now, okay, I do not know if we can then last call okay, I think we've got we're going to go back to the resolution. Okay, if Dan, if you can unmute in the meantime, let us know, but why do not you I'm going to give it back to the to the co- chairs of the meeting so I'll, just review what I said earlier and and then Shelley? If you have thoughts, if other people in the committee have thoughts of what to add, what I suggest doing is drawing the most recent data. The recent data from the report, which was published at the beginning of this month on October 5th and in establishing the facts as audrey, suggested and then supporting the recommendations that are in the report, which I relayed before we before we took comments earlier, and then we can also incorporate some of the some of the insights that the speaker speakers shared, for instance, about the importance of having long- term solutions, long- term planning and solutions that are not dependent on private donations or administrations or other factors that would make it unstable, keeping in mind the needs of different populations. There were many mentioned in the conversation also in the chat and Rosa has been taking minutes. So we can look at her minutes to see or the recording of this meeting to see if there's other things that we missed and then finally, we can also share it with with us the speakers and follow up with them to ask more questions about some of the specifics so yeah. I would say that the very important thing was the expansion of food policy, New York, City Food Policy department. Is it a department or is it a an agency? What is it right? Now? It's a it's. I think I believe it's like a it's a depart. It's a city department because to coordinate all these efforts together and all the agencies that are involved. I think, without that, we're going to it's going to be continue a piecemeal situation and in the long run it's not good in the short run it's necessary, but in the long run I think that would be necessary to put in do not. You think we need more facts rather than just develop more bureaucracy. Should we be more specific if we're going to have a resolution like that about what a food policy group should do in relation to the city rather than just say, grow the food policy group, and then you have all these other groups and all the other agencies. It sounds like bureaucracy, multiplying itself. I underst. I understand your point match and the arg. I think the argument made in the report to expand the mayor's office of food as the mayor's Office of food policy is that they provide it's. There needs to be one body that is, that is looking at how all the agencies work together and and to develop that in order to to look at things from a policy perspective, instead of just this ad hoc agents, separate agencies all do different things. So that's the point of expanding the office of food policy is to strengthen the policy making and the coordination in the city pam. I do not know if you want to add anything to that or match yeah. No, I think- and I think it's a really good point, because we do not want bureaucracy for the sake of bureaucracy at all, but I do think that the service providing organizations such as senior meals, you know, and all the service providing organizations. This would be something to oversee it, and I actually think you know I think, to bring together three of the last points that were made. Charles talked about food being a human right and that we need systemic change and then the idea from I think courtney about restaurants and how you can make coordination and how you can make sure you have discharge plans. Those are all those are exactly the kinds of things we want to be thinking. How can we do innovative services, and how can we find gaps in services and come up with a strategic overlying plan that is working for food security, Diet quality and public health and have that work together and that's what the that office should be doing is overseeing that and that office does not do it now? Well, it's just too small. It's yeah they're trying to do it, but it's and I wish I had the statistics. One of my colleagues has it, but it's like often two people in that office. Sometimes it's been as many as three, whereas, like smaller cities such as Denver, maybe one of them that has like five in their food policy office to create plans like that and do that, so it just it's, they do not have the capacity, they need more capacity, and it's not just a person power pam. It's also the fact that you know we have a mayor who and rightfully so believes that you should solve poverty first and that you know once you solve poverty, that food will. The food insecurity issues will be solved and it makes sense theoretically, but practically what do you do? In the 50 years? You try to solve hunger solve poverty with the people that are hungry, starving and food insecure, and I think that in the beginning of his administration he kind of gave a lot less power to the food policy office and did not expand it and did not act in a very progressive way. Now they did not even have enough coordinating power to deal with this pandemic and that's why they brought in Garcia to handle that because she has shown and did show that she could basically move mountains fast and cut through bureaucracy. So I think just to answer your question quickly. That office is a practical office, it's not a bureaucratic office. It's a practice office right so anyway. With that note, I want to go because my family is ready to kill me because I told her it was 45 minutes, I'm getting texts like you said 45 minutes to my daughter. Thank you very much. Thank you so much. Thank you. I'm going to take a quick moment of cheers privilege to say that we were doing really well in the chat, but it's starting to get a little political and a little heated, and I want to remind everybody to stay on topic please and to be kind to one another. This is an important way in which we talk to one another, I'm not going to shut it down, but I'm concerned that we honor what we started off talking about at the top of the meeting. So please, let's reel ourselves in a little bit and now I'm going to give it back to catherine and to shelly. Thank you other I'm sorry to interrupt you Shelley. I was just going to say other comments on the on the proposed resolution. Can I just say that the proposed resolution on food policy be specific? Not just we want to expand it. Let's talk about what we really want it to do. What the purpose is- and I do not know if we know that or our guests know that, but I think that general expansion for me is not a comfortable resolution, so I do not and the I do not. That would be one of the recommendations, but there was there is. There are a lot of other ideas that were suggested tonight, such as the the idea that you thought was really great about incorporating restaurants into a plan for providing or increasing the food supply and food access. There was also, I think we could ask for more specifics about what the food policy center the mayor's Office of food policy would do like what those tasks would be. Some other suggestions in that report were to both create and maintain a public data set food pantries soup kitchens and also provide emergency food providers with simple technology. So they can update their status, expand economic stimulus, support, focusing on small and independent food businesses, monitor program impact on diet, quality and address nutrition, related inequities, which occur because of income and race, develop food plans for future emergencies that include concrete steps to support high quality diets and ensure that all local state and federal benefit programs for workers are accessible to all food workers. And then I think there is a lot of great ideas that I'm I need to process when we read over the minutes around how to serve and meet the needs of particular populations so that they have access, for instance, making sure that people with disabilities that would have a hard time opening a can of tuna or not getting cans of tuna or making sure that there's quality kosher food available, and things like that. So maybe addressing the issue that courtney raised about safety of delivery people. So we can. I think we can get into more specifics, but the report that was published that was put together by people on the on the call their organizations provides the frameworks and like where we can start and also recent data, because the data that we have that's accessible is pre- covered and then also. I think that this is. This is a city- wide issue, so it would be great if we could produce something that we could then share with other community boards. So that's to raise awareness about what the issues are and what the experts are suggesting are the solutions I'd like to just add what came up about exiting from hospitalization that nutrition plan should be designed and delivered for an adequate amount of time for a person to adjust on exit from hospitalization or rehabilitation. I agree 100 other comments from the committee and and by the way, if people need to leave speakers, those that joined us. If you need to leave, we understand and we thank you yeah. Thank you, I'm going to sign out, but thank you very much for the opportunity have a good night. Thank you so much everyone. Others on the committee any addition to the recommended resolution. Okay, so in terms of process, I'm going to incorporate some of what I've learned in the DNS and I can draft and shelly, and I can draft something up and then share it with the committee. When should we vote on it before the big meeting mark? What do you recommend for process here? Well, it sounds like this might be an complicated one. The problem is, we can't really have a pre- meeting, because we already have a pre- meeting before the next full board. That's going to be the budget hearing, you could take a vote tonight on the framework subject to being fleshed out, but then there's always the concern that there's always the concern that you know there might be further edits, which you do not want to do at full board. So I think sharing it with the committee first and then finalizing it and then making sure it gets to the full board distribution and we'll try to get it up on the website or some other way to make sure the public can see it too. Before full board is the best you can do right now. I think so you're suggesting you're, suggesting that we vote on the framework now and then we share the resolution with time for people to provide feedback so that we're all on the same page with the text, that's as written before full board. Is that your suggestion with the first, with the further caveat that we want to get all of our resolutions visible to the community beyond the board before full board as well? Okay? So let's have this on the framework. Okay, so committee members- Robert, yes, I'm here, can you see me yeah? I see you clearly rosa who is it? I can't see everybody I'm here: okay, I'm typing: okay! Audrey! Have we lost audrey? Okay? Who am I missing? I'm having trouble matches voting? Yes, so you got mad Shelley Robert Catherine is five and laundry court. Courtney is audrey voting Courtney! Oh I'm! Sorry, hang on. We've got a comment in the in the in the chat. The public comment I just we just had was the opportunity to talk about this resolution, but it looks like there are people who still want to talk about it. So before we finalize the vote, let's make sure we've covered that off. I only see one hand: okay, let's have that person. So if anybody else wants in now's the time- and this is Deborah, salant or salant or assailant- I'm sorry- I'm mispronouncing- you look like you're unmuted, so I'm we're ready to hear you Deborah, salent or salon. Okay, catherine, there's a question in the chat. That's a fair question, which is what is the resolution? So if you could just briefly recap, yes, and also, I did not mean to say that other questions in the chat were not fair, I'm just sorry, I'm it's late and I'm speaking badly. Please go ahead. All that I wish we could read all and interpret all of the things that come through the chat, but it's really fast and it's a lot of comments and we're also having the conversation at the same time. So I appreciate Mark's highlighting this one because it is important. So there is a report that was recently produced by and I want to get it right in front of me called New York Food 2020.. It was published, October 5th and they kind of this report was produced by the Laurie Tisch Center for food education and policy. The director of that program is here: pamela, the Hunter College New York, City Food Policy center and the director of that program. Charles also presented tonight and a CUNY urban food Policy institute, and so they provide the most updated data about the extent of the problem of food insecurity and they also present about five or six recommended, both short and long term. Solutions for addressing problems of food insecurity, citywide so- and I read those out a few times, one of which would be to the first of which would be to empower the food policy center. But there was a few others that were listed all around providing more for the city to provide more planning around food policy and initiative so that there's full short and long- term solution. So we would support both the recommendations of the report and also add what was recommended tonight by the speakers and addressing the needs of particular populations, and so that's that would be the point of the red solution is to just raise awareness on both the extent of the problem and also support the recommended solutions. So we had, we did not hear from everyone, so I believe that audrey's off the call, if I just want to make sure this is correct- there's a yes from Shelly Madge, Robert, Catherine and Rosa. So that's five is courtney still on the call? No okay! No! I do not see her. We have a majority of Board of Committee members so to take forward approval. The framework of the resolution- okay, so Rosa is going to hang on. Let's take a vote of the non- committee board members yeah. Thank you. Absolutely many board members so Louisa. Okay. First of all, this has been a fantastic meeting. I so I learned so much. I think it was a very important meeting and I definitely support the framework that catherine has proposed. Okay, Excellent! Thank you, okay. Yes, I very much support the framework, and this has been a great meeting and just to see those photos that Kay put up are heartwarming and heartbreaking at the same time. Okay, do we have anyone else, a mark? Of course I vote yes with appreciation. What about K? Is he still here? I do not see him. I think he laughs, okay. So actually I now see another hand. We've already voted now, but let me promote to panelist Maria Danzalo Maria. We never could get Deborah salant unmuted Maria. Can you unmute yourself, I'm sorry that you did not raise your hand after we were voting, but we will still hear you. Oh hi. Thank you. I'm sorry, it's connecting to audio nope you're doing you're there go ahead, you're good! Thank you. Yes, I do not want to waste anybody's time. I know it's very late, but I do wanted to say quickly. Thank you very much for this meeting, something I have been attending every single community board meeting for months and months and have really been waiting for this issue to be brought to the front of the line. It's a hugely important issue. It's hugely important to all of us. On the West side, everyone in my community has been really concerned about this. We're also deeply concerned about the number of deaths in the community in congregate, nursing homes. This is another issue that I just want to mention to. The community is extremely important and needs to be put at the front of the line. Enough is enough: we've had an enormous amount of deaths in congregate, nursing homes. This has not been addressed. It has not been discussed. It has not been brought to the front of the line in community board seven. As far as this resolution is concerned, thank you very much. I appreciate the hard work I still actually do not understand and I'm following very closely and reading carefully. The idea of just I mean I heard on Ms Delazaro mention the framework and read some specific language, but I still do not see the language that is being proposed for the resolution. We want to make sure that this language is all inclusive and covers many of the important issues that many of us have been bringing to the front we've been trying to get attention on for a long time, so we'd like to see the language not just sort of here abroad, general, it's going to cover what people were discussing tonight. That's all very good. Everybody had some. You know the speakers were fantastic, but you know it would really be helpful if we had the you know specific language that we can look at and comment upon and again that's it. Thank you very much man. Just one other point. I'm sorry. Excuse me just one other point about goddard. This has been coming up over and over again, very interesting. That Goddard has a limitation of 5,000 seniors that they can serve. That's news. Maybe it's published. I missed it that there is a gap in services in terms of the seniors that are being provided yield. It would be great to kind of get more specific information from goddard as whether they are adequately funded to meet the needs of the seniors in the community. Right now and in terms of budgeting, we had you had that very long meeting the other night very contentious, meeting over budgeting, so I just wanted to make sure that the goddard issues and how Goddard is funded, how other so how other communities are other excuse me. Other service providers in the community are being funded that that's also in terms of food insecurity that is also getting to the front of the line. This food insecurity is astonishing to me that our numbers are up double since the beginning of the pandemic. This to me, is a urgent crisis of enormous proportions, so I just I want to respond to just two of those things hi. I just want to respond to two of those things. The first is that we will produce the resolution as soon as possible so that you can see the language what's tough for us is that, and most of us also work full time, but what's tough for us is that our meeting happens at the end of the month and the Community Board meeting happens at the start of the month, so we only have like a few days. So so we you know, we have to use information that we learn in these meetings and then turn it around really fast. So we'll do that as soon as possible. If you want to provide your email address in the chat, I can follow up with you and we can take talk more. The other piece about the congregate nursing homes is a really important one, and it's one that we listed on the budget priorities. We asked for the city to provide funding to nursing homes to provide more rapid tests for staff, because there is, there is high cases, high numbers of Covid-19 deaths and shelters, I mean and not in shelters and nursing homes in our district, and we had a public health researcher work with us to kind of investigate the source of the problem, her name's aggie Tang and she found and she kind of identified what the city is reporting as a source of the problem and it's one source, maybe lack of testing for staff and access to tests, because they're also expensive. So that is listed on our budget priorities and those will be published soon on the website as well. Okay, thank you and I'll. Tell you my email separately. I do not really want to put it on the chat, but thank you oh right. Yes, but you can. I think you can write. I have your email. Is it okay? If I share it with catherine, absolutely, okay yeah, you can also. You can also always write to us privately on the chat. Oh okay, oh I did not know that no catherine I'm starting up there. There is when you write privately on the chat. Only the person in the meeting can see it, but then, when you download and record and print out the chat everything all of it's there, so, okay, it's a false, it's a false privacy. So I would not recommend that okay, so thank you. So the vote on the framework was five zero for the board for the committee members for the board members who are not on the committee three zero and we'll take that forward and we'll formulate the full resolution and get it up there as soon as possible: okay, okay. So the next item on so thank you to everyone for participating in this thanks to everyone for being here, we're really glad to have you with us and have your contributions. So what I? What I want to talk about next is our plan for future meetings, drawing from our research on the district needs statement and the budget priority, the district needs statement we're still finalizing. I, the what I suggested to the committee are that we based on what's come up is that next month we focus on learning about services and options for meeting the needs of people experiencing street homelessness in our district. So that would be for the November meeting and then for the December meeting. I've been talking with the New York City alliance against sexual assaults and about potentially organizing a meeting with them and with safe horizon around best practices. For responding to children who have experienced sexual abuse and assaults in clinical settings, so there are some city- wide initiatives to provide training and certification for nurses, doctors and physician assistants to respond when people enter hospitals or care centers and go through the process of with rape kits and that kind of thing there's also a need for psychiatric services for children, who've experienced sexual abuse and assault and trauma. So what we'd like to do for the December meeting is meet earlier in the month, potentially, hopefully, the first week of the month is what they've suggested as ideal time for hospitals to be able to given hospital schedules in their budgeting process, and that gives us time to plan with the New York City alliance against sexual assault and safe horizon as well. So that would be a conversation with hospitals and other health care providers. Those have a problem because of the end of the month being holiday season. So exactly yes exactly and then in January. I want to follow up on Rosa's ongoing research, which has been extensive to address, to find ways to address economic and racial health disparities in our district. That also will require planning and research for us to put that together, so that would be in January, and all of this would also take into account the current economic crisis and Covid-19 crisis, so we're looking at these issues from within that context. Does the committee have suggestions for other issues that we can plan for in 2000, so this would be through January 2021 other issues yeah we're trying to come up with a whole year's plan, yeah one of the priorities to first to the coming from our district needs statement, research and the priorities we've given. So if people have preference for a certain topic, we certainly will try to honor that any thoughts, I'm going to wager that the thought is that it's 9:20. okay. So what I suggest is committee members. If you look over, you know some of what we've done and things that you've been involved with are interested in to send Katherine and myself your suggestions and we'll build on them and try to fill out the year with a plan. Okay, it's getting real late, it's getting real late! We did talk about having open a public comment. Do you want to do just like, maybe 10 minutes of that and then call it a night yeah? I think 9:30 is really our deadlines, my witching hour, all right, so two attendees. If you want to be heard on anything, we'll take, maybe four additional folks. We have not heard from already. Please raise your hand now, or maybe it's 9:20 for you as well. Okay! Well, it does not look like we're, looks like everybody's ready to call it a night. Okay. We thank everybody for joining us. Thank you, shelly and catherine for a fantastic meeting and a wonderful panel, and we look forward to hearing from folks about all sorts of issues next week at full board. That's going to be a late one, so everybody come with a sandwich and- and your and your I do not know, I can't complete it. It's that late. Forgive me, but thank you all very much mark. Thank you so much for making it possible for us to have these meetings and hold on. We have one more person, I'm sorry, America Erica spoke already once, but we'll real quickly, Erica, because we're winding down here, there's actually an accident. I was scrolling through the chat, but I would note that there are many people who are very frustrated and I would applaud them for having, for the most part, held their tongues. There are so many people who feel that there's a backward nature to all of this. That resolutions are given without time to look at them without time to study anything. I asked catherine, who just extended her time else about a different topic but she's, not she so I followed up on it and then she said I actually have no time for several weeks. So I do not know how you have time for hunger, but not time to discuss the other issues. I asked you for research, you won't share it with me, so you know. I've been well behaved on all of these calls. I think I'm not going to take it any further, but I know that there is going to be tremendous pent- up anger, frustration and these are real people who are not trolls, who, I hope you will all take very seriously. I hope there will be more information ahead of time so that we can come prepared and see what resolutions will be voted on, and I hope that community members will maintain an open mind about what are really the needs of this community and if we can not serve the needs that we have already promised real needs real hunger insecurity, crumbling infrastructure in housing, then we should not be committing additional funds to new projects, including capital investments that then have additional long- term consequences where we have to fund all the services. So I'm not going to take up any more time. I actually clicked on it by accident, but I hope you guys are prepared and please take people seriously. They care about the humanity in this neighborhood. They care about this neighborhood. They care about the Community, Board and they're, really trying to make a difference and feel like they're butting, their heads against the wall, so I'll leave it at that, and I wish you all good night. Thank you. Just one comment on your res on resolutions. Very often, resolutions come out of a process of discussion and information learned at a meeting and it's hard and although a lot of the most important catherine outlined a lot of the most important parts, we made it a framework because to have a substantial resolution that we can stand by, we need time to formulate it. Occasionally we can put together a resolution before and then flesh it out, but I appreciate that, but I mean in my experience on boards, the resolution is put up on a screen either in person or on or on the screens here, so that people can at least see the draft resolution and then have a more meaningful discussion. I could not possibly have held all those details in my head and I can't imagine you guys could either so. I would really encourage at least draft resolutions and having them pre- circulated to other people as well. I tried to be productive. I went on the on the website today, but things are not updated. I do not know whose responsibility that is, but things are not available, so I think it's. I think it's important to note that we do the best that we can with the limited time and resources that we have so this resolution needed to come out of this meeting. We have days to prepare it for our next meeting, and so it's constructive suggestions are great but nothing but as we do have limitations, and so we appreciate we appreciate suggestions and we certainly are all trying our best. So thanks to everyone and for being here for everything that was shared and thanks so much to mark and to the committee- and I suggest, a motion to adjourn motion to adjourn all in favor does not appear to be in the objective. Thank you. Everybody be well take care, see you next week, bye.",
            "summary": "Thank you very much I'll shut up now by the way Matt has joined us since she did a yeoman's job of focusing on food insecurity for our research, for our district needs statement and before catherine, because I want to say, she's done an amazing job, pulling it all together and working with everybody all along and bringing this together tonight on our number one priority.\nThe goal is for us to kind of identify where we can assist or support their efforts in reducing food insecurity, and then we'll hear questions from the community.\nOur organization has been around for over 40 years on the upper West side, we're in the basement of the Saint Paul and St Andrew Church on the corner of West, 86Th and Broadway, and that has been our historical home for the last 40 years and within that space we've served thousands of households of new yorkers from all five boroughs, and in that space was developed, our supermarket style customer choice model for of what a food pantry looks: like.\nWe saw Anita in the community, but what they then started seeing was folks trading items out on the sidewalk, so I actually do not like tuna, but I love, peanut butter and in seeing that exchange, recognize that how can we bring more dignity to the experience of accessing a food pantry and incorporate choice in that in the experience?\nWhat we are really proud of is showing up during one of the most challenging times in all of our in of all new Yorkers lives and making sure that they had access to healthy, fresh food for to feed their families.\nBut when things shut, down, people were shut off from the food that we provide through our through our stake of centers, our senior centers, our after-school programs, and there were sudden with the cleaning out of the shelves in many stores.\nPeople had a demonstration at the precinct, not long ago, but just as an example in Amsterdam houses, which is a public housing development at the kind of southern end of the Community Board western beef no longer does deliveries, and so for some of our older adults who can't drag a heavy cart back from the store or families who are that are you know that may have a large household.\nI. Think the issue with all public benefits has been trying to access in a pandemic when even public servants are working remotely has made things a little bit more difficult and even in if a case is cut off , it's just harder to get benefits because of the the fact that everything is being done virtually and not everybody has internet access to be able to to do.\nLincoln's center did a couple of food distribution, days, and Is really helpful, and you never know where the word is going to land when you send it.\nSo we were able to with the 12 food schemes that we had already prepared and with a lot of work, create 59, neighborhood food resource guides and with the help of places like hunger, free America, share, meals.\nAll of these groups come together and contribute their data in including on city harvest, which was incredibly helpful and instrumental and the founder of share meals who basically provided all the back-end technology.\nSo we operated all this data And then we updated every single day We created an army of volunteers that are going out, they're staying at home and and using the telephone to call all these facilities, and we update this every single day It's also updated from data that comes in from the city, from city harvest and from a variety of other sources, and especially the soup, the food Pantry data.\nSo, that's kind of some of the things we've been working on Then we were fortunate to be contacted by Dr, Pam Cook and who was on this call and her organization, and the objective was to do research and look at the impact of cobra 19 on the food system in New, York, City and regional food system from an institutional perspective and a community perspective.\nWe were discussing this that when a food pantry closes, even if it's in the basement of a church and may not serve thousands of people, it's still incredibly relevant because an undocumented person might be going to that and feel most comfortable.\nWe people were not wearing masks and infection rates were incredibly high in New York City, that people can go to a resource or make a phone call and be able to determine if a food pantry was open or closed or if they're, a senior and very vulnerable, and not wanting to leave at all where they can get home delivered and so part of our research has shown that information is critical and there was there's really a lack of it in the city of New, York.\nThat, that's long-term and sustainable and that you know, food pantry closings were primarily in underserved communities, ironically right, which was something that we showed in our research Lastly.\nIt's city state , it's a national, the federal city and state that needs to really focus on solving and working on poverty and food and security issues that it's really hard for charity to make a huge debt-You know from hunger for America Was a leader in the underspace, and he said you know that, for instance, the the Ebt cards that were given to every New York City student, those ebt cards.\nThat said, hey, I, think the three of you should work together to actually evaluate this, because so much money is being put into by government and by foundations to basically get food out to people and if we do not really try to capture what's working and what's not It's a completely lost opportunity, because we can't grow and learn from this experience to be better prepared for the future when we're not in a crisis mode and also for future crises.\nFood policy office: We need a much stronger food policy office that can oversee helping with food security, helping with diet, quality, helping food, retail and restaurants to be able to stay in business and keep the heart of what our city has and helping to understand food workers and making sure that they are cared for.\nAt a time when we really needed it, it's actually now been approved for another year, so How it's going to roll out in New York City is not quite clear with what's going on now, but this is a program that we want to support.\nIt could then buy food with it, the way that they were supposed to and then make a donation to something like the West side campaign against hunger or another group in their community.\nI-want to end with saying what we normally do when it is not Covid-19 and that is working with all of the organizations that work with school children around food and nutrition and supporting school meals and there's.\nI know a lot of the organizations are working with the schools that are in your account, your district, your community board, sorry, So we want to keep that happening, and a lot of those organizations are continuing to do education, whether it's remotely.\nWe combined with other churches and synagogues in the neighborhood and eventually created a super, a supermarket style pantry, as you can see where people could come and receive healthy food and receive it with dignity and be treated with dignity and also receive help in other areas of their lives.\nAgain, even if we have to mortgage the church, which we actually did at one point, so that that has led to a dependability where people know If, they come here, they will find not only an abundance of food, but fresh food and a good attitude towards them, We also did not want to just supply.\nWe wanted to make it so people did not need to come to a food pantry for food, and so we started a couple of different job training programs, including the culinary training program, which you see here.\nHere, But throughout the city gives you an idea of what things look like currently And, then the last thing, as I'm sure Stephanie, told you we're serving people, not only we already had about 20 satellite sites throughout the Bronx upper Manhattan, but since Covid-19 we've that has grown exponentially And we've taken on partners like New York, Presbyterian Hospital make the road New York and quite a number of other sites where we've been able to sort pack and deliver food to those sites, and that's that's kind of the snapshot of what I got.\nLet me start by just suggesting to the committee that-And. Maybe Shelley can build on this and the committee members too, in terms of ideas that we write a resolution in support of what's needed and also the recommendations that are outlined in the New York Food 2020 report, which was produced by Hunter College New, York, City, Food policy center, where Charles is from in the Lori Tish Center for food education and policy where pam is from and the CUNY urban Food Policy institute.\nThe second was for users create and man maintain a public data set of all food, pantries soup kitchens and other emergency food resources, and also for the city to provide simple technologies for emergency food providers to easily update their status, to expand economic stimulus, support, focusing on small and independent food businesses that women people of color and immigrants own, and operate to monitor, retail, institutional food and emergency food, programs, impact on diet, quality and address nutrition.\nBut I just wanted to throw out that the possibility of writing a resolution in support and I'm going to hand it over to shelly, Then I'm going to call on the committee members in alphabetical, order, And, I'm, sure everyone hearing it appreciated the terrific work that's been done by each group to provide food and to analyze the situation, to enable better things to happen.\nI have two questions which do not have to be elaborated on too much, but I want to focus on your experience in terms of seniors and their particular needs during this time and how they've been addressed.\nI think there were quite a few people of great goodwill trying to do the best they could, but without the organizational capacity you know.\nThe first set of deliverers were sent out without routing sheets and I think that some of the solutions have been as frustrating to seniors as the as the bottom line issue and many seniors have tried to just make their own arrangements, where they're able to so I'd like to share some information, because I was deeply involved with this, because we found that the city insisted that senior centers were going to handle the senior meals and you had to be a part of the senior center.\nI think some of the grocery shopping services require that people have a credit card and many of the older adults particularly do not and just wanted to add one quick, thing.\nI think that all the things you're saying you know we found in other communities as well in our report and our research, and you know what concerns me is that these are ad hoc, measures, meaning if the city does not come up.\nI, think that's incredibly helpful and and that it's that there's not just a system in place, but that it actually works and people are able to open their food and access.\nWe always knew that there could be a pandemic that would allow have everyone stay in, and so that is again why we need a really strong office of Food Policy , mayor's Office of food policy to have plans in place for that, so that it is about the quality of the food, and you know, especially when so many of these programs end up being long-term, If you're getting food to people for a week after a storm, it just get people food, so they can eat.\nIt would work with difta and the senior meals and the Department of Education's office of food and nutrition, services.\nDo not think everyone necessarily relies on what the city agency is going to do, because you do it yourself and just not to take up too much time, but in my building, where we were struggling on the community board with expanding the nork program.\nSo I just want to provide a quick fact because there's been questions about this, which has to do with numbers of people who are food insecure on the upper West side in our district.\nI have some personal experience, having helped some seniors with the get food and white program and by the way, I do, I did see first hand.\nI, think one of the problems is information and education and everyone who can help them that way, including Community Board, is substantial because most people I speak to, I did not know- It has been very confusing and just to clarify home, delivered Meals is an ongoing program.\nThink it just points to the fact that I know people say we have to stay on topic, but I believe it is on top to talk about budgeting because it starts with street safety.\nThere are people above the official poverty line who are still facing food insecurity, so that number, I'm sure, is greater, and we have to think about the realities that our budget is not growing.\nIf a food pantry has to close and can't serve that last person, that's a big problem and we can't fail to deliver on things that we've already promised to our community.\nIf you can talk about what that gap is going to mean and what it's going to look like, if we can't allocate a larger percent of whatever pot we have next year to food, insecurity, I just wanted to say one quick thing before you started, sorry that on the numbers that were given from this food stamp, of course, they're pre-code numbers, we do not have the customers.\nI think that one of the things that you know becomes so important is who your local politicians are and how they're going to be voting in the City Council.\nI think that the city council really recognized the importance of food and try not to completely wipe out some of the budgets this year.\nWhat, the federal government does what government como does and who we elect as our next mayor and do they understand the importance of food in our community and in our communities, and also you know the City Council members, I think , there's a huge amount of city council change coming up.\nYou know as food advocates all the time, but I'm not so sure that everybody kind of hears this language.\nI have a bunch of questions that I guess I'll dig into the data later it looks like John is a part of the community who's, a data driven person, but my question is really around: How are we working or are we working together with the department of information, technology, communications in the city and all of their smart city, Initiatives to tie the people that need food to the systems, to the restaurants and to potentially public and private partnerships?\nWe have people that are, you know able to deliver the food.\nI know they did that with caterings city put out an RFP and a lot of caterers Were providing meals for seniors and delivery programs and have they been successes for the restaurants?\nYou, know programs and actually giving people the opportunity to donate money when they order food and to me that would be.\nDo you coordinate to make sure that folks who are being discharged have access to food they may be, And I know the homebound have to go through an assessment by case managers to get home delivered meals?\nI said: can I speak to your CEO and they transfer me to Oklahoma The, while you're setting that person up for permanent, secure food, delivery, look talk to your providers, your hospital social worker and see if the people that you're concerned with, if they're going to be or if they get offered.\nCharles, talked about food being a human right and that we need systemic change and then the idea from I think courtney about restaurants and how you can make coordination and how you can make sure you have discharge plans.\nTry to solve hunger solve poverty with the people that are hungry, starving and food, insecure, and I think that in the beginning of his administration, he kind of gave a lot less power to the food policy office and did not expand it and did not act in a very progressive way.\nAnd, then I think there is a lot of great ideas that I'm I need to process when we read over the minutes around how to serve and meet the needs of particular populations so that they have access, for instance, making sure That people with disabilities.\nI think we can get into more specifics, but the report that was published that was put together by people on the on the call their organizations provides the frameworks and like where we can start and also recent data, because the data that we have that's accessible is pre-covered and then also.\nOther service providers in the community are being funded that that's also in terms of food insecurity that is also getting to the front of the line."
        }
    }
}