{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCIlZuhawe3QWwxbglYpZMmg",
            "title": "Youth and Education Committee",
            "publishDate": "2020-10-07",
            "shortDescription": "",
            "lengthSeconds": "1:15:55"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "BzHWhvVbI4g",
            "fillerWordCount": {
                "uh": 34,
                "um": 189
            },
            "readTimeFullTranscript": "37 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "school": 32,
                "parent": 24,
                "children": 21,
                "parents": 17,
                "control": 17,
                "information": 15,
                "education": 14,
                "learning": 13,
                "schools": 13,
                "leadership": 13
            },
            "wordCountSummary": {
                "school": 5,
                "opportunity": 3,
                "education": 3,
                "communities": 3,
                "control": 3,
                "schools": 3,
                "parent": 3,
                "learning": 2,
                "president": 2,
                "children": 2
            },
            "fullTranscript": "Hi everyone Miss Wetterburn, sent me the agenda for tonight, I'm going to share my screen so that you can see it if at all possible, please screenshot it so you can have it available. So I can stop sharing the screen, as I have to toggle back and forth between Webex and Youtube to ensure that the stream is continuing. Okay, so I've seen that look before hi can someone respond and let me know if you can see the screen, please we can see the screen. Okay, do you see the youth and education agenda in totality? Oh yeah, yes in totality, okay, thank you. I'm going to try to take a screenshot or something and share it in the chat. I would love to get off of shared screen, so I can continue toggling back and forth between the Youtube live stream, live stream, where's mute, oh god, hello, Sharon, hello, Julia, hello! Let me see hey so louie good evening. Everyone, may I ask, since we do not have the opportunity to see one another, that we unmask ourselves and since we're fairly civilized as much of an opportunity, as you have will be to unmute yourself, because there's a lot in this agenda, although it seems really simple, so I just wanted to take the opportunity to welcome everyone to what is the October meeting of the youth and Education committee and that other people will be joining us, and this is the part of the the meeting where I introduce myself and welcome everybody to this meeting. There are a couple of names that I do not recognize: Ms hyatt. I have not seen what I mean before I do not think. Would you briefly introduce yourself? Yes, if you, if you can just give me a minute, come back to me because someone's watching TV and I need to put in my headphones okay, so everybody? How are we doing? How many of us have are having children, grandchildren, nieces, Nephews that and hybrid learning, as opposed to remote learning exclusively? Can you give me a feel for how that process was for you? I have two grandchildren who are doing remote learning exclusively remote. I believe so no one of them is actually going into the school at some times. That is a 3-K. No pre- k child and the other child is a third grader he's doing exclusively remote, and you know it's very interesting how people make decisions when people ask me over the summer what should they choose and, of course, it's everyone's personal opinion as to what will be best for their child, but one of the things that was very interesting is that if you elected for remote learning exclusively, you would not be able to elect back into classroom learning on a quarterly basis and as we're now seeing we're having hot spots, one zip code that is coming up, that's in community board. Eight is one two one three, so knowing that one two one three is on the watch list we might have all of our students go to remote learning involuntarily. So that's ridiculous. You know- and it's not even ridiculous, but there are a lot of behind the scenes decision making that neither reflected the community or the neither reflected the community or the parent voice in the decision making. So those are some of the things that I will talk to you guys about later on in the agenda. So for those of you who are not present for the August meeting. Actually one of the announcements that was being that had been made is that I will be taking a leave of absence for the Community Board through the, but given that I have unique knowledge and special relationships, I will be working manner with our committee secretary, Marva, Henry and also with Nora Daniels, neither of whom are present right now and which, but I know, they'll be joining the meeting later and just you know just to talk about things desmond. You talked about and there's another concern. That's come up as well, too, with respect to remote learning and how our schools that have requested outdoor learning, how those requests have been funneled, so Miss hyatt. I see you with your headphones in. If you would unmute yourself and introduce that introduce ourselves to the collective group, I would greatly appreciate it hi good day, and I just attending the meetings here at community. I do not know if it's me or if it's you I might be having slow resolution. I might actually have to go, because this seems to be a popular time on my internet service, and I know I see the slowing down of my functionality so may ask you to start again and then after you speak, I'm actually going to go dark screen to make sure that I have as much okay, I, yes, I am on Saint John's between Troy and Albany, and I just started to join a lot of the meetings for Community Board eight. Actually I just found out about a community board. I've been part of the community for 55 years, but for 31 of those years I've been in the air force. I am still in the air force I'll retire in two years, but I wanted to regain the Block Association that was here years ago, and I was told that, in order to do that, you know I should become a part of the board of the community eight board, and so I have applied to become a board member or what have you? Those things are done. I think in January whenever, but I will attend. I have attended the meetings I started with the meeting the land use meeting last week. I attended another meeting, so I just it's important to be a part of the community as a whole. You know not just live on the block and do what I need to do for my blog, but to understand how this community is working and what how things are being allowed to be done. Thank you for that very much true. Once you start once you start attending community board meetings or become a member of the community board, you no longer look at the happenings in your community through civilian eyes. You understand what's wrong with how it is that yourself. So thank you. So much and with that I see, Miss Atkinson has joined us and she's a new community board member and therefore a new committee member Ms Atkinson. Could you tell us a little bit about why you wanted to join this committee and what nudged you along to make an application for the Community Board? Okay, actually, what made me decide to join was there was an issue going on in kingsborough where they did not have any hot water did not have any heat over the winter time and no one. Actually, I was on the news because of it, because no one was actually talking about it and it was going for weeks- and this was not just like one walk. It was like in the whole entire housing thing. No one was given any quiet answers, and so I decided to call and actually and call the Community Board and ask: could they call and reach out to somebody, because it's ridiculous, you know you have seniors and you have kids, that's not being able to take showers, and things like that. So I made the I made the call and then one of my co- workers, because I worked for the city said: why do not you apply and he was like you're wonderful. You know I was like, let's see, because this is I'm an advocate so they're like. Why do not you try so I applied, and then I got the email that I was actually accepted. Also why I'm in the youth in education is that I am a former educator. I also was a trainer for NYPD for 14 years. I'm also a PTA president for one of the local schools. That's actually up the block from the Community Board office, I'm also their school leadership team chairman. So I'm heavily into my daughter's school they're, the new junior high school in the district. So I was recruited to be one of the first parents. My daughter would be one of the first graduating kids, so I'm very into the education, and I used to be as what do you call them when I was when it was an education assistant for a public school in district 17 and before I decided to change over into law enforcement. So that's why so Ms Atkinson welcome one of the hot button issues right now going on in terms of representation. Citywide is the role of the slt and the DOT and I'll fill you guys on in a lot of about this. I've been in a lot of meetings this week and I wanted to share a couple of things: we'll share quite a few things and give everybody some tools. Nora. I see that you've just joined us, and I told the assembled body that I had been taking. I've had conversations with people individually that I was in the process of taking a leave of absence and that we would work collaboratively myself, you and marva to keep the committee running and since there's so much stuff happening. I just took it upon myself to lead this agenda because there's so many multiple sources of information and one of the things that I also hope to do. One of my accomplishments for this meeting was to be able to help everybody see where they can find interesting information and point out some things that directly have an effect upon us. So with I'm doing on time, everybody am I where I'm supposed to be on the agenda. Okay, so you know a little bit of what's going on good, I'm still on time for the agenda, so a lot of things are happening in terms of the opening of schools, and there are a couple of bodies that have meetings that that you will gain a lot of information. One is the Education Council Consortium and they met last Saturday. That group is comprised of the president of all 32 community education councils plus the members of the city- wide organizations, and they have a few alumni members and one of the things that you know we see that is somewhat chaotic, has been the school reopening process and it's uneven in districts. Some districts seem to be having less forgetting us and there's the absence of communication and was particularly concerned about children that are in temporary housing in terms of their access to be able to access for internet, so they can access remote learning as well as how devices are being distributed as well as how their parents are being communicated with so Julia. I know you're on the line. Can you help me show, so I can share some information on the screen, because I went to some specific places that I wanted everybody to know where they could go to information. What exactly do you need? My assistance with? I do not know how to screens darling. Oh I'm sorry give me one. Second, I'm just waiting for the noise to pass okay. So if you go at the top of your screen, you'll see Cisco Webex Meeting info hide Menu bar underneath that is the Menu panel. If you go to share you, I did share contents and it was able to share the Microsoft word file that I had open, but I also had like four others open and shared all of them, which is not, which is not working, I'm sorry! No, which is not what you had attended so share content. So I'm going to share because it's in my website guys to be an expert it's there. So, let's see, what are you trying to share exactly pray tell so I want to show where to go to on the schools.nyc.gov website. Okay, if you go to share, go to share web browser and then that should that should pull up the the web page that you're looking at, and you can also copy and paste copy and paste the address link into the chat that way, everyone else will be able to copy and paste it into the browser and open it up as well. Perfect. Why y' all trying to act like I'm, like technologically advanced, I'm going to put the link into the chat and- and I apologize oh no I'd like to do you guys happy than I am so the first one I do not know if everybody has access is actually the page from www.schools.newyorkcity.gov and it's about the parent educational panel and parent Education panel replays what had been the board of education before mayoral control and the reason is pep meetings. But you know if you want to understand, what's going on, you really have to hey, not sure if you know that your screen is not being shared, I'm not sure if you're know that or not thank you for that. So I'm sorry, let's see share content. All right, I'm follow up. I see examples. Yep, that's the only way we can do it so in the contracts meeting, August, 19, 2020 and I'm bring up very choppy me. Yes, your bandwidth is really low. I do not know if you turn off your video if you'll still be able to share your screen, but I do know that in times past, turning off the video capabilities has actually increased. The sound quality of participants. Sorry guys see. I have all of these, because I wanted to show you. So let me turn off my screen. Yeah, that's not working for me all right, I feel like we should have some it's true, I'm going to stop sharing. Let's see, if that's going to help, I try technology's, not working for me. Let me turn Miss White burn. If you can, if you can email it to me, I can I can try to see what it is that you're sharing and see if I can't like drop it into the chat or share it in some way. It might be me because you know this is what happened, but I can't be myself so, as I said and having so, there are a couple of things that I want everybody to be one. There have been challenges about how things are, how information has been disseminated, and I would say, the leadership team from the Department of Education has been very clear as to what the instruction has been or what the process should be and we're. Where we're seeing deficiencies comes at the local level, superintendents and school building leaders aka principals, some districts are stronger than others miss atkinson. It's awesome that you're in district 16, because with that new leadership, they're pretty much on top of it. Just as you know, you have an awesome principle and the fact that you've taken a leadership role in a school leadership team I'd. You know like to be able to send out documents to everyone, but there's new guidance to the field about school leadership teams. Part of it is that they're, a minimum of 10 members and all of those members should be elected, not hand- picked by the principal. In other words, you want to have people that your peer group sees as being valuable and contributing to the conversation, and that sounds boring, but school leadership team fits into the district leadership team and they're the ones that really monitor what the comprehensive education plan is for the district and here's how that is shown to be deficient. If we do not have a plan, as district 17 was in the process of developing their plan over the summer, so that it could cover the previous school year, and now we have a new kind of year. Do we really know how things are going forward? District 16 and district 17 have a high preponderance of title 1 schools as title 1 schools. They are qualified to have highly qualified instructors, given what the memorandum of understanding was for the Uft I.E, the uft, the Teachers Union said that in covit we do not have any contractual responsibilities. So the Department of Education, the mayor, made an agreement with the union as to what is or who shall be teaching and ratios in terms of the number of people that are going to be in the school. One of the things that's very important in the memorandum of agreement and they talk about programs operational, grievance processes, but paraprofessionals, which is the eighth item on the list and I'll share this document. With everyone later paraprofessional classroom manager, the DOE will post the position of a paraprofessional classroom manager. The paraprofessional classroom manager receive a per term stipend of one thousand seven hundred and fifty dollars to perform this week. Among those professionals that apply, priority will be given to those already accepted into the lead teacher assistant pool, but have not been selected for an Lta position. So why is this important in title 1 districts right? These persons are not certified in districts like 17, where there is a deficiency of qualified teachers period, much less qualified teachers. How is this going to affect the learning environments for the children? So I know I talked a lot. Can I ask anyone what do people think about this talk to me? People, I'm going to say that I'm kind of I understand what's going on? I understand what you're saying I think I'm my daughter's school is just a little bit lucky because they were a brand new school and they did not have that many teachers, so they just added a bunch of teachers on and all of them are very well qualified. So I do not honestly think we're a little blessed with that and yes, I used to work at district 17 many years ago. So it's weird to hear now that they do not have that many, because at that time they were actually when I worked there's been years over 15 years, but when I worked there they did they had more than enough teachers. So that was just interesting to hear that now they do not have enough experience and teachers like that exactly so, even with with the so the so one of the things that you're seeing is that you see the teachers. Union has come forth with a resolute memorandum. The principles Union has come forth with a resolution which the resolution said. They had no confidence in the mayor and they would invite state control over our schools. Anybody would tell me about what the ramifications are and I'm going to put desmond on the spot here. Desmond state control state control is onerous because, basically, what it does is it takes away the ability of the parents and also the administration within the district. It basically strips the control or the tools and the curriculum out of their hands, and then they make judgments about how and when people will be tested. And then they also make decisions about the type of staffing that you'll have, and that can be very disastrous, because if you have people who have developed good relationships, working relationships and the ability to structure, curriculum teaching plans and and know their population, that's something that gets overlooked. The fact that, if you're working in a community over a period of time there's a continuum of families and children, and so people begin to have confidence in you and you have a ready- made pathway to get certain things done. It makes life easier on meeting the needs of the school body, meaning the product which are the children and then there's also the politics, and then they basically, if they can remove the community involvement, then that's just what they've done and you'll find that you they'll give. Somebody will be feeding you something and you won't have any choice in how it's going to be given to you at what quantity and what it's going to taste like that's kind of a an analogy, but in the long run, typically people come out losing when you have being taken over by a larger entity, meaning and particularly and historically undisturbed, communities as I would deem brownstone Brooklyn central Brooklyn. It would be particularly disadvantaged so baked into I'm glad. You mentioned the mayor right but baked into it. I'm going to. I had hoped that I was going to be able to share the screen screens with you, but there are several chancellors regulations that speak to parent participation in some community participation, so I'm just going to mention them so that you know where we should have input as parents and as community members right. So the regulations include A185 185, which is zoning, A190 school utilization, and that comes into play with the co- location of charters and such right A655 school leadership, particularly the school leadership, team Slt and the district leadership team DOTs in district 17. There was a challenge. Recently the superintendent was erroneous. It had the erroneous belief that the only parent that should be at the table would be the president of the cec and after several levels of discussion, he sent a email out that informed that all members of the cec were welcome to attend the DOT meetings. But that was an unnecessary fight and I think that inhibits our ability to make progress in terms of curricular and the comprehensive educational plan, my editorial other things that parent engagement is not is it's required, are the school- based budgets, which is school leadership, team responsibility, the d120, which is ethics, codes for parent and slt and then there's a whole modicum. I would say, of alphabet soup, the D140 150,116 170, which addresses Cec and citywide parent representation bodies, so that will be part of the follow- up marvin and I will collaborate on that. Just so, you guys have a reference for that, so I'm going to pivot a little bit and talk about the hot button issues that we need to look for in the next few weeks. One is how do what do we do about attendance? You know what is the attendance policy in the time of Covid-19 and the attendance power by the principles and the principals must share that with the school communities in the next month and it's complicated, but each school should have policies for the elementary Middle, School and high school. When the state looks at the district, they look at the whole district, meaning all of New York City. So it's incumbent upon us that are in our different Silos, 13:16 and 17 that we support the efforts of the cec to be able to have this information. Also, what we do not have any clarity about is curriculum and grading policy. What are our children being graded on? What are they being taught? So that's a conversation right recently. This cec excuse me the ecc had a meeting with Michael Mulgrew and they continue to be engaged in that conversation. Another hot button item reasons I was pointing you to the tracks is yes: who's, Michael Mugral, I'm sorry, Michael Mueller is the president of uft. Okay, thank you. Sorry testing for Covid-19, because you know that children should are going to be tested and there's a whole permissions policy, but the vendor that was selected to do. The testing is a genetics company who intends to keep the samples so there's going to be more discussion about this, because one of the questions is: why can't I, as a parent at least you're shaking your head, you see what I'm talking about. Why we have to be. You know vigilant in all of this. Why can't a parent have their child tested by their own doctor and be certified? So you know they say this is what we're going to do and we have to say this is what's not going to happen right and it's like. Why do you want to keep samples? You know and you and you can see how that's been misused and abused from henrietta lacked to the tuskegee experiment? It just makes you know, raises the hackles. So that's going to be a problem, that's scary, right, so scary, so you know. I hope that all of us that have little ones that are near and dear to us and not so little ones that are near dear to us that we become our advocates and all of that in that process. So excuse me, I guess my only concern would be assistance for those that do not have a doctor or those that are. You know that say that there are unable to get that test. You know that you know we as parents that are coming to these meetings. We, you know, have that ability or you know, but for there are quite a few that may not, and yes, I'm not agreeing that they should be keeping our stuff or any of that. I'm just saying my only question is: has there been a consideration for those that do not have the capability of having someone? It's just a thought. No that's one of the reasons why there is a provision to have the cova testing, so it's quick and accessible, but- and it also requires that a pre, a parent or guardian, be present, so that still does not address the parent, that's unable to go to school and those are things that need to be worked out and to may be made clear. So I expect- and I know that they're working on these policies that I'll have more clarity about the policies you know next week, because this week is almost over next week right or soon thereafter- and you know, one of the challenges is: this is a pandemic, and this is an unprecedented time. However, there's so many things that come up as you go through all of this and you want to be able to protect the children. So there are a couple of things and- and I promise the next meeting- we're actually going to go through a charrette about looking at the contracts, because the contracts are very telling how much we acquire thing, how much it costs to acquire things. The length of contracts, the amount of money that we're paying out, we because you will see where the funds are expected to come from when you're. Looking at these contracts, you will also see favorite vendors. Why are they favored? Is it a matter of quality, ease or pricing? You know when you like, you have to acquire all of these learning devices. Is it the fact that a vendor is chosen because they're able to guarantee a minimum and quickly or if they're, the quality providers so you'll see all of that information? And the money is astounding so, for example, providing the mobile Wi- fi devices that's from one vendor, but it requires the collaboration of verizon, which is the vendor that was chosen to provide the broadband access. So you know, looking at all those inky things breathe right and one of the things that came up too is looking at mayoral policy. I know you really have to look at the politics of all of it and I know when Michael Bloomberg had gotten blanket approval for mayoral control and as we went through mayoral control, and we saw that communities were not being included in the discussions about what happens around our schools. It began to get modified and one of the things that the council did is that they extended they extended or not. The council. Actually, the assembly extended mayoral control a year at a time or two years at a time and in the last negotiation for mayoral control. So now we have a mayor in his second term right who's, not trying to seek another elected office, because one way you keep the accountability is that if someone wants is wants to continue in service, then you have the reelection, Button, Yay or nay right. So you do not have that control anymore, and I would make the observation that the transparency that was promised, as you can hear about all of these niche- does not exist. So I fully expect that mayoral control is going to be an issue, if not in the next convening. Perhaps actually the next convening of the legislative body which happens in January so every two years you have a new legislative body based on the elections. So that's going to be that's going to be a topic, and I want us to put on our list because we said we were going to talk on long- term policy. What do we feel about mayoral control? What things will be like to see that are included right charter schools operate out of the par purview of the Board of education? Excuse me, the Department of Education, but their so to speak, comes from the New York state regions and Success Academy had a hearing today that changed the way they would do. Zoning, which is acrosss boroughs and in the chartering process they do not have to seek community or public input where something like that could not happen right, but something like that could not happen with public schools. So that's something else that we have to talk about and I'll definitely say that you know: we've enjoyed a great relationship with the Brooklyn region, cathy cashion, who was a superintendent in district 23, and we enjoy a good relationship with the region at large, lester, young or one of the regions at large, lester young. Who is a superintendent and 13. But we have to be wary of this because much can be done in the dark and occasionally they have sunni charter school meetings in New, York City. But most of these meetings occur in Albany, although our schools are the ones that are impacted overall. So again you know in terms of and nor I keep putting on this on a long- term advocacy having more of those meetings in New York City, to make it more accessible for us to be able to give our input because it makes it onerous that you have to take time off from work and then incur the expenses to do the advocacy right. So you know long term in terms of advocacy again guys. I'm talking a lot. Please talk to me. Talk to me about what your concerns are, what your issues are, what you'd like to see us deal with Sharon? Can you hear me? How are you doing all right and you that would be audrey Tate Hole who's joining us from her cell phone? Yes, my question is right. This I was listening to the news and my question is this testing they have brought in some quicker way of testing the teachers and the students for Covid-19, and I'm my concern is that it's not accurate. Okay, it's not accurate at all. Okay, all right, I believe Michael milgrove, you know was put on point about it and I just made a big smile audrey. Yes, he was, and we I do not know if you had joined us at the point where I talked about the the vendor for the Covid-19 testing is actually a genetics company. We have one for the for the quickie or the three- day thing the three- day, one for the students and it's a genetic company that wants to keep the samples, oh really right. So I wanted to share and I'm sorry I'm technology challenged, but I wanted to share and I'm going to provide the links and the follow- up of looking at contracts, because we actually have to look at our contracts to understand what's going on. If you want to know how things are going to happen in any entity, you must follow the money, look at how the money, and that determines the policy right. So how is this vendor chosen? Why were they chosen? Do they have a track record? Are they offering a price advantage? Is there some service level agreement that they're going to be able to provide x number of tests with this percentage of accuracy? All of that information should be in the award or the RFP answer, and you can find that in the contracts. So I would one of us to take on that responsibility of looking at. What's coming up in the contracts meeting it's once a month, you do not actually have to go to the meeting, but it's very easy to go to meetings now that everything is virtual and take a look at that money. How that money's being expanded, even if it's just to look at the spreadsheet and also one of the things that's come up aside from the the whole decision making around outdoor learning was, as it was described to me by a cec president that they basically leapfrogged over the community to make the decisions happen and made it a multi- agency response. But the end result was, for example, a school that had 705, which is located on Klassen and Bergen. Excuse me, Classen and St Marks made a request for outdoor learning on Tuesday, but had not gotten a response that was sufficient because they did not have the personnel to meet with the requirements and having as a as a as by posing those challenges in a public meeting. A try agency panel got together to facilitate the outdoor learning requests and we knew about it. We, the community board, found out about it on Friday, when a neighborhood resident posted a sign about the inability to park. You know their cars on the street between seven or between seven o'clock and four o'clock and for a limited time until around thanksgiving November 24th. But again, how are we going to respond to the issues and the concerns of the community? We do not have any notification or say about that, and those advocates that think that you know having a car in New. York City should not guarantee you parking right. We have all of those conversations so being able to find that information out about how the decision was being made. You know who made the decision was a little bit onerous, but those are the kinds of things that again, you know if we do not say that we want to know we do not know. How is it that anything and I'm new to this whole thing? I'm learning it's going to be a definite learning curve for me. But how is it that anything that deals with our children, our people, our streets? Our buildings does not have to come through the community board. How does that happen? So the community boards role is advisory and our focus basically is to collaborate with agencies that are shared with us, but we are an actor or we're unknown to many people that should know about us, but of course, for one second tiffany, I see somebody whose phone number ends in 5'4. Who are you I'm asking hello, someone who's on the line whose phone number ends in 54? Who are you interesting right hold on one second, because we always like to know who's in the room with us with the possibility. I'm sorry guys is my housekeeping being anal all right. Thank you I'll. Try and chat this, but anyway, so yeah, so mayoral control is going to be an issue also I'd love to give a shout out to the family and community engagement of the Department of education. They have done a tremendous job in a difficult time and they are the reason why we know. What's going on so I've spoken for what the better part of 45 minutes about education. Is there anything else anybody thinks I should talk about or questions queries gaps, because I'm going to give this feedback to my peer group? Okay, thanks! It's I just got it's miss Jordan! That's on that line that ends in 54.. I was like who is she and we need this for attendance records? Thank you Jenny. Can you hear me who's? The? Can you hear me? Oh, this is our Miss Kinsey hi? How are you hi? Thank you good. I wanted to discuss on the mayoral control a little further because I remember when Bloomberg took control, because at that time my son was still in elementary School. I was never in favor of it, but if I could remember like you said back, then it was blanketing and almost everyone was willing to try it. But since then, especially since De Blasio have taken the reign, I have law enforce, for the control to come back to the parents and since you're mentioning it is this something now where we should be rallying around and calling our assembly people in our Senate to not allow this to move forward when it's time to go back because the last time he could not wait. The Blazio could not wait to get up to Albany. He was salivating at the mouth to keep control and I could not understand why, if you could shed light on that, please let us know, but, like you say, it's going to be a hot button item. Is this something that you do not support, or most of us do not support, and how can we make sure that this does not happen and try something different moving forward? So the way it's up in the age of Covid-19 is that school reopening was a political choice right, not a choice of professional educators and the implementation thereof was left to those who are professional educators. So what does that speak to? Do? We want a political? Do we want to be led in a political process in schooling, or do we want to have professional expertise yeah, so I think yeah we just can't. We have to end this. We have to make sure that our children education comes first, it should not be about politics and the parents have no voice at this point. You know my son has grown. He graduated college, but I I'm still very much concerned about our children's education and our children's well- being and sustainability in our community. So the leadership on this comes from the Education Council, Consortium and they've been very good with that, and they collaborate with a number of other organizations. It's my expectation that they will have some sort of policy or opinion paper prior to the beginning of the next session. Okay. Well, thank you. Will that be brought to the Community board, or is that something that we have to look out when we deal with? What was it that you said that you were trying to pull up so I'll share the memorandum? So you guys will have historical background to see us, the uft memorandum and the Csa Memorandum, but certainly I'm in those rooms where some of those discussions are hacked. So I will definitely share because, as I explained to our chair, ethel Tyus, each committee and the committee chair thusly should be the subject matter. Experts about that those kinds of things. But if you know when I say because collaboratively each of us occupied different spaces that we would know about. What's going on in our own neighborhood and I'll, give you an example. One of the principals came to a parent and wanted the community board to advocate on his behalf right regarding an after- school program and my response, because it was a quick text was and it's because I knew the history of the principal who often has skirted rules or does not want to hue close to what you know. Department of education mandates, all requirements are, and the first thing I directed that parent to do is ask you, know or ask you know: ask to take a look at the budget. Where did that money come from because the requirement was that the money for after school programs go to 501C3. So the fact that he can't use his program of choice says that his program is not a 501c. You say: hmm, you know, so I do not want us to be blind advocates for anything but to have the knowledge behind that and those are the kinds of things that you need to have the expertise you know to be able to have the relationships with so Mark. I know one of the things that you wanted to do was to make sure that you're a part of this committee- and I know your other involvement in terms of policing, specifically your interest in the interdiction of youth and policing- is there anything new that we need to know or any initiatives that you think should be part of our advocacy plan for this year? I guess right now. You know, as we all know, we're going through a little unique situation. This Covid-19 and and the youths are really in kind of a on a semi lockdown not able to participate in any kind of activities, but as of right now, I really do not have anything that in store, but I think we can. This would be a good time for us. I mean put our mind together on this and see how we can prepare once the streets and the community and our and our country start opening back up. So you know I'll definitely be looking on things that we can definitely do in reference to the youth, okay, all right and so we're getting to the the part of the agenda where we need to discuss any other business. So one of the things I'd like to bring forth to the committee is that we do not have to meet our bylaws changed. Last year, the community boards bylaws changed last year, where we do not have to meet every single month, which had been the previous requirement, but we could meet when we deem necessary and we had a meeting in August. So we did not necessarily have to have a meeting in September we're meeting again in October this meeting. I would propose that we do not meet in the December, but we meet in November and then we meet in January, so I'd like to propose that we skipped the December meeting and that we also skipped the March meeting this year. How say you a second okay, just as a point of clarity, your November meeting would be scheduled for election day, even more of a reason not to me in November with which is something Quasi had advocated for many years, and I was insistent that we meet, irrespective of the fact that it was on election day. Okay, so you want to meet on election day. No, we do not want to meet on the election day. Okay, do you have an alternative date in November? Then? Yes, okay, I was trying to say something, but my connection dropped. Okay, so talk to me, I was going to ask you in the past you had assigned- or you were thinking about, assigning homework or particular points of interest to have members of the committee look into. Would you want to wait until next month to do that? We can begin the conversation now and continue it in the future. Talk to me desmond, I'm just well. I do not know if you've spoken to Pam and Pam pulled me into her collective, but talk about what this collective its mission is. The collective is a is basically about getting title, one funding and getting it and what title one is and what all the other title two title: three title four but title one predominantly because of our district having a lot of lower social economic. The way, though you can get funds, federal and state funds and how they and the rules for having them dispersed how you organize schools so that you have different various varying levels of teams and interlocking connectivity and collectiveness so that the ultimate product is the best education for everyone, so that you benefit the children who are academically superior. You do not you make sure that the children who may be behind get caught up, that whatever resources are necessary for them are made available and that they're always done in a way so that there's no scandal involved. The parents are involved and the parents are educated to follow through with the process. So in other words, you want to make sure that title 1 monies are used for equity, plus okay, but going back to the point that mark made, which is something that everybody that I've heard of the parents in grocery stores discussing when the pandemic first started. A lot of parents who were quote essential did not have the ability they did not have the experience the time or the ability to make sure that their children were taking properly taking advantage of remote learning or they did not have the resources to properly do remote learning or any number of a combination of things. And so there's been lost time. And everyone knows that when children go, children have to summer off two months that they regress unless they're actively involved in a a program to keep them sharp and to maybe even advance them and what's happening is you're losing a half a year a year in students lives and if it's small children, then that's extremely critical, because that's all developmental stuff and everything here is a big crap shoot. So if there was anything that we would want to do, we would want to try to get the most effective parsing of those funds into the communities and learning how to do that. Well, one I think you're on it two right, because you know you're working as part of that collective and I think that's absolutely like that- would be your bucket your point of interest that you would consistently bring back to the committee. Okay, that's what I was just doing: yeah, okay, thank you! But okay, but from my past experience I know that many hands make light work, okay, and so, when you're talking about the future of our community and our children, I made a point a long time ago about a situation where one child that I knew of did extremely well, but that child's last tenure was the entire tenure of the Cfe case and that, if all the children leading up to and through the end of the Cfe case, which still did not solve any problems campaigning for fiscal equity, when a parent in Harlem took the state to court because New York City had been underfunded. So I'm just explaining that, because I got called out for that before I ever joined the board. I brought that up and they said how do you know if everybody knows what that is long story? Short long story, short long story short the parent ultimately won the case. After 13 years the award was for 440 million dollars, it's about up to about 4.4 or 4.5 billion dollars now and New. York City still has not gotten those funds right, and so, if you're talking about the children of this city being equitably, educated and other people will always make the case that you know dollar for dollar, that it costs more to educate kids. Here, it's also harder to do everything here and that's because of this, and that's because of the system- and you alluded to that when you said talking about contracts and looking to see how much things cost. Yes desmond. That's what I was alluding to. So thank you for that, and we know that some at there are advocacy groups that are specifically focused around the campaign for fiscal equity, and I just want to be very respectful of time, because I have some ask of the members assembled just in terms because I'm I am, as I said, will be going on lead and I wanted to make sure that everyone had access to the same kinds of information that I had. So there are a couple of things. I'd suggest I'd suggested everyone sign up to receive the mail. That's put out the emails that are sent out by Cec's, 13:16 and 17 that everyone who is on social media go to Ecc's, page Educational, council consortium and like them or friend them so that they can also receive a stream of their information right. Make sure that you take a regular look at the does page so that they know when they're going to be paneled for educational policy meetings as well as they can review the contracts that are given so contracts and pep meetings are separate. And then you guys will understand why. I'm always so tired excuse, my ignorance, but how do we sign up for the so you send an email to Cec, 17, cec, 16 and Cec 13 separately and say hi. I'd like to be added to your mailing list. Okay Cec stands for Community Education Council. Okay, sorry about that no worries desmond is always after me, for using acronyms are we able to send information out on on an email with a spreadsheet, identifying the names on the loca and the websites so that we can go from there yeah? That would be amazing, but that's labor intensive and that's something I do not and with to do, which is why I'm telling you to email it but okay, but mark. You reminded me of something because you had sent out a spreadsheet that asked for the contact information of the parent leaders, and I wanted to address that. I have that note note to talk to you about that, and specifically, there are a couple of things that are happening. The PTA elections were postponed in the spring, which is when they happen they're going. They have to be completed by October 31st, so by November 1st we'll have a whole host of new leaders so that at that time we can update that information and I'm sorry if it feels a little bit ad hoc. But one of the things in a virtual environment is that they had to figure out what would be the best way to do it, and one of the conclusions that they came to was to have the parent coordinator of each school actually conduct the election. So the delay comes in the fall because the parent coordinators needed to be trained as to how they conduct that process. Lisa. Have you gone through that process yet for the elections? Unfortunately, my school that my daughter attends is actually one of is small she's. This f is about 42, 8th, graders, 47th graders, and I actually their numbers jump for sixth graders, so they double that, so they have about 80 or 96 graders. Now it's the first. So this is, we do not have a parent coordinator and our elections is actually supposed to be October 14th, because I've been the president since last year, and probably we have a whole bunch of new parents, so hopefully we'll have the that actually group like it was always the same 10 to 12 parents. Since my daughter started in sixth grade, unfortunately, and we're hoping with these new parents, a lot of them are asking about elections and things so we'll see so October 14th is our day, but I did the trainings that they have the parents doing that who were part who was previously in the PTA, it's very confusing. They want you to do the zoom meetings and they want to send out codes. But if you have 1500 students, how do you? How does it process the code? So I have another training tomorrow, like they're, going to do a mock election, and it was very confusing the last couple of meetings. I see a lot of issues happening with the actual elections for these schools because it was very confusing and parents was asking questions and parent coordinators was asking questions. It was very confusing, so I do not know how this is going to work out so Lisa. I have a very good relationship with your with your district and with your principal. So one I'm going to have a conversation with principal me and Marcel are very good friends. So yeah we are very good friends a couple of issues and it's particularly the her budgetary requirements for having the parent coordinator, because we might be able to shoot something in no promises, but I thought and also to have Camille, which is the person in the district office, if you guys, if you're okay. So if you do not have clarity after tomorrow circle back to me and see if we can work with it, because I'm actually I'm actually okay, the meetings, I'm not that worried because hopefully we can handle it. I just think it's going to be very confusing, because what the requirements that they want us is to do is actually put out for it to be anonymous for the actually elections, so they want to assign a code to each parent and the parent is supposed to vote. The problem is that a lot of parents do not sign in to some of these meetings and things. So we it's going to be. That's the part where I find it interesting. My school is small, so I'm not too worried about that, but for schools in the district that have twice died three times four times the numbers of the kids in my daughter's school. I can see there being an issue gotcha all right, so we'll just we'll just work on that. You know it just boggles my mind and then we'll talk about maybe December or January. What the New Pa the President leaders election is going to look like because they're changing the system, mind boggling! So at this point I'm going to ask: is there any other business? No, they resettle the dates for the next meeting. We. What I will do is I will confer with Julia and Michelle, and then I will send out the listing of meetings, because I also have to confer with Nora and marver, because they'll be principally responsible for the facilitation of these meetings, while I'm on leave and then get back to the comedian as a whole. Okay, so I'm sorry, you have to keep asking that question. It's just me going on leave, that's creating a lot of. I want to make sure that I'm not making decisions unilaterally, all right guys hearing no any other business. I would like to say that to thank you for participating in this week's meeting and, let's, if there's any feedback, anything that you need to communicate to me. You have both my email address and my phone number please feel free to reach out. Thank you. Okay, good night, good night, good night, there we go.",
            "summary": "Everyone, may I ask, since we do not have the opportunity to see one another, that we unmask ourselves and since we're fairly civilized as much of an opportunity, as you have will be to unmute yourself, because there's a lot in this agenda, although it seems really simple, so I, just wanted to take the opportunity to welcome everyone to what is the October meeting of the youth and Education committee and that other people will be joining us, and this is the part of the the meeting where I introduce myself and welcome everybody to this meeting.\nAnd, of course, it's everyone's personal opinion as to what will be best for their child, but one of the things that was very interesting is that if you elected for remote learning exclusively, you would not be able to elect back into classroom learning on a quarterly basis and as we're now seeing we're having hot spots, one zip code that is coming up, that's in community board.\nOne of the announcements that was being that had been made is that I will be taking a leave of absence for the Community Board through the, but given that I have unique knowledge and special relationships, I will be working manner with our committee, secretary, Marva, Henry and also with Nora Daniels, neither of whom are present right now and which, but I know, they'll be joining the meeting later and just you know just to talk about things.\nYou know not just live on the block and do what I need to do for my blog, but to understand how this community is working and what how things are being allowed to be done.\nNo one was given any quiet, answers, and so I decided to call and actually and call the Community, Board and ask: Could they call and reach out to somebody, because it's ridiculous, you know you have seniors So I made the I made the call and then one of my co- workers, because I worked for the city Also.\nThat group is comprised of the president of all 32 community education councils, plus the members of the city- wide organizations, and they have A few alumni members and one of the things that you know we see that is somewhat chaotic, has been the school reopening process and it's uneven in districts.\nYou, know like to be able to send out documents to everyone, but there's new guidance to the field about school leadership.\nIf you're working in a community over a period of time, there's a continuum of families and children, and so people begin to have confidence in you and It makes life easier on meeting the needs of the school body, meaning the product which are the children and then there's also the politics, If they can remove the community involvement, then that's just what they've done That's kind of a an analogy, but in the long run, typically people come out losing when you have being taken over by a larger entity, meaning and particularly and historically undisturbed, communities as I would deem brownstone Brooklyn central Brooklyn.\nYou know what is the attendance policy in the time of Covid-19 and the attendance power by the principles and The principals must share that with the school communities in the next month.\nAnd I know when Michael Bloomberg had gotten blanket approval for mayoral control and as we went through mayoral control, and we saw that communities were not being included in the discussions about what happens around our schools.\nThings will be like to see that are included right charter schools operate out of the par purview of the Board of education?\nExcuse me, the Department of Education, but their so to speak, comes from the New York state regions and Success Academy Zoning, which is acrosss boroughs and in the chartering process they do not have to seek community or public input where something like that could not happen.\nNor I keep putting on this on a long- term advocacy having more of those meetings in New York City, to make it more accessible for us to be able to give our input because it makes it onerous that you have to take time off from work and then incur the expenses to do.\nMy concern I do not know if you had joined us at the point where I talked about the the vendor, for the Covid-19 testing is actually a genetics, company.\nHow that money's being expanded, even if it's just to look at the spreadsheet and Also one of the things that's come up aside from the the whole decision making around outdoor learning was, as it was described to me by a cec president that they basically leapfrogged over the community to make the decisions happen and made it a multi- agency, response.\nAnyway, so yeah, so mayoral control is going to be an issue also I'd love to give a shout out to the family and community engagement of the Department of education.\nWhat's, going on in our own neighborhood One of the principals, came to a parent and wanted the community board to advocate on his behalf right regarding an after- school program and my response, because it was a quick text was It's because I knew the history of the principal who often has skirted rules or does not want to hue close to what you know.\nMake sure that you take a regular look at the does page so that they know when they're going to be paneled for educational policy meetings as well as they can review.\nI see a lot of issues happening with the actual elections for these schools, because it was very confusing and parents was asking questions and parent coordinators was asking questions.\nSo one I'm, going to have a conversation with principal me and Marcel We are very good friends a couple of issues and it's particularly the her budgetary requirements for having the parent coordinator, because we might be able to shoot something in no promises, But, I thought and also to have Camille, which is the person in the district office.\nWhat, the New Pa, the President leaders election is going to look like because they're changing the system, mind boggling!"
        }
    }
}