{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB7",
            "channelId": "https://www.youtube.com/channel/UCbkNpO906o11EDhP252p_1Q",
            "title": "CB7 Land Use Committee",
            "publishDate": "2020-10-22",
            "shortDescription": "",
            "lengthSeconds": "1:26:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB7",
            "normalizedName": "Manhattan Community Board 7",
            "twitterName": "Manhattan Community Board 7",
            "youtubeChannelName": "Manhattan CBseven",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_n3st90mFiSeRVUl4m8ySQ",
            "twitterHandle": "@CB7Manhattan",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "C2HOEKvHciA",
            "fillerWordCount": {
                "uh": 141,
                "um": 145
            },
            "readTimeFullTranscript": "43 min read",
            "readTimeSummary": "5 min read",
            "wordCountFullTranscript": {
                "housing": 35,
                "ethel": 18,
                "street": 18,
                "years": 17,
                "land": 14,
                "building": 11,
                "project": 11,
                "history": 11,
                "task": 10,
                "item": 9
            },
            "wordCountSummary": {
                "housing": 9,
                "years": 5,
                "highway": 5,
                "history": 4,
                "planning": 3,
                "project": 3,
                "trump": 3,
                "buildings": 3,
                "sites": 3,
                "block": 2
            },
            "fullTranscript": "This okay, and so I like your hair, hi there, it looks good. I can't hear you. Are we hearing everybody yeah? Can you hear me? I can't hear you we can hear you hi there. I can't hear Richard. Can you hear us now, ethel Mark? Can we hear I can't hear you what what's happening with it's? Not here? Maybe you want to log out and try again mark check the Mute Button. Oh she's, not muted, so oh Jack got the whole flooring system. This could be about a week like this cory's been very optimistically says a week, I'm hoping to leave. That's a dirty lie. It is a dirty life. All right all right, see ya. You did that really! Well, I know right see how calm she is yeah. That was surprisingly weird I feel like we live now. Who are we hearing? I do not know. I should log out okay. So while Corey is working on shoring up the talent house, did people see that the park 79 hotel is going to be converted into residences for low- income seniors yeah, we've known that for a while. Actually, ah, I just saw it yeah. It's on my block. Actually remember. We saw that we saw that in preservation a few months ago, because they needed to put in a an ADA accessible lift because they could not have room for a ramp mark. We also heard about it over a year ago, because Mark Jennings told us on the in your town. I do not know, I can't hear everybody. Oh, I do not know what to say. Ethel. Do you ethel, do you have a no unmute? She is she's, a muted roberta. Can I hate Kentia Roberta? We are live streaming by the way and and recording, oh god, well on the 79th street building. I think it would be worth our while to get in touch with the owners and see if we can get some insight into how they finance this project. I saw that in the cranes article that they got a huge tax benefit and we ought to know about that sort of thing for future reference right. I can I'm glad I'm happy to talk to project fine and they can explain it to me. Okay, that'd be great. I you know I it's we're going to be anyone's. I'm sorry is anyone speaking, but I can't hear you what is wrong ethel. Do you have earbuds, I feel awful. Do you have earbuds? This is what I use like this. It can plug into you. Can you help? No, it's not me hello, hi everybody. Can you hear me yeah we're just ignoring you, yeah. Well, listen! I, which, which project? Were you looking to find out by financing on I'd, enter that conversation that project find is going to manage the one on what 79th street? Oh, yes, okay, between 79 hotels, how many people are we there's a list here me Mark, Louisa, Melissa, Peter, Roberta, Doug, Ethel and sema, but ethel is under a handicap because she can't hear anything and she's gone yeah, I'm going to send her a different link and see. If that does anything all right, her sound may be off on the computer. You know it may be on a computer. You know we'll see, but we needed her for the first part of the agenda. Wait is there an agenda? Can you resend it or is it just online? There's no agenda on our website. There were penny, sent a penny sent to everybody. Oh, was it just a while ago, maybe yeah it was a few days ago. I think you want me to resend it to everybody. Now sorry, I'm just trying to see if I can find it and spare you the trouble, no trouble. Okay, sure then yeah that'd be great where's. My I did not get. I said I did not get an agenda. You did not all right. Let me just send it if I can't find it here, yeah, I'm not sure I got it either. So all right hold on oh Richard. I found it. Do you want me to send it all right sure, okay, yeah, oh Mark, did you send ethel another link? I did yes, you want me to call her and see if I'll take care of that you go ahead with the meeting. I think Richard's waiting to he needs out here. We can also move around the agenda and come back yeah. Let's just jump to a different item and then come back. I can't all right: let's go to the second item. There are a number of this way. I'm sorry ethel is on. Yes, that's all yes issues! Okay, I can hear you. Can you hear me? Yes, thank you because thank you so much. The first item is ethel has very kindly agreed to do a program on the 40-year history, okay, Riverside, south and Riverside. No, I can't hear Richard you can't. I'm losing my mind. You are ethel, did does your computer? Have you can't hear anyone speaking all right? I do not know where my you may have to press audio that will that would affect her hello. I can hear you we hear you unmute. No, she is unmuted. No ethel was unmuted. I muted her because I'm going to talk to her now about trying to fix the audio all right. Okay, why do not we go on to item two? I just sent the agenda, so you guys should have it by now. All right. I item two is one: there are a number of projects that are sort of floating around the board that have that are in various stages of activity. One of them is the Broadway task force and it I believe that the Broadway task force really should be a board task force initially and that it should cross fertilize between different committees that might have an interest and also different perspectives. For example, the transportation committee may have a different perspective from bci and land use also has to weigh in on this. So what I'm proposing is to try to organize a joint committee, two or three representatives from each of three committees to serve as the initial initiator of a program to develop a policy on how and if we can improve broad way. Richard. If I could just add to that, I see Doug and I have been on the task force and we did have when we set up the task force. Unfortunately, it reported just a transportation, but it consisted of members of Bci, of Park, of land use and of transportation. So basically, four committees, all right. Well, what's the status of it so, the like two years ago, through transportation, D.O.T, was requested that and if the board passed the resolution to request DOT to do a study of what was possible on Broadway and we did at that time. We did a walkthrough of the lower part of Broadway from 59th street to about 72nd 77th. Also on the board on the broadway task force. Is the Broadway Mall Association people from the Broadway mall, because that that's a big part of Broadway and so DOT came back last this summer of 1919 with a preliminary study that just did not answer any anything but raised a lot of questions, so they were, they were sent back to the drawing board and I'm assuming that, because of the pandemic, they won't be coming back to the board with any no anything soon. But I do think it's a good idea to have reports made to all four of those committees yeah. I think you know the I know there's been an emphasis on transportation, which obviously is important, because Broadway is a an artery, but there are other issues. You know the vacancy rate. The malls discuss, in fact, one of the things that I know, doug you were involved in, was to do a study of all the blocks of what you know where stores were where what stores were empty. It probably has to be revised because that was done. What about two years ago? Well, yeah, let me suggest revising it and reinvigorating. It is a great idea. Let me suggest that roberta, you would be obviously one representative from land use. Is there anyone else who would be? Okay, Paige has been on it and what h? Okay? Is there anyone else from land use? Who would be interested? If not I'll? Do it sema, okay, good and let's, let's try to coordinate mark with the other committees. Have them have Rep make sure they have representatives yeah, I'm not sure that we currently have a representative from parks. I I take from roberta that they were involved at one point, but I do not remember somebody from parks being at the most recent meeting. Clary came to a few meetings, but has not been there recently yeah, okay. Well, let's make sure that we, as you say, reinvigorate that, let's I mean the meetings ought to be. You know there ought to be reports back to the various committees and what's going on and how it's correct when I was well, I was chair of the board. There were men and there were reports back, but I think since I have not been chair, I do not think the committee has been. The task. Force has been good about minutes all right. Well, let's you know, let's get back on it, we obviously can't wait for D.O.T. No, I think we can do some brainstorming without their input as to what we think we want broadway to look like, and you know what our general objectives are. We may not all agree on that, but at least we'll have a cross- section of the board to think about it. So we we've had like a almost like a vision statement or a document that has been in various forms of draft. Maybe that's something that's worth circulating to land use. I think so, let's you know what I have a lot of that material on my computer. Why do not seaman, and I pull it all together and we'll with a note and we'll send it to the four committees with the names of the people that are from land use and see if other people from and who else is on it see if other people won't have? I think we had about 10 or 11 people on it. We also had a few people that are not board members. I also feel like it's a reflection of the work sort of that's been done to date and so checking in to see if it's the right direction or if there's a course question to be made is a is a good thing to do. I think, especially you know acrosss all of those committees, perfect yeah. No, I think Richard's frozen richard. We lost you. Yeah Richard went to the bathroom we're having some zoom issues tonight, I'm sorry Mark, oh god, we can hear you ethel, and you hear us no she's, muted. Now, Mark, can you unmute sorry, I'm asking ethel I'm clicking on ask ethel to unmute. She was unmuted for a second there I am now. I did that you got it, you got it you're, okay, I'm! So I apologize to everyone no worries this happens. Thank you. Unfortunately, Richard is now frozen or offline, but maybe I think he was going to call on you anyway. So maybe you want to what would you like? Tell me I'm very glad, because we did deal with this outline. So please catch me up and I will do my part quickly. Well, he just started to talk and then you could not, but he was starting to say about the project that you were going to undertake in November. Yes, so, okay, so then I'll do that if that's okay with everyone yep great okay. So as you can see here, we I am going to prepare a a set of a presentation on the development story and lessons learned of Riverside, South and Riverside center, and what I should tell you is that I already a year ago, actually September 2019, I had been invited to go to come and there was a planners conference, the New York, Platters Architects and the landscape architects, and there was a conference for the day on development. In New York big development, and they asked for a panel about talking about what have we learned from older ones, and I gave a talk on Riverside south of Riverside, Et cetera and the same panel Stan Extra talked about Battery, Park City, so, okay. So since then I talked with Mark and had actually talked with the president previously and most important, the urban history group, which many of you know you know a terrific group on the upper West side had asked me to do the very they wanted to have a presentation on Riverside South. So with Mark's help the mark and Richard, they all contacted urban, the urban history group and so that group, the borough president and board seven are going to sponsor this presentation, the date November 23rd. Now I want to be able I'm going to be updating and emphasizing the role of the community board in this which everyone I have to tell you the subtext is. This is a 40 year story literally, namely the development of the rail yards and, as many of you know so much occurred in the 90s. But really Riverside center really went through a whole new. You learn from Ward 7 in beginning in 2009 10., it's longer than 40 years. It's like 50 years after all, right Peter, because I think Peter was involved well before and was so important because there were other proposals. Yes, I do have that in there, because obviously, this is not going to be a two hour presentation. It's going to be shorter, but I am working on it now, but what I do intend to do in the next week or so I will really consult and have a cup two or three of you take a look at. You know what I've prepared already and the changes I'm going to make in order to consult earlier when the idea came and above President Dan grew about a week ago. A week ago, God help us a year ago said that this was such a great thing and she wanted to do it with the community for it, and I began to talk to sema at the time, because I thought it was just terrific to have sema who was knowledgeable and knows about planning, but also did not have the history. So we began to talk about and to select material then so I will certainly be going back to sema as well as, of course so, and it's very important. I want to emphasize here that the fact that a partner history group really is keen to do this and you know who they are. They have done extraordinary work and they're all the residents and others from 96th street to 100 country. They have an extraordinary website and they are scholars of history very keen to bring their people and audience to this, and they want it to be so now. The date agreed upon by everybody November 23rd, okay. So actually it seems like a lot of time, but it won't be. I'm leaving. I will be consulting with you and my last point before you may have questions is originally. The idea was especially with Riverside center, but the idea was to also have a walking tour, in other words the next day or before, because to really see what has been built and perhaps I'm wrong. But many of all of us maybe do not know Riverside center as well, and it's a completely different looking project, it's glass, it was done by starch attacks and so on. I would still love acceptance Cola to somehow maybe have some walking for the next day or the day before, for those who could come and we'll consult with you and others. If this can be done. So this is a great. It is a great way to do it, and there are many people, and I think there is tremendous- and so many of us who live, but also so many on the board have not had the opportunity to say what is all this. How did it happen and how is it working out and what did not great ethel, just one quick correction, the date for the meeting is Wednesday. November 18th, it will take the place, that's okay, I put it in the chat. I put it in the chat. It's I'm not being heard no worries, but it's the 18th it'll take the place of the of the November land use committee meeting, so we'll recommend that everybody tune into that instead and I I'm eager for those of you who may have particularly more interested and I'm here. I think this is wonderful. It's going to be a great opportunity for everybody, those who are around and have different levels of experience and those who have not. We very rarely go back to major endeavors that the board was involved with and look at what happened and learn from the history, and I think this is a great opportunity for everybody. I have. I have a lot of drawings and photos of various models that go back into the 1960s and then with trump in the 70s and 80s. I have a huge collection of material on what is now Riverside South. I also think as we're as we're approaching thinking about future development in our district, like potentially what happens to the Silverstein, Project, etc. Having a look back at what worked and what did not and how that can help us going forward would be really valuable right now. That is certainly the goal, but I want to again say that, let's, if we project- let's say ideally, you know a two- hour meeting maximum, because you know that I mean I we're not going to have a presentation. We could up two hours, let's say the one that we're showing is going to be. You know Max an hour, probably less, and to have people with questions, of course, so I know and absolutely know so much of what Peter did I, when I did it to begin with. I do reference the first projects and the attempts- and you know very quickly, but I very much welcome and I very much welcome Peter's. You know some of the graphics cause all I'll add a quick. You know map whatever that you have and anyone else. So that's just terrific great any anything else. Anybody have any other ideas or other panelists or other contributors or other sponsors mark. Do you want to remove the other richard from the meeting? Just I do not want to remove it. I do not want to remove them, because what happened my computer, my computer went off so I had to dial back in, but I muted I've always had personality. Could I may I add one sentence, because I see Louisa and Melissa here and one of the perhaps very one, interesting component of this long history is that the their the board always tried to advocate for affordable housing as in the long struggle of Riverside south, but quickly. What was finally achieved was it was said of the restricted, Declaration, 20 or a minimum of 12, and the result was that really it was well and it was by numbers of units and it took forever one of those interesting changes that it's worth is that Riverside center, so many years later, that the approvals that occurred were to have inclusionary housing and to do the measurement by far so that that's something to look at as to the numbers of units and so on, and I'm really highlighting that because I'm seeing the two co- chairs and what developed- and it may be something that you might want to take a look at and what was learned and the same quality in the affordable apartments. As of the you know, as the luxury. Well, that has that's been changed in a way it's or it used to be units, and then it was changed to square feet. So it's it. It's a little. That's in the I mean there's about three or four chairs of the board, who were involved in this process, at least at least probably going back before Ludwig when Shelley was a baby yeah. He held me in his arms and rocked me. I have all my notes from the 90s. I was not on the board, but I organized the tenants in the area to fight it. At one point we had over 20 buildings who were on board. I have some very telling recollections of trump and all this I do not know. I do not know how many of you know, but the first project was developed by the lithographers Union under Ed Swadek, then, and that was in the 1960s and they called it. Litho city, yes for the lithographers Union, and I have all the drawings for every iteration, including two different attempts by trump to build there, plus the argentinians who came there in 19 and hired the well- known now, well- known architect, Rafael Vignoli, you know who has built many of the tallest buildings in the city. He came up from Argentina and we worked with Vignoli on a scheme for all of the whole area from 59th street up to 72nd street, and I have all the drawings going back more than 50 years. That would be so fun to see. All that would be great. You know it's. If you drive down or walk down from 72nd street to 59th street, you can see the changes in architecture and technology and I'm sure that the ones that you have are even more primitive than the trump towers. What I want you to tell you is this: is such a trendy show? I will I have already tried to highlight you know this history, but also to organize it with. You know what have we learned, but I also want to suggest to you eventually that it may be that this treasure trove so much from the Community Board, and I know that I met with roberta you know months ago, because I knew all about the history of Lincoln towers and, of course, but you know this may be eventually an archive that I know the New York historical society has called me just separately to say they are interested in the work of the community board. Seven, you know over the years, so perhaps there are ways to be able. You know to contribute this important history, but to do it in an analytical way from the 90s I'd love to get rid of it paper copy. So if the historical society wants it I'd love to give it to them. Yes, but also it's good to do, but you know in what I did already. Obviously you know in what was in a 45 minute. I summarized you know what was achieved in the euler and I'll. Do you know, do the same now we'll keep going, but if you, if you have you, know original material, we'll talk about that, that's a bigger project. I wanted to add one thing. I do not know how many of you know this fact, but we had a scheme to eliminate the highway there and instead of having the raised highway going there, we had a scheme to to have it go under Riverside boulevard from 72nd down to 59th street right, so it would be underground and you would not have the highway as a detriment to the to the west of the whole site, and that- and there are drawings of that scheme, only the costs were much too high, so it never was developed, but we did have drawings of it and my partner, then a guy named Paul Willem developed it and he went on with it for many years trying to get it all built. You know the the sequel to all that Peter or the backstory. If you recall, the civic groups made a deal with trump based on the supposition that the highway would go underground. In fact, I think they were going to use some of the train tracks or train tunnels yeah and the week before the very week before they made that deal. The governor announced that he was spending. He was allocating 30 million dollars to rehabilitate the West side, the highway where it was yeah, so it was never going to happen. If I may suggest to you that to bring things up to date, almost from ethel, can you speak up a little bit, I'm having difficulty yeah you've got to get nearer them for Mike. Yes, I do not know what I tell you I feel like everything's been falling apart. I've been having many to I'm sorry. If this is this any better, no okay, I'll try to I'll try to anyway. The last thing to say is that, as recently as the last three or four years, trump actually said publicly how much he dislikes Jerry Nadler, because he still blames Jerry Nadler for thwarting him in so many years ago, and continued to feel and actually extended in the last four or five years, two more a little two more little trump anecdotes. First, I do not know how many of you remember the meeting at the public meeting at which trump introduced his original plan. Yes, and the original plan called for a semi- circle of six 60-story buildings surrounding a center tower, and somebody asked them how tall the tower was going to be. He said, 150 stories, the largest building in the world, sound, familiar yep and then and of course he never had any plans to do that. It was in those days it was even less feasible than it would be today and then ethel you mind. If I tell the story about what trump said to me, I do not mind. I guess I mean do not give away the ending of her presentation, though Ethel had a kind of a love- hate relationship with trump more on the hate side and when the then chair of the board, I think, was hope, and I went to Trump's office to solicit funds to help us do a study of the years. Nathan right trump was very I'm sorry. That was hope, Mason right now, nation hope, the other hope. Anyhow we went there. He agreed readily to give us the fifty thousand dollars we asked for, but he had one condition. He said you can't let ethel shepherd have anything to do with it and we said well. We really can't do that anything, but we never got the money, but what I want to tell you. I hope you can hear me, but Richard told me that when Trump became president, I've never heard it before and now I can tell you I, when I heard that I wear it like a badge of he thought. Honor was so tough and knew me so well that he did not want me in the room. So I it's my one claim to face you're in very good company with people other people that trump does not like yeah. He once called me an idiot in sworn testimony, so I'm very proud of that all right. Let's move on yeah, okay, all right! So ethel you know anytime, you know anybody has input for ethel. Feel free to put in. The third item is affordable housing, which is obviously something where we need to coordinate with the housing committee. There are land use issues and there are housing issues and we just need to be coordinated on it and we need to decide. We need to investigate whether there's something we can do proactively to encourage more affordable housing in the area, and that goes along. You know that was part of what we you know. I thought of that. The 79th street project might give us some insight into the finances of it, but I think it's worth having at least a an initial meeting of a few members of our committee and a few members of housing to see what it is. We think we can contribute to encourage, affordable housing, additional, affordable housing, and the underlying assumption is that's what we want. I think I think the board's on record is wanting that, but maybe people who do not agree so you're talking about in new buildings, as well as conversions of existing buildings, everything, including including city housing, including NYCHA. It's a program that gets air rights from and I'll have to get the information to everybody. There are all kinds of programs involved. No, but we should start looking at. We should have a list. We also the you know, there's this mandatory inclusionary housing, which does not exist in our district. The question is: should we be proactive in seeking to have it imposed on a district yeah? I mean, I think, there's potential for soft sites farther south in our district, where you know I'm sure, a contextual rezoning that triggered Mih could make many people happy. I do not know it's something to think about. If there are sites we can identify or like a district. Actually, I think it will make many people unhappy since it provides very tall buildings in order to accommodate the affordable housing. I mean it's worth looking at it, it's not as it's not as it does not have the same effect as it did in the neighborhoods in Brooklyn and Queens, where it was imposed originally, where you had very low rise zoning. I think the increment here would be. You know, there'll be an increment, but it would not be enormous. Be different. Okay, it'd be very interesting to watch Soho because De Blasio has just proposed it for Soho, yes, also because my understanding is one of the problems about the Bronx and where it was proposed before in Inwood, where it got beaten down, is that it was proposed for primarily low- income housing. I'm sorry, low- income neighborhoods, so watching Soho will give us an idea how it might be accepted here. Yeah there's already a substantial opposition to it, so I would not count it out. I think that there's a lot of desire to see wealthy neighborhoods rezoned for more housing, especially affordable housing. I would hope. Oh, I think there is, but I also it's the only way I mean you know: people complained last night people were complaining about homeless people and one wandering around the streets and dirtying the street. The only way we're going to attack any of these problems is to create more housing richard. They do not want them here at all. I know you know, but they have to be something I mean they were saying. You know other places in the city. They were blatant. Yeah I mean those are, I hope I do not know. Hopefully, in any event, you know we do not have to decide any of that now, but I think you know we ought to have. Maybe I'm just proposing three people from our committee and three people from our committee from the housing committee who are not on our committee or who are on both committees and I would volunteer to be one of those. I think we should look at all options. I'm sorry, I think we should explore all options. Oh absolutely and just seema threw in the chat the fair housing plan from the city. I think that would be a really great reference document. Yes, keep in mind. Inclusionary housing is more of a middle income. You know as much as affordable is very with amr. Sorry. What was that dog? I missed it. I just said that the inclusionary housing, the additional bonus that a developer gets. If they choose to go that route you know is like in an 80:20 or it is arguable that it is, it is actually still affordable. I mean in our neighborhood. It is, I think, like East, New York no, but you know, I think, there's definitely a benefit in rich neighborhoods like cars, oh better for sure. I'm just saying you know it's the only way this problem is going to be attacked in any neighborhood is in an incremental way. I mean it's we're not going to build 200,000 units in the city, but every building that can contribute 50:60 100 units is making a contribution. That would be a lot, but that would we should try to aim for getting it also. The other thing we need to do is look at what building sites there are that we need to help get funding for so that can be maintained as affordable housing and not torn down and build. You know expensive housing, you mean like soros or just friends. Well, that's what so. What I would suggest is Melissa and Louisa, and I and any volunteers to join this group and shelly and Roberta, and then one more person, maybe from housing and and I'll try to get a date, that's suitable for everybody to just meet and start talking about it. That sounds pretty good and Richard. We should include, in that conversation the remaining balance on what I call we call the collegiate money. That should be a part of that conversation. How much is that? I'm sorry the? What money can you call it the collegiate money, because right, okay, so do not need to explain the there should be about 14 million dollars left in that actually Roberto. There was a proposal, one time to use a couple of million dollars for that of that in the 79th street project find proposal, but apparently that was no longer needed, so I think we're back up to around 14 million and it would be good for the affordable housing conversation to find a home for that before somebody decides on their own, what they should do with it, and we also before that meeting I will get some more information on a couple of the funding sources. I think we also have to have a discussion about what it means. What affordable means. Yes, because we were a little dissatisfied with the results on 96th street. Exactly right did we ever get the numbers in terms of 96, not fettner, but the other project on right on Broadway. I think we were waiting for them. No, I have not seen anything there was. There was one affordable apartment there yeah, but we were curious about the how the numbers worked out between Riverside center. We never got a satisfactory answer. Did we remark from the president or from the borough president or Conor from the borough president's office, sent a report over the summer that followed up on it, but it only kind of repeated what we already knew. We were hoping for an explanation other than what we all at least some of us thought was the case, which is that they were simply re repurposing, the collegiate money to satisfy two different, affordable housing requirements, which the lawyer, who made the presentation to us, believes there's a fair interpretation of how that those two euler's came out. So I mean our concern was that maybe they were double counting, the that's right. You know that would be affordable because they were, they were part of the original Riverside south area, but they were building under the new Riverside center rules that imposed different, affordable housing rules and they took the position that they could satisfy both by you know with the same apartments basically, and we never got a real reasoned response from the city as to what their views were on that, and you know, that's frustrating. Apparently their views are that they agree with a developer because they have not done anything. But it's you know something we can look at. I think it's probably moot by now yep yeah all right. Well, we know enough to kind of try to be in earlier to really. We know enough now to try to get in earlier and get more involved and protest. We've always tried to do that. I know it's. I mean as soon as we hear about a project. We usually contact the developer and you know all right, New York, City Housing. I think we probably should wrap that into our discussion of affordable housing. Do not you? Yes, then, we should invite someone from the task force. Okay. I actually think that Nitro is different, because what that is mates repair and maintain, as opposed to creating affordable housing. No, I think no, it might actually it may involve creating affordable housing if they sell air rights. Do infill! That's true. If I can point out that there was an RFP from the mayor a few years ago. I take a little bit credit because I promoted it at the age friendly commission to do a different approach to the infill in NYCHA developments, and that was to have three pilots of creating senior housing of support of senior housing with community facilities on the NYCHA land and westfish, for one did one in the Bronx there's one in Bronx, one in Queens and one in Brooklyn and terrace apartments are opening and they serve, and so it's senior residents. The purpose was the aging population of the NYCHA end up being moved out of their two and three bedroom apartments where they raised their families to other areas which really uproot them from their neighborhood. At the same time, they need. The apartments are needed for families so by having priority to the seniors in NYCHA for the brand new beautiful apartments on the land, it was not only acceptable to the people in the area. It was appreciated, and so those three are the only pilots and they seem to be successful in many ways. So perhaps we can advocate for one in the Douglas houses Kelly, I think that's a fabulous concept. It kills several birds with one stone number one: it moves people out of oversized departments that can be occupied by families exactly it keeps elderly people in the neighborhood and it also provides a mechanism for vacancy so that the city can fix up the apartments that are being vacated, and so I think it's a great idea, but I lisa, let's start out by discussing NYCHA along with the other projects, and let's see what happens yeah, that's one of caution. Yes, sorry, I'm just going to say, I want to caution us against like planning for NYCHA without I do not know as people who do not reside there, and you know I just want to it's all preliminary nothing. You know before the board votes on anything or he's even presented with anything we're going to have all kinds of input, but I think we need to get our act together. We need to understand what the what the we need to understand, what the possibilities are: yeah right, yeah and Roberta Commission. If I can shout, may I, if you can hear me, go closer to the computer, two big studies, that the board has that I think, are very controversial and requires study. One is the a question that I bel, I believe George James did of dealing with Amsterdam houses and transfer of air rights from Amsterdam houses. Secondly, there is a big study by RPA about a huge transfer of air rights within the district from Douglas houses. Personally, it's a respected organization, but I really think it's that it requires an enormous amount of criticism. That, however, does not mean that we should not with housing. Look at the question of air rights. You know from the NYCHA building, but it's always a question of who's going to be benefiting and really at least I would say I want to see the help and the needs of nature, which, after all, are enormous. I want them to be addressed, but those two studies are available. They fall within both land use and housing, as well as the other points that were just made by louisa and ethel. Can you can you send me a link to those studies? I have them. Okay, the RPA, a vice president of RPA, addressed the housing committee in the last committee and then used as well at the land. Committee already happened about that and we also had George James speak to us also about his plans and that we have all that information and both worked great with him. Both were joint with land use. Yeah Roberta was working with a group that that was in turn working with George James, who has a couple of reports, one about Amsterdam one about Douglas, and we still have money in the bank with him to do a propose, a presentation on those so and but I believe, Robert. So he did the presentation where a group of us were at it and we decided that presentation that needed to have a further discussion. God was part of the group and Ron Jones had agreed to. We actually were getting an urban fellow thanks to louisa but fell through. We had an urban fellow and then she got sick or her family got sick. So we never finished that piece of it to take it to the NYCHA residence and that piece has fallen through. But I think when we have our joint meeting, we can we can discuss it and I can. I can bring the two studies, but that would have to be after the pandemic when we picked that up. But I can bring you the information before then roberta. Can you can you send the information around yeah and also that urban? Fellow was my student: no, yes, she was yes, she was and we worked on, then she did do a different paper, but also about Amsterdam houses. Also, the guy from RPA did make a big report to the citizens. Housing Planning Council also, but it really it's a it's an interesting thing, but it really is a little facile in my opinion, and not highly developed. That does not mean, though, that we should not look at the two studies. I mean the Douglas one is huge and has huge implications, and we really need to scrutinize it and to see about whether it really benefits NYCHA Richard. Why do not we see the presentations when we have our little meeting as it's hard to send around without explaining what all them yeah all right, good, so I'll send around something, for you know, thank you, sena, a meeting sure and we'll see where it goes. I just noticed actually that the RPA has a new report that just came out in August 2020 called scalable design solutions for NYCHA, so it might be something else that let's look at all those reports see whether we can come up with some kind of consensus, probably not, but we'll try to involve all the stakeholders yep all right. The next item really is, I think, a fairly small item. There are some public spaces in the district that would be nice to use during the pandemic. I ethel this was your idea. What is yeah well, there is a growing set of initiatives and actually literature by advocacy groups and others to be be perhaps more creative in about public space in various communities and to be able to consider whether some public spaces can be beneficial to the community. By having I perhaps some, either temporary retail or other kinds of structures that could benefit the community while not eradicating the spaces, I'm stating it in general. But there are a lot of different communities and others who are thinking about how public space now can be used to promote the health of people residing in area in certain areas where maybe the public spaces are not being used enough to benefit the people who are living in crowded housing and in other places where there can be some innovative uses. I will send out two or three a few of the papers and suggestions for proposals, and maybe that can then, where would what's an example of a public space in our. I assume you're, not talking about indoor right. What would be a public space in our district? Some of that- and I think I have some with some of the examples I'll send it. Okay, all right. Let's just you know, I do not think we need to do anything on this right now, but let's just look at it. Mas has also done some interesting presentations recently on the use of public spaces to help small business and that kind of thing. Yes, it's worth taking a look at okay. Thank you for reminding me because I have those and they did send them out and they are having some panel discussions yeah, which did occur and can occur soon. So I will try to collect some of this and send them around all right, and I think why do not? We take a look at it before we involve other committees, and you know see if there's something there. No, I was curious, I mean do we have outdoor non- park public space because, certainly when the restaurants were looking for places that they could set up other than the plaza at Lincoln Center, I do not know one well. We have school yards for weekends, but those are parts those are already being used, not all of them and Broadway malls. Although they're, technically parkland too, I think yeah I mean ethel, send us, you know, send us what you have. Let's see, if it's something we can get our arms around and I'll consult with seymour and try to get the volume on your computer fixed. This is a whole new thing. That's happened. It's the first time I since I've known her that I have not been able to hear ethel by the way. Just to add to that last item. We bci before these streets seats were approved. We did take a walk with some elected officials. I think Mark, you were there early on Columbus avenue and we were eyeballing other spaces that could be used as an adjunct to for after seating. You know that was beyond the footprint of the restaurant and a back part of schoolyards and things like that people could possibly bring their food and sit and use the space etc. All right next item ongoing construction projects. Now this is a I mean we have traditionally done a pretty good job, I think of creating these community groups to oversee construction projects so that, if there's too much noise at night or if there's overtime, work or if there's some other obstruction or rats or something like that, we have eyes and ears on the ground and generally it does not get to the board. The staff handles it. As I understand it, and Mark is that well for the mind. Is that I'm sorry for the past four years because of penny's immobility? When I was chair I chaired I did those tests, those construction oversight and in the early 90s, when the Riverside south first Riverside health buildings were going penny and I shared the together. We had the first anyway and since Mark has become chair. Mark has been basically sharing those two or three well Mark. I do not know if this is a steering committee issue or land use, but are you satisfied with the way this is being done? No, I'm not I'm working on it and there were some suggestions, for example, if penny's not physically able to navigate the streets that maybe John could do some of that and to develop the relationships with the contractors and so forth. As you know, last week, when some of us were briefed on an overnight after hours permit, because there was a crane that was lifting girders into place for a cantilever building and for some pretty good reasons, you're not allowed to lift heavy beams over an occupied building and the equinox club on Broadway 91St 92Nd street was an occupied building during the day and they swore up and down that it was quiet. And so I went up there. One o'clock in the morning spent an hour and 15 minutes, and I got ta tell you, it really was quiet. The the sanitation and carting trucks were the disturbance on the street at that hour, but anyway, to back to the point it was by the way I mean I happened to look at the at Broadway from going Southbound from 96th street and the traffic was backed up at least to 96th street going south, but that's there yep. There are issues there yeah, I'm not sure those are ones that the construction oversight would ordinarily see because that's transfer, that's traffic, not cueing trucks, and I asked the guy about where he queues trucks. Anyway. The question you were asking is: can we do a better job of that? And the answer is yes and I'm working on it? Okay, so there's nothing for us to do as a committee right now, not right now, but okay keep it on your radar on the 90s. The last item that we have there are there may be several soft sites, but there are two gigantic sites that are at some point going to see new construction. One is the taconic site on 65th and west end and we've been in touch with developers. There they're planning a medical research facility on part of that site. It's an enormous site and they're planning a they have not. They do not know what they're going to do with the rest of the site, but they have assured us that they're not talking about super tall buildings. They estimate that maybe they'll have a 24-story building or something like that. But in any event, they've proven very amenable to talk to us and we just got a communication from them today or yesterday and we'll follow up on it. We'll report status of whatever the status is. The second site is the Silverstein site on Columbus, which is the old ABC site, and it's my understanding and that site has the potential according to George James that to the you know, enormous and just you know really unconscionably enormous, and it's my understanding that Landmark West has initiated a request of city planning to put that block into the Lincoln Square special district. It was carved out initially, but there's no logical or geometric reason why it should not be in that district, and if it were in that district it would go a long way to making whatever could be built. They're a lot more rationable, rational and taller. So I reached out to I'm sorry I was just going to say so for full disclosure they're, my client, so you know I have a conflict, but have they expressed to you any plans to do development on that site? That would no they, in fact, just the opposite. We met with them too and they're. Not ABC has the site for the next four or five years, at least so they're not they're, not about to dig and put a spade in the ground, but it seems to me- and I and Landmark West has been somewhat standoffish in terms of working with us or eliciting our help on the proposal. But I think we should at least have a discussion in our next meeting about whether, irrespective of what landmark West thinks we should be a little more proactive in that area, and you know, approach city planning and say: look we we're aware of this proposal. We think it's a good idea and the community board is behind it. Just let them know that we're there well, I think I think the way to do it is the application is already moving through the first two stages, I think at city, planet and- and that means that we should be able to contact them and do what you have said. I would not necessarily immediately say: okay, we want to support it, though I suspect we might, but it's it's important for us to know what this proposed euler is in its specifics. There is a specific application which has been filed and which is in the very first stages, but making some progress within the staff at city planning. It's always helpful. If a community board will support a ulurp application- and you know I mean we very easily- think it's fine, so I think we should at least be able to read and understand that particular application yeah whose application is it. I want to make sure that you know that yeah and Paige joined us. So maybe we can talk to her about that question for just in time. Ethel is that? Do you look for changing it into the Lincoln Square special district? Yes, okay, so Paige, I do not know how much of it you caught. Can I clarify please sure all right, Landmark West tried to get a lot of interest involved in this and there were no takers and so about two years ago we met with city planning and they asked for our landmark wish list and one of the things that we said be and melissa. You- and I have talked about this- and I know your Silverstein is your client, but when we were aware that two sites were being sold, West end Avenue and potentially ABC going down to Hudson yards. Of course, it's literally acrosss the street from where Landmark West offices are, and we took an interest in it and again there were no takers, so we commissioned George James to study the impact we did. I helped with the zoning analysis with Sean Corsandi, our executive director. Several other board members participated in a list of questions that we wanted to meet with city planning. We did, they supported us to a point, but they had no money in which to initiate an action on their own. This is all public record. Everybody was happy and frankly, DCP. This goes back about two years. Now was quite happy that we start this so George James is working on this and just to let you know. Yes, when the report is done and we have all the facts, because I in fairness to Melissa and her client. Obviously we have not reached out directly to Silverstein we're just looking at what the facts of this existing site could yield and it will be a euler. There will be a time when the report is done, but right now it's half baked and there's nothing worse than coming up with a an argument that is going to shoot us in the foot. So the thing is yes, it's going to be great, you all know George Jane's capability, the Community board has hired him himself, but we can't just launch into a very expensive report. We have to fundraise for it, so it's been slow. We have not been able to meet because of Covid-19. You all know that. So I wish you would not be so impatient and sort of Kick landmark West in the ass, because you think we're holding information seriously wait a minute wait a minute richard I'm allowed to talk. I've listened to a lot of backtrack from a lot of people and I'm getting kind of tired of it. Maybe it's because I'm working from home 24:7 and I respect my colleagues- I do not want to waste your time mark knows that we're working on this sema when she was the chair knew we were starting this. There was no interest at the time, and so we took the initiative. It will be ready soon, because, eventually we need to keep things moving. We need to see our city grow. We want development, we do not want an empty site if and when ABC moves so do not castigate people who are volunteering, their services and working hard to do the work so that the Community board has a full pallet of information that you can draw from. There will be an ample time for you, guys to criticize review, suggest just like any other consultant that might be working for the community board. In this case, Landmark West took the initiative, but we are working hard on your behalf. Trust me finished. Now I am finished. I now am. Thank you. Okay. I find your remarks so completely incomprehensible that I do not know what to say. Nobody is castigating you. Nobody is criticizing your efforts. Nobody is doing anything other than offering to join in what you're doing and for the as long as I've been involved, you've rejected those requests. So you know what we're trying to do is figure out whether there's some way we can coexist, because we have common goals, all right, I'm going to share it with you. Wait a minute nice guys easy. You apparently do not think we could coexist, and I do not understand why Richard, I say a couple words. I think right now they're working on something and I think what once that piece is finished, they're going to come to the board. But I wanted to ask you about something else. When you were talking about the site, we had created an ABC task force right after we found out that's overseeing a both sets of properties. We met with Silverstein, they could not have been nicer and then they disappeared for a while and that we found out that they had sold the site on West end Avenue between 65th and 66th street. At that point, the silverstone group had been meeting with God Riverside, with lighthouse guild, with some of the electeds with us and with Derote and Wiska, and they had agreed that of the The 60s, the West End avenue site. They would provide some community space, for I believe it was forgotten Riverside, so it and it was very exciting to have that extra space. So I just want to bring that up so that that's part of the discussion when you're talking with them and at some point you know what we, I assume you're going to start some kind of a task force to deal with the with both sides. Paige. What what's your timetable? We I we're waiting to hear back from George James we've been putting a lot of pressure on him. He seems to be a little backlogged, I'm not blaming him. He needs data. He needs to talk to people. Our intention never was to withhold information. Yes, we need you to be a partner. That's one of the nice things about being involved in Landmark West is that I have you all 12 of you present tonight or 11, because I see Richards up here twice being able to assist there's. This is not something we're hiding under a bushel just because it's just that when it goes public, I'm sure Melissa is going to take exception to some of the findings because she represents Silverstein. We want to put our best foot forward with all the facts and resume with you meetings with city planning when everybody has a chance to do to get together, but now is not the time all right look paige, I think part of the problem is that we need to be. You know just we need to know what your timing is, what you where you're headed and when you think it's important for community groups like ours to get involved. I do not want to I we never want to undercut you or upstage you or any of those things. Oh, I do not care about that. We want to do his help. I do not care about that. I want your participation. I just wanted to understand why it was that you were discouraging us from getting involved now and you've explained that your proposal is not really ready. Yeah, there's no formal, as I understand, there's no formal application with city plan. There's been discussions, correct, okay and you will be part of that. We're going to need everybody to make this happen. This is not a private affair. It's just that times are hard. I do not know I'll have tell you what tomorrow I'll reach out to Sean, ask him to touch base with George find out where we are and we'll send it to mark. Can I send it to you and you can forward it to the current members sure that would be helpful, but I you know again what roberta said is absolutely true. I sat in those meetings and the sites were divided and there was no indication unless Melissa has other recent intel. I would suspect not because cranes would have picked it up in a heartbeat that there's any action on that site, but it's we want it to go back. There's no there's! No. What do you call it? We're, not hiding the fact that when we met with city planning, we want to convince them to put it back in the historic district. It should not be a carve out anymore. It was done for one reason and that was to allow the movie industry the TV industry, to take that site, but when they go, we want it to revert back and that's what we're working very hard to do. I think we're on the same page on that in terms of the final goal: page yeah, aj, jolly sorry, I beat you to it good for you, I'm sorry. It's been a long day, all good, so we're having our come by oh moment, I'm taking my hand down for the rest of the meeting. I've said my piece and I'm done. I just want to listen to good happy thoughts. Well, unfortunately, the happy thought may be an adjournment because I think we're at the end of the agenda yeah. I promise I promised loser that it would be shorter than last night's meeting. We still have a couple of hours to go. Did last night's meeting actually. So, if anybody, if nobody wants to revisit the budget issues, I think we can adjourn tonight I'll be in touch with the various volunteers that we have try to set up. You know initial planning meetings, anyone who has information on NYCHA, air rights or any other projects. You know try to circulate them or send them to me and I'll circulate them and look let's you know. The fact that we do not have any euler's does not mean that we can't be active as a committee, exactly good point Richard. Thank you. Oh is not that resiliency application going to come to us soon. The city- wide you learn for resiliency the flood. I just got certified on Monday I'll, send that around yeah it's just one euler yeah. It does not really. I do not think it really applies very much to there's one building in our district. That will be impacted. We're raised we're not in a flood zone yeah, but it's still close. It's that it's that it's a public park for the entirety of our of our waterfront, with the exception of one building at Riverside center. Everything comes around all right. Everybody thank you. Thank you very much. Thank you good to see you thank you guys here again, bye.",
            "summary": "So, while Corey is working on shoring up the talent house, did people see that the park 79 hotel is going to be converted into residences for low- income seniors It's on my block.\nAs you can see, here, we I am going to prepare a a set of a presentation on the development story and lessons learned of Riverside, South and Riverside center, and what I should tell you is that I already a year, ago, actually September 2019, I had been invited to go to come In New, York, big development, and they asked for a panel about talking about what have we learned from older, ones, and I gave a talk on Riverside south of Riverside, Et cetera and the same panel Stan Extra talked about Battery, Park, City, so, okay.\nSaid that this was such a great thing and she wanted to do it with the community for it, and I began to talk to sema at the time, because I thought it was just terrific to have sema who was knowledgeable and knows about planning, but also did not have the history.\nLooking project, It is a great way to do it, and there are many people, and I think there is How did it happen and how is it working out and November 18th?\nIt'll take the place of the of the November land use committee meeting, so we'll recommend that everybody tune into that instead, I'm eager for those of you who may have particularly more interested We very rarely go back to major endeavors that the board was involved with and look at what happened and learn from the history, and I think this is a great opportunity for everybody.\nYou, know Max an hour, probably less, and to have people with questions, of course, I do reference the first projects and the attempts- May I add one sentence, because I see Louisa and Melissa here and one of the perhaps very one, interesting component of this long history is that the their the board always tried to advocate for affordable housing, as in the long struggle of Riverside south, but quickly.\nIs that Riverside center, so many years, later, that the approvals that occurred were to have inclusionary housing and to do the measurement by far so that that's something to look at as to the numbers of units and so on, and I'm really highlighting that, because I'm seeing the two co- chairs and what developed- And it may be, something that you might want to take a look at and what was learned and the same quality in the affordable, apartments.\nYou know what have we learned, but I also want to suggest to you eventually that it may be that this treasure trove, so much from the Community, Board, You know months ago, because I knew all about the history of Lincoln towers, and, of course, but you know this may be eventually an archive that I know the New York historical society has called me just separately to say they are interested in the work of the community.\nI do not know how many of you know this fact, but we had a scheme to eliminate the highway there and instead of having the raised highway going there, we had a scheme to to have it go under Riverside boulevard from 72nd down to 59th street right, so it would be underground You would not have the highway as a detriment to the to the west of the whole site, and that- You recall, the civic groups, made a deal with trump based on the supposition that the highway would go.\nHe was allocating 30 million dollars to rehabilitate the West side, the highway, where it was If. I may suggest to you that to bring things up to date, almost from ethel , can you speak up a little bit, I'm having difficulty The last thing to say is that, as recently as the last three or four years, trump actually said publicly how much he dislikes Jerry Nadler, because he still blames Jerry Nadler for thwarting him in so many years, ago, and continued to feel and actually extended in the last four or five years , First, I do not know how many of you remember the meeting at the public meeting at which trump introduced his original plan.\nI guess I mean do not give away the ending of her presentation, though Ethel had a kind of a love- hate relationship with trump more on the hate side, and when the then chair of the board, I think, was hope, and I went to Trump's office to solicit funds to help us do a study of the years.\nThe 79th street project might give us some insight into the finances of it, but I think it's worth having at least a an initial meeting of a few members of our committee and a few members of housing to see what it is.\nThink the board's on record is wanting that, but maybe people who do not agree so you're talking about in new buildings, as well as conversions of existing buildings, everything, including including city housing, including NYCHA.\nIt's, a program that gets air rights from We. Also the you know, there's this mandatory inclusionary housing, which does not exist in our district.\nI mean, I think, there's potential for soft sites farther south in our district, I'm sure, a contextual rezoning that triggered Mih could make many people happy.\nActually, I, think it will make many people unhappy since it provides very tall buildings in order to accommodate the affordable, housing.\nJust saying you know it's the only way this problem is going to be attacked in any neighborhood We're not going to build 200,000 units in the city, but Other thing we need to do is look at what building sites there are that we need to help get funding for so that can be maintained as affordable housing and not torn down and build.\nThere was a proposal, one time to use a couple of million dollars for that of that in the 79th street project find proposal, but apparently that was no longer needed, so I think we're back up to around 14 million It would be good for the affordable housing conversation to find a home for that Before.\nYeah, I want to caution us against, like planning for NYCHA without I, do not know as people who do not reside.\nYou know from the NYCHA building, but it's always a question of who's going to be benefiting And They fall within both land use and housing, as well as the other points that were just made by louisa and ethel.\nThe second site is the Silverstein site on Columbus, which is the old ABC site, and it's my understanding and that site has the potential according to George James that to the you know, enormous and just you know really unconscionably enormous, and it's my understanding that Landmark West has initiated a request of city planning to put that block into the Lincoln Square special district.\nBut I think we should at least have a discussion in our next meeting about whether, irrespective of what landmark West thinks we should be a little more proactive in that area, and you know, approach, city planning and say: Look.\nAnd I know your Silverstein is your client, but when we were aware that two sites were being sold, West, end Avenue and potentially ABC going down to Hudson yards.\nYou know just we need to know what your timing is, what you where you're headed and when you think it's important for community groups like ours to get involved."
        }
    }
}