{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB14",
            "channelId": "https://www.youtube.com/channel/UCeY0bbntWzzVIaj2z3QigXg",
            "title": "Youth Services Committee Meeting",
            "publishDate": "2020-11-24",
            "shortDescription": "Monday, November 23, 2020",
            "lengthSeconds": "1:24:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB14",
            "normalizedName": "Brooklyn Community Board 14",
            "twitterName": "Brooklyn Community Board 14",
            "youtubeChannelName": "Brooklyn Community Board 14",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC_BAkpXTYFoKdHVRvswVgtg",
            "twitterHandle": null,
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "C4Rq0nqYXUU",
            "fillerWordCount": {
                "uh": 175,
                "um": 525
            },
            "readTimeFullTranscript": "48 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "youth": 127,
                "program": 76,
                "programs": 60,
                "school": 35,
                "summer": 30,
                "leadership": 25,
                "ylc": 20,
                "service": 19,
                "providers": 18,
                "adult": 17
            },
            "wordCountSummary": {
                "youth": 26,
                "program": 12,
                "programs": 11,
                "leadership": 8,
                "school": 6,
                "adult": 5,
                "service": 5,
                "development": 4,
                "summer": 4,
                "councils": 4
            },
            "fullTranscript": "Thank you for joining us. You are at our a breakfast that we had a few years ago. I recognize your name from the list. Yes, I thought you're gonna say you recognize the handsome face, but you know sometimes I don't want to block it out. I know I'm doing your life, so whenever you want to get started, feel free. Take your time. Okay, good evening, everyone welcome to the November 2020 Brooklyn community board 14 Youth Service Committee meeting. My name is Dwayne Joseph I am joined tonight by Jonathan judge, my co-chair you're I think you're, muted, Jonathan yeah, we're not hearing you I can see you but so joined tonight by my Jonathan, the handsome gentleman with the beard and members of our committee and our board as a whole and a few members of the public tonight's meeting. We hope to be very efficient in producing this tonight. So I hope to keep this to about an hour and 15 minutes. If that's, okay with everyone, the meeting is being recorded for perpetuity on YouTube. So as one of my fellow coaches and board members said last week on her meeting, let's keep the language as polite as possible. So tonight our agenda has two items. Specifically: we invited the folks from the department for youth and community development that are known as DYCD to discuss their work force, connect programs. Those programs are things like SYEP, the summer youth employment program, which a lot of people are familiar with, work, learn and grow, wlg and a few others and I'll. Let them touch on those we're also joined tonight by members of the Vista program from the mayor's office to discuss youth leadership councils. As many of you board members know and members of the public who have been attending our meetings know. We have been working to develop a youth committee that is built and or rather Youth, Council, that's built and represented by the young people within the district, so that we can, you know, hopefully, grow future leaders, future members of the community that are civically, engaged and will want to participate in the board and other civic activities as they get older. So with that, I would like to invite Sarah marks from the Department of Youth and community development to speak on the workforce, connect programs, Sarah hi everyone good evening. My name is Sarah Marks I am the director of intergovernmental affairs at the Department of Youth and community development. I know I've met some of you, but not all of you. I know that you know many of you are familiar with our agency, but I'm going to assume just briefly that not everyone is that you might have some newer members here so DYCD. If this is your first time working with us, one thing that's important to know about us is that our programs are all operated by network of community-based organizations. So all of the programs that I'm going to talk about today are supervised by our central office and designed by DYCD, but at the same time they are delivered by organizations in your neighborhood that either operate locally or citywide. So that's just one thing that keep in mind: that's a little bit different about DYCD than other agencies and all of our programs are delivered. We award through the contract process, so that means that we evaluate all of the providers in terms of their experience in the community, their experience, delivering this type of service and and the way that they the way that we that they're graded on an impartial way to make sure that we pick the organizations that are best able to deliver these services. So the you may hear of us more frequently on our youth services side which opera we operate. The after-school programs and community centers Compass Programs, Sonic, Cornerstone and beacon, and we also offer adult programs, specifically adult literacy and some other neighborhood level initiatives. And tonight, I'm here to talk about the workforce development side of our agency, which is known as workforce connect, which is the umbrella term for all of our workforce organizations. So DYCD is charged with workforce development for young people and that's generally up to age. 24 and different programs have different age ranges, but when I talk about youth here, we're basically talking about anywhere from age 14 to 24, depending on the program and there's a little bit of you'll, know, there's a little bit of overlap. Right because at 18 you are considered an adult, so anyone over 18 also has the opportunity to work with small business services at the workforce, one centers and other programs. So I'm, but I'm here just to talk about specifically like the youth-oriented programs in the DYCD workforce connect system. So the right, the biggest one that that is, we mentioned that everyone is very familiar with, is the summer youth employment program, which is our really one of our flagship programs. So I want to give you a little bit of an update because, as you know, this was a very unusual year in that you know when we were getting ready for the summer. We, it was very unclear what we could do safely. Most people were working at home summer camps were not known if they were going to be open at all. That's like a major job. There are a lot. There were a lot of uncertainty about the safety of the workplace, the safety of young people. What was going to be going on with the coronavirus at that time, so we had to make the difficult decision to suspend the usual SYEP program. The normal SYEP program involves youth going out to work sites on a daily basis for a period of weeks in the summer, so this year, unfortunately, we weren't able to do that safely. So we we very quickly were able to put together a new program which was known as summer bridge and so the summer bridge program, which was for last summer, it was really we were able to do. It was a remote program, so the summer bridge program included the career readiness of both like discussions and online components. We used a program called hats and ladders, which was an educational curriculum and it also included project based learning, so service learning, community service, learning about civic engagement and so the projects that people worked on for their for their workplace challenge and for their project-based learning involved. The Census Environmental Justice media literacy, so that was we had to pivot and really change the program this summer. So this summer we were able to serve over 35,000 youth, which you know, as everyone knows. Unfortunately, that is not as high as we have been in previous years, but we were still really pleased that we were able to find something for 35,000 youth with our partners of those 26,000 were in the older youth category. So that's that was 16 to 18. and the younger youth, the 14 and 15 year olds. There were a little bit over 9 and this year because of the more limited scope of the program. We really did everything we could to prioritize youth in zip codes and in communities that had a higher that were in a higher risk, specifically social, economic and health indicators, and that had been hardest hit by Covid-19. So I did bring some of the information about Community, Board 14, so in community board 14 there were two providers that was Canba and the council of jewish organizations of Flatbush Kojo and they were able to so those two organizations in those locations enrolled, 4475, youth, so obviously I can't. You know we can't say for sure where they all live, but I think it's a pretty good bet that they live. You know within the community board, or you know somewhat nearby, so and I asked for a little bit of just like a little bit of highlights from that program, and so the Kojo group told us that you know one of the things that they were the most proud of was that they for their workplace challenge. They worked with the Maimonides Medical Center and they worked with. They hosted 40 youth, who did an examination of the barriers that candidates face when they're trying to enter the health care. Industry specifically focused on like diversity, so they were looking at the problems and coming up with solutions, and you know meeting with the staff there, all that you know remotely this summer and the it seemed like it was a really positive experience both for the participants and for the the the hospital and the volunteers there. So we were, you know we were really. We were pleased with that. So the number overall, as I said, was 35 a little 30 a little over 35,000 city-wide and of those 7,400 were in Brooklyn. So actually your local providers were actually a pretty high number as compared to I'm sorry 12,000 for Brooklyn, that was the Bronx 12 0761 for Brooklyn and of those I said 44 75 from your local providers. Our total budget this summer was 51 million, which is lower than it usually is, but certainly enough to give a robust program we are expecting and all of our planning and all the budgeting assumes that next summer, we're going to be back up to SYEP the way it was previously. Our funding is there, and so we're really hoping that the situation will stabilize enough for us to be able to send youth out into the communities for in-person jobs next summer. So that is the big piece on SYEP and I wanted to also mention one of our newer programs which just rolled out last year, and you know, of course, had the unfortunate timing of starting a new program, just as the pandemic was in the same year as a pandemic, and it's called advance and earn and advance and earn is a program. It's a new program, because we were noticing that the same a lot of the people who needed the career workforce training were also the same. People who needed some assistance, educationally in terms of literacy and high school equivalency. And so the new program that was designed is called advance and earn, and it's for youth ages 16 to 24, and the idea is that it has includes literacy and math skills, help with the high school equivalency test, preparation and also industry, recognized training, credentials and certification, and it involves internship placement so right now we're actually recruiting for the next cohort. It's an intensive program, it's a six months commitment, so these tend to be. These are much you know. Smaller. This type of program tends to be much smaller, so if you go to, I can send over some flyers afterwards and if you go to Nyc.Gov advance, there's information on finding a provider right now these programs are remote, and so we they are in every borough. But at this point right you it's. If someone is interested in working with a particular provider, it's certainly much easier to go to one who's, not in your area, but the the Brooklyn provider is Obt opportunities for a better tomorrow, and each of the programs has a different focus. So the Obt program has a focus on digital marketing and if people when they see on our website, there is someone that focus more on healthcare or you know something, that's a more construction or technical oriented skill, and they are also welcome to apply to that. So we really want to encourage you know if you know, basically, you know 16 to 24 year olds, who are basically, you know not in school, not working who need assistance in the areas of both literacy and career development and then the third piece that I will talk about briefly, that you know I'm going on a long time. Here is our federally funded programs. So we, the city and DYCD, got funding through the federal government for through the workforce, innovation and opportunity act. We call it wioa, it is often I see you put up the link great. Thank you. It's also. It used to be known as Wea the workforce, Investment Act for those who have heard of it. So there's two flagship programs and those are also intensive programs and in New York city, they're, known as train and earn and learn and earn if you've been around for a while, you may know them as out of school youth and in school youth, and we changed the names because they, their old names, talked about who the population was and not about what the program was. So the learn and earn, which is the in-school youth program, is those tend to be paired with high schools and those are aimed at juniors and seniors, who are probably at risk of leaving school and the program. That's a little bit larger and I. Think more people know about. Is the train and earn which is Osy, formerly out of school youth, and so that's also youth up to age 24 who are not in school and not working? And that's very it's very career focused career exploration, although they do have assistance if there are credentials and things that you need to be able to get to that place. So again, those are borough wide and they're, very they're intensive programs. So you know they tend to be smaller. They have a long time follow-up through the federal government and so the wioa in your area there's a few so but the ones that and you can find them all on our website. But the specifics there's a train in urn, which is an out of school youth program that is local through the organization NYSARC and they I think it's a temporary location, so they may not always be in that specific office, but they are located right now in CB14. But regardless of where any of these are they serve people borough wide, they could potentially serve people not in the borough and again right now, they're, all remote, the closest high school program, the learn and earn program is at Abraham, Lincoln, High, School and that's so I know that's the in your bordering community district. So those are our our main programs, although you did mention I'm sorry, work, learn and grow and work learning grow is an initiative through the city Council, and the idea was to develop more programs. That would be that would help youth work year-round instead of just in the summer. It's a little it's a little more complicated because you have to work around business hours and school hours unlike in the summer, and so we do operate. The work learning grow program this year, workload and grow will has about. She has two thousand slots allocated and the program is, it starts up in the fall in the like in the late fall, so we don't have a lot of information about your program, but it is still something that we've continued and it's also in terms of the year-round programming back to the the SYEP is that when we redesign the program, SYEP has components that are really based on different needs. So a certain amount of the slots are we call community based and those are lottery slots for anyone, but there's also a very large chunk that are devoted to specific high needs groups, so some that are specifically for people living in NYCHA development, some that are specifically for youth involved in the justice system in the foster care system. So there's also a program through SYEP that we refer to as career ready is the name of it, and those are programs that are in partnership with schools and so that way the program really wraps around the full year, instead of just the summer time. Those are jobs that are in organizations that are working with the same school throughout the year. So that's another way. At least you know, once we get back to our typical or our previous right world of SYEP, where work sites are safe and it's available. We also have the career ready option for the for during the school year, in addition to work, learn and grow. So that's our quick or review I know it's a lot of information, I'm happy to send more information, I'm happy to take questions, and thank you very much for listening and for being interested in your support of youth, Jobs, Youth employment and workforce development. Well, Sarah. Thank you so much for that very comprehensive overview of the programs and how things are gonna be flowing moving forward. If I just can rECAB a couple of things and then I want to open it up to questions from, and I'd like to do this in some order from my co-chair and members of the board and then to members of the public who have joined but I just want to rECAB a few things so in and specifically in Cv 14, our major providers are Canba and Kojo the Council of jewish organizations of Flatbush, correct, okay, and you said they provided opportunities for 4,475 youth this past summer or was that this year that was this is the summer bridge program. Yes, all right and the the other program you mentioned was advanced and earned, which is the program for the 16 to 24 year olds. The denying school are not working. You said that program is being administered in Brooklyn by opportunities for a better tomorrow, yes and they're, focusing on digital marketing. That's right all right, but are there other programs that are covering other providers that cover other subject areas in Brooklyn or is a fairly small program, put a link to the whole page? So these are remote. So the other providers who are in other boroughs, so people are welcome to apply for those because they'll be doing it remotely. The Bronx is working on masonry and landscaping. There's a commercial driver's license certification with one of the Bronx providers. It has a program with a focus on culinary arts. Queens has a program with a focus on nursing nurses, aides and Phlebotomy Tech and Staten Island. The organization that says direct support professionals so I think that's an office, that's a pretty robust offering around the city yeah and then just to touch on the other programs. The federal programs which you said are funded through the workforce, innovation and opportunity, act, our train and earn and learn and earn, and those providers, at least for CB14 and Nyslark and Abraham Lincoln High School, respectively. The Abraham Lincoln High school program is for the JCC of Coney Island, okay and there's a few other training arms in Brooklyn and those are all on our website. They just need the one that we're the geographically the closest okay I mean would love it if you could share those links with the board so that we can share that on our website and with our members open it up to questions Jonathan. If you have any questions and we'll move to other board members and then the public yeah, okay, so, first of all Sarah. Thank you so much for sharing that information with us and coming tonight to talk to all of us. Obviously this is an unusual period of time, we're in and we've you know been working very closely with the young people in our district since 2008, when we started our first annual youth conference, where we had SYEP as the anchor tenant, if you will of the event anchor presenter and we've had a lot of nonprofits and businesses come to provide lots of different kinds of job internship volunteer opportunities for the young people of our district and put it all in one place, and so of course, this year, a lot of those plans that people got used to got derailed and I know. One thing I think this is great that some of the tweaks and innovation that have happened as a result of Covid-19 and trying to adapt so there's some programming I think that's a great thing. One of the I have two questions here with that statement. One is what do the application deadlines? Look like how many of the programs that you know you've mentioned, which I know, are repackaged versions of other programs that have existed in the past. But what are the application deadlines like so that we can play a better role in advertising it for those young people in our district, the you know the teens and like early 20-somethings that could benefit from those programs and then two. What does the future of those programs look like now that so much virtual and remote interaction has become a little bit a part of the culture, although, like you said it might go back to normal, come next fiscal year, but I just wanted to get your insights on what are the application deadlines for these programs? How do you get into them and how much of these programs are going to shift? Maybe going forward for good as a result, and what might that look like sure, so, I just I do want to clarify the only pro substantially changed as a result of the pandemic is the SYEP with the temporary switch to summer bridge advanced on earth is a new program that had been in the pipeline unrelated to Covid-19 and the the federal programs transitioned to remote, but they did not substantially change this program, so it's really only summer bridge that we had to really rearrange so the right now. Application deadlines, the advance and earn programs and the Weola the train and earn and learn and earn. Those are programs that accept a few cohorts every year. So it's really an ongoing. You know there will be a deadline, but there's always another cohort coming up, so those are year-round. Recruitment and I can put some links and I'll put some links in the chat box after my portion of the presentation is done so that you can see, and we send out email blasts periodically with information about Duicd programs and how to enroll in them and promoting them. So that's like a really that's a good way to keep involved. I. Think it's a really to your larger question about how right the remote programs are affecting us. I think it's we're learning a lot and I think it's some really and some new challenges, but also some positive developments, specifically because I think some people are finding it easier to fit in their attendance because they're, not traveling, they're, not you know they don't necessarily have to get child care if they have a child who's asleep in another room, they can go and sign on so they you know. Some of those things are really have been helpful, but they think it's also. You know a challenging to to really like develop the same level of rapport and what we've seen in our programs not specifically work for us, but just our literacy and our after school programs. You know we've seen in the beginning. There are some of them had a little bit of a you know. It was a difficult transition, but we offered a lot of technical support, a lot of professional development where we offered our providers. You know just provider meetings but ways to get them more familiar with technology. We give a lot of latest programs to come up with the to use the what works the best for them. So, for example, our adult literacy programs found that a lot of programs were doing. They did some phone calls and teleconferences, because that just seemed to be working better for some of the people where others are do much better on a video conference, so I think yeah I do think that it's something that's going to be changing going forward. I think you know we haven't formally redesigned any programs and we're going to have to see how things develop, especially though, if there's a time period like the one that we're in where have you seen, the school system is in person that the school system is remote. Our after school programs switch back and forth. When that happens, when the school systems remote, our after school programs are remote and so I think we're probably going to be seeing it develop right, as maybe certain components will always be remote and or maybe they won't right, but I think it's something where you know we're keeping an eye on and trying to learn as much as we can from from these changes. Okay, thank you very much for that clarification and well I, don't know if we're ready on that email list, but we definitely want to get on that one when all the information goes out regularly, so I'll put a link in the box so that anyone can click on it and sign up even better. Thank you. I do see a chat question that says: can you tell me what is available for 14 year olds, so in terms of a workforce for 14 year olds? That's our younger youth component for our studies, employment program, so younger youth are able to at that age. It tends to be it's more project-based learning and stipends versus a wage and a specific job. The 14 year olds are also not only eligible for the youth employment, but 14 year olds are still in the category. Many of them are in middle school, so our sonic programs, which are middle school after school programs that are comprehensive, that involve enrichment activities and learning and youth leadership and a whole bunch of other things that we didn't talk about tonight. Those are available to 14 year olds, as well as our community center programs, which are located beacons, are located in schools and cornerstones, are located in Niger developments. So there's a lot of opportunities for 14 year olds are really kind of on the line, though like most 14 year olds are not working yet we do think it's important to provide opportunities to introduce them to the world of work and to get them ready to do that. But certainly most of them are not equipped to have the skills to just you know, get up and running and walk into a workplace know exactly what they need to do, but we do have specifically on the workforce side. It's the summer youth employment program, as well as our other youth development programs. So thank you for that question. Thank you. Sarah. Did you have a hand up that and you had a question yeah I do. Can you hear me yes, great? Thank you very much, Duane Sarah. Thank you. So much for your presentation. I just wanted to touch base and follow up on two things. One is you mentioned that Kojo had their the bulk of their summer. Offerings for youth was through mammonities in terms of mentorship and so forth, which was great, but I'm curious how canva has pivoted and positioned their programming, and the second thing was in the Obt category the opportunity for a better tomorrow. So there are different programs in the various boroughs. Can students apply outside of their boroughs? Thank you. So much I appreciate your answer sure. So. Yes, they can apply outside their borough for any of our programs and in fact, now that they're remote, we might see a lot more of that. The difference you know, I think a lot of the times, though our providers are people who are very familiar with the community. They work in and that's something we want and we so we also expect our providers to do their own recruitment, so that's also part of it when they are recruiting, they tend to be recruiting from their local area, probably more than city-wide, but we do see people they're welcome to apply in other places. We even you know for something like youth employment for a summer, youth employment will often see people applying. You know it, but not this past summer right because that was it was all remote, but in previous summers, with the older youth who might want to work in Manhattan, we would maybe see youth who spend a lot of time in the summer with a relative and they would apply for a placement that was near their relatives home so that they could. You know if they were with their grandparent or something. So we do see that a lot they are welcome. So I do. Let me just pull up some of my info. So the summer bridge program, I, don't have a huge amount specifically about how Canba specifically did it, because we did have a lot of programs, and that was just one to highlight, but I do want to I. Just let me pull up my page and sorry just to look at so basically so in the programs, everyone was participating and everyone used hats and ladders, which is this online curriculum, and everyone had project based learning. So some of the options were steam enrichment. There was a program called career clue with sustainability and technology, and again this really depended on their ages. So the Maimonides program that I talked about was for the older youth. So I'm looking to see so our some of our projects were were designed by the providers and some of them were designed. We gave them a library that they could choose from with that. We worked with the Youth Development Institute, so there's a with a program called career, clue and then the workplace challenge is what I talked about with Maimonides. So I don't have specifics on what canva did in terms of their workplace challenge, but everyone who was in the program was expected to to do a pro. It was a project-based learning. It was also a job curriculum and there's a big focus on, depending on the age, there's a focus on skills that you need in the workplace. Things like some of it is things like coming in on time, but some of it is also information about financial literacy. This may be the first time many people have bank accounts. They're often you know the paid with debit cards in the traditional SYEP, and so it's no fee card. But, for example, that's part of the curriculum. We have a standardized curriculum for areas that everyone needs to cover, and then the individual providers have some leeway in determining specifically that either in a traditional year, the specific job placements and this year, the partners for the. Thank you very much. Thank you, sir. Anybody else have any questions. Sean. Do you have any feedback from the board or ask of our guest? Well, I just I'll, throw in my thanks to Sarah, because she's always terrific and always so knowledgeable and appreciate her availability and responsiveness and just as a point of clarification, the mention of Camba and Kojo, as main providers was specific to the summer bridge program. There are plenty there are a number of community-based organizations that receive DYC funding to run DYC DYCD programs in the district, I'm wondering Sarah as a follow-up. Could you send me that list we've received it from DYCD before just a list of all of our Cbo's? Getting funding and providing programs that are supported by you sure, yeah I can I can generate a list of the programs and send that afterwards tonight, I just have the list of the workforce programs, but we do have a list of our of all of our other providers, and so I guess I should make a little plug here, even though I'm using up I'm eating into my other panelists time to mention the Learning Bridges program, which you may have heard about. It's not a workforce program. Learning Bridges is a program for youth who are in blended learning. So if they are in school some days- and there are other days where they need a place to be- we have developed the Learning Bridges program in participation with in partnership with the Department of education, and so that's something that we're actually still actively recruiting providers for. So if you have local providers or local spaces that people that could actually be used for child care situations, we are still looking for organizations that are able to run those and to operate those. So that's that's definitely another piece. So when I send you the list, there may be some Learning Bridges on that list as well. Thank you, so much Sarah I, don't see any other questions or any other hands raised. So in the interest of time, I want to progress the meaning forward. Sarah again, thank you so much for your time. We appreciate you and we look forward to any information you can share with the board about DYC and its programs. So thank you so much everyone. So up next we have Rachel Okatowski I, hope, I'm saying that correctly from the Vista program of the mayor's office and Rachel will be presenting on the Youth Leadership Council. So Rachel are you there? Yes, I am thank you so much for having me so again. My name is rachela Patowski and I am a Vista member but I work on Youth, Leadership, Council's programming and tonight I'm here with my colleague, Kimberly Martinez, who will be co-presenting a little bit about youth leadership, councils and our office of NYC service and how we can best support your community board with what we offer in our programming. So I will begin to share my screen with you all shortly Kimberly. Why don't you introduce yourself good, so hello, everyone, as Rachel said my name is Kimberly Martinez and I am the outreach specialist Visa with Youth Leadership Council, so I'm hoping of course to that you know, provide a little bit more info of us. What we do the supports that we offer to you all so yeah! Okay, can everyone see this green? Yes, let's see great, so we're going to move forward with our presentation. So this is our typical info session, powerpoint deck that we share with interested nonprofits schools, city agencies, community gardens, nature residents, NYPD precincts to talk a little bit about youth leadership. Councils is a program that emphasizes both youth and adult partnership and for your community board, specifically in having that youth adult partnership that can be reflected in a multiple ways. It can be with participation within your community board. It can be receiving feedback from youth within their local community and also helping develop projects and initiatives together. So without further ado, I'm going to pass it over to Kim, okay, so you're against just the only kind of the so yeah, so we're going to start off with NYC service before we really touch on use leadership consoles, and that really is to go on to the kind of the connection between Ylc and Yc, being the acronym for youth leadership, councils and NYC service, so NYC service. Of course you know started it really in response to the president of the time, which was like Barack Obama, his call for volunteerism and service. So that's really what started NYC service at civic engagement component? Very important and really goes ties into our mission, so the mission of NYC service is building the partnerships to deepen and expanding civic engagement through volunteer and service program, creating sustainable change for our city's greatest needs, and the vision is being really that United New Yorkers in service to advance lifelong civic engagement for more equitable and inclusive city. So, as you see like this is kind of that overall civil engagement, but I, guess Richard you go to the you could get the, but you know it's like. Even with ylc, it's like. Oh recognizing that there are gaps and what can we do to really? You know work on those gaps and lessen them so with that is also, you know, some of our values and beliefs, which is participation on diversity of inclusion, community and collaboration so being in our values, the things that we really focus on participation. You know lifelong civic engagement, that it is a right, a privilege and a responsibility of every New York City resident diversity, inclusion that all residents have value and live experiences, essential to finding solutions to community and city challenges so trying to be as inclusive as power as possible. Even if it's also accessibility, different things that sometimes we forget or don't include in some of our maybe could be something simple as like. Your events programmer even and like the workforces as well, and then community on volunteerism and service exists in many forms across NYC and each are assets woven into the city's democracy and I. Think that you can see with like volunteerism and service can even be you know the merit corps. That's under you know, do programs under NYC service and me also being a Vista member, I'm showing that you know community importance and collaboration just that the present and future of our city depends on residents working together across communities and sectors. So, of course, wanting to this collaboration across all the you know the five boroughs of New York, City and Richard. You could go next and that's like tying. This into ylc- it's like you, may be like okay, civil engagement and what's service, but it's also then recognizing this gap with you know, hearing our youth youth voices and really started back in 2014 in just wanting to have the space for youth for them to voice out or you know, create actual change, and you know organizations if it's NYPD or if it's different, you know places giving them a voice, and so that's how our you know, NYC ylc's started, and it has definitely branched out to all five boroughs. But it's going back to that civic engagement. You know that is important, no matter your age, you know your background. Everybody should you know, have that startup be able to be civically engaged so providing those opportunities is important. So with the youth leadership councils you know, is that NYC service partners with city agencies, communities based organizations- you know even NYPD precincts, like I, said to just host these ylc's and community communities across, and you know across New York City, which really is like all five boroughs. So each ylc ties into a city-wide network working collectively to impact important local or topical issues and amplifying youth voice and civic opportunity like if you see even in our logo, youth voice counts. So that's really is going into kind of our essence, just that wanting to give youth more of that voice, a space, a platform for them to really be more involved things that matter to them and that's why, on with the different ylc's that we have is definitely different focuses, but it's also collab going back into that partnership with youth so and what we you know. As the you know, you, the youth leadership team provide, is definitely support with all these councils. This you know wider network that, yes, you know, maybe an organization may have their own ylc, but on the day, they're part of this wider network- and you know us as the well seen ylc team- is young being able to just provide that support, bringing everybody together if it's like through professional development events, consultations supports even with recruitment and then any concerns or issues that maybe a council may be having and even just help with. Since there's different focuses on projects on like events that they, maybe the youth want to focus on if there needs more guidance, a little an example, maybe from a different council that we definitely provide that yeah and then pretty sure you could go next, so the mission of Ylc so to ensure equitable access to transformative civic opportunity for all NYC high school youth. So yes, if you see here, you see like high school youth. That is the preferred kind of the group, but we have been kind of flexible and if it's a little below or after it's fine, you know the focus is more on high school programming. So it's like you, don't so much have to be in high school. But again it's really. We have been flexible with different organizations on that too, and, of course, all NYC youth. So we don't want it to be a hindrance that you know, maybe if it's like in a different world, maybe backgrounds that you know you may not be involved with this council and we're working towards. You know, of course, getting our word out more towards different areas to definitely be more inclusive in that area, because I. We definitely believe that you know everybody should be able to be involved with this opportunity. So with the vision, it goes that every you know, NYC high school student is equipped with the skills needed to build stronger communities in an inclusive city. You know, starting now on you know, bringing opening needle to these opportunities so with our values. I know on the slide parts, all the youth and adult partnership already, but these are very, like values are like our core things that we really want to emphasize and work on. So with youth and adult partnership, I'm just going to start there, because this is really something that we always go back to, because it's really pivotal to even like the success of the the program. The consoles is that it is a youth and adult partnership. It's not you know. One is more above than the other. We don't want it to be like a hierarchy. We wanted to emphasize that it is a partnership. You know just to really cultivate that positive, authentic relationship, and you know, building like intergenerational bridges and healthier communities that you know this is collaborative. This is something done together. Not that one is, you know more knowledgeable of the than the other. You know, of course, working together that way, and that is even throughout the project. If the focus is you know, separating responsibilities and things like that, so youth and adult partnerships, not anything else and then for our other values, is justice and equity. Of course you know, there's gaps and just working towards to you know, eliminating those gaps and being more inclusive, even within our own consoles. So acknowledging there is, you know this gap and that all you should just be involved with it, and the systemic change is that just the power of youth voice and action should transform New York into a more fair and just city. So you know with getting more of these councils across different organizations so that youth voice are involved through. You know all these different organizations on even on you know us as NYC service. We have our own on ylc just so that it's incorporating, of course, that youth voice, even with us and then acid-base approach is this is super important. It's like we want to focus on communities that their asses the assets of the youth. Now I'm trying to be like okay, what is lacking or what we think is lacking now focus more on what is the strength, the expertise? What is the youth bringing and they have a lot to bring so really using that to drive some change and then lifelong development is just that it's investing in powerful civic opportunities that can really spark a lifetime engagement. You know like what you doing here could really start there. You never know like their careers and in the future, or even being involved, like even things like registration, voter registration, which is important and yeah Rachel. You could go next and if you didn't get the importance of youth and adult partnership, we actually have a whole slide on this, just because it's really super important to us that you know that is. This is an environment of mutual trust and respect that you know develop joint partnership leading to knowledge building experiences. There's like I, said before these shared roles and responsibilities that this is of course more like broken down when we actually provide a civic action guide. I can send this over also in the email which breaks down. Ways to you know provide these. You know the stuff for mutual trust and what we do to ask the support so yeah, it's a collaborative decision making process- and this could be even you know in the council as well like how the decision being made a goal again goes back to the action guide. That's something to look at and, of course, we're here to help with that process as well, that you know we just really want to emphasize that youth. You know, being the co-creators, and you know developing topics, oriented discussions for meetings and really like again neutral learning environment, go ahead, Rachel, so I just wanted to take this moment very briefly, even if it's just one or two or even if it's in the chat. It just goes back to this question, like what does youth voice mean to you and your organization and, if possible, if even if it's in the chat, write down the answer to this or even voice it out, you could mute yourself and if Rachel, if you want to kind of model, it feel free to do so sure. So if anyone wants to participate and share what youth voice means to you and your organization, we would really appreciate that youth voice that we find within our own youth, Leadership Council and within our network of youth groups. Around New York City is incredibly powerful. It's insightful, especially when topics address youth, specifically when they're at the forefront of the decisions, and they are the ones that are part of the conversation that will impact you know not just them as youths but others as well. So we find that youth voice is important. It's informative of our decisions. It's also represent representing our populations, and we do what we can through our youth, Leadership Council trainings professional developments, to continue to foster and enhance that youth voice amongst both youth and adults that work in partnerships. If anyone else would love to share, we would love to hear your feedback see that anger. That has a hand up, but I'm not sure if that's done before you're more than welcome to, if you have your hand up to share, so it was actually from before. But you just sparked a question from me to you actually so to confirm or to better clarify and thank you for your leadership, bringing this these programs forward for our review and understanding. So, but with your various youth leadership conferences within the different boroughs. Is your goal to have youth and adults partner in identifying needs and then under the matrix of the ylc, try to arrive at solutions, so you're solutions driven once the needs are identified and and I'm curious in a real world situation. Let's say: there's a garden that needs setting up or there's a fallow part of land. We don't have to have a lot of unused land, but, let's just say there was, and or if there's a food issue, how would those things under the auspices of your youth, Leadership, Council, be identified and then trouble shot and then brought toward action? Thank you very much, no problem and so to answer your first question. This is why we are here we're here to provide tools and resources to help unite both youth and adults together, to make observations, to do research and to implement action plans. That is our curriculum and program year. Trajectory in terms of, do you mind repeating the second question, so not at all, but it's it's more a step off from your what you just mentioned, which is what the ylc is. So are you I'm not clear if ylc is divided per borough or per initiative so and who they ultimately feed back to? But how needs within a community because there are so many communities within communities how those needs are identified, pairing together with willing adults and interested high school youth generally, and then how solutions would be arrived at? Who are those invested partners and then how is? Does it become an act actionable and deliverable so that the need is therefore it's identified? Actions are created and then it's brought forward to offer some relief or an outcome-driven process. Does that sure clarify yes and I? Think the rest of our presentation will get more in depth with it to identify to make observations, to identify a focus area to implement these action plans. Our Youth Leadership Council network this year consists of over 80 ylc's throughout New York city. They are located in different types of spaces, community-based organizations, non-profits schools, nature, residencies, NYPD, precincts, community, Gardens, health and hospital facilities, city agencies just to name a few and within those localized spaces. That is where the dynamic begins in identifying the issues to create change. Yeah and just the goal is that if there's I'm just going to kind of define a whole site because essentially a wholesale would be kind of the you know, let's say, for instance, I could even say us. You know the ylc team, you know we can be also considered as a whole site, since we have our own council and which is more into kind of like with our I think believe, like 15 youth and that's kind of the more like okay, smaller version of the console and with that is that we may have a focus area. But essentially the projects involved is very much like brought down to the youth and even those steps and even those meetings it bought down to looking back to our guide, which is why we're emphasizing a lot this guide, because it goes into even the first beginning, steps of building that trust, which is very essential before jumping into anything. You know building that trust, that you know that this is something that we want to be collaborative a partnership and it's important that it's done in the beginning and even like, even something as much as small, as or even as important as community agreements, on from the jump and for even with the topics and the more stuff I don't want to get too in depth because it is kind of the s. It just follows this model of how you go to each step and what you can do, and even example, activities or different choices that can be done to kind of flesh out different projects to lead to what you said like the action, if I may interject Kimberly- and it sounds like some of the questions may be answered if we get through the presentation. So just in the interest of time, if we just want to get through the presentation and have folks ask their questions afterwards sounds good all right. Thank you. Okay, I can take it from here, so our program is rooted in policy practice and advocacy, and these are different avenues, and this can include all three. A combination of two that a project focus is developed within your youth Leadership Council in closely identifying a focus. It can be rooted in policy understanding the laws and governing concepts of the host site or organization, as well as the community in which they serve or provide in suggesting or influencing change in practice. Reviewing the process of everyday work being done within the host site or organization or and or around an issue impacting their community and suggesting or influencing change and advocacy, is very straightforward, giving a voice to a cause to raise awareness and influence, others to improve the health and well-being of their community and through these avenues with our guide additional supports, monthly professional development workshops and trainings offered for or both of our youth and adult members policy. Practice and advocacy can be achieved within the youth leadership councils. We have five stages of a ylc. The first stage is in investigation, and this is done through team building and building trust amongst the council. Finding out the interest, skills and talents of your Youth Leadership, Council youth members, learning about community assets and needs asking questions, conducting action, research and identifying that significant issue to address investigation leads to preparation. Once the investigation is established, the Youth Leadership Council works towards a solution by clarifying roles and responsibility, organizing a plan building a timeline using project management and having youth gain skills to carry out the plan. Action is carrying out that plan through policy practice and or advocacy, and through this entire program year experience reflection is key as well as demonstration documenting the progress moving forward. These are some of the topics. Youth leadership councils focused on in our previous program year in a program here, follows the school calendar. It begins in August and ends in May. This is a diagram and how we forecast out the program year. We begin with team building. We encourage youth leadership councils to I, get through the investigation and preparation stage. This also builds into community research and planning oops I apologize. Then we transition into taking action and creating change and by May within our program, Timeline youth leadership councils from all around the city will have the opportunity to present the work and focus that they've developed I'll program, your long in monthly or bi-weekly meetings with their leadership council. These are some of the supports that NYC service offers to a host site. This is a process that takes a network, a team, and so we offer guidance and consultations for enhancing or establishing a youth leadership. Council our organization portfolio is diverse and no youth Leadership Council is the same. So we support in that, because we want to make sure that to achieve specific engagement amongst young people and to make sure that young people have their voice as a success. As Kim mentioned, we have the youth civic action guide. This is something that we can distribute after our meeting today, and this is something that, on a monthly basis, we're expanding our portfolio, personal development workshops to discuss doctors with. We have virtual networking events for both youth and adult facilitators and monthly, virtual trainings and workshops for both youth and adult participants and at the end of the program year, which is mentioned in May. There's a certificate of recognition awarded upon completion, so the ylc program has has transformed both youth and adults. Adult facilitators may not by day-to-day work directly and engaging youth, but their confidence levels increased by 56 percent in supporting young people to better understand their strengths and challenges through the experience and supports adult facilitators. Confidence levels increased by 40 through experience and supports when guiding the youth to carry out their yearly action plans. Civic engagement within young people is a theme that many different agencies and organizations are addressing and we found that young people's confidence levels increased by 23 and knowing how to use their interests and skills and making a community better. We have also found from our data that the confidence levels of young people increase by 20 and seeing the value and importance of community participation and we strive each and every year to increase those numbers. So at this point we would love to open it up to questions from the board. Thank you so much, ladies. So again, just in the interest of maintaining some order here, Jonathan as co-chair, do you have any questions, then we'd like to open up the board members if they have questions yeah I mean just to clarify. First of all, thank you for the presentation. I think this is a fantastic initiative to really provide a process and a framework for engaging young people in a variety of different capacities and creating like a patterns that could happen in an efficient, productive way, so I think that's kind of very much in line with the type of work that we trying to do with really just engaging young people teens in particular in our district. You know again through our youth conference, that we hope you know behold each year. So my main question is this: when you help an organization interested in forming a youth leadership Council when you do, that, is it normally when that organization says hey, this is the framework like this is what the end product will be. That, or this will be the I, don't know this will I guess I'm gonna say there's a project in mind. What is a way in which this project occurs annually from like that, August to Maine like we were talking about, and is that usually something that the organization figures out? First, when working with you to go through the process of getting things in place or can an organization say hey, we would like to have one and then will you help us guide the most efficient. You know guide us on the most efficient path towards kind of a project. So what usually happens first in that process, we find that both possibilities have come up within our network, it's good to have a plan of or area of focus beforehand, but through our work with youth adult partnership, it's important to have youth input within establishing that process, of course, but we do find that organizations come wanting to start a youth leadership Council not knowing how to organize it, and so we can jump in at step. One: okay, thank you for clarifying that and then I guess, just because it is it's pertinent to us. Have any of the other ylc's and organizations done something like a youth conference such that, what a ylcba a wise use in terms of maybe giving purview and putting together such an event like that as like, has any of the end products been events which might have served themselves like serve that you know teenage early, 20-something demographic, yes, and we actually find a lot of young people specifically for that for a focal project or throughout the program year of Ylc hosting events. Some examples that I can provide for you right now is the DOE office of Sustainability. Each year puts on a youth climate summit, their ylc members help coordinate it and also facilitate sections of it for both staff, administrators and students. This summer, the Brooklyn district attorney's office, their ylc, put together a town hall that included representatives from the borough president's office, members of the NYPD to have a discussion dialogue about current issues within the community events are something that is commonplace within our network and when Ylc's put together an event. We share that throughout the entire network for community support and youth part and adult participation. That's that's! Okay, great! So there's a question for that and just well I guess one more question: I, just I guess for procedural purposes. So if the cycle starts August to may, if we were to, let's say work more closely with you and pursuing this, you know this is something we have a strong interest in doing what does it look like to like? How do we kick that off if we were to engage with you that way to put this together like? What would the steps be given that I guess the official program kickoff for the actual ylc wouldn't be until let's say August or so only currently go ahead? Kim yeah just gonna I, guess like then you can go Rachel's plea so that, yes, typically it is August on to may, but we haven't flexible not only just because of Covent currently, but also in the past, because, for instance, our green thumb on in the past has their program year has been like started at a March to October. So it goes to show that it's not the set in stone, but it does typically follow that program year, but I know currently a lot of rylc. You know, of course, providing that support and being mindful that everything is going on. A lot of them are starting in January, so it's just also being my flow of everybody's capacity. You know the situations going on currently too. We currently have info sessions available where we can answer more questions and connect on December 8th, and we have ongoing orientations once your organization enrolls as a host site, that we can involve you with for workshops and trainings. You know further opportunities for support and just let's say, even if you were to start later, you're wildly that doesn't prevent you from attending these trainings you're. Definitely on we share these trainings even beforehand. Okay, thank you. Jonathan I, just also, if I can ask just as an alternative to a more structured format for your support to organizations it does. The Youth Leadership Council does Ylc have a mechanism where, let's say we wanted to kind of get moving on this and start collecting names of students and possible youth that are interested. Are you guys able to then help the young people build out a framework? If we're there as somewhat of a guide as to how we want them to engage with the board itself, we can provide the consultations and strategic sessions of instruction. We can provide an observation, but within a youth leadership Council, it's the organization primarily engaging with the young people, but we do offer support within enhancing that and helping you along the way. Okay, great, all right with that opening up to questions from the board and then questions from the general public that are participating tonight. I have a question: this is Nikki. Is it okay if I asked I had my reason? Sure? First of all, thank you for the presentation and hi Dwane and Jonathan. Thank you for leaving a good meeting. I had two questions. The first one is kind of related to Dwayne's question like what is the experience of getting involved with this from a kid's perspective like how do they find out about this? How do they end up with the specific code site pro site? Is it like? We recruit kids that would be interested, and then they form a youth council, so just speaking to it from the shoes of a young person, how do they find out about this opportunity? Because I think mostly, we've talked more about from the administrative or host site perspective. So that's question number one: what is it like to get involved with one of these as a kid and then my second question for the two speakers is, you know: do you have an example that comes to mind of a youth leadership Council where you were like wow? That was great. That was really fulfilling for both the kids involved and for the host organization and the reason I'm asking that question is I, actually work for a non-profit, that's a youth organization. We do like study abroad and we have like super failed twice at getting young people involved at planning this conference about exchanges for young people. So you know it's. Actually it can be hard to do that right to get young members involved in a way that's really meaningful both for them and for the adults right so again, just to rECAB. First question was: what is the? How what is it like to be involved with it to get involved or find out about a youth, Leadership Council as a kid and the second one is: do you have an example of a really successful youth leadership? Council that comes to mind and what made it really successful as a project? I guess I'll touch on the first one, so for youth, how they kind of find out a little bit more. Of course, you know there's our platforms website, but we also have different, like kind of advertisements different things that we do even like I know, I think briefly. I think now is off, but we had the bus ads so on different stops. All around the world. We had our you know kind of like saying, like join a youth leadership console and like even with the website, and also even with a QR code across all across the different worlds. Recognizing that you know different access, and so that's like another way you find out- and you know, for some host sites who are looking for maybe aid in recruitment. There is this like site on of that use can apply to, for that select site to join their console. So that's another way that you can join, and sometimes it's even just reaching out. Let's say this ylc's on the instagram: they send some access and we kind of didn't just direct them and to maybe a select spot through the application, and it generally comes down to this application, because some posts I also be mindful. They already have this group of youth already, where they don't need that help in recruitment, for instance. Additionally, with recruitment, we offer a professional development workshop where we discuss recruitment, how to elevate and enhance your recruitment process internally within your host site externally, and how to stimulate peer-to-peer recruitment. Having members help spread the word about your Youth Leadership Council, and we actually just had this training I believe it was last Thursday a memorable story from last year about a youth leadership Council. This was the department of buildings. Ylc was the completion of the program year in the youth presentations. In our program year, we were disrupted with the ongoing changes and adaptions needed because of Covid-19. We received a lot of feedback from the DOB ylc and sharing that youth continued to come to meetings they adapted from the in-person meeting space to virtual, and they were able to complete their projects and give presentations on sustainability and building safety codes to members of leadership at the DOB. What was a really wonderful takeaway from this experience, especially it being a first-year Youth Leadership Council, was the youth feedback and input. There was the department of buildings will continue to be part of our network this year, but with the uncertainty of Covid-19 they have. The agency had not yet made a decision, but young people during their presentations in follow-up shared that they would want to continue their youth leadership Council, even without the the consent and approval of the DOB. It showed that community was made in that space and that there's development and the opportunity to continue to grow and make change. That is that's a great anecdote and thank you for sharing that. So just you know again in the interest of time that we have one registered speaker for the night or who's asked to present something from a young person I. Thank you both ladies Rachel and Kimberly, for being able to present tonight to us. We hope that you would be open to following up with the board, with some of the information you offered here tonight that wasn't in the presentation and again, thank you with that. I'd like to open the floor to Mr, Olamide, Farameiro I believe it is, and you can let me know if I'm pronouncing that correctly olamido again, because time is a constraint. I can allow you two minutes tonight: okay, to I, understand you're, working on a school project and have a question and you have a deadline to meet so I can allow you for two minutes two to three minutes maximum. But then we've got to close out our meeting. Can everyone please? Can everyone hear all the meeting? Yes, okay, go ahead, my name is olamide Felimero, I'm a graduate student from the City University of New York public. We I'm yet to advocate on what's called the resolution condemning the Trump's administration for the cut of people enrolling as Fusdan for more than three million people, so I would like to know which one style does go straight to the probe. We all know what the food stamp does is the first defense that the fragrance puts in place for hunger, in which it allows for the provision of to families with low incomes and need financial assistance. So my advocacy is basically on, like oh yeah, the resolution for the condemning, because when was it called the president passed a bill to cut this benefit or program in people? It's ultimately you living like people. You know a lot of people angry in the country and now, when you have like speaking of living in Brooklyn, is too precise, where there's late to or no jobs. What you're supposed to say, New York is a dream or where you come in, you get the american dream. Are you supposed to get a job, but mostly there's not job for everyone, and most families have to like benefit of this benefits. Now, once you cut that off, you're leaving so many kinds of kids hungry I would like to talk more about this because, like I said there's so many stakeholders to this, but because of time and everything I will just keep it. This short, and if anyone has a question you could just you know, email me anything. I'm gonna drop my email right there and everything, because there's no more I won't talk about, but because of time and I don't want to take anyone's time. That's it well! Thank you very much for that olamide. Please do share your email address. If anyone has any questions around this particular policy olamide, if you could also drop the information on the policy itself, that you're asking people to consider. Please do so, and you know folks are free to contact Alameda directly with their opinions around that I do want to before Jonathan. If it's okay with you before we close out for the evening I see here that we were joined by detective Kim Walker of the 70th precinct, one of our amazing community affairs officers, so I just wanted to acknowledge you Kim. This was a lot of good information that I'm gonna pass on to my ceos, our new coordination office, or we get this runner. We will be a part of it so good job. Thank you so much. We appreciate you being able to join. We know it's really busy out there for you guys. So thank you. So unless anyone has any other business, I would like to make a motion for us to adjourn this. Oh wait, one other piece of business Nikki if you can see it and that beautiful little baby there who has way more hair than me, I'm still I'm jealous of that, but congratulations by the way Nikki. But with that I would like to make a motion to adjourn this meeting. Anyone for a second, then all right. So this meeting of the Youth Service Committee is adjourned at 7:56 p.m. Good night, everyone- and we will see you at the next General board meeting in December, Thanksgiving, happy Thanksgiving, take pictures, happy, Thanksgiving, everyone good night, everybody.",
            "summary": "Specifically: We invited the folks from the department for youth and community development that are known as DYCD to discuss their work.\nThose programs are things like SYEP, the summer youth employment program, which a lot of people are familiar, with, work, learn and grow, wlg, and a few others.\nLet them touch on those we're also joined tonight by members of the Vista program from the mayor's office to discuss youth leadership.\nSo with that, I would like to invite Sarah marks from the Department of Youth and community development to speak on the workforce, connect, programs, Sarah.\nThis is your first time working with us, One thing that's important to know about us is that our programs are all operated by network of community-based organizations.\nAll of the programs that I'm going to talk about today are supervised by our central office and designed by DYCD, but at the same time they are delivered by organizations in your neighborhood that either operate locally or citywide.\nRight, because at 18 you are considered an adult, So anyone over 18 also has the opportunity to work with small business services at the workforce, one centers and other programs.\nSo I'm, but I'm here just to talk about specifically like the youth-oriented programs in the DYCD workforce.\nThe normal SYEP program involves youth going out to work sites on a daily basis for a period of weeks in the summer, So this year, unfortunately, we weren't able to do that.\nWe used a program called hats and ladders, which was an educational curriculum and it also included project based learning, so service, learning, community, service, learning about civic engagement and so the projects that people worked on for their for their workplace challenge and for their project-based learning.\nAnd I, asked for a little bit of just like a little bit of highlights from that program, and so the Kojo group told us that you know one of the things that they were the most proud of was that they for their workplace.\nAnd you know, of course, had the unfortunate timing of starting a new program, just as the pandemic was in the same year as a pandemic, and it's called advance and earn and advance and earn.\nSo the new program that was designed is called advance and earn, and it's for youth ages 16 to 24, and the idea is that it has includes literacy and math skills, help with the high school equivalency, test, preparation and also industry, recognized, training, credentials and certification, and it involves internship placement so right now we're actually recruiting for the next cohort.\nSomeone is interested in working with a particular provider, It's certainly much easier to go to one who's, not in your area, but the the Brooklyn provider is Obt opportunities for a better tomorrow, and each of the programs has a different focus.\nThe specifics there's a train in urn, which is an out of school youth program that is local through the organization, NYSARC and they.\nBut I just want to rECAB a few things so in and specifically in Cv 14, Our major providers are Canba and Kojo the Council of jewish organizations of Flatbush, correct, okay, and you said they provided opportunities for 4,475 youth this past summer or was that this year that was this is the summer bridge.\nAnd, we've, you know been working very closely with the young people in our district since 2008, when we started our first annual youth conference, where we had SYEP as the anchor tenant, If you will of the event.\nWe've had a lot of nonprofits and businesses come to provide lots of different kinds of job internship volunteer opportunities for the young people of our district and put it all in one place, and so of course, This year, a lot of those plans that people got used to got derailed.\nAlthough, like you said it might go back to normal, come next fiscal year, but I just wanted to get your insights on what are the application deadlines for these programs.\nYou know a challenging to to really like develop the same level of rapport and what we've seen in our programs not specifically work for us, but just our literacy and our after school programs.\nYou know, I, think a lot of the times, though our providers are people who are very familiar with the community.\nBut I work on Youth, Leadership, Council's programming, and.\nA little bit about youth, leadership, councils and our office of NYC service and how we can best support your community board with what we offer in our programming.\nThis is our typical info session, powerpoint deck that we share with interested nonprofits, schools, city, agencies, community gardens, nature, residents, NYPD precincts to talk a little bit about youth leadership.\nThat's under you, know, do programs under NYC service and me also being a Vista member, I'm, showing that you know community importance and collaboration just that the present and future of our city depends on residents working together across communities and sectors.\nYou know, is that NYC service partners with city agencies, communities based organizations.\nEach ylc ties into a city-wide network working collectively to impact important local or topical issues and amplifying youth voice and civic opportunity like if you see, even in our logo, youth voice, counts.\nAs, the you know, you, the youth leadership team provide, is definitely support with all these councils.\nAnd, you know us as the well seen ylc team- is young being able to just provide that support, bringing everybody together if it's like through professional development.\nSince there's different focuses on projects on like events that they, Maybe the youth want to focus on if there needs more guidance, a little an example, maybe from a different council that we definitely provide that, The mission of Ylc so to ensure equitable access to transformative civic opportunity for all NYC high school youth.\nSo with youth and adult partnership, I'm just going to start there, because this is really something that we always go back to, because it's really pivotal to even like the success of the the program.\nThe focus is you know, separating responsibilities and things like that, so youth and adult partnerships, not anything else, and then for our other values, is justice and equity.\nSo acknowledging there is, you know this gap and that all you should just be involved with it, and the systemic change is that just the power of youth voice and action should transform New York into a more fair and just city.\nOur, Youth, Leadership Council network this year consists of over 80 ylc's throughout New York city.\nYou know the ylc team, You know we can be also considered as a whole site, since we have our own council and which is more into kind of like with our I think believe, like 15 youth.\nThe process of everyday work being done within the host site or organization or and or around an issue impacting their community and suggesting or influencing change and advocacy, is very straightforward, giving a voice to a cause to raise awareness and influence, others to improve the health and well-being of their community and through these avenues with our guide, additional supports, monthly, professional development workshops and trainings offered for or both of our youth and adult members.\nFinding out the interest, skills and talents of your Youth Leadership, Council, youth, members, learning about community assets and needs asking questions, conducting action, research and identifying that significant issue to address investigation leads to preparation.\nYouth leadership councils focused on in our previous program year in a program here, follows the school calendar.\nWe transition into taking action and creating change and by May within our program, Timeline youth leadership councils from all around the city will have the opportunity to present the work and focus that they've developed I'll program, your long in monthly or bi-weekly meetings with their leadership.\nIt's good to have a plan of or area of focus beforehand, but through our work with youth, adult partnership, it's important to have youth input within establishing that process, of course, but we do find that organizations come wanting to start a youth leadership Council, not knowing how to organize it, and so we can jump in at step.\nTonight: okay, to I, understand you're, working on a school project and have a question and you have a deadline to meet so I can allow you for two minutes."
        }
    }
}