{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "title": "November 2020 CB8M Zoning Committee Meeting",
            "publishDate": "2020-11-18",
            "shortDescription": "",
            "lengthSeconds": "3:48:35"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "c5WCtTQTc7k",
            "fillerWordCount": {
                "uh": 361,
                "um": 279
            },
            "readTimeFullTranscript": "122 min read",
            "readTimeSummary": "19 min read",
            "wordCountFullTranscript": {
                "blood": 129,
                "center": 118,
                "building": 100,
                "zoning": 83,
                "project": 63,
                "street": 57,
                "feet": 54,
                "slide": 50,
                "proposal": 47,
                "park": 42
            },
            "wordCountSummary": {
                "blood": 40,
                "center": 37,
                "zoning": 19,
                "building": 18,
                "proposal": 14,
                "project": 13,
                "concerns": 10,
                "block": 8,
                "street": 7,
                "position": 7
            },
            "fullTranscript": "You Elizabeth are you on yet Max. Have you been able to find Elizabeth yet? Yes, I did I renamed her as well with the double spaces, to put her towards the top, or at least I thought I did a second ago. She should be there. I can't understand you. I can understand you, but I can't understand. Max is Elaine, yes, Elaine's here right. Okay, do tell me when you want me to start the meeting and then I'll introduce people I think we could start at 6:30. So if that's good, but you will I'll start it, then! Yes, please, okay! Welcome all you, millions of people to the zoning and Development committee meeting for November for community board eight. We have just three items, but they'll probably be very extensive. Elaine, Walsh and I are co-chairs of this committee and the first people will be the people from the blood center who will be presenting their proposal and Elaine will introduce them if they're here. Thank you, Elizabeth. Let me before I introduce tell you how this part of the meeting will run. The blood center representatives are here to present their proposal. After they have presented, we will have questions and we start with the public first and then, after the public. We will start with the board members now, since we have about 185 people, you all may not get to ask your question, but you can always contact the board with your question. Possibly what will happen if people are asking the same questions I may ask you to consolidate so with that I will start with the representatives here. I hope, they're here, Dr Chris, Hilliard, Donna, Gorgano, Paul, Silva, Melissa, Sacco, Peter, Shilbert and Julie Greenberg. They will be presenting and then there are other people who can answer some of the questions that may come up. Okay, so are you all here from the blood center? We are then we'd like you to start your presentation. Thank you for coming. Thank you, Elizabeth. Thank you very much and thank you Elaine and if Elita is on thank my thanks to the chair and to will as well good evening. Everyone thank you for the opportunity to address the Zoning committee as well as community board. 8. I feel like we're neighbors, as the blood center has been smack in the middle of the community for 65 years almost and we're very happy where we are very proud to be part of the community when we switch to the slide view in a minute, I'm going to run through some slides that talk about the blood center and some of our accomplishments and some of the things that have happened during Covid-19, as well as the plan for a new building on our site, which is why we're here and we have a number of people from our team and as well as some of the experts in zoning and the architects to help me present this evening. So we'll do that and then, as Elizabeth said, I understand we'll go to questions so again. Thank you very much. I hope you're all doing well, because Covid-19 is quite the time and for all of us in so many ways. Thank you Melissa. Maybe you can start the slides or whoever sure I just want to note one potential technical difficulty. It says that the host has disabled screen sharing. So is that something that you can but I just enabled it, but also I, just want to flag for it. Actually, it just worked board members really quickly. Our council member Ben Kalos is also here. If you want to let him say anything before he has his hand up. I, don't know Elaine, that's for you if it's short because we got ta or does he want to wait till after the presentation, then up to you. Thank you very much for the courtesy. It is incredibly sort. I just want to thank the 241 people from the community who are here tonight. I'm Councilmember, Ben, Kaylos and I will have a vote on this project as it goes through the Euler process, I from what I've seen so far, I have a concern, some concerns about what we'll see tonight and particularly its impact on St Catherine's park. But honestly, it's going to be up to you, the community board, to make your voices heard, whether it's in support or opposition or with improvements, this discretionary approval and ultimately there will be an opportunity for you to participate tonight and I'll be listening, as will my staff, and you can also reach me directly and I'm here to listen I'd like to hear from you at B, Kaylos benkaylos.com. Thank you Ben, so Chris can you start. I would be very happy to, and let me also say good evening to council, member Kaylos or if I can say Ben, because I feel, like I've gotten to know him better over the last several years with this project. So I hope everyone can see these slides and hear me and if not, someone maybe will is managing the dj. This whole thing will say you know: I keep talking and I don't hear you. So this is our introductory slide and we've always called our parcel between 66th street and 67Th Street Center East, and we used to believe it or not have a headquarters and manufacturing building. In the West side, we called that center west, and this is our headquarters for the blood center. As you know, it's one of the largest blood centers in the world, one of the last that's really committed to research and development and he'll has such a scientific presence and set of accomplishments. I like to demonstrate my tremendous pride in the blood center. But when I say we have done great things, I usually don't mean me has done great things. I've only been here for the past 11 and a half years, and the blood center, as I said, is about 65 years old. This is a view, a rendering of what might be the new entrance as on 67th street, and we're really hoping to liven up the street view on both 66th and 67th street, and one of the reasons that New York blood centers had such tremendous scientific accomplishment is because it's located with so many universities, essentially within a stone's throw Melissa, do I have slide control. Now, all right next I'll just say next slide, not a problem at all next slide, so you know we're a not-for-profit community-based blood center serving originally Manhattan in 1960 and then all the way into the boroughs and then the tri-state area and we like to see saving lives as a center of our mission. We're mission driven not-for-profit and this whole project is really a public private partnership, and you know we have in the red circle innovating new treatments, taking care of people in the right making new products and impacting global health, and in fact we serve almost every state in the United States, with blood or research projects or specialty laboratories. We have the biggest inventory of frozen blood with the biggest inventory in the world of cord blood. The first stem cell product ever licensed by the FDA, you think, would come from some fancy university like Harvard, but it came from New York, Blood Center, so we're very proud of the accomplishments. But what we do is we create products for people so they're from people, because they're donated by you and by me, they're, don't they're treat manufactured by people and they're given to people to save lives. Next slide every day, New York, Blood Center collects about 4,000 units of blood, serves about 75 million people, advances research but in addition many people don't know that we support several growth stage. Companies we have an accelerator and an incubator I'll show you in a minute and we're working to cure diseases within what we consider to be the blood and cellular therapy space which is listed here with hematology blood banking transfusion medicine, infectious disease, epidemiology cell therapy now I say this so quickly and not to be boring at all. But we really believe in this intersection of blood and science and hematology and blood banking and transfusion. That's what we do, but there are a lot of infectious diseases, as you know, that relate to blood into transfusion like HIV, West, Nile, virus, Hepatitis and epidemiology, and then bone marrow and many solid organ transplants relate to what we do and we have had a tremendous interaction with the intersection of Mers and Sars and now Covid-19 or Covid-19 or Covid-19 too. Next slide our blood and laboratories our testing products. This slide, I've always found a little tricky to see the colors, because our current facilities that we're really talking about are the black and green dots right in the center of this. But these our hospital customers are throughout the region, as you can see that are in red dots. This mostly lists just the large ones and we also click blood and all the donor sites and these donor sites. These are fixed donor rooms, represented by green dots, and not only are we New York we're in New York through and we you know it's in our name and everyone has said rebrand and become something like buy talent or bite of blood, but we just can't stop being New York. Some of the statistics are listed over here. We supply over 80 percent of the hospitals, 450,000 laboratory tests, 100 and almost 200,000 platelets and procedures. We also have a hemophilia pharmacy and, as I said earlier, we have the nation's largest inventory of rare blood. Next slide, please one of the things that we've always been very proud of, especially being in New York, is our both our service, our employees and our relationships with with a variety of the communities that are in New, York and so blood and related blood services are all New Yorkers of every background. We have a huge sickle cell disease program and we match blood very specifically for sickle cell patients and then over in the HIV research category. This is really our vaccine development and testing group and we hit all the communities impacted by HIV and we're also in the middle of doing two different vaccine development tests, including the Pfizer vaccine for Covid-19 next slide. So it's a little fun to talk about and I know. We have a time limit and I won't be long, hopefully too long-winded, but we have prototypic vaccines for Covid-19. One is in animal testing a little behind the larger the companies we also been working with engineered stem cells and plasma products working on Parkinson's and Alzheimer's. As I mentioned we're one of the leaders in science in the science of sickle cell disease, we can make transfusion grade red blood cells and platelets from stem cells that we grow in the laboratory. It's not a reality yet for our transfusion of people on a regular basis, but we think it will be. One of our investigations in my lab has to do with the gut microbiome and the central nervous system. How does that relate to hematology? Well, platelets are actually a rapid clearing house for serotonin, which is the molecule involved with depression. So we see a number of tests that could come through for mental health that we think are very important and we were the first to develop convalescent plasma for Covid-19 next slide. In fact, this is that slide coded convalescent plasma for Covid-19. We knew right away that the epicenter would move from Washington State to New York city. It always does there's so much travel through the city. It's such a large city and that we knew right away that once we could develop a test for patients who had covered we'd also be able to start to collect those who had recovered and in the history of disease since about 1894 recovered patients. Plasma which is convalescent plasma has been a good therapeutic modality, and so we had to bring the test up to make the test work and we published all that data. We were the first authorized by the FDA. We provided about 75 of the units that were used in the Mayo Clinic study and we have two vaccine candidates and we also have a very interesting molecule. That's a stapled peptide, it's a helical molecule that can interrupt the binding of the virus. I say all this, because I think many people think well. It's a blood center I give blood there and I do appreciate. How many of you do that, and please do that, because we're short of blood during this covered time, but we're not just a blood center, we're so much more and internationally in scientific circles. We're very well known for this kind of work, but not always in our beloved community next slide, so our future depends really on our ability to transform our old, essentially automate automotive school into a life sciences hub our facility is very old. It's outdated, it's almost impossible to recruit people into I know you know parts of our facility because you use our bright orange auditorium and other parts of it and we're so thrilled to host many community events, including community board aid. But we need to replace and modernize our facilities, which is why we're coming to explain and to ask for your input and to explain the project and to show you we do translate basis basic science discovery into new cures. We've done that many times quite notably and catalyze life sciences, companies, and so when Rockefeller or Cornell, or a number of universities around needs place to have a little startup company. We often give them space and that's what the next bullet or two down says. It's a technology transfer. The concept here is that we put even more r d, more blood collection and more companies into this new building, and it would attract, allow us to attract a critical mass of talent and really help promote New York as a destination for the life sciences, industry and cultivating scientific collaboration with our community and fuel jobs, create jobs, fuel growth, create jobs, and so this bottom set of arrows is really what we do. We take our basic science and move it all the way up to commercialization and because we're not a university, we have a variety of ways that we can work and collaborate with all the universities, even as far away as Paris, but very closely in our very local community. Next slide. So I mentioned that we have a bio attack accelerator program. This is a number of the companies. There are several other ones that are actually located in our walls. Some of these are startup companies. Some of these are institutes. Some of these are like the mint, which is minimally invasive. New technologies from wild Cornell are located there. It's really part of the Cornell campus. We are, as I said, we're very much about stem cells. The rogue is an institute. We have collaboration with the Rogerson Institute to take stem cells and make kidneys. We can make little mini kidneys, not big kidneys. Yet, but kidney disease is one of the biggest problems in the United States and growing, and if dialysis could be taken care of, not only would it be an economic boon for the country, but it would be such an important humanitarian improvement on many people's lives that have of kidney disease and need dialysis next slide. So we are really a center between commercial collaborations and the list of companies that we interact with is long and distinguished and academic collaborators. You can see Memorial Sloan Kettering, while Cornell Columbia, Rockefeller, Montefiore, Etc, and so many of those are within walking distance. Our scientists, including me, walk back and forth many times a day, sometimes even with different samples in different parts of the laboratory. We have, in my lab a huge collaboration with fate. Therapeutics, you see at the bottom and Memorial Sloan Kettering to make the next generation of car t cells from a thing called Hla Homozygous Ipsc cells, which is very exciting next slide. So you know it really is imperative that we fix this building. It's really a problematic building, be happy to walk you through it. But what these next couple of slides are really meant to say is the proximity to the research institutions in the large academic. Medical centers is imperative to the success we've had into our future. Success and I can repeat the names I just said, but all of these institutions essentially work through us and with us. We have things that they don't have a couple of the companies that have come to us recently because of Covid-19. You know we touch the arms and therefore the blood of over a million donors a year. So when Regeneron was working on its cocktail of monoclonal antibodies that President Trump eventually got, they started with a hundred of our samples virtually the minute. We could collect samples to figure out who had the antibodies and what they meant and they've been a tremendous success and partner next slide. So we must really build on our site and remain on our site and we're fortunate to own our site. As you, I'm I feel certain. You know where we are across from j-wreck on the front and the park that council member Kalos mentioned, and we have great relationships with both we've been located on that site, as I've said since 1964. and it's really a superb site to do exactly what we do, which is all the things listed here- support everyday medical interactions, fuel collaboration, expedite discoveries and attracted foster startups in our accelerator program. Next slide, and this slide was put into not only to show as I think everyone in the and the community board knows exactly where we are, but it would Jay rack across. You can see just to the top or north of us and then the park with those circular trees and then, while Cornell Memorial, Stone, Kettering, Rockefeller and, of course, while Cornell's all the way down on the water hss. We have tremendous interaction, but if you look also down to the lower left, is Msk's breast imaging center, so we're surrounded by collaborators, and these collaborations you can see here- go on 10, 5, 2, 3, eight twenty years, some of them have I know, go on quite a bit longer than that, for instance, some of my relationships at Rockefeller are older than that, even though I've only been here 11 and a half years next slide the the folks, our partners were so moved, essentially by us trying to build a facility that would have more interaction, time and more research for them that we got a number of people reaching out to us saying you know we really want you to be where you are and be able to grow. Bigger and I can understand that, because, as someone who started a bio attack years and years ago, it it's very hard because the universities won't always let you start it on your own campus. But these are a couple of the blurbs saying you know it allows us to accelerate our research projects. It allows us to transport patient specimens. It facilitates impromptu interactions and we share scientific information. We have one of the most attended lecture series for physicians and researchers in the area and we're very pleased with our workforce, training programs, our training programs and our large participation in our community of under represented minorities next slide. So this is I think you all know what we currently look like and really I call it four stories: high, it's three and a half stories high. It's a very boring first 10 feet of the sidewalk height and a very old building and the hallways are too big. The labs are too small, everyone's too isolated, it's very siloed and it really needs to be replaced, and so replacement is essential and we look forward to moving ahead with that project next slide. So we we can't we're not for profit and when I arrived at the blood center in 2009 I lowered blood prices instantly, because I wanted to ensure that we were providing to the community. We are a community resource for the community chest when it comes to blood and our goal my goal, and now our goal was to offer products virtually a cost and to be able to say to any large center come in look at the books. If you want, because our goal is to provide life-saving products not to make a profit and brilliantly I haven't been able to lead the center to a profit in the last 10 years, as we have seen a tremendous consolidation in the blood industry. So what we did was we went out and looked for a partner and found Longfellow as our partner and Longfellow is the leading life sciences developer in the world, and they have more I. Think there's some slides and one can ask them to speak to this. But then they have built and developed places like Kendall Square in Boston and places with Duke down in in the south and really done tremendous. Nothing I mean they have these huge numbers of square feet. They build life sciences laboratories they make places for companies to be successful and they're, just a remarkable number one they're the best of the best and, in addition, they're tremendous people and individuals and have this mission at heart, and so it's been not only a privilege to have the best developer as a partner, but also to have them as friends and colleagues in this whole process next slide. So center East is what we're calling it for. The moment will be a catalyst for the new biotech and life sciences ecosystem. We hope in the city and, as you know, the mayor and others have really been interested in trying to ensure that we retain the superb scientists and the NIH dollars and grants and the discoveries and allow this as a sector to grow in our beloved city, and we see health as well as research laboratories as a as really a superb entrant level for all sorts of trained and untrained individuals. You know most of the positions we have in on the blood side as well as many positions on the research side require only a high school degree and we've been working with a number of different degree, granting programs, universities and colleges to try and ensure we have a diverse and team-oriented workforce development project and program which we're very happy. So our mission is to keep life sciences. Entrepreneurs in New York further advance our life-saving research, commercialization of drugs and therapeutics, and better serve New York our community at large. We really are all potential blood donors and all about to be if something doesn't go, just right: potential recipients, whether it's cancer or an accident or anything, and we haven't closed our doors in 65 years and I, can't imagine we ever will we get more open and busy during the worst, whether it's 911 or the hurricane Sandy, major snowstorms or Covid-19? We've been open and running the whole time. Obviously, within the prescriptive needs of keeping our workforce safe and I, do ask you to give blood and I do. Thank you in advance and thank you for your past donations next slide. So we will create new jobs with this, which is exciting and that's as well as the the construction, jobs and all of the related jobs to that. The construction jobs is listed here is about 1500 new jobs, the operational jobs is over 2500 and that creates additional 3,000 estimated jobs that are indirect because of all of the activity that we hope will take place in the building. We know you know we're not entirely ignorant of this, that the building process is very tough on you. It's very tough on the community, it's very tough on us as your community blood center, but we really believe in the longer run, when the project is done, that everyone will be thrilled with the building and its look and its economy and its job creation. You know: we've spoken to members of community board and leadership and I greatly appreciated our last meeting, and you know, a lot of people were clear that you know this notion of creating jobs and economy in the local area doesn't always directly create those things for the community, but we are very strong community citizens and couldn't have a bigger heart for the whole of our community, as well as our borough, as well as our city. Next slide, Chris, yes, Ma'am I would ask that you move to the issues that are before us that relate to zoning and what plans are we're going to do it. Thank you very much out of the programming, but we I had asked that we really focus on the zoning and what ha you think you need to do what you've said. So, please move on to the zoning issues and what you're proposing thank you I apologize for not doing that. I wish I'd known that better in advance. That's very helpful! Totally fine! Thank you very much. This is just a slide that reiterates how many different workforce, development, education and training programs we have next slide. So perhaps at this point, I can turn it over to the experts Lisa gold from any ad and we'll move right to what you asked for, and I'm going to go extremely quickly through contact. So we can get to the proposed massing and zoning actions. So obviously the New York Blood Center's location is critical to its research facilities, but it's also in the midst of a real neighborhood. The urban context is very diverse, with high-rise residential to the west and healthcare institutions to the east. If we go to the next slide, you see photographs of 66th street with the Memorial Zone Kettering Outpatient facility and other mid-block buildings also owned by Memorial Song Kettering. So one of the really sad things about the building right now is that it projects a very blank and intimidating wall to the community on both 66th street, as well as, if you go to the next slide on 67th street, so the residential building, the Julia Richmond School across the street and the blood center both result in unactivated, solid walls from second Avenue all the way to the park. So one of our big goals is to transform the street so that we can create transparent, open and lively ground floor uses that will create a much more humane urban experience explide the park. We all know and love it social heart for the neighborhood next slide. This slide summarizes the goals for the new center East now, most importantly, is replacing modernizing and expanding the blood centers research capacity with new labs, but as Dr Hillier mentioned, it's also about attracting life science partners into the building, which means large, flexible plates of about 30,000 square feet and a super robust building infrastructure. Next slide, the program of the building is summarized here: it's 596,000 square feet. The blood center space is 206 thousand square feet there. The institutional, third driving basic science, the life science partner, space at 390,000 square feet are, but it's focused on translating those basic science discoveries into new treatments and then finally, there's the shared collaboration center Melissa. If you can flip 41,000 square feet where all the users can come together with access to super high tech support, core labs and education facilities, so really creating a biotech innovation system center for Knowledge Exchange. The next live illustrates the proposed massing, which is a direct outgrowth of functional requirements, so the four-story base has contains blood center facilities. The cube above contains research space for life, science partners and the landscape setback floor brings everybody together in the shared collaboration center next slide. So, overall, we really look at this as much more than just a building. It's envisioned as a dynamic, vertical campus, bringing together all the diverse program, elements that you see illustrated here to create a true scientific community. So looking a little bit more closely at the building site and the building itself. This is the site plan where you can see in blue the blood center location directly across from Julia Richmond to the North, the Memorial Sloan Cuttering buildings to the south and the library to the east. We are planning to put the main entrance to the facility on 67th street and maintain a secondary entrance on 66, along with some servicing. So looking at that ground floor plan in a bit more detail on the right side of the slide, you can see the main entry off of 67th street with an entire street frontage devoted to lobby circulation collaboration space, along with a multi-purpose room and a in a small cafe that lobby connects through to 66th street for another secondary entrance to the facility in gray along 66th street. You can see the loading dock operation, which has internalized loading docks so that trucks aren't on the street the existing blood center loading dock is at this location currently and then in blue. You can also see some of the more public-facing programs for the blood center, which will continue to have a ground floor presence, including their main blood donation hub and their project achieve research program. On the left side of this slide, you can see the building stack again, as Lisa mentioned the ground or the base of the building, including space below grade for the blood center. For the core labs and for some of those shared facilities above in the orange, are the partner floors and there are also zones throughout the building below grade at the mid-level and at the top for mechanical. So the base of the building height is 85 feet and the total height of the project up to the very top of the screen wall which shields all of the mechanical equipment, is 334 feet, and so we wanted to also just talk about what drives some of those dimensions. A lab building has very specific dimensional requirements for flexibility and to really make the space efficient for the purpose of the research. That's happening there. So at the top of this slide, you can see a blow up of a plan of a laboratory space and there's some critical dimensions to be mindful of lab. Buildings are typically planned on a module, 11-foot module which allows for the right spacing around equipment and people, and also allows for flexibility as labs change over time, and then the laboratory space itself is often divided into this enclosed lab support space which may have a specialized equipment or environmental requirements. That's usually a 22 foot dimension and then the open bench area, so that 55 foot dimension is an important planning module between the building core and the building facade. Likewise sectionally. There are specific requirements to support this pro, this type of a project, including air changes and ducts and other services that run through the ceiling plenum and also stiffen the structure which sometimes results in deeper structural members in order to limit vibration to sensitive equipment. So, typically, we see in a lab building the 16-foot 4-4 dimension and that's what's driving some of the dimensions that are proposed on this project. On the left, you can see that 16-foot Florida floor height and on the right. You can see that the 11-foot module and how it is informing the planning of the project, both at the base of the building and also at the top and additionally at the top. You can see that 33 and 22 foot dimension, which is that minimum lab dimension which starts to that along with this 30 foot, ideal dimension for a lab floor. Plate sets the dimensions of that upper floor plate, and this is Peter Pan to you. Okay, I'm often Peter Shubert here in Ed. Well, with all that in mind, we wanted to talk about the basic volume of the building and really its height in relationship to the surrounding neighborhood. As you can see here, center east is in the middle of the slide. It's on the lower end of the color range of yellow the lighter the yellow, the lower the building and we're at about 334 feet and I split in the highest range that you're looking at here is 530 within about a block radius of the building. Next slide, please. We also want to talk about texture and color. The building in the the surrounding neighborhood is a variety of different textures, particularly on the light side. Next, please, and as you can see as you approach the building, then it really does speak to the robust and very interesting Midtown textures of brick and glass and metal next pleased, as you can see from Saint Catherine's part looking over the trees. One of the things we worked hard to do is keep the building as low as possible, and we can discuss that later. As you approach along 67th street I think this is going to be the big asset of the building really building on the program and meeting rooms in a very transparent street wall. It's going to be a very active street wall and we believe a real welcome change for the neighborhood next, please and then taking a bit back we're also enhancing the street wall. As you look up and down the streets, there is a building setback. The proposed community room will be on that landscape floor at the top of this setback line and I think it will be a very much a building that will be much more approachable and something that really makes science a part of the community. Next, please, and then here you can see an overview in terms of how we broke it down the scale of the building and how it nestles into the surrounding community. Thank you, okay. So picking up one of the most important things, one of the questions we've been asked most frequently. I'm Paul silver by the way Kramer 11, Land, Use Council. One of the questions we've been asked most frequently is what about the shadows: shadow impact on Saint Catherine's park, so as part of the environmental review process, we did the shadow studies that are required. There are five analysis days, the summer and winter solstices the spring and fall equinoxes and at date, in early May and August studies. Make four key points next slide, please. The first is that the park is largely in sunlight until except in the wintertime and until between 1:15 and 2:30 pm, and the shadow impact on the park from the building doesn't reach it in that time. What you see here is the winter solstice, the that is the point at which the park gets only about 30 minutes of new shadow and all of that shadow falls on the western portion of the park. There is no new shadow on the playground and sitting here at the eastern portion of the park next shot. Next one piece, the absolute new shadow on the park until the afternoon means the levels for planting will remain classified as full sun horticultural conditions with six hours of direct light. It also means that existing vegetation will continue to have a healthy growing. Now. The next couple of the next two slides will show three slides show the incremental shadow during at the equinox, and this shows that the shadow enters the park for the first time at about two o'clock. It moves across the western portion of the park, which is the active play area and about three o'clock. First enters the eastern portion, which is the playground and passive sitting area moves across that portion and about 4:30 there after 4:30 the there's very little incremental shadow left, because the park falls into shadow with existing buildings. Next on the May 6 August 6th date, which is between the equinox and the summer solstice, you can see again the shadow enters about 130 in the western court of the park. It gets to the eastern portion of the park between three o'clock and 3:45 say about 3:30 and after about five excuse me. After about 5:15, the part goes into shadow from other sources and the incremental shadow from the whole produced next. Finally, on June 21st, you see the sun entering the western portion of the park shadow entering the western portion of the park about 115 entering the eastern portion of the park about 245, never quite covering all of the eastern portion of the park. There are people who would say that during the summer, actually, the shape would be a little welcome. So in terms of time, what it shows is that on the western portion of the park, there's between up to three and four to four hours of new shadow and on the eastern portion up to between one and a half and two hours of new shadow building to address these impacts. The blood center has retained Matthew Nielsen as its landscape architect and will with Matthews Nielsen work with friends of St Catherine's park and other stakeholders. The purpose, obviously, is to find a range of mitigations and I'll, be a commitment that we will follow through the pre-certification and through the Ui process next slide. So, in order to develop, let's go to the next slide. Actually, okay: in order to develop the center east, there are three zoning actions that are required. The first is a rezoning today, as shown on this map. The zoning along second Avenue is C19 north of 66th Street and C28 south of 66 feet. The mid block swing is R8B, live next slide, okay, good! The proposal is to move the 2 8 boundary north one block to 67th street the effect of making the non-conforming theaters on the western side of Second Avenue, conforming use and to remap the blood center into a 270 school district, which permits both institutional and commercial medical labs at higher FAR than are permitted today. There's a compelling policy basis for this rezoning and the starting point is its contribution to the city, economic development policy, of encouraging life science. It's a very strong policy now and one that's become even stronger as a result of it and one of the ways the city is proposing to do. This is seeking to do. This is through the removal of regulatory barriers inappropriate, and we believe that the blood center site is a most appropriate candidate site for advancing these policies, and there are six reasons. The first as Dr Hillier mentioned, is its proximity to the world-class medical and academic Institutions Rockefeller University of Sloan Kettering, while Cornell that are engaged in advanced research and clinical work that ties into what is doing now. The second is that it's only about a five-minute walk from three subway lines that connected to lower Manhattan to Queens to the Bronx into Brooklyn. The third is that it is a uniquely large parcel. It is literally the only available non-residential site of its size in the 60s 72Nd street corridor between first route avenues. Four, it's basically square shape is ideal, exciting of the most flexible and efficient life sciences, four flights, five, it has an 80-year history of non-residential use. That means not only that the use that is historic use will be continued, but also- and this is always an important point- there will be no relocation of residential tenants required to project through and finally it's on an atypical block. It's not a block, that's dominated by row houses or even by tenements. That are really what the rap is all about. It's one of a trio of atypical, mid blocks between 66 and 61, speed on this 75 percent of the mid block hot area is used by non-residential. Excuse me, non-residential uses or by buildings that are overbuilt. Under current zoning, the block to the north is used only by the school. The Julia Richmond Education Center in St, Catharines Park, and the southern face of the block north of that is entirely occupied by either institutional usage or residential uses that are taller than 12 stories. So that's the first action. The rezoning rationale for that. The second action is an amendment to section 7448 of the zoning resolution. That section was originally adopted and it's subsequently been amended to facilitate the development of a number of life sciences. Centers, and the proposed amendment would allow the city Planning Commission a special permit to authorize site-specific actions needed for the proposal, and that is a flexible mix of institutional and commercial uses where the permitted residence commercial area would exceed 2far. That is, ordinarily permitted in the 27 district and a modification of height setback yard and signage regulations. The third action is the approval of the special permit under the amended section, 74 48 next slide. This shows just a basic footprint of the building. Again, you can see the base plate at about 85 feet, building height at about 34 feet, and it shows from the top what the footprint of the floor plates are like. It also shows the foot is the setback of 30 feet from the western lot line, which is 10 feet more than is required in this particular by the rear yard, which we'll talk about in a Sec next slide, which this slide shows the proposed modifications of the yard and heightened setback rules on the left-hand side, the rear yard modifications are shown. The left side of that is the West lot line of the site, and it shows is that between 20 and 85 feet there is a waiver sought for 20 feet of rear yard. That does not go above the base height because the as I noted the tower is set back 30 feet on the east side, which is the right side of the rare yard diagram the East-West section. You can see that a sliver of the waiver goes up the entire tower again. This is a result of offsetting the tower in order to try to provide more light in the air to the West. The right side of this drawing are the heights is the height and setback waiver. What it shows is the tower floor plate and the waiver that it reflects the demands of that floor plate that Melissa Sarko talked about. It also shows that the tower is offstat, making the waiver more extensive on 66th street and that is to provide a deeper setback along 67th street because of St Catherine's park on the north side of the street and finally, next slide the signage waiver. The signage waiver would allow signs up to 40 feet in height. You can see that the two center East sides that's 15 feet higher than the 25 foot height limit in the c2 disc. It also would allow a larger surface area of total signage up to 500 square feet on each of the building's frontages, and you can see how that might be deployed in this drawing which is more than 150 feet square feet of signage allowed under the C2 regulations next slide. So that's the zoning on what is center east all about Center East is all about enabling the blood center to continue its life-saving work, speeding, research discoveries and treatments. It's about maintaining and expanding essential scientific collaborations. On this area of the Upper East side, it's supporting education and workforce development programs for careers. It's improving the 67 and 66th street experience with active uses. It's providing community programs promoting education events and exhibits, and it is expanding in a more broad sense. Expanding the life sciences economy in New, York City, which in the end is going to be. We believe one of the foundations of rebuilding the New York City economy as Covid-19 goes away because it is very much a very much an industry needs to be here. So that's the presentation and we're all of us are happy to take care of us. Thank you very much. We now will move to the public having an opportunity to ask questions. We would like them kept focused on the zoning issues that are before us understanding that there was a sharing of what the programmatic needs were and therefore why they would like to change the zoning. So I will start with we'll see how this goes. Marty Bell are you there? Can you unmute him hi? How are you I want to say, I appreciate the blood center, the work they've done and when Mr Hiller was talking about the intersection of those four things. I would love to see that continue, but I think that's. That presentation, which went on for more than a half hour was like the magic trick where there's misdirection and that's to get us to focus on the blood center and not look at the greed of the developer, because that's what this is all about. All the things that the blood center wants to do. They could build on their current site. As of right, we wouldn't need a single variance. This is about the greed of the developer. We saw a selective view of talking about the zoning requirements they showed the height of other buildings in the neighborhood that was very selective. It was buildings that were all I believe all along avenues. It was very quick and it showed none of the buildings near the project. They were blocks and blocks away put that up, and you can then start asking what about this block. Also I may not have the problem with this block. This project is it's a mid-block building and it would have devastating effects on the traffic in the area, so granting these zoning requirements I think, would negatively impact everyone. But I want to speak about my own situation right now. Second Avenue is off in a parking lot all the way, as everyone probably on this call knows to to the 59Th street bridge. My daughter, I have a daughter who has a autoimmune disease and may at any time, have to go to a hospital. I worry about second Avenue, but talk about what this will do, this giant building they keep calling it 16 stories, it's a 33 story, high building and with 25 I think it was 2400 new employees with loading dock. You talk about well, it's the same loading dock as the blood center, but now you've got 30 stories. 33 stories that you're loading dock for that's the street that an ambulance if it wasn't delayed coming to get my daughter would have to take her down to get to the hospital. So this is this to me is a matter of life and death. It's not about zoning, and it's just outrageous that they use the blood bank as this shill for the developer. I may have missed some, but I. I've tried to look at Longfellow's. Other developments. I haven't seen one where they put a tower of this magnitude, Mid Block, Kendall, Square or any of the others mid block where there's in a residential neighborhood. This is a residential, neighborhood and you're. Putting this humongous tower on a in a mid block where you have talk about traffic, you've got school buses and it's a street with a bus lane to try and put 20 an office building of this magnitude in in this neighborhood. It's just absurd, Mr, higher I think Hillary was talking about how his blood bank serves places as far away as Paris, so you don't need to have it built up on top and ruin our neighborhood. You talked about how you walk to Memorial, Sloan, Keller, More, Memorial, Sloan, Kettering, and all these others I want you to keep walking and get your exercise. You don't have to do it in an elevator. This is just outrageous to do this to our neighborhood. Okay, thank you, Marilyn, I'm sorry, Marilyn Heath are you I'll, show your hand hi. Thank you and thank you to the speakers for sharing about the blood bank. My name is Marilyn Heff and my daughter goes to the Ella Baker School in the Judah Richmond Building, and I'm here because I'm concerned about the construction that will probably be happening for four plus years in the neighborhood. I'm also concerned about the things that Marty was speaking to with the bus buses coming in and out of that street. It's we're non-zoned schools, so we have families coming from all boroughs that are trying to get into the school and- and we also use the park there and my daughter's in first grade so she'll, be there up until eighth grade and I you know, would love to learn. I would love to learn more about how are they addressing the toxicity in the air and in the noise that will come from the construction of the center? Okay, thank you, environmental consultants. And can we speak to some of those issues, Bill Angelos, and can we please have the speakers of the state of about one minute? We have over 275 people on this Zoom Bill Angelos. Yes, I'm mute him. He just has to confirm a meeting. Oh they'll just push the button at the bottom. According to your screen, okay, Joshua Satan, see if we get him to do it, one second, hello, Joshua hi: how are you hi? My name is Joshua. Satin is the name it's okay. How are you my name is Joshua Satten, I'm the principal of the Ella Baker School and I'm building manager at the Julia Richmond Complex, and I'm speaking on behalf of all of the principals and the people over at the jewellery Richmond building. We haven't met with this time around with the group as a group about the proposed project, but knowing the size and the scope of it. We oppose it thinking about what it might do to the playground over at Saint Catherine thinking about the traffic. That's already there right now, just coming up. First Avenue, it is not a three lane hard. It is a one lane road right now with all of the parking that's happening, and that will be there each morning and each afternoon we have we're pre-k that grade eight or excuse me, where a three month to high school to 12th grade building with a district 75 school, a school with middle schoolers with autism, and so every morning we have about 10 buses, bringing in students from all across the city and right now, without construction. Without anything, it's a real mess. It's a real mess in the mornings as well as in the afternoons, so I think the stress of four years of construction will be really difficult and then just thinking about the traffic afterwards on 67th street and or just on 67th street, if they does grow to the size that they want it to just the numbers of cars and people coming up and down 67th street will be really difficult to move up and down bringing in kids from all over the city. Hey. Thank you. I would like to remind people if they want to ask questions that they raise their hand and as we move forward, because the clock is ticking, I'm going to ask if somebody has a different issue than has been identified so far and then I'll ask for some summary: I'm going to go to Steve hello, hi, I'm a long-term! Can you hear me? Yes, I'm a long-term resident of the neighborhood and quite live close by to the blood center, which I think very highly of and does a great job. I've been there for meetings in their auditorium, as they mentioned earlier, and they they're a great participant in the neighborhood, I'm very concerned and troubled by the idea of the disruption that construction of a 30 or 35 story building would cause not only to the neighborhood to the park to the school. This whole one-mile area and I wonder if I would have no problem. I think that the building is certainly in need of rejuvenation. I see no reason why it shouldn't be renovated, maybe expand it a little bit, but I see no reason for a project of this size to to basically ruin. What's going on in the neighborhood, as Mr Bell said earlier, and as Mr Josh Satin said as well, I think so. I think that you'll find that quite a lot of the neighborhood would oppose this project as I do I have no problem with them doing the necessary renovation to bring it up to speed and up to date. It's surely in need of that. Thank you. Okay, Ruth Botsky, Brotzky, good. You like that honey. Could you speak up a little bit? Please! Yes, can you hear me? Yes, okay, I agree with everything that's been said, but one of the things that concerns me is the height of this building. I counted how many floors you have for partners. You have nine floors which is half of the height of this building. I, don't know about why you need nine floors of partners. If you took even half of it off or all of those nine partner sections off, we would have a much more manageable building. Thank you, Howard Schechter second I need to find Howard. Okay, there we go. Thank you very much. My name is Howard Schechter I am an attorney with the law firm, Armstrong Teasdale. We are attorneys for 333 East 66th street, which is a property just to the east of the proposed development site, and I'm appearing here today to oppose the extreme size and bulk and height of this proposed development. I. Think, first and foremost, it appears to us that the what is now a community facility and is permitted in this location as a community facility is to be replaced by a massive office building a commercial office building I assume when they're talking about partners that they're going to be renting out that space at a profit in order to subsidize their operation and while I don't have anything, particularly in opposition. To that conceptually. The idea that you would build this huge structure, that's totally out of character with the neighborhood in a mid-block location. In order to do that is an unfairing position on the community and changes the basic community facility, nature of the use to a commercial office building which is going to draw in large numbers of workers daily in an already congested location and make the living environment significantly worse. The traffic on East 66th street is already burdened by the fact that it's a park, transverse street traffic, comes up first, the avenue and turns onto 66th street in order to get across the park and the idea that you're going to have additional truck traffic and deliveries and servicing of the entire office building from a loading dock on 66th street guarantees that there are going to be backed up trucks waiting to pull in traffic stopped while they're backed into position. It's just a recipe for keeping traffic from moving through that location in a useful and acceptable way, and then, of course, second Avenue is immediately a cause of backup of traffic. So if you, if I bring more traffic onto 66th street you're, going to back all the way down the block to where my client's building is located and further so that there'll be no access or emergency access, as Mr Bell indicated also you've done, I saw the shadow survey. It seems to me an extraordinary amount of shadow to be adding to a park. That is a focus of so much community activity. And again it's not a community facility. That's being offered in that location, but an office building use that would interfere with the use of that park for its intended purpose. But I don't see any shadow analysis with respect to 66th street, which I imagine there must be some impact as well. Nor do I see any analysis of how the terraces and other rooftop facilities of my client would be affected by this structure so close to it to the immediate west. I would also point out, with respect to the height of the structure, that the 66th street between first and second, is a fairly steep hill and you're talking about putting this at a location at a higher point on the hill, so that the height of the building and its impact on the community is exacerbated by the fact that everything to the east is at a lower elevation at its starting point. So simply talking about the number of feet above street level does not accurately reflect the significant amount by which you're increasing the height above the existing structures. By putting this big building in that location, you know we only briefly looked at this. I do have a number of specific questions that I would be interested in hearing and answer to one is that there's a an indication of something called gas storage on the 66th street side of the building? I, don't know what that is and would like to know what it is and how that affects the community, and if there is an environmental impact statement, that's been prepared. I'd certainly like to see it, and my client would like to see it and have an opportunity to comment on that as well. Thank you, Judy Schneider Good afternoon my name is Judy Schneider. I'm a friend of St Catharines, Park I, want to thank the blood center for the concerns they've expressed about the impact on the park over the years. We've found the blood center to be a good neighbor, and we've worked closely with them, as they have continued their current outreach. Since this will be a life science hub I recognize the vital role it will play in the life of the city and no residents are being displaced by this project. The park and ball fields have been very supportive for the healthcare industry. Over the years, even the ball field, serving as a much-needed parking lot during the worst part of the Covid-19 crisis. We look forward to continue working with the blood center. I do have a question when they do get to answering questions, and that is. Can they explain why they picked glass for the exterior of most of the building and has that glass been taken into account when they did the shadow studies living across from the glass building? I know it makes a great difference in the shadows and the sun. Thank you, Eric Slater, okay, we'll go on Eric Slater! Yes, I'm here. What's your question or concern good evening and thank you, Dr Schuler members of the blood center for your important achievements in advancing the science as we are at the cusp of great change today, I thank the council as well as the ladies and gentlemen of community board aid, certainly with regards to the zoning I, the Son of Terry Slater, a long time decades-long member of Community Board aid and resident of the Upper East side. I'm concerned that this sets a rather dangerous president, as we have fought hard to preserve our mid-block zoning so as to create a quality of air and light and quiet, and here we are preparing a proposal for a 33-story tower which is abhorrent to me as a New Yorker in the middle of a block in the middle of a residential neighborhood. My question to the blood center would be as real estate is so far so less expensive in long island city. Why, indeed build in the middle of our community when via zone buy a drone? You can drop off something just across the river or a simple cab right across the 59th street bridge. Thank you all right. We have. We can not right now accommodate everybody whose hands have been raised, I'm going to ask that if you have questions or concerns or want to voice your support or your opposition, that you email the board office and that is at info. I, n, f, o c b, eight m like Mary.com, and we will take a couple of more questions. I will I'm not sure, is there a way we can find out how many people are opposed to the project and how many are in support? Is there a way to do that with hands? Do we take everybody out do this, so what I would do is if you are, if you can find the participant menu on your screen if you're on a computer, it's at the bottom of your screen has the word participants and the number 268 right next to it. It'll open up a box and you'll see a list of everybody's names at the bottom of it. You'll see a yes and a no a green, yes and a red no, and so, if you're in support click the green. Yes, you only need to click it once it'll stay up. If you click it multiple times, it'll click and then go away. If you're against it click the red. No- and we will see your number up there again- only click it once and we'll give it a couple of seconds for everybody to get their guesses and knows in it looks like there's another still going about 25 yeses and 130 no's 132 now. Thank you. Will I didn't know that you could do this excellent. Thank you. I'm sorry that we do have to stop the questioning period. At this point. We have not allowed sufficient time and I think we were not aware of this need to come forward. I want the community to know. Blood center has not informed us, but that we just received from the city that there will be a scoping session on the blood center on December 15th. The currently the blood center has received a positive declaration for the Eas and they will now a negative declaration, a negative I'm. No, it's positive! It's a positive! Well, it has received a declaration which will then lead to requiring an e I S, and they received a positive declaration for this Ceqr. Sorry, okay, so I think I will ask that we will hopefully will it's. Okay, use the community board website to update and provide this information to the public so that they have an opportunity to respond. This is a very short window. According to what we've received comments after December 15th are due December. 31St I am surprised by this, and hopefully we can have a discussion and maybe change some dates, because this is during the holiday season and it's difficult for people to respond. Is there any Elizabeth, there's anything else on the blood center? Do we want? Do we have time I, don't think so? I, I'm sorry. We couldn't hear everybody, but we would be here till tomorrow morning. So the next item is North, Will Elizabeth. Let me just ask the blood center you've written down the questions and concerns that the public has. Could you please respond, prepare responses that we then can share with the community? We would appreciate that very much, and maybe we can set a deadline to get it by the beginning of next week, if that's possible, but thank you. Elizabeth go ahead. Okay. Our next item is Northwell Lennox Hill Hospital's proposal. As I think people know, it has been changed and Anthony Cohn of our Community board, and our committee has very kindly volunteered to bring us all up to date on what has happened to that, and so please recognize Anthony. Thank you. Elizabeth and Elaine will I. If you could give me screen control, that would I mean so I can share my screen. That would be useful, yeah. Of course. Oh thank you. So go ahead. All righty, let's see what am I doing. Oh share screen. No, that's not what I want that all right, let me make this bigger alrighty now is this working? Are we seeing my screen? Yes, okay, great all right- and this is really I'm reporting a little on the updated proposal from of the Northwell Linux Hill and a little bit on the borough president's task force, which met seven times over the course of the past year. The original proposal had a residential tower on the corner of 76th and park. As most of you or all of you know, the other major points of the original proposal were that all new construction would be phased over a course of 10 years. They would, in fact, their proposal doubled the existing floor area on the overall site, including the residential tower, and that it featured two buildings in excess of 500 feet, tall, the residential tower at park in 76 and the Lexington Avenue tower, which occupied the entire Lexington avenue block front between 76 and 77. The proposal was modified about six weeks ago to eliminate the residential tower. Here we go to eliminate the residential tower and to shorten the Lexington avenue tower from more or less 500 feet tall, to excuse me 436 feet and to thicken it to make it thicker from east to west by about 50 feet. This next slide. This chart basically talks about the zoning issues and compares the current revised proposal from Northwell Lennox Hill, with the existing building, which is on the top. The existing buildings about not quite 800,000 square feet, a gross square feet and the proposed building is one point, not quite 1.4 million square feet. The existing far floor area ratio of the project is 7.5 and the building is 200 feet high, as it says in the upper right hand, corner of the slide and the proposed building is, as I said, 436 feet high and the far is 12.5, and so two things to note. The proposal is still 60 percent larger than the existing bill than the existing complex and the hospital floor area has increased by some 70,000 square feet over its initial size. That's owing apparently to inefficiencies that have to do with reusing some of the existing buildings. Aside from the up zone, to an far-10- and this is the Zoning Arcana that Paul described so well for the blood center Northwell is asking for bonuses as a large community facility, a situation of their own creation and half of an accessibility solution for the subway. They propose at this point to make a an accessible connection to the subway on the southbound side. Only, and hopefully they will continue to explore the options now. The next slide here gives you a sense of the community. Gives you a sense of what the neighborhood looks like if you were to cut it all off at 210 feet? So these are the buildings in the neighborhood right now that are over 210 feet high, and this next view, which is I, think important, is a very crude model showing you what the 436 foot high building on Lexington looks like above the 210 foot plane and one of the things to notice. In addition to it just being really tall. Is that it its profile? It is a 180, some odd foot, cute square in plan, which means that, from every view and every angle, it's big. So does this work we're working okay, and so this is a a view based on the map provided by city, Planning, 3D Map, provided by city planning. This is Lennox Hill right now the Lenox Hill hospital it's in green. This was the original proposal with the two gigantic towers, and this is the revised proposal effectively. The revised proposal is a new building on the Lexington Avenue side that is now about 180 feet square and, as I said, 435 feet high and the first little setback is at 190 some odd feet just for comparison, I'll go back quickly there just for yeah smaller than this. This is what would be allowed by zoning if they were starting from scratch. You have a building of about 175 feet high on Lexington, a building of about 210 feet high on Park Avenue, and the R8B zoning in the center says that you can have buildings that are all of 75 feet, high, giving it a little bit more perspective. You get a sense of how Lennox Hill fits in fits into its neighborhood built over many years, most of it built in the 50s again. I can't help but show what they wanted to do. Initially. What is in fact as of right and then what they are now proposing. The red rectangle to the left of the purple proposed building is in fact an as of right. Building that that Northwell Linux Hill is planning on constructing at Third avenue, between 76 and 77. For other purposes, and finally, all three existing proposed as of right all together, you can see that the existing buildings are not in fact, do not in fact are non-conforming buildings, but that it's something that's I think worth looking at now about the task force met seven times over the course literally of the last year. Throughout this process, Northwell really failed to pay much attention to neighborhood concerns and consistently refused to imagine a smaller project they presented to the task force the bare minimum. They have never shown us a shadow study. They have never shown traffic studies. Anyone who has ever used the Lexington Avenue Irt 77Th Street Subway station, is well aware of that. It is one of the most crowded in the city and there have been no traffic studies and no impact studies of the subway. These are very good architects that Northwell has hired. They are very responsible. Very professional I can not, as an architect believe that they have not in fact taken a look at what these impacts are, and their refusal to share them with us before they absolutely have to as part of the Euler process, tells us a lot about their intentions or tells me a lot about their intentions. So the opposition at the last meeting made presentations that highlighted three issues. The overwhelming bulk of the Lexington Avenue tower the question of whether or not the program really suited what was needed here and finally, the issue of medical, equity and I think that one of the things that is a blessing for us and I'm sorry to be going on so long. But this has been like a year of our lives. More medical equity is something that we don't really have to think about here in community board. Eight we are blessed, some might say, cursed with more hospitals than we can possibly need for our needs. So fine, it's a center, a medical center for the entire city, I believe our state senator Liz Krueger, has more than once described her district, which extends from 14th street up, I'm not sure exactly how far up, but at least as far as 96th street as Bedpan Alley, that's where we live, and the idea of taking what is a perfectly good serviceable hospital that should be renovated should be modernized should be updated and doubling its size is really anathema to many of us in the community when there are neighborhoods within the city that have nothing. Finally, it appeared that the elected officials understood the magnitude of the problem posed to our neighborhood by this tower, standing on the standing on Lexington Avenue at 77Th, Street or 76th street. You could do that today or tomorrow anyway, and look up the building that Northwell is proposing right. There is three times the height of what you see now three times, and it is twice the width of the tallest part of that of the existing Lennox Hill Hospital. Fortunately, there might be there. We are expecting or hopeful that there will be more meetings and further discussion, and perhaps there can be conversations that will persuade North Northwell to take a slightly different look at this project, but as it stands now, this is what they are proposing and I. Think one of the very wise presenters at that meeting was asked by one of the elected officials. Well, what can you do? What can you do to make it smaller and he responded that if you want to reduce the bulk, you either reduce the program or you buy more land and spread the project out, and so that's really where we are asking the the task force, hopefully we'll meet again, and we will have continued conversations with with Northwell Lenox Hill and the elected officials, and we might hopefully be able to mitigate the effects of this proposal, and now I'm done. Thank you very much. Anthony that was very helpful. I do want to tell people that the hospital was invited to this meeting as they proceed. They will go through. What's called the Euler, the Uniform land use review process and will be will have to present its proposal to the community board, and does anyone have a question? If so, could you go through an order? Will I think the first is Betty Cooper Waller we'll do the public first and then the board Betty it's star six to unmute yourself, Betty. If you can hear us star six to mute yourself, you very much very interesting how these first two proposals, I did have I was waiting to speak because you know years ago, this community board, along with three brand new organizations, formed because of our concern about the growing density of our community and the friends of the Upper East side was represented at a meeting of the city planning and that was Helena. Rosenthal Genie Rice represented Civitas I represented the 79Th Street Neighborhood Association, and we talked about our concern as we saw important buildings that should be landmarked that were being torn down and we saw increasing height and we were trying to think about what we could do in advance to protect our neighborhood and our residential area, and we understood having that with this wonderful person from city planning. I can't remember her name about how difficult it was going to be to work to get what we needed to do for the avenues, but that we certainly should do something for the mid blocks and so about. 25 years ago we were able to get R8B for our Upper East side Mid blocks. We saved a lot of important buildings. We did a lot of work on it and we had very good city departments that helped and worked with us on it. We also were successful, asking about East End Avenue, which was an avenue but not really a very large avenue, and we were even able to get the 210 height for East End Avenue, but so we really now are we having the same conversation, but years ago, this community board, along with friends and civitas and neighborhood associations, in addition to mine, we all work together to understand how important it was to save the mid-blocks. Now we are being approached into these two proposals with undoing that I think that we owe the groups all of us who worked so hard looking in advance to try to protect the livability of our area and I want to know more about the our elected officials. I certainly want to hear their support for their community and for all of our organizations. So now the problem that we have is that Anthony I don't know you at all, but I wish. You were our mayor, because the problems we have we problems we have is that we don't have. The support of our mayor of our the people who are in charge of many of the different departments, are not the people who had been assigned years ago, who knew a lot about architecture, knew a lot about everything else, so we're in a very difficult time now, I think it's extremely important that we not that we do everything we can to not allow this kind of taking of what we worked so hard to prevent and to protect so many years ago. I'm going to guess it was about 20 25 years ago. The certainly the blood center has been a very important part of our area, they've always lent their time to the community board. I was on the board for a long time. We have a lot of trouble trying to find places to meet. They were always available. They spoke very well and we are proud to have them. I tried to get in because nobody was talking about the Rhb or the zoning, but I'm still saying it now, because it applies again to this issue. But you know one day: I'd like to have a talk with some of the health people in terms of their talking about the effect on our health residents, health in dense and overbuilt buildings and communities. That's also a health problem, but I think that the other people who spoke, who said that they appreciated the blood center, wanted to see it develop in a sense that they need to have more space and to do something better with it, but certainly not to have a building put in mid-block with that with all of that, they want to do. I hope that we are going to be successful again as a community board. I'm waiting to hear the vote from the community board I think that 120 some people and there were many more waiting, I'm sure, but the 121 people who and I couldn't press in because, as you know, I'm in another century I don't have all the modern equipment. But certainly the community has spoken about not wanting to see this happening with the blood center and even more or even more people are going to be concerned about not wanting to see what happens to the 210. For the thank you for the avenues, so I'm I appreciate all the work you've done. I am just sorry that all the work, the community board and the different organizations that all work together to protect our mid-block zoning now looks in like it may not happen, so we'll have to keep our fingers crossed and hope that we get a good response again. Thank you very much. Betty and we'll go stay with the public, because we have several public and we'll ask people to please be more, be condensed in what they say simply because we want to give enough people a chance to have their work and if you agree with the person who said before, I'd be grateful if you would share that with us, rather than repeating what they said, and so the next public member of the public on your list will be very grateful. You recognized them. We have Evelyn and then up next on deck will be Stephanie, Reckler Evelyn you just have to confirm a muting. Thank you, I and, first of all, thank you. Anthony I think that your rECAB of the efforts that the community has made over the more than I guess it's more than 18 months at this point before this community board and before the task force, I thought that was an excellent summary of what has happened and where we stand and I do want to point out that the architectural firm is actually the same firm for both projects and so for good or for bad I. That means that you know I. It's they're fully aware of how the community feels about these types of projects being imposed. This is a slightly smaller proposal for the blood center, but it I, in my view, has equally horrendous impact on the immediate surroundings. The fact that we haven't seen actually any type of studies for the hospitals proposal is astonishing. Given the professional pro, you know position of this firm and the fact that they've done one for the blood center which, by the way, I find very damning that the park is actually obscured in shadow for several hours in the afternoon, which is when the children get out of school and go to play. And so I just want to note. Also and I appreciate all the comments and support the comments and I did vote. No and I would actually go so far as to say that of the 25 people who voted yes, I would venture to say they are probably mostly the blood center and the hired consultants who are appearing for them. On this call, and not members of the community and the electeds I would certainly hope will show a more clear support for the community. I think we've made some progress, but there's a far far way to go and I think that our electeds have been very careful about how they have responded to Lenox Hill Hospital so far, and we really need to see them. Take a clear and decisive stand and you know I feel like there is some level to project whether it's the architects or the developers in the area have perhaps been emboldened to pursue these types of plans at the Lenox Hill site and in other areas like the New York Blood Center in part, because our electeds are not making our positions clear. Thank you very much, and next is Stephanie. Rickler Stephanie just confirm on meeting on your screen. There you go yes, I thank Anthony for those very revealing slides that show the bulk and the massiveness of the Lennox Hill proposal. It is obvious to the community to protect the Lenox Hill neighborhood. That I am a member of that Northwell's proposal is not about good health care for the community. It is a vanity project that the CEO of Northwell was quoted in the Wall Street Journal. As saying that Northwell is needs to have a a hospital on the Upper East side. That will give it credibility. He said that there is we could he said. Northwell could have the best hospitals in the other boroughs, but until it has a major hospital in Manhattan, we will not have the credibility that we seek. I must say that the community has not had the support of our councilman Keith powers. It is very distressing to us that Keith powers has not supported date, the our opposition to northwell. He is not. He has not supported us and to that extent we intend not to support him in any further position that he seeks. We are very distressed that he has not supported us and we intend to oppose him in his in any further position that he that he seeks in city government if he doesn't understand that the community doesn't want this massive doesn't need, doesn't want this mask. Could you wind up building yes and doesn't understand the health equity in equity issues that Northwell isn't addressing? Thank you very much now we'll go to the board members and also I'm afraid, I'll. Ask you all to be a bit succinct. Thank you very much in order we'll go through Michelle Rita and then Elizabeth rose. Thank you for the to the community. For being here, there were almost 300 people at this meeting, so this further emphasizes the interest in these projects and the interest in our community. The overwhelming amount of them are very concerned about these both of these projects and that's why they were here tonight Anthony that was very helpful. Your visuals were terrific I really appreciate them. I have one question about the Northwell Project, so we know that originally the plan called for almost well. It was about a 45-story building on Park Avenue, and we also understand that they have retreated from that position. But what are they proposing for that very site? Do you know yes, hospital well yeah go ahead, Anthony okay, effectively, rather than the initial proposal tore down everything on the site or more or less tore down everything on the block and built new hospital buildings, with the exception of a hundred by hundred foot lot at 76th and park, having removed that and removed that income stream from the project, northwell is now building just a brand new tower on Lexington that is more or less 180 feet square and 436. I'm not quite sure why it's so specific 436 feet high and the rest of the balance of the block extending to Park Avenue will be a renovation of the exist, largely a renovation of the existing buildings. It's unclear whether they plan on re-skinning them in addition to completely re-can reconfiguring them within, but basically it's what you what's there now will more or less be. What's there six years from when they start, the project went from a ten-year project and I didn't mention this to a six-year project, but that six years does probably not include all of the renovation to the Park Avenue end of the site that they said that would extend another two years, so the Park Avenue end of the site will not have a new high-rise. No, it won't have a 10 story, a 20 story, a 40 would not have a new okay great, thank you because it was never clarified after we found out that they were receding. I never was clarified to me anyway. What was going to be there all right? Let me just address the the blood center project. If I may, could you do it briefly? Sorry, yes, it's very good. It's very ambitious. We all agree. It's extremely ambitious. The programmatic needs are all of us would support that. All of us are very appreciative of the blood center to have them in our community. We are also appreciative of the fact that they it's more convenient for them to be within walking distance to the other medical facilities in the area. We had the same arguments presented to us with the belfor building on 69th street and some of the other wild Cornell buildings that went up. We appreciate that it's a community, it's a medical community and they need to be nearby. However, it just seems to me that you own that blood center building- and it seems to me in these times that you can find a place for this project on one of the avenues agreeing I mean. It also would be too large for the avenues in the communities feeling because we're looking for a 210 height limit on the avenues, but this kind of a project would certainly be more appropriate on one of the avenues. It would be hard for me to believe at this time that you couldn't damask some amass some properties along the avenue and scale this down anyway, so that it would be appropriate for that. It's a wonderful project. It's a wonderful building. It's a wonderful cause. We support the institution, everything about it is absolutely terrific except the location. It is a big violation of the zoning laws. Er the zoning laws are the only thing that prevents us from having chaos in this city and every single day in every single committee. On this board. There is some kind of a proposal to violate what the zoning permits, whether it be the new outdoor restaurants. Now they want to move that to permanent we're going to have permanent structures on the street, in violation of the zoning everywhere. You turn there are proposals to violate the zoning, and we really have to stand very firm about this because we are losing the sense of community. So I asked the proposal to the blood center to please keep that in mind and do what you can to mitigate and to listen to the comments tonight and in the December meeting. Thank you, Michelle I. Think that's. Why we're here with the zoning committee for our enormous salaries, as we spend the evening, trying to defend the zoning resolution and improve the zoning resolution, and that's these two proposals are a real challenge to us and so we're very glad for the community's support. Okay, Rita Popper is next I. Think yes and then Elizabeth rose after her. Thank you. I want to thank everybody. I have been sitting on this committee and watching countless organizations try to whittle away at the mid block. I have one question: Anthony did a fabulous job, everybody who comes, they only want to build larger. Has any study been done as to what the population is going to be in 10:20 30 years? Are we increasing or are we decreasing? Are we meeting the needs of the population or are we meeting the needs of people who just build large? That's just a question and I wondered if Anthony could answer if demographics of the people who will be using these facilities has ever come into play. No that's the short answer. The slightly longer answer is that well, while Manhattan grows a little bit every 10 years, Manhattan is not the largest. It's ever been. The largest population in the borough of Manhattan was in 1917, and it has never recovered to that size since and so one of the things which is not to say that it doesn't continue to grow, but that Manhattan was grossly overcrowded in 1917. but the I think Rita. You make a very good point that the need the anticipated need, certainly of this community for additional hospital space, seems dubious at best, and the problem is that this building, if it's built as currently proposed, will be with us for the rest of our grandchildren's lives, and there is nothing scarier than a bad building that is going to be there long after everyone. I see on Zoom has gone somewhere else and that's the problem and it's the same problem in a slightly different way, but the same problem with the blood cell. The question is really: is there a need for that particular thing in that particular place, and in both cases it feels to me and I said this actually to Elita about something else earlier today. It seems to me that, in both cases they are projects in search of a program that you want to do something you want to do something really big, really splashy, and so you make a program that fits your desires rather than the needs of the community. Thank you, okay, Elizabeth rose, so I was not on the board when first came to the board, but I am incredibly struck by the similar conceptual approach that the blood center is taking, as it relates to the approach that Lennox Hill started off, taking, which is give us a huge amount of far that zoning does not allow for allow us to breach every current zoning restriction so that we can sell that space to other people or other organizations in order to pay for what it is that we need programmatically and effectively what that is say, asking the public to pay for this organization's development and that's what their fundraising and developments teams should be, for. They should be able to raise the funds for the building space that they need as every other major medical, not-for-profit in New, York City is doing and has done, and so I'm really struck by these organizations, basically saying we want to build and make the money to pay for what we need and I think. If the blood center came to the community and said this is what we need a new building and we you know, we want to build it on this site for all the reasons that we've said and it we need a little bit of modification on mid-block zoning I think the community would be completely supportive, but instead we have a very self-serving proposal to massively build up on a speculative level to completely obliterate. You know what mid block was for, and I found this portion of their presentation very self-serving. They referenced how many of the blocks around this neighborhood are in fact, already overbuilt on the mid-block I know: I live there. I live in one of those existing non-conforming mid-block apartment buildings. The scale is so completely different. That I found the reference as a justification to be offensive. They also specifically talked about. This is the largest developable lot between first and third avenues. They conveniently defined their presentation as not including you know, first to York to the East River, so they're, clearly defining and framing this in ways that are entirely self-serving. I do have one very specific question that I hope they will answer, which is what is the current far allowed on their site? What is the existing far of the building on their current site and what is the total far that they are requesting through this? Just to get us, you know show how outrageous this is, but ultimately it is the Height Anthony just mentioned that the Lenox Hill building is about 180 foot square I believe and obviously the slides went by really quickly, but knowing the size of the blood center lot I believe their proposed building is even larger in terms of the cube. Finally, as it relates to Saint Catherine's park, there is no mitigation for lost sunlight in a children's playground after school. There is no such thing as mitigation. That is a huge loss to the community, and so you know, since this board has come out and voted against the proposal that Lennox Hill made I hope that this board will act very similarly and vote against the proposal of the blood center. I can actually answer a couple of those very specific questions about the I seem to have lost my image, but it doesn't matter about the existing versus the proposed building. The existing far is 2.89, that's not allowable, but that's the existing far and the building currently is 67 feet tall. They told us, it was 330 feet, 2, inches tall when all is said and done, and the proposed far is an far of 10. which is how they get to almost half a million zoning square feet and if the building were built, this is the allowable. If the building were built as a community facility, the allowable far for a community facility in community board, 8 is 5.1 in an Rhb zone. If it were residential, it would be an far 4. I hope that answers that question. That does so basically they're saying they want double the far and they want more than four times the height. Yes for the benefit to the community of this speculative building. Correct sorry, yeah! No thank you. That was actually very helpful information. Okay, thank you very much. Next customer Elita Camp and then Marco Tamayo you're on deck, then Valerie Mason after that hi. Thank you about the blood center. I'd like to ask and I hope, Elizabeth and Elaine don't mind, since the board doesn't have the benefit of being able to ask questions to the blood center itself and their representatives that there be a way for the members of the board to send questions to will who will or Elizabeth or Elaine who will then be able to submit them for the to the blood center for answers which will be posted on the website that we then I know the public was invited to do that, and it was just an oversight. So I'd like to ask about that. I'd like to remind everyone that the blood center that Elizabeth rose so clearly defined as being speculative, will mostly be a for-profit building and Longfellow. The developer has an investment fund for the public, so that to me- and I'm just speaking personally indicates the extent to which it anticipates making profits on this. So it's asking for a dramatic neighborhood change, a laws to the park to benefit it to benefit a number of people and their inventions and with respect to Lennox Hill, I'd like to say that and if I missed this, I'm sorry, I had to step away for a few minutes is that they added and there is no definition of why seventy thousand square feet to their building. So while they took 80 feet off the top and extended it between Lexington and Park Avenue, there's an additional 70,000 square feet and we don't know why. I'd also like to mention in this information I got off their website that it seems to be and again I'm speaking personally a luxury project, they've hired a Michelin chef. They talked about Crystal, chandelier, spa-like amenities, room service at any hour of any food that you want and on their website they had views of central park from the the hospital room that they chose to highlight had views of central park. So that seems to indicate we all know. It's elective surgeries that make money for hospitals. It seems to indicate the nature of the hospital that they would like to build. So thank you very much thanks Elita next Marco and yourself, can you hear me now? Yes, okay, I'm talking about the law center. This applicant is requesting to change the mid block, contextual, unique district character, Rab, whose maximum building height is 75 feet, which provides light human skill and a sense of residential community, as it were a simple piece of paper throw to the garage as well as they are requesting to wave several zoning resolutions removing them our community will be a commercial district. No, not only this application choose freely its own zoning district, but also he wants to eliminate good and common regulations that are protecting us. Removing these Sony er protections would negatively impact on the already heavy traffic. It is like in the lockdown of the pandemic period that we just lived if we had weighed the control of the opioids and not to expect the emergency rooms to be extremely crowded to the point of collapse. That is exactly the same in this case. Changing the Sony district from C109 to C28, Second, Avenue traffic. Presently is already congested from 60 to 70 seconds straight due to the 60Th street bridge entrance, and this applicant wants to increase 5,600 new jobs, which would attract larger number of car cars. That would be an eminent gridlock. Therefore, it will devastate our community. This proposed has an unduly bulkiness of 334 feet, which would cast shadow on the adjacent properties of the contextual Rab district that would affect in the school the park and its surrounding waka buildings. This proposed monstrous building would be a big return in the mid block. The mass of this building would be so massive, so out of scale so grotesque that it will be intimidated with this tasteless glass building. The applicant is proposing a robust mechanical system of six or seven feet high for plenum. It is needed because this applica indiscriminately is abusing the use of blocks on the building planning. Therefore, this building not only wouldn't be in compliance with the center priest of the climb Realization Act local law 97, but also these plaintiffs would increase unnecessary its high. We can go through something that could be unlawful. Finally, the proposed community facility project has less floor area than the existing or oh and or the maximum allow as a right of development. Therefore, this is not a community facility, but it is a commercial development which is inappropriate for our residential community. I am encouraging to all fellow community members that we must very mentally show our discontent on this approval aid. Thank you. Valerie Mason, yeah hi, I'm Anthony, and that was an excellent breakdown of what's happening at Lenox, Hill I mean I, think everyone is saying the right things. These are two vanity projects. I think it was very disingenuous for the blood center to come forward and talk about how Covid-19 makes this life science center all the more needed they have this project in the works long before everyone even knew the name knew the word Covid-19 and I. You know to say that they have life science, partners, they're, hoping to rent floors in a building, and we are right now in a situation in New, York City, and we can walk around everywhere and see empty storefronts, empty buildings. There are buildings all over Manhattan, large commercial office, buildings, closer to grand central station and all forms of transportation that we have no idea whether they're going to see their full usage ever again for the purposes they started out with all of those facilities can be available to the blood center and to let excel hospital, and they can repurpose the land they have right. Now, our community is besieged by empty lots that have. We have no idea whether extel will ever build on 70 on 1st avenue, between 79th and 80th I live across the street from six buildings that were emptied out on the corner of 72nd and 2Nd. Avenue I mean there are plenty of open spaces, as Michelle said that we don't even know what's going to happen to them, for us to support a re-zoning so that the blood center can let space to who knows who, because when it becomes available, who knows? Who will be there to take it? They don't have they're not merging with any of these so-called partners of theirs they're, just talking about a concept which can be put into any office building in the city of New York, I'm all in favor of keeping industry of all kinds in the city of New York. But there is absolutely no reason for it to be in the mid block of 67th street casting shadows over the very few park. Areas that we have I mean if Ed Kovet has shown us anything is that we need more open spaces on the Upper East side, not shadows and making the little space that we have less desirable, especially for the children of our community. We can not support this. The community doesn't want. We fought so hard for the little zoning that we have. We can not support this at all, and especially in this time where we have no idea what is going to happen to all these vacant spaces. I really think. It was also disingenuous that we didn't see any financial information related to the blood center tonight and we don't know where the money for this project is going to come from. It's not really in line with their current mission either. So I don't even see the not-for-profit use for if we're wanted. If we want to have jobs for people in New, York city, they can refurbish existing office space to put these biotech companies in spaces right now. Instead of waiting for a building to be built, thank you. Elizabeth. We missed a member of the Public Todd Heaton. Would you like to go to him and then keep going through the board members, and then we should move into executive session I think we should a member of the public who has something would please send their question to the board and Board office info at Commun cbadam.com? Is it yes input? Cbadem.Com I'll put it in the chat. Yeah, send me an email and we'll come back with two in it to you: okay, Next, board, member up, Felice, Farber and then Craig later than Trisha Shumamura thanks just a quick question. One of the issues raised earlier was about the capacity of the 77th street train station and presumably at some point, people will get back to riding the train and people will be heading back to Midtown. Are there any plans to improve the entrance or capacity at that station for the learning cell project? Do you guys know or Anthony do you know, yes, I think improve I, don't think that the neighbors felt it was adequate, but there are proposals to change or improve the station Anthony. Do you have any okay Anthony? Could you I think Valerie was waving her hand? No I got it. Okay, I'm sure Valerie was, but they are currently proposing to enlarge the southbound. Nothing to do with the platform enlarge the entrance stairs at the South West Corner, which is to say the south entrance of the southbound Lane southbound tracks, and to install a kind of elaborate double elevator system for handicap, access at that spot, only with no thought to the other three entrances, nor any thought really to anyone headed up town to to the hospital or for that matter to set to 77th street the there I think part of the problem with all of this is that as a city, not as a community but as a city, we don't demand developers, give us something and in fact Northwell Linuxcell, as I mentioned before kind of obliquely wants more floor area for the for doing half of the right thing or a quarter of the right thing, but anyway half of the right thing. So, yes, it's a little better, but it's only a little better if you're headed southbound thanks okay, later Craig and Trisha, and then Sherry all right good evening. Everyone I just want to provide a somewhat different perspective. First off, while I appreciate that we could submit writing questions in writing. I do fear that as CBA members, we've now lost an opportunity to engage at an early stage with the blood center when we have the collective experience and institutional knowledge to ask such questions in a public setting I do think, there's a benefit to doing it in public and I wish. We had the opportunity to do that. I also think it's important that this presentation of the blood center be made to the entirety of cv8 at a land use meeting, so we can further discuss the important elements of the project in a more comprehensive manner beyond just zoning and for me, as transportation co-chair I would like to have them present to our committee to discuss transportation impacts, as they may not be as clear-cut as everyone thinks they are in terms of the modal splits and how people may arrive and being able to work with them to ensure that any deliveries take place during off hours and have a minimal impact on traffic congestion and air quality and quality of life. Now, regarding both Lenox Hill and the blood center I think we need to project more of a sense of collaborative spirit and understand that the world changes and we need to be open to changes in order to allow institutions to flourish, even if it means there's a component that is for profit that allows for their critical life-saving missions in these cases to flourish. I fear as a board and as a committee here, we're projecting a visceral intolerance as a community for development and zoning changes and expansion. An expansion of anything, including legacy institutions when losing them would be far more disastrous. So are we going to be instinctively hostile to any proposal that involves potential zoning changes or variances? Where are we going to be willing to engage in discussions and be a partner to ensure that world-class institutions can flourish and be an economic driver for our community and the city with world-class amenities as part of their projects? I understand there are that people will sometimes react to the idea that these institutions are going to be putting in certain amenities, but as the types of institutions that they are I think we need to be a little more accepting of the fact that, in order to attract the talent and the people that they need in order to have to be able to flourish, that some of these amenities are just aren't just cosmetic. So I guess I'm not just saying the current plans for Lennox Hill are acceptable yet, but as an example, but I want to at least give them a little credit for curtailing the most egregious elements of their proposal like the residential tower and that we could hopefully work with them and find ways to be able to get something that we as a community can be accepting of. And while the blood center project isn't perfect, rejecting out of hand because they are seeking a zoning change on a mid-block. That's already very atypical of our communities. Mid block, isn't something that I. Don't think that I think we should be entertaining either so I say: let's work to propose improve the proposal, address shadow impacts and see if we can be part of the planning that could benefit both the blood center and community and finally, I just want to respond in general to the broader discussion we've had tonight regarding zoning I respectfully disagree that you can separate purpose and mission from zoning. If that were the case, New York City would be a very different place. As with many blocks within community Board, community district 8. variances are routinely granted across New York city for projects that are arguably much less critical to the economic vitality of a city or community, and I like to remind everyone that the zoning resolution is a living and dynamic document. It's not etched in stone and should not be used solely as a pledge for maintaining the status flow, so in I, guess in summary, I think we should be treating these projects differently from luxury high rises. That truly have nothing to do to enhance our community and I hope we can, as we move forward with this, try to find ways that we can accommodate these institutions in a way that is respectful of our community and that could benefit those that could benefit us as well and really enhance our community going forward. Thank you very much frank I. Just I'm sorry, Elizabeth I just want to respond to Craig with specifics. I ask that people submit their questions because I think the blood center had left and Northwell has been invited to this. The blood center has not been very forthcoming with its materials, but by all means you, as co-chair of transportation, should certainly invite them and any other entity that you feel deserves to have comments and questions from the board and the public and with inquiries that you would like to make absolutely with respect to Northwell. We have tried to work with them repeatedly throughout this task force process and we have been rebuffed over and over again. They we've been asked not to share specifics, but without doing that to just say that we have wanted to engage with them. We have wanted to try and work something out that made sense for the community, while allowing them to function as an improved hospital with modernization, but they have shown no interest from the very beginning when they had a public outreach program and did not invite the community board to see it, and that was I lost track of time from this virus. But that was at least a year and a half ago, I think or well I, don't remember, but they have not really engaged with us or have been very interested at all in engaging with us, as Anthony pointed out, otherwise, I believe and I think you know I believe in collaboration and cooperation. But it's not a two. It's not a one-sided street. We've made we've made overtures and they have just not been very interested foisting the idea that, because they're in the public service or doing this for the public good, that they should be entitled to whatever they want, which seems to be the same sentiment that the blood center is expressing. Absolutely certain things are desirable to have in communities, but when you think about the bulk of these buildings and the impact on the quality of life in the residential community that surrounds them, it's not as simple I think as either zoning or their needs would suggest, and the first step is to consider why the zoning is the zoning. So I'll end with that and by all means, if you can get them kudos to you, get them to come to transportation, very much Elizabeth and Elaine. Okay, a leader I, just wanted to say, Lenox Northwell, had promised that after the task force meeting, they would come to the community board in the committee they refused to come. It took us you I, you know how long it's taken us, the blood center ambushed us by not coming to us and the fact that they're as far along as they are in their application, with not considering coming to the community board, is a disrespect, and so I wanted to say why I held out the board speaking about the blood center as I was hoping. We would do it both at the end of the item two because of the time limitations on the major, and we also have something under old business. We have to deal with so Elizabeth, it's back to you again. There was no disrespect for the committee or any of the decisions that you've made. Just surprised that we couldn't get Northwell here, surprised that the blood center spent so much time talking about what it does and little time talking about how this fits in, given what it does and ignoring the rest of the building. As many committee members have said so I'll stop here and thank you because they were asked only to present on zoning. We did not need to hear their programming. That's not for us. Go ahead, Elizabeth well, I think if an institution pro proposes something that is extremely damaging to the community by definition, because it's so far out of the law, if I were an institution, I would stop talking about zoning, because that's where I lose I was stick to how wonderful I am as an institution and hope that people forget how damaging my proposal is. Anyway. That's just my view. Okey doke Trisha have one comment. My comment is just that I was I, think that was what was most surprising to me tonight. Could you speak up a hi? Is that at all better okay, I apologize? My speaker sometimes breaks out one comment in one question. My comment was that what was most surprising to me tonight was actually of something that was brought up by a member of the public and it was from the Julia Richmond. Center I was really surprised that the blood center had not engaged with J wreck, and it was a little painful for me to hear that J wreck had to go through a public comment session at a community board meeting to get a hold of them and to express and to first view, their presentation, I think that's a huge problem and I and it leads into the next. My question, which is about process and next steps. I would just love to know when, if and when this presentation is being brought to us again when we plan on making a resolution on it just kind of where we are with that and I apologize if I came in late, but the long and short is that I. This is a proposal. That's going to face the very nature of that street. It was shocking to me to see that the next kind of biggest neighbor that would be impacted by this hadn't been engaged on this, and it's I'm wondering if there's some way that we can really emphasize that before we hear this again, that the blood center does its due diligence and reaches out to its neighbors to get their input. Thank you consider a letter or a resolution. We can discuss that as board members in the committee. If you want yeah on we're, not in the official process of either where we will be required to take a position, we can either write a letter or do or past some resolution, but we're in the pre-process at the moment. So we think how the I think the most effective thing that has been done this evening is that I'm sure that there's somebody from the Lenox Hill hospital listening in on this and certainly the blood center, is aware and I think by making them aware and making our elected officials aware of the enormous community opposition and for very good reasons. We pass zoning laws not because we want to spend our time spent passing zoning laws because it because zoning is what is there to protect the livability and quality of life of neighborhoods and I. Think that we're bringing that to the for four as opposed to the needs or walk or wishes of various institutions. So we go to Sherry Weiner, yes, hi I want to concur with what Elizabeth said, I think. In both instances we have projects where it's the extraneous component, the hospital the residential tower and, in this instance, with the blood center, where their component could be the first four floors and now they're trying to they will be renting out the additional flaws to commercial tenants. But my original point, which was kind of, was touched on by Trisha. So do the chairs or the chairs looking for a resolution to pass tonight or how would they like to proceed? I would be willing to put forth a resolution if that's what you're? Looking for just not your Elizabeth's response was kind of I. Don't couldn't really tell what you would like to have happen tonight, I'm looking for a response from Elaine and Elizabeth. Do you want a zoning and development to pass a resolution tonight or what is your thoughts? Perhaps we could write a letter to the elected officials asking for their support. I, don't think I don't want us to waste time, taking steps that will have no effect so I, don't know what Elaine thinks about this, whether you prefer a letter and to whom or a resolution. Our experience has been when we do the resolutions, which I think are important. They don't seem to be read or listened to. But when we've done a letter we seem to get a different response. I also think that we're in a time crunch, because if we do the resolution tonight, it really should go to the full board tomorrow night. So it's something that Elizabeth and I have been discussing. You know which action and I think we'd leave it to the board members that are here tonight. If they somebody wants to propose a resolution on the blood center, let me say that I was going to fold in the blood center, with Lennox Hill or with Northwell, because of the similarities and having us, rather than break into small groups into executive session a number of times to do it at once. We have one other project we have to deal with tonight or two things rather, but you know I think it's. If somebody wants to put forward the a resolution we can do that or we can do a letter which would go to all the powers that be that we usually send out. So it's up here, cherry I still have the see how the floor. Perhaps if you find that letters are more productive, perhaps you need to take a consensus of the board members on the call and see what direction we want the letter to be in and then we can pass a resolution at the next. The next meeting maybe make it a two-step process. I think that's one of the things we need to do is we. You know we do send letters and resolutions. We need to follow up, so I would think we should send the letter and then we should reach out to the electeds and say you know the community have spoken and we really need you to support. You know what our position is. Okay, why don't we could you take anybody's hands away? I'm sorry, Elizabeth that you we can see, are supportive of the blood center and then how many are opposed to the blood center proposed until at this point. So would this be raise your hand if you are supporting a resolution and or razor? No, it's the le. If we're going to write a letter, we need to know if we're saying we're supporting it or we're not supporting it right. So what if we do? A yes and then yes and a no like we did before everybody seemed to like that? No, you could go yes, if you, yes, the letter should say we support the project and no say the letter should say we really have problems with the project. That would be my suggestion. All right, well, I, will just remind we have 78 people on the call right now and now. This is just only going to be for board members. Yes, I'm trying to get that out so right now, I only have people from the public who have their yeses and no's. So I'm going to clear everything. Only the board members, please use your little yes and nose. I see there. You raise your hand again and yes means you want to support the bud center and no means you don't want to support the blood center. Is that your motion? Yes yeah? Just so, you need a consensus. You need to know what your letter is going to say so I think we need to know, okay, how the board members feel so your letter. So yes means you want your letter to support the blood center and no means you're. Let you want the letter to oppose the blood center. Is that clear? Yes, I mean yes, if you have your hands up, I can't see a yes or no, so I just want to tell Craig, Tricia and Russell that Barry as well so and Russell Trisha, yes or yeah. Sorry, I, don't really know if I agree with the vote, so I may be. Abstaining from this one I want to just I want to get more information before I actually make a decision on this, and my pro my problem was just I wanted to get answers and I wanted to raise. I wanted. I preferred would have preferred the letter to be citing concerns with the presentations asking additional questions at the public race, asking the board questions and asking that they come back for another presentation with the answers. I'm not I, don't feel very prepared right now to say one way or the other. How I land on this and I would also ask for a community for them to do more community engagement to ensure that they're engaging with the neighbors so I could I didn't I can concur because right now, I would have seen right now all right hi. If this is my proposal, I would I will agree with that. I think that's a good point, let's at least alert the elected to know that we have issues and ask some more questions. I think that I think that's a very good suggestion. So why don't we if, as me as the proposer I, concur with that the letter would not be a yes and no it'll just see we do have concerns these are our concerns, and these are our questions. I think that's a good way to go. Thank you, sherry. Would you take some input from me that what we're looking at now is not any programming, but the zoning issues related to the site that the blood center wants to redevelop. That's what I thought yeah well! That was what the later that I assume. That's what the letter the focus yeah I mean they did the same thing that Lennox Hill did they gave us all this. You know apple. You know American Apple, pie, kind of stuff in the beginning, which we know had nothing to do with the zoning. No, the letter needs to be pertaining to the zoning, but I. Think Trisha makes a good point that, let's at least have to get the conversation going. You know if we're trying to get the elected's attention. Let's say this is you know we had the presentation. These are the issues that were raised and you know we'd like the blood center to address them. Thank you all right, I, don't think it's worth writing a letter of that type. Okay, no, because they're in they're having a scoping session, December 15th, so they're much further ahead in the process than Northwell, because after the scoping center excuse me session, they will be responding and doing the Eas and they're moving along. So the clock is different for the blood center than it is for northwest and the scoping session is for the Deis not for their yeah. Just for it's clear to all the board members I know, some of them are pretty new to the process. Majority of board members are voting, are in opposition, so well I, don't know, but then yeah it. I'm trying to accommodate what the chairs think. So whatever you think I just think the letters saying we need more information is just like saying nothing at all. No we're saying we do have concerns we're. Certainly it's going to be. The board is saying that they are opposed to it. I think we're trying to combine a letter saying that we're opposed to the project. We're trying to be conciliatory, perhaps is the word to get more information. I mean Craig made some. You know made some good points about it. So I think we want to think to keep the conversation going. I think should be our goal, but we certainly should say that we definitely have from a zoning perspective. We definitely have issues with what's being proposed. You know mid block and I'll be happy to work with somebody on writing letter Elizabeth. You have several board members with their hands up. I, don't know if you want to go to them. Could people please be quite brief on their what they have to say? Okay, so Barry yes good evening. Thank you for very dynamic and robust discussion, I'm in favor of a letter, but does not state that board is opposed, because this item actually belongs in the zone in the land use committee where the full boards are engaged and I would then probably encourage a letter to say we have concerns regarding the presentation we'd like further input and further outreach to the community, but I would not go beyond that. Thank you, Rebecca Lamart, then Elizabeth rose Michelle and then Alito Rebecca, hi, sorry, similar to what Trisha said. I just wanted to flag that for that vote, I wasn't comfortable, making a yes or no call that I would prefer to see the letter outline our concerns around the project, raising issues that have been brought up tonight and, like Barry, said fold it over to the land use to get more buy-in, because I, don't think personally, like I said, I'm not at a place ready to make a call yet and I think we need to get some more input, get some more answers and see what they come back with thanks, Elizabeth rose so tonight we had over 270 people in total. If you take away I, don't know 20 or 30 board members who have been attending. That still means that we had about 240 members of the public here today. I think we need to be clear with the public. What are the levers that the community board has in this set of proposals? What are the actions that we are likely to take and win? So if we intend to do proposed resolutions, we need to let the public know. That is something that we are planning to discuss and win. If we plan to have some a vote, we need to let the public know when that is going to be, because I think you know the biggest question that I have heard from members of the public over the past week. Leading up to this meeting have been well. What does the community board need to hear from us and what is it that we can do, and you know they clearly showed up tonight, because we, you know I at least said if you're concerned about this. You need to attend this zoning and Development Committee meeting. We need to let the public know exactly what are the various steps that we can take and on what time frame so that they are informed and know when do they need to appear what else that can they do in order to? You know, see us through and ensure that we are responsive to the community? Okay, Michelle yeah after this very full presentation and with respect to the attendance that was here tonight as Elizabeth rose, said, I think we have to come up with something stronger than a letter that says: can you give us more information? We got the information, we don't need to know what they have. What sync is going on every floor, we're responding to height and bulk and the zoning that's appropriate in the mid-block. That's what we're talking about and we have all the information we need now without a full, a resolution and a full board vote. I. Don't think we can say that we disapprove of it, but we can certainly say in a letter that we are in opposition to the plans as presented and to me if you say that we would invite them back to a land use meeting and then have another presentation if they're willing to come. You know they may not be willing to come and then get a full resolution. The alternative to me since we have a board meeting tomorrow night and since in fact they are in a different time frame, they're moving along very quickly. We're going into holiday in December- and you know and I, don't know in the winter months if you'll get a crowd back like that, we can also do this. We can formulate a resolution tonight in opposition, as presented and tomorrow night at the full board meeting in our on the screen. We can show the visuals to the full board and ask for the support of the resolution, but to me you either have to take a chance and do it next month at a land, use, meeting or you've got to get a resolution or something done tonight. We have the full presentation if you want to cover yourself, because you have more questions, that's fair, so just say as presented. We do that a lot in the landmarks committee you know, and that leaves it open if it's as presented. You know the inferences. If you come back and correct this and this we might reconsider it leaves it open. Yet we have dealt with it and we have shown the community that it was worth their time tonight. I, don't think you could ignore this and one other thing as they go through Euler. We will be obliged to pass resolutions, yes or no, so that is in the future. However, we go tonight the future we're not voting on their official proposal, because it's not at this stage, their official uniform land use review, process, Euler presentation. This was an informational presentation, so the future will require yes or no resolutions, so we're not locking ourselves out of that, because it's required a leader. Thank you. I just want to say, I think we could do a letter that would be strong enough along the lines that were suggested by I think Elizabeth rose if I'm not losing track. I. I've heard a lot of board a number of board members express concern about voting on something and I. Don't want the board to be in a position where we don't have if p, if it's, if waiting and getting a full presentation and answers to all of our questions, will enable the majority, or even the vast majority of the board to oppose it will be stronger or if they ultimately approve. It will be stronger than having a resolution now or a vote now where people don't feel equipped to be able to vote on it, and it doesn't look as though we strongly oppose it. We certainly should mention the number of people from the public who have come and opposed it and how many were in favor of it, even if they are members of the blood center. The numbers alone are a strong indication of where the public stands on. It mention the list, the the questions that the public submits list, the questions that the board submits and say that we are unhappy that they haven't provided more information and haven't appear till now and that we expect them to show up with a full presentation and a full opportunity to stay as long as necessary. To answer all of the questions, that's what I would suggest and I think it could be worded in a way that the board's not taking a position, but our concerns are clear and I'm happy to write that if that's acceptable to Elizabeth Inouye. Thank you Elizabeth. Are you there? Yes? Well? Are there any people on the board who have not spoken? Who want to comment Craig? Do you want, then Russell Squire and then Susan where's Craig, I'm right here. I was quickly just going to say: I want to reiterate that scoping is a formal part of the environmental review process that takes place relatively early in the process. And, yes, we should definitely all be involved in that process and make sure that all of our concerns are noted so that they can incorporate that into the environmental review and then I want to say. I'm I think it's entirely premature for us to say we're opposed at this early stage and to take a vote. I. Think expressing the concerns of the board at this point are entirely appropriate. But to say we're opposed would be putting the cart before the horse, especially since we didn't have a chance to actually engage directly in discussions with the blood center representatives. Thank you. Okay. Russell thanks yup. Okay, so you know what I hope will come out of this is that the blood center would come back to us. Having addressed the concerns that the community and the board members have raised so I think that would be the ideal situation and maybe they will- and maybe they won't but I- think the priority in terms of the the letter and kind of what we're doing now should be to try and get them essentially to engage with us in a constructive way that actually addresses the various things that folks have said. So I would hope that the letter emphasizes that portion of it I think others have adequately expressed why it would be premature to actually take a position on it, but I think. Basically, we should indicate to them in the letter. Letters folks are saying that, obviously, there are very you know, widespread concerns and what we want from them is information, but also really some kind of a constructive response to what's been raised and what the concerns are, and hopefully something that that addresses those concerns. So that's what I think should be the kind of priority in terms of what we what we provide to them. Thank you. Trisha sorry, I meant mental over my hand, I'm in complete agreement with the letter. Thank you with what Elita was saying too. Thank you. Give Barry and Rita Popper Rita. Isn't the purpose of this that we don't like not that we don't like, but that we are questioning the usage of R8B, the zoning for R8B for how they plan to use it, so that that's what we want to have explained as to why they need this, and that we are we question if they really need it am I wrong or I mean the whole thing is zoning and we, if they came to us with a seven-story building, we probably wouldn't have said anything, my just my two cents. Thank you. So you have Barry and Michelle who have their hands up. I agree with Trisha and Craig. Let's do the letter, let's get it out. Thank you. Okay, Michelle, yeah, I. Think everybody having questions. That's all fine, that's terrific, but is there anybody on the board here? That would approve the plans that they presented us tonight. Is there anybody on the board that would take it as presented, because if there isn't I see nothing wrong with a resolution, you could do a resolution and a letter. You know with a resolution that says and for all the reasons for all the reasons everybody stated, which is primarily the zoning and also we appreciate their programmatic needs, we're very happy that they're members of the community- all of that but as presented, we oppose you know the plans that they presented us tonight and then go forward. There's nobody here. That would approve the plans that they showed us tonight. That's all we can vote on. You can't vote on something that what might be will be. You have to vote on what's before you, and this is what they gave us. What came before us tonight were those plans we should attach, or we should put the plans in the palette, so people could see it and just make a statement we can put in that. We need further questions. We need this. We need that whatever you want to put in the whereas is, but the final is be. It therefore resolved. We oppose your plans as presented and I. Don't think is there anybody here who disagrees with that? Why are you welcoming a back and forth of questions that will have nothing to do with the zoning? What questions we I have a million questions about the project, but my questions are not going to address the fact that this is like a 30-story building on a side street. So we're not addressing anything like that. So, while you may be curious and get all your questions answered the basic presentation that came before us tonight, unless somebody here is willing to support it, then we can honestly. If not, then we can honestly and safely say and accurately say and strongly say we oppose the plans as presented and that's what I think ought to come out of this I. Don't know why we're looking for some genteel wishy-washy way to say this. You have plenty of time to be conciliatory. Believe me, this is going to come back to us many times. There's going to be a lot of discussion and considering the community came out tonight. Frankly, I think we owe that to them. They made their voices heard and now why are we reluctant to express those voices? There's nobody on this meeting tonight, that is in opposition. You know that is for the plans as presented. So let's just have a resolution saying we're against them as presented. That would be my proposal. Okay, a leader, thank you. Elizabeth Michelle, I, just I agree with the idea of wanting to have a firm voice and absolutely that the community came out. But what I've heard from the board is that there is reluctance on the part of some members to vote against it even as is presented, and we don't and I would suggest not having a divided vote that it just doesn't look strong enough or opposed enough, that we are saying that we are concerned and expressing the tremendous opposition indicated by the public. I think as Elaine or Elizabeth pointed out that our resolutions are not always taken very seriously by the city and that's a bit of an understatement. So since we have people in support, since it seems that everyone is in support of the letter, I think it would be more effective than having a split vote on a resolution and enough people have said that they are concerned about a resolution at this point that they don't know enough, and even if there is a failure to comply with the zoning rules as written right now, there are people who have expressed other points of view. Having a divided vote. I think would be not a good thing at this point. So that's my own two cents, but I, of course, will go along with what the community board believes and wants to do. Well, if a letter is to be worthwhile, I think, instead of asking anything from the elected officials, I think it could provide them with the information of the enormous opposition that was expressed to us tonight from the public, because that's just in telling them a fact and perhaps making them aware that there are grave concerns and I know that's wishy-washy. But we seem to have to be wishy-washy with this at the moment so and we will be have to be forceful in the future so that we're not cutting ourselves out of anything but I, think asking them to provide more information, and so on is just too wet to go up. I think if you just provide them with the information that there's an enormous community opposition and I, think one can say that, even if we all disagreed with it, we could say that the community is very strongly opposed to the both of these and say that has caused grey's concern and it doesn't say we're concerned about what. But I think if we that's about as strong as we can get from what I can tell without moving into something that is just too wishy-washy. But I would also add to the letter that the blood center has not engaged with the community to this point and indicate that we have not had an opportunity to discuss, concerns or hear from them in a fuller manner and and be strong in language about that. I'm done and thank you for listen. I'm done for now and thank you for listening, but I agree with everything that you've said, always hey Elizabeth. Why don't we ask for a store vote and see how many people, given the information presented around the zoning, support the project or don't support the project? Does that sound okay, Elizabeth I? Didn't care I couldn't hear it? Oh I'm sorry. What I was saying is why don't we do a straw vote on what has been presented regarding the zoning and see how many people support the project with the change in zoning and how many support do not support to get a sense not to use this, but simply as an informational vote? Yes, okay will. Can you do that? Please yeah I just cleared everyone's hands. I. Think how about this? If you are we'll, do it like what we do at full board? If you are, it sounds the motion on the floor at this point is to say you're against the proposal as presented and if you would like to vote, no abstain or not vote for cause on that straw poll. Not a full motion, raise your hand and clarify your vote and we'll go from there and then I'll read the names of the folks. So it's in the public record. So this is a if you're not voting for cause, abstaining or voting no on being in opposition to this as presented. Is that exactly as you would like it to be stated Elaine, the latter part, the last part where you talked about you put abstain, not voting, for course, and then I thought you said or opposed or voting, no, which then would be a yes yeah. The old, no is a yes well I. Think since we're just voting on opinions, it's yes, no and I have no opinion because we're not going to take any action on the vote. It's just to find out where we stand. Is that right Elaine? Is that what you're? At this point, given the discussion? That's the best I can come up with yes, okay, so you guys have heard it. I see five hands that are up, I'm just going to run through them, really quickly, Barry, Schneider, then Craig, then Rebecca, then Trisha, then police, very abstain. Thank you, Craig abstain and I. Don't think we should be doing this, given that we moved on from the original agenda item, this is inappropriate to be doing any type of straw vote or otherwise. At this point, in my opinion, thank you. Rebecca Lamart abstain. Thank you, Trisha Shimamura, staying until more information. Thank you, Felice Farber I agree with Craig and I'm saying thank you and Elaine. You have your hand up. Oh I'm, sorry, okay, that's everybody! So just for the record, the other folks here, Elaine Elizabeth, Elita, Anthony, Elizabeth, Rose, Gail, Barron, Marco, Tamayo, Michelle, Birnbaum, Rebecca, Dengor, Rita, Popper, Russell, Squire, Sherry, Weiner, Valerie, Mason, I. Don't believe I missed anybody in the public record. Okay. So how many is that sorry I should have been counting. I know, I started doing lost, counts, it's okay, Valerie I! Have that as 12. and is Barbara Cho? Are you a board member? You don't have your camera on. You raised your hand as if I may have missed you is that Barbara. Is that truck rubber chalk? If that's you unmute going to believe it's not them. Okay, my camera doesn't work. I support it. I wish I had a number of times during the meeting and nobody will call on me. I. Think we didn't know, you were you're you so sorry Barbara well, I, don't my camera doesn't work I'll, bring it to an emergency repair person and pay 500 to get it fixed. I can't understand what this person is saying: okay, Elizabeth did we miss you didn't miss me. I am following up because I am quite concerned. The scoping and granted we've all been ambushed by the date of the scoping meeting is December 15th. The only full board meeting between now and December 15th is tomorrow. So the likelihood at this point on the current path is that the board will have no position during to express in testimony at the scoping meeting. Scoping is service. No a scoping meeting is not a vote. The scoping meeting is you're discussing opportunity to testify. So what solution that we are going to testify and say the community is a has raised. Their has been opposed and the board is not taking. A position is an incredibly weak position to be in going into this scoping meeting. So, just thinking about this working backwards and just working the timing backwards from the scoping meeting and recognizing that we have all been blindsided by it, I would like to propose a resolution that we take, that we put that we vote on a resolution tonight to oppose the requested changes in zoning, as proposed can I clarify that the scoping meeting is a comment period about the draft environmental assessment. It is not about the Euler application. Just I want that to be clear for anybody who doesn't know that yeah, we will not be take, is will said we will not be taking a position. We're saying you aren't considering this as much. You should look into that. It's where we that is an incredibly weak position to go into to take at that scoping meeting, and particularly given the community concerns that have been raised. That's I, that is just an incredibly weak position for us to be in so I have put I have proposed a resolution. Could you repeat it that the zoning and Development Committee opposes the requested changes in zoning to allow a 334 foot tower with 10? Far on the current site of the New York Blood center, second, as well as the other requested changes such as waving of height and setback, just the setback performance, so the motion has been seconded Elizabeth. Would you like me to go through the folks who have their hands up to discuss the emotion Elizabeth? Is that what you'd like to do Elizabeth? Are you there? Did we lose her I, I'm having trouble hearing it from this meeting at the moment, so I, don't know what we're doing is this? If you raise your hand, you want this resolution. Is that correct? The question hasn't been called on the resolute on the motion, so this would still be discussion of the proposed motion. Is that the right parliamentary procedure way of describing that? Yes, sorry, I'm not hearing clearly on this I, don't know why Elaine maybe you're louder you can or right Elizabeth. You send me a chat or something to tell me what this is about, we're supposed to put the hand up for what it's a discussion of the motion on the floor. Okay, it needs to be there's not oh recognizing we're, not voting, not yet. Okay, recognizing people on the okay go ahead and recognize everybody. Sorry, it's okay, Barry Schneider good evening again, I'm yes, I'm unalterably opposed to a resolution on that matter. At this time, the proper place for the resolution is in the is the land use committee after the item has been certified by the city department of planning. We are incredibly premature in considering a motion to deny abstain and object to a presentation which we have no idea what it'll be like when it comes before us officially, I think this is out of order. I think we should just move the agenda after having agreed to have a leader sentiment letter. Thank you, Anthony. Thank you. Okay, I find myself in an odd position of agreeing with Barry and I. Think that and the reason that I agree is that it is premature. Some of us have seen this presentation now twice. Some of us have saw it for the first time tonight and I think that it's hard for us to a decide as a committee as a board on something that we in fact have not had very much time to think about. I have what I feel is a well-formed opinion on it. I think it's I think it's the wrong project for that site and I have lots of questions as to why it is that way, but I don't think that we should in fact prematurely offer a resolution that I suspect would at best be barely approved by a full board. At the end of an extremely long meeting tomorrow, I think we have to I think whether ultimately, the board is in favor of this project or not. I think that this committee should be looking further into it. I, don't think that it is, and I do, disagree with Barry I think that there's no reason for us not to have a resolution I just this committee to have a resolution. I, just don't believe that that we're ready to have to resolve on this matter this month and, yes, the schedule is lousy and yes, they blindsided us and yes, they've, been acting in kind of bad faith in the way that they hid things from us for so long. But you know that's the hand, we're dealt and I think it's important that we respond strongly and with at least something that begins to approach unanimity I just to editorialize one more time, just a teeny bit I find the committee of the whole for land use less valuable than the work that can be done in this individual. In this smaller forum, I think, by the time we get to the full board, voting on Euler people ought to have seriously considered what they're doing, but just my opinion, I think. The best thing to do right now would be to withdraw the motion and for us just to do a letter and go eat our dinner or move the agenda as it were, move the agenda. Thank you. Russell thanks. So yeah I just want to point out. I mean I. Think the resolution is originally presented says that the zoning and Development Committee opposes the proposal and obviously, ultimately, if the committee passes it, it's something that's going to go to the full board, and you know, as others have pointed out, this is an item that is going to eventually come before the board formally in the future as a land use proposal and so I don't think it is really appropriate for the board, ultimately, which is the result of passing a resolution here for us to propose to the board that the board passed a resolution. At this stage saying we oppose this proposal. That's really again: it's a it's going to be a land use item, it's going to come before us as land use and prejudge it I. Just don't really see the benefit of doing that and I. Think it's premature and it's inappropriate and I say this as somebody who in the straw poll, voted against the proposal. I, don't think the straw poll was particularly relevant, but the question I gather in the straw poll was, you know, gun to your head. You know if the question was: do you approve this thing is presented or not? My answer to that is no, but I. Think that's different from saying. We should have a resolution formally saying that the board is going to take a position on this before it even really formally comes before us as a land use application. So that's my concern with it. I think. If we just send a letter that says it's indisputable, there are enormous concerns or there's widespread concern from the community, and we really want to hear more from the applicant to say you know what they're basically to provide the additional information that we're looking for and also again, hopefully to address the concerns. I think that's. That really is for me. That's the priority is, let's hear them address the concerns that have been raised by the community at this meeting a leader thanks Elizabeth, I'm just a little bit confused the scoping meeting and the zoning resolution seemed to be different things and I, just emailed Elaine, who I think confirmed that. So I'm wondering- and I'm thinking aloud here, if there's a resolution that could say and I'm mindful of what Anthony is saying about the work being done in the committee yet also agreeing with Barry that it's premature at this point and we don't again I, don't think a split vote would really help, but maybe there's a kind of a resolution saying something like we've been blindsided and the blood center has not presented any information sufficiently to the community board and we want and just something like that. They need to come something like what the letter would say, but without objecting to the entire proposal, because the we haven't had even when the hospital came and we had a resolution in zoning and I disagree with Barry that zoning is not there as Barry says it's not the correct place. I think we could have a resolution here, but we didn't have enough opportunity. We didn't have them answer the questions from the public. We didn't have them answer the questions from the board and there are people who have very thoughtful responses who are willing to abstain rather than vote in favor of a resolution opposing it, and that doesn't put the board in a great position. But maybe there is some language that we could use in a resolution that is more I, don't know if it would be more emphatic than a letter and again I'm just thinking aloud. So thank you. Everyone for bearing with me I want to be as emphatic as possible that what they've done is wrong that this, that we have to give serious that zoning is paramount here that, but that, but not to be in a position where we're voting early or voting with votes that would otherwise oppose it. Not opposing it at this point, so I think since I initially proposed the resolution, I'm willing certainly willing to modify it because my intent is for whoever testifies on behalf of community board 8 at the scoping meeting, and there clearly is an opportunity. They will not be testifying on behalf of at a scoping meeting. The scoping meeting is not a for or against meeting, it's a comment. It's when one talks about what should be addressed and why, in an environmental impact statement you won't be going in there saying we think this is a terrible idea. You're going in there saying you should consider the effect on this. You should consider the effect on that and then at that stage. If people want to we, we could have some emergency meeting before look at the positive deck and see what we want to add to subtract from and so on, but I don't think that this is not a yes or no, that's not a place for yes or no. On the proposal it's on the Enviro should be addressed in the environmental impact statement, who's next Marco and then Craig, then Valerie and then Barbara Chalky. Is it possible for me to give my spot to Valerie Mason? She looks like she has something pertinent to say and I'd happily wait to the end. I'm happy to wait. I just I, just I'm happy to wait. I appreciate that Trish, but I, just okay, then I'm just going to then I'm just going to say quickly to Elizabeth Rose's resolution. I just feel very stuck here, because in deep down, I have some serious issues with this presentation and I very much feel that at the end of the day, if I was forced to against. You know that, like that my gut says no to this. But the problem is the process here, and the truth is that this is the first time that I got to see this presentation tonight and I didn't get any I didn't get a chance and to ask questions. I didn't get a chance to hear the questions that the public were asked to be answered and I just the process to go through with the to go through and push through with a resolution of a yes. No when, as Elizabeth Ashby said what it ultimately isn't, a yes no situation just makes me forces me to abstain when I really don't want to so I would just ask that for me, I, I'm struggling here, because I want to be supportive of a no but I. Can't because of the process and I can't because it's just it hasn't given me enough time to hear the answers and I would go back to what Anthony and Elita and others have said about, raising the questions getting having an opportunity to get these to get responses from it, so that I can so that I can be on the side that I want to be on, but I can't right now, which is why, if there has, if there's going to be a forced resolution of whether or not this committee and opposes this, I'm going to have to abstain, which is which just makes me feel awful, because I don't want to be on that side. But that's where I'm at right now next is Marco and then Craig, then Valerie and Barbara Chucky Marco. Will you? Can you hear me now? Yes, oh thank you I think I agree with the Ashari later, because I think the only thing that I can see at this time is first I review. Very careful. The application and the city planning I was in two presentation of this project and I, hear the comments of the community and the community hearing that they thought they saw for the first time they. Actually, they have an excellent opinion about the project because the applicant, usually they hide some information, purposely but the community right away. They understand what's going on so the letter should be saying that we have serious concern about the resulting of 2Nd Avenue and we also have concern of the amendments of the section 74 48, 32,421, 33,122, 33,283, 33,432, 32,645, 32,655, and also we need under a clarification what kind of affordable housing they are talking about and finally explain more about. They are looking for capital funds for the industrial agent with tax benefits. So I think this is the points that we have to address directly to them. But this is what they're talking about tonight all this issue we want to. Let them know that they are no clear in that direction. However, at the end of the day, what the community expressed themselves today I think they clearly address all these points and I have I'm with the letter, because I think is it if we take a boat for a resolution, I think it's a little bit premature in that direction, but Alera I think at least we have a position we they will understand where we're coming from and what we expect at the time with the Euler process start. Thank you next would be Craig later than Valerie Mason hi, again just I guess a few things quickly. My first question in terms of timing is, if we're trying to do this before the scoping meeting, would it be possible to have a land use meeting on the second wednesday of December, which I believe is December 9th, which would be before the meeting? There's one scheduled that day, yes, and even with that I guess, my question is: why are we rushing to try to do this before the scoping meeting? It's not as if the scoping meeting has any impact whatsoever on the process moving forward or will be impacted at all by whether or not we as have an initial position as Cv-8 and then from a process. Standpoint I, agree, 100 with Latricia said in terms of essentially we're doing this in the dark with many of the people who showed up to hear this discussion long gone from this meeting and to not have an opportunity to actually have this discussion. I know. I've said this before, but I'll say it again to actually be able to engage with the New York Blood Center representatives in a real, meaningful fashion back and forth, in, as opposed to now doing this without having that chance. I think it would be really inappropriate for us to be taking action at this point. It would just be a horrible precedent to be setting after Craig is Barbara Chocky and then Rebecca, Dengor Valerie. You had your hand up in there. Thank you Valerie's next. She her hand is okay, all right, great Valerie and then okay, you muted yourself again. I think that we listened to a blood center. Talk to us for 40 minutes and insult us. This is a zoning meeting and they did not talk about zoning. They have not communicated with their public institution, which is across the street from them and I think we can at least well. You know you want to give them the benefit of the doubt. I think we should at least write a letter saying that if we based on their presentation today, if they were asking us to support their project, we would have to vote no and that their presentation was inadequate for a zoning meeting, and that gave us no. There was nothing I think, maybe I'm hearing, even in the abstentions that, based on what they said to us, there's no reason for us to vote in favor of what they're asking for us to do and I think we should go on record with that, so it can be submitted to the scoping meeting because to me there, as everyone is saying, they're so far ahead in the process, how can they be so far ahead in the process if they come to us with a presentation that is completely lacking in terms of addressing the issues that this committee is supposed to address? They know based on who the architect is what we, our stance, has been on other projects, most notably Lennox Hill, how we feel about this and they went on and on about nothing that was related to zoning. So I think that you know we can go around and whether we'd actually approve the project for Eulip purposes. I think we can just go on record now to say: if that's the best you got, we would have voted no and go on record that this project is just there's no reason to even be at the scoping stage, based on what we heard and that the community is against it as presented without even you know, and that we, if we were forced to vote tonight based on what we heard, we would not be in a position to give them a positive vote and we can tell them they can come back and address zoning questions as their primary presentation. That's what I would be in favor of Valerie. They were told only to present on zoning and I. Let it go on too long because I kept waiting, but they knew what we wanted tonight. We're not the Health Committee Barbara Chucky, then Rebecca Dangor. Yes, I'm going to be I'm going to be. I'm going to be brief, because it's late and we have another item, I support the resolution. I think we should take every opportunity. We can to say how outrageous that proposal was because of the zoning we're only talking about zoning I think the resolution was very simple and we should take every opportunity we can to talk about the how outrageous the zoning is, and the other issue is. This doesn't belong in land use, it's a zoning item and then it should go to a full board. I, don't know why we're talking about land use but I think we should. The resolution is very simple: we found the zoning outrageous hi I am in favor of a letter and even if it goes into, if it becomes a resolution, I just want to make sure that two points are addressed directly, one that we were blindsided, but even more so that I did feel the presentation was in bad faith and I think those two are extremely important to just make sure no matter what happens. I want to ensure that both of those facts are clearly stated in whichever direction we take, because it was in very bad faith. Thanks Elaine, you have your hand up next like to move. The agenda can I just say something. I'm sorry I'll be very quick items. I know, I think we should include in the letter how many people are in favor of the letter, and it seems to me that it's a unanimous support of the Le of a letter tonight not a unanimous support of a resolution but of a strongly worded letter opposing the way the blood center has acted, has responded to us during the course of this and asking for more information so that we have a chance to evaluate which is our job, so that it looks as though they didn't do their job, but that we are working very hard to do ours in a reasonable in a transparent and in a fair manner, but they are not giving us the tools to do it so that, and if we have everyone here who supports that, then I think it has again a lot more strength than having a resolution where people who might otherwise be opposed to it or who are very uncomfortable. Abstaining are abstaining. So having said that, I'm done again. Thank you. I would include a report of the position of the community because I think, yes, that that is whoever is the recipient of this letter. I think that strengthens their two arguments, one we need more information, but the other is that the community is extraordinarily concerned and opposed I will Elizabeth I'll include all of that. Okay, Michelle I, moved I had made a motion. Let me well there's a resolution on the floor. Let me just make this comment: okay, I'm not in favor of the letter! I, don't think it's strong enough! I want to just make this last comment, and then I'm done. You know you all do what you want, but I don't think it's appropriate to insult the applicant that doesn't give us a strong position. In my opinion to say you haven't been forthcoming. You blindsided us they did everything. They didn't do anything. They presented it in the best light that they could for their position. They came to us. They showed us the plans. They told us which zoning which variances they want us. They wanted I, don't know what they withheld from us. Everybody, including the almost 300 people who were in attendance and asked questions, were able to see through it. They saw through the whole commercial part of it. They saw through the over development. They saw through the fact that they didn't consult their neighbors. They didn't reach out to Jay wreck I, don't know what the secret was here that you all feel that you were so blindsided that you don't have enough information but to write a letter calling them names and then tell them making a statement that the community is against it when the board, when the committee is not willing to do a resolution to say we are against it, how do you know the community is against it? You didn't take a vote of 200 people, but it seemed they were against it because they made they had commentary. We have the ability to take a vote. There is a resolution on the floor to me it is short and sweet. It says the warehouses are with reference to the zoning as they presented and we're opposed to the project as presented and that's the truth. There isn't even all of the people who have a thousand other questions. They are still the truth of the matter is we are opposed to the project as presented whether or not you want to say, could you make it 20 feet lower? Do you have to have the you know, glass on the outside? Do you have to have a canopy? Do you have to that's all irrelevant? The resolution is we're opposed to the project and the changes in the zoning and we can enumerate it as presented. You want to say where we we'd like to have more information. You can hear all the information you want about everything you want about this project. Is anybody here going to change their mind about the fundamental breach of the zoning when I asked that question before nobody raised their hand so I, don't know why we're dancing, we're willing to say the community's against it? We're willing to make all kinds of statements to me. It's not appropriate in a letter to bad mouth the applicant. If you have a statement and you're opposed to it, then pass a resolution that you're opposed to it. I, don't I think we're making this way more complicated than it is, and then you have an opportunity to explain this to the full board tomorrow that, yes, many of us felt that there were more questions. And yes this and yes, we want to know this. And yes, it's going to come before us at landmark and all kinds of things I mean during the Europe and you could tell them all kinds of things and you can explain, but this resolution was just in opposition to the plan as presented with regard to the zoning I. Don't know why it's complicated I support the resolution. Thank you, Gail Barron. Having listened to the discussion for the past hour, I do not think that although I personally think that the resolution is a good idea, I, don't think it will pass and I believe that if we have a vote- and it's split- that's not going to help our position at all. So if we write the right kind of letter, it doesn't mean that we have to degrade the blood center, but we can make it very clear that there are concerns and the first sentence really speaks to the outpouring of concern by the community and even in a straw vote how many people were opposed to the proposal as presented and I think that it's much better to go with a letter unless we can get unanimous support from the committee on a resolution. I agree. That's why I'd like to move that we do the letter and then move the agenda, all those in favor of the letter. How do you want us to vote yes or no or oh? She does okay, there are yes votes. It is a plurality. I, don't think it needs to be. It's not like it's a resolution right, so you can just say a letter is approved by acclimation. Thank you for the time. Okay, let's move on Elizabeth great job under old business. We just wanted to update on the 210 height limit. We had been stalled until we could go through a process of bidding for an architect and Gail. Can you pick this up as to the process and where we're at short, to the point? You're you can't yeah. Can you hear me yeah? No, yes, okay, the beginning of October community Board 8 issued a request for a proposal for an architect to continue work on our bait, going into phase two from phase one on special districts with the 210 height limit, affordable housing, along with preserving the tenements and supporting small business. The proposal was put together by Elaine, Elizabeth Oleda will, and myself and I want to particularly thank Adele in the borough president's office, who gave us a lot of help. We it was sent out to over 35 individuals and firms. We actually got one response and it was from Tuck Edelstein who had done phase one of the project we interviewed tuck and his answers were very thorough. They were extremely thoughtful. We know that he did a good job on the first phase. All of us who interviewed Elaine, Elita, Elizabeth and myself were very pleased with him. We have now put together a draft of the contract, it is, will is putting in the boilerplate plate language from the city, and it will be sent to the borough president's office to Adele for review and then go to the comptroller's office for actually the final sign off and what we're looking for is approval, since the contract amount is 25,000, we'll need approval from the full board, and so we'd like to begin with approval from the zoning and Development Committee. Are there any questions? Marco has his hand up yes, Marco I would like to propose a motion to approve somebody. Valerie is seconding it with a wave I assume, that's what that is. Valerie, yes, it is seconded. Can we take a vote? Will? Can you call the question? Call the question right all right, and that was one of you calling in one of you seconding it. Yes, so perfect. So just raise your hand if you're voting, no abstaining or not voting for cause on this and then I'll read out the names of the board. Members in attendance, Elizabeth rose, I mean meet you in a second I just want to give everybody else a chance again, raise your hand if you're voting, no, not voting for cause or abstaining Elizabeth rose. How would you like to vote abstaining? I'm really have no background on and was not part of the discussions leading up to this so I think it's I would just abstain because I'm just not knowledgeable. Thank you. Is there anyone else, Rebecca Lamorte abstain. Thank you. One last call anyone else. Michelle you're waving your hand. Are you abstaining? I'm not abstaining, I. Just wonder if Gail could give us a little I, don't know I'm in favor of this but I. Just wonder if you can give us a little like summary of what this person will do what's the process. What are we expecting? A report, in other words, give us a little overview. Sure the pre-applications for the 210 height limit and the special districts have been presented to city planning. They came back with a lot of questions, so the first task will be to expand the response to the component features and make sure that everything that city planning field should be included is then there'll be inter-divisional meetings with city planning and others to be able to revise and then finalize the actual pre-application submittals, so that we can move forward. The project scope will be finalized and that finalized project scope will be used for outreach meetings with the stakeholders, which include community advocates, community residents, and you know elected officials and all leading to the advancement of the final project and also guidance toward EIS and toward Euler. So this professional that you're hiring is going to take us through that process up until a decision is made or is there another? No, because you know another phase after this there'll be another phase after this, which will certainly be the EIS and the Eu Larpinal. What we want to be able to do is have the final scope done in such a way that city, the real bottom line, is getting city planning to buy into this and decide that they're on board. With what we want and that's what he's going to do, he'll be presenting okay, so we'll consider that phase two we'll also get quarterly reports from him and will report to the board. So everyone knows what the progress is or where there are glitches or problems. Do you know how long his phase this phase will take? Probably a year or hopefully it can be done in less than that, but the contract timing is for one year. Okay, thank you, you're welcome, and it is the architect who's. The planner who's been working on it all along. So this is not introducing someone new, so Russell Squire and Barry Schneider and Craig later to explain their votes Russell. So this is actually a point of information. I apologize if I missed it, but do we know how much the architect is going to cost or how much we're going to be spending on it. Is this coming out of Cba's budget? That's what I'm curious about. Some of it is discretionary money from the council members which is specifically for these types of projects. Some of it will be coming from our budget. The total contract amount is 25,000 and there's 15,000, plus that is coming from City Council funds, okay, so the 10,000 is coming from our event. Okay, are you explaining your vote or no? That was my. That was a question. Okay, I just want to make sure I didn't want it yeah sure Barry Schneider Correct, later Barry, those for you yep abstain. Thank you, abstain, okay and then Craig later yeah I just had a question. Is he an architect or a planner? He's an architect, a licensed architect, all right, I'd like to obtain that who does city? Who does planning no I understand that, but if I would prefer to have someone who is a certified planner who, rather than an architect and address these major planning considerations, so I'm going to have seen well, yes, and just in way a background, he has done a lot of planning projects. So, okay, that's fine! Thank you and then Felice last person with their hand up police Farber, just some mute all right. Sorry I was going to abstain as well. Okay, all right, and so just so. It's right into the record, who all was here still during the vote: it's Elaine Elizabeth Gail, Alida, Anthony, Barbara, Chalky, Barry, Schneider, Craig, later Elizabeth Rose, Felice, Farber, Marco, Tamayo, Michelle, Rebecca, Dengor, Rebecca, Lamorte, Rita, Popper, Russell, Squire, Sherry, Weiner, Trisha, Shimomura and Valerie Mason. Okay, thank you of course, moving the agenda. The final thing is under new business. We wanted to alert you that we have been asked and the borough president's office has asked for comment that community board. One is now dealing with an issue on governor's island where they want to take 33 acres and make it an environmental, some structure and dormitories. We have no other information. We've requested the board one's resolution on this and further information, but this is a really major concern for them and it probably is for our whole city. I have asked to get the agreement between the feds and the city as to what could governors island be used for my recollection was no housing could be spent done there. So we need to see what's going on when we know something we will definitely be sharing it and I. Think Elizabeth. Does that conclude tonight's meeting I think that we've done our job tonight and I apologize? Will I thought we'd be finished sooner? Okay, it's okay! We're all! Would someone like to move to adjourn second Rebecca, all in favor I was just going to make that motion. I. Think adjourning is a very popular move good night! Oh! Thank you thanks for coming. Thank you see you tomorrow.",
            "summary": "All, you, millions of people to the zoning and Development committee meeting for November for community board, eight.\nI'm going to run through some slides that talk about the blood center and some of our accomplishments and some of the things that have happened during Covid-19, as well as the plan for a new building on our site, which is why we're here and we have a number of people from our team and as well as some of the experts in zoning and the architects to help me present.\nI'm, Councilmember, Ben, Kaylos and I will have a vote on this project as it goes through the Euler process, I, from what I've seen so far, I have a concern, some concerns about what we'll see tonight and particularly its impact on St Catherine's, park.\nNow, all right next I'll just say next: slide, not a problem at all next slide, so you know we're a not-for-profit community-based blood center serving originally Manhattan in 1960 and then all the way into the boroughs and then the tri-state area.\nDriven not-for-profit and this whole project is really a public private partnership, and you know we have in the red circle innovating new treatments, taking care of people in the right making new products and impacting global health, and in fact we serve almost every state in the United States, with blood or research projects or specialty laboratories.\nThe first stem cell product ever licensed by the FDA, you think, would come from some fancy university like Harvard, but it came from New York, Blood Center, so we're very proud of the accomplishments.\nEvery day, New York, Blood Center collects about 4,000 units of blood, serves about 75 million people, advances research, but in addition many people don't know that we support several growth.\nWe need to replace and modernize our facilities, which is why we're coming to explain and to ask for your input and to explain the project and to show you we do translate basis basic science discovery into new cures.\nThe concept here, is that we put even more r d, more blood collection and more companies into this new building, and it would attract, allow us to attract a critical mass of talent and really help promote New York as a destination for the life sciences, industry and cultivating scientific collaboration with our community and fuel jobs, create jobs, fuel growth, create jobs, and so this bottom set of arrows is really what we do.\nNext slide, and this slide was put into not only to show as I think everyone in the and the community board knows exactly where we are, but it would Jay rack.\nSome of my relationships at Rockefeller are older than that, even though I've only been here 11 and a half years next slide, the the folks, our partners were so moved, essentially by us, trying to build a facility that would have more interaction, time and more research for them that we got a number of people reaching out to us saying you know we really want you to be where you are and be able to grow.\nYou know most of the positions we have in on the blood side, as well as many positions on the research side require only a high school degree and we've been working with a number of different degree, granting programs, universities and colleges to try and ensure we have a diverse and team-oriented workforce development project and program which we're very happy.\nA lot of people were clear that you know this notion of creating jobs and economy in the local area doesn't always directly create those things for the community, but we are very strong community citizens and couldn't have a bigger heart for the whole of our community, as well as our borough, as well as our city.\nI had asked that we really focus on the zoning and what ha you think you need to do what you've said.\nBuildings are typically planned on a module, 11-foot module which allows for the right spacing around equipment and people, and also allows for flexibility as labs change over time, and then the laboratory space itself is often divided into this.\nOkay, I'm, often Peter Shubert, here in Ed. We wanted to talk about the basic volume of the building and really its height in relationship to the surrounding neighborhood.\nAnd I think it will be a very much a building that will be much more approachable and something that really makes science a part of the community.\nThe proposal is to move the 2 8 boundary north one block to 67th street the effect of making the non-conforming theaters on the western side of Second Avenue, conforming use and to remap the blood center into a 270 school district, which permits both institutional and commercial medical labs at higher FAR than are permitted.\nCenters, and the proposed amendment would allow the city Planning Commission a special permit to authorize site-specific actions needed for the proposal, and that is a flexible mix of institutional and commercial uses where the permitted residence commercial area would exceed 2far.\nI want to say, I appreciate the blood center, the work they've done and when Mr Hiller was talking about the intersection of those four things.\nSecond Avenue is off in a parking lot all the way, as everyone probably on this call knows to to the 59Th street bridge.\nThis humongous tower on a in a mid block where you have talk about traffic, you've got school buses and it's a street with a bus lane to try and put 20 an office building of this magnitude in in this neighborhood.\nIf they does grow to the size that they want it to just the numbers of cars and people coming up and down, 67th street will be really difficult to move up and down bringing in kids from all over the city.\nI would like to remind people if they want to ask questions that they raise their hand and as we move forward, because the clock is ticking, I'm going to ask.\nYes, I'm, a long-term resident of the neighborhood and quite live close by to the blood center, which I think very highly of, and does a great job.\nIn order to do that is an unfairing position on the community and changes the basic community facility, nature of the use to a commercial office building which is going to draw in large numbers of workers daily in an already congested location and make the living environment significantly.\nSo if you, if I bring more traffic onto 66th street you're, going to back all the way down the block to where my client's building is located and further so that there'll be no access or emergency access, as Mr Bell indicated also you've done, I saw the shadow survey.\nWant to thank the blood center for the concerns they've expressed about the impact on the park over the years.\nWhat's your question or concern good evening and thank you, Dr Schuler members of the blood center for your important achievements in advancing the science as we are at the cusp of great change.\nWe can not right now accommodate everybody whose hands have been raised, I'm, going to ask that if you have questions or concerns or want to voice your support or your opposition, that you email the board office and that is at info.\nTheir proposal doubled the existing floor area on the overall site, including the residential tower, and that it featured two buildings in excess of 500 feet, tall, the residential tower at park in 76, and the Lexington Avenue tower, which occupied the entire Lexington avenue block front between 76 and 77.\nThis chart basically talks about the zoning issues and compares the current revised proposal from Northwell Lennox Hill, with the existing building, which is on the top.\nThe existing far floor area ratio of the project is 7.5 and the building is 200 feet, high, as it says in the upper right, hand, corner of the slide and the proposed building is, as I said, 436 feet high and the far is 12.5, and so two things to note.\nThese are the buildings in the neighborhood right now that are over 210 feet high, and this next view, which is I, think important, is a very crude model, showing you what the 436 foot high building on Lexington looks like above the 210 foot plane and one of the things to notice.\nThe Uniform land use review process and will be will have to present its proposal to the community board, and does anyone have a question.\nYou know years ago, this community board, along with three brand new organizations, formed because of our concern about the growing density of our community and the friends of the Upper East side was represented at a meeting of the city planning and that was Helena.\nWe were trying to think about what we could do in advance to protect our neighborhood and our residential area, and we understood having that with this wonderful person from city planning.\nWe are being approached into these two proposals with undoing that I think that we owe the groups all of us who worked so hard looking in advance to try to protect the livability of our area.\nCertainly the blood center has been a very important part of our area, they've, always lent their time to the community.\nYou know one day: I'd like to have a talk with some of the health people in terms of their talking about the effect on our health, residents, health in dense and overbuilt buildings and communities.\nAlso, a health problem, but I think that the other people who spoke, who said that they appreciated the blood center, wanted to see it develop in a sense that they need to have more space and to do something better with it, but certainly not to have a building put in mid-block with that with all of that.\nI am just sorry that all the work, the community board and the different organizations that all work together to protect our mid-block zoning now looks in like it may not happen.\nYou know position of this firm and the fact that they've done one for the blood center which, by the way, I find very damning that the park is actually obscured in shadow for several hours in the afternoon, which is when the children get out of school and go to play.\nNo and I would actually go so far as to say that of the 25 people who voted, yes, I would venture to say they are probably mostly the blood center and the hired consultants who are appearing for them.\nYou know I feel like there is some level to project whether it's the architects or the developers in the area have perhaps been emboldened to pursue these types of plans at the Lenox Hill site and in other areas like the New York Blood Center in part, because our electeds are not making our positions.\nYeah go ahead, Anthony okay, effectively, rather than the initial proposal tore down everything on the site or more or less tore down everything on the block and built new hospital buildings, with the exception of a hundred by hundred foot lot at 76th and park, having removed that and removed that income stream from the project, northwell is now building just a brand new tower on Lexington that is more or less 180 feet square and 436.\nSo I asked the proposal to the blood center to please keep that in mind and do what you can to mitigate and to listen to the comments tonight and in the December meeting.\nI have one question: Anthony did a fabulous job, everybody who comes, they only want to build larger.\nYou make a very good point that the need the anticipated need, certainly of this community for additional hospital space, seems dubious at best, and the problem is that this building, if it's built as currently proposed, will be with us for the rest of our grandchildren's lives, and there is nothing scarier than a bad building that is going to be there long after everyone.\nI think the community would be completely supportive, but instead we have a very self-serving proposal to massively build up on a speculative level to completely obliterate.\nObviously, the slides went by really quickly, but knowing the size of the blood center lot I believe their proposed building is even larger in terms of the cube.\nThat is a huge loss to the community, and so you know, since this board, has come out and voted against the proposal that Lennox Hill made I hope that this board will act very similarly and vote against the proposal of the blood.\nDon't mind, since the board doesn't have the benefit of being able to ask questions to the blood center itself and their representatives that there be a way for the members of the board to send questions to will who will or Elizabeth or Elaine who will then be able to submit them for the to the blood center for answers which will be posted on the website that we then I know the public was invited to do.\nThis applicant is requesting to change the mid block, contextual, unique district character, Rab, whose maximum building height is 75 feet, which provides light human skill and a sense of residential community, as it were a simple piece of paper throw to the garage as well as they are requesting to wave several zoning resolutions.\nI think it was very disingenuous for the blood center to come forward and talk about how Covid-19 makes this life science center all the more needed.\nYou know to say that they have life, science, partners, they're, hoping to rent floors in a building, and we are right now in a situation in New, York City, and we can walk around everywhere and see empty storefronts.\n79th and 80th I live across the street from six buildings that were emptied out on the corner of 72nd and 2Nd. I mean there are plenty of open spaces, as Michelle said that we don't even know, what's going to happen to them, for us to support a re-zoning so that the blood center can let space to who knows who, because when it becomes available, who knows.\nIt was also disingenuous, that we didn't see any financial information related to the blood center tonight, and we don't know where the money for this project is going to come.\nI think we should a member of the public who has something would please send their question to the board and Board office info at Commun, cbadam.com.\nI also think it's important that this presentation of the blood center be made to the entirety of cv8 at a land use meeting.\nI would like to have them present to our committee to discuss transportation impacts, as they may not be as clear-cut as everyone thinks they are in terms of the modal splits and how people may arrive and being able to work with them to ensure that any deliveries take place during off hours and have a minimal impact on traffic congestion and air quality and quality of life.\nRegarding both Lenox Hill and the blood center I think we need to project more of a sense of collaborative spirit and understand that the world changes and we need to be open to changes in order to allow institutions to flourish, even if it means there's a component that is for profit that allows for their critical life-saving missions in these cases to flourish.\nI fear as a board and as a committee here, we're projecting a visceral intolerance as a community for development and zoning changes and expansion.\nSo, I, guess I'm, not just saying the current plans for Lennox Hill are acceptable yet, but as an example, but I want to at least give them a little credit for curtailing the most egregious elements of their proposal like the residential tower and that we could hopefully work with them and find ways to be able to get something that we as a community can be accepting of.\nAnd, while the blood center project isn't perfect, rejecting out of hand because they are seeking a zoning change on a mid-block.\nSo, I say: Let's work to propose improve the proposal, address shadow impacts and see if we can be part of the planning that could benefit both the blood center and community and finally, I just want to respond in general to the broader discussion we've had tonight regarding zoning.\nVariances are routinely granted across New York city for projects that are arguably much less critical to the economic vitality of a city or community, and I like to remind everyone that the zoning resolution is a living and dynamic document.\nI. Ask that people submit their questions because I think the blood center had left and Northwell has been invited to this.\nThe blood center has not been very forthcoming with its materials, but by all means you, as co-chair of transportation, should certainly invite them and any other entity that you feel deserves to have comments and questions from the board and the public and with inquiries that you would like to make absolutely with respect to Northwell.\nCertain things are desirable to have in communities, but when you think about the bulk of these buildings and the impact on the quality of life in the residential community that surrounds them, it's not as simple.\nOkay, a leader I, just wanted to say, Lenox Northwell, had promised that after the task force meeting, they would come to the community board in the committee they refused to come.\nI. You know how long it's taken us, the blood center ambushed us by not coming to us and the fact that they're as far along as they are in their application, with not considering coming to the community board, is a disrespect, and so I wanted to say why I held out the board speaking about the blood center as I was hoping.\nMany committee members have said so I'll stop here and thank you because they were asked only to present on zoning.\nThink if an institution pro proposes something that is extremely damaging to the community by definition, because it's so far out of the law, if I were an institution, I, would stop talking about zoning, because that's where I lose.\nI was really surprised that the blood center had not engaged with J wreck, and it was a little painful for me to hear that J wreck had to go through a public comment session at a community board meeting to get a hold of them and to express and to first view, their presentation.\nWe think how the I think the most effective thing that has been done this evening is that I'm sure that there's somebody from the Lenox Hill hospital listening in on this, and certainly the blood center, is aware.\nWe go to Sherry Weiner, yes, hi I want to concur with what Elizabeth said, I think.\nYou want a zoning and development to pass a resolution tonight or what is your thoughts.\nSo I, don't know what Elaine thinks about this, whether you prefer a letter and to whom or a resolution.\nI also think that we're in a time crunch, because if we do the resolution tonight, it really should go to the full board tomorrow, night.\nThey somebody wants to propose a resolution on the blood center.\nPerhaps you need to take a consensus of the board members on the call and see what direction we want the letter to be in.\nI think we need to know, okay, how the board members feel so your letter.\nSo, yes, means you want your letter to support the blood center and no means you're.\nYou take some input from me that what we're looking at now is not any programming, but the zoning issues related to the site that the blood center wants to redevelop.\nOkay, no, because they're in they're having a scoping, session, December, 15th, so they're much further ahead in the process than Northwell, because after the scoping center excuse me session, they will be responding and doing the Eas. For it's clear to all the board members I know, some of them are pretty new to the process.\nI think we're trying to combine a letter saying that we're opposed to the project.\nThank you for very dynamic and robust discussion, I'm in favor of a letter, but does not state that board is opposed, because this item actually belongs in the zone in the land use committee where the full boards are engaged and I would then probably encourage a letter to say we have concerns regarding the presentation.\nWe need to let the public know when that is going to be, because I think you know the biggest question that I have heard from members of the public over the past week.\nAfter, this very full presentation and with respect to the attendance that was here tonight as Elizabeth rose, said, I, think we have to come up with something stronger than a letter.\nI. Don't think we can say that we disapprove of it, but we can certainly say in a letter that we are in opposition to the plans as presented and to me if you say that we would invite them back to a land use meeting and then have another presentation.\nThat's what I would suggest and I think it could be worded in a way that the board's not taking a position, but our concerns are clear and I'm happy to write that, if that's acceptable to Elizabeth Inouye.\nHaving addressed the concerns that the community and the board members have raised so I think that would be the ideal situation.\nBut I- think the priority in terms of the the letter and kind of what we're doing now should be to try and get them essentially to engage with us in a constructive way that actually addresses the various things that folks have said.\nThe purpose of this that we don't like not that we don't like, but that we are questioning the usage of R8B, the zoning for R8B for how they plan to use it, so that that's what we want to have explained as to why they need this, and.\nI have a million questions about the project, but my questions are not going to address the fact that this is like a 30-story building on a side, street.\nI think as Elaine or Elizabeth pointed out that our resolutions are not always taken very seriously by the city and that's a bit of an understatement.\nSince we have people in support, since it seems that everyone is in support of the letter, I think it would be more effective than having a split vote on a resolution and enough people have said that they are concerned about a resolution at this point that they don't know enough, and even if there is a failure to comply with the zoning rules as written right now, there are people who have expressed other points of view.\nBut I would also add to the letter that the blood center has not engaged with the community to this point and indicate that we have not had an opportunity to discuss, concerns or hear from them in a fuller manner and and be strong in language, about that.\nBy the time we get to the full board, voting on Euler people ought to have seriously considered what they're doing, but just my opinion, I think.\nIf the committee passes it, it's something that's going to go to the full board, and you know, as others have pointed out.\nWe should have a resolution formally saying that the board is going to take a position on this before it even really formally comes before us as a land use.\nThere are enormous concerns or there's widespread concern from the community, and we really want to hear more from the applicant to say you know what they're basically to provide the additional information that we're looking for and also again, hopefully to address the concerns.\nI, don't think a split vote would really help, but maybe there's a kind of a resolution saying something like we've been blindsided and the blood center has not presented any information sufficiently to the community board and we want.\nThere are people who have very thoughtful responses who are willing to abstain rather than vote in favor of a resolution opposing it, and that doesn't put the board in a great position.\nMaybe there is some language that we could use in a resolution that is more I, don't know if it would be more emphatic than a letter and again I'm just thinking.\nSo I think since I initially proposed the resolution, I'm willing certainly willing to modify it because my intent is for whoever testifies on behalf of community board 8 at the scoping meeting, and there clearly is an opportunity.\nI think we should at least write a letter saying that if we based on their presentation today, if they were asking us to support their project, we would have to vote no and that their presentation was inadequate for a zoning meeting, and that gave us no.\nI think we can just go on record now to say: If that's the best you got, we would have voted no and go on record that this project is just there's no reason to even be at the scoping stage, based on what we heard and that the community is against it.\nI think the resolution was very simple and we should take every opportunity we can to talk about the how outrageous the zoning is, and the other issue is.\nI am in favor of a letter and even if it goes into, if it becomes a resolution, I just want to make sure that two points are addressed, directly, one that we were blindsided, but even more so that I did feel the presentation was in bad faith.\nI, know, I think we should include in the letter how many people are in favor of the letter, and it seems to me that it's a unanimous support of the Le of a letter tonight not a unanimous support of a resolution but of a strongly worded letter opposing the way the blood center has.\nI would include a report of the position of the community because I think, yes, that that is whoever is the recipient of this letter.\nYou know you all do what you want, but I, don't think it's appropriate to insult the applicant that doesn't give us a strong, position.\nWhen the board, when the committee is not willing to do a resolution to say we are against it, how do you know the community is against it.\nThe resolution is we're opposed to the project and the changes in the zoning.\nSo, if we write the right kind of letter, it doesn't mean that we have to degrade the blood center, but we can make it very clear that there are concerns and.\nFirst sentence really speaks to the outpouring of concern by the community and even in a straw vote how many people were opposed to the proposal as presented.\nAnd I think that it's much better to go with a letter unless we can get unanimous support from the committee on a resolution.\nNo, yes, okay, the beginning of October community Board 8, issued a request for a proposal for an architect to continue work on our bait, going into phase two from phase one on special districts with the 210 height limit, affordable housing, along with preserving the tenements and supporting small business."
        }
    }
}