{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "title": "Z&D Committee Meeting",
            "publishDate": "2020-12-09",
            "shortDescription": "",
            "lengthSeconds": "2:15:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "C86ar3E1blc",
            "fillerWordCount": {
                "uh": 265,
                "um": 176
            },
            "readTimeFullTranscript": "76 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "building": 86,
                "street": 77,
                "blood": 72,
                "zoning": 65,
                "center": 45,
                "park": 34,
                "project": 32,
                "neighborhood": 32,
                "tower": 26,
                "buildings": 26
            },
            "wordCountSummary": {
                "street": 22,
                "blood": 20,
                "zoning": 19,
                "center": 17,
                "building": 16,
                "block": 9,
                "buildings": 8,
                "traffic": 7,
                "space": 6,
                "day": 6
            },
            "fullTranscript": "Max, if you could find Elizabeth and Elaine and I mute them sure I am looking for them. They just disappeared: okay, I just unmuted Elizabeth and I'm looking for Elaine, oh I, just muted, her as well. Okay! Welcome to everybody! Thank you for attending the December zoning and Development Committee meeting. Our only subject is the proposal by the blood center and we will have presentations by members of the community and their representatives so that before we start the discussion, every one of us will be informed about what we're talking about, and the first person to speak is a gentleman called Marty Bell, who I hope is here before Marty gets going. I see our council member is here already, and you want to give him a couple seconds. Oh yes, as the councilman is here, we will start with him. Councilmember Ben Kalos will be the first speaker and then we'll go to Mr. Bell I want to thank Co-Chair, Elizabeth, Ashby and Elaine Walsh for your leadership on this I want to thank you for holding a second hearing just dedicated to the blood center. I know that you invited them and I am disappointed that they chose not to come back again, but I am grateful that we will be hearing from friends of your side, historic district and George James, who is somebody I always rely on I, also just want to say that, as your council, member I will have a vote on this project as it goes through Euler process and from what I've seen so far. I have concerns about the shadow study and the impact on St Catharines Park that you saw from the blood center in November. That is part of the reason that we've sent it out by email to folks in our December newsletter. With an additional reminder. When we found out about this meeting tonight, it will be up to you and the community board to make your voices heard at this step in the process, with your support or opposition or with improvements with discretionary approval. I'm here to listen and would like to hear from you. I can also come to do a virtual bend in your building and speak with your building about this project. You're interested in event, you're, building or letting me know what you think of this project. Please email me at Bklos, benkaylos.com Abby from my office is going to stick around I will also watch the recording I'm going to ask to be excused this evening. This is incredibly important, but this is my seven year wedding anniversary and I wish to stay married. So thank you for having me well, thank you for coming. Thank you, Ben. Okay. We will now go to Marty. Bell who's presenting a community presentation will could I. Please have screen sharing and I had explained to Elaine, yes, yeah you can thank, you can do it now. Okay, thank you very much. Thank you very much before we look at the damage this building will do to our neighborhood and why it must be rejected. We need first to call it out for what it is, which is a commercial real estate project pure and simple. The blood center needs a new building, but rather than raise money for that, they've apparently sold their soul to a Boston developer long fellow real estate, partners, LLC and in the process they showed they don't give a rat's ass about this neighborhood. You wouldn't know it, though, from the show they gave this committee three weeks ago, but the papers they filed with the city show clearly 100 percent. The blood center does not need this tower that they are proposing. Their city filings show that they can build of right within the zoning. A new building that will give them actually more space than they say, they're going to need, take in the Longfellow Tower, and also the new building which they could build within zoning would allow them to get almost triple the number of employees they currently have. If you look at their filing, it says the applicant according to the applicant, their operations, visitation and employment would not change. Let me repeat that would not change between no action what they could build in accordance with the current zoning and the proposed project and the proposed project just to make sure everyone understands it isn't some slight variation of variance in zoning. It's not 10 or 20 or 50. It's not even a hundred percent more than the current zoning or 200 percent or triple or even quadruple. What they're asking for is for approximately 450 percent. More than this site is zoned, for this project would do tremendous irrevocable damage to our neighborhood. We can not allow that to happen. The blood center long fellow presentation was misleading and deceitful. They called companies that were would occupy the tower partners. The correct word for someone paying monthly rent to a landlord is tenant. They said they were going to talk about volume and height of the proposed building. They were deceitful about height and they were silent on volume. I would like to correct that now to justify this mid block tower. They compared it to 20 buildings in the neighborhood, which you see on the slide on the screen. All of those buildings. All 20 were long avenues, and this committee knows better than anyone the difference between and the reasons for, the difference between mid-block zoning and zoning on the avenues. Looking as they did at buildings. Only along the avenues. They said that their proposed building is at the lower end of the lower range of a lower range of heights. If they were honest which would have been nice and they looked at mid-block buildings, they would have seen that this proposed tower is about as out of place as a cat and a dog park. But let's play their game. Let's look at the lowest of the 20 buildings. They highlighted 254 East 68th street, conveniently across the street from Julia Richmond. Just like the blood center, though it's across an avenue, not a small side street. It's 310 feet tall set back from second avenue with plazas on both sides. In other words, it's about 25 feet short shorter than the blood tower, unlike the building across the street that they highlight states that they're going to cover the entire lot from 67 to 60. Six, all the way up to the sidewalk where they are now. No setback, I think for 85 feet and then only a minor setback. The building across the street is 75 by 131 feet and I have to thank my wife. She went out with a tape measure with me this morning and we measured it. People looked at us like we were crazy, measuring a building the blood tower. Let's call it a blood tower is 225 by 200, which means you could put three buildings. 75 actually goes into 225 evenly. You could put three of those buildings across the street on the site. That's what it would be, but actually those buildings as I said, are only 131 feet. Deep. The blood tower is going to occupy the full lot. So that's what we're talking about, but it's not it's worse than that building is across second avenue, with a big setback. The blood tower is across 67th street, so it's hovering over the park and over Julia Richmond looking south from Julia Richmond. The blood tower would just dominate everything in the area. It's a mid-block monstrosity as I was looking for. Comparables I noticed the 59th street bridge is within a couple of feet of what this building is. If you could imagine putting the 59th street mid block in a residential neighborhood, you'll know how just preposterous and crazy this project is, but it's not just the height and width of this building. It's also the number of people going mid block every day. This is a slide from the blood Center Longfellow presentation. They say they're, two thousand six hundred thirty people full-time employees every day which is twenty 2400 more than they current have and almost 2,000 more than the blood center could occupy if they built a building within the zoning. Just so you know how much that is, it's approximately the same size as Philharmonic Hall at Lincoln, Center I had to go back. That's Leonard Bernstein conducting because I wanted to make sure I had a photo with every seat filled. So that's about what you have just the workers, not people visiting, not deliveries going every day. If you want to take out what's already there, it's probably the top tier, but the rest of it is all new people going mid block. Every day, if you want another way to compare it, the three closest buildings they talk about in their presentation, all along avenues are 770 units in three apartment buildings, 129 stories, which would be the tallest residential building in the city summer, studios summer, one bedrooms a few two and three bedrooms assume there are three people in each apartment: that's just 2300 people in the three residential towers and you've got more than that going to this building mid block every day. So it's so what you have is this massive 334 foot commercial tower with 2630 people going every day to work there, plus visitors plus delivery? What are the consequences? You have shadows and crowding at St Catherine's park, you've got shadows over the school. You've got a horrible, a complication, an adverse effect on traffic, similarly significant adverse effect on buses and subways and, most importantly, it will forever adversely affect the quality of life of this entire neighborhood St Catharines Park. For those who don't know it, but I suspect everyone on this hall does is the only park between the river and central park, north of the bridge and south of John Jay. According to the city department of planning, this space is already considered undeserved by open Un underserved by open space, meaning the park is crowded. I'm told that St Catharines is the second most used park in the city based on size, so adding somewhere between 2,000 and 2,400 people across the street every day, going in for a lunch or take some fresh air is just insanity. The when Longfellow in the blood center made their presentation. They did a shadow analysis. It shows for most of the summer between 1:15 and 5:15 it. This park is in shadow. We in my family. We call that the whole freaking afternoon but as I understand it sequa looks when they do shadow analysis at the effect on plants and when we heard the lawyer for blood Center talk, he was talking about. Oh, we don't have to worry. There's enough sunlight. He held up a piece of paper enough sunlight from some experts saying the plants won't be affected by all the shadow it isn't about the plants. This is about the people using that park for crying out loud, and then he starts talking about mitigation for the loss of sunlight. There is no mitigation for the loss of sunlight. This is just insanity, but it's not just the shadow on the park. No one's talked about the shadow on the school. This building is directly across. You saw how big it will be. It's across the street, not across an avenue with no setback. J-Rec will be in shadow all day. I'm not an educator, but I spent about 10 minutes. Doing a google search first thing: I found an article in the Washington Post students, with most daylight in their classrooms, progressed 20 faster on math tests, 26 percent faster on reading. Yes, we so we need also to consider the shadow on the school as council member Kayla's, as well as on the park, but my daughter is in high school now and I. Take my granddaughter to the park to me. What's more, even more. Concerning is the effect this building will have on traffic it's between 66 and 67th street, which are probably between second and first, the two busiest side streets already on the Upper East Side 67th street is the only city only street, only Side street, in the city that has an educational, complex with buses and parent drop-offs and a crosstown bus only one in the entire city plus on the next block. There's a fire station where there's often weights as the fire truck has to in these narrow streets, get parked to get backed into the firehouse and a police station and the russian mission, which always has cars Dpl plates double parked beyond that is Hunter College 66th street. It's the same story. It's the entrance to the louder. Breast imaging center is on 66 between second and first plus, all the traffic coming off the 59th street bridge and up first Avenue that wants to go to the west side goes down 66th street, because that's the viaduct, I'm almost finished, give me one more minute. Second avenue is already a parking lot and the city's talking about congestion, pricing, 59th street. It's the same thing plus hospital you, everyone knows how bad this is, there's all traffic. These are pictures. I just went out in random. This here, though, is the best picture. This is part of the blood center's application. They couldn't even find a picture without the street, backed up with buses for their own freaking application. That just blew my mind. Second Avenue. It's already a parking lot. I took this three days four days ago. It was all the way down to the 59th street bridge. What really, though, is unbelievable goal, as my grandmother used to say this guy has balls the application by the city by the blood center. Their draft scope of work says it's only an incremental amount of additional parking, so they do not anticipate a quantified. Traffic analysis is warranted. That is just preposterous. This is such a busy area already just adding five cars. 10 cars 50 cars, and they don't want to do a traffic analysis. Well, it gets worse when they look at subways and buses, they say detailed traffic and traffic analysis is not wanted. Proposed project would not result in any significant adverse traffic event. I guess when they go to Lincoln Center, they must all have limos and chauffeurs my wife and I. We take public transportation when we come out like a standing job. Thank you very much can I have two more minutes. Please, no sorry, you can submit your presentation. Thank you very much and now our next speakers are our pair speak Howard, Schechter and Paul Graziano will present their case now. I hope they're here they are I, just need to find them to unmute them. Howard you'll just have to unmute yourself, I, think I got it did I. You did yes and then I just need to find Paul, okay and then you're unmuted Howard. You want me to start yeah guys, okay! Well, thank you very much for holding this meeting tonight and listening to the neighborhood concerning the remarkably negative effects that this proposal would have on the entire surrounding community. I am appearing as an attorney for the cooperative apartment building at 333 East 66th street, which is at the first day of toward the first Avenue end of 66th street, where the traffic comes and starts going up, the hill toward the site of the blood center, and I'm here to oppose the proposal. I think that there are three key items to focus on in evaluating this. One is the context of the proposed change. Does it fit within the is the proposed building congruent with the neighborhood and the surrounding structures and uses? The second way to look at it is its impact? Will it improve the neighborhood and create benefits that the existing zoning does not and does not permit, and will there be negative effects that would be taken into account? And, finally, the public interest issue? Are there broader benefits to the community and the city at large, from this proposal and I? Think it's probably that last item that the blood center highlighted most highly in their presentation last time, I, think incorrectly and inaccurately and misleadingly, but they are portraying themselves as being a great benefit to the community at large. By enlarging this structure as humongously as they're, proposing to do it without really giving any indication that there's any a change in the way that they're using it in the community that is supposedly being served by this. But let's talk about context for a minute. The primary issue is that the proposed parcel to be rezoned is misleading. The way they've drawn the map they're taking in pieces of second avenue and across second avenue and treating it as though this mid-block location or somehow part of a natural parcel that extends across second avenue. That's simply not the case. This is a mid-block parcel and the proposal is to change that structure mid-block by changing the zoning up and across second avenue. It makes it look as though it fits better with the buildings that are on the avenue that are larger in size and permitted to be larger in size because they're on the avenue, but that's really not the case that they're looking at this development here as a standalone in the mid block location and so that carrying the little area that they want to rezone across second Avenue is misleading. The proposed structure is grossly disproportionate to the surrounding structures, as Mr Bell indicated it's several times the size of what is the maximum permitted structure on the on this location and under the existing zoning and the neighboring properties are a lower rise and it would stand out ridiculously as compared to the surrounding buildings and not blend in any way with them, but they want to not just rezone to increase the size of the permissible building, but also they want a special permit to waive the mitigating setbacks that would reduce the shadows and other negative consequences of building a larger building, provide more light and air on the street. They want to build up to the street level and have just a giant structure at the street level. Again aside from the overall size, they want to compound the negative impact on the immediate vicinity by having a sheer wall that goes up from the street line. I thought it was interesting in the presentation last time that the representatives of the blood center were proposing that this would somehow create an inviting environment for the people walking by on the street. I can't imagine anything that would be less inviting than having sheer walls that go up even if they're, glass and blocking out light and air to the street from people who are walking by so to say that it is out of context. I think is a gross understatement. Let's talk about impact, will it improve the neighborhood and the critical issue? To my mind, will it create benefits that permitted uses do not, as Mr Bell said, the space to be occupied by the blood center in the proposed new tower is no bigger than the space that could be occupied in an as of right structure under the existing zoning? So there's no benefit to that particular use by granting the variances that they are seeking in this circumstance they could rebuild their existing building under the existing zoning, have a building that's more in context with the surrounding neighborhood and end up with the same amount of space to do what they're doing as they're as they've indicated they will be using in the new structure. So what do they say is happening in this new structure that they're going to have partners who are going to work with them in their work, doing research and so forth? Unfortunately, they haven't there's no constraint that would require them to do that. They haven't identified any partner that they would be working with. I haven't said we're working with this particular organization or this particular laboratory, and it would enhance our work if we were able to be in the same location and here's how they present it as a hypothetical that they would create a benefit by doing this when, in fact, they're just going to rent out the space and if they don't get somebody who's who works well with them, they'll get somebody else, who'll pay the rent, or maybe they won't even come back into the space at all. There's nothing that really requires them to come back. They could be renting out all of the space by the time they approve this, so instead of benefiting the community. What's going to happen is that it's going to create great burdens on the community that I think need to be considered and I want to speak for a minute about 66th street, because that's where my client is located. 66Th street at that location is a hill, so that the impact of this structure and the height of this structure is compounded by that grade between first avenue and second Avenue I, don't know exactly what the difference in elevation is between first and second avenue there, but I've walked up that hill and I can tell you that it's definitely a hill, and there is a significant differential between the two ends of that street. It's a narrow street. It is the blood center now gets deliveries to their location and when those deliveries come it ties up. The traffic on 66th street is a major cross street for a number of reasons. It's a transverse across central park, people coming up first Avenue, who are trying to get around the traffic trying to get onto the 59th street. Could you summarize please? Yes, people coming around trying to go up 66th street to get on to that transverse run into that traffic, exacerbating they're going to reduce the number of parking spaces. Some of their deliveries are of nitrogen, liquid nitrogen that are, as far as I'm concerned, dangerous chemicals, and maybe there are other dangerous chemicals if they expand the operation in that location. There are other safety concerns by adding to the traffic that will back up onto first Avenue. There are now bike lanes on first avenue where the bike riders are going to be challenged by additional cars. Coming up that block emergency vehicles will not be able to get up that block if there are trucks that are waiting to get into the loading dock or that are backing into that loading dock and tying up the traffic on 66th street. It's a wrong location for this kind of an application and, finally, the over the also they're reducing the number of parking spaces that they have. Their application indicates that they're going to reduce their on-site parking from 30 cars to it's, either 5 or 6 cars, again adding cars to the community that don't belong there and the last item that I wanted to say. Are there broader benefits to the community at large from this activity and I think the answer is no I. Don't see that there is anything, that's being done that is community-based in this particular facility. There may be some use of the facility for drawing blood from people. Maybe they store it and ship it around from there, but they've become a nationwide organization and they could do this any other location. They could do it at their location in Queens. They apparently will do that for the four years. It's going to take them to do this construction. So thank you very much. Thank you. Now. The next speaker is Paul Graziano, and I'm going to ask speakers not to make the point that a previous speaker is made in order to get everybody heard, including the public on this. So I would ask you to be as concise as you possibly can and not repeat. Other people's points, but thank you very much for being here and now it's Paul Graziano to speak. Thank you very much. Can you hear me? Okay, yes, so I've been retained by 301 e 66th street to as a planner, I'm a planning, land use and zoning consultant and I've taken a look at this I sent my memo to the community board. The co-chair has a copy of it, so I would ask if she could distribute it to the email list of the other members of the Zoning committee, as well as other community board members that would be great I will keep it as concise as possible I. Basically, what I did was based on the documentation that the applicant has submitted along with watching your previous zoning committee meeting from a few weeks ago. I put together something- and there are some of the things have already been mentioned, so I'm going to try to be as brief as possible. I encapsulated it into eight points, very simple points, and I'm only really focusing on the zoning aspects of this. I'm not. There are a lot of other issues here: traffic, environmental, etcetera, I'm not focusing on that, so the first I'll say is the need. The basic need for this proposed building is non-existent by the applicant's own documentation. The current zone essentially allows them for a building as large or larger as of right than what they can build or what they were proposing to build in the new tower. So the discussion of needs oftentimes with zoning or with variances the applicants come forward and say: well, we need this in order to realize our project. Let's be very clear, this is a real estate project. It's a real estate development project. It is not, in my opinion, again having done this for decades as a planner. This is not based on need and in fact I will get to that at point. Five, because something surfaced recently that made this very clear that this isn't from need. So that's the first issue again. This goes into more detail in my memo, but I want to be as brief as possible. The one of the big issues is that this is issue number two. This will create a major precedent now when the Rab zone was adopted in 1985 on the Upper East side, this was done to protect the mid blocks very specifically because what had been happening was developers were buying two or three parcels tearing them down and building a 15 or 20 story building in its place, and this mid block rezoning. This contextual zoning was meant to stop that. There was a lot of discussion about this 90 plus of the parcels that were rezoned. In other words, there was a 90 compliance rate at the time and that's why this rezoning occurred. Someone quoted a large bulky building casts the same shadow, whether it is a community building or a private building and I. Think that that's an excellent quote to put into this. The only things that have occurred in this area is additional blocks were added into the R8B five additional blocks over another 10-year 13-year period there was. There has never been a case where the R8B has been up zoned. In fact, from my initial examination, this has never happened in any of the areas in the entire city, where the rap has been adopted, whether it's the Upper West Side, Murray, Hill, East, Village, etc. This is very important once this. If a precedent is set with this, other developers will use it as justification to pursue similar actions. So this is a very important point number three. This could be described as a spot zone or rezoning for the benefit of a single property. This is generally not defensible. This kind of rezoning is frowned upon not only by the city in general and by electeds and by community boards, but by the courts and, frankly to me, if this were to be adopted, you'd be setting this up for a court challenge immediately. This is clearly being done in order. This was already discussed the changing of the project area from the R8B project area, which was in their initial scope in May of 2019, I'm sorry in August of 2019 to moving it to the avenues and using those buildings as justification, an illusion of context that would describe it an illusion of context to allow them to build a 33-story building on a mid-block. This is clearly being done to justify this grossly oversized building, which will be more than four times the height of the current allowable limit. The next point: there is no guarantee that an applied life sciences hub will actually get built again relating to something Howard said. The only thing that controls a building is the zoning unless it's landmarked or has some other easement or restriction upon it. This zoning, along with the special permits, will be the artificial and imaginary envelope that the building can be built in once this zoning is approved. If the owner decides to flip the property, if the owner can't do, if the developer partner pulls out, it can easily be sold and redeveloped. This new building would allow an far of 7.5 for residential use along with commercial use, so it wouldn't be a life sciences HUD it could be a fully commercial building or it could be a mixed residential commercial building. This is again something I'm going to point to in a second right now, in fact, thank you very much. It's got two more points. I have a few more points and I'll be done. This point is extremely important. In 1984, the New York Blood Bank filed to build a 30-story building at this exact same site. They filed their Eas and EIS documents and it was going to be an expanded blood bank and a 270 unit residential tower. This happened just before the R8B was adopted and I believe. The only reason it didn't happen was because the rap was already in process and they dropped their project. I can't I, don't know that I'm gonna probably have to do a FOIL with the department of City planning to get those documents. So this is not the first time, it's just 35 years later again, that same project could occur if the blood bank doesn't go forward. The next point: the impact on public and shared resources and infrastructure is unacceptable and can not be mitigated, as was already stated just one point here. The blood bank property is 1.03 acres, it is a huge parcel. The park is 1.38 acres. The blood bank is 75 percent the size of Saint Catherine's park. The tower that would be built would be 55 the size of St Catherine's park. That is why the park will be in permanent darkness for much of the day. This is not something that can be mitigated. The next point is design. Improvements can be done without a zoning approval. All of these ideas that they're going to create a better streetscape that can all be done under the existing zoning. The next point- and this is the final point- this building- does not fit into the mid block or the neighborhood some quotes from the last committee meeting. You can see an overview in terms of how we've broken down the scale of the building and how it nestles into the surrounding community I think Mr Bell was making that point. They also mentioned that the building itself was going to have very interesting and Midtown textures and that's the entire point. This is a Midtown office. Building the Upper East side is not the mid. It's not Midtown starts below 59th street. This is 66th and 67th street. There is no reason for this building to be built here without meaning to thank you very much. Excuse me, Mr Breadman said I had one minute left, so I'm just going to tie it up right here. Well, I'm almost done the applicant has stated the truth about this proposal. This building is contextual with other Midtown Manhattan office buildings, including 40-foot tall signage, on their building, which they want with their change in special permits. That's my summary: please read my memo and send it to the rest of the community board members and I'll be here. If anybody has any questions. Thank you very much and I will beg the following speakers. Please to be succinct and not repeat a point that was made by very well by the previous speakers. The next speaker is Anthony Cohn who's, a member of our committee, who has studied this and provided some very appalling drawings. Thank you, Elizabeth I hope it's the content, that's appalling. Okay, absolutely could I have screen control, go ahead, you're, good, okay, great thanks. Now, of course, I have to find out here. Okay, these are and I will be quick. All three speakers, especially Marty and Paul, hit the most important points about the project in its and its nature and personality. But I thought: let's see it's gonna, be sorry. One of the things that I like to do is see. Well, what did the site look like before, and this is the tax photo of the trade school that originally occupied that was built in around 1930 and occupied the site and, in fact, is the building? That's now the New York Blood Center. The view on the upper right is from underneath the second Avenue L showing and I. Don't know if I'll get a bit of a cursor here. This area right here is, in fact the site and then the aerial view, also from 1927 not too clearly shows a whole group of four-story townhouses. This is before the construction of the trade school slash blood center and then a vacant lot behind. These are all the areas I think. The most important point for us is that the existing building is 67 feet tall and the new building will be 334 feet tall and in terms of floor area. I think we've talked about that enough. The pictures these are views using department of City planning's 3d models of every building in New, York city they're a few years old, but it gives you the idea in green. We have the existing structure and the large empty spot here is Saint Catherine's park. This is from the southwest high, above probably 62nd street. The Solo tower is here, and next there is. This is the as of right, building at its maximum size in blue and then one more. This is the proposed blood Center tower. One of the things that happens is that we tend to look at these things from above, as if we're in the Goodyear Blimp or an airplane. This once again, the park is more in the foreground and you have the existing building the as of right building and then the proposed building, and that was that view was from essentially the North East and here's an another. Here's a view from the southeast as if you're high above the 59th street bridge the existing building, which in fact does Nestle in its neighborhood the as of right building, which is slightly larger and then the tower which is much larger. I just like to flip back and forth between just to give you an idea, and then this is a more close-up view from the northeast. That again gives you a sense of the change in scale that would occur if this project were completed, but because we normally look at things from up high. Sometimes it's nice to see what the effect would be at street level. So this is from across first avenue, looking kind of diagonally across St Catharines Park, there's the existing building. There is the as of right, building and then adjusted for height. There is the blood center building, and that begins to give you an idea, but I a couple of weeks ago, I walked 66th street and realized that the effect from here is even more horrifying. Frankly, this is the view from 66th street back a ways on the block back off toward the west from second Avenue. This is second avenue. Building here kind of the solo building is the, in this view, gray, mass to the left and as of right and then the tower. One of the things you see immediately is that and if you stand on the corner, either corner of a second or west side of Second, Avenue and 66 or 67th street, the new tower is twice the size of the very large white brick building sits on 2nd Avenue and again just for just all together comparison purposes. There's the existing building in green as of bright and blue and in red, the blood center tower and I. Think and that's those are the last of the pictures and I think it's important, especially for those who are not frequenters of the zoning resolution. To keep a couple of things in mind. The zoning resolution governs use and bulk that's its purpose. Basically, the city is divided into zoning districts, each with its own set of bulk and use regulations, and the blood center is asking for changes to the district designation of their property so as to allow both use and bulk, which is to say size not normally permitted in a residential, neighborhood and I think that the kinds of requests that they are making rezoning of their site, rezoning of the 200,100 feet on either side of second Avenue to a slightly different zone by the way, and then based on that a zoning text amendment to allow by special permit not to allow everyone but to allow by special permit other significant changes in terms of height setback, use. The fact that of the allowable use allowable under the rezoning of medical laboratories would be allowed to extend as commercial laboratories all the way up the building, rather than just commercial, on the lower two floors, which is the normal zoning for the C28 zone that they plan to upzone to so they're asking for a lot and I think that at least one of the previous speakers said that mentioned that one of the things for which they are asking are permits for very large signs, and with that I'm going to stop before Elizabeth scolds me. Thank you very much. Anthony I hope that the drawing scared everybody as much as they've scared us and the next speakers represent friends of the Upper East side, Historic District, Rachel, Levy and George James. If we can find them well we're here, thank you. Smith, yes, go for it George, so I'll just start talking, I'm Rachel Livium from friends of the Upper East side, and I'm here with George James who's, an urban planner that we work with closely who we have brought on in to do some analysis on this project. I think we will skip ahead. Probably a lot of points have been made already, but we can just kind of whiz through the beginning here and then I think there are a few things that we can add that haven't been covered a little bit later on. So you all know the blood center site, this just reinforces kind of that shot, hills and valleys between the avenues and the mid block and shows what the proposed blood center building will look like on the south side, elevation of 67th street and then on 66th street. Again, you can just that really consistent up and down character will be totally disrupted by the construction of this massive building at the Midwalk and, as you know, R8B is has been extraordinarily consistent and successful on the Upper East side, when it was mapped in 1985, the New York Times called it the most sweeping zoning change in the area since 1961 and as Paul noted, this would be really the first time that the Rab Zoning has been up zoned right now. The blood center building fits in to the envelope. In fact it's under built, they could do a little bit more, and this project would really I think set a precedent for every mid block on the Upper East side and just do a lot of damage in the precedent that it would set here, as you saw from Anthony, is what can be built as of right. So you can just get this, and here, of course, is what they want to do. 334 foot building of which the blood center will occupy only 35 percent of the square footage. The rest, as has been covered, is going to be leased out to tenants basically, commercial, tenants and I'll turn it over to George to keep going here right. So a lot of this has already been covered regarding the rezoning, so I'm gonna move very quickly through this part and if I go too fast, you'll stop me, but you know we modeled it and it's big, and this is putting some data behind some of the things that Paul would say about the nature of this the size of this tower. We have tall towers on the Upper East side. We have buildings that are 300 feet tall, but they tend to be very slender towers, good for residential uses. The proposed blood center tower is absolutely enormous and in fact it does compare to one Vanderbilt 10 Hudson yards, one Bryant Park, Freedom, Tower Empire state Building. What we did here is we took, went up, 280 feet and cut these buildings at that point and we're comparing the size of the floor plate here with these commercial towers and in fact it is much more like the commercial towers and it is a property side building, and you know the point has to be made. Is that Rab? You know you can't go tall, but you have other buildings. These two memorial Zone Kettering buildings that have been built relatively recently under the Rab nearby people have already talked about Saint Catherine's park and about it being the only park nearby. We ran some shadow analysis similar to what they the finding is, but we put some calculations behind them and I think the calculations are important, oops, sorry, because what they show you is they put numbers behind this so like here. This is I'm sorry, March 21st, so on March 21st right now at 4 pm, half the park is in shadow with the new building, the other half will be in shadow and so that you have virtually the entire park in shadow at 4 pm and 5 p.m. And you see the same pattern in the afternoons. This is may 6th, where you have. You know 27 in shadow at 4 p.m, going to 95 in shadow at 4 pm, and you know: I have kids, you know, I spend a lot of time in parks and playgrounds and you go after school. This is the time that matters and it will affect the usability of the park. We did Jude as well we'll submit this, but you know one of the other things we also did is we looked at light is different than direct sun light from the sky reflected light, and the thing is that shadows will impact yeah, only things that block the sun, but you, but if you block the sky, you also lose light. So we ran a lighting simulation for existing conditions, proposed conditions and then looked at the change. All right- and so what this shows you is the light loss and the point that I'd like to make here: it's not only the park, it's the street, as was pointed out earlier, the school across the street. It's enormous amount of light loss, but also to the direct south because it blocks so much of the sky. The small tenements will lose an enormous amount of light and then finally, I want to talk briefly about this, because no one's really talked about this is that in 2016, the mayor announced the Lifesci NYC initiative, which is this identification of the life sciences as a strategic industry and they're going to invest money in this and in 2018 they released this request for expressions of interest for the applied life sciences hub and this rfei. They got no responses that met the minimum criteria, and you know I'm reading this and the blood centers plan would meet the minimum criteria and they identified sites site one in east Harlem sites, two in Kipps Bay sites. Three. These are city-owned sites where they're trying to attract this type of use that is being proposed here. I, I'm also. The planner in east Harlem, so I know the east Harlem site really well, it's vacant. It's appropriately zoned, it's c63, it has a it's the it's slightly larger. You can fit it on this side. It's completely vacant right now it's been vacant since the 70s. It actually would be a much better site for this. The Kip's bay site is about the same size as well. There's a building on it would have to be demolished and resolved. The long island city site is much larger, but it would also have to be demolished in resolve. You know the it's. The city can do this. The city can identify important institutions, important industries. The blood center is an important institution. It is an important industry. I think the you know. This is from their tax form. It employs 1300 people, you know it's big, it's much bigger than I ever thought. It was half a billion dollars in assets or lots of well-paid people here, but you know they're going to conclude with these thoughts. You know it's tempting to use the zoning resolution to subsidize important organizations, but that's not how we should be making land use decisions right. We should be making land use decisions according to land use plans. They shouldn't ever be using the zoning resolutions as a replacement for taxes or subsidies. You know that use undermines the very purpose of zoning which, to quote the Department of city planning, is to promote an orderly pattern of development to separate incompatible land uses to ensure a pleasant environment. All the space, as has been said, the blood center needs can be built as of right on their site right now, and if the city wants to build up this industry, it should, but it should focus in on the sites that it already as I identified, that the EDC is already identified and built in places where this use and mass is appropriate. Thank you very much. My pleasure, thank you, and our last speaker is a representative of the Julia Richmond Erica Doyle is Erica Doyle here. Thank you. Welcome, hi. Thank you. So much and I, just I'm so grateful to everyone here. My name is Erica. Doyle, I'm the principal of Vanguard High school, which is in the Julia Richmond Complex, and I'm here to represent all the principles of school communities about this blood bank expansion. The Julia Richmond educational, complex, is not in support of this expansion. The New York Blood Bank clearly did not learn from its resounding defeat by our neighbors and supporters when they attempted to take over our building in 2016. at the time they misled our elected officials. By claiming we supported their project when we did not. Four years later, they now propose an attempt to mislead us again by proposing a construction project of a scale and impact that would harm Julia Richmond, just as surely as those 2016 demolition crews. We are extremely concerned about a multiple year construction project across the street, from a school that serves children from the age of three months to 21 years, dust and debris asbestos and lead chemical exposures, glues, varnishes, urethanes, roofing materials, diesel exhaust carbon monoxide, falling equipment, not to mention, struck by hazards and an already congested thruway. Not only is it dangerous, but we already can not access with our school buses. The entry of the building due to the blood center vehicles parked in front and all over 67th street. We already have difficulty with our cognitively disabled and medically vulnerable and youngest elementary school children during pick off and drop off, because these vehicles from the blood center already block what will happen so these students can make it to school safely during construction and then thereafter, when they propose to increase the number of vehicles, workers, employees who are accessing this street. Finally- and most importantly, we come to the issue of sunlight. This building will deprive children in our schools and children in our neighborhood of the sunlight that we also desperately need and that children must have during, as was mentioned before the most used hours of the park. Children go to recess after lunch from every single school. The park is already crowded, with very young children from the neighborhood and our students. As you are well aware, this campus serves students again from three months of age to 12th grade. We have maintained a strong identity and partnership, successfully serving a diverse mix of New, York, City students and families for generations, and working in conjunction with our wonderful neighbors, on making sure that this neighborhood retains its vitality and its dynamic identity. We are very much against this proposal and we do not want the blood bank to expand to be rezoned, and we do agree that it sets a dangerous precedent for the entire neighborhood. Thank you so much. Thank you very much and thank to all our speakers now. My co-chair Elaine Walsh will hear from members of the public and I particularly want to thank all our speakers who have given us nightmares for the next month, and now my co-chair Elaine Walsh will conduct the next part of the meeting. Okay, thank you for coming through zoom to a meeting about a very important zoning issue that faces our community the next steps and will help with some of this. By explaining the process, we will be asking the public to speak. We request that, if your point has already been made, we will at some point when the speaker is finished: ask people to raise their hand no to check and will would do this, whether that's an issue that they're concerned about, so that we won't have repetition with the different speakers. Will the are there any other things we should be saying about how to monitor? What's going on yeah, so we're gonna move to public discussion. The way you'll be recognized by the co-chairs is using the raise hand, feature that you find in the participants menu. So if you look at the bottom of your screen right now, you'll see a button that says participants has the number 174 next to it. If you click that button, you open up a mono a screen on you open up a box on your screen that has a lot of names on it and at the bottom of that, you'll see a few features that we're going to talk about for a second one, you'll see the raise hand button. That's how you'll get called on by the co-chairs to be unmuted and speak, and then next you'll see a green check, mark Box that says yes and a red check, mark, Box or x box. That says no, so at the end of a speaker's comments, we're gonna. Have you click? Yes, if you agree with that and know, if you disagree with it and that way, you don't have a lot of repetition. I also believe that we're also going to set a timer for each speaker is that right, Elaine and Elizabeth, yes and so you'll see on my screen. You'll appear on a tiny little box in the top corner. You'll see a big countdown clock, so you'll hear a big noise it'll be a little annoying. So when you hit two minutes, we'll ask you to wrap up and stop. Does that sum it all up? I! Think! Yes, thank you very much. Okay, the first one Paul Kane, see here yes, I, see. Paul! Oh, give me one second to get our timer up sure all right. Can you see that? Yes, all right great, so you're ready to get going all right? Thank you very much. I am a resident and unit owner on East, 77th Street, and I'm calling in to voice strong support for this proposal. You know, I, we've heard a lot about shadows. We've heard a lot about. We heard for some reason about Lincoln Center and the population of Lincoln Center, there's been a lot of what I see is red herrings, but when I look at this I think about 2,600 people, patronizing our businesses buying our apartments and activating the street life. We've heard about setbacks, but in my experience, setbacks are bad. They kill the street life I'd. Much rather hear people advocate for commercial space on the ground floor and I really think that our neighborhood is one of the densest in the country and particularly a hub of medical uses, is so able to accommodate this new building, surrounded by other large buildings and greatly increasing the businesses. The foot traffic potential residents I strongly advocate for this use. I, don't think it's not contextual, I think in many ways the fact that it's a mid-block building is again something of a red herring and finally, I think we really need to move the discussion away from traffic. In particular, the traffic is terrible in the neighborhood, but that's more of a result of free parking and the fact that we incentivize people to have cars from talking to some of these people. You would think that it's a right to keep your car on the street for free, I, really disagree. I think it's much more important to support our medical hub within the neighborhood and to welcome as many people as we can possibly accommodate. Thank you very much. Betty Wallace she's on the yeah. Give me one. Second excuse me and I forgot to tell everybody if you're on the phone, it's star nine, to raise your hand so Betty, it's star six to unmute yourself and you will not see the timer. But if you hear the beeping okay am I in yes am I on now. Yes, okay, I, really am very surprised that it took three people before we heard of the real, very serious reason to object to this and that's to protect the zoning. As Rosie mentioned earlier in 1985 Helena Rosenthal, representing friends of the Upper East side, Jeannie Rice, representing sabotage and I, representing his 79th Street Neighborhood Association met with the city planning, commissioner, because two buildings that really should have been landmarked were being torn down in the low 70s and we were seeing then that we were going to be losing an awful lot of other buildings that are in the mid blocks. So we were successful in getting that zoning done and it was Tr tried. As someone said, we didn't have any problem for a long time, but we did have a problem with 75th street a few years ago, where the there was a effort to try to go against the zoning, and we were able to stop that. It's very important that this zoning be protected and it's very important that our community board do that. I'm sorry to have heard last time. I did call in last time. After the long talk about the zoning, I did call in the voting had started on it. There were over 200 people who were calling in opposed to it and I didn't understand why it was put off for another time, but this is the time for the board to protect the zoning. I, don't know, what's going to happen to the avenues, we don't have the elected officials who understand the importance of protecting the density and the efforts that we have to make to keep our neighborhood usable and good, and all those other points were very well made. This is not a situation that we have to be considerate of the blood center. They didn't even show up, I'm very sorry that we lost some time with it. I hope that the community board will vote to protect the zoning that the community board I should add. Also, of course, was very important in working with the three groups are when we got this zoning, so I hope we will be able to protect it and I. Thank the committee very much for all its work and I thank the rest of the members of the community Board. Thank you Betty. Let me just say that Betty made a good point: the blood center and anybody from Longfell fellas is not here tonight. They definitely were invited with much time and I was told by their lobbyists that they were too busy preparing for the scoping session and would not attend. We were very disappointed because we had tried even earlier in the year to get them in and it was difficult to get them to present and participate. I'm sorry I didn't mention that earlier that they're, not there Adam Grumbach. Thank you Ms Walsh and Ms Ashby for allowing us to speak. My name is Adam Grumbach, I'm also with the Julie Richmond Education Complex. I've been a teacher there and I was a principal there. I don't have a lot to add that hasn't been said in the Devin's devastating presentations that came before me. I think. The point has been well made that this building is just entirely out of place and does not belong there. I can speak to the issue of sunlight in the Julia Richmond building. As someone who has taught many classes in the buildings that face south anybody who lives in an apartment in New, York City knows what a different sunlight makes in your mood and the way you perceive your day and just the general feeling of getting up in the morning that building across the street would deprive the Julia Richmond Complex of all of its light for its entire day, and it would be a gloom of darkness cast upon it. Principal Doyle made all of the important points about the traffic on the block and how the building would affect Julie Richmond as well, but I would just point out one last thing: when you come up 67th street from first Avenue or coming down from second avenue, it is a public block. The block is dominated by a public school, a public park and on the other side of the street, we have a public library to put a giant commercial endeavor like a 34-story medical facility that is interested in making money and, despite their not-for-profit status, it's worth pointing out. They pay their CEO and president 1.8 million dollars a year. It would change the nature of the block. It would no longer be residential, there's a point for mid-block zoning to keep residential neighborhoods residential and not turn them into financial centers, and this block would lose all of its character with that building looming over it. That's all the time, I need and I appreciate you setting up this committee and setting up this hearing once again. Thank you very much. Thank you. Lydia Canezzares are you there. Lydia you'll just have to confirm and muting at the bottom of your screen. There you go. First of all, thank you so much for making this a forum open to the public. I'm a resident of East 72nd street I want to thank the presenters for their very compelling presentations and, to be honest with you, I was not as aware until this evening of what a threat this is to our neighborhood. So I wanted to ask: what can we, as neighborhood residents, do in the way of a grassroots movement to make our opposition to this proposition known? To whom do we need to send communication in which form and what would be the proper venue to be able to voice our concerns? The best thing that you can do is reach out to all the elected officials in the community, as well as the borough president, the mayor and meet with them or ask to by zoom, but send letters and emails voicing your position and I would like to ask perhaps, as Apollo I just one quick thing I understand the communication. Is it possible at the end of this session, since you already have our email addresses from having signed in for the zoom that list of proper email address and loca and people could be sent to us, and that would make it much easier for us to blanket them with our communication and who is us meaning members of the public that signed in for this and wanted to make their position known? Anyone who is part of this zoom, or perhaps it's done through Ben Carlos's office, because I'd be very willing to write those letters and communicate, but I just want to make sure I'm directing them appropriately will. Is it do their email addresses come out? Do we have those email addresses are not a required spot on our sign-in forms, but if you did enter your email address in, we could create an email that is sent out to you guys who are all in attendance. Sorry for anybody who didn't want to receive it, but we could also. We could do that. I would appreciate that. Thank you very much. I'd like to tell this, lady, that what you and the others are doing now is very valuable. Coming out to well not coming out staying home to meetings at the moment and speaking out, you make people aware and you've made a very valuable contribution already. Thank you very much. Thank you Olivia and thanks for organizing this Ruth Brotzky a little bit. Yes, can you hear me? Yes, okay, one of the things I want to talk about is that the blood bank who says they want to be a good neighbor, is doing just the opposite. I think they are being deceptive and I think it's really unreasonable for them to be saying they want to improve and modernize themselves and they spend most of the area of this tower not for themselves but for some unknown tenants. That seems to me not in the spirit of good neighbors I. Think we've been hoodwinked, I think they've been deceptive and I think that it is wrong. I think they should take a look in the mirror and who are they and if they want to improve themselves, we are willing to do that, but we don't want a tower for some unknown tenants which has nothing to do with the blood bay. If it has to do with the blood bank, they can go to long island city, they can go to other empty spaces in the area, but not here. Thank you. It was just suggested that on December 15th there will be a scoping session held by the Department of City planning on this applicant and its proposal. And if you go to the community board, 8 website I believe there's information there about the scoping session will. Could you correct or lead them to the right place if I've yeah I'll put the link to the place about the scoping session in the chat in a few moments? So just give me a moment to look that up and we're listening to the next couple of speakers come back and check in okay and that will give you the opportunity to one raise questions and concerns with the city. Lynn Alici are you there? You just have to confirm unmuting Lin, so look for a button to pop up on your screen. Okay, there you go Linda Lassie, 49 years, Upper, East, side homeowner, we keep on talking about the blood bank, it's not the blood bank, it's Longfellow! It's not the blood bank, we're dealing with a big developer and they don't care. You know the they're going to rent the other 30 floors or 27 floors to whomever they want. We have to think about the toxic waste that it's going to have. We have to think about the traffic. It was very interesting in Longfellow's website when you go to them. It says you know the difference between a developer and a teammate, no I, don't. Thank you very much. Thank you! Allison hi! Yes, okay! It's your turn. Hi I just wanted to add a couple of points about the traffic I know, they've discussed it, but I actually wondered how the ambulances in this area that we live in have so many hospitals how those feeder streets that will now be more congested would affect that. I also wondered whether there's going to be any indication of whether that building will be lit up every night, because it's a life, science building and all those aspects of how it will affect our community. Thank you so much. Okay, thank you. My understanding is, it will be open all lit up all night. Okay. The next is Julie Menon hi. Thank you so much for your time today. So I'm a third generation resident of the area and by way of background I chaired a community board for seven years. So I spent a lot of time dealing with ULURP applications and I also served as commissioner of three different agencies so come at it. From that perspective, as well and I'll, be very brief here, I just want to say that I do not support a mid-block rezoning. That is non-contextual, which I believe is the case here. That is not contextual. I also would add that it's not only about this one application, it's a dangerous precedent that it would set for the east side, as well as the city as a whole, to allow a mid-block rezoning. So I wanted to just raise those concerns that I have and I really thank community board 8 for organizing this meeting and for allowing the public comment. Thank you, Jeffrey Moss Jeffrey. You just need to confirm and muting on your screen. I'm unmuting! Okay, can you hear me now? Yes, yeah I want to thank everybody. For being there, my wife and I have lived on East 68th street for longer than I can remember and I want to caution in I thank Miss Alessi for mentioning the developer. I want to caution all that, and I'm surprised now and has mentioned it- that the developer will probably throw himself as a bleeding heart. Excuse the pun and say you know, what have you got against donating blood and I think that's a very dangerous position to be because he will throw himself onto the public after this horrible pandemic. That we've gone through and I would also like to find out more and it's not in my position to do so to see the paper trail lead. You know we've seen four years of enough and now we'd like a little more transparency. I. Thank you all. Thank you. Jacqueline Ottman hi, I'm Jackie, Ottman I live over at 315e 69th street, I'm on the board there and I been in the neighborhood for 40 years, just real, quick and one point that hasn't been made and I can't quantify this, but the neighborhood seems to be in this long-term. You know conflict with infringement of the medical community, and you know over time. This medical community that started over on York Avenue is extending its tentacles and fingers all throughout the neighborhood and I've heard from some of the local business people the restaurants, and what have you that basically what's happening over time, is we're bringing in people during the day to work and then kind of they all go home to wherever on the Q train or, however, and leaving the neighborhood behind and a lot of businesses and restaurants. And what have you don't want to invest here, because the neighborhood has been becoming transient over time and I think this is just one more example of it and something that we all have to be cognizant of from the larger picture. Here, it's more than one building, it's the lifeblood of a continued downgrade of the neighborhood. Thank you very much. Bernadette I just wanted to ask I understand you know all the rhetoric pro and con and Iphone I, I'm very much in favor of having as much sunlight as possible. Okay. Now, but my concern is the approach now I know: Ben Kalos has a large reach into people's apartments everywhere in this particular area. But this is much bigger than this particular area. Talking about zoning now, I, don't understand zoning as well as I should I, don't know. If there's zoning each community board has a different zoning, then you know, if you have so many community boards, does each one have a different one if they don't and if it's a zoning that goes across the entire city of Manhattan, is there any way that we can bring all of the community boards, not just community board eight, but all the wrath of all community boards again that infringes on the quality of it. We're losing you Ben callus is only one person he has counterpart. He has count. Ben Kalos is one person he also has counterparts. Can he then pull on all his counterparts, and can this be done in some an injunction something that will reach in and stop and cause the person who owns the building to have a lot of leakage of money until he can maybe compromise? Maybe it isn't the blue line, but it isn't the top of the red, maybe two or three floors more might be appeasing. But what I'm saying is you have to hit the money if you do not hit the money, if you do not hold them responsible, you know and do something that is an injunction form, a legal form against the building of this or the change in this zone. Okay, my time is up. Thank you for the idea. Thank you. We will follow up and we would suggest that you reach out to Ben Kaylos and your other electeds with your idea. So thank you very much. Adam K hi everybody yep thank you. I spoke previously, but just wanted to come on again and reiterate my opposition to the project. I guess what I did not touch on last go-round because I frankly didn't appreciate. It was the extent of the environmental impact, I'm a resident at 301 E66, I'm an owner and have been for 10 years. My apartment on the 14th floor directly overlooks faces east and my open light view and by the way, I did extensively research. What the zoning regulations were because I was always worried. The blood bank would want to redevelop, but never in a million years imagined it would be a 333 story tower. What I want to really highlight is the impact to my children. I have two young girls and beyond living through five six years of construction and all the environmental hazards that my children will be exposed to you've also removed all the light that my apartment will get permanently. Another thing that I didn't really appreciate was the extent of that and then seeing the analysis that was done, showing the impact directly specifically to 301 e66, but also to the park, and everywhere else was profound and what may will have a dramatic impact to my children and us that was all thank you very much. Maria Andriana hi I am a resident at 315, East, 68th street and I've been in the building for 15 years. My big concern is the president that it's going to set I mean this is not Midtown Manhattan. There are so there's so much real estate space in Midtown that they can move into it's kind of shocking that they want to develop at this point. But what I want to ask is the timeline for stopping this and really what we're going to do because I feel like we need a focused organized effort. I'm not sure that writing a few letters is going to stop this. So I guess. My first question is: what's the timeline to stopping it and is there a plan in place? The community board is having their hearing or presentations. Tonight we will go into a executive session with the board members that are here and we'll discuss. What's on the table and a resolution will be passed, there are different steps that have to occur, including the scoping session that will happen. December 15th, I'm not sure exactly of the timeline I, I'm not sure the blood center has also laid out their plans. Elizabeth. You may know a little more than I. Do I, don't know the timeline on this, but there are many hurdles they do have to go through and the final one. Well, the really the final one is the mayor, but it's voted on by the city. Council and the mayor can veto it and the city Council can override the veto, but it goes through city planning then by our president. So it's not gonna happen now next week it has a very long. A major project like this has a very long timeline and lots of play. I think it's the city council really, that is the most important, but usually thank you I just I haven't you know been involved in a process like this, so I wasn't really sure how what the steps are. So you feel that our best, the best voice that we have is to write a letter to the council and to the mayor's office. That's one there later, but I would talk to your city, councilman, okay, right now, I'd also get involved with your community group, that's organized and follow what they're doing. Also okay. Thank you. Good luck! Thank you. Maria Andriano, the last speaker. So next is Kathy. Thank you very much for allowing me to speak. I just want to make one point: I am opposed to the building. I've been I've, lived at 315 east 68th street for over 25 years, but the point I want to make- which I'm not sure has been emphasized, is that the New York Blood Center calls itself a not-for-profit and, as the former head of a not-for-profit organization, not-for-profit organizations are in the business of making money. They just have an IRS benefit of not having to pay taxes on that money, so their corporate citizenship calling themselves a not for profit, doesn't mean they're, not interested in pursuing commercial activities. That's all. Thank you very much Anthony Barrett hi good evening Elaine and Elizabeth. Thank you for hosting us this evening. I'm a board member at 301, East, 66th, street and I want to say that I agree with mostly everything. That's been said here tonight, so I don't have that much to add, but I would say. I just want to point out that all our residents and board members strongly oppose this development, and if you can put that on the record, I also want to point out that something that has not been mentioned on the corner of 67th and 2nd Avenue. We have a nursery school and preschool currently caters to about 85 kids ages, two years to four years of age, and they use the Saint Catherine's park on a daily basis. They basically walk down to the park and I can't imagine the impact of this construction and the light and shadows that this will have on the ability to use the park. You know for all these kids I also want to say that I've set up a Facebook group called Eastsiders for responsible zoning, and anybody who wants additional information, which is free to post or free to add their comments and free to reach out to the community, we're finding it very hard to be able to access to get communications to everybody who's. Looking to get information on this, we develop this platform. Some people are not even don't like social media and might not have Facebook. So we are also interested in getting emails of everyone here. So Elizabeth I've spoken to will before about getting a mailing list or trying to get emails of people that are interested and wondering if there's any way to do that from community Board 8. and that's my comment. Okay, thank you. I think it was mentioned that will be able to pull those emails that were submitted when people registered and share I can email them is what I said. I have to check with the committee on open government. If, yes, I was wondering that myself, okay, yeah Peter, Rogel hi, yes, bro guy, thank you. I am a resident and board member at 333, 66th street and first I just wanted to thank the community board for hosting the event and allowing the public comment. I, obviously agree with most of everything that's been said in opposition of this proposal, and the only additional thing I'd like to add is that for those who are opposed, we have an online petition at no new bloodbank.com. Again, that's no newbloodbank.com. If you'd like to sign register your opposition, we'll ensure that our community leaders and politicians, all you know, recognize the amount of people we have opposed. There's over 300 currently who have signed the petition. So again, please sign the petition. You know there's many folks we haven't reached yet, especially who are who work at Julia Richmond School such as Erica Boyle. If we could reach the parents of the children who go to that school, that would be fantastic. So again, that's no newbloodbank.com! Thank you. Okay, thank you. I think. That's a very effective tool! I! Think. Okay, when are people continuing to sign up low vanderhoff low, though you just have to hit star six to unmute? Oh low, Hit, Star, six, hello. If you can hear me hit Star six, there you go okay, my name is Lo Vanderbolt I am president of Carnegie Hill neighbors. We are part of the community Board 8 catchment area, but we are further north, but nevertheless Carnegie hill neighbors is very concerned about zoning issues and adherence to zoning in the Upper East side. And certainly it's been emphasized during the course of this meeting, that the zoning for this site is R8B and R8B is very important to protect the character of the mid blocks and many of our mid blocks in Carnegie. Hill are rap and we think that all efforts should be exerted to protect that status. Also, I want to say that appreciated very much the drawings provided by Anthony Cohen that showed the impact of mass of the massing and also this drawings from George James, also showing the bulk under different scenarios, as well as of the sunlight studies and the ambient light studies showing the impact on the block and the school and I think that George James also mentioned alternate sites. If they're going to build to this extent in excess of 300 feet in height, far exceeding the mid-block height limit of 75 feet. There are alternate sites in the city and George pointed to one I believe in east Harlem at 126th street, which might fit the bill, so there are alternatives and I just wanted to voice Carnegie Hill neighbors support for this effort to limit the size of this building or ask that it be built elsewhere. Thank you so much. Okay, I'm going down to people who have not spoken yet Corey, Walker, yeah, hi, I'm a resident of 333 East 66th street and due to the reasons that have already been cited, would just like to register my opposition to this project as proposed. Thank you, Anne Wininski hi. Can you hear me? Yes, hi, I'm and Barbara Wisniewski and I'm a board member and resident at 333 East 68th street. My children grew up going to the park and I think it is a travesty that the park would be affected by this construction and I. Just I agree with everything. That's been said so far, and it seems like everyone on this call. Lease is very united in opposition and I have a simple question for our hosts, and that is what is the most effective way to defeat this? What's the most efficient effective way to defeat it, it's an overly simplistic question. Maybe, but I've never done anything like this before I just want to know. What's the most effective way, petitions and letters see all of the above and communicate with your neighbors and organize and identify with the reasons under zoning. Why is not a good plan and then get into the issues of environment and safety, etc and I think there are a couple of people right in the community that can help you with that, and you've got some buildings now already organizing, so I would unite with them and move to reach out again to the elected officials to tell them, and it might also be helpful to reach out to the blood center and raise the concerns on the issue. What about media? Yes, that would be perfect if you can get it good. Media coverage is always helpful. Okay, thank you, Craig de Bona. How many more are there just two more because we'd like to move into I see? Is he Craig and Susan? Okay Craig the boner I'll make this quick presentations were great tonight. Letters are all great, but I really think we have to realize that Longfellow will have lawyers to do everything they can legally to push this through. I'm wondering how we can or we can identify somebody who can who's an expert about this, to advise us legally about our options in fighting something like this because believe me, Longfellow, has a whole group of lawyers and legally they're going to try to fight this. So we have to know I mean letters are great, and all of this is good and it's all going to help them, but we need somebody who that actually does this for a living and knows how to fight it. That's all! Okay, we'll be back to you Susan. Where are you Susan, yeah, okay, yeah, I'm an owner at 333, East, 66th, street and I want to say that first of all, I really do appreciate the presentations, especially that started with Marty Bell and Paul Graziano I thought they were excellent, and so many really important points were made all along from the school etc. I want to address specifically the community board I feel that the community board should be taking a leadership role in demanding that you know in first of all and representing all of the voices that we've heard here tonight very strongly. That has not happened yet as far as I know and I, it's really missing. They need to take a leadership role. They need to pass a resolution, they need to be united, they have enough information, it seems like at the last meeting. Some of them said they didn't have enough information, but now they certainly do. We all have enough information to see what is happening and all of our delays are just going to put us further behind, as the people at the blood center are pushing forward quickly and they do have you know, lawyers etc. Who are pushing this process forward? We have no time to waste and we need to get very well organized with strong leadership. That is what I feel is missing. The fact that people could be asking questions like what do I do doesn't make sense. We need to be given some clear guidance on what can be done. There's a lot of people here that are willing to put in the time and the effort, so I hope the community board will listen to us and represent us the way we expect them to. Thank you just a second I, okay, I appreciate that and hear your frustration and you have to know that the community board is there to listen to the community and take some leadership, and so we'll be working on that I'm going to have one more person Betty Wallastine spoke before, but if I don't ask her to speak, it'll be there and then all the other board members. When we go into our discussion group, we can talk. Betty, do you have something to say Eddie and Star? Sixth I mute hi. Thank you very much. I just wanted to say that it was incredible to hear all of these people who want to do something. I hope the board is going to have a very good showing opposing this, but I was going to suggest if you would agree that we give at the end of the evening, as you said, the phone number or the way to reach Ben Kayla's. He is our council member and he will be very happy to have all these people call and I would like to know if you would be willing to do that at the end, so that people will have a number and they will be able to call him. Yes, we can do that. Thank you so much! Okay. Before we move into the Committee Board Committee to discuss what we've heard tonight, we would like to take a poll of those who are attending who are public part of the public meeting, how many are opposed to the blood Center Longfellow Project. If you're opposed you click, yes, is that correct will I would say: let's say if you're a pose click, no, if you're in favor of the project as it was presented previously clicked. Yes, that would be a little easier. So just for anybody who missed it, I see some confused faces right now, I go to the bottom of your screen. You'll see a button that says: participants click that button right now it has a little number 134. Next to it, so you'll click that button a box will pop up. That's where you'll find the raise hand button, but that's also where you'll find a yes and a no. The yes is green. The no is red, so just click that box we'll give it a couple of seconds for everybody to register only click it once because, as soon as you click it again, it will disappear and to repeat will if they are voting. Yes, they are voting in favor of the project if they're voting, no they're voting against the project, so we'll give it one more. Second, okay, a couple more seconds that was actually an important second, let's see, 183 no's and I saw two yeses earlier, so I'll just read that into the record, so I think we're ready to move on to the next I you ready as soon as you're ready, yeah. Okay. We will now move into the executive session for the board members to talk at this point. The public will not be able to ask questions if you and I don't know how you do it in zoom to be honest, but if you have a question, I guess put it in the chat and if a board member picks it up, we can incorporate it Elizabeth. Do you want to start the discussion? Okay, we have a number of board members that are here. You've heard the presentations. Are there any questions from what was presented or discussed that people want to respond to Michelle, I? Guess I? Will I'm going to have to respond to them when they raise their hands? I? Guess Michelle yeah! You don't want a timer for this. No. Thank you very much. I want to thank the presenters all of the visuals and the charts and the explanation. They were all excellent, lend further clarification, I. Think, combined with what we heard tonight and with the presentation that we heard last week from the developers, we have an extremely clear picture. If there were any doubts in anybody's mind about what's happening, we understand it now. I did want to address a couple of things. The public asked how they could help and the best way is always organization. You have a couple of existing organizations with those buildings, 333 and I think it was 301, I'm not sure, but you know who you are and I would like to ask you and will in order for you to get in touch with each other. We have to be able to share your contact information that would be a breach of privacy if we, as the community board release that, without your permission, so will are you willing to have people who want to have their communication, their contact info given to the other people on this call, so that they can join those groups or make their own groups and then combine? Are you willing to take that in the chat for those people who want to share because I know you can't just send out everybody's emails and telephone numbers, so is that a system that'll work for the moment, yeah I have to check with the committee on open government to whether or not we can share people's information like just as it currently stands. I see Valerie waving, no I mean if you, if they give it to you, not if you take it off, give it to me. I think give it to you, yeah I, think if they give it to me, what I can probably do is create a little google form that everybody can just for this meeting, put it in and then I'll send that information to everybody who puts their information into that said, okay, fair enough, because it takes me a couple of seconds. Okay, the other thing that can happen is you all live near each other walk over to 333 e66 and ask the doorman for the name of the person who's, cheering the board and that can be for 301 and probably 315. Elaine. If I may say, Elaine I, don't think that's something that a doorman will do. You know without permission, but I. Think if you write in the chat that you are giving will or he's going to organize a little Google thing, whatever I think it's important I think that I will direct you also all to the online petition. All of you all of the organizations should get together and each of you eat those that aren't already organized each of you in your own buildings, the your own people, whoever you know, start your own little organization and then you can look to combine. May I also stress that it not only be the buildings that are approximate to the development. It would be very good because this is a zoning issue, so this zoning issue is actually city-wide and there's grave concern about zoning being at risk. To my mind, zoning is the only thing between us and chaos in this city and if it's breached every developer, every owner will take advantage of that as a precedent and seek to disrupt the zoning. So you don't have to be on 66 or 67th or 68th street. If you have friends, if you have relatives all over the city reach out to them and get them to talk about the zoning, because that's very important from the community board's point of view tonight, I would like to see a resolution now I have spoken, so I can not make that resolution, but I was disappointed. I know members of the board wanted additional information after our last meeting. I certainly had enough, then to make a resolution and I just want to say now that I hope that we end up with a very strong firm resolution out of tonight's meeting and also any information that you can circulate to all of us about how to participate in the December 15 scoping project would be terrific, will whoever you can send that out to the whole board and the public, because for the public, that's the next step, and so that's very important. So that's what I have to say make sure you share information and I'm looking forward to a very strong resolution tonight. Thank you. Elizabeth rose nope, sorry clicked on Ed Heartstart Elizabeth next. Thank you. I would like to make a motion that we pass a resolution to disapprove the proposal for the zoning changes requested by the blood center. We've heard very well organized comments from the public, very extensive examples of showing exactly what this does to the mid-block zoning. This puts R8 zoning at risk throughout the community board, eight, as well as other parts of the city that currently have r8b zoning, and we know that the blood center can achieve their needs within and as of right building. The involvement with Longfellow is purely a financial play and, frankly, I would argue it is a public subsidy to a not-for-profit and the community would bear the brunt of it. So, for all of those reasons, also the shadows, the traffic, the change of the nature of the neighborhood from residential to commercial I, propose that we vote to disapprove this proposal. Okay, I need a second on that, so I guess. If somebody would click on yes, if they would. Second, it would Second Anthony did, but you can also use the reaction. Thumbs up button is a better way to do it very good. Okay, we're learning, okay, ed and, while heads on muting I just put the google form in the chat. If you chatted me your email address earlier, I'm not gonna put it in I'm sorry, I have too many things going on right now, so just go to that forum, open it up and put in your information there. Only if you're comfortable, sharing it widely. So I don't want to make the same point. Everybody else. Did everybody made some really tremendous points, our early presenters, just a quick shout out I think it was to if I have it wrong? Was it Paul Graziano come up with the 84 application? Well done, take 20 out of petty cash on that one. That is well done. That reminds me, and I'm only going to speak to more endemic problems to the last public speaker, the community board you're preaching to the choir you're preaching to the choir, beg our council members. Where are they to empower us beyond advisory begging? I'm pleading I'm on my knees, I'm begging for the public to get the elected officials to empower this board. I think every member of this board would go along with that. We are utterly powerless that way. But anyway, the point is there are so many problems with this project. Aside from the fact that we don't hear about it till way too late, which is the usual mo, so we're late to the game, two steps behind, and it reminds me so much of 583 Park Avenue Michelle, which we remember a couple years ago, and they came back again. Remember that move again. This is why you don't dump community board members off the board because they have institutional memories because they keep coming these developments and it- and the point is I- would rather address the endemic problem at some point of why we don't get the information, how we can be better informed from our community from our elected officials on these things resoundingly. We have to be against this, it's beyond the pale for all the reasons stated, but we're going to continue to have this battle. As my point I'm going to continue to hold on to this and keep making it it's that it. No, it's just you're just dealing with this little fire, but it's the oh we're going to keep fighting this battle over and over again. That's the real battle, that's the real point to be made to the elected officials in this process is better information, more power to the community boards and the public to have land use decisions put in their hands. That's my point, because every other community, every other borough, seems to be much more effective at this than we are. If you look around folks in the newspapers every other community, we are beholden to the medical community, and this is not because we're pro-death and all that other stuff to the public person's point about how they're going to play this we're anti-blood we're anti-life, we're anti-business the speaker from 77th street, which I found interesting, he's 11 blocks away from this project. Everybody else whose apartments are going to be value is going to be decreased because it's in shadows all the time they're the ones screaming, but 11 blocks away were for business development. It's a solid point, a valid point. I'm not saying it's not! My point is we're going to keep having this battle over and over again, so we have better information flowing from the process flowing from our elected officials to the community to have better land use decisions, I'm sorry to go on and on, but I'm just going to continue to be a pain in the neck about this because we're it's whack-a-mole and we lose and we're losing terribly look at the other burrows, somehow they're able to at least get something I don't know what it is, whether it's the medical community has too much power or whatever it may be, but we're losing the battle. That's all sorry! That's it! I'm done! Okay! Alita! Thank you. So this is a two-part statement. The first part is in my position as chair, so I just wanted to explain to the public. That's out there and frustrated at the board's response. The last time there weren't enough people to have a solid rejection of the blood center's proposal on zoning grounds, and it would have weakened the board weaken the public to have a half-hearted attack on this and approach. So we opted to go with a straw. I got all of your emails, we'll put them in a google drive for me, I'm a little late, responding but I incorporated the questions. The statements that you made in a document that went to not only the blood center, but the elected officials I just want you to understand that we wanted to be in a position of strength in opposing the blood center and that's why we opted to go for a letter and to come back when we had significant more information for those board, members that needed more and a stronger case to be made. Second, this is in my personal position, which is that there is a rash of not-for-profits around the community board, 8 and the city as a whole, claiming that, because they work in the public interest, they're entitled to change the zoning, whichever way they want to- and it's often an egregious effort to change the zoning. It's not acceptable and it shouldn't be acceptable just because they're simply working in the public interest. This, though, is even worse for the reason that Elizabeth rose raised, which is that it is, it does amount to a public subsidy to a public and a profit. Making entity long fell a long fellow would own. The majority of the building would rent it out to commercial tenants and stands to benefit enormously from this particular transaction. My understanding is that the blood center does not have the money right now to build what it would like, because it has acquired so many blood centers with its money, and should it be rewarded for doing that and should Longfellow be rewarded. I would argue vehemently strongly unceasingly that the answer ought to be. No. Thank you. Valerie Mason, Valerie, I. Don't know why I said: okay, that's my name. I want to thank Anthony again for another great presentation of what is going to be done to the neighborhood I, just I think we have to vote no I mean this has nothing to do with who the proposer is. This is about the protection of zoning pure and simple. We have been fighting for a 210 height limit on our abs and much of the many of the examples that were in Marty Bell's presentation show already how far we are, how far above 210 we already are and how we're losing the battle it. You know, as friends of the Upper East side indicated, it took 20 years to get a change in zoning to protect residential blocks. There is no public policy need for the blood center to do this, for anybody on the mid block to do this and for those who you know, don't think this affects them because they're not on that street. If it happens on 67th street, it will happen to your block. You can rest assured of be rest assured of that. Unfortunately, we're in a time where you know people ask what you can do you have to get out. There connect you heard from a lawyer at a law, firm who's representing a building. You need to get in touch with these people and get active. We need to fight. We are an advisory board. Okay, I went toe-to-toe with our mayor on this very 210 limit and he had the audacity to say to me that when I asked him to support our 210 limit, he said oh I know you're so heartfelt, but if I did, what you wanted me to do, I would have to support every community board in the city. Well, damn it. That is what community boards are about. We're about land use, we're about protecting zoning, and if everybody in this city understood the zoning law, everybody would be out in the street and what I'm saying to you and I'm going to step away from my board role for a second. What I am saying to you is: if you feel as strongly about zoning as I do, and everybody else does, we can take an example for from a Betty Wallistein at East, 79th street and people did when they fought for the Rb Rab to begin with, including Elaine Walsh and others and Elizabeth Ashby, and if we have to, we will have to take to the streets, because people need to know that you want to protect your community. We are not against development. It has been made very clear that there are sites here advocated by the city itself, to promote these health life science areas to put jobs in areas that are underdeveloped, underutilized, that aren't as dense as the Upper East side, and we have to support our limited. The limited zoning regulations that we have and I say that this board has to step forward and do what we can. Unfortunately, as Ed mentioned, we don't have the power to do it, but we have to show that we support our community and our zoning law. That and I'm done, let's call the question questions been called. Is there a second and see Ed Hart's heart yeah I would like to interject that we've had a marvelous amount of information provided and opinions and a resolution that we pass that we won't take up until tomorrow morning to do it now, but the resolution that we pass can reflect every single concern, and fact that was provided to us in our resolution that we're voting on I think that's a great idea. Elizabeth. Thank you call a question all those in favor yeah. Do you want to do like our normal standard? Where raise your hand if you're voting, no abstaining or do you want to call everybody by name? No, you can do what we normally do. Okay, great I, see Marco, has his hand up right now. I, don't believe, he's planning to vote no, but Marco it's star Mute, but the question's been called. Did we vote on it? No, not yet the everybody raise your hand if you're voting, no abstaining or not voting for cause, and so we'll have to call people by name to clarify their votes, and so Marco has his hand up I. Believe Elita Craig have their hands up Marco it's star six unmute. If not we'll come back wait. What are we doing right now will voting right. Yes, the question was called. The question was called Elita is wildly waving? No I'm waving! No, because you need to vote on calling the question and then going to the vote. Okay, thanks. Sorry about that. No thanks for recognizing. So the question has been called we're going to vote on whether we should call the question every take their hands down. Please yeah I'm just going to clear everything. All those in favor of calling the question is it raise your hand will? Is that what just don't do anything if you're opposed to it do something? Thank you. Great I, don't see any hands up. Okay, the question's been called so now. If you would like to we're going to assume everyone to be a voting. Yes, if you'd like to vote, no abstain or not vote for cause. Now is when you raise your hand, I'm sorry earlier I, okay of information, anyone who's just joined the meeting. The resident we're voting to on a resolution to oppose the proposal. So only put up your hand if you want to oppose or not voting for cause or abstain. If you want to vote in favor of the resolution, do not put up your hand at the resolution to oppose. Do not put up your hand exactly so. I only see one hand up right now and that is Craig later Craig. Okay, he favors it. Okay, no, he I think he's trying to say he abstains, but I can't hear him. Oh you're nodding yes to abstaining I hope. Everybody will believe me that I saw that. Okay, we'll trust you thanks. Okay, so the vote is I, think there's 15 or 16 board members there. So let me read all the board members. So it's in the visual record on YouTube and that way, if I miss anybody, they can tell me so it's Elaine, Walsh, Elizabeth, Ashby, Elita, Camp, Adam, Wald, Anthony, Cohn, Barbara, Chalky Craig laid Craig later, is not voting for this, but he's in the meeting right now. Craig later Ed Hartsog, Elizabeth, Rose, Felice, Farber, Gail, Barron, Marco, Tamayo, Michelle, Birnbaum, Peter, Patch, Rita, Popper, Sherry, Weiner and Valerie Mason did I miss anyone. Please raise your hand if I did no. Okay and Craig is an abstention. Everyone else was voting, yes, okay. The resolution passes to oppose the blood center and a complete resolution will be prepared by tomorrow. Okay- and that concludes our committee meeting, any old business or new business, no I see Elizabeth Rosa as her hand up maybe she's. Thank you. Will I thought it would be useful to communicate to the members of the public who are here? This was a vote of this committee. The resolution will next go to the full board meeting for Community Board 8, where it will be presented for the full board to vote upon it. So this was just the resolution of this committee and the next step would be for this resolution to be presented to the full board at its next full board meeting right and that date is December 15th. So please join us on Zoom. So the rest of the board can see that the community is fully involved in this and opposes it Wednesday December 16th. Oh sorry, it's a Wednesday! Okay! What's the 15th, oh I know what that is. Okay and just a reminder. The scoping session that'll be helpful for you all to attend, you'll, be getting information for that on December 15th and will am I correct, you're, going to put something up on the website for people. Yes and I put it in the chat earlier, but hang around in the meeting before leaving after it's closed because I'll put it back in the chat again one more time. Okay, you have a couple other hands up, I, don't know if you and I no I didn't see it. Okay, I was going into well wait a second now we're going back to the public and now we're back onto the board Michelle. Thank you. Yes, thank you. No I just wanted to add to the comment that the full board meeting is on December 1 6 on Wednesday, but I wanted to tell the public that they will have an opportunity to speak in the public session and it will be very helpful. Don't forget we're a small committee. There are 50 members of the board and we want to get as big an approval, well, opposition to the blood center and approval for this oppo. For this a disapproval, I should say we want all of the board members to understand the public's feeling about it and also they will not have had an opportunity to see the visuals. You will each in the public session, if you wish to speak, have about two minutes and if you would like to bring visuals within that two minute time or coordinate with others, so that each of you takes two minutes and discusses something different or shows some different chart. That would be a good idea, because the full board may not be fully apprised of the information that this committee received. So you need to sign up to speak and you have until 6:45 to do so, but the meeting starts at 6:30. when this zoom screen comes to you notifying you of the meeting when it's the full board, there is a little blurb on there that lets you sign in. So, if you wish to speak, you should do so and I urge the public to organize and take advantage of that public time and speak to the board as a whole. Thank you, Michelle very helpful, a leader. Thank you. Just about the full board meeting. The blood center will not be doing a presentation, so the full board won't have the opportunity to see that, and we also won't have the advantage of seeing what the prison, what the presenters worked so hard and effectively on showing this evening. Also, we don't have the luxury of time we've been in this meeting for two hours. We don't have two hours to devote to zoning, although certainly it will require ample time so bring what you want, and we will talk about it at to the extent possible. But this was a strong vote and there were a lot of people from the board here. So I do urge everyone, as always to come and attend the full board meeting and take your opportunity to speak. We may be doing straw polls there as well, because, unlike a full room where people can raise their hands- and you can see the extent of for or against it's impossible on zoom without some kind of either hand raising a straw or straw poll. So with that, thank you very much, Elaine and Elizabeth, and for all of the presenters and Anthony. Thank you and everyone else who worked hard for this. Thank you. Do we hear a move to adjourn? Yes, there's a motion to adjourn all those in favor. There were three public people if they could go in the chat room and raise their issues we'll respond that way. Okay, oh my apologies! Oh you know what can I just add. One thing: Elaine will just reminded me that last week there was the Mas meeting on zoning and a little bit on Ulerp and about the scoping session. That's on tape and available on YouTube will knock your head. Yeah will to YouTube so for the public who are unfamiliar with the scoping and unfamiliar with you, lerp I urge you to go back and look at that Mas meeting it was from a week ago, November 30th, right and see it or you could skim over it and see it, and it will give you a lot of information about the whole process and what's to come and what you should expect thanks. Thank you. Let's put the link in the chat for everybody, but you guys are adjourned. So thank you. Okay, we're journey meetings, adjourned.",
            "summary": "We found out about this meeting tonight, It will be up to you and the community board to make your voices heard at this step in the process, with your support or opposition, or with improvements with discretionary approval.\nYou're interested in event, you're, building or letting me know what you think of this project.\nThe blood center needs a new building, but rather than raise money for that, they've apparently sold their soul to a Boston developer long fellow real estate, partners, LLC and in the process they showed they don't give a rat's ass about this neighborhood.\nA new building that will give them actually more space than they say, they're, going to need, take in the Longfellow Tower, and also the new building which they could build within zoning would allow them to get almost triple the number of employees they currently have.\nThey were honest, which would have been nice and they looked at mid-block buildings, They would have seen that this proposed tower is about as out of place as a cat and a dog park.\nIn other words, It's about 25 feet short shorter than the blood tower, unlike the building across the street that they highlight states that they're going to cover the entire lot from 67 to 60.\nYou could imagine putting the 59th street mid block in a residential neighborhood, You'll know how just preposterous and crazy this project is, but it's not just the height and width of this building.\nAlso, the number of people going mid block every day, They say they're, Two thousand six hundred thirty people full-time employees every day which is twenty 2400 more than they current have and almost 2,000 more than the blood center could occupy if they built a building within the zoning.\nYou want to take out what's already there, it's probably the top tier, but the rest of it is all new people going mid, block.\nEvery day, If you want another way to compare it, the three closest buildings they talk about in their presentation, All along avenues are 770 units in three apartment, buildings, 129 stories, which would be the tallest residential building in the city, summer, studios, summer, one bedrooms.\nI'm told that St Catharines is the second most used park in the city based on size, so adding somewhere between 2,000 and 2,400 people across the street.\nBreast imaging center is on 66 between second and first plus, All the traffic coming off the 59th street bridge and up first Avenue that wants to go to the west side goes down.\nI am appearing as an attorney for the cooperative apartment building at 333 East 66th street, which is at the first day of toward the first Avenue end of 66th street, where the traffic comes and starts going.\nIt's probably that last item that the blood center highlighted most highly in their presentation last time, I, think incorrectly and inaccurately and misleadingly, but they are portraying themselves as being a great benefit to the community at large.\nThe proposed structure is grossly disproportionate to the surrounding structures, as Mr Bell indicated it's several times the size of what is the maximum permitted structure on the on this location and under the existing zoning and the neighboring properties are a lower rise and it would stand out ridiculously as compared to the surrounding buildings and not blend in any way with them, but they want to not just rezone to increase the size of the permissible building, but also they want a special permit to waive the mitigating setbacks that would reduce the shadows and other negative consequences of building a larger building, provide more light and air on the street.\nI thought it was interesting in the presentation last time that the representatives of the blood center were proposing that this would somehow create an inviting environment for the people walking by on the street.\nThe space to be occupied by the blood center in the proposed new tower is no bigger than the space that could be occupied in an as of right structure under the existing zoning.\nI haven't said we're working with this particular organization or this particular laboratory, and it would enhance our work if we were able to be in the same location and here's how they present it as a hypothetical that they would create a benefit by doing this, when, in fact, they're just going to rent out the space and if they don't get somebody who's who works well with them, they'll get somebody else, who'll pay the rent, or maybe they won't even come back into the space at all.\nIt's, a transverse across central park, people coming up first Avenue, who are trying to get around the traffic trying to get onto the 59th street.\nYes, people coming around trying to go up 66th street to get on to that transverse run into that traffic, exacerbating they're, going to reduce the number of parking spaces.\nOkay, yes, so I've been retained by 301 e 66th street to as a planner, I'm a planning, land use and zoning consultant.\nThe co-chair has a copy of it, so I would ask if she could distribute it to the email list of the other members of the Zoning committee, as well as other community board members that would be great I will keep it as concise as possible.\nThis will create a major precedent now when the Rab zone was adopted in 1985 on the Upper East side, this was done to protect the mid blocks very specifically because what had been happening, was.\nThis is again something I'm going to point to in a second right, now, in fact, Thank you very much.\nBasically, The city is divided into zoning districts, each with its own set of bulk and use regulations, and the blood center is asking for changes to the district designation of their property so as to allow both use and bulk, which is to say size not normally permitted in a residential, Neighborhood.\nAnd I think that the kinds of requests that they are making rezoning of their site, rezoning of the 200,100 feet on either side of second Avenue to a slightly different zone by the way, and then based on that a zoning text amendment to allow by special permit not to allow everyone but to allow by special permit other significant changes in terms of height, setback, use.\nThis just reinforces kind of that shot, hills and valleys between the avenues and the mid block and shows what the proposed blood center building will look like on the south side, elevation of 67th street and then on 66th street.\nIn fact it's under built, they could do a little bit more, and this project would really I think set a precedent for every mid block on the Upper East side and just do a lot of damage in the precedent that it would set here, Basically, commercial, tenants and I'll turn it over to George to keep going here.\nThe proposed blood center tower is absolutely enormous and in fact it does compare to one Vanderbilt 10 Hudson yards, one Bryant Park, Freedom, Tower Empire state Building, And we're comparing the size of the floor plate here with these commercial towers and in fact it is much more like the commercial towers, and it is a property side.\nYou know it's tempting to use the zoning resolution to subsidize important organizations, but that's not how we should be making land use decisions.\nAll the space, as has been said, The blood center needs can be built as of right on their site right now, and if the city wants to build up this industry, it should, but it should focus in on the sites that it already as I identified, that the EDC is already identified and built in places where this use and mass is appropriate.\nEntry of the building due to the blood center vehicles parked in front and all over 67th street.\nWe are very much against this proposal and we do not want the blood bank to expand to be rezoned, and we do agree that it sets a dangerous precedent for the entire neighborhood.\nOkay, Thank you for coming through zoom to a meeting about a very important zoning issue that faces our community the next steps and will help with some of this.\nThat's, how you'll get called on by the co-chairs to be unmuted and speak, and then next you'll see a green check, mark Box. I also believe that we're also going to set a timer for each speaker is that right, Elaine and Elizabeth, yes.\nI, Don't think it's not contextual, I think in many ways the fact that it's a mid-block building is again something of a red herring and finally, I think we really need to move the discussion away from traffic.\nAs Rosie mentioned earlier in 1985 Helena Rosenthal, representing friends of the Upper East side, Jeannie Rice, representing sabotage and I, representing his 79th Street Neighborhood Association met with the city planning, commissioner, because two buildings that really should have been landmarked were being torn down in the low 70s, and we were seeing then that we were going to be losing an awful lot of other buildings that are in the mid blocks.\nAs someone said, We didn't have any problem for a long time, but we did have a problem with 75th street a few years ago, where the there was a effort to try to go against the zoning, and we were able to stop that.\nWhat's going to happen to the avenues, we don't have the elected officials who understand the importance of protecting the density and the efforts that we have to make to keep our neighborhood usable and good, and all those other points were very well made.\nAs, someone who has taught many classes in the buildings that face south anybody who lives in an apartment in New, York City knows what a different sunlight makes in your mood and the way you perceive your day and just the general feeling of getting up in the morning that building across the street would deprive the Julia Richmond Complex of all of its light for its entire day, and it would be a gloom of darkness cast upon it.\nPrincipal Doyle made all of the important points about the traffic on the block and how the building would affect Julie Richmond as well.\nBut I would just point out one last thing: when you come up 67th street from first Avenue or coming down from second avenue, It is a public block.\nIt would no longer be residential, there's a point for mid-block zoning to keep residential neighborhoods residential and not turn them into financial centers, and this block would lose all of its character with that building looming over it.\nThe best thing that you can do is reach out to all the elected officials in the community, as well as the borough president, the mayor and meet with them or ask to by zoom, but send letters and emails voicing your position.\nYes, okay, one of the things I want to talk about is that the blood bank who says they want to be a good neighbor, is doing just the opposite.\nHi I just wanted to add a couple of points about the traffic I know, they've discussed it, but I actually wondered how the ambulances in this area that we live in have so many hospitals how those feeder streets that will now be more congested would affect.\nAnd I, really thank community board 8 for organizing this meeting and for allowing the public comment.\nHi I am a resident at 315, East, 68th street and I've been in the building for 15 years.\nWhat I want to ask is the timeline for stopping this and really what we're going to do, because I feel like we need a focused, organized effort.\nI've been I've, lived at 315 east 68th street for over 25 years, But the point I want to make, which I'm not sure has been emphasized, is that the New York Blood Center calls itself a not-for-profit.\nFirst I just wanted to thank the community board for hosting the event and allowing the public comment.\nWe are part of the community Board 8 catchment area, but we are further north, but nevertheless, Carnegie hill neighbors is very concerned about zoning issues and adherence to zoning in the Upper East side.\nThere are alternate sites in the city and George pointed to one I believe in east Harlem at 126th street, which might fit the bill, So there are alternatives.\nA board member and resident at 333 East, 68th, street.\nThink there are a couple of people right in the community that can help you with that, and you've got some buildings now already organizing, so I would unite with them and move to reach out again to the elected officials to tell them, and it might also be helpful to reach out to the blood center and raise the concerns on the issue.\nI mean letters are great, and all of this is good and it's all going to help them, but we need somebody who that actually does this for a living and knows how to fight it.\nThere's a lot of people here that are willing to put in the time and the effort, so I hope the community board will listen to us and represent us the way we expect them.\nThank you just a second, I, okay, I, appreciate that and hear your frustration, and you have to know that the community board is there to listen to the community and take some leadership, and so we'll be working.\nWe move into the Committee Board Committee to discuss what we've heard tonight, We would like to take a poll of those who are attending who are public part of the public meeting, How many are opposed to the blood Center Longfellow Project, Will I would say, let's say if you're a pose click, no, if you're in favor of the project as it was presented previously, clicked.\nYou willing to take that in the chat for those people who want to share, because I know you can't just send out everybody's emails and telephone numbers, so is that a system that'll work for the moment.\nYou have friends, If you have relatives all over the city reach out to them and get them to talk about the zoning, because that's very important from the community board's point of view.\nAnd I just want to say now that I hope that we end up with a very strong firm resolution out of tonight's meeting and also any information that you can circulate to all of us about how to participate in the December 15 scoping project would be terrific, will whoever you can send that out to the whole board and the public, because for the public, that's the next step, and so that's very important.\nThe proposal for the zoning changes requested by the blood center.\nThis puts R8 zoning at risk throughout the community, board, eight, as well as other parts of the city that currently have r8b zoning, and we know that the blood center can achieve their needs within and as of right.\nThat reminds me, and I'm only going to speak to more endemic problems to the last public speaker, The community board you're preaching to the choir you're preaching to the choir, beg our council members.\nThat's the real point to be made to the elected officials in this process is better information, more power to the community boards and the public to have land use decisions put in their hands.\nThe last time there weren't enough people to have a solid rejection of the blood center's proposal on zoning grounds, and it would have weakened the board, weaken the public to have a half-hearted attack on this and approach.\nSecond, This is in my personal position, which is that there is a rash of not-for-profits around the community, board, 8 and the city as a whole, claiming that, because they work in the public interest, they're entitled to change the zoning, Whichever way they want to.\nI want to thank Anthony again for another great presentation of what is going to be done to the neighborhood.\nYou know, as friends of the Upper East side indicated, it took 20 years to get a change in zoning to protect residential blocks.\nThere is no public policy need for the blood center to do this, for anybody on the mid block to do this and for those who you know, don't think this affects them because they're not on that street.\nBut if I did, what you wanted me to do, I would have to support every community board in the city.\nWhat I am saying to you is: If you feel as strongly about zoning as I do, and everybody else does, We can take an example for from a Betty Wallistein at East, 79th street and people did when they fought for the Rb Rab to begin with, including Elaine, Walsh and others and Elizabeth Ashby, And if we have to, we will have to take to the streets, because people need to know that you want to protect your community.\nOkay, so the vote is I, think there's 15 or 16 board members there.\nThere are 50 members of the board and we want to get as big an approval, well, opposition to the blood center and approval for this oppo."
        }
    }
}