{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCZTORb4YjfIViniY-ldS1Fg",
            "title": "Housing/ Land Use Committee Meeting",
            "publishDate": "2020-05-22",
            "shortDescription": "Manhattan Community Board 10 Housing/ Land Use Committee Meeting"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 1,
            "um": 10
        },
        "wordCountFullTranscript": {
            "people": 65,
            "tenants": 43,
            "housing": 39,
            "rent": 38,
            "office": 35,
            "lot": 35,
            "community": 35,
            "things": 34,
            "landlords": 31,
            "information": 26
        },
        "wordCountSummary": {
            "people": 13,
            "community": 11,
            "lot": 10,
            "things": 5,
            "tenants": 5,
            "terms": 5,
            "business": 5,
            "rent": 5,
            "landlords": 5,
            "bill": 5
        },
        "fullTranscript": "Hello, come on jump all with a telephone number ending on one noun 1. Yes, that's Jackie ball Jackie! What's your last name ba o L Jackie, let me ask you a question Jackie. How did you join the Corps? Did you join from the link through email link, no I'm using the landline okay? One second Jackie will be with you shortly. Thank you. Hey miss Gill, okay, so it asked me because I have an account with the new school, so they asked me to sign in Oh. Chop saws are unknown. Okay, you had to do you had to do it again. Yeah you have to manually input the password mm-hmm. Okay, let me let me quote: you Michaela transcriber hold on all right. Mccoy you've got one enough. Okay, that's getting worse in terms of privatization and private developers. Building on you know what was formerly Knight your development sites. Anybody have any comments on because we were going to do that. Nothing to do business, but maybe we can just take advantage and I see that our senator Benjamin is joining us and then we'll go right to him any comments, or maybe we can send the Benjamin. We could segue to you. We were just talking while we were waiting for you to come on about the circumstances in NYCHA, where the recent reports, the article today or yesterday, talks about the disproportionate impact, the number of persons who have died and gotten sick in our nitro developments, while that's not directly what you're going to be speaking on this or any comment on that from video versus on the call. Absolutely so, I have been talking very actively with the governor's office about expanding the amount of testing that is occurring at Nitra right now. There is some testing happen in Washington Heights houses on the east side. We need that expanded dramatically. You know, I have the most Nitra of any senator in the state, and so this is a very important topic, so that conversation is in the works. Also, you know, we've got to be talking more about how we're going to be implementing the mayor's plan of having those who are asymptomatic being at hotels, as many of us know, and a lot of our nitro developments. You have you know six. Seven, eight people in a two-bedroom apartment social distancing, is very difficult when you have a small footprint and more people, and so that is something that working with the mayor's office. I, don't know how much you deal with Stacey Lynch in the mayor's office, but she's been doing a really good job of helping to make sure that Harlem has the right access in the mayor's office to work that issue, so I am I, am actively involved. In that conversation, trying to do two things, one increase the amount of spacing to be those who are Cove and impacted in NYCHA, and also making sure that folks, who are asymptomatic, get into hotels. Don't you thank you. Go ahead, Stanley, hi, Brian! How you doing! Thank you. Is there anything that your office, or is there collaboration with all the other ele elected officials, about the how many people in our community are getting the work catching it in comparison to the other to the other communities? And many proportion is a real disproportionate number in our communities, and this like? Is there any? What's being done? Trying to get information? I got some recent information saying that we 30-something folks in Central, Harlem I, don't know how to value a that's right, I'm wrong, we're not getting official data from the state of the city. We have been pushing on the mayor to provide more targeted data. We do have general data about blacks, Latinos areas. You know we are not as being and we're not impacted as harshly at the Bronx is being impacted in parts of Queens, so Manhattan in general is doing better. Harlem is doing Harlem in East Harlem in particular, are doing worst in Manhattan and generally put better than other minority black and Latinos, and black and brown folks in other parts of the city. So we're trying to get that data. It's not easy and pushing on the mayor's office to do that. I wish I had a better answers for taking this step further. What why do you think it is tick? Why is it hard to get the data? No, why do you think that the proliferation is more in our black and Latino community than the other part of the city, I, think I think black and brown folks tend to be essential workers at a wave, higher clip and then to anyone else, so we're out more to particularly look at Nitra, where there's a lot of concern about the spread public housing where you have where it's hard to socially distance right. You know there are a number of folks who were asymptomatic and was sent back home wet found out. They had Koba 19 and was sent home because their symptoms weren't serious enough to acquire a hospital bed. Now, if you come back to a home, that's you know. 2,000 square feet is very different. If you come back to a home, that's 500! You know those are some of the issues that we're dealing with. When you talk about urban density, which is what we have we're very close, I have one of I have one of the most dense state Senate districts in the state. There's some. There are some members of state where it takes. You know three hours to do Traverse their whole district, whereas this in my 10 to 15 minutes right. So it's so that's part of what part of some of the issues on that is. Family I just want to say that we can share some information. The greater Harlan Chamber of Commerce has a very active Health. Committee who's been dealing with our Health Committee, and you know when you talk about Doctor, John Palmer and you know, and Leon Merrick and a number of other physicians and NBK rigs they meet weekly. So maybe we can tie you into some of those discussions because they've been talking about the actual reasons. Why there's been a disproportional impact on people of color? You know for the kolben, 19 and they're working diligently on that with ebony Carrington and all of the other. You know medical professionals, so those calls are happening weekly so will plug you into that and by the way, there's a myth out there that somehow black and brown people, particularly blacks, are socially distancing less than other people. It's not true. Whites are not socially tested thing either. I think there is, but there's definitely a public education campaign across the board, but when you combine the lack of social distancing, the lack of mass and very dense areas that that's a that's a match, that's that gets really serious. You also take it heat and we know women and when and if we can do you feel that we're doing it as much as we should or it could be more, what could be more, what more social distancing more watching ourselves do? You know I think we should, but you know, look I, don't believe in I'm, not like you know, I've been very active against the NYPD, enforcing social distancing and putting people in jail and doing all that I think I think you know we, you know, there's a lot of cure violence and faith-based groups who should be getting funded right now. The city at the bare minimum has a ten million dollar campaign, one tip on communication outreach strategies and I and I keep trying to find out where the money is going. Okay, you know I, don't know of any groups- community groups on the ground that, if you're receiving any of this money- and it's and it's just disturbing I- mean it anyway- that's 11 I, don't want to get off track, but so senator Benjamin I know your time is limited. I wanted to do a couple of things. Janelle Washington put a good point into the group chat and please many board members put your names into that. That's our attendance sheet for this evening, but the suggestion was that you know we introduced some of our new board members. You know, oh I, see that you know we have who have joined us. I know: Marcus Wilson, you know is a new member. You know who is joy. I also see Terry wisdom, you know, has joined us. Omar arias, you know, has joined as make sure you put your name into the group chat. Are there any other new board members that I did not now just mention, so we have a few people, senator Benjamin, that you asked me to invite to this meeting. I know we have Donnell known as Donald. Thank you so much for joining this zoom call. We have Curtis Archer and Kenny Mars and I'm sure that there are others. You know who may have come on so I just really wanted to be attentive to your time and that particular message relating to housing that you know the work that is happening up in the Senate and the assembly, and so why? Don't you just go ahead and share with us? Please sure I wanted. First of all, thank you, brother Powell and everyone on the phone. I'm. Sorry on the zoom for being here. I just wanted to you know, as we've been first of all, I have a former chair of land juice that I do feel that if there's any at any time that you or Stanley want me to be present for a conversation, I'm happy to do it as long as the schedule allows for it, but one of the things I just wanted to be because I know, there's a lot of conversation and there's a lot of things happen. The media is going to be very clear on sort of what I see as the things that are the case as a relation to rent and sort of where I see someone's going just to just to sort of put that out there number one as we stand. Presently there is a eviction moratorium, which means that no cases no rental addictions can occur between now and June 20th, so between now and June 20th. If anyone is experiencing a landlord trying to evict them, it is not permitted by state executive order. The governor put in a new executive order that basically said from June 21st to August 20th. So, for two months past the June 20th date there could be no evictions for anything that is called the 19 related. So issues that are not tied to Coba 19 will be able to commence. Certain arms question becomes what is the definition of koban 19 yeah we are. We are the courts, have discretion in this in deciding that, so maybe you might want to talk to judge Milton, tingling or some other folks who might be sort of aware of what the sort of mindset is, but I think it's very important that people are not confused about what exactly the period is. I know there have been a number of folks who have been pushing like the canceled rent movement, and some people are thinking that is law or that somehow, because some people have said it, that's a that's, but that's them. If you can do you do that at your own risk right now, the only thing that is permitted is not permitted as an eviction, but a landlord can still hold people accountable for back rent. Now what we have been working on in this in the and the state? I'm, probably part of a working group house, the work group that has been focusing on this is trying to come up with some rules of the road for when we get to that point, and so it's get to the point where evictions are then permitted and some of the things we were looking at is trying to define what a Copa 19 hardship is. There's some various thoughts on that. You know once income previous income present income, how they've been impacted, you know, medical bills, etc. There we've been trying to figure out how to do that. I think what we're gonna end up doing, and you know don't quote me but I- think what we end up doing is probably tasking some agency to sort of help provide guidelines that could move over time depending upon what's going on. Secondly, you know we are looking at how do you deal with extension of residential leases? How do you deal with determination of residential leases? You know there's some folks who are like you know what I would like to leave and they're having a hard time getting out of their leases, though they're copa90 and impacted they might have lost some roommates or they just lost their job. They don't it'll, see that coming back anytime soon, so you know we want to be mindful of that and try to have laws in place. For that you know how do we do with tax liens? You know one of the things that many of us are concerned about is that this somehow can become a period where you know if you're an owner of an HDFC unit or what have you can get caught up in tax lien issues and then all of a sudden, someone else owns the property. We don't want that to happen, and so we want to make sure that any moratoriums include thoughts around tax foreclosure, sale of tax liens and all that to protect homeownership, which is which doesn't get as much attention as rent rental units do, but isn't a very important part of the Harlem story. We want to make sure that is, that is in the conversation as well, and then. Lastly, we believe very strongly that we need to get federal assistance. You know the Senate Republicans are in playing games about. Oh, we don't want to support the states and we don't want to bail them out and all these other things, it's important to note that New York State provides every year 30 plus billion dollars more than New York State gets back. So if any, if anything, New York State has been historically bailing out the rest of the country and given the crisis as impact in New, York City, particularly so harshly I, don't think it's unreasonable to ask for the federal government to be there to assist with any with emergency rental assistance for those who have been impacted by this crisis, and so I just wanted to kind of lay that out there I'm happy to answer any questions or receive any thoughts or inputs that we should consider I. We are going to go back to session next week, the state Senate we will be in session next week and it's our intention to do some meaningful things around rent in particular. That will help provide some clarity for residents in New, York State, and so that's what I just wanted to kind of bring to you and answer any questions Benjamin. If we have some few questions that have been put on and there's even a question for you resorting Nitra when you were making your presentation, but in our conversations you had talked about, you know the issues that I know that we had donal notice and Kenny Morrison and even Curtis are to come on the call, and that is what's happening with you know these affordable multifamily. You know projects often as mine is run by not-for-profits. Well, you know that are struggling around. Can you offer anything and then I'd like to hear from either Donald and Kenny as to what you guys have been experiencing, especially you Donald from West Harlem group assistance organization in terms of the struggles of when tenants aren't painting rent there? Is that domino as to what happens with you know, landlords were trying to maintain these affordable housing projects on race, ATS and budgets, and they're really wholly dependent on. You know that rental income for their operating expenses and to pay their bills that haven't stopped coming so I think the comments on that. You know absolutely, and you know you know there are not all landlords are the same and I think there's we run the risk of causing having a lot of unintended consequences in our community. If we, if we treat all landlords the same, we've got a number of small, smaller landlords, nonprofit landlords who are doing the right things. And if and if we create a situation, that's untenable for them, then they will end up being taken over by vulture landlords and the like, and so that's an important part of the conversation, which is. Why is one of the big reasons why we believe that was important to define copan 1900? The people were getting help with those who have been directly impacted, and you know thinking about issues like you know, making sure that we look at property taxes and if there are developments that have a lot of impacted tenants, we should try to smooth out some of their expenses at least as it relates to especially they have to give to the city in terms of property, taxes, utilities and others so that they can sort of, maintain and manage I'm an oil and our communities. I know donal notice, I see them on the phone higher from our community and they and that's all done based upon the rental payments that they get coming in. So we've got to make sure that there's a balance here and that we protect the renter and the responsible landlord at the same time and that's what we're trying to do so. Can we talk to Donald notice? Can we hear from you and Kenny Mars, and can we hear from you regarding? What's what do senator just reported on tell us a little bit about what's happening with your portfolio good evening? Everybody. What are you good to see? Everybody, especially you Stanley, good, to see you brother and senator for coming on and everything that you do for the community so for West Harlem. We we've experienced some covert 19 issues. We put out a survey about a month ago because one of our projects on Randolph houses was experienced in a lot of co19 related issue, as it relates to the virus and people passing away, and we wanted to look to see if it was. You know our agency wide portfolio, so we put out a survey and we got back a quite few other surveys and one of the things we touch base on was covert 19 issues. What is sick, have they been infected? You know, has anybody passed away and we talk about the unemployment issue and have they lost their jobs or they? You know looking for section-8 and what other problems they have and with paying rent? And we talked about the food in securities and in our community. So we got most of the surveys back I want to report 76% of the tenants that responded said that they lost their jobs, so high percentage of tenants that lost their jobs, but the tenants are continued on a residential side is continuing to pay rent, so we're not getting a drop water. One of the questions that we asked if they would be able to continue to pay the rent or do they want a subsidy and some of them must have had you know, savings or something like that. So we are experienced in a decent amount of collection on the residential side. I think our problem is on the commercial side, where over 95% of our commercial tenants were shut down. 102 restaurants, that was just doing takeout, but all the rest of the commercial portfolio was shut down and we're getting almost zero collection. On the commercial side, we've been working with those commercial tenants to apply for the northern Manhattan grant that was available for Hamilton Heights and we've been working with them to get PPP applications done, but that's where I think for the most part, when collection, decent I, think is going to copy, have a problem in June but April May. The collection is pretty good and there was, you know, probably attributed to the stimulus package $1,200 that you know that residents were getting, they was they don't paying their rent. We do have a lot of the food insecurities that we've been working with families on that we have a relationship with the greater chamber and we could fool over to them for their residence and we've been servicing in our food pantry. Well then, it's Avenue. We was up to about 5,000 people a month before covert happened, we're doing 7,000 people a week now since Hoagland so but we're getting a tremendous amount of contributions from all of our food. You know vendors and partners and we're able to distribute out at the pantry and we're doing a lot of pop-up pantries we're doing one. We just did one today at Randolph houses and we're working with Inez Dickens. Then we're gonna do one at Lincoln and we're doing one that drew Hamilton and we're gonna do a lot more within the Harlem community, because we're getting a lot of foods for more of our different vendors. But that's the update on what's all assistance. Okay, so we have a couple of questions. I know a few should not watch and didn't, has put questions and so now get you know. I see you have a few of them. Why don't we start with one or two of your questions before we turn to Kenny Morrison and if we still have Curtis Archer on the line, so go ahead? So now, can you okay? So one of my questions for senator Benjamin is that there was a hearing that took place two days ago on the effects of kovat on minority communities. So is there a list of organizations that you brought to that hearing so that they can hear what we are experiencing here in Harlem I will get you the list on the Senate? That's the same. I'll get you the entire list. That would, though, that we had. Yes, there were no. There are a number of groups that work there or on that list that I provide. So just so you understand the way how it works is we provide. We provide options to the to the state and the assembly and those and they and they sort of work with them to try to figure out who can join. But yes, I invited the n-double-a-cp I invited a number of other groups, but I have I. Don't have the list in front of me right and the only reason why I'm asking is, because you mentioned the NYCHA issue and I heard them mention that they were work. A few electeds mentioned that cure violence will be one of the directions to go in terms of social distancing within nature, and you know certain communities is that the direction that they're going and is that? Does that mean that there will be money's allocated to those organizations under that umbrella to do that work? So that's what I would like to have. What the mayor has said thus far is that the NYPD is not going to be engaging in any social distancing. Arrests I've been a threat to public safety. Now they haven't, they have increased amount of ambassador state that they had so they're using some of the school safety agents or some of the folks who are city workers who are not working right now to help with social distancing. My understanding is that they're working with cure violence, groups and in crisis management groups sort of faith-based groups on that working on coming up with a plan that they could agree on. I believe that those people, those groups should be funded. If that's going to happen, not want that to happen, but - things that they're working with the various of pure violence groups on a on a Memorandum of Understanding, okay, cuz I, don't know you know why I add cause I, think that would be a great idea. Only we here in the CB 10 district. We only have one site so I, don't know if that's a conversation to expand street-corner resources or how that work. So that's why I asked because I they should use cure violence for social distancing, though Curacao street-corner resources is part of the coalition that is working. That is, you know, negotiating with the city on this issue, so Aisha hasn't called me to say that something is not it's not moving forward in a way that is helpful. You know I, just I agree with you entirely on this I think that you know we have I did a letter. A week and a half ago we had like 45 legislators, sided calling on the mayor and the police commissioner to take the NYPD out of social distancing and use the Cure violence and faith-based groups in the community, who are already doing a lot of that working and have trust in the community. So I agree entirely, and you know I'm hoping that the mayor does the right thing on this. If there's some legislation or something that comes out, could you let us know so that we can like do our part and saying we support or vote on that? Please absolutely so great question should now so I wanted to you know. I know there's some time management things for some people, Kenny Morrison. You know going back to you again, not only before even your development, you know experiences recently. You've also done a lot of property management. Can you give us a sense of what those strains are and it Donal notice spoke about whether on the residential or commercial sign? Sure, first of all good evening to everyone so out of the about a thousand units that we managed from say: 120th Street up to I'm in 47th Street in Central, Harlem I'll give you some data in March we've collected about 95% of our rents, which is pretty much the norm in April that dropped down to seventy two point: four percent and we're looking at the make elections we expected to be about the same I think we may get around to seventy-five percent as far as our commercial tenants out of there, maybe 16 or 17 commercial tenants that we have, and we have very small commercial tenants anywhere from 40 square feet up to 1500 square feet, barbershop beautisol on folks who I'm from the community only about 25% of them are paying rent. They were non-essential businesses for the most part, so they've really been struggling. I've talked to a few of them, they've applied for the PPP, some have not received yet some have you know we're gonna work, something out with them when they get back to business when they open back up so I have individual conversations with them. Out of my portfolio as of the day, we've lost seven, our seven of our tenants, - took over nineteen. Three was senior citizen, yes, so we've also done like Donald has done, but we were a little bit later in the process. We sent out a survey also, but our survey just really went out towards the end of last month, so we haven't received a lot of data back yet, but basically we asked the same questions. Are you unemployed? Are you someone in your house been affected with COBIT? Do you had coal bit? What can we do to help? I do have a social of mine, a friend of mine worked for unemployment, so, as tenants call me and tell me, they haven't, received the unemployment benefits I'm connecting and connecting them with him. So those are some of the things we've done. We've also had some conversations with asset management at HPD to discuss a section-8 certificates and the FEPs program. They didn't really have any guidance on the FEPs program, but around such me they said that there will be some certificates, but it's probably gonna go to those developments that need it, the most so yeah so yeah. That's where we are. You know we're looking to see what things look like towards the end of May and we'll take it from there. I think Thank, You Kenny, you know so I know that we've been having greater Harlem Chamber of Commerce and greater Harlem housing development have been having conversations with the with HPD on those section, 8 vouchers, - and asking them to liberalize. You know the eligibility for that and that lends itself to. We also have been talking about with you know, with representatives from the federal government that conversation with a former HPD Commissioner Shaun Donovan who's, now working back in the city, and he says that in Kerr's, 2.1 shelter solution grants, you know for our residents, so I would hope. Senator Benjamin that you can give us more guidance and S&L says you know we certainly need to be guided by all of you who, on this call and give us some thoughts about what you think our housing and land-use committee should be resolving. What position should we be taking on things in order to you complement the work that's being done by us on the ground, but also you and those legislative bodies? So Curtis, are you still with us? Yes, I am so I know you had some constraints in terms of your time on you know. What would you like to share with us? I mean I, certainly know we all have been reading Lloyd, we ingested a article in a and we talked about what's going to be happening on 120 fish Street in terms of our businesses and, of course that impacts you know what's happening with housing development you know as well. So what can you share from the stateside since you are representing from Empire State, Development Corporation? Thank you and thank you everyone for having me. As you know, Harlan CDC had actually underwent a pivot, so in terms of our directing involvement with the housing development, we no longer do that, but with a couple of the guys on the call from Kenny to Donald, one of the programs that we still participate in quite heavily, as you know, is the weatherization assistance program and we've actually done a couple of their buildings that they have in their portfolio as well as last year. We also embarked on doing some weatherization assistance in NYCHA properties and that leaders say it's been a challenge because, and the senator will know sometimes large bureaucracies can be a little bit complicated and being able to move stuff forward. So we they'll continue to be involved with that aspect of the residential portion of the weatherization assistance program. On the other front, as you know, two properties that we have on along 125th Street had ceased their redevelopment, one of them, of course, being the Victoria theater, which we had anticipated that it would be completed by fourth quarter. That may not necessarily be the case because of Kovan 19. In addition, there had been a stoppage of work at the National Urban League center project and that one - we're waiting for both of them to come back online so that the working well finished with the Victoria and in commenced in earnest with the National Urban League project and Senator. You should assure aware of the decommissioned prison on one hundred and tenth okay, and so we certainly know that. That's also one where the expected RF RFP had gone through some certain iterations and has not yet ready for release, but we're looking at that also to happen sometime in the fourth quarter this year, God willing, right now, all of our small business resources in terms of working with small businesses are now remote through WebEx and zoom, and that's how we're getting out the information about the available resources that the small business community can tap in to do right now, the one that is actually in operation is the stuff coming through the SBA or the feds from the PPP to also the disaster loan a program, those that right now are the only two things that are available through small business assistance. We're hoping and I've got to say this that I have to stay behind what my boss, the governor, is gonna, come out with, but we're hoping that also Empire State will come on board in terms of actually putting out some of their own initiatives, but this is also very contingent upon the federal government coming through with some funds, because you may expect us to do stuff, but right now in any of these particular relief packages that come through, there has not been any assistance for the states. Yet all right. So thank you for that. You know Curtis I know we have a question for you, Kenny from Chanel Washington and she asked within comes lost and possibly many won't return back to work, I'm interested in mr. Morrison's opinions and concerns, as tennis call for canceled rent your. So you know, of course, as a property manager and as a landlord you know, canceled rent is not know something that here we look forward to, but I understand what the residents are going through and that's why we? You know we take this as a one on one or one by one case-by-case situation. Some of our residents have reached out to us as soon as they've lost their positions and say: hey: what can you do or what can I do or you can you discount the rent and we've told them that we're going to? We will be willing to work with them on a one on one basis, but we need to know when things get things start to turn around. So we know what we're dealing with. We don't want to just arbitrarily say no, you have to pay right now you could pay forty percent you're right. We've been asking tenants to do as if they can pay a small amount, whether it's $200 a month, one hundred fifty dollars a month just to pay something because, unfortunately, our bills do not stop. You know these are for. With most of these, my properties are affordable. Housing they've run in very low margins. So you know, any loss of rent can be a detriment to the portfolio. So, but you know we look forward to getting to a point where we can work with the tenants one one-on-one and like I said: if there are resources, you know, I've been on a lot of zoom calls with various officials looking and hoping that there's gonna be some support from the federal government residents and as soon as that happens, you know, I would love to be the connect to my residence. So that's the way. That's where I want to approach it. So thank you can as well that you know we are. You know, I know the governor's finding are. We are all we're pushing our delegation hard. You know a congressional delegation hard to try to get bring that money home in form of some kind of koban, 19 rental voucher, to sort of help, people who have been impacted so that so that people can pay their rent and on all their other bills that they have, and so that's a part of what we've been pushing for as well so I see we have the benefit going to where you just winced under the bench, Michelle Booker from congressman s Fiats office Michelle. Can you just chime in on what the congressman has been working on and that's going to bring some much-needed believe as Janelle is asking directly to tenants who are losing their jobs, so it's prevent their eviction. Ultimately, you know- and you know also for the relief that we need for landlords who many of them are those small business owners as well, especially not-for-profits Michelle. Can you weigh in on that? Are you there Michelle I, see you, but I don't hear you so, while we're waiting on Michelle I also see we have the pleasure Rafael from our councilman's office, you know who has joined us. Rafael you've been listening intently, anything that you want to add in terms of you guys on the ground as the councilman in terms of what's happening or not happening with City Hall these days regarding these housing relief necessities, I have to tell you that there's nothing that I have heard in that regard, but I believe that there is mostly something that is being planned in order to assist the tenants that I might be in trouble in paying those rains so I'm unable to give you exact information in that regard. Yeah I didn't able to see myself here. So you know I'm unable to do that. I think that listening to the news and a lot of things are coming from Washington DC as to how the city, not necessarily in your city but throughout the United States, they will be help from Washington DC, so I assume that the congressman it's but yes office. You probably have a more solid or information in that regard. Okay, thank you are feeling me we're very interested in hearing from your office as to what, if anything, the City Council is planning and proposing to deal with. You know this rental crisis, especially as it relates to our multifamily, affordable housing projects, which everyone agrees is in crisis because of what Donald and Ken Kenny, Morrison and others have mentioned. So I see that we also have another. You know representative I'm, just looking to see if that person is still with us Michele. Are you still there or not so I'm, just gonna open it up now for any I seen senator Benjamin from Marcus Wilson? Will there be an open street first of all, I agree with that entirely. It's been something that I've been pushing for the mayor on I. Think I saw they'll. See me a Glover from the public advocate's office did I say if I did I don't know if she has any information on that from his office, but that is something that is an important issue and we need to make sure that it's going on I will I will come back to you. What I answer a better answer than the one I just gave Charles, but it's something that I think is important and we and we got it. We've got to make sure we do, particularly as it gets it's warmer about the fact that in a lot of folks at night you don't have air-conditioning, adequate air conditioning- and this is this is this: is you know we're going to have a lot of activity on the street, so I want to make sure that we have a adequate air but then also adequate screen exposure for people which includes open streets, more of the streets of town, hello, yo, hey Charles, this is I'm Sikh I can speak to them. I can speak to some of the open streets. I just got a list that I'm gonna forward to the board. I'm, probably tomorrow, for some of the streets that have been opened up in our community, so I have 100 and 17th Street between Morningside Avenue and 5th Avenue. That's every day between 8 a.m. to 8 p.m. and the 28th precent will manage that Street and we have a hundred and thirty eighth Street between Linux Avenue and Adam Clayton pallava Boulevard on that's also every day 8 a.m. to 8 p.m. 30 second preset we'll manage on that Street closing. Then we have Charles young playground, 143rd Street between Mountain Boulevard and Fifth Avenue. That's also every day, 8 a.m. to 8 p.m. 30 second preset we'll manage Morningside Park area around Morningside Avenue between Manhattan Avenue and then 116th Street. That's also every day 8 a.m. to 8 p.m. and the 28th precent will manage and the last arm street is Edgecombe. Avenue from 145th Street to 155th, Street and I will send this list out to the board members. Thank you for teeth. No problem. Take that first one you mentioned, did you say between Morningside a fifth, the first one is 100 and 17th Street, which is a Morning Sun Fifth Avenue? Yes, that whole strips are going aside. Yes, 117 dream one inside at Fifth, Avenue one block; no, that's not in the block! That's what a lot of blood! This is cordell vegan! That's a lot of blocks! Yeah I, don't know yeah I'm, sorry more than one block I'm! Sorry, one inside of Fifth Avenue yeah, that's a bunch of blocks! What about 114? Did they put that in there? No mention of 114 about 117th, 138, 143 and 116th, and then one and then I'm on the phone, so I don't know when, but the 114th was mentioned in one of the earlier updates from the mayor's office. You know: hey Charles, hello. If anyone has any recommendations about streets or you have issues with any of the streets that would name, you can email it to me and then I'll send it in to our liaison at the mayor's office. I'll drop my email in the chat for everyone. They should. Can you say that to my office's as well, so we can amplify as well. You know send it to them, but also my office. If you don't sure no problem, can we just go now to Dell senior Glover because she does where our she's also remember the Housing Committee Land, Use Committee, but she's? Also representative of the public advocate's office and I. Think the senator segue to you terms of what the public advocate is planning on this housing crisis. Actually I'm, not the representative from the public advocate's office. That's our borough advocate Phil Ellison, but I'm happy to speak. We talked a little bit ago about I, wasn't prepared to do this I we spoke a little bit of ago when I came on sorry I was late about canceled rent. The Public Advocate absolutely supports that and there's ways that it could be done. You can you know as far as the mortgages you can put it on the back end or something we continue our work with these in NYCHA housing. My position is deputy public advocate for housing, equity and I. Do all things. Housing, I also do senior issues and food insecurities one of the things that we have coming up next week on the 28th in the evening at 6 o'clock, we're doing a legal clinic, a housing legal clinic with legal services, organizations that includes Legal, Aid, Society, take group justice, legal services, New York and mobilization for justice, and we will be giving information and even one-on-one questions from tenants and we're going to do breakout rooms on zoom' for tenants who are Nyjah, rent, regulated, mitchell-lama and HUD. So if you can I'll send some information to strategic an send the information on to your contacts, it's gonna be a very important conversation. They'll see you. Thank you. I know that Senator Benjamin has to hop off so just wanted to say on behalf of housing and land using our entire boy, Thank You senator Benjamin. For joining this call. Thank you for inviting me. Okay, so I see you still don't have I'm just gonna open it up. I'm, not I. Was here Michelle, yes, hello, okay, thank you. We've been trying to go to you know. The subject was as reporting out. Many people have talked about the importance of what's going to be happening in Congress, and can you just give us an update? I know your congressman has been very proactive on the issue of this housing crisis intended believable, commercial and residential, so any updates for us. Yes, the bill passed the house where they're trying to work with the bill in the Senate, and there has been money for like rental arrears, to support the landlords, because the whole dynamic which everyone's been discussing is, if tenants, don't pay. How do the landlords, whether they're, small or large, manage their own finances and paying their mortgage and their taxes so part of the cares, act and I can get those numbers to you. I have multiple meetings I'm on at the moment. Sorry, whereby landlords would get the support for back rental arrears, so that should not. But of course this bill has passed. The house they're still trying to see if it will pass the Senate hello, yeah I'm here. So what do you think you know the time frame for that is Michelle? Hopefully the Senate will be reviewing it upcoming week right because it really needs to be addressed. The New York delegation has really been pushing for the Senate to respond and to respond in a bipartisan manner. So, for example, and there's also more money, like almost ten billion being put aside for more PPP, which is important for the small businesses and I just want to report out that more small businesses in the district have been receiving funding. So that's a positive thing, which means they should be able to put some of those funds towards to commercial rents, which is important for landlords who have commercial tenants. So are there any questions for Michele? Yes, sir, this money is going to the landlord's, and that was my question. No, the money would not go directly. The money does not go directly to the tenants if that passes right. So it's a hundred billion dollars for emergency rental assistance right- and this was done in co-sponsoring with representative Chiu Garcia, but the money would not go directly to tenants. What they have pushed for is another stimulus check for twelve hundred per person as what has been going out before and up to six thousand per family, but that, if so, you have your own rental arrears. Congress would not fund you to pay that off right that we go towards the landlords and I'm sure there would be a detailed process. They would have to do you know, so those rental arrears should be addressed any questions or comments on that some more information for the housing. Sorry, okay, Michelle! This is Donna, so I'm hearing a lot for landlords, and this meeting is sounding a lot like a landlord meeting and I'm, not a tenant meeting and I like destiny and Imani and Senator Gianaris. Not that I don't want landlords to thrive, but I think the tenants are the one they're hurting more in this issue and would they're gonna be facing a lot of eviction than these landlords are still gonna be owning property because they have. They have equity in the property that they have. The tenants don't have equity in their apartment, so basically the rent that they pay is all that they have and if they don't have a job, they can't possibly be able to pay these brands. I know the federal government has not thought about tenants at all in this process because of course, tenants don't make enough money or they don't carry enough bigger pockets to make a difference for the people that are making these laws. However, I think that, because of the way that we are because we are in Central Harlem, mostly renters I mean we do have homeowners and we have HDFC's so I'm not saying but HDFC's with you know, I'm not saying that it's not for not to give money to landlords. However, in the first bill that went out, landlords were able to get three funds their mortgage, but the tenants did not have for that luxury. So I'm wondering what's going to happen to these tenants, even though I mean myself being a landlord I understand this, because I have to pay my mortgage so I get that. However, I think that our community is made up of more people that are tenants, renters more so than homeowners. So thank you. Go ahead, go ahead, so I. Thank you for that feedback and I. Think part of the Tammy dynamic has to be looked at holistically. Even from a political perspective. There are some powers that the courts have. There are powers that city government has in their powers that the governor has right, and then you have the federal government, which you know looks at everything for every 50 state right. So these negotiations as much as the New York delegation has pushed this, and this has been on the mindset, particularly of Congressman SPI. How do we protect the tenants? So the mindset behind the 100 billion emergency rental assistance is so that tenants are not pushed out because the landlord would be reimbursed for that lost rental income right. The reason why the governor has pushed out in other 60 days is to protect tenants who have been impacted, unfortunately, by coded in one way or another. The other thing that my office has been noticing, which has been helping constituents, is that this federal government has been adding an additional $600 on top of the unemployment. People are getting that money now and they're, even getting about retro actively, so they have been able to meet the demands of their rent and other bills. So I know it's not a perfect solution, but we are open to hearing really constructive ideas and I can take that back up to my boss, Ryan and the other thing that the congressman has really pushed for. Is the consideration for the homeless right to make sure that there is close to 1 billion dollars to support those who are currently just homeless at the moment? So those things are, you know really important. Like I said it's not a perfect solution, but they have been trying to think about how we negotiate this and the other big challenge New York has. Is that most other states don't live like us most other states, don't even nicer alone is a big city. So when the New York delegation is on that or negotiating for us, they have to convince Colorado and Nebraska and Nevada and Montana to buy into what we need. So we all just have to keep up our advocacy and I do appreciate your time and patience and understanding and I will send the information for housing specifically to Shoetique whether it's been proposed. Thank you. Child cannot apply a little quick point. Can I make one quick point, Charles and I think that this is a good conversation and I hope everybody's listening people are also thinking about how we got to where we are and how we got to. How we got to where we are is something called massive, gentrification and displacement when people are displaced, they don't always move to another place. They become homeless and I think that we have to as a community think about how we're moving forward from this time on and protecting what little affordable housing we have left and how, when what kind of housing is built here and who can live in it, and so this is this- is this whole period right that we're going through right now, with Kovac on all different fronts, housing and other things? This is an opportunity for our community and communities of color across the city and across New York and across the country, really to sit down and have a conversation about reimagining how we move forward, how we live in our communities who protects our communities and who sits in the room, making decisions about how our community communities will look moving forward. This is not just. This is not just something that's happening right now and then it's going to end later. We need to learn the lesson from what is happening here and what has been exposed. We live under we've been living since we've been in this country on the structural racism and the structural. Racism is still here, and it's still being perpetuated in how urban areas and how cities are being built and expanded. So I'm just done I'm gonna get off my soapbox, but I hope that we all can use this as a community as a teaching moment and do better moving forward. Okay, they'll see you thank you, I see, Chanel, you have your hand raised and I appreciate the fact that you raised your hand. You needed something you need to say something more Donna, Charles I just want to say: I can't get on the zone a lot people are texting. You saying the same thing they can't get on the zone, so we can't. Okay. Is that you is that Kordell, yes, I've been trying to get on the going for like a half an hour and other people before that, and there's people texting me saying how can I get on somebody's looming? It Duke doing it live on Facebook and that's how some people are able to hear what's going on, but people can't participate. So this is pastor. Stacy I really wanted to make a comment. I'm on the phone wait one. Second, please just one second, what we're streaming it on Facebook, so anyone can join and see what I'm Cordell. If you I'll send you an email with the with the link and then you can forward it to the people who need it. Okay, I got an email with the link, but it's not working I'm gonna. Send you a new link. There was a technical problem Wardell earlier on that we saw with the actual link, but if you go ad and the participant ID, which is on the agenda, that's how a lot of people were able to join. So we apologize for that. So I'm, going to chanel Washington, who has a question as a hand raised I, would first I would like to speak to Michelle just said that we have to keep our advocacy yet in order for us to keep our advocacy up right. If we allow for elected official representatives to time and tell us, you know: well the there's a bill going through the house, that's speaking to this, that and the other, but there's no specification as to the number the name of this bill so that we can be able to say when we are advocating, or we are going into the community, that we have something specific, that we can say that people need to support and need to call and bang on the phones to their representatives to support right. That's number one I think we need to be specific and our advocacy. So when elected official representatives come to our meetings, we should ask them to. Please have the numbers of the bills that are reflecting what they are saying, so that we can begin to disseminate that into our communities. The other thing I would like to say is in terms of saying you know we're at a crucial point right. It's like people are saying it's like people are saying: okay, I'm on the renter sila, not necessarily on the renter side, but they understand renters, don't have the money to pay, but we understand that not paying rent puts the landlords and a position. So is there any way, or is there any legislation at the federal level? At this moment that speaks to maybe possibly visiting our federal exemptions or bills that allow for the major developers to be exempt from the you know, paying taxes? Is there any way? We could revise that so that they're paying a little bit more into it, because they are the ones that have the money. It's not the small landlords. So we can't like it but so much we can do to them, because they are one step from being the renter so and they're actually carrying the tax burden. Because if we're going to provide exemptions for people to come in our communities and develop right, because we want to see better, you know buildings or communities or whatever, then that means that someone has to pay the bills, and this coronavirus is going to be a heck of a bill which is probably why they owe now back to parking side parking, even though we're still mandated to be home. So nobody is moving their car, but we still now have to move our car because somebody has to collect money from somewhere. So is there some way that we can I, don't know what the legislative processes and the congressional office? But you know, is there legislation? Why can't you guys, look and see if there's legislation already speaking to that issue? If not, then maybe you guys can work with someone or some organization in the district to come up with some legislation. That says that we can't really have all these people not paying and then putting the burden on the homeowners where they are one step away from being a renter and then now we're sitting here fighting over. Should we blame the renter or the small landlord owner, where both of them are pretty much poor and then day because right, most of the put land owners old mortgages. So, okay, if we can do something like that and I'm just saying for us to be more, you know effective and advocacy. We have to be more specific in what we are asking for, what we are looking for, so that we can disseminate and say, hey, I need you guys to call senator such a such and say no such a such. We don't even have that really in place to mobilize that type of advocacy. So when she says we have to keep you know on what I have us to see I'm trying to figure out what okay we've heard. Your point has been heard: Michelle you want to respond, but I understand what chanel is saying and all we're saying is that we need factsheets. We need you know things that we can act on and I agree with her that the specifics of those things broken down, especially in terms of what you reported on tonight, you know, would be helpful. I see that Karen ory has her hand. Will that will let Michelle respond to that and then, after that, Custis Stacey Ramos was after so we should michelle answered and we'll go to Pastor Stacy and then Karen ory. Okay, thank you. So first Thank You Chanel for your for your feedback. My input on a daily basis out of my office I, send out congressman as Fiats congressional information, his press releases and his letters. So what the last meeting when we had echoed of meeting- and it was requested that I send information on the heroes Act because that's the act I'm speaking about this evening, I did email that - to our - to our district manager, so that our office we get it if I do not mind sending it out to people on an individual level. Okay, so that we are so that everybody has you like to update it legislative report, so I can do that for their office, Thank, You, Michelle, so Stacy. You want to go ahead and make your point. Can everyone hear me I'm? Sorry again? Okay, great again, this is pastor. Ramos I just wanted to come on. I'm I am constantly trying to get a word and I'm on the phone. So I have to do my due diligence in order to raise my hand, I do respect that I wanted to go back to what Donna was saying and Shannel absolutely brought in a bit of information on that as well. It was mentioned that this is kind of sounding like a renter, a landlords meeting and out of renters meeting and I remember from back two meetings ago, when Josh spoke so eloquently about landlords, it's not enough being said about landlords, and so I really just wanted to thank Michelle for coming on and really talking about this act and talking about the fact that how this could be an issue, as we all know, for the landlords. But it's not really being spoken about and Donna was saying that she's a landlord as well and she spoke about equity. Sometimes there is negative equity that the landlords are facing, and so what was just recently said was that you know the landlords are just one step away from being a renter. So we've got to really push this with the HDFC's and with the affordable housing situations. That's going on as well keeping in mind really and the homelessness issue and all of those issues, but, quite frankly, we'll all be in a very poor situation. If we don't look out for what really needs to happen, and these landlords with property taxes no brakes on any of these things, most of them in the area that I'm in and within the HDFC's, are not receiving any kind of relief or efforts. These things still have to be paid, and what can happen very realistically is the fact that the tenants won't have anywhere to be, and the landlord's won't have any property, because the negative equity is very real. So I just wanted to again say that the cares act. I didn't really get a time frame as to when the Senate may approve it or I know they're looking into it when it could realistically be touched on that it would be approved. But that's something that's very important, because then it can be dispersed, then the landlords can pay whatever needs to be paid, and then we can definitely keep at a fort front, the tenant matter and the tenant situation. So I just really wanted to put that in place, because it's really very important and a lot of us are experiencing that as well. So thank you for hearing me out. Thank you. Pastor, Ramos, Gavin Tory, you had you had a question or comment. Yes, I wanted to ask a question of the elected officials, and this is kind of along the same lines: I'm a novice I, the real estate industry, but I'm just wondering what specific legislation place to protect not-for-profits with these large, affordable housing profiles portfolios in our community from succumbing to unscrupulous landlords, a landlord takeover post, Kovac, 19 quarantine, and this is as rents, become due at the end of the quarantine period, which are accumulative and people will struggle to try to pay and may not be able to and could cause financial hardship for these not properly so I think you raised that for elected officials. I do see that we have representative from Brian Benjamin's office who joined as Brian left. We have Charlotte. Oh my god is here with us Johnny. You have anything to comment on that. I just want to remind everyone. We started this meeting talking about NYCHA and certainly even senator Benjamin indicated. We have more NYCHA developments in our Central Harlem district in his district. Then we have anywhere else in the country, so I do understand. You know I wear both of those hats. I am someone who runs an affordable housing. You know portfolio 100%, affordable, you know and I do know that did that Domino is connected. I think what we heard Stanley talk about where we heard Donald notice, talk about and Kenny Morrison was just trying to connect the dots between. You know that Domino, because if landlords failed, as Karen is saying who else will come in to further prevent the displacement that's happening in our community? So Charlie you are from Brian Benjamin's office. Anything you want to add. Well, I'll, first talk about and I know, maybe the senator might have talked about it, I'm, not sure, because I came on after he left tackling the night show. First and I know we had the most. The senator has the out of all the senators he has the most Nitra in his district in a sentence. District and grant houses have actually had the most amount of deaths in our district, as well as the city, and so after that is Saint, Nicholas houses and then Johnson houses. And so we have been given the in proactive making sure they have the right amount of mass hand sanitizers for the community, make sure they get the meals that they need and we're just trying to make sure that we try to fight racial disparities, because we know that they may have lack some means, and so we're just trying to make sure we stay on top of that and if miss Karen, if you can repeat your question and I'll see, if I can shuffle what you were yeah, yes, I'm one. What protections can be put in place to protect our not-for-profits, who have these large, affordable housing portfolios in our community from being taken over by unscrupulous landlords? Who will do who will come in and continue to displace people? Possibly so that that's my question: what can what protections can we put in place to prevent that from happening, so there so definitely can be put in some legislation. Of course, and I know, non-for-profits were eligible for some federal money, so I know Michelle should be able to jump in on this as well, and there have I do know there has been some federal money for them as laws. I, don't know Michelle. If you can kind of handle tackle this question too, on a federal level. Yes, so the PPP program, there is still at least a hundred billion dollars left in the pot, and so churches that are nonprofits or have a non-profit arm are eligible to apply for the PPP program. So, and if there's any questions we do, we are aware that the Columbia Development, a Small Business Development Center in Harlem, has been assisting with the application process and as well as the small banks like Carver and Tonko, have been really good at getting applications through where we've had more success with that than with the larger banks and there's even been creativity where people are getting a loan through PayPal. So if you have any additional questions or specific are nonprofits who need assistance reach out to our office, because we can help them navigate that hello? Yes, Jamie can I, say something really quick. Please, yes, go ahead. Chanelle, so I want to say that we have to acknowledge the basics of this, all right that when she, when we speak of allocating funding or allocating monies from the federal level or state level that we're talking about allocating monies that was raised from tax pain, so we need to look at who's actually paying taxes right. So I know someone mentioned about nonprofits, but we have to acknowledge that nonprofits are exempt. Big development corporations are carrying exemptions. The people that's coming in tonight and taking over and redevelop in NYCHA are carrying exemptions. These people are not so we're not getting any money from them, but we are voting to allocate the funding to them. So we need to take a position as this committee I'm talking to the committee members in terms of where we are going to take a position for our community and understanding that some of us may be developers or some people may be landowners. Some are real estate professionals and all of that, but we have to deal with the facts of our district and that the chairman has already stated that we're carrying a predominantly rent to district. We have a bunch of Nitra in our district, so we should be taking the position of the renters and whether and what does that look like? Are we presenting a resolution or coming up with a resolution that we're then going to pipeline to through these elected officials, saying hey? We are calling for canceled, rent or lower the rent or something and people may be upset that we love them. We know, but we have to really think about what we're doing in this crucial time right now, and we need to decide as this for this Committee on housing in the middle of a historically black district. What position are we going to take as a community board after hearing from these elected officials and these community organizations? What are we going to do with stand so we're going to take? What does that resolution look like? We are we sending that and how are we gonna put our advocacy in terms of making sure that somebody's tracking that resolution that we always have somebody on the phone call and saying please support our resolution. Give us somebody. That's gonna help turn that into legislation. If it's not legislation, that's already there that speaking to this, we need to really narrow down and not just constantly have conversations around what the issues are and maybe possibly throwing out ideas. We need to begin to act and the way we can act is that when people come to us, we have we have to have numbers. We have to have something to act on so as I understand these issues, we have I'm asking all the representatives that have attended this meeting to please look through your bills or any bills coming through your pipeline. That speaks to the issues that were raised on this call and report those to the chair so that he can have us, as a committee view those and we can vote on what we agree or disagree with, and that will be us beginning to take action. But if we keep just conversating and inviting people in conversate, that's not really us taking action. So I just wanted to say that really well I think you're right. You know and here's what I would like since I'm chairing housing and, of course this is a joint housing and land use. You know, committee meeting so I know that you know we have Karen Dixon and others who are born I'm, not sure whether lisa has joined us as of yet but you're. Absolutely correct, I'd like to see some things come between this meeting. You know and our executive committee meeting you know next week. You know that were those who are very passionate, I've heard you Donna I've heard you Chanel and I know that there are other, very informed and passionate people who are members of those two committees. So let's start circulating some draft resolutions of what you're asking housing and land use to deal with. We can take that to the executive committee meeting next week and get some action done and then take it to our general board meeting on the beginning of next month, so I'm in total agreement. It should not just be conversation. This requires action, so thank you, Chanel and Donna. So I await you know and I'm available. So we need to schedule a call for tomorrow or Monday less. Do it right, I think we should get a report from the elected officials first, so we can see what's on the table, so we're not reinventing wheels and wasting time, and at that point then we can decide if we need to create something else, and it's not a matter of us supporting what's already in the pipeline. Well I get that I'm. Just saying that there's enough information has even been shared in this meeting that we might want to consider taking some, even if they're, broad positions on that. You know, and that's all that you hear me recommend it: okay, so Charles this is Donna. What what I have been working on is a forum, a housing forum, legal with Gregory baguette we've been working on a forum, it's going to be on June 16 I'll, give you more details: I'm gonna have a save the date at the general Board meeting and also at the Executive Council. So that's my input as far as, but again it's going to be more on the tenant inside, but you could all or you it'll be a zoom meeting, so you can all join and we want to take it from there so that just great I'm glad for that announcement, I see. Gregory Baggett has his hand raised so Gregory. You have a question or statement. I had a question really I have been working on this forum and certainly information to Donna that you can share with you and the executive committee moving forward. But I wanted to find out I. Think I was trying to connect some of the understanding of some of the government's resources to the concerns of tenants, and so we had a number of nonprofit sponsors who were basically talking about their own hardships, and so I was wondering if the PPP loan or the PPP grant is it. Is it tied to operating expenses alone? In other words, do they get the money by justifying operating expenses? Do they get the money by proving that they've had a shortfall in rental income and when they receive the money, is any of it applied to offset those people who aren't paying rent so I can I can go to some of that I think we need to make sure that we understand when we say P it is the Paycheck protection program yeah the special qualifying consideration. As you know, Gregory is first demonstrating. You know the protection of you know those payrolls. You know, then you can use 25% of that, but that threshold thing has to be fulfilled. So someone asked me the other day. Could you just do a PPP? If you were just really talking about just operating and as you point out essential workers, for example, even for the not-for-profits or big ones, you know are those maintenance, crews, they have been, you know, told they are essential and they report to work and I have to keep those buildings clean and sanitized and such so I believed Donnell. You can weigh in or penny that there is a threshold qualifying consideration for that Paycheck protection program that first talks about payroll and then there's 25% for operating, yes, Charles, that's correct, 75% of it can be spent on payroll and 25% can be paid for benefits as part of the payroll utilities, mortgages and stuff like that. But it's only for is that, for a hardship is only for payroll. That's, why is payroll protection so there's only keeping employees in keep and deploys employee Oh Gregory. Your point is well-taken that they've even done the idle. The disaster relief fund has now shifted to strictly agricultural. So you know they are not. You know, then those are those initial $10,000 grants that could have been expanded beyond that into long term loans. You know I now limited to just those persons engaged in the agricultural market. So there's no question as being expressed here. We have a you know. I think we can all conclude, which is all I was saying to Donna that, based on this call, there is not enough being done, not enough being done on the federal side. We appreciate all the what got Congress and that's we art is doing in others, but not enough being done on the state side, and certainly not enough being done by the city to address this housing crisis and the threat of displacement and lord have mercy, what's going to happen with mental distress for people associated with worrying about what happens after this moratorium is finished, and then these evictions begin again so yeah could I say one thing about the I think there's a lot of continuing concern about the ability to pay, rent and I think to some degree we all probably were very surprised to hear the percentages of people were actually paid rent but I think. Ultimately, the problem is going to be a little further down the road and not in this moment, but great I wanted to share with those people that are concerned almost exclusively about the concerns of tenants and that's an important issue. But when I talk to tenants, they really don't care one way or another about the rhetoric. Rather, it's a cancel, rent or a landlord bailout. They don't care all they care about. Is that whatever comes down in the form of either canceling rent or a subsidy gets applied to rent arrears? So I, wouldn't you know, I, wouldn't expect Congress to actually create a program that paid tenants, because there's no actual guarantee that the money would go where it's supposed to go and that could lead to problems. So, if we're going to advocate around this congressional bill, what we need to do is make sure that there are protections in terms of language that ensures that the money is applied to arrears for to people who are paying rent. That's where I think our focus should be particularly with the congressional bill and as well as with the Kavanaugh bill in the Senate Raphael did I see you have your hand raised I'm, sorry, yeah I can hear you, but yes for the sake of priority and I can receive. There was a comment made by Karen earlier in our conversation regard to having slumlords coming into the community I'm grabbing properties and displacing tenants. I just wanted her to know that, indeed, that is not happening now. Community anymore, I believe. As an example, we had Donna notice as well as Ken and Morrison. These are people representing nonprofit real estate organizations that really are doing a terrific job in making sure that what you say does not happen again. I know that have happened in the past, but in this particular times and I'm you know I had experience of working with them in order to preserve affordable housing. Our community, particularly in our district, so I just want to make that clear. That is not happening and, as you put it in our community anymore, it might happen in a larger scale, like the one we have discussed for the last few years, but in this particular case, these two people that are represented in this job I really make an effort to maintain affordability in our district I just want to make that clear. Okay, thank you, Rafael I, see Kordell has finally been able to join Donal. You had a response. Yeah I just want to add something to that and you know Kenny had touched base on it, but as a not-for-profit Lando, we are concerned about tenez not paying their rent and how we can a system and paying their rent and where Kenny mentioned about section 8 and we're working with HPD right now and get section 8 vouchers and by July 1 they'll get some new vouchers and they'll be able to. You know, support us on that effort. There's also a one-shot deal that we go after potatoes to get subsidies from Kappa charities and other organizations like that to do a one-shot deal, there's also the executive order that the governor put out for forum security deposits that tenants can use their security deposits in order to you know, pay the rent if they get behind and when we support that 1:1, 100% and I think their community board should be talking to HPD to see what HPD is going to do because they're looking at taking CDBG funds to do rental assistance and sort of help out on that end, to the point, the point that Gregory was talking about so I think there's. You know the agencies itself have plans in order to try to you know because they don't want these, though there's a no income, billions of fail and they got a lot of you know. Investment in them, so I think there's a avenue that you'll need to look at and Charles. Maybe you might want to invite me up to see. You know talk to them to see what they're gonna do and Donna. We should just point out and she could confirm- we have invited HPD representatives even onto this call for this evening and we'll follow up a little bit more diligently and intently with them, but they were invited, as we also invited representatives from NYCHA who did not. You know, accept the invitation to attend. So we appreciate I know that Karen Orie has her hand Karen. You have another question. Yes, I said I just want to say, I appreciate all the stop gaps that have been mentioned to try to protect the not-for-profits and for affordable housing is what I'm saying, but I just want to say that these are unprecedented times long term, and you know we need to really look down the road to see what the implications are and what the impact can be. So I'm talking about that as well. I just wanted to mention I hope folks are looking at thee for those who can then those will calling on their phone. Terry wisdom has put in a few very good comments, though Terry I just feel like. Thank you for your. You know diligence and putting things in she had a question. You know our statement. Why don't you just go ahead and speak when you were talking about the mayoral task force Terry, you know. Thank you. Yes, I've been raising this almost every day, whatever meeting I'm going, because the mayor has formed a task force on task force on race and a lot of money is, though, is allotted for that task force and the first lady chirlane McCray will be heading up the task force, but we heard about it two weeks ago and I haven't really been able to track any information as to what is happening with it, because if there's a task force on race, very specifically, community 410 and many other Harlem community members should be at the table because there's a race issue and it's about us and it's all over the news that what's happening with the black and brown people. So if there's a task force, we need to be on it and is also a considerable amount of money that is going to be spent or is already allotted for this task force. So I think it's something that we have to demand some answers for and there's these are unprecedented times. There is so much information that is coming across it's very difficult to keep up with it. Meeting back and forth, and you know, congressman Espeon has been amazing. We have the platform, column, network news, he's come on twice and he and the other representatives really explaining it so about the heroes Act- and you know this is the second act that this come. So if you go to the whole network news, you can look back on it and actually hear it, because it's very difficult some of these things you're reading it, but there's so much information. We have to stay informed because if we don't we're, gonna be like pushed over and pushed aside so whatever way we can read it, you can go. That's why he's speaking whatever there is, if you can listen and figure it out, it'll help us, but we have to stay on top of this is critical is unprecedented times and we cannot be left out of this. Is our opportunity to see your hand just want to get Cordell Claire. Please put a request in to make a statement into the chat. Cordell go ahead. Can you unmute Cordell, jetty yep? You can speaker down yes, so and I'm. Sorry I missed a lot of it, trying to get into one, but I just want to say that as we talk about Kovac, 19 and rent and people need assistance with rent I want to go back to something we talked about in the last board meeting and I. Think I'm, one I'm, not sure, but I think Chanelle raised this point. You know the have read it is it is. It is a struggle before Kovac 19. It's a struggle for a lot of people to they are paying more than half their income already and, of course, people try to pay rent because they don't think nobody wants to be homeless, particularly right now, and even though they're sure that no victims will happen they're still concerned about when that order is lifted and what's going to happen at that point, if you don't pay the rent as a unity, Community Board community leaders, we really have to work hard to get a handle on rent the rate of rent as it is without coded or not read very high in our communities, and it's not. It's not does not compare to the salaries of the people in our community you're telling people you're gonna give them jobs that pay them $15 an hour. They cannot pay rent for these apartments that does not pay rent. We take care of the disparity that happened that led to this disparity, and that is how we saw the problem. I think someone earlier talked occasion. All of this has a role to play and we have to untangle it go backwards before we can go forward. This is the perfect time for us to start talking about some real equity and some real fairness all across the board, from salaries to businesses to black businesses. We talk about PPP's, not very many. Black businesses got those PPP's even still so there's a bunch of disparities that already existed, and there are more that are continuing to exist. We have to fight to get go backwards and Terry I'm with you I've been asked. I think you're breaking up tore down; okay, you're done yes, I just said: I'm whipped everyone, the task force, okay, good, so I know that it is now 824. You know, I, believe you know that we should yes, Donna district can I just finish this statement. Okay, so I'm just recommending that we're gonna use this last six minutes for any final comments or questions. I see two hands that are raised and Donna will go to you and you know just the mindful of that fact that I'm recommending conclude at 8:30 so go ahead. Donna! Okay, thank you. It's the mayor's, every task force of which the task force on race and equity and race, racial equity and inclusion is one of them. It's several organ is several of the cut over the council. The people from Harlem is the young lady from Nepal Jennifer Jones Austin is on their backs away from the Teamsters Union, so they're, the young lady from the studio museum, is on there and there's a list, and it actually tells you what they do and what the advisory councils are. So, if there's for business, there's labor there's racial inequity, there's health is mental health. There's a lot of different segments of that particular council, because it's called a Council of which the task force on race and equal equality is one of the members of that council. So I hope this information helps I'm gonna. Ask you. Take that post, I've seen that listing- and you know it's more inclusive I was I- was I was on a conference call I think was even yesterday or the day before were from I am Benjamin and the mayor's office, and this issue was raised about racial equity and Brian himself and other people that were on the call stress this point directly to the mayor's office, and they said that they would be back in touch with us and they wanted. You know, ingratiate our opinions and see what they can do to include in the hair. Our voices on that task force. So I'll follow up with Brian's office, because I know that issue was raised. Okay, so we're going to then have these ic3 hands raised and those are going to be our final three. You know questions or statements. So now you have your hand raised correctly. You have yours and being a white and those will be the and I do see that Thanks. You know so now. I think you put the task force, you know, link on to the chat. So, let's start with you as there we go -, Gregory and Edwina, and then we're going to conclude this meeting I put a link in a chat fold where we live, it's something it's like damn: partnership with HPD and apparently they're hold on one second, so apparently they were oh, the answer. Your question, I've asked city and Donna says he sent it we're going to publish you know we'll put it on the Missy beat ends you know website and we'll certainly send it out to everyone who's on this call. So right there talking about the response task force, but there's something else. That's here where we live in YC, fair housing together confronting segregation and taking action to advance opportunity for all I, put the link in the chat for everyone if they want to click on. It says where we live and YC is a collaborative planning process led by the New York City, led by the city of New York, to better understand how challenges like segregation and discrimination impact New York this everyday lives through where we live in NYC, the city of New York, is developing the next chapter of fair housing policies that fight discrimination, break down barriers to opportunity and build more just and inclusive neighborhoods. Is there any way we could get some information, because it's just not enough on this website as to what this is? Obviously, someone was funded and why we aren't a part of it. You all could just look around the website to see that there's many people- that's not involved in this conversation, but somehow this is happening so we'll follow up with that, and that is exactly the kind of thing that I'm saying that we can take to our executive committee meeting and make sure that becomes an action item and not just a question and point of discussion. So thanks - now, Ramos I work with mark Matthews down at HPD and I could try to find some information out about that -. Now, if you guys would like to you're sharing that one to last questions great city, can you unmute Gregory also trying to figure out a way to bring HPD to the district and, quite frankly, it's a much heavier lift? Then I can do alone. So I wanted to suggest I actually sent a letter to Bryan Benjamin asking him to take the lead on a project like that and I wanted to ask you if you could follow up with Bryan and work with him on bringing HPD of the scene a team to the district. I I just actually sent a note that Donald Otis says to the follow up with that: I'm gonna follow up with Sanne who's on this call from Brian office and with the senator himself. I think that is the exact. You know point that I heard you know mentioned earlier as well. Answer is yes keep in mind. You know, HPD can be any number of characters but I think having Louise come the Commissioner yeah Enver senior team, and if they could actually get all of the different elements of housing in the same room that is developers, landlords tenants, there might be an opportunity for us to understand all of our different needs and they've been doing these forums in other districts. So it's something that Louise is doing quite often and I think it would be a you know, would be a lost opportunity if we didn't take advantage of this thing. She's doing now we'll reach out to Louise Carroll the commissioner, and that will definitely be one of our follow-ups on this. So we have one last hand raise Nina white hi, so I just wanted to just speak to the point of just you know, bills being raised at least on the state side. Unfortunately, I mean we do know that kind of this waiting game is due to the fact that you know we're in the double digits. In terms of you know a budget deficit here in this state, so we're really looking for support from the federal government and hoping in you know what this package went through. The house within that disc in you know, passed the Senate, so I can positively. You know impact us here in New York, but one bill that I want to make sure is on you. All's radar as a committee is the emergency coronavirus. Affordable, housing preservation act that the Assemblymember is signed on to and it is for. It was presented by some number lengths, all and state senator Salazar, and the bill number is sa832b. Can you just repeat that one more time I'm sorry just put that into the chat? Okay, I'll put in the chat and then so it's it covers a lot of what we discussed when we're talking about affordable housing developers and what we're talking about tenants as well as HDFC residents and shareholders. So this bill covers those folks that are often you know forgotten about, and what this bill also discusses is just you know, building owners and tenants. You know tenants have, of course provide documents saying that they have been affected. Their income has been impacted due to the corona virus and then landlords with them have to present that documentation show that they have lost a ten percent or more a decrease in their income, and basically the state would then fund them and, of course, this funding is going to be looked at as poke. It's a hope that we would get that through the federal. We look forward to that. That's absolutely something that we're gonna follow up in our executive. You know committee meeting you know next week and that girl sister Nels point we're gonna have all of our representative Shana Nina Michelle I heard what you were saying about echo Deb, you know, but please this will make sure that our district office gets that information and is then for able to share it to the entire board. What you just reported on me is so important in here. You Gregory, said a few minutes ago in regard to bringing HPD in our district, not to undermined that the center is important, but I think it would be more appropriate to have via our office, considering that we are the local representative as councilmember bill perking. So we could have a conversation about that moving forward, but I think it would be probably more proper to do it to all the councilman office with addiction. You know to partner with the senators as well. I get your point. My bill will definitely reach out to you and you know, and talk about that. Sorry for the noise. In the background, one comment and is hopefully a brief one cord out from you before we adjourn yeah. It's a question that I'm putting to you Charles. Can we get a representative from the mayor's office who can speak about this task force and the fact that I don't from what was read? I, don't think our perspective represented and also can you know the community wants to be a part of that conversation? Oh I'm asking the board. Perhaps you can get someone from the mayor's office to come to speak specifically about the task force on equity and specifically about equity and housing Cordell. The answer would be yes, which we should certainly make that effort. I'll speak to our chair since Lee Harris I know that connections are, you know, routinely made with you know the chamber and Stacy Lynch and a few of the other people that are more senior and more directly involved with you know functioning as advisors directly to the mayor, and even you know getting the deputy mayor for Economic Development. You know into our conversations over and above even HPD, so I think that's. You know our last comment. Thanks for putting the information and Nina about the affordable housing preservation, act of 2020 I, just wanted to you know to say I think you know we're all weary from the number of calls and other things that we've been on and everyone's working very diligently. So I thought this would be an appropriate time for us to have a motion to adjourn for someone and to adjourn this very excellent meeting. That was really a formality because thank you. Thank you. Thank you. So much for all of you who have been on this call say Ruffy. Are you saying something you know we have a lot of work to do you know? Will that make sure we take the minutes of this? You know of this call and really extract from it. Some of the things that represent action items we will depend on our elected officials that Chanel said to give us the data, the information on things that this committee and this boy should be acting on and I just want to thank all the board members and all the committee members and all of our guests- and you know who have been on this call for the entire time and I wish you all a good night. Thank you. Oh my god.",
        "summary": "I. Don't know how much you deal with Stacey Lynch in the mayor's office, but she's been doing a really good job of helping to make sure that Harlem has the right access in the mayor's office to work that issue, so In that conversation, trying to do two things, one increase the amount of spacing to be those who are Cove and impacted in NYCHA, and also making sure that folks, who are asymptomatic, get into hotels.\nThink black and brown folks tend to be essential workers at a wave, higher clip and then to anyone else, so we're out more to particularly look at Nitra, where there's a lot of concern about the spread public housing where you have where it's hard to socially distance right.\nSo I just really wanted to be attentive to your time and that particular message relating to housing that you know the work that is happening up in the Senate and the assembly, and so why?\nDon't think it's unreasonable to ask for the federal government to be there to assist with any with emergency rental assistance for those who have been impacted by this crisis, and so I just wanted to kind of lay that out there I'm happy to answer any questions or receive any thoughts or inputs that we should consider.\nYou know that rental income for their operating expenses and to pay their bills that haven't stopped coming And I, think there's we run the risk of causing having a lot of unintended consequences in our community.\nThe people were getting help with those who have been directly impacted, and you know thinking about issues like you, know, making sure that we look at property taxes, and if there are developments that have a lot of impacted tenants, we should try to smooth out some of their expenses at least as it relates to Especially they have to give to the city in terms of property, taxes, utilities and others so that they can sort of, maintain and manage, I see them on the phone higher from our community and they We've got to make sure that there's a balance here and that we protect the renter and the responsible landlord at the same time What do senator just reported on Everybody, especially you Stanley, good, to see you brother and senator for coming on and everything that you do for the community so for West, Harlem.\nWe put out a survey about a month ago, because one of our projects on Randolph houses was experienced in a lot of co19 related issue, as it relates to the virus and people passing away, and we wanted to look to see if it was.\nFew electeds mentioned that cure violence will be one of the directions to go in terms of social distancing within nature, and you know certain communities is that the direction that they're going and is that?\nIf, that's going to happen, not want that to happen, but - things that they're working with the various of pure violence groups on a on a Memorandum of Understanding, okay, We only have one site: So I, don't know if that's a conversation to expand street-corner resources or how that work.\nA week and a half ago we had like 45 legislators, sided calling on the mayor and the police commissioner to take the NYPD out of social distancing and use the Cure violence and faith-based groups in the community, who are already doing a lot of that working and have trust in the community.\nYou know we're gonna work, something out with them when they get back to business, When they open back up, Three was senior citizen, yes We sent out a survey also, but our survey just really went out towards the end of last month, so we haven't received a lot of data back yet, but basically we asked the same questions.\nWe also have been talking about with you, know, with representatives from the federal government that conversation with a former HPD Commissioner Shaun Donovan who's, now working back in the city, and he says that in Kerr's, 2.1, shelter, solution, grants, you know for our residents, so I would hope.\nYou should assure aware of the decommissioned prison on one hundred and tenth This year, God willing, right now, all of our small business resources in terms of working with small businesses, are now remote through WebEx and zoom, and that's how we're getting out the information about the available resources that the small business community can tap in to do right, now, The, one that is actually in operation, is the stuff coming through the SBA or the feds from the PPP to also the disaster loan, a program, those that right now are the only two things that are available through small business, assistance.\nSo, but you know we look forward to getting to a point where we can work with the tenants one one-on-one And, like I said: If there are resources, you know, I've, been on a lot of zoom calls with various officials looking and hoping that there's gonna be some support from the federal government residents and as soon as that, happens , you know, I would love to be the connect to my residence.\nYou know a congressional delegation hard to try to get bring that money home in form of some kind of koban, 19 rental voucher, to sort of help, people who have been impacted so that so that people can pay their rent and on all their other bills, that they have, and so that's a part of what we've been pushing for as well.\nCan, you just chime in on what the congressman has been working on You know also for the relief that we need for landlords who many of them are those small business owners as well, especially not-for-profits, Michelle.\nI think that, listening to the news and a lot of things are coming from Washington DC as to how the city, not necessarily in your city but throughout the United States, they will be help from Washington DC, so I assume that the congressman it's but yes, office.\nWhat I answer a better answer than the one I just gave Charles, but it's something that I think is important and we This is this: Is you know we're going to have a lot of activity on the street, so I want to make sure that we have a adequate air but then also adequate screen exposure for people, which includes open streets, more of the streets of town, hello, yo, I , can speak to some of the open, streets.\nHousing, I also do senior issues and food insecurities one of the things that we have coming up next week on the 28th in the evening at 6, o'clock, we're doing a legal clinic, a housing legal clinic with legal services, organizations that includes Legal, Aid, Society, Take group, justice, legal services, New, York and mobilization for justice, and we will be giving information and even one-on-one questions from tenants and we're going to do breakout rooms on zoom' for tenants who are Nyjah, rent, regulated, mitchell-lama and HUD.\nThe bill passed the house where they're trying to work with the bill in the Senate, and there has been money for like rental arrears, to support the landlords, because the whole dynamic which everyone's been discussing is.\nWould first I would like to speak to Michelle The name of this bill, so that we can be able to say when we are advocating, or we are going into the community, that we have something specific, that we can say that people need to support and need to call and bang on the phones to their representatives to support.\nIf we're going to provide exemptions for people to come in our communities and develop right, because we want to see better, you know buildings or communities or whatever, then that means that someone has to pay the bills, and this coronavirus is going to be a heck of a bill which is probably why they owe now back to parking side parking.\nIt's not enough being said about landlords, and so I really just wanted to thank Michelle for coming on and really talking about this act and talking about the fact that how this could be an issue, as we all know, for the landlords.\nI'm, a novice I, the real estate industry, but I'm just wondering what specific legislation place to protect not-for-profits with these large, affordable housing profiles portfolios in our community from succumbing to unscrupulous landlords, a landlord takeover post, Kovac, 19 quarantine, and this is as rents, become due at the end of the quarantine period, which are accumulative and people will struggle to try to pay and may not be able to and could cause financial hardship for these not properly.\nSo I want to say that we have to acknowledge the basics of this, all right that when she, when we speak of allocating funding or allocating monies from the federal level or state level that we're talking about allocating monies that was raised from tax pain, so we need to look at who's actually paying taxes.\nWe need to take a position as this committee I'm talking to the committee members in terms of where we are going to take a position for our community and understanding that some of us may be developers or some people We presenting a resolution or coming up with a resolution that we're then going to pipeline to through these elected officials, saying hey?\nIf we're going to advocate around this congressional bill, what we need to do is make sure that there are protections in terms of language that ensures that the money is applied to arrears for to people who are paying rent.\nThese two people that are represented in this job I really make an effort to maintain affordability in our district And we're working with HPD right now and get section 8 vouchers and by July 1 they'll get some new vouchers.\nThere's also a one-shot deal that we go after potatoes to get subsidies from Kappa charities and other organizations like that to do a one-shot, deal, there's also the executive order that the governor put out for forum security deposits that tenants can use their security deposits in order to you, know, pay the rent if they get behind and when we support that 1:1, 100%, And I think their community board should be talking to HPD to see what HPD is going to do because they're looking at taking CDBG funds to do rental assistance and sort of help out on that end, to the point.\n, You know the have read It's a struggle for a lot of people to they are paying more than half their income.\nAlready And, of course, people try to pay rent because they don't think nobody wants to be homeless, particularly right, now, and even though they're sure that no victims will happen they're still concerned about when that order is lifted.\nI heard what you were saying about echo Deb, you know, but please this will make sure that our district office gets that information and is then for able to share it to the entire board.\nI, don't think our perspective represented and also can you know the community wants to be a part of that conversation?"
    }
}