{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB6",
            "channelId": "https://www.youtube.com/channel/UCbkNpO906o11EDhP252p_1Q",
            "title": "Manhattan Community Board Six Health \\u0026 Education Committee Meeting - 10/27/20",
            "publishDate": "2020-10-28",
            "shortDescription": "",
            "lengthSeconds": "1:05:15"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB6",
            "normalizedName": "Manhattan Community Board 6",
            "twitterName": "Manhattan Community Board Six",
            "youtubeChannelName": "Manhattan Community Board Six",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVn0y_oPVdX0vvRFl70YAig",
            "twitterHandle": "@cbsix",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "CGACxWLdbwY",
            "fillerWordCount": {
                "uh": 253,
                "um": 103
            },
            "readTimeFullTranscript": "38 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "schools": 36,
                "school": 35,
                "work": 25,
                "construction": 20,
                "students": 17,
                "project": 16,
                "survey": 14,
                "public": 13,
                "parents": 13,
                "member": 12
            },
            "wordCountSummary": {
                "member": 6,
                "work": 6,
                "schools": 6,
                "school": 5,
                "construction": 4,
                "students": 3,
                "information": 3,
                "pencil": 3,
                "kids": 3,
                "evening": 2
            },
            "fullTranscript": "So then we can go to plan b and talk about the other item on the agenda. First, if he's not here, but hopefully he'll be here, so you guys can leave okay. The live stream has started okay. So if it's agreeable to our guests, who have made time to be here tonight, I'm going to start the meeting now. Is there any issue with that from those who have come to join us? Okay, I'll? Take that as a no okay, my name is John Keller, I'm chair of the Community Board 6 health and Education Committee, and this is the October 27 2020 meeting of that committee. I'm very pleased to welcome to the meeting District manager, Jesus, Perez and associate friend and birth, and also our vice Chair Abigail Cruzmark, who is here as well and would like to welcome members of the public who have made the time to be here this evening, and I noticed that katie loeb from Councilwoman Colina Rivera's office is here, and I would like to welcome her specifically and if I've missed any electeds who are here. That's on me, okay, so and sean Sherman has has kindly volunteered to take the minutes for tonight's meeting and I think Brendan. Could we proceed by Zeus or Brendan? Could you conduct please the of the roll call to get the meeting started? All right, everybody? Let me just add members of the public. You can raise any questions or comments that you have through the Q&A feature of zoom. We will certainly field questions from the public, since we know that some of the issues we're discussing tonight are of interest to people in attendance. Excuse me for interrupting you Jesus. Thank you. All right, no worries all right. Committee members. I will call your name and you will unmute yourselves when your name is called. Please say, thank you, Abigail Cruzmark again, thank you, how's, your body present. Thank you, alvi Barroso Russon. Thank you, Dan devine present. Thank you richmonds present. Thank you. Fill up. Napolitano fill up Napolitano, okay, we'll move on. I think I heard him yeah I tried was that a present from Philip Napolitano? Yes, it was thank you see, Michelle Present! Thank you, sean Sherman President! Thank you! Anju shiresh president. Thank you, claudel Winfield President. Thank you. Neil Barkley, Neil Barkley. All right. I do not hear him, so I will mark him as absent for now, but we do have Quorum and John. You may proceed. Thank you and I was just going to say: Neil's been very good about being at these meetings, so we'll cut him a little slack if he's a few minutes late. So we have two items that are appear on the agenda, which is update from in the NYC school construction authority. When it's worked at the Washington Irving campus and my chairs report will focus on, we do not need to amend the agenda. We'll focus on current activities in among our schools. We had originally hoped to have a forum this evening with, on the subject of the mental health effects of Covid-19 and Council member Rivera and her office were extremely helpful, as we were trying to put that together, but due to an illness, we were unable to get that scheduled. It is at the top of our agenda for for the next month's meeting, and I wish to thank Katie and Iraq and Pedro from the council members Office for their patients help this week. So are there any objections to the agenda we will adopt it? Are there any objections? Okay, so you have no objections. The agenda for tonight's meeting is adopted. The minutes from the September 22nd meeting were distributed ahead of time by the board office. I've reviewed them and find them in order. If there is no objection, we will adopt the minutes as drafted members of the committee. If you object to adopting the minutes, you may raise your hand through zoom, seeing no objections. We leave minutes from the September 22nd meeting of our committee, are adopted and will soon be available on the ever increasingly fantastic CB6 website. In order to conduct an efficient meeting, let's observe a few ground rules. No one may speak until granted the floor, but we will grant the Florida members of the public who have an issue they wish to raise, and we will limit the time to three minutes, which is the same amount of time that we give at the Full board meetings. Committee members, if you have a question about committee business or wish to make a motion, raise your hand through zoom. I know Brandon is keeping his eye on that. If you click the participants icon, the participants panel should appear and you should find the raise hand function there. If you still have technical difficulty, you may click the check, icon and relay your difficulty. The chat function- and this is important- should not be used for committee business or questions about agenda topics. All such remarks should be made on the record. By raising your hand through zoom, you can use chat, to alert us to a technical difficulty. You're having or stated writing some information like an email address or a link to something that was stated aloud on the record when the committee member is given the floor to speak I'll, identify you and you can unmute yourself, so you can speak. I think we that we've managed to make that work fairly informally in the past, and we are required by executive order to create a verbatim transcript of the meeting. So please keep your questions and comments, succinct and germane to the discussion, and so we're going to move ahead with the adopted agenda. The first is an update from the Nyuc School construction authority on its work at the Washington Irving campus. I believe that Kevin has Kennedy has made right before you begin. I want to say something I am on the school leadership team at one of our Plu schools and vice president of the Pa at another DOE school, and I simply want to say to Steve, Kevin and their colleagues how grateful parents are for the work that SCA and your colleagues in school facilities have been doing to get us started safely, been a chaotic opening and also, I know principals have been in our schools until all hours of the night. I know that you know you know that the custodial staff is just working. You know over time ex. I do not know technically over time. I do not know, but working extremely hard to keep our kids, our teachers and our staff safe. So I just want to start by thanking you thanking your colleagues in in school facilities, management for what you've done so and the speech Steve the floor and Kevin the floor is yours. I want to say thank you, everybody for inviting us to your meeting of the CB6 health committee as agreed to we're here tonight, at the request of the board to do a presentation on a progress update of the work that we're conducting at the school just to preface the presentation before Kevin comes on in a couple of seconds. I just want to note that everybody should be well aware that we were paused during the Covid-19 crisis from March until we were released from, we received a release from the city in July to come back to work at the Washington Irving high school, where monies were released to allow us to unpause the job and to go back in without further ado, and just to set that table. I'd like to introduce Kevin Kennedy the project officer in charge of the work at the high school Kevin. Would you be so kind as to take over? I would. Can everyone hear me? I've had some microphone issues, yeah! Thank you for inviting us, and I just want to reply to John's comments. You know we do appreciate the acknowledgement it's and certainly the custodial staff and the people working in the schools are the unsung heroes in this regard, when we last met last fall last October, the the bonus of what we were trying to complete was to finish up the preparatory work for the parapets. That work was completed really on time, and you know Covid-19 has certainly not helped the situation. You know pretty obvious to say that what we have remaining is to finish the parapets, both inside and outside, and we're just about there we're in completion of that and closing up a section of the the top of the building. The parapets that we've kept open to be able to move materials in and out and to do. Work is we're just about to the point where we can do that at which point the roof will be completed. All the other roofs are completed, but the main roof on the original building. The eight story section needs to be done. Once all of that work is done, we can begin to remove the scaffold and get underway. Now that sounds like a simple task. It's not quite that simple. There are, you know, there's some time involved. One of the things that Covid-19 has presented us with in terms of challenges is not only the time that we lost in not being able to work on the project, but in order to resume work we had to we meaning the contractor, and we had to we meaning school construction. Authority had to approve a safe work plan for the contractor and anyone affiliated with the project. So they had to submit a plan guided by CDC, DOB, New, York, state and city environmental officials. Regarding the safe conduct of work moving forward social distancing to the extent it can be practiced on a construction site. You know there are some jobs that require people to be in close proximity and in those cases, of course, the other protocols. You know, masks gloves goggles things of that nature. We we've also had to spread out the work that we're doing so we're not able to unless it's absolutely necessary, not able to work in close proximity. When people arrive at the job site, they're temperature checked they're logged in they're asked a series of questions you know, as people are encountering in other areas. Another ramification of all this is that the workforce has actually been been thinned out. You know when this first her first hit rather and New, York City construction was halted. People who were in the trades and in the unions and needed to work elsewhere are needed to work, went elsewhere, went to places that opened up more quickly or were not affected as deeply as the city. So that's one of the challenges we're facing now, so not only did we lose the time that we lost, where we were unable to work. It's exponential in that it's taking us more time to complete the remaining work, and you know it's one of the things we deal with every day and now, with students back in the school, we have to observe department of education protocols which are very similar, but there are a number of checks and balances that we have to. We have to contend with so our overall projection for timeline is that we expect to be completed with construction substantially completed with construction by fall of 2021 and completely off the job by the end of December 2021.. That's our projection, going forward everything with the caveat that you know in construction. You always contend with weather, but in this case also the the content, the possibility of another wave of Covid-19 and whatever the ramifications of that may or may not be, but with the understanding that those could change those states. Our projection is September, completed by construction, with construction and off the job by the end of December, both in 2021, okay, John any questions. Sir. Thank you. I first would like to thank you for the presentation and I know the difficult circumstances under which everyone in our schools is working. I would like, first of all to open this to any questions or concerns from members of the committee in regard in this regard. Okay, so I would. I would like to open this to members of the public who may wish to speak and comment on this. I know in the past. We have had concerns raised and just wish to remind people that you we will grant you the floor to speak. We will give you each person three minutes, which is what we give our speakers at our full board meetings, and you know if you go over a few seconds, no one's going to argue about that, and also ask you not to use the chat function for anything for any committee business or questions about agenda topics, so not to use it for that purpose. So so Brendan do we have any members of the public who have indicated an interest to comment in this regard. I do not see anything in the question and answer feature. If there were, I would let you know of any questions that are there and would give. Then you would give opportunity for them to speak accordingly, but I do not see any questions at this time. So that's in order to be completely reasonable and open to input, because, as we've said, this has been a topic of interest in the past. Let's give everyone who may want an opportunity to speak. Let's wait a moment to give them the chance to indicate that they want to speak or advise us that they want to speak so that there is we're going to bend over backwards here to give people a chance to comment and speak. I see, Abby has raised her hand and John would just want to know that people are comfortable more comfortable doing it. This way they can use the Q&A function. Oh, okay, very good, not the chat function, but the Q&A function. Thank you very much. Okay, Abby did you? Did you have your hand raised on this? I did so I remember when you came last year around this time. We were talking about the specifics of the construction and how someone's more noisy or more onerous. Can you give us a sense? I used to actually live across the street and I've not since moved. So I do not have a good sense of the day- to- day. Could you give us a sense of sort of what a person living near the site might be experiencing in today and in the weeks to come absolutely great question? I I'd be overly optimistic. If I said there'd be there'll, be no noise, but the the really noisy, disruptive demolition and raking, and some of the jack Hammering and things of that nature have long been completed. So the more onerous as you turned it aspects of the project have been completed. There is some noise. I do not want to place a judgment or a value on it, because I do not live in the neighborhood. So what might be you know normal construction? Noise to me might be disruptive, but the really really loud stuff is completed. What remains all of the masonry, with the exception of an opening that I spoke to or spoke of earlier, has been completed. So there's no more raking, which is the grinding in between the joints or none of that work remains. The steel work for the most part is 100 complete, except for again they left the section about 12 feet, long by probably 15 feet high open so that they can use the hoist that's on 16th street to get in and out on and off the roof. So that needs to be closed up. It's a three to four week process. Once we get to that point, so there will be some steel work involved there. The masonry involved there, but the rest of the building is done. The roof is not silent, but it's not banging it's not drilling, it's not jackhammering, and then the clanging and the noise from the scaffolding is probably not pleasant, but it's not to the level that the previous demolition work was Abby. Does that address your your question? Yes, thank you. So much are there any other questions related to the construction, and I might you know, I'm just in the interest of giving everyone a chance to speak about any issues they have. I know in the past there have been concerns raised about trash disposal at the site and if any participant or any observer or any member of the public is to indicate in the Q&A or by in any way at all that they have a question, I am going to once again bend over backwards to recognize their opportunity to raise that question. It looks like Julie Block wants to speak, please. Thank you. Julie, okay, just give me a moment. Okay, I'm working on unmuting should be immune in a moment just a moment. For another reason, I'm having trouble unmuting just give me a moment Julie. Can we can you try on muting yourself through the interface? Can you hear me now yep? We can hear you yes and thank you. Okay, hi. Okay, so thank you all for doing this, since no one on the committee seems to be familiar with this project and lives in the neighborhood. I just want to say for the record: the noise has been horrific. The past couple weeks and we've just had tons of complaints in the building. But, more importantly, if this committee wants to do updates on this project, my suggestion is: you need to tackle the holistic problems that surround this project. It's not just about the construction. This project now is going to be a five- year project in a residential neighborhood that works at night. The ancillary problems that come on here, there's homeless, living under the scaffolding there's crime around here and, of course, the garbage, while you're praising the custodial staff. After four years of conversation, they still have not figured out how to put garbage in a garbage. Can something we've been working on, so I think it'd be very helpful to the community if you tackled all of the issues around this construction project and not just have really a very pleasant reason, one- sided presentation by the SCA which again Steve and Kevin. Thank you for doing it, but you're not really getting community input onto the impact of this project. Thank you, Julie. Are there other members of your community present here tonight to who wish to reinforce that comment, because I'm certainly open to hearing them so Brandon Jesus has anyone else asked to to speak or comment. Andrew Chapin in the Q&A said yes agreed. I guess in regards to Julie's concerns, okay. So let's John we actually have a question from Nyla maybrow, okay, all right, hi yeah! I was just going to I mean to your point about other people who live in the community. I live directly opposite the construction and I would reiterate that it is noisy. I understand that that's part of construction, but there is a lot of noise in the evening time and late at night and I think with the additional kind of pickups of garbage and things like that, like it's really hard to sleep through the night, and so just this has been four years and this sort of year. It's the last time we had this meeting, we were told it was going to be finished in the spring of 2020, and I appreciate that there's been covered and a lot going on in the world, but I'm still slightly unclear as to why it's an 18-month extension in the construction from that last update. Actually I'd like to just my recollection of the meeting and the dates that we gave you at the meeting last October was that we were going to finish construction in September of 2020 and be finished by December of 2020., so yeah, I'm not sure where the spring 2020. That was our original date, but due to a number of reasons, additional work, we found limited working hours and so forth. We were behind that schedule and we reported that to the community at the the meeting last October that we attended, okay and a 12-month extension I mean I guess it's just it's really hard when you're living opposite this and every time we have an update, it's there's going to be a year. Extension like these are huge time increments, and I fully appreciate that this is a complex project and things turn up that you have to adapt to and obviously with Kobe that's even more significant, but I think just from a community perspective. You know we get such little in terms of updates and understanding how things are changing and what how the extensions are. So it's kind of it's tough when you're living through this to be told a year, extension kind of without much context and perhaps more regular updates when you send a two- week, crane, okay, so now, first of all, I really appreciate your frustration and the tone in which you have offered your perspective. I think it's helpful, so I'm trying to figure the best way forward here in terms of obviously, the construction is going to continue and what I would like to suggest is we're going to continue to have these quarterly updates. So what I would like to suggest is you know that you and anyone else in the community contact me directly and I will engage. I will figure the right time to engage with the principal of the schools on this right. Now, I'm not going to bother principals who are trying to keep people alive, but I will figure out the right way, working with Council member Rivera's office to get some response to this, because the way you presented that to me- and the way you just spoke- makes me very much want to figure a way to work with you and help you. Thank you. I steve. Unless there is something very pragmatic at this point, and you can you know you can reach me through the through CB6 at any time, and I believe one or more of you has my cell phone number. So why do not we leave it that you will reach out to me with regard to you know the checklist of issues. I will contact the council member Rivera's office together, Katie and I and the council member will figure out the best way to address this when the school is dealing with the crisis. As I said, I'm just trying to keep the staff and kids alive in the building Steve. Does that make sense to you? It makes sense to me John because, as the community representative body, it would make sense that it would go through you no and worked with the council member's office and as as you stated, and as I heard in the comments from the community, we do send out the two- week. Look ahead. They are being advised of the work progress as we're moving forward. No, I have sent out if there were any changes in terms of a holiday or something like that. I do try to make an effort to make sure they're aware of it got it. So, yes, that's fine! That's that's the approach that you as a community representative, would like to take we're fine with that yeah. I think it's the reasonable approach and nyla. I you know. Thank you very much for the way you present. Thank you. We appreciate your input for helping me to understand a little better, what you're all experiencing so the next step is nyla for you and anyone else who is concerned on this. You can contact me through the Community board and then I will quickly give you a direct way to contact me and then we'll talk to Council member Rivera's office and figure the right approach to the to the schools. On this any other comments from members of the committee. It does look like there's a question from a member of the public. Okay: let's do it! Okay! Thank you very much! John, okay. I think we have one more question coming from the public. Oh fine sure, yes, hello, my name is Andrew Chapin and I live on East 17Th street in an apartment directly facing the project for all this time, and I would like to go on record to agree that the work on the project continues to be very noisy until late at night on a regular basis and that it's very disappointing that the project is continuing for yet another year. I see the work crew that is there and it is a very small crew every single day and when you have an entire year's work ahead of you, I can't understand why the crew is so small. I wish you could explain, and I see quite a bit of their time is spent standing around on the street smoking cigarettes and making phone calls. Thank you, Andrew Steve. I assume that SCA has its protocols for deciding the size of the cruise. I'm not. We do because, as Kevin had mentioned, John. Thank you for the opportunity to answer that in the in the realistic world that we are in today, Covid-19 protocols are prevailing. Everything and anything we do is now under the guise of safety and the safety protocols from the New York State Health Department New York, City Health, our crew size is mandated because of social distancing and because of the effects that the call of it has on the job site. So we do have a smaller crew, but that's because we're following the protocols as set forth by the safety requirements of the health department, state industry, okay, thank you and thank you andrew welcome to you, Julie Julie and thank you nyla, and I think I set forth a set of next steps to move ahead on this. Okay. Thank you very much. Are there any other members of the public waiting to speak? Okay, then we will. I appreciate the comments and I most the tone and the constructive tone of the comments. Thank you. So, let's see so the next thing on the agenda. Unless there is an objection from a committee member is we'll move ahead with the chairs John we'd like to say thank you for having us and we're going to sign off, okay and stay healthy Steve to you and all your. Thank you, sir. All right again, thank you for your consideration and for the tone of the conversation for the committee. Thank you all. The best bye- bye thanks Steve and thanks Kevin, okay Brendan. I'm going to run through a quick, a very quick presentation on just it's just very Britain. I think you have it. You can put it up and it does not happen. It just so happens that the face family and community empowerment, presentation, updating district two happens on the on the same day as our meetings every month. So we're able to give you an update and I'll go through it quickly, because I know I want to finish and end up by 7:35, and so the first thing I'm going to comment is not in the presentation, and that is that we are beginning to get anecdotally more than just anecdotal information on the loss of students in our our schools, and you know some principals are beginning to speak openly about the numbers that they're going to be handing in to Central at the at the end of this week. One school downtown, for example, which elementary school, with normally with 600 students, has had its enrollment fall to 504, and anybody who understands how our schools are funded knows that that's about a half a million dollars worth of funding based on fair student funding and the principle. The principles are in the dark as to what this will mean, since they are required to have teachers both for remote and in person, learning separate teachers. Normally, if you lose half a million dollars from your funding, you know that affects how you can staff. So there is quite a bit. That's left to be thought about decided on this, and this is something I suggested at the last meeting. That was purely anecdotal, but is now the numbers are starting to come out, and I was speaking to someone whose opinion I would trust in this regard today and who would not speak on the record but said that it's going to be. It looks like a 15 to 20 percent drop in enrollment in many of our schools, so we're if we will keep the pressure on the DOE to make this information public and I'll certainly be reaching out to Council member Rivera's office and Keith powers and Ben Kalos to put the heat on tweed, because right now, they're what's been said, is they're going to review the information, and we do not want that to go on for months. We need to know what's happening as soon as possible. There is still no information on whether the gifted and talented test will be given the contract with the test. Giver was pulled and has not from the pep agenda and has not reappeared, and the chancellor has said that the Shsat will be given, but no no date has been set. As at this point Brendan. Could you flip that? So that's an informal report based on people I talked to this afternoon. This is just from last year last month's presentation, reminding people that the chancellor will have a town hall, a virtual town hall for the Community Education Council District 2, which covers many of our families on December, 8th, okay. But that was from last week's presentation, and here is a brief summary of the presentation by the Department of family and community empowerment. Today, look to the they've come up with the grading policy. If you have a kid in school, you no doubt already are familiar with this they're going to, but it has now been formalized. Each school will select its own grading scale from among several options, and then families will have flexibility. This is the very wording from tweed will have flexibility in determining how passing final grades are reflected on student records. There's an option for families who prefer to have their child's performance reflected more generally, such as pass or fail such as pass as they continue to adapt to blended and remote learning. Additionally, students will not receive failing grades if they have not yet met the learning outcomes for their courses. Instead, they will receive another mark, such as needs improvement, or course in progress depending on grade level and will be provided with additional time and support to ensure they can master course concepts and earn credit as appropriate, and while students must continue to participate in remote and blended learning each day. Attendance will not be a factor in student grades, though I know from my own kids experience, they're, really all over them to be sure, they're in class, which I'm happy about actually attending school participating in class and demonstrating understanding of all potential student learning. As we know the as brendan flips to the I will point out. I was talking today, for example, to a apparent leader who said that you know this is a someone who actually sits down with her kid, and you know, and they're learning is in pre- k and learning to write, and so she has to take the pencil and help the kids move the pencil over the over the outline of the work they're doing, and she pointed out, I'm so fortunate that I can be home to help my kid do this, but there are kids in our schools who have not had a pencil in their hands since since February or March, and the long- term effects of this are things that we're just going to begin to understand, and here is a summary of the revised grading policy as it affects as it affects each grade. I think it's consistent with what I just read and I won't bore you by reading it again, but obviously these are things if you have kids in our schools that are, you know extremely important to you brendan. You can flip to the unless there's a specific question on this page. More detail on this grading policy has just been released, so there was some a good bit of detail on it to receive a course in progress grade the school's supposed to continue to support their learning, and then people are to reach out to their child's teacher or principal through the New York Schools City schools account and I believe at the last meeting- and I think I have it still at the end of this presentation. We went into how how parents can begin to put together a how they can get a school's account, so they can be in touch about their kid. Let's try! The I'm not rushing, I'm just assuming that this is actually very good news right here, the state education department and still managed to keep the funding for the nicest grants. The New York State integration program grants for 19 to the tune of 19.4 million dollars, and I know people that have been directly involved in this for the last two years, and it's really quite these are quite valuable and I'm very happy to say that district 2, where most of our all of our schools in our zone fall, has received its grant and I believe it's 3.1 million dollars to work on issues related to integration and equity in district 2 schools in district 3, which is the upper West side that many of us are very familiar with, has also received a nicer grant this. It has been a season of bad news about our schools and the many issues we're going to have to talk about. This is good news. The three million dollars is going to 3.1 million dollars. As I understand it is going to schools in district 2, which is the schools where most of our kids are and there's a link to the website there. Okay- and this is just a summary- this is this all this was in the news. It did not affect our zone at all, but I just included it here, the governor stepped in and when there were significant outbreaks of Covid-19, and particularly in Brooklyn- and I think in some places in Queens, but particularly in Brooklyn, you know he imposed a cluster zone focused which actually was a bit confusing to parents, because it crossed zone lines of schools to further help prevent the further spread, and this will be reviewed to determine whether a focus area has successfully been into a spiral spread. But- and this has been, the red and yellow zones have all been amply reported in the in the media. Over the last couple of over the last couple of weeks, we go to the I'm just moving, and people can stop me if they want trauma- informed care resources. Obviously this is something that is affecting so many of our families, and this is information for families as to how they can connect with NYC well and the DOE if their family is, if their family is in crisis. At this point, and unfortunately many of them are okay, and I believe we had this. This is left. I left this in the next line in from the last from the last presentation just to keep people informed as to how to you know as to how the screens are being done, how to open an NYC schools account, and you know how the very how the health screenings are being done, but I thought it was worthwhile to leave this in. Since I know we posted on our webpage and I think, there's another slide running- I'm not mistaken. I have my copy here. That's it yeah! That's it! Okay, yeah all right! So that's that is officially where we are right now and but any of you that has a kid in school or who's talking to people involved in schools knows that this is not a not a good story. At this point, could we put up please Brenda and I sent the I sent around to the committee. The survey that I wanted to do and I had wanted to do it earlier, but we waited the consensus was to wait. You know until the principals have to report. Their numbers on attendance speak on not attendance, but on who actually showed up because that's the million, as claude pointed out in his email to all of us. That's the million- dollar question as it were, or the case of the school downtown. I referred to the half million dollar question as to how funding is going to be effective. So I do want to send this survey out. I would I am open. We do not have to you know edit it here at that's, you know, but I would like to go through it and just go through the general questions that I want to ask, and then I'd like to get some advice from the committee as to whether we should have a separate survey for school Administration and a separate survey for parent leaders in the school. So this envisioned going to the school leadership. But I think I would like to send it also to the presidents of the pas to get their respect of their response. And how would you describe the Doe's planning and preparation for school reopening this fall? What has the impact been on? Your students, families, teachers and staff. What would you like to have seen done differently or better in relation to the reopening, and how would you assess the learning environment for your students in both blended and remote learning? I I'm really looking forward to getting a answer, answers to these questions and I'm thinking of putting a scale of one to five on some of these questions so that we can have a hard quantitative response on this technology has been in the news: does the school have adequate bandwidth to communicate with students the school itself? Just you know, can you conduct your blend? Can you conduct your classes and get to your students? What percent of students lack sufficient access to computers or laptops that has been in the news in the last few days, and I know one school that one of my kids attends where the head of guidance is actually taking the laptops. The Wi- fi enabled laptops to the homes of kids, and actually you know putting yourself. You know at some at risk of exposure doing it, which just which is why I started our entire session today with saying how incredibly dedicated so many of our staff are in our schools right now. What percent of students lack adequate access to the internet? I want to know. I want a hard answer for that for each of the schools in our zone. Do you feel there's an appropriate plan in place to address the shortfalls in the above, and then students in temporary housing and I've been talking to Karin about this, and I think this is something that her committee, rich Rick. You know we can work on together. You know and flush this out how many of your students are in temporary housing. What percentage of total enrollment do they represent? I believe 116. You know that number is a meaningful number ps 59 or some of our other schools of my or 40 it might not be, but let's get the information, how many of these students lack adequate computers or laptops? Have we gotten them? These Wi- fi enabled laptops that we're supposed to be getting them. How many of them lack internet access we've certainly found that NYCHA housing? You know that the internet access is just not adequate and you know people are scrambling around now to improve the bandwidth available in the in the NYCHA housing. Do you feel, there's an appropriate plan in place to address any shortfalls? Okay and then social and emotional wellness in general? How would you assess the social and emotional well- being of your students, and here I'm trying to? I would like to do a scale of some sort, so we have a hard number. Do you have adequate guidance and social workers staffing to address your students needs, if not how many additional guidance or social workers do you need now, if you're in a school, that's losing half a million dollars of your budget, you know, unfortunately, you know these are the people that some you know. We can't lose these people, they can not be cut. You know, and then this is the question that we that hung us up by what enrollment level did the school project for budgeting purposes this year? And what is the current estimate- and I have you- know, hard information from a principal who said it you know publicly, but not on the record, that it went from 600 to 500 in the school downtown. So that's the the first page funding. Could you flip to the second page and what is the potential impact on school funding as a result of these changes or what are the practical implications for the school? And this is where the principals that I've talked to and heard of or feel in the dark where they just do not know. You know, because they're supposed to have a teacher for the blended and a teacher for the remote, and what does this mean as to how they can you know, staff their schools? Now what percent of your students have been absent in the first days of class? Those numbers are have been reported, I think, and for remote and in person- and I just speaking my own experience, I will say the schools are really all over the kids to be make sure they're there. Even if there's no penalty, they are not all over them and how does this compare to the school's historical average and then what feedback sort of the general and then I always like to end questionnaires with general questions, to capture things that I might have missed. What feedback in relation to the reopening have been received and is there anything we've missed? So I would like, in the time we have at seven, we have about nine or nine minutes. Hello hi go ahead, John yeah just really quickly. I saw that you have reference the council members at the top of the survey. Yeah, that's a good point yeah. I personally do not know it's a CB6 survey. I do not think we need to have their names there, especially because it yeah, because it becomes problematic because it's not all their schools or all their districts. So I would suggest that we take that off, and this is my fault. I that's a that line. I meant to pull out because I got advice from the executive committee as to how we should go about this, and we should just limit it to our cv6 schools. Yes and then what we will do is once we have a questionnaire that this committee is comfortable with, and I'd like to have that by sometime middle of next week, then we'll said that the CB8 and CB5 and any other community board, we could even send it downtown. You know one, you know CB1 CB2 and just say we're doing this survey. You know, maybe you want to do it too. We do not. I do not think we want to do a big huge unless people think differently joint survey, because, first of all you know our office has enough work to do rather than trying to assemble. You know results from hundreds and hundreds of parents, so I think if each community board were to do its own, it would be better. But thank you Asia. That's a error that I should have corrected any other questions or comments yeah. This is sema happy to happy to share some comments. You know I do not know if all of the schools will have access to all of this information, but let's just for argument's sake, you know make the case that they do. I do feel that the format of the survey is not conducive to a high response rate. Okay, good, I think every question open- ended is not best practice and survey design. I think making things much more, multiple risk. You know multiple choice, responses. A couple open- ended things a couple: yes, no things that at least you know garner us some information as opposed to someone you know getting turned off halfway through and then therefore we're left with zero information. So you know I would. I would push to digitize this utilizing Google forms and then I would also push to make some of the questions, multiple choice or yes or no, and then a couple open- ended and then a couple paragraph open- ended, and these are like various distinctions that forms allows you to do. Those are great suggestions. Yeah. I just feel like this is not you know. People are doing surveys right now, for I I'm a part of another club and I administer to serve by term members and only because of Google forms did we get, I think, like 10:15 response, which is fairly common and then the data. I think if someone could put themselves on mute, I could just hear you know folks in the background, but you know there is a like a risk of having very much skewed data if you get do get someone to fill out. All of this all of these questions you know you're not necessarily pulling from a representative sample of how the schools are doing or managing their resources. Yeah. First of all, those are great suggestions, and I you know I've already had intuited that you know we got to have some quantitative questions in here that you know people can check and do not just blaze over their eyes as they look at it. I think that's, terrific and, as I'm revising it seem. If you do not mind, I will send it to you and get your advice, and I was hoping that we could do this through the office. Somehow on you know, Google forms or, but we can. I can discuss that with Brendan and Jesus as we move ahead, but those are those are really good suggestions. I also see that Dan Divine has his hand raised: hey Dan, hey, how are you John before I kind of make a couple of suggestions, and I definitely agree with everything that Sima said and thanks for putting this together, but just quickly, what's sort of the main thing that you hope to have as a takeaway from this survey? If you could try to crystallize it boy, that's a good question. I I'm trying to figure a positive way to put the answer. You know, but what you know, but I, but I guess I would like to come up with his objective of you as possible of what's actually going on. You know, sema made the point or that you know you have selection bias in terms of the people who actually answer the questions. So you know, that's always a problem in sending things out to our schools, but I I'd like to get as clear and honest and straightforward a view as possible of how our parents and administrators are finding the reopening and I've and that's why seeing this point is so valid that you know we need some hard. You know hard numbers in here as to you know you use this a one or two or three or four or five, you know and of these following choices which do you pick now. I do not know how we get around the selection bias. To be honest with you, I just do not because the parents who fill these in my experience are usually the parents who are the most unhappy. You know so you know, but I think we'd have to take what we get and just acknowledge the sample size acknowledge that it's not a scientific sample, but this is what we've heard you know. I got the idea from Ben Kalos who wants to do a survey himself, so I think it's a good idea, and but it's Dan does that address your question. I do not want to ramble yeah; no, I definitely think it does so this is, I guess, as you described it, a little bit more around the reopening right or both the parents as well as the administrators. My question is something that I see is kind of implicitly embedded in here, which I think would also be super important for us to understand is kind of on a going forward basis. Unfortunately, as you described, there's going to be seems like cuts in funding so sort of how do we get out in front of that a little bit in understanding where resources could be put so, for instance, a couple of things that I was thinking just as you were describing it? First of all, I definitely agree with sema about sort of the one to five or you know things of that nature. But in terms of maybe asking some questions about, you know what what's the greatest area of additional need that you may have and then and then the next question also is what's a couple of areas where you feel like that: there's misplaced resources or waste, because I think that it's an odd thing to think about, but unfortunately it seems like we may be facing a situation where we're having to understand what things to take away versus what additional resources to grant. So that's, just you know it seems like sema, has a really good understanding of surveys and how to best, you know, word and lay out everything, but I just say: let's try to also take this and think a little bit forward to hopefully be out in front of some of these problems that seem to be down the pipeline yeah. First of all, thank you. That's a good point, and let me do this. I think. First of all, you all know how to reach me. Secondly, I will do another version of this taking sema's suggestions and Ozzie's suggestions and your suggestions into account and you- and you know how to reach me with comments. So that's something I would you know be planning to get done by early next week, so I can get it around to you guys and you know and see. I think eventually. One of the things we might have to do is to if we have, if we're going to try to push tweed to get the numbers out, you know is we might need to engage, you know Keith and Carlina and Ben Kaylos's offices and saying come on. You can't hide from this. If we really are 20 down in our elementary schools and enrollment, you know: what are we going to do about it? Okay, are there any other comments or questions? I try. I do try to keep these meetings to one hour. Yes, so yes, a member of the public, has some questions about the dissemination of the survey. Of course unmuted whoops. I hello. Thank you. Yes, I am a school social worker. I live in our district, but I work in another district and I was just curious timeline goals if those will be communicated at the outset and again, forgive me if I missed this, but with Sema's Google forms suggestion it seems like perhaps two versions could go out that are more targeted, two or more even to school administrators and to parents, and I'm curious if that could be under consideration yeah. I know I definitely would like to do. I think we need to do two. I think we need to target one two administrators and another to, and I think we'll say I think the obvious place to send it, and thank you very much. I think the obvious place to send it is to the Pa co-, presidents or presidents of the schools and then let them disseminate it to their executive boards and see you know and hear from them. That's a good way to do it because you know these people are elected, so that would be how I would target it. I think that's the reasonable way to target it. Thank you and I do appreciate that. But one thing I might also suggest is that you know the administrators do have all email addresses for parents and then, while I understand that you know those you hear from are often those that are complaining, it might be a little bit more accessible for those that do you know those that do have the time to volunteer and are involved in the schools will surely respond, but I think this could be a way to reach the parents who have a smaller voice more broadly. Well, that's a good point of course. It's always an issue because you know I'm a Pa vice president and been involved for a long time in our schools, and you know we do not have access to parents information unless they give it to us, but we could ask you're suggesting that we should ask the administration to distribute it. You know that's a good point, I mean even the Pa presidents do not have access to all the parents emails in the school and truthfully prior to Covid-19. We never had as much access, so this might be a new, a new opening. I think I like that. Thank you, okay, so I do try to keep these meetings to an hour. Are there any other members of the public, though, who are trying to speak? I do not want to cut off any members of the public. The committee knows how to get me, but okay, any other comments from members of the committee John. This is albi. Can I say something of course, so we have a few challenges that I think we can help with. So we have an increase in the number of Govid cases. So, even though the increase are in Queens and Brooklyn, we can not prevent mobility. So I think that we need to increase awareness about infection control measures, because not everyone uses the mask and use the mask properly. Not everyone observes physical distancing, so we need to develop a campaign in the use of the mask and educate the community more about the benefits of using the mast and physical distancing, also according to the center for Disease Control and the World Health Organization, there's 70 decrease in notification of diseases and an example of that is tuberculosis. So, although active Db Disease is not a problem in our community, we do not know how many have latent tuberculosis infection and Tb and Covid-19 have similar symptoms of cough fever and difficulty breathing. So we should educate our community about the differences between these two diseases. Although Covid-19 patients are being told to stay home unless require hospitalization, any tb patients who get covered are at elevated risk and should seek medical attention. Okay, I hear you that first of all, thank you. Secondly, that that's a seems to me a separate topic from this survey, but next week we next month we will be talking about, for example, mental health aspects of Covid-19, and you know we could look into. I would be happy to consider you know expanding having an opportunity at the beginning of that meeting to talk about Covid-19 in the schools as well, but okay, thank you very much. Thank you. Are there any other questions or comments from the committee? Seeing none I'm going to adjourn the meeting at 7:40 P.M with a must. There are objections. Okay, the meeting is adjourned at 7:40 P.M. Thank you all for being here and thank you to the members of the public elaine. Thank you very much for your comments and she's no longer here, but the person who spoke so carefully about the situation at Washington Irving, I'm very grateful to so seeing no objection. The meeting is adjourned.",
            "summary": "Had originally hoped to have a forum this evening, with, on the subject of the mental health effects of Covid-19 and Council member Rivera and her office were extremely helpful, as we were trying to put that together, but due to an illness, we were unable to get that.\nIt is at the top of our agenda for for the next month's meeting, and I wish to thank Katie and Iraq and Pedro from the council members Office for their patients help this week.\nI want to say thank you, everybody for inviting us to your meeting of the CB6 health committee as agreed to we're here, tonight, at the request of the board, to do a presentation on a progress update of the work that we're conducting at the school.\nI. Just want to note that everybody should be well aware that we were paused during the Covid-19 crisis from March until we were released from, we received a release from the city in July to come back to work at the Washington Irving high school, where monies were released to allow us to unpause the job and to go back in without further ado, and just to set that table.\nThat work was completed really on time, and you know, Covid-19 has certainly not helped the situation.\nOne of the things that Covid-19 has presented us with in terms of challenges is not only the time that we lost in not being able to work on the project, but in order to resume work we had to we meaning the contractor, and we had to we meaning school construction.\nIt's exponential, in that it's taking us more time to complete the remaining work, and Every day and now, With students back in the school, we have to observe department of education protocols which are very similar, but there are a number of checks and balances that we have to.\nI would like, first of all, to open this to any questions or concerns from members of the committee in regard.\nMeetings, and you know if you go over a few seconds, no one's going to argue about that, and also ask you not to use the chat function for anything for any committee business or questions about agenda topics, so not to use it for that purpose.\nI live directly opposite the construction I understand that that's part of construction, but there is a lot of noise in the evening time and late at night, And I think with the additional kind of pickups of garbage and things like that It's.\nIn terms of obviously, the construction is going to continue What I would like to suggest is you know that you and anyone else in the community contact me directly.\nNow, I'm, not going to bother principals, who are trying to keep people alive, but I will figure out the right, way, working with Council member Rivera's office to get some response to this, because the way you presented that to me-And the way you just spoke-makes me very much want to figure a way to work with you and help you.\nAnd worked with the council member's office and as as you stated, and as I heard in the comments from the community, we do send out the two-.\nYou can contact me through the Community board and then I will quickly give you a direct way to contact me And, then we'll talk to Council member Rivera's office and figure the right approach to the to the schools.\nUnless, there is an objection from a committee member is we'll move ahead with the chairs John we'd like to say thank you for having us All right again.\nAnd I'll go through it quickly, because I know I want to finish and end up by 7:35, and so the first thing I'm going to comment is not in the presentation, and that is that we are beginning to get anecdotally more than just anecdotal information on the loss of students in our our schools.\nAnd I'll certainly be reaching out to Council member Rivera's office and Keith powers and Ben Kalos to put the heat on tweed, because right, now, they're, what's been, said, is they're going to review the information, and we do not want that to go on for months.\nI was talking today, for example, to a apparent leader who said that you know this is a someone who actually sits down with her kid, and you know, and they're learning is in pre-k and learning to write, and so she has to take the pencil and help the kids move the pencil over the over the outline of the work they're doing, and she pointed out, I'm so fortunate that I can be home to help my kid do this, but there are kids in our schools who have not had a pencil in their hands since since February or March, and the long-term effects of this are things that we're just going to begin to understand, and here is a summary of the revised grading policy as it affects as it affects each grade.\nWhat percent of students lack sufficient access to computers or laptops that has been in the news in the last few days, and I know one school that one of my kids attends where the head of guidance is actually taking the laptops.\nIt might be a little bit more accessible for those that do you know those that do have the time to volunteer and are involved in the schools.\nIt's, always an issue because you know I'm a Pa vice president and been involved for a long time in our schools, and you know we do not have access to parents information unless they give it to us, but we could ask you're suggesting that we should ask the administration to distribute it.\nTo talk about Covid-19 in the schools as well, but Are there, any other questions or comments from the committee?"
        }
    }
}