{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB1",
            "channelId": "https://www.youtube.com/channel/UCAzhpt9DmG6PnHXjmJTvRGQ",
            "title": "Brooklyn CB1 Community Board 1: By-Laws Committee Meeting (online) — June 4",
            "publishDate": "2020-06-05",
            "shortDescription": "https://www1.nyc.gov/site/brooklyncb1/committees/committees.page#bylaws"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB1",
            "normalizedName": "Brooklyn Community Board 1",
            "twitterName": null,
            "youtubeChannelName": "radiotrope",
            "youtubeChannelURL": "https://www.youtube.com/user/radiotrope/videos",
            "twitterHandle": null,
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 2,
            "um": 6
        },
        "wordCountFullTranscript": {
            "month": 46,
            "motion": 42,
            "year": 41,
            "board": 39,
            "elections": 37,
            "meeting": 34,
            "bylaws": 32,
            "vote": 32,
            "election": 31,
            "place": 31
        },
        "wordCountSummary": {
            "year": 8,
            "board": 7,
            "place": 7,
            "election": 6,
            "meeting": 6,
            "ballot": 5,
            "vote": 4,
            "month": 4,
            "bylaws": 4,
            "motion": 4
        },
        "fullTranscript": "From a megaphone attendance tracking, what else- and it has everybody's name- I'm gonna- have you guys an eternity right? Well, we can hear you now on whatchamacallit matter: who's. I'm yourself, right! No I can hear you on the computer, because you're muting me, okay, well, I'm clicking names. Is everybody unmuted, so we good you hear me I, hear you, okay, hey Marty! Can you girls, I, don't know about Marty I click party he's waving, yeah Trina's waving people will flow by the wayside. Oh. Can you release them back to me? Did you hear me? Yes on you, I hear you okay. What did you say I? Believe me, I, don't like this thing next time, we'll use an in-person meeting, but now let's go let's go I, don't know how to send it back to you. I have no idea that idea. Song is here. Oh Jan is here: Jan is here Marty here. Somebody else was here: I can't well there's two Trina's here: she's Richard, Serra and sarra Lily all right here, - I, don't even know why we're here anymore. Anybody know why we I can't anymore yeah Sonia. Yes, you hear me: okay, alright cuz! You want to off my phone. Okay, sorry, not a problem. We can get you I'm off the phone, no you're good. You want the computer thing. Yes, I get off the phone and we have a moment of silence. Please cuz I'm, confused, okay, members of George Floyd and all those that have fallen victim. Okay, hi everybody I! Do everybody? Okay, reason for our meeting is changes to our bylaws and regards to the election see so rabbi where'd. You go now I'm here, I'm, here I'm. Here you have to see that I drink, coffee, okay, you wanna, see: okay, be my guest. Yes, I watch any believe you that that's coffin to the effect of having our achieve all right, I have to leave. My phone in my watch is to have our chairs and our executive boy continue on for another year due to the padam ik and we're not able to vote, and these procedures need to be changed in these bylaws. Due to the fact that everything is remote, that's gonna work cause dis. Can't work is working parking. Okay, I can't see two people shoo yeah. Where are you yeah, because I can't find mine and if I turn on my computer, we get buzzing just technically she's talking our technical stuff go on Jan. Do you happen to have the information you sent to Madame chair and we go what we'd like to have change my computer. While we get buzzing to get too much, that's me. I can't turn up my other arm. Anything I know I saved it, but I can't turn this on without getting a lot of equity. A lot of interference. Well, I, have it on my screen. If what if I can share my screen, then no Steve, can you read that to you t-that's thief? Read it: if you can? Okay, I'm, sorry hold it all right. Here we go. They Section C elections proposed change. Number one proposed changes or additions that are involved in underlined. The election will be held at the regular meeting of the board in June, and the proposed connect these with the exception of June 2020, where the elections would not be held but postponed until June 2021 yeah. This modification is because of the impacts experienced by the co vid 19 pandemic, implementation of NYC II NY, yes and US guidelines requiring communities to pause and shelter sheltering in place mandates. The elections are both the executive committee and the tenants committee are postponed in 2020 to enable experienced leadership, be retained to move cb1 in the many months ahead, and then there are four other ones: okay. Well, let's start with that, one yeah I would like to move for us to do that simply because, in order to hold the elections, it would really be to me this is me, maybe very impossible, because we was supposed to do a nominating thing in May. You should have had the elections this month, which the meeting is next week, and we really truly don't have the time to do it. I'm only gonna speak for myself when it comes to the months of July and August. Although we're in a pandemic, I have plans July in August, I'm, never come meetings on July and all this would be nailed for me. I would be counted, absent, I would be counted absent. So we need to work on this and move on this night. Today, yes, can I move to truth. One know: I could ever just have a discussion on the okay, because we can't talk about this one without talking about the other amendment that was proposed, I mean you know, I don't want to overwhelm everybody with all the amendments. I thought we take there's only two essentially I mean there's yeah well I'm, just saying if you know, if we say if we did not recommend this approval to postpone the elections there, you know there's an alternative which is to allow virtual elections. Well, that's what I'm saying we're gonna we're gonna, either change the bylaws to postpone the elections or we're gonna change, the bio, which will be potentially changed, bylaws to have virtual elections and either way whatever the recommendation is. It has to be important to be approved or not through a virtual or board meeting. You need to have an executive board to carry on with your business too. You need to actually officially have your executive board in place and there are already in place, so we may need to move that you know, as and as the bylaw committee to say, let them stay in place until we can resume and get our business in order right, the other, the missing the second, the other. The alternative proposal does the same thing it just it's month to month until the so the new elected to the elections are or help. Yes, so theoretically could be the same timeline of both as it would be to elections, and the other thing is it gives it gives you the flexibility. We don't you know, we don't know what life is gonna be like in a year. You know we, you know if we'll be able to meet, and then there's also, you know the if other major situations like you know like a hurricane or power failure or something we're not able to meet when we're supposed to have nominations or elections having this ability having this all this alternative having this tax gives the board the flexibility to adjust to those events. What somebody else peeking, it also gives you the ability to have your board in place, so you wouldn't have to keep doing all these flexibilities and then having to go back to all these boating's and having to try to set up all these meetings, and you can't really function because you don't have an executive board in place, at least for a year to continue on with what you need to continue on with and I there's no stability. If we will have to extend my back, one is no stability, it will be dysfunctional body and many important issues have to be dealt in a timely basis. Exactly rabbi, that's what I'm trying to be laid my mind. My presentation is worse than anybody's. No, it's very good I say anything. You dish! That's why people understand that Jam cent dance and she agrees. This is a game. Now. Imagine us trying to do this month, my mum's chess Allah with having an executive board not in place. Why is a second aboard not in place they're still in place yeah? But you know what I'm saying is to have a vote and we have to meet month by month. To put all this, in order is daunting. The work right, yeah, that's not going to work, it just be one it would just be. We could do the nominations and the vote and was supposed to take place in May we're already behind right. So they should say we do the nominations. Did you read the letter we received from the borough president, and we were basically out of compliance? Yes, yeah basically said you should hold your elections. Court to your timeline and using audio-visual means is fine to do it. But if you have a paper bowel requirement, then you need to update your bylaws exactly right, but you can also extend it we're trying to extend our Executive Board on for the year, so we would be able to do this properly so that when we do have the electronic stuff in place, we be able to properly have our bylaws changed our Executive Board election correctly. Everyone that wants to vote would be able to be in on whatever. This thing is because I can't see you barely hear anybody. Everything would be in place us to try to change it to say we're gonna, do it this way now to me personally makes no sense. I agree makes no sense. That's me, I can't believe anybody else because leave this wet thing. As you can see, it's not properly working, it's not properly working and for us to go month-to-month to deal with this pendant and we've got people on the phone people over here. It's not gonna work or to be in place. We need to be able to change our bylaws correctly to have the remote thing in place into the Bible. Without that, just do our nomination in the month of June, the month of June should have been the election, so we are already behind that's what his letter stating to do it in a timely matter. Considering your bylaws, a Bible or state, we were supposed to have our nomination committee in May. The election should have took place this month. Our meeting is next week, we're behind. We need to keep my executive board in place for the time being, while we're in the midst of this pandemic, and this is Julia forces speaking I'm, not speaking for anybody else and then have all these bylaws change, and let me just say another thing: if I may David, neither man I'm. Sorry, let me just say we really don't know if God forbid, I hope it never happens that it comes back in the in the fall. You know we have no idea. What's going to happen, let us have a stable, a stable situation for another year. Nothing is going to happen. To have a service system has been working for you for years. Let's have it for another year and within that time will we know that we will be able to conduct elections in a in a proper fashion and in the meantime, the operations of that is so much needed. Yes, basically, you couldn't hear see was all kind of qui and muddled er. Whatever basically agrees with rabbi and myself was saying, is we need to have Executive Board, because this the Deming to come back and is going to come back strong in part two and we need to be stable. We don't need to be on shaky ground right about now, I'm putting it in layman's terms. So I just want to note that some of the other attendees are making comments in the in the Q&A section. I can't see him, you click it's the there's kind of a bubble icon in the bottom of the screen. Really just in the middle blue, it says open, chat, I, don't see anybody in this chat if you hover over your screen, so the question please hold on icons see this is what I'm saying with this thing and then we want to try to change yeah. Well, you know we got to learn it and we go to adapt. You know, that's why we need to keep it, what we got and do what we got to do cuz. This is not working, see nothing! Anybody saying! Oh yes, in the Q&A I'm in check, I, don't see anything on the right of the panel is a Q&A panel. That's where did it where it is? Okay and now I see that so I see one person is a Sara member of the committee of necessity, she's a TV remember, did not mm she's, not on the committee she's, not on a committee but she's in the beating and yeah not ignore that right. Look at that, but I'm, saying I just wanted to say: I mean I hope you won't vote on this one until what Steve you're typing? No, that's not me I'm trying to miss a vote. That's all I see Trina submitted the other amendment proposal for having virtual elections and extending month officer Keats until the elections America. We can't have the virtual election until we change our bylaws. No, that's true! There's nothing! In our bylaws of events. Virtual meetings have to be changed in one meeting. You cannot take a virtual vote. It's not everything to apply laws can I can I be blunt in the chance. Yes, is that promise violence is what permissible it took for me to be blunt: okay, do we have a problem? Current executive ward as it is composed, I mean what I'm trying to say, I'm, not asking for an answer and people should say I know, but we have a functioning body. That's been functioning for so long and therefore what I'm saying is I see that Sara saying, let's wait to say September according to whether it were many people, CDC and others are saying. You know that this thing might come back very strong, and why should we not extend it for a year in the mean that mean that in the meantime you know we can when it's permissible to whether it's permissible to we can do something we'll do something. But let's have we know that for another year this committee, the active committee that has been running the board for so for a few years now, okay, can function, I, don't see what yes well, that could go on indefinitely and I feel like it's not indefinitely, but I'm saying is I'm getting feedback again. Okay and I jamuns is saying that they were elected unanimously. What is that? What does it have to do with anything? I feel like we're denying you know a fundamental process of the Board of having elections and again the borough president recommend your rep abating. The suggestion is that we have the elections. You know according recommendations was a party to our bylaws. Well, we're gonna have to up tighten the bylaws anyhow sleeve goes yet we go to the go to the year-long extension you're gonna have to update the bylaws. That's what it's gonna take its gonna take a minute to really be like uploading, the Bibles for about a year, so we need to have an executive people already in place and not you know, be all over the place. Let's just build a little bit stability. All right, I don't buy that it would be a great instability but God's sake. People come on. Everything is always such an issue, no matter what we go through, we're still racking our brains. Nobody wants to come to consensus. Everything has to be a damn issue. So let me ask a question: maybe we yeah you know you said Steve, you said what you what you said and let's go for a motion probe vote to extend out till next year. Well, no, we have each change to by once. So let's go to this one going to the next one's to you know, vote also on exchange changing the other steps. Also, that's also including, like I stated, Executive Board has to be secure. What does that mean? Sakura I mean Steve, your hundred you, we I, think I think we Sonia said before. Yes, you know, why do we have? What is what is it wrong that we take that chance and let's go vote? We can have the sending vote and let's take it, the votes to the committee and then we'll move to the next one, the discussions we had. You say you agree, so you your vote is we should we read the other amendment as well, fully loaded on the on the first one. We're gonna do that very important that we handled this one first and move on to the next ones. No one! Second, you didn't hear yet so, let's hear the vote so Sonja - Sonja said yes to this one. What we said wait a second wait, a second. What about Marty? This party has Marty Toulouse on his phone. Oh, he made the motion. Yes I. Second, it wait a second. What do you mean? He made the motion. Rabbi Needleman, mediator, member he's, saying mati Needleman how about Marty Needleman? What is his opinion? He's, muted, Marty, you're muted. Can you get off here? Anybody hear him. Oh he's still muted rising beauty. Look at he consoling. He called someone and they know he could call my phone and face on me how many stated Sun noise body I'm clicking the microphone he's, still muted. Hmm, let him call you yeah. He could call mics on himself on his face timing. Somebody want to give him my number who can hear him out here. I'm. Let me try calling well he's on that quick cept he's on his phone, so we won't be able to call- and you see him anybody no he's under this and I- don't know how to control it. I'm clicking the he just. He just got off so baby's gonna, try and call okay, I clicked the speaker and it didn't. Let him come in. Is he coming back I hope, so somebody call him if I have his no don't get off nobody to get off. Unless somebody has a separate phone I, don't give me his phone number, who has the cell phone you gonna, give me I got so much feedback: okay, ready! Yes, nine, seven, nine one, seven one: five, two: nine five, two, six, four: five: zero! Six, four five zero Julie give me Bharti, you have a shot, you have an iPhone and you FaceTime, you press the FaceTime button. Were you a questions? Really is hi Marty, okay, Marty. They want to know what your opinion is and what the Executive Board can be put off indefinitely. You know: I want to make sure I'm saying that right am I, saying it right. We can do to you from now. We can do it whenever we want. We can do it sooner when we're never we're back in full operation is what we're basically saying. We don't know when that's going to be. Yes, I! Think, technically, that's incorrect. The bylaws say the terms end on June, 30th, Nena by law, say the terms and June 30th, but we can extend it. Yes, mr. Tolar, mr. wonderful nomination, which was last month, an election, we did I, don't think we have to go back change the bylaws. Let's store, let's take a vote. Can you tell us exactly? Let's take a booth, I need a man wants to take a boat finish on this. Oh I can't hear you Jan speak up, so I made so I vote for the emotion who made the mouse in you. Second, an option for repeat the mouse in Jan, because we didn't hear you. The motion is to extend the executive ward. No, you we're voting on the this amended text. There's five text amendments yeah and we said that we're going to go one by one. The first one is the extension of the executive board for another yeah till June to read it next year and so texted I read. Yes, it's amending section XI we did yeah went to the chair and that she said - yeah, us company. So it's ready to go before it came to us right, so we're trying to do that now, so we can make sure it goes back to them or what the decisions in collusion. This is understood. We were stating we're gonna take them one. At a time we weren't gonna vote on all of them as a whole. What - Jan? What's your question? She Jan is asking Julie if anybody opposes to this resolution, so that means you're. Asking for a vote is that correct I have a problem with Steve. Has a problem Steve for I prefer having virtual election nominations elections as soon as possible? No that's the one with bylaw amendment, because we have a paper ballot requirement and we already breached the mayor nomination. So exactly! Oh, my goodness. Excuse me just can't they do it month-to-month right about now, I lost my son-in-law I lost his father I'm, not dealing with this nonsense with you guys we can do a month-to-month and extended and stop being so damn silly. Let's make a resolution for God's sake. It's not silly! It's really it's important, because if we do a month important, we have basically with having a month-to-month we're gonna have the election, we're in the middle of all kinds of, not since right at least try to say you know what, if we're gonna, do the September we're doing this September we'll do a month two months away, Marty says: let's just do it: it's gonna go on an hour that would be baby the same thing: let's get it together. People well Jan had made a motion that we would continue on with the Executive Board the way it was, and we still would have to vote on the other issues so I, okay, without we have no basis to vote on that. We're voting a bylaw amendments. There's no, there's no text. It's just to state that, generally, we have to go through each proposed amendment. That Jan put through I mean that's yeah I do eat, let's go to a let's go to the first one: let's go, let's go to the second one and vote on it. There's just both well. Was it the first one, the executive board Dan, the first? No, the first one is what I read to you, the first one. It is I'll read it again, so they relate related to elections and it's the election will be held at the regular meeting of the board in June and then the amended text. That's added on proposed is, with the exception of June 2020, where the elections would not be held the postponed until June 2021. This modification is because of the impact experienced by the Covid-19 19 endemic implementation of NYC NY. Yes, us guidelines, parent community, east applause and sheltering in place mandates the lectures both for the executive committee and the attendance committee or postponed at 2028 to enable the experienced leadership, be retained to move cb1 and the many months ahead. So that's the mood yeah Jan. Do you see that she made so are we taking? Are we voting on this? Yes, okay, yeah, when I really from the bylaws, it says the terms of all elected officers of the board meeting shall commence on July 1st. Now you can have a special election in the event of the term vacancy and what I'm listening to you is. We don't have a big, oh yes, this would it be helpful to read eivol 5c of the context where the state special elections in the event of a term vacancy. So according to what your state law is, we still don't have a vacancy. The president wants us to in accordance to our bylaws. We have not had any nominations in May which makes elections would have been. We are starting again we're starting again and we have a board in full effect in order to carry on with business and that's what we're trying to be lazy. Steve, you saying no I'm not saying there shouldn't be an executive committee saying we should have elections, whoever is elected, carry on. We need to keep these people in office until we get ourselves together with this weapon right. That's where the tale of that's where the amendment of debate and but debate also has a limit. Then, let's visit there's a motion that has been advanced by Jan has been seconded. Let's move on that! No, but what would be understand it needs to be understood. What we're voting on and also I, think you know, the alternative proposal needs to be considered in relation to that amendment. It addresses the nomination, the miss nomination date and in voting in the election it just allow allows to do both virtually and, if necessary, and the officer terms you know and what the month basis. But if we act now, it would just second, we won't even have to extend if we do the nominations and the voting this month, and if we didn't, we potentially extend maybe one month and then it's done until next year, I'm not doing a month-to-month. I truly am NOT. It's just gonna. Take too much time of this executive board when we're only supposed to meet exact and like I said in July and August I'm, not yeah, but in September we still might have to have physical distancing here we might not be able to meet him exactly and that's. Why that's why the three of us is still stating we have an executive board in place right, Marty, yes, keep them in place until this phonemic is over and stop jumping around Sonya. Yes, so we stop. Jumping around from people to people- and we just have use what we got until this- the demikhov er everything she come together as a whole and get this thing in proper perspective, but a new. If we need to have a new executive point, we will be in place totally in place to vote correctly and have our bylaws changed correctly, and everything would be done correctly. All I'm stating is this: let's keep them in place until the year, because that's what it's gonna take this month of month is not gonna work, so judge Ann. You say that should be a year. Sonya says a year, I say yeah, then you said before, but say it again: ten a year. So let's go. Who else is on the board on this committee and, let's close, let's move to the other man where we have to go through the five omit there: five changes, but on this one I'll, let you go one at a time: Tesla London, all right, so you heard you heard the first one you want to read it and that it and we voted on it. We did not vote on it. Official vote. Yes, we had an official vote. Julie you had the chair, I heard two motions and the motion was that they stay in place for one year and that's okay. Consider these five. What was the motion I'm, giving you the motion, giving you the motion? James? Second, that emotion? Yes, hey! Listen to me, motion I, myself, agree with it and so the Sonia you do I as a point of order. We have to do a bylaw amendment change for either one no. We have a ballot requirement, so we have to change that yeah, but we say we have to. We have to vote on the bylaws. What we just voted on is not in the bylaws, it's just it's just you know it's just an idea saying we! The amendment is what Jan submitted. We have to vote on. I thought damn what Jam submitting was the simple fact that we were gonna vote on the fact and keeping the executive board in a whole year? Yeah? Well, that's the summary. We have to vote on change to the physical changes party said one at a time. So, let's do it in and let's move all right, so Julie as the chair. Can you move that move the agenda? Please I want to move the agenda to the second arm, reading all right vote on the first one, but Steve's saying we have to go on through the rest of them before. Oh I, don't agree, but imma. Let you go ahead on to the second, the other five changes at one time we were trying to vote individually, be sure and be clear. The text is not that long. Hey are you ready number two Mike might think because it gives feedback. Okay. Well, let me just read: it won't take that long. This is season section, C, elections, part three time should be set aside at the June meeting, and the new text is, with the exception of June 2020 and then going back to the existing tax prior to the election for candidates who choose to address the board remarks they be limited to five minutes. Any interested candidates should contact the Elections Committee in writing. At least one prior to the June board, meeting inform them of the candidates attention to address the board. So it's just that exception text. The time should be set aside the June meeting, with the exception he doesn't go in there for twenty. What is that? What section was that this is City three? What the calendar date at section C, which is titled elections and then item three okay item three times should be set aside at the June meeting prior to the election, but we're not having elections as we didn't have nominations. We bought back a circle. Steve know what I'm saying. Then the proposed tax change is, with the exception of June 2020, okay, 2020, that's the that's the tech, that's the change that we that is proposed. Okay, yeah I see it. There should be time set aside at the June meeting prior to the election for candidates who choose to address the board. I know the interest candidate to contact the election committee in writing, at least twenty days prior to the June board meeting to inform them of the candidates intention to address the board right, yeah, and so what Chan is posed is in the first sentence. You know at the beginning said where it says, aside at the June meeting, it says we're proposing, with the exception of 2020, that's the proposed change, okay, so in other words, in this month of June 2020 the side until later in the years that would you, st. in yes Julie eating that we should set residing store the exception, except for June 2020. So what you're saying is that we shouldn't have the elections in this month of June? Okay, that's a second of all nice! Is that what just vote on it exactly and that's what we keep coming back to Thanks next, exactly please Julie! Next Steve we didn't vote on. We didn't vote on the one we just read exactly somebody make a motion, please! Yes, you have to tell us okay, basically, for a year away, putting it off for a year. That's the motion to put off the electors to next year. Yes, you did. Yes, you did yes, nice I thought that's what we were doing -. Yes, we're doing that. Next, no we're here to approve or just these tech changes. Okay. So this is a vote to approve the text. I just read the second one. It's basically it's about I'm, aside in June, to do meeting or candidates to address the board, and the change is with the exception of June 2020. Okay. So that's at the same thing. Actually, what he's talking about? Yes, this is the one he's saying it's still the first one to put the election off until six one of twenty these all five of these are related to that we have to vote for, and we agree to that. Yes, I, can it? Let's go everybody voting aye vote? Yes, I! Would yes, she's, saying dance! You got mine, ready, Marty's, a now, no he's a no 2, no 3 a small sea bass. Well, what about we? What about the one I just read? We still voted on that we just did. We voted on moving elections till next year, but the teka one you just read: no wasn't it said it's addressing the boy. Let's do the vote. Jan Julie, let's do the road. This would give us the other one. You didn't vote on this one. Yet we voted on the one move the election to next year. Let's go. You voted that that's there's nothing here about that. This is about address. Julie, should vote on the tax on the next Steve Rowland Steve I, read in credit for reading and Steve read the tapes we voted on it. Okay, let's do it again. Please Steve doesn't feel that we didn't so say Julie, because they're, not three texts amend okay, let's go, let's go, let's go, let's go, let's go vote on the second one. What's the second one, you say we voted on. What you spent attack was what we was voting on, that we move not having a vote for this month. Oh honey 22 move it until next year now you're saying that's not what we voted on and that's what we voted on. No, you voted, but he read the text amendment the language of the text, amendment for that he wants us to feel you should have a vote on that. Okay. So yes, okay, yes, okay, all right! Rafer proposed number: three: did you vote Steve? Yes or no? Okay? So it's the same vote. Okay, we Steve wants to do correct. Right, want to be reflected beautiful as it should be. What did Girl's Day say: who's Goldstein, who's, Goldstein, Maria I, can't hear you Gold Steve. Can you move you want to go off? Yes, are you ready for number four yeah? It's changed number three. It's Section C for the notice of the regular June meeting. This is the new tax, with the exception of June 2020 old text shall contain, in addition to the date time and place of the meetings, a list of offices and nominees for each office to be elect. Why do we have to make the other changes right now when we already voted to set it aside until next year, so we're not having an election? So why are we going through all these lists because practically we're self? You know so you just want us to take it. Take a vote on the fact that we're going to wait and hold us off is that what do you emotion is? Have you made a motion to saying we have text here? We should vote on. It propose five changes understand why we're voting on someone's text when we've already been. This is already been - sent to the executive board and he came back to us, the chair and she just sent it to us. It went to the executive board. Justin just don't make a commit. Hmm the chair made to suggest me not home. No sir. She confirmed with the executive boy, okay exactly, but we already made the recommendation of making the vote back until June 20 21st. You want us to vote individually or each item number for the notice of the regular June meeting shall contain in addition to the date time and place meeting. Listen, we can vote on that because it's not happening until next year. Well, the new check somebody make a motion, please, with the exception of June 2020, that's gonna. Do text ok, emotion, motion to approve janab roofs, Sonya? Yes, no hay for yes, one! No! He said yes, ok, ready for next one yep, there's actually six changes. Sorry all right! Here we go number seven. The Elections Committee shall prepare the official ballot for use at the June meeting. The new text, with the exception of June 2020 full text that ballots should not be distributed prior to the June meeting name, shall appear on the ballot alphabetical order by office. In order to be in what you say, number six is number, let's change, number five section, but it's chapter section: seven committee shall prepare the official ballots. We use at the June meeting new Texas with champion of June, exactly two June 2020. First I couldn't hear what you said: Marty okay, anybody want a second is he's moving. She said yes, Sonia Marty. She wanted no Linda I put peanut butter in the fall, so she we saw there's a vote, yeah I, think so Treena. We could hear you okay, I, didn't vote, didn't ask for my voice, Julie Steve. That would be no okay, so you got one two three. Next, all right, the this is a section. Nine number, nine under C terms of all officers elected at the board, so election meeting shall commence on July 1st of the year and expire in June 30th of the found year and the new text, with the exception of the year 2020. When the exactly committee and tenants committee members are retained until June elections, 2020, 21, Sonia and Marty yes, Julia, yes, Marty Steve, no Sonia, yes, five, yes, one! No any more! That's it! For that proposal. I will chair used to say our new business monkey business, new business monkey business. You remember that okay I! Do you? Do you free asti? Well, now we have any other business yeah. The other proposal, which is the other one, the one Trina submitted that was forwarded to or committee I. Don't have none of that in front of me. I can't go into my tablet without making excellent, read it. Oh yeah! Well, I, don't know how this can work because you've already just voted on Jan's proposal without considering my proposal, but we're doing them one at a time Trina. So we're gonna leave you out. Basically, what I, what I proposed was an alternative with Jen proposed which allows the board electrons to move month to month and Audrina. What I had recommended was removing the requirement for the paper ballots, allowing means two month, extensions of the terms of the board members to expand and expanding the vacancy rule to cover all things he's, not just the terms of the nominations and elections could be held at the next meeting of the board. Basically, what the outlined was a change in the bylaws which allows the board elections to move forward possible time. It could we've already voted that we were going to hold it off until 2021 I got what you saying expired. This is sort of a sham that you didn't even consider my proposal and you already voted on you. We were going one by one. Your proposal came in after Dan's on suggestions. This is crazy. What order came input received them? Julie, I wasn't trying to leave you out at all. Julie Jamm wants to say something didn't even get John thing to work. How do you know that? How you know how you know who may want to run and who may not I mean okay I can make that assumption. Okay, we can't even get this webpage to work correctly. Something really you know we're gonna. Have virtual meetings really got to work out the technical things with the phone and that's you know be legal to go on? No, they don't I will see you soon. We have to use this yeah. That's what the borough president and this thing is a bunch of crock I prefer zoom, not time to leave you out. We were trying to do it one by one yeah. You know it was remotely. You have changed. The bylaws Nina I can agree with you. We need to change the balance bylaws. So the fact that we can't have a remote voting I can't make the motion. Somebody else asked. Okay, I think tween is dating. The bylaws need to be changed from paper ballot to us being able to vote remotely and y'all. Hear me, everybody I'm, so down no okay. So that's what she's asking us to discuss right, Trina that in order to allow what we could do is make the executive extend the term of the Executive Board month to month, so that people until we have a mechanism in place where we can vote yeah remotely to connect nomination. You can have the voting, but we already did that part. What we I am I can agree with you, don't change the paper ballot into a remotely vote, and then we don't have to extend the terms for a year. We can extend the terms until such a time that we're up and running remotely and can go through to have the nominations, and then how long is that gonna take? No exactly what to do it. We had to debate about keeping their board in place as it is. We've already took that vote to being changed from paper ballot in to remote valley. Nope I can agree with you on that, but I don't think. Katrina was complaining. I think she was just democratic. It's the process of the board. It's part of the bylaws, don't like I, don't need to change the way that we do the voting. Okay, sorry I did okay Gina. Did you want us to vote on that issue? At this point? It's moot you just voted on. Yeah I agree. It is my proposal wasn't even considered when you vote, I tried to get I tried to put it out there. I know it was you know, MIT you we just took them one by one: I missed two things: I, don't know what people were saying can I sign off? No, not yet. Okay, I'm, sorry paper Bali. What was that Marie I, don't know what she said now Marie. What was you saying actually do we need to call a vote on it? Somebody go ahead, please. Why do we need to call a vote on the ballot as it was plotted about whether we want to change it or not? Just voted. You can't recommend extending for another year the Executive Board. You don't need people need to make a suggestion. If you already suggested that we change it's the voting way. So we need to talk about that and vote on that, whether we want to change it from paper to virtual. It has to go in once if you go to month-to-month, if you extend the board word position month to month and you've just voted to extend it for a year Julia, whether we decide we're going to make it virtual, but now on that winner has nothing to do with the first one. This one is all we going to continue to do it. Someone please make a motion. I have another meeting. Emotion, and what is the motion would party say we make of? He makes a motion that we, what Marty makes the motion that we continue with paper ballots back in I, heard a second who's that one second, what does that mean continue? How do we continue? It was extended for the future for the future, instead of what promoting to take place, virtually as what he's saying that we should not do it work virtually for the future of 2021. Now we should not explain a case we're still in a pandemic, and we have to meet like this. So he's saying that we should do it to buy paper. That's what he's saying, instead of virtual, so you're changing what train is acting this you just change what Trina acts train is acting to do it without paper ballot and to do it remotely did a nice thing. No paper ballot, yes, body, sing, paper ballot, yes in the end and somebody seconded- and you said before a minute ago that you have no problem to go with paper ballot. Is this what you said no problem? Let me just say: that's an important issue. I understand what dream is saying: we are demic and we are now doing everything virtually and what she's saying is twin MRIs. Do paper ballot I, don't know what the difficulty a motion that we keep paper ballots old people I, agree with that and it's Jan said something very sensible. What they are you, that's a very sensible about people feel more comfortable when they were dizzy. Second, anything somebody. Second, the paper ballot, oh I'm! Sorry, yes, and nobody understood what you were saying. Then I explained it. Okay, wait a minute one minute: Marty I'm, gonna, repeat what Marie said, which is absolutely true. Jan. We really don't vote in secret, but we vote. We fill form and you put your name at the bottom and then we count the votes. It's not in secret, I'm, sorry, I'm, giving I'm sorry. She was disconnected I better run again. Please do it again, Julie when we vote, we do not vote in secret when you fill out the form. You put your name at the bottom of the floor and you pick the people you want to vote for and at the bottom of the form goes your name it's not in secret. However, supposedly nobody sees that besides, you know, that's nobody, the only one that sees that all the people that are counting the vote, I feel it should be I feel it should be by paper. I agree with in order to in order to facilitate holding an election electronically. You have to balance, but my proposal had three parts, but we read it doesn't sound like anyone read there was that election should be conducted individual and then we could. This is in the pipe she's saying that it has three parts a party here. One is thing to and I turned the volume up. I think you know. Let me ask one issue of paper versus virtual vote on this one I. Second, that I think we're talking about a new norm. If they go back to normal that we have to admit, we have to visit the fact that we're going to be happy to look at all these virtual stuff, because in all honesty we don't even know what the new norm is. Gonna be and I get what she's saying, but what I wanted kind of solution to month to month do all these changes we gotta get my green people I get what you're saying it's a new norm. Now we don't even know, what's gonna happen in here from now, what we're voting on so if it is whether we're gonna vote virtually for now on, is making the recommendation whether gonna go with that and Marty put it out there that he votes for paper ballots. So what I'm stating is this Marty's? Probably in disagreement and I think we should vote on Trina's most arm suggestion. Should let me read to you what it was. What the modification that I proposed was it's to section C, the election section of I lost and what I'm saying is election should be conducted by individual and then cross out. The word paper right so by individual ballots that are signed or otherwise verify a huge boding member. These ballots, those ballots that are not signed or otherwise, that verified shall not be tabulated. That I took from the bylaws such them and that's how, in order to allow to do away with the paper ballots to modify it, that's a model, that's what I was just trying to state. Is that you would. You know you Marty stated he wanted to stay with paper ballot, and that means not changing the bylaws right. This time get back to normal, we're gonna have anyway. Okay, all these are the things that could have happened in the future. Yes, your honor do not get back to normal. We don't do monthly here. We still have to revisit things. Can they just put in there as a safety net to say, hey in the event, this should happen and we're not able to do it today. We would have the choice of voting virtually right. Can we just do something like that? That's what I was looking for. Thank You, Sonia, okay, you got it Katrina shin-chan she's, asking Trina pay me. You have to pay me for keeping you here and being your serve. Oh, you know what Sonja stated, which will also include what Trina is dating. Okay, now make another one. Thank you for withdrawing your motion, because I knew you didn't understand. Wow, you're, sharp today, okay, listen I can't make the motions people I make the motion language there to include that so sort of the motion that we include the language of voting virtually alongside of paper ballots. Just in case we go back and we don't go back. We'll have I, don't know what the new norm is. Gonna, be exactly okay, I'm, okay with that I'm, okay, with might even made a motion. Somebody second, a second all right. So when you make the motion Jay a second Marty, the noise, okay abstain. Why Sonia? Yes, rabbi! Yes, dan said yes, I say! Yes, we have one, no one abstentions and one two: four, yes, okay, I'll be free on Steve. We got more your parts too much cooks, I'm, listening, okay, the next one. Next modification is also to see if the bylaws number claim- and it's the terms of all officers elected at the board's election meeting shall commence on July 1st of that year and expire on June 30th of the following year. That's what's written on what I'm adding is, however, and this is different from what Janet proposed. However, in the event that elections cannot be held according to the schedule outlined in the buffaloes and in order to provide continuity or to officer and attendance committee terms, Steve do you have you can read it because I all right, yes, section c9, the terms of all officers elected at the board's election, meaning shall commence on July 1st of that year and expire in June 30th of the following year, and the new tax is whether, in the event that elections cannot be held according to the schedule outlined in the bylaws and in order to provide continuity board officer attendance committee terms may be extended month to month until elections can be held. So this is different from extending it a full year, it's extending it until they wasn't even considered. You voted on jams, so you, what are you saying just vote on that already I got it written down here. Okay, I, agree, I agree, and can we decide like since we're doing all this in haste because of all this craziness going on? Can we decide to moving forward to get something implemented so like an action plan for the future? Can we just talk about and say you know what, because this year we'll decide on something we have to revisit the idea of looking at like moving forward and something happens that we can just have that in place for safeguard again. Can we compromise if we say okay, we agree to extend it for the time being, because we miss, we miss the election. Whatever we miss the nomination. Can we just agree to say you know what in the event anything like this should ever happen again. These are gonna, be our new policy and procedures in the bylaws I'm. Sorry. But what do we have to do that now? I mean we have the we have. The committee meeting is on the night. Today's, the fourth no meeting tomorrow, okay I, have to my rabbi- has to go. I have to go and I have another conference call? No, not yet no we're not making a motion to close the meeting, leaving and dancing. We still have four people I, please so, okay, a motion to close the meeting, please what about you can go I can go fine. Yes, bye, I'm! Sorry for that, what I hope so saying, bye, okay, bye, Jan, bye-bye I have a six o'clock. I got five minutes people now. Where were we Torino you still there I'm here too yeah? Okay, now you know so I make a motion to it's worthy, actually, hey! Where do I go I'm here, okay, Steve about you, yeah make a motion on what I just read: Section, C or nine, and what's the motion to prove the proposed tax change to that amendment, yeah we're just going to change the text. The terms of all officers elected at the board's election meeting shall commence on July 1st of the year expire in June 30th of the following year. However, in the event that a little truth cannot be held according to the schedule outlined in the bylaws and in order to provide continuity board officer, new tenants committee terms may be extended month a month until elections can be held, see that's where the confusion comes in. This still is still gonna be part of the body laws anyway, moving forward, no Marty says leave it the way it is I like. What's the motion he's saying to disapprove? The taxes over here motion is Marty. Okay, yes be, as is, which we mean. Let me get this clarified, we're gonna change the text, but we still already made the motion that we're not even having elections until 2020. First right, yes, the process and changing the text got it go ahead party. You said yes, what he made the motion: Murray Glacia. Second, it's Marty's voting, yes, Steve, yes, Wow! Thank you see. We can do your vote. Have a oh! Yes, what was the third part? Okay, you ready for the last one. Yes cuz I gotta go alright special election for the event of a which crossed out in term vacancy a special that just be a vacancy. A special election would be called the nominations and then a special election. He held the next available meeting of the full board following nominations: yes, I make a motion, so you just want to take out in the event in turn. Thank you in term, it be say an event of a vacancy okay. So what do you put in there? That is just missing. Intermittency yeah one vacant covers our bases. Anybody, okay, I, got you all right so motion to Marty for anybody second date. Well, how do you second didn't hear you Marty second day? Steve? Yes, Sonia! Yes, Marty am I missing. Oh me yeah I can get with that. Are we done cuz I got another mean not right now, I'm not available in July. Yes, so number II. What would you do to change the word with section C c10? We all did no. These you made the most. He made a motion. I made the motion Marty. Second, we have four people. Do your Marty Oh somebody gonna make a motion to close this meeting. I make a motion good night, everybody, okay, see y'all in September I now I gotta go to the other, mean how do I get out of here.",
        "summary": "The election will be held at the regular meeting of the board in June, and the proposed connect these with the exception of June 2020, where the elections would not be held but postponed until June 2021 This modification is because of the impacts experienced by the co vid 19 pandemic, implementation of NYC II NY, yes and US guidelines requiring communities to pause and shelter sheltering in place.\nLet them stay in place until we can resume and get our business in Order Right, the other, the missing the second, the other.\nIf other major situations, like you know like a hurricane or power failure or something we're not able to meet when we're supposed to have nominations or elections having this ability having this all this alternative having this tax gives the board the flexibility to adjust to those events.\nWhy- is a second aboard not in place they're still in place You know what I'm saying is to have a vote and we have to meet month by month.\nWe need to be able to change our bylaws correctly to have the remote thing in place into the Bible.\nWe need to keep my executive board in place for the time being, while we're in the midst of this pandemic, and this is Julia forces speaking I'm, not speaking for anybody else and then have all these bylaws change, and, let me just say another thing: If I may David, neither man I'm.\nThe same thing: Well Jan had made a motion that we would continue on with the Executive Board, the way it was, and we still would have to vote on the other issues.\nPlease I want to move the agenda to the second arm, reading, all right vote on the first one, but Let you go ahead on to the second.\nThree time should be set aside at the June meeting, and the new text is, with the exception of June 2020 and then going back to the existing tax prior to the election for candidates who choose to address the board remarks they be limited to five minutes.\nThere should be time set aside at the June meeting prior to the election for candidates who choose to address the board.\nWe voted on moving elections till next year, but the teka one you just read, no wasn't Let's.\nDo we have to make the other changes right now when we already voted to set it aside until next year, so we're not having an election?\nDo text, ok, emotion, motion to approve janab, roofs, Sonya?, The, Elections Committee shall prepare the official ballot for use at the June meeting.\nNine number, nine under C terms of all officers elected at the board, so election meeting shall commence on July 1st of the year and expire in June 30th of the found year and the new text, with the exception of the year 2020.\nThe bylaws need to be changed from paper ballot to us being able to vote remotely and y'all.\nTrina that in order to allow what we could do is make the executive extend the term of the Executive Board month to month, so that people, until we have a mechanism in place where we can vote yeah remotely to connect nomination.\nWhat we I am I, can agree with you, don't change the paper ballot into a remotely vote, and then we don't have to extend the terms for a year.\nDo we need to call a vote on the ballot as it was plotted about whether we want to change it or not?\nWe need to talk about that and vote on that, whether we want to change it from paper to virtual.\nYou know you Marty stated he wanted to stay with paper ballot, and that means not changing the bylaws right.\nMake a motion on what I just read, Section, C or nine, and what's the motion to prove the proposed tax change to that amendment, The terms of all officers elected at the board's election meeting shall commence on July 1st of the year expire in June 30th of the following year."
    }
}