{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "title": "CBStreet Life Committee Meeting",
            "publishDate": "2020-12-02",
            "shortDescription": "",
            "lengthSeconds": "1:57:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "CnM-l23btNI",
            "fillerWordCount": {
                "uh": 250,
                "um": 308
            },
            "readTimeFullTranscript": "62 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "music": 50,
                "restaurant": 28,
                "street": 27,
                "public": 21,
                "Covid-19": 21,
                "problem": 20,
                "location": 20,
                "neighborhood": 20,
                "business": 20,
                "restaurants": 18
            },
            "wordCountSummary": {
                "music": 20,
                "windows": 10,
                "street": 9,
                "o'clock": 8,
                "restaurants": 7,
                "stipulation": 6,
                "restaurant": 6,
                "notice": 5,
                "Covid-19": 4,
                "rules": 4
            },
            "fullTranscript": "Because yeah did you get the text or email from Abraham? He might be a bit late. No I did not see that. Do you want to be in charge at the beginning, yeah, you just send it to me text. Okay, I'm running a bit late start! If I'm not on time. I guess I better, take the camera off rather than be Incognito huh, so for everyone here so far you are muted and to participate and you'll stay muted until you're ready to participate. You'll have to go down to the participants button at the bottom of your screen and click that find something called the raise hand button and then wait for me to unmute you another pop-up. An additional pop-up will come confirming for you too, on you Judy cars question for you, cars. Yes, the first item under the layovers on third Avenue, that's been laid over for a number of months. Now. How long does it get to be laid over or are we being very generous because of these times, I'm not sure Judy? That would be an Abraham or a real question. This is the Miranda Hernandez on behalf of entity, Third Avenue and 61st street. Yes, 1662 yeah, 10:22. yeah. I'm not sure on that. One that would be a wheel on that or oh is Abraham on I, don't see him. Yet. Let me look through the list. Oh sorry, I see the Abraham on the yeah. That's an Abraham question, Judy. Sorry, okay! Well Max! Maybe you can ask Abraham about that I! Just I can chime in I am actually here, but the reason why that's been laid over is at the request of the applicant. So the worst thing that I think we would need to do is get another 30-day notice from them. That would be a more current 30-day notice. Normally we will delay until they're, ready to you know, present and become ready. I was just wondering because it just kept getting laid over what was going on yeah, they had did I think been hoping at the beginning of everything that it wouldn't last that long, but okay, thanks I, appreciate it. Yeah Matt, who is Scott's Iphone I, was trying to find that as well. Just don't mute them see what they well hold it. Well, since it's 6:32, everybody welcome to the December street life meeting. My name is Carl Spanieletti, I'm the interim co co-host co-chair or whatever you would like to call. So before we go further. The stipulations are on the agenda. Everybody would agree to those and with that we will start the meeting. The first one is. The nerve gallery is the applicant here. If the applicant is oh I see that if the applicant is online, can you just raise your hand or I've just asked Scott's Iphone to unmute? Oh, you always have to confirm good fine, hello. Are you from the nerve gallery, I'm from the Noya Gallery? Yes, okay, Gary! My apologies! No problem! Okay! This is a new application. Can you tell us a bit about it and what's going on yes, so the Neue gallery is a museum of german and austrian art. It's located on the corner of 86th street and Fifth Avenue. It's opened to the public November 16 2001, I'm the deputy director of the museum. I've been there since the beginning and part of our museum is a cafe sabarsky, very popular cafe serving german and austrian food. We sell beer and wine when we reopen. We would like to apply for a liquor license. Okay and what are your hours? Our hours are from eleven to six Thursday through Sunday, okay, so you're not open all night. This is excuse me can I be heard, am I heard? Yes, and this is our lawyer, Alan Gardner. This is Alan. Gardner I submitted the application we do have in the application that the restaurant hours are 9:00 a.m to 10 p.m, which my understanding is that coincides with the museum's hours he's right. Mr Gardner is right: I misstated the hours I. Now what I'm trying to find out is you don't want to be open one two three in the morning, so 10 o'clock? Yes, now you have two: don't you have the cafe on one floor and you have a restaurant on the other cafe on both floors, cafe Sabarsky and Cafe Slater Mouse, so is this for both or for one or it's, for both they have the same menu. Okay, any questions from the public any from my co-members Marco. Can you Marco? Yes, I just did I have a question: are you willing to comply with all covered regulations? Could you repeat that question? Please: are you willing to comply with all I only heard. Are you willing to comply? No I think what Marco is trying to ask is well I think everybody has to comply with the local with the regulation, the Covid-19 regulations, 25 of the solvents I, think that's a compulsory thing that everybody will be applying I will be abiding by, but we certainly plan to abide by that as well. Okay, of course, it should be asked part of the resolution that they know all the applications we put into all these, even though they should we, but this good that we can put it in all the applications. This statement or these I don't know what I'm saying, but we have to be in agreement with the these new regulations of Covid-19 or protection of the public know and I don't have a problem with this application. Thank you. Well. Those regulations are largely coming from the governor and the state. Liquor authorities is very strictly enforcing that and we, of course intend to comply, as I'm sure you know most other licensees do also okay, yeah I mean I'm I tend to not want to put this in the resolution because everybody knows what's going on and there's been liquor licenses that have been suspended. But that's up to you know everybody. Okay, Russell I asked you to yeah thanks I got it I just wanted to confirm that the listed occupancy is also for both floors. First Barsky and also Fleeter mouse, yes, I in the Que in your questionnaire, I totaled, the capacity of the two restaurants and just inserted a total okay. So, basically everything that's in the questionnaire is the total for both. Yes, okay, thanks, okay, Barry call the question we'll move to after I move to approve okay, all in favor, okay, the way we're going to do this if any of the members just want to disapprove or not go along with it, raise your hand. Otherwise it will be unanimous. My card I would like to know if it's gonna be put in the part of the resolution what I requested. Otherwise we kind of give nothing for granted. In that part, probably they must support, they must obey the law, but it's good from our part for our end, also that they have a commitment with us and it after that they have a problem with the license or problems of some penalization for that. So then he he's not going to come back and say: well, we didn't know that or helping us and the best way is to compromise them at any level that they have to obey the law. That's it. So if you are willing to put that I will support this application. If not I will negotiate. Okay, I think they've agreed to it. So okay, I will put it in. Thank you, okay. How many do we do? You have a list of the members so I believe we just go down the zoom list. Oh I see Mrs Brown raised her hand, actually Mrs Brown you're unmuted. Thank you cause. Could you please state what the resolution is going to be? Please well, there is what we're going to basically say is that we approve their application, with the proviso that they obey the Covid-19 rules. While they are in force, I mean once they go out of force. It's meaningless. I, understand, I, just didn't hear that part. So I'm fine with that. Okay, anybody else abstaining or voting no okay. This will go down as a unanimous approval, with the stipulation that they will obey the Covid-19 rules while they are in effect. Okay. Thank you very much. Thank you. Do we have to read the members in attendance too, yeah I think, basically for the record that way. You'll know and we'll put it in the minutes. Thanks. Okay, so I'll just go right down the list: Barry Schneider, Marco, Tomaio, Mrs, Brown, Oleda, Camp, Cosbagnaletti and that's it Paul Higgins is there Paul Higgins is here, yes, I think that's it yeah! Okay, let's go to 1b like Sarah Corb, Dba, Marwan Thai restaurant is the applicant here. We're looking for a Serato crochet. Okay, raise your hand, so we know where you are so we can unmute you no takers they're there. They just need to unmute hi, okay, this is for. Can you tell us a bit about the place? It's for a new application wine and beer, only good yeah, it's on one 1132, First Avenue, so we're going to open a thai restaurant. It's gonna be more like a take out kind of place on the ground floor and we are applying for Bny like a license. Okay, anybody have any questions or what's the crust rate between 60 second and 63rd. Okay, yes, okay, has a question: are you going to use your own delivery service, or are you going to give it to a third party and if so, what's the name of the delivery service going to be? Please I think we gonna have our own guy, do a delivery service and we may use the third party as well. The name of the third party is relay. Are you saying the name of the company is yeah, it's called relay and they are Javier and Uber eat. Is it? Is there a affidavit on file regarding following the rules with Ebanks? Did you submit the affidavit that you would but a rebuy is legal? Now or not, Matt will do you know, I'm not certain. It looks like Judy Schneider might know, so I'm going to unmute her okay, yes, the CitiBikes now I had a long talk. We have a station outside the park and there's a man that services them there and most of the CitiBikes now have been turning to e-bikes and they have very few manual bikes now. So they must be legal if the city is allowing CitiBikes to use them. Yeah, true pedal, assist and bikes to go up to 20 I think miles an hour, maybe 25. right yeah, I'm not sure if we should put that in the resolution since now that they are legal. So I'm not sure about this I see we have our board chair Elita. Thank you. Even if we don't thank you max, even if we don't say that they're not no longer legal or illegal, we should also make sure that the restaurants comply with the rules pertaining to e-bikes, because we all know the delivery guys are on the sidewalks and going the wrong way. So the restaurant should comply with the traffic laws and any other laws relevant to bikes yeah. Did they submit the one of the stipulations on the agenda? Is that with the e-bikes? Isn't it? Yes, we did. Okay. Thank you. Yes, I believe Judy has another question. Actually, okay, go ahead. Yeah I have several questions. This is the location of our famous horrible hooker bar for many years that we had a lot of problems with I'm sure. You'll, remember cars. Yes, I never went there, but you remember hearing about it the second floor. Are they taking that over? What's happening? No, so our store is one three two first Avenue, it's actually the store. Next to the grocery store that used to be grill. Yeah. Sorry, I'm sorry, no problem bring the other one or not that one. Yes, okay and I have another question. You said you might have your own bicyclist, that's a very tiny store living in the neighborhood. I know it well. What will you do with the bicycles? Will you park them inside your store? I? Think there is a like a small space next to the tree, but- and there is a pole- I think we might park it there, but you can park any bikes near trees. That's not, okay, all right! Okay, the reason I ask is because you have the market right next to you and they have that outdoor space, so it doesn't leave very much space on the sidewalk, it's kind of narrow there. So please consider that maybe you can find a place inside yeah to put your bikes yeah. I'm sorry, I, don't think we're gonna! Do it by the tree. I am confused. Maybe will find a space in front of the store or something yeah make sure it's it like comply with the laws. Are you trying to put anything out on the sidewalk or in the stream? No. Thank you. Good luck to you, you're! Welcome! Thank you. How many bikes will you be using? How many want bikes? Two? Okay? Yes, okay, anybody approve disapprove, go ahead. Marco yeah, I will approve with the with that simulation that I've already said. Thank you. That's with the Covid-19 and the electrical okay anyway. This is brown, go ahead, Mrs, Brown, second and second emotion. Oh Ruth I think we have to call a question called the question. Barry call the rule okay, and this is to approve with the Covid-19 rules and the electric bike that they have the affidavit anyway. Anybody voting no or abstaining. Otherwise it will go down as unanimous, I'm not seeing any hands. This will go down as a unanimous and good luck. Thank you. Good luck, who we up to now be back. I, think sorry, guys, I think I have to formally call the role here. Oh okay, so it's on record. There's no need to it's a unanimous. If anybody abstains or voting no, then they will and it's the same people. So ah, okay, my mistake: speed up! Okay, be back soon. You're, now unmuted, hi, Eric Allen. Here I'm the attorney for be back soon Llc. This is I believe my clients are on here as well. Massimo, hello, Massimo, my Father Mauro here, Massimo Amaro, Los Arti, and do we have anybody else? It just. Is there anybody else, speaking: okay, yeah we're here? Okay and what the food is 50. 50. well wait a minute you're going from second avenue, the first ever you're expanding on first Avenue. Now, no we're not so this application is for 1488, second Avenue, so oh you're still on second, okay, sorry, that's! Okay! For 38 years, Massimo and Mauro have been operating Uva at 1486 and 1484 for about 35 years, they're they've been in the neighborhood for a long time. I'm sure everybody here knows them and they're. You know this has obviously been a very difficult time and you know. First of all, we want to thank the community board and the members for you know for doing what you do, and you know it's been a very difficult time and there Massimo and Maro are looking to expand. You know and continue doing business. They really want to revitalize the neighborhood, and they want us to. You know, do this operation here so all of the materials in the document package. So if there's any questions, the one thing that wasn't in there is the menu is a it's. A globally inspired European menu focused on italian light bites similar to the offerings they have at Uva. So we'll open it up for any questions, okay, and what are your hours 11 a.m to 4 a.m? The same as the other licenses that we have on the block. Yeah. Okay! Thank you. First correction, Harry Uva has been there for 16 years. It's my father's restaurant Luceri's, which has been there for 38. that may or may not make a difference, but just well. This is what the second or third generation in about 20 years or something and you've got the back. The backyards are over. Isn't it that's right, correct, Aruba, yes, not at this location, but we do at Uber, okay! Well, we're not talking about over some any okay Judy hold it. Let's go to the public. First Jay Levine you're, unmuted hi. Can you hear me? Yes, okay, I'm Denise, Levine I, don't object to over expanding I live right near them. The only thing that would concern me are late hours and music, because the people who were at 1480 second avenue played loud music till very late hours and I know that you now have something on the agenda for that address. 303, East 77th street. The next item is 1482nd Avenue, so I would object to this new location only because of my concern about late hours and music, because right now there are many establishments that have liquor licenses on the block within 500 feet: 1490, 1492, 1494 and 1496, and that's just on the east side of Second Avenue, between 77th and 78th street and on the local blog next door. I noticed that a lot of people have been concerned as I have about all the people who have been congregating on the street with outdoor dining. So I'm really concerned with late hours that my bedroom faces. Second Avenue I won't be able to sleep; okay, so I can jump in and I'm sorry what was the name. I didn't catch the name of the resident, I'm at 303, East, 77th street hi yeah Massimo here. But the first thing that you had mentioned was a prior tenant in an address. That is not this. One I can tell you that you know the atmospherically it's going to be very similar to what we have been doing for many years, that what for what we were doing before the place? That you mentioned has been empty for a couple years, and you know I, I'm a very you know: I enjoy peace and quiet as well. So I could appreciate your concerns. I just I think that to answer your questions one at a time the address on the corner is not gonna is not what we're taking is not what we're applying for somewhere else, and we actually have a business even closer to your apartment than what is than the one that we're applying for and I was happy enough. You know that you did not mention anything about the sound there, so that kind of speaks to the first point that you made because I empathize with you, because you know I, know what it's like to have noisy neighbors personally more from the residentials, and you know I'm a very light sleeper. But as far as the second point that you made about congregating, this is actually going to alleviate that problem. As you know, this would allow more seats to be available and 2020 has been a heck of a year and the main reason why we have not to say that it's an issue, but the main reason why I believe you're saying that is because we've had no indoor dining. So all of these bodies that are normally sitting down at a table or waiting at the bar or waiting from the tables across from the bar totally got wiped out for obvious reasons that I'm sure everyone is aware of so I think this is quite the unique year to you know to and again I empathize with you, so I don't want to make. You feel like I'm just missing that concern, I'm just trying to explain why I think that concern will be alleviated not only with God willing, the you know the Covid-19 disappearing, but, furthermore, us having more seats so that, instead of people waiting outside they are now you know dining inside. Well, you know Massimo I mean honestly: we've had serenaders outside our window. You know the passing musicians. All summer, long and I tried not to object, even when they came at 11 o'clock at night on weekends, because I really don't want you to lose business. No I appreciate that and one thing that we're super appreciative of is just you know: we live in a neighborhood and it seems like any neighborhoods that did exist have slowly been disappearing this year at a rapid rate and regarding the singers you know it's I'm actually happy. You brought that up, because I want to tell you what our exp our experience with any buskers or whatever word you want to call them has been. You know it it's, and it happens not only in the Upper East side, but it happens in downtown as well. Just from going out and dining you know, musicians have been out of work, so they have been going around trying to make a dollar it was. You know it was very sweet when it happened the first time it was nice when it happened. The second time, maybe even the third time, admittedly to hear the same people going around playing the four you know the same four songs, three or four times a week personally got very frustrating, but that doesn't matter, but we you know once we would ask them not to come and the responses we would get was. If we're not standing. You know on your property or in front of yours, there's nothing. You can do except call the police, in which case I'm within my legal right. According to this document- and so you know been being in this business for a while when someone not that I don't want to call them aggressive, but when someone is not that passive as they could be, I, don't try to fight fire with fire. So let it go the first time. The second time I asked them nicer same response, the third time we called 311 because we didn't want to waste the emergency on 911, especially with you know, with the crime that has been going on. And finally, we ended up calling 911 and the police did not come a few times because they asked what is your emergency and we told them. You know a man singing a few songs on the sidewalk and no one came after about the third or fourth time that we called 911. The police did come and they said they spoke to the guy and they looked at us and they said if they're here, past 10 p.m. Give us a call back, but they can do what they want at 10 pm and they're, not on your property- and you know this is something that is not necessarily specific to my business. It's something that I see happening throughout New York in 2020. I apologize for the long answer, but I didn't want to leave out any details. If I may hi, my name is Maro Massimo's dad. So I've been in this block right here for the past I guess, 49 years since 1971. I've opened Lussard this 1981. So it's 40 years just about and though those of you who know us who know me or lussardi who know what we're about for the past 40 years, know that we're not about making noise we're not about loud crowd, we're not about loud people, drunken people. We are I like to think that we run a very civilized and serious operation and definitely not about loud music. Unfortunately, like my son explained, we couldn't do it much about the outdoor music, but certainly indoor as far as the dining room, we're not that's, not what we're all about. I just wanted to reassure the lady that we have no intention of anything like that. If you know Lousarti and if you know who I think you do, but then you would know that it's not in our intention and it's just not the kind of a business operation that we are used to running. Okay, thank you, but also the do. You have windows or doors opening. Well, they definitely close at 10 o'clock. Don't they again just not to have a robotic answer as far as consistency is concerned, but the same as the same time as the other businesses that we have on the block at 12. and I, say yeah I, say robotic just because I'm not trying to dismiss that, but it's just consistent to how we have everything else. Okay, Judy go ahead. Judy no I have no questions. Well, yes, actually I'd like to make a statement. I am a member of the public cause. Secondly, I didn't print an agenda, so it would be helpful when somebody comes up if you could state the name of the establishment and its location. Thank you. Oh sorry, okay I see someone raising their hand down there. I'm can we quick go to them. Jack! Well, Judy the place beat back soon and it's 1488 second Avenue. Thank you sure Jack go ahead. Thank you. Hi I am joining this meeting because I live in the neighborhood. I'm professor Jack Wiener. I've lived here for three decades and I noticed that there were a couple of restaurants that are right by me. So I thought Uva is close by I've gone there for years and they're, not the cause of any noise that we hear they're not generating any music. If somebody has a problem with buskers I suggest that they take it up with the proper authorities, but I think the buskers are right. It's not the restaurant's, purview and I also think that we should be sensitive to these are Covid-19 times. I heard a criticism about people or a complaint about people sitting outside. Well, god bless them. It's much safer than sitting inside the pandemic is a big problem. The restaurants are having a problem. Obviously we have to be sensitive to that and the people better than that they eat outside than indoors, even when they're allowed to eat indoors to limited capacity. Those are my views. Okay, thank you. Russell, ahead, Russell. Yes, so what we've often done when there are concerns about noise? You know for music and particularly live music. Is you know a stipulation where you know the typically I think the music doesn't go all the way until closing time you know, particularly if a place is going to be closing. Pretty late, and so you know we can stipulating an earlier kind of cut off time for any kind of live indoor music that they may have going on and I. You know very often the applicant doesn't even really intend to have the live. Music go all the way till closing time and so I think that's a easy kind of answer when it comes to the indoor live music. So you know if the applicant's willing to say that they won't have live music past. You know sometime like 11 or 12, or something like that. I think. Maybe that would help address the concerns. Are you going to have live music Massimo? Occasionally, I mean it's. You know, there's only so much that a playlist or an algorithm on Pandora can do just like everything we do. We like to take a put a personal touch on it and take a personal approach. So I mean I live music is intended to be just as that as I. Don't know why I'm using the word robotic so much today, but not robotic, just being able to play. You know whether it's anything from jazz or who knows what I myself, I'm very passionate about: flamenco, music and acoustic guitar, but not that matters. But if it you know, the gentleman I didn't catch the name, but a gentleman said that what if we agree to closing I, don't know no live music an hour or two hours before closing time, I'm totally fine with that, because if someone's playing live music for that long, it's probably going to you know they're, probably going to want to get paid a lot I. Also there was a kind gentleman who spoke who's. The gentleman who lived in the neighborhood for three decades was I think waving his hand. I would appreciate if you could hear if we could hear from him again I think he wanted to speak to him. Well, we let's call on other people first before we call back on him. Okay, so how about live? Music, not past 12, and any windows or doors closing at 10 p.m, to the outside, not you're inside you're going to be, but we don't want windows and doors open if you're, playing music and really an open window past 10 o'clock is meaningless anyway. Yeah just I would be curious as to why that would be a request it contains. It would contain the noise to the inside rather than if there's any noise inside it would carry on outside. Yes, naturally, but I'm, but there's Al. We also have music at other establishments on the street and whose doors or windows are allowed to stay open past tense. So I, just wonder why the inconsistency here. Well, what we've been trying to do is put a stipulation on a time limit that, but also for outdoor dining, isn't it 12 o'clock week, Saturday and Sunday what time during the week, so you wouldn't have anybody out anyway idea. Is there an outdoor area in that place? There's not okay, there's not that's that you're! Thinking of the other place, okay, I mean you're saying: can we do 11 o'clock? How about just like, oh I, said 12, but if you want to do 11. well, I mean I'm sorry, I meant to say 12, okay 12, but I'm just one. Second I want to make sure that we're clear on this we're talking about the windows here. Correct! Yes, that's fine! Oh yeah! That's fine! No problem, oh yeah, because it's meaningless, sinning, okay, anything else, Russell, I, guess not a leader, I thought Russell did have his hand back up actually but I we're calling back again later. Then thanks cause thanks max I, see some other members of the public, but oh either oath or the nightlife czar has a mediation program to resolve disputes between restaurants and nightlife establishments and or bars, and the population the residents in the community. So maybe the committee might want to consider, including that, as a stipulation that if there are disputes that the restaurant or the bar will willingly participate in a program so that they can try and resolve things with their neighbors well, I think Louisades has been in contact with I know that area has been a problem for many years, one or two bars, but I'm not sure if it's quietened down now or not, but would you agree to that Massimo also I'd just like to add that will our district manager just put in a link in the chat to the programmable leader was just speaking about? Okay, thanks, well, I apologize! Okay later, would you like to finish up I? Just thank you. Cause I just wanted to say that it's a very friendly way to resolve things where you work out a time or you work out some kind of parameters of music or windows, or something so that it's not just the residents who are being satisfied. It's also your interests that are taken into account and concern so that everyone ends up with something that theoretically, everyone ends up with something. That's satisfactory. It's a voluntary program, but a willingness to participate sends a strong message that you want to be a good neighbor and that's usually I would think well received by people. I am all about open communication with the locals and I'd be more than happy to okay. Thank you! Mrs Brown, oh hold it Jane Moore from the public. Okay, nice! Here go ahead. Jane hi! Can you hear me? Yes, hi, so I actually live right above Uber and I'm kind of speaking from a different angle. Actually I have lived in New York for 14 years, and this year has definitely been one of the most haunting as a single female that lives by themselves. I think we all got to see the city when it was devoid of restaurants and devoid of action on the street and I myself. I have lived in two areas of the city that both kind of went through a bit of a drought in restaurants and retail spaces. The last one I actually lived above Barney's downtown when that closed and the area very quickly degenerated and became quite a creepy and spooky environment. So I have to admit living now on second Avenue, which I've always thought had like a really neighborhood feel kind of throughout the summer. That whole area really started to feel kind of like previous areas, that I've lived in just kind of spooky and haunting and walking my dog late at night. I, just I felt really uneasy and I was surprised how quickly that feeling came back. So when the restaurant started reopening and coming to life, it was such a resonant reminder of what a relief that is just to have those faces that you see every day, just the feeling of like somebody on the street in existence and community and when Pookie shut down, which is my neighboring property I, got this kind of sense of, oh god. It's happening again. So that's kind of why I'm actually here at the meeting, because I was very excited to learn that it was the uber team. They are such a family. Business I mean I literally live directly above them, and I could not tell you how considerate and respectful they are of me and just little things from being able to leave keys with them. If ever I have family and friends in town they are such a family, they've always looked out for me and just like nodding to their manager late at night, when I'm on the street, knowing that they're moving in to the new property I was just like. Okay, good they've got this because I know what they are. I know what they they're made of, and you never know when things are getting pretty barren. You never know I mean half of the block seems to be shutting down to build high rises. I have no idea what's going to happen on this block, but for me personally to know as the family business moving into that space is a huge relief. Thank you very much. The Jaguaena, oh Eisen, go ahead, Jack hi! Thank you, I appreciate it. I'm sorry it's my second comment, but just for backgrounds and as to why I'm making the content I happen to be by profession, a law professor and it's a basic tenet of the laws that we treat all equally situated people equally. So when there was no complaint about music from the establishment itself, but only from passing buskers who are not under the control of the establishment. The fact that there would be a suggestion to expert rules to the restaurant just strikes me as inappropriate, even if the restaurant may think it's fine I, just think this isn't the way to conduct this business. Thank you are you talking about the traveling music or the closing of the doors at 12? There was only a criticism when it came to music of the outdoor traveling buskers. Okay, thank you, but you know again the restaurant, as you know, and everybody knows, the restaurant has no control about them exactly so. My concern is where there's been no suggestion and in fact, I walk. I'm on 74th and second I walk in this area all the time there are restaurants and bars that are noisy, even certainly not one of them, though so to say. Oh, we have them before us. Let's impose with absolutely no reason a requirement that doesn't apply to other similar establishment strikes me as inappropriate, just as a point of order. Okay, thank you, Mrs Brown, Good, Mrs Brown. Thank you for acknowledging me. I was feeling as if I was a potted plant, because my hand had been raised but overlooked. I am sensitive to anybody wanting to earn a living and I am sensitive to Messimo's plate with this specific restaurant. But I am concerned about the resident who expressed her concern about the noise beyond 10 pm. We need to take that into consideration. They have a 50 ratio with food and drink 11 A.M to 4 a.m. Every day, I just think. That's a bit much I think a stipulation I can support this application. If there's a stipulation that the doors and windows must be closed at 10 pm and no music after midnight and with regard to the last gentleman who had spoke regarding some restaurants are able to do to extend the hours and so forth, and some aren't I think we need to look at the future and as each application comes up to make the correction and I know. This is a difficult time and I feel very badly that people are suffering. I know it's a loss of income, but we must be sure to remember the community, the people who have to go to work, the people who have subjected to noises and so forth. That's all I want to say, and it's a fine line and it's complicated and thank you Russell thanks yeah, so just in response to Professor Weiner and some of the other points that have been made. I would just say that it's very common for the community board to impose some kind of stipulated limitation when it comes to live music on the time that it goes on. It's something that we do very regularly to with applicants who come here. So it's not a question of treating this applicant differently and you know when I raise the issue. I think you know generally I mean I, think live. Music is great, but I think usually it has additional noise concerns that you know that pipe music doesn't have, and so that's the reason and my proposed stipulation was just about live music, so I think live music. You know cutting off it at midnight which it sounds like that's the applicant's okay with is yeah I mean that I think is pretty reasonable and anyway, I just wanted to make that distinction between the live, music and the pipe music and I. Think in terms of the window. Closing I mean I. Guess you know, I'm not sure what to do about that, because right now you know, on the one hand, I don't think any restaurants are able to stay open past 10. Currently, so it's mood now, but obviously we're looking ahead. You know past that and at the same time I think you know when people are indoors and when there is indoor dining it's safer to have the windows open right, and so we we've got these considerations about what we're doing in terms of the temporary kind of Covid-19 related things that we have to deal with and what you know trying to tailor things to that and also you know, this is going to be obviously a license in place for a while. So you know, for that reason, for the Covid-19 reasons, I'm you know, I think my preference would be to allow a kind of later time for the windows, but you know I, don't know how other folks on the committee feel so I think you know it makes sense to have some cut off for the windows that to me it makes sense to have it track the time for the for live music. But you know if others on the committee won an earlier time. I guess we could vote on that. Also interesting points. Yeah Marco go ahead. Thank you. I I'd like to put a motion, the motions to approve, if somebody seconds and then I would like to speak. Okay, the motion is to approve, but with my question my point is very simple: first, with the professor, we have a lot of tourism and the community work, so don't worry about plenty attorneys always, and the situation is I know very well, since I moved I think around 25 years ago to the community. The Uber was already right here and there has been many years and I never hear any complaint about the restaurant and I think we, this restaurant. It should be maintained in our community because I never hear in a complaint in 14 years in the community war, as a member I, never hear any complaint about this restaurant, so I think it shows a good pattern of they behave very well. The only part that I would like to see if Rosso wants to allow this friendly amendment is that you have to be in compliance with the code and that's it and Russell. He rises are very good issues. I think I. At this time you can not go open. More than 10 o'clock or 11 I see I think is it ten or eleven, so it won't have a problem during the Covid-19 period, but after the copy period you then we can probably we had to rediscuss all this issue, but at this level we have to support your business. We would like to support all the business because we need that- and this is part of the economy and I- understand that the restaurant produced one trillion of dollars to the economy, and so it's a main issue of the of our economy. So therefore, I will strongly support your application and I never hear anything about this, except that is quiet and always operate properly, and thank you, Michael Thanks, Micah, Mrs Brown hold it Jay Levine from the public. Okay, let's go Mrs Brown, then we'll go to Jane. Mrs Brown, yes, I want to make sure I'm clear Marco made a motion to approve this application with the stipulation correct. Thank you. That's all may I just say one. What I think will be the last thing, I think is Mrs Brown that the potted plant, who was raising her hand, is that the one the lady yeah she said something that was very nice and that she empathized with a restaurateur which I'm not even going to get into the hardships of 2020, because you guys don't have all night, but then rightfully so. She also empathize with the resident, which is I, believe she's, a community board member, so she's doing exactly what I think a community board member should be doing caring for the business and also for the resident I just want to repeat in case it got lost that I believe when I answered the resident who lives a few buildings down. I believe I explained that the location we're discussing right now is further away from her apartment than my other location. That has been in business for 16 years. That has not received noise. Complaints and I also want to just point out one more time that the address she was referring to is a property. I have never had anything to do with and is not for this application. I. Just want to respectfully explain that in case there was any confusion in well. Thank you for the clarification and is the resident still who had a concern. That's located a couple of blocks away. Is she still online? Do we have her name? I'm sorry, I think it was the Jay Levine that has her hand up okay, well, perhaps Massimo you could reach out to her. Maybe you can give her your phone number. If it is a problem, she has access to you and I'm quite sure you two will be able to work. It out sure do I. Do that here. Do it offline, okay, she can come and see you I mean you know. She knows where you are. Okay, no problem. Thank you very much and we have an Iphone, whoever that is Iphone in the Orange shirt. You are yeah hi. How are you can you hear me? Yes, I've been a friend of mine, told me about the green kitchen. I I've gone that's later on we're talking about this is later on the under new business. The right I may not be able to be here for that time. I just wanted to make a note that I hope that it can stay in business and keep its liquor license and remain open. Can I put my two cents in for that now, and you can have me vote on it later, because I don't know how long I can stay here. Okay, we'll mark that down. Okay call back later on, and you know it should be too much longer. I hope all right, I'll try to stay on. Thank you, okay, thank you! Russell! You had something else yeah, so I just wanted to clarify. You know to the extent that it's my resolution or my stipulation that we're speaking to I mean my preference is for midnight for both for the windows and for the okay I. Think that's what that's! Okay! So that's what I want us to yeah, but I think the problem that we have now is under the Covid-19 rules, there's different stipulations, different regulations, different everything. So we've got to be careful with anything that we write that it's for two years, because they sorry well all right, so I think the basically whatever as I understand it I mean I, think whatever regulations or rules the governor is imposing because of Covid-19 those are going to take precedence over whatever's in any thing anyway. So the basically the liquor license that we're voting on and the stipulations that we're voting on are what's going to apply in the absence of any of that stuff. When you know, hopefully we get past all that someday, and so you know, notwithstanding, obviously the fact that they may have a later time that they're allowed you know, while 10 is the rule under coved they'll be open until 10, while 11's the rule they'll be open, till 11. I mean that's separate, I think from the license, so that the and I you know I accept Marco's friendly amendment about you know. Like we've been saying you know, everybody should be following the Covid-19 rules which they're doing but I. Think given that they're, you know. Obviously a very good neighbor I mean to me. Midnight is I, think fine for both so well I think we all know if people don't follow the Covid-19 rules, there are consequences both from DOT and Sli yeah I mean they're and they're clear that they I mean they've, been following that and they're going to follow that. So I'm not yeah I, don't have any concerns in that regard. I, don't think anybody does so okay, so the stipulation the will be you know, approved with a stipulation of live windows and music closing at terminating at 10 o'clock, midnight, yeah, 12 o'clock. You keep saying 10. Oh I'm sorry, 12 o'clock, yeah midnight, I'm reading 12. yeah 12 o'clock and to follow the current Covid-19 rule covered Covid-19 rules and regulations. Was that a yes Massimo? Yes, thank you! Everybody! Anybody, oh Valerie. Let's see what Valerie has to say: hey, I'm sorry, I'm getting here late, I'm just what is the motion I just the motion is to approve with the stipulations that live, music and outdoor windows will be closed by 12 o'clock and to follow the current covered rules. Well, outdoor music, where there is no outdoor music from live indoor music. This is for indoors they're applying for indoors. They don't have an outdoor area, so the live music and the windows will be closed at 12 o'clock and they will follow current Covid-19 rules. There is nothing about the outside and that's every day of the week, yes yeah well I mean I have actually heard that coming out of some other places and it's extremely loud and really disruptive to the people who live above these places. Well, we've heard from a woman that young lady that lives upstairs to uber. Then, if you know the Lusadi locations, they have been there for many 30 40 years depending on the location, and they have been well from what everybody knows. Very good people to have in the neighborhood and their locations have not been they're, not a bar they're, a restaurant and most of all do not like loud music, no I know that's why I'm okay, indoor or outdoor? Yes, okay, anybody unless you're voting, no or abstaining if you're voting, yes, okay, I mean I. Just worry! How we're going to differentiate I mean I'm fine and I know. Lucaries is going to be a good neighbor and if somebody says that it's too loud, I'm sure they're going to do something about it. So I guess I take back my reservation with respect to Los Sardi's, I'm just I'm thinking about a couple of other places that are along 2nd Avenue right now that are doing the same thing that I, don't think have come before us and so yeah sorry, anything else, Massimo, Grant or dad well, say one more thing and the young lady they just she wasn't here before so we're not about loud music we've. Never not. Now we haven't been about loud music for 40 years and we're not going to be about loud music going forward. My son is just trying and with and obviously with my help to do something for himself something and I think that anyone who's trying to do to open a new business these days should really be not only uploaded but helped because, as you all know, we've been through so much in the restaurant industry and restaurants are shutting down all over and someone's actually have the courage to open. Under this circumstances, even one hour, you know it's really could be a big help in the long run for the survival of a new restaurant. So oh I appreciate that. Obviously I get your concern and I'm more for it. But let me just say one more time: we're not about we're, not noisy people, we're not about making noise, we're about I, think serving good food and that's it so and continue. We will continue to do that. Okay, let's I, know Barry's had his hand up and Jay Levine they're, the ones who spoke before if they can get together with Massimo discuss what the concerns are. I'm sure that they will come to some agreement between them. Okay, it is time to vote if you're, abstaining or voting no raise your hand. Otherwise it will go down as unanimous approval with the 12 p 12 P.M, Russell, 12, P.M, Live music and windows closed and also follow the cover the current Covid-19 stipulations. Okay, thank you very much and for the video record, the same members are still in attendance for item 1c in addition to Valerie Terrific, okay plus Valerie Mason, oh plus Valerie. Yes, do you want to clarify that it's supposed to be 12 a.m because you had said P.M, so I just want to make sure I'm yeah 12 midnight. Let's put it that way. Okay, thanks! Thank you! Okay, I can leave it at 12 p.m. If you would like thanks man bye-bye thank you bye, okay, what are we up for next 77 tapas? Yes, that is correct and I think I see the owner waving his oh. He just oh I, see him I'm going to keep moving owner, you're, unmuted, okay, 77, tapas, 303, 77th, street representative and 60 40 drinks. Anything else! Let's here are you going for a full liquor? Yes, fulika, and would you like to tell us what you intend to do and where it is by the way, I'm sorry, I'm the manager to interrupt the Charles, the owner with the name. I. Think you unmuted him. Now he is with us. He's our representative, hello, Charles Lynn, I'm the attorney for 77th. Papas! Okay! So tell us what the first of all the location is at 1,303, East 77th street. That's the corner of 77th and 2nd Avenue. It previously was the premises for Ella, but they've been out I believe for about a year and a half we're going to operate as a tapas restaurant more towards a mediterranean type of menu. The capacity of the premises is about 60 people. Our hours of operation will be from 12 noon to 12 p.m. Midnight the! As you had said, the percentage is 60 food, 40 liquor. The bar will only have from five to seven bar stools, so it is basically a restaurant. There will be no there'll, be background. Music, only no live music and I. Think it's important that the owner Suleiman has Als is also the owner of a La Turk, which is on 74th and 2nd Avenue and been the owner of that premises for about 13 years. You this license is for the indoor and outdoor, because wasn't there a sidewalk cafe there? Yes, there'll be a sidewalk cafe, and it's in my understanding that we have to come before the community board once the outside cafe has to be voted upon at that time, but the liquor license covers the outside that this will be covering. It will be covering the outside gap, good, okay, and when do you intend to open probably about March or April? You know about the surge and everything how things are going. They did have a fire in the premises. So a little bit more construction probably has to be done, but probably I would say between March April is a pretty good reasonable day. Who has the street seating? Now? That's not! You is that next door, that's the next to what people yeah! Okay, any! Let's go to the public Suleiman you're, a part of it Jay Levine, J Levine from the public, I'm not bypassing you Mrs Brown hi, it's Denise Levine again, so the people who were at Vero before I guess Bella. Before I'm sorry, I guess many people on the board are aware, played loud, music and had late hours, and our bedroom is two stories above them and we never slept. So. That was why, even though I like lucardi and I, like Uber I, mentioned my concern about late hours and music, so I'm glad to hear that the tapas bar would have no intention of having live music nor be open. Past midnight I was wondering if they could put that intention in the stipulation. Well, their house of operation stipulates that that's what they're going to submit to the SLA. So they can not operate past 12. So there's no need for us to put it in. The stipulation. Is that going to be in the SLA? Is that what it is? Yes, because when they stayed the house midnight, they have to close at 12 midnight regardless if they want to stay open or not? That is the hours that they're submitting to the SLA, and that appears on the license at 12 o'clock midnight they do close. Is that what it's going to say? Mr, Lynn, absolutely yes, yeah and the chairman is absolutely correct with regards to the 30-day notice and the decision of the board or it becomes part of the application with the liquor authority. So it's absolutely mandatory that it be followed. Okay, so then I understand it'll close at midnight and you don't intend to play live music. That is correct. I have no objections. Thank you and by the way, Denise. If you'd like to go and have a chat to myself, you two can get together on the last applicant I like his restaurants. It's not that I object, I'm just we. Our bedrooms face second avenue. So when there is, our block has become so. My concerns are extraordinary right now, because I mean we like I, said I, have we don't sleep at night with the noise yeah? True? Well, isn't there going to be something on the North West corner of 78th, eventually, that'll be in something else: okay, let's go to the public Luna. Can you one mute? Luna I have Luna you're unmuted? Yes, I'm unmuted! Yes, thank you. I would like to say that the owner I'd like to say that the owner of 77 tapas has another establishment that has been flouting the social distancing, outdoor dining copadrill, since the Covid-19 rules have begun. I would point out that the other establishment, a la Turka, has three to four times. The number of 311 complaints of other restaurants in the neighborhood and has an unresolved DOB violation regarding construction. Further notices of today's application for 77 tapas were only posted to this afternoon, evidenced by the fact that they're pristine, given the weather we've had over the last few days, I, would ask the board to review the 311 complaints to walk by the other establishment on a Thursday, Friday or Saturday night, and to ask for remediation of the violations of the other establishment before making a decision about medication. Thank you yeah thanks for that. But the problem is we're hearing 77 tapas. Tonight they may own the other one. What we can do is have the board. Have them come before the board, specifically on Ala Turca I, don't want to mix the two different locations. This is one thing that they've stipulated to 12 o'clock: closing no music, no well, the outdoor will come later on, but if you we can have Alaturka come at the January meeting. If that's agreeable he's shaking his head yeah, I'm sorry! If that's what the committee decides, we have no problem with that. Okay and you represent Allah. Also, yes, I do okay and then you'll be coming before us in January. That's correct! Okay! Is it for Allah not for 77 tapas, because someone else with the name Iphone is raising their actual hand. Oh okay, can you unmute them? I just have go ahead: Iphone go ahead! Hi, I'm Denisio, Fontana I own two, five four and two five, two East 74th Street, where La Turco is right in front of my building for the last 13 years as a neighbor, I, couldn't say more highly things about this guy of keeping it clean. I have no complaints of my tenants, complaining of anything for 13 years now. I couldn't disagree with this guy before what he was saying. I, don't know where he came up with that, but I've been a neighbor there of him for 13 years. I've been on that block for 30 years, so I just want to support him. I think he's doing a great job. I think his restaurant is one of the best looking ones that he did. He spends a lot of money. He makes it look good and I'm just 100 percent support wherever he goes. Thank you. Well, if there's a DOB violation that goes to the building, if it's social distancing, that's something else that that's an SLA or a DOT in 311, we will have the 311 cause for the January meeting, so we will be in a better position to know what is going on with the with Ala Turka and anyway, if you can come next in January meeting, okay. Finally, Mrs Brown you're in Munich. Thank you. I wanted to ask if there was going to be takeout service, and if so, are they going to use a third party or do they have their own delivery men and right now there is no real thought of having delivery, but I did file with the board the affidavit that if there is we'll, certainly follow all of the guidelines and regulations of the city with regards to that, but right now there is no idea of about serving delivery right now. Thank you, Jack Wiener again. Thank you very much. I'll try to keep this short. My comments are much the same as my comments were about Uva. As I said, I live on 300 East, 74th Street, so I'm close to both of these establishments. I think those are the two of the very good establishments in the neighborhood I think we have to support them and I guess I'll show up at the January meeting. I thought those comments by of complaint by the other gentlemen were quite peculiar, as anybody who's in the neighborhood and goes to the restaurants. Here knows: Ala Turka puts all their cutlery and sealed plastic and gives their patrons not only the cutlery but a mask to protect them from Covid-19 every customer who sits down there to eat. It's bizarre to me that this fellow would say this is a problem worse than others in the neighborhood, and maybe there are a lot of 311 calls I wonder how many trace to this fellow, that's all I have to say thanks. Well, let's keep comments and feelings about Allah Turkey for January Marco all right. Thank you. I would like to call the question for approval and then to speak. Okay. Well, I'm I just checked the location, the 303 e 77th street that do not have violations. That's the application that we are discussing today and there is no violations and therefore I think we have to support that application. Thank you. Well, that's the violations which go to the building, but we don't know about 311 course. No, I'm referring the abilities on yes. Thank you anyway. We'll hear it in January they volunteered to come back Barry you're, going to call the question. I assume, yes, call the question, please: okay and again, if you're voting, no put your raise your virtual hand if you're abstaining raise your virtual hand, otherwise it'll go down as a unanimous approval. Okay, all right and I just asked two quick questions. First, yes, we'll have to send another notice or what I will be advised and my client be advised of the date of the next meeting. So I don't have to do anything else right now, I think the board will send you an invite. It's you know it's just that we want to find out what is going on with the 311 and if the you know, the gentleman has said, there's Covid-19 rules and everything else, so we just want to and it shouldn't take long, hopefully just but that way everybody will be in the know, the public and you what is actually going on, and the other thing I wanted to ask- is any possibility of waiving the 30-day notice so that I could get the application into the liquor authority as quickly as possible. For this one I. Don't I've got no objection. The board. Can I'm fine with it? Okay? Is that fine will not yeah we grant one-time waivers for each establishment, I would say. Usually they are contingent that you attend the next meeting. But since you attended this meeting, we could issue that letter waiving a 30-day notice and just know that it is a one-time thing, you will never get another one. Is that one time a month or one time, lifetime forever perpetrator and ever thanks will love you about the email to me. Yes, follow up with Murad I think who you were communicating with yeah and he'll. Get you that letter. Thank you very much. Okay! Thank you. Okay, that's the agenda for tonight exactly to say for the video record, the same members are still in attendance for items good. Thank you! New business, green kitchen, 1619. Second, Avenue are they here, but actually it's actually Peter Casimis he's gonna he's the owner and he will be speaking. Thank you, okay. What do you have to tell us? Well, first of all, can you can everyone hear me? Yes, okay, thank you. Well we're I'm here this evening to try and gather support from the community. I was hoping. I could give a really quick kind of background on our operation who we are within the community. If that's okay. Well, what is the? What happened? Let's hear that we know most of the people in the area know that the green kitchen give us the synopsis of what happened. Okay, I will give you the synopsis. I will try and make it as short and respectful of everyone's time as possible. So my name is Peter Casimis, I'm one of the proprietors of the green kitchen. Again, I'm sure a lot of people know that we are a restaurant or two restaurants. I should say that have been servicing the Upper East side since 1931. my family took over ownership of the location on first avenue 14 years ago. In that time we've successfully operated. We have never and I want to emphasize this, never had any issues with the community or received any violations. More recently about three years ago, we decided to expand our concept and, after a roughly 13 months, construction process and a seven-figure investment on our end, we expanded and opened a second location on 2nd Avenue up until March of this year, we successfully operated in that location, again free of any complaints free of any violations and effectively. We were basically working our way out of the red after a pretty sizable investment on our part, unfortunately- and I'm sure many people can understand, this March changed our lives very substantially, not only from an operational standpoint, but also from a family standpoint. My father, who was the main operator of both businesses very sadly, got Covid-19 passed away at the end of March. Obviously, this took a tremendous toll on our family and my brother. My younger brother, basically at the time, tried to step in and navigate through the chaos through the different Covid-19 restrictions and kind of all the craziness that I feel that a lot of the other restaurateurs can acknowledge and empathize with. During this time, we regrettably made several mistakes operationally and basically here this evening to try and gain support and hopefully try and explain the changes that we're trying where we are implementing going forward in order to remedy any of the issues. At the end of October, we had an SLA agent come in and after a lengthy inspection, we received again several violations and about a week later, our liquor license was pulled and I just again want to emphasize the fact that in the month that we've had since then we've taken every possible measure to rectify the different violations. You know, I have a lot of supporting evidence and documents here. I can't I didn't know that I could possibly share them this evening, but I have several photo records of the remedies that we've already or the what we've already remedied. I have a remediation plan that I was kind of hoping I could detail this evening to outline the changes that we're implementing. You know, in addition to trying to make changes, we've reached out to several members of the community. We've got an incredible amount of support from some of our patrons. We have over 275 letters of support from our customers and we've also gotten letters of support from a few of the charitable or the organizations. I say that we typically or regularly support, including the DOE fund in summation. You know I'm here this evening to offer my sympathy and my regret. Our establishments are not by any means bars or nightclubs. We are family oriented restaurants and I'm here again to emphasize the fact that the numerous violations that we received, while egregious and I will 100 admit that they are not systemic problems. These were poor decisions made in reaction to the most challenging landscape that the food and beverage industry has ever seen us specifically and again. This is something that's in flying the face of all operators right now, but you know we're a relatively small operating group. We made a massive investment. You know we were really behind the eight ball on a few different ways and unfortunately we had this colossal storm that hit us again, both from losing my father to this horrible disease, which knocked this down to men in terms of the operational structure and also, obviously us being prohibited in terms of our ability to generate revenue I. You know, I appreciate the again the opportunity to speak here, I'm basically trying to come forth tonight and again express my deepest sympathy and remorse for all the mistakes that we made and I'm hoping that we will be considered or supported rather I, guess so that we can apply for reconsideration for our liquor license, because it will be nearly impossible for us to continue operating without that. I'm here basically pleading on behalf of my family, our 60-plus employees and more important. Most importantly, I just say the community, which we're hoping to continue to serve in the manner that we were doing before this terrible disease ravaged our city. I just want to thank you for the time to speak and, most importantly, I think for me this evening. In addition to kind of pleading, our case is to be able to hear from the representatives of the community, I'm all ears and we're trying again to make all possible changes so that, if you would consider supporting us- and we can actually reinstate this license- we can go forth and operate in a manner that is fully compliant and beneficial to the neighborhood. Thank you. How many violations did you receive? I have the summary here of the violations in front of me: were they all from? Were they all from SLA or DOT, or so we had a substantial amount of 311 calls and we had about 30 plus violations when the SLA officer came in I will say this much and again, I'm not trying to make any excuses. The way that this is structured currently, which was surprising to both myself and my brother, was that the SLA agency has effectively been given autonomy over all other agencies right now, so the gentleman that came in representing the SLA did an hour and a half inspection of our store and he covered what would normally fall into the purview of the SLA. The department of Building Homeland Security, the health department. So we received a bunch of violations, we've remedied the vast majority of them and I have a plan in front of me now that I can share to remedy I what I believe to be the most pressing issues that have faced the community. Well, wait a minute, so the SLA only came once no, the SLA came a few different times, and then there was one actual inspection and what they also documented was the fact that the police had come numerous times now we have a good standing relationship with the local precinct and all I will say on. Our behalf is that the vast majority of times that the police officers came, which was in the height of kind of May, June and July when there were the bars which we participated in and congregation of people, the vast majority of times the officers came and simply dispersed the crowd. We never were given a warning by the police officers that we had to stop what we were doing or anything of that nature. So we have a pretty lengthy rap sheet. I guess right now, but I just wanted to emphasize that. Okay, let's go a leader we'll go to you first, you don't have to if you want to hear from the public, but thank you. This is me speaking personally and not as the chair I was I, wouldn't have believed what I had seen on the corner of 84th and 2nd if I hadn't actually seen it myself- and this was in the summer- it's so much worse now with people congregating with music with. If you didn't know that you weren't supposed to have people congregate, there then shame on you and you weren't, paying attention to the news. What you did was put people in the neighborhood in danger for their health. So when my 20 something year old, kids, don't want to walk on the corner and want to cross the street when members of the board in their 70s don't want to walk anywhere around and would rather cross the street and even maybe go on a different avenue because of the extent of the crowds. That's really saying quite a lot if the SLA, if the police came and only dispersed the crowds that should have been a warning to you that you were doing something wrong. It's not that you were playing music loudly. It's not that you were serving liquor past your closing time. It's not even that you have too many chairs under normal circumstances. Oh- and let me just interrupt myself by saying- please accept my condolences on the loss of your father. I could only imagine and probably not enough how horrible and tragic and full of isolation and everything else that must have been so I know. That was a terrible time and we all because we've heard how much restaurants and bars are suffering now, but other establishments are able to comply with the laws without a number of violations without the excuses that you've come here. Given a restaurateur someplace opening a restaurant in the neighborhood has complained about what you are doing, because what you do when you have those crowds- and you have those people- is one bad apple spoils the barrel, and that's all I'm going to say is that it's unfortunate what's been going on in the neighborhood, but by having people congregate by flouting the laws. To this extent, it feels that you have really endangered people's health and people shouldn't have to cross the street in order to avoid the establishment- and you should know- and I'm sure that there are ample opportunity to know what the rules were all along and they've changed, and you just didn't change with them, even as they became less restrictive. So and again, that's me personally, but I was really upset months ago when I saw and it just hasn't, really calmed down as far as I could tell so. Thank you very much cause. Okay thanks! So later, let's go to the whoever the Iphone is: I'm not muted, now hi, my name is Mark Helfco I live at 524, East 79th street Manhattan down in basically in the neighborhood. I've been going to the green kitchen for 40 years on 77th street and first and then, when they opened up the place on second Avenue I went there too, and I've enjoyed it and I just really appreciate the service that I've had there and everything that has been going, that I've seen there and I haven't been there late at night. So I don't know what's going on in the street, but whenever I've been there it's been fairly, you know a calm situation and I don't see and I, and the owner seems very honest and willing to work with the city to alleviate the problems that they do have so I think they should get back to get their liquor license back and they should have be able to stay open, I think it's a help. A helpful place for the neighborhood I think it's a good restaurant and I'm in favor of them. Retaining their getting back to this liquor license and not closing that's what I think. Thank you mark who's. Let's go to Jack Weiner again! Thank you, sir. Just a couple of comments or three comments. Perhaps first of all my condolences very sad about your father number. Two I'd like to hear more about something that has been skirted, which is the nature of the violations. I'm far less concerned about a violation for staying open. Five minutes later than allowed than I am for a Covid-19 related violation and I have a family member right now, who's, sick with Covid-19, and I'm very emotional about that and I think this is what we really have to focus on and if they're Covid-19 related violations well, I'm extremely upset by them and I think those should be weighed heavily and then. My final point is I live in the neighborhood, as I've mentioned, and I used to go to green kitchen. A lot I used to go probably four days a week and I happened to have a service dog and I repeatedly received comments from staff there that I couldn't bring the dog in and I insisted I. Could I'm a law? Professor I showed them the law I would still get the comments. I spoke to I believe the younger brother of this gentleman. Once the problems persisted I didn't make a 311 call and I didn't contact. This group I simply stopped going there, but for him to say that there haven't been problems with the community, at least speaking from this one. Member of the community's perspective. I've had deep problems that were not addressed. Thank you. Anthony Calzano go ahead. You have to unmute, okay, thank you, hi, I'm a constituent, I'm a resident from 555 east 78th, I used to live at 325 e78 and I've been going to the original green kitchen on 77th for 10 years or so, and last year, I started going to the 84th street location because I go to a couple of places up over there and it I always had pleasant experiences and obviously then Covid-19 Hit and I noticed the 77th street location. I had to shut down entirely because they had no space for outdoor. So 84th was the only spot and I was there in June, and you know, I was there to have a meal with my girlfriend and it was lovely and I noticed. There was a crowd and it was a lot of young people coming out. You know this summer and they had just been. We had just come out of lockdown and yeah I, don't really know other than just closing their door for a while I, don't know what it was that they could have done about that crowd. I mean the cops, came, people just moved a couple of stores down, and it was a lot of the two gold people hovering around and all so I'm I was just came here to support the green kitchen because I just thought it was, you know a nice little escape and there were summertime problems, but you know living on 78th street. We had the same problems on 77th and 78th and I think it was a unique covered kind of dilemma that went on and I just wanted to give some support to the green Kitchen. Thank you. Russell thanks. So I just have questions about kind of procedurally. What is going on because it's not entirely clear to me kind of what we're at so from what I can understand. Their license has been pulled and I guess they are applying to have it reinstated, and so we are, you know, voting on whether to recommend approval of that or not. Is that basically right? It's like an application for reinstatement. Is that the procedure that we're talking about yeah I, don't want to speak for the applicant, but I think it's. They want support from us supporting them to have their license reinstated. One question to the applicant: how long is this for? Is it indefinite the suspension? Yes, it's essentially pending right now, I mean we're again we're trying to get our license reinstated. We don't know exactly how long we're going to be suspended, but we're hoping again that we can remedy all of the issues and get it reinstated sooner rather than later, because, unfortunately, and again, I think a lot of people with industry experience would agree, it's very difficult in today's food and beverage landscape to stay afloat and in business without an alcohol component just based on margins, but hasn't the SLA remediation process. You get a what a thousand or ten thousand in the fines are. What anywhere up to substantially more than that yeah substantially more than that, so basically, we attempted to remedy the issue by documenting the fact that we had made changes and implemented or put in fact, put in place different protocol and basically suggested a fine amount that was rejected by the SLA. So now we're applying for reconsideration and again, the main reason why we're coming before you this evening, at least I can say this from my end- is to explain our story. Try and you know, express our sympathy and our remorse here. Any suggestions that you know the community may have in order for us to resolve the issues that have caused this. You know this unfortunate situation and then, hopefully outline the changes that we're putting in place so that everyone can kind of understand what we're doing on our end. Okay, so you're still in the process of negotiating with SLA, so you've had one meeting with them already, yes, so I just want to raise. This is goes back to kind of my procedural point, but also a larger point, so I from what I understand. This is a kind of a late addition to the agenda for this evening and I think you know there are some folks from the public here, but I. Actually, my impression is that if we gave notice of the fact ordinary notice of the kind we usually do and the fact that we're going to talk about green kitchen, my guess is that we would have a lot of people coming out to talk about this, and so it seems to me that maybe we should just you know, put this off to the next meeting, and that way you know we'll be able to hear. Especially since the point of this, it sounds like it's to hear from the public. You know we'll be able to hear more from the public and you know would be nice to see something in writing ahead of time about what the proposal is, that we're meant to be assessing and all that kind of stuff, so that I think that would be better okay, well taken Marco yeah I mean you know to everybody. If we're gonna, you know, as Russell says you know, we should be following procedure. This was a last-minute edition under new business, but if we're going to be voting on it, then I think the public has a right for what we do and in this case, as Russell has stated, we haven't notified the public. So this would just be the public that's now tonight at the meeting and the board. So theoretically, the public has been left out of the discussion. I would agree with Russell that we take this in January publicize it, and then we have the meeting in January first Tuesday in January, and then the public and anybody else that will come even I mean even if we say if we approve tonight the SLA isn't going to do anything for months. I mean the way they're going and they have their process and I think this is something beyond us. Anyway, let's hear Marco. Okay. Thank you. First, please receive my deepest condolences of your father. I'm really sorry to hear that. But my point is very simple: Russell. He established a good point which basically is the regulations for the public open meetings, so we have to notify the public whatever it is, but what I think is most important for me to make any decision is. I would like to see what is your problem specifically what you did and what how you plan to mitigate, because if you don't mitigate properly or we don't find, that is enough- the mitigation why we have to support your application. So we need that. You spell out every single details, all the errors that you need and present to us, how you trying to correct. So then we can say. Yes, he has remorse he's sincere and he's gonna do the right thing, but if you are coming just only two spreads just on general ideas, because we don't know the magnitudes of this problem, we would like to know that the public would like to know, and then we can. If you see that in your mitigation plan, correct all of them properly, then we can support. Otherwise it will be very hard for me to support at this time. Thank you thanks. So much is it possible for media to jump in at all during this process, because I know that the other operators were given yeah? Okay, but you know yes, so just a call if I may just a couple items here. First of all, wait a minute before you go, I mean what Marco is stating is that he would like to see the whole plan and to go over it tonight. I, don't think it's fair to you to the public and to the board members. I can totally understand that and I grasped that concept, one of the issues and part of the reason that we're trying to basically resolve this issue. You know our status I should say as quickly as possible and by no means are we trying to belittle the charges that we're facing or the situation that we're in, but unfortunately we are essentially operating at a loss because of this restriction currently, and it is literally every single day we are again hurting financially and again. This comes on the heels of everything that I was mentioning before in terms of the fact that you're already operating and I think again. Anyone with a good sense of where the hospitality industry is at this moment can sympathize. You know we're just we're trying to push forward as quickly as possible and do everything in our power to remedy this problem because of the fact that the longer we go, the greater the likelihood that we will not only have to close the one location on second avenue, but also, in fact, close, the first avenue location because I believe, as Tony mentioned earlier, we've essentially been subsidizing that location through the second Avenue location. We have no outdoor seating. There we've been at a 25 occupancy since we've been allowed to do that. But you know you can ask any restaurant tour 25. In many cases it's not even worth opening the doors because it doesn't pencil out. You know. I was hoping just to address a couple of the things that were brought up. If possible. You know I think I mean, as has been stated, I mean it wouldn't be fair to the public. If we agreed to something that they're going to disagree on so for the public meeting and for us to make a decision- and you know we are only advisory, so the SLA is not going to take any notice of us anyway, especially in these days. I think everybody sympathizes with you I think everybody knows what's going on and everything, but at this stage I don't want to skirt around any open meeting rules and favor one side and against the other Valerie. Let's hear from you, hi Peter I just want to say how sad I was to hear about your father's passing. I've been a long time patron of the East 77th street location and he was a great guy and I really enjoyed talking to him when I went in there. I have to tell you, though, that I agree with everything that the other board members are saying in terms of we can't vote on this tonight, but I want to go a little bit further than that. If you were asking me to vote tonight, I would have to vote no because you're not really I. Think if you we're going to put this on over I, think till the next meeting I would tell you to come prepared than you are this evening. You touch and you're not telling us how much fun being responsible violations were going on, and there was you know the quote: unquote: New Orleans, Atmospheric Avenue and in on television you were saying you were trying to be as compliant as possible. Are you really going to ask for support to come forward as mark and others were saying, with a plan? Tells you how you're going to stop the situation from what was going on? There was really out of hand. A lot of people were telling me that I couldn't they were talking about the green chin and in terms of the other location. I know that you don't want to. Oh I mean you have the windows there and you could put something along the street there on the side, like a lot of other restaurants. Do but I don't want to get into that. I. Just think that if you're going to come to the meeting the next time, you need to come a lot more prepared to tell us what your remediation is. You need to be a lot more straightforward on all the violations and what the SLA is actually asking for now in terms of the penalty. Thank you. Thanks. Valerie Barry move the table to January meeting. We all I guess there's no discussion on that anyway. So I think this will be put on the agenda for January any documentation that you have. If you can forward to the board office and we'll put her on the agenda for January, anybody else have any old business new business. Do you have anything a leader, yeah I, see your hand up, went down. Anybody have anything cause. I just wanted to say for the future that will Breitball has been the recipient of a lot of complaints about the green kitchen on 84th street. So please be sure to be able to call on him because again, a lot of people in the neighborhood have complained. I meant to say that earlier. So thank you yeah. You know. I just got stuck with this tonight: Abraham was running late and I found out that so I had no idea and then I see the green kitchen on the agenda. So I was as surprised as a lot of other people. Okay, Marco. We are journeying. Thank you. Okay, thanks everybody we'll see you all in January. Thanks will thank Max, don't forget to thank Max. He was your host today thanks max, but thank will too. He helps me out a lot. Thank you and.",
            "summary": "The Covid-19 regulations, 25 of the solvents I, Think that's a compulsory thing that everybody will be applying I will be abiding by, but we certainly plan to abide by that as well.\nOkay, of course, It should be asked part of the resolution that they know all the applications we put into all these, even though they should we, but this good that we can put it in all the applications.\nI tend to not want to put this in the resolution because everybody knows what's going on and.\nOkay, all in favor, okay, The way we're going to do this if any of the members just want to disapprove or not go along with it, raise your hand.\nPlease well, There is what we're going to basically say is that we approve their application, with the proviso that they obey the Covid-19 rules.\nMax, even if we don't say that they're not no longer legal or illegal, we should also make sure that the restaurants comply with the rules pertaining to e-bikes, because we all know the delivery guys are on the sidewalks and going the wrong way.\nFor 38, years, Massimo and Mauro have been operating Uva at 1486 and 1484 for about 35 years, they're they've been in the neighborhood for a long time, I'm sure everybody here knows them and they're.\nFirst of all, We want to thank the community board and the members for you know for doing what you do, and you know it's been a very difficult time and there Massimo and Maro are looking to expand.\nOnly thing that would concern me are late hours and music, because the people who were at 1480 second avenue played loud music till very late.\n303, East, 77th, street, The next item is 1482nd Avenue, so I would object to this new location only because of my concern about late hours and music, because right now there are many establishments that have liquor licenses on the block within 500 feet, 1490, 1492, 1494 and 1496, and that's just on the east side of Second Avenue, between 77th and 78th street and on the local blog next door.\nJust I think that to answer your questions one at a time the address on the corner is not gonna is not.\nAs, you know, This would allow more seats to be available and 2020 has been a heck of a year and the main reason why we have not to say that it's an issue, but the main reason why I believe you're saying that is because we've had no indoor dining.\nOf, So, I think this is quite the unique year to you, know: to.\nYou feel like I'm, just missing that concern, I'm just trying to explain why I think that concern will be alleviated not only with God willing, the you know the Covid-19 disappearing, but, furthermore, us having more seats.\nSecond time, I asked them nicer same response, the third time we called 311, because we didn't want to waste the emergency on 911, especially with you know, with the crime that has been going, on, And finally, We ended up calling 911 and the police did not come a few times because they asked what is your emergency.\nWe are I like to think that we run a very civilized and serious operation and definitely not about loud music.\nI think the music doesn't go all the way until closing time you know, particularly if a place is going to be closing.\nSo you know we can stipulating an earlier kind of cut off time for any kind of live indoor music that they may have going on and.\nSo, you know, if the applicant's willing to say that they won't have live music.\nI didn't catch the name, but a gentleman said that what if we agree to closing I, don't know no live music an hour or two hours before closing time, I'm, totally fine with that, because if someone's playing live music for that long, it's probably going to.\nYou're going to be, but we don't want windows and doors open if you're, playing music and really an open window past 10 o'clock is meaningless.\nYes, naturally, but I'm, but there's Al. We also have music at other establishments on the street and whose doors or windows are allowed to stay open.\nThinking of the other place, okay, I mean you're saying: Can we do 11 o'clock.\nMaybe the committee might want to consider, including that, as a stipulation that if there are disputes that the restaurant or the bar will willingly participate in a program so that they can try and resolve things with their neighbors well, I think Louisades has been in contact.\nI just wanted to say that it's a very friendly way to resolve things where you work out a time or you work out some kind of parameters of music or windows, or something so that it's not just the residents who are being satisfied.\nIt's, a voluntary program, but a willingness to participate sends a strong message that you want to be a good neighbor and that's usually I, would think well received by people.\nI think we all got to see the city when it was devoid of restaurants and devoid of action on the street and I myself.\nThe last one I actually lived above Barney's downtown when that closed and the area very quickly degenerated and became quite a creepy and spooky environment, So I have to admit living now on second Avenue, which I've always thought had like a really neighborhood.\nSo when the restaurant started reopening and coming to life, It was such a resonant reminder of what a relief that is just to have those faces that you see every day, just the feeling of like somebody on the street in existence and community and when Pookie shut down, which is my neighboring property.\nThey are such a family, they've always looked out for me and just like nodding to their manager late at night, when I'm on the street, knowing that they're moving in to the new property I was just like.\nOkay, good they've got this because I know what they are.\nI have no idea what's going to happen on this block, but for me personally to know as the family business moving into that space is a huge relief.\nI, think a stipulation I can support this application.\nIf there's a stipulation that the doors and windows must be closed at 10 pm and no music after midnight and with regard to the last gentleman who had spoke regarding some restaurants are able to do to extend the hours and so forth, and some aren't.\nI would just say that it's very common for the community board to impose some kind of stipulated limitation when it comes to live music on the time that it goes.\nI mean I, think live.\nI mean that I think is pretty reasonable and anyway, I just wanted to make that distinction between the live, music and the pipe music and I.\nDon't think any restaurants are able to stay open past 10.\nAnd at the same time, I think you know when people are indoors and when there is indoor dining it's safer to have the windows open, right, and.\nWe we've got these considerations about what we're doing in terms of the temporary kind of Covid-19 related things that we have to deal with and what you know trying to tailor things to that.\nYou, know, I, think my preference would be to allow a kind of later time for the windows, but.\nSo I, think you know it makes sense to have some cut off for the windows that to me it makes sense to have it track the time for the for live.\nAttorneys, always, and the situation is I, know very well, since I moved I think around 25 years ago to the community.\nMrs Brown, yes, I want to make sure I'm clear Marco made a motion to approve this application with the stipulation, correct, May I just say, one.\nBut I think the problem that we have now is under the Covid-19 rules, there's different stipulations, different regulations, different everything.\nWe've got to be careful with anything that we write that it's for two years, because they sorry well all right, so I think the basically whatever as I, understand, it.\nWell, I think we all know.\nOkay, so the stipulation the will be you know, approved with a stipulation of live windows and music closing at terminating at 10 o'clock, midnight, yeah, 12, o'clock, Oh, I'm, sorry, 12, o'clock, yeah.\nI. Just the motion is to approve, with the stipulations that live, music and outdoor windows will be closed by 12 o'clock and to follow the current covered.\nThey, don't have an outdoor area, so the live music and the windows will be closed at 12 o'clock.\nVery good people to have in the neighborhood and their locations have not been they're, not a bar they're, a restaurant and most of all.\nAnd I think that anyone who's trying to do to open a new business these days should really be not only uploaded but helped because, As you all, know, we've been through so much in the restaurant industry and restaurants are shutting down all over.\nThis is one thing that they've stipulated to 12 o'clock, closing no music, no well, the outdoor will come later on.\nI, don't know where he came up with that, but I've been a neighbor there of him for 13 years, I've been on that block for 30 years, so I just want to support him.\nWell, If there's a DOB violation that goes to the building, if it's social distancing, that's something else that that's an SLA or a DOT in 311, we will have the 311 cause for the January meeting, so we will be in a better position to know what is going on with the with Ala Turka.\nYou know it's just that we want to find out what is going on with the 311 and.\nOther thing I wanted to ask- is any possibility of waiving the 30-day notice so that I could get the application into the liquor authority as quickly as possible.\nWe could issue that letter waiving a 30-day notice and just know that it is a one-time thing.\nSure a lot of people know that we are a restaurant or two restaurants.\nAt the end of October, We had an SLA agent come in and after a lengthy inspection, we received again several violations and about a week later, our liquor license was pulled and I just again want to emphasize the fact that in the month that we've had since then, we've taken every possible measure to rectify the different violations.\nI've been going to the green kitchen for 40 years on 77th street and first and then, when they opened up the place on second Avenue.\nI. Think it's a good restaurant.\nI was just came here to support the green kitchen because I just thought it was, You know a nice little escape and there were summertime problems, but you know living on 78th, street.\nAnd I think it was a unique covered kind of dilemma that went on and I just wanted to give some support to the green Kitchen.\nOkay, so you're still in the process of negotiating with SLA, so you've had one meeting with them: already, yes, so I just want to raise.\nAnd I think you know there are some folks from the public, here.\nActually, My impression is that if we gave notice of the fact ordinary notice of the kind we usually do and the fact that we're going to talk about green kitchen, my guess is that we would have a lot of people coming out to talk about this, and so it seems to me that maybe we should just you know, put this off to the next meeting, and that way you know we'll be able to hear.\nYou know would be nice to see something in writing ahead of time about what the proposal is, that we're meant to be assessing and all that kind of stuff, so that I think that would be better.\nBut if we're going to be voting on it, then I think the public has a right for what we do and in this case, as Russell has stated, we haven't notified.\nI would agree with Russell that we take this in January publicize it, and then we have the meeting in January first Tuesday in January, and then the public and anybody else that will come even I mean even if we say if we approve tonight the SLA isn't going to do anything for months.\nYou know we are only advisory, so the SLA is not going to take any notice of us anyway, especially in these days.\nI, think everybody knows what's going on and everything, but at this stage I don't want to skirt around any open meeting rules and favor one side and against the other.\nIf you we're going to put this on over I, Think till the next meeting, I would tell you to come prepared than you are this evening.\nI know that you don't want to.\nYou could put something along the street there on the side, like a lot of other restaurants."
        }
    }
}