{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB1",
            "channelId": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "title": "11/24 CB 1 Monthly Meeting 2020",
            "publishDate": "2020-11-27",
            "shortDescription": "",
            "lengthSeconds": "3:59:10"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB1",
            "normalizedName": "Manhattan Community Board 1",
            "twitterName": "Manhattan Community Board 1",
            "youtubeChannelName": "Manhattan Community Board 1",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "twitterHandle": "@CommunityBoard1",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "CUgRedYtO0A",
            "fillerWordCount": {
                "uh": 328,
                "um": 437
            },
            "readTimeFullTranscript": "128 min read",
            "readTimeSummary": "19 min read",
            "wordCountFullTranscript": {
                "street": 49,
                "space": 47,
                "building": 40,
                "buildings": 37,
                "amendment": 37,
                "gold": 32,
                "bike": 27,
                "island": 24,
                "report": 23,
                "governor": 22
            },
            "wordCountSummary": {
                "governor": 7,
                "island": 7,
                "bike": 7,
                "bikes": 7,
                "space": 6,
                "executive": 5,
                "zoning": 5,
                "cargo": 5,
                "park": 5,
                "text": 4
            },
            "fullTranscript": "Perfect welcome everybody. Thank you for coming. This is Manhattan community board one's November full board. Meeting I am Tammy Meltzer. The chair of Community board, one joined with me with Carolyn Mahoney is taking minutes now, as our secretary or Vice Chair, Alice Blank, and some of our other elected officers like Brittany Wade, who's going to help take votes and roll call today and our treasurer, as well as our fabulous community board. So we start with a public session, we'll recognize our elected representatives first and then have the public speak I ask all of our elected representatives to stay on, so they can hear the concerns of the community. That would be fantastic and we will start with we're going to start with state assembly member. You lean, News, representative Claudia. You've got two minutes. Can you unmute Claudia? Please? Yes. Can everyone hear me now welcome Claudia thanks for coming hello, Tammy and on behalf of the assembly member? Unfortunately, she couldn't make it tonight, wish everyone a safe and healthy thanksgiving and in terms of this month, I'm going to keep it brief. We are currently working on our thanksgiving drive. We are very appreciative of everyone who is in support of us tomorrow we will be doing meal distribution all across the district. If you see us at any point, please say: hi Julian would love to greet you guys and, as usual, please redirect any unemployment questions as well as any constituent cases to our office. I am more than happy to work on those and in terms of CB1 specific, we are still keeping working closely with CB1 on 18 William Street. We appreciate all the help that we got on that item and I'm happy to stay on for the evening to continue listening to all of the concerns, and please tell me, take it away. I will save my time. Thank you. We're going to move to Comptroller Scott Stringer's office, Luke, hey everyone lukewool from city controller, Scott, Stringer's office. Here. Also wishing everyone has a happy thanksgiving live this week. I will share a few updates from our office and I want to first start by talking about some of our response to the Covid-19 health crisis. So, at the start of the pandemic, controller Springer launched an investigation into the city's preparedness for and response to, Coba 19, with the goal of hopefully learning about what we did and did not do in those early days and weeks, and to keep in mind that we can have better policy outcomes when now, when the second wave comes so we launched this over six months ago now and unfortunately did not receive a single document even after subpoenaing city Hall. So what we did was we took the administration to court last week because we really do need a response to our investigation to ensure that going forward we can have a better response, so I'll keep you updated as this investigation unfolds. But really our goal here is to get a better understanding of what happened those early days and weeks so going forward. We can respond better as a city, Mr Stringer also wrote an op-ed this week on a topic which I know is close to this board, which is on the about greater transparency and accountability for police misconduct. So the op-ed lays out a plan to strengthen the Ccrb and improve its effectiveness with three parts. The first is granting it power to make final disciplinary decisions which currently does not have is only viewed as advisory. Number two is removing the NYPD office of trials, which is what reviews a lot of these cases from the police department to a different department and three expanding the Ccrb's jurisdiction and powers beyond their current limited use. Lastly, we have also been focused a lot on our education system in schools, especially on the digital divide, and making sure that all students have access to internet, so they're, currently 100,000 students without internet across our city, 13,000 of which are in our city, shelters. We've laid out plans to make sure that both those student populations are addressed to ensure they can engage in digital learning. I will put some of those links as well as my email box I'll, send that to the host and they'll be able to hopefully drop it in the chat but happy Thanksgiving and I hope you all feel free to reach out. For any reason. Thank you very much Luke and we're going to move next to Margaret Chin's representative for Cd1 that'd be Cora. Do you need to do the reporter? Would you like us to post your report in the chat for people to click on the link, I think we'll go that way, and so we'll move on to Lizzie Lee, which is our representative from Senator Kavanaugh's office Lizzie. Can you confirm if Senator Kavanaugh is here yet he is currently not and I. Think I should just go ahead and proceed with the updates. That's permissible. So thank you so much to everyone and for CB1 for always can be. Meanwhile, you know we have our crazy times. Just quick updates. Our office is continuing to make sure that Ppe's are being distributed as much as possible. So with the slew of increasing Covid-19 cases. Please let our office know for any knees or hand. Sanitizers I will make sure to make. We have that coordination and have any questions in regards to evictions or housing court issues. We have a lot of constituents calling so please make sure that you reach any of our offices, including our offices, to make sure that you're getting the social provisions that you need and making sure that you're getting your answers resolved. Are your questions important to local issues. We were really grateful to have provided a letter of support for Fulton's fall markets, application for assistance for the EPA local foods and local places. So we're really thankful for the work that they're continuing to do during the pandemic and as always, we're closely engaged with community issues. 225 Rector, Street, 18, Williams resiliency projects in lower Manhattan and continuing to monitor the increasing activity with the Lucerne and the displacement of the clients there, governors, island, rezoning and the Manhattan detention center- and you know we're continuing to work very closely with quality of life committee and the small business working group. So I really look forward to continuing to grapple with our very existential issues and I have been hearing some problems with getting Pebt cards and, of course, unemployment. Please reach out to our office. If you have any issues regarding that other than that. Thank you so much and happy Thanksgiving you're on mute. Thank you. Lizzy very much happy thanksgiving if the governor, if the senator does come later in the meeting, just please text lotion and let him know and that'll be fine all righty. We want to welcome our esteemed borough, President Gail, Brewer who's with us tonight, Gail. Thank you so much as always for attending and take it away. Thank you very much, madam chair. So just quick things, February 1st 2021 seems like a long time away, but that's when the community board applications or reapplications are due number two. The budget will, even though the capital budget seems like also a long way away. It takes us to have a great deal of time to try to get it right. So we'll certainly be looking at what you suggest, but there are two information sessions. Schools is December, 8th at 4 o'clock. You can go to our website to figure out how to register and non-profits culturals, etc. Are December 10th at 11 o'clock and again you can go there in terms of other things that I do we're waiting on the judge. That's James! In terms of the Lucerne on both ends of the borough, so we'll see what happens. I know that she's trying to figure it out and I hope she does. What community board one suggests on all levels. I know we're all working on governor's island, we're all working on South, Street Seaport and we are putting quite a bit of time every single day. I get another call about this public realm issue of. How can we, you know, figure out who's on our streets and how we can work together. It doesn't seem to be something that is going particularly well right now in terms of the schools, it's like a drama with the devices to make a long story short. We have about 15 20 million dollars. I think that he'll do in the bank last year is money to pay for devices, and we can not get d-o-e-o-m-d to release it, even though we have been pushing so we just got a letter to dna a few minutes ago from the department of education, basically stating this one of these godly books. It said they are going to comply with what they're supposed in terms of the controller's memorandum, and they said something to the effect of Reservate Capital money was unpaused on September 18 2020, and there have apparently touched reached out to 650 schools that received an allocation and they're trying to figure out how to execute their projects. This makes me live it because all those schools do not have definitely have kids who do not have devices, otherwise we wouldn't have allocated the funding there. So just so, you know we're continuing to fuss about that same thing, with child care seats, Manhattan lost 550 slots in Manhattan, we're making a big fuss right now, particularly in Chinatown, lower east side, probably some in finding but definitely Chinatown, and they issue a lot in Chinatown and the issue there is they deal. We sent the slots to other parts of the city, so we're really fussing on this one also because we can not live just with the 3-K. We need the slots and the after school. That's again, the very short version we're working on our affordable task force in terms of a figment, exactly perhaps with the next mayor. What should exist and just like everybody else we're giving up, etc. It's a very tough time for have a great thanksgiving, and we hope that we don't become either fully yellow uptown I was all day giving out the information looking at the long lines giving out mass giving out sanitizer we walked yesterday today, we're gonna walk tomorrow, and we hope that this stays very localized and doesn't spread in terms of the orange and yellow. Thank you very much. Thank you for President Brewer I have a quick question for you. Have parents I mean the issue for parents is even more complex, you've got those who are missing internet, those who are missing computers, and you have the application process for high schools beyond delayed for Shsat screen schools, both middle and high school. It just seems to me the added anxiety that they're putting on the families, not only in community board one but throughout the city, is fairly untenable. At this point, I mean: can we just get it done? Can not only that move out? I was in learning labs today, uptown, where they can you're gonna have a heart attack. When you hear this, when you can have big spaces in some cases, huge they're gonna have 60 kids, they have four. So this is craziness right. There's no outreach, there's no explanation. These are run by very credible, phenomenal nonprofits right lunch breakfast, basically, academics, internet, etc. They have four kids I was there. I saw my own eye, so it's so deep in terms of the challenges I will keep pushing on I've been pushing about the high school to see 20 50 million dollars sitting in the bank. You know it's just it's very difficult for families and I think what makes it worse is there's a network they could get the information or if there are cease for Learning Bridges. They have PTA networks principles, but the information is doesn't seem to be going anywhere. Learning, Bridges, you're, correct, sir. Thank you so much I will keep working. Thank you very much for all that you do and we appreciate you coming. Thank you and please feel free to stay with us if I can, if we could give you coffee or a drink in person, we'd be happy to do that. So far, it's only virtual coffee. What I miss what I'm gonna miss is your holiday party at pier 17, that's the best at the pier a yeah here and at the best. Thank you all right from. Thank you very much. Madame borough, president we'll move to Hannah Weinerman from Congressman Nadler's office. Hi! Everyone. Can you hear me? Yes, we can Hannah. Thank you hi everyone, so I will be very short tonight. So first, the congressman has been working on getting two-way split tolling from the with the Verrazano bridge for about 20 years now, and so we're really happy to announce that it's going to start December 1st. So hopefully it should help alleviate some of the traffic on Canal Street. We're really looking forward to seeing what the positive impact of that split tolling will be, and also some raised revenue, the congressman and Congress larger working on the Heroes act. We, you know passed iterations of it in May and then again in October and hopefully we'll get something, but I will keep you posted in December. If there's any movement on that, the congressman is continuing to, you know, hold the Trump administration accountable, so they a bunch of the House chairs, sent out letters to the respective agencies that they within their jurisdictions to make sure that they preserve all relevant documents and the congressman and I believe Congresswoman Maloney also wrote a letter encouraging no quote midnight rules where they were changed. Basically, they would roll back some protections kind of in the dead of night, so we're working to make sure it's a smooth transition. Luckily, the transition was officially started yesterday. So hopefully we will continue to have a smooth productive transition into the new administration. Last I will say that Medicare, open enrollment is live. So if you have any questions feel free to contact our office, you can also contact our office about any other federal issues. I will leave it. There. I think you all have a happy and safe thanksgiving and it's always a pleasure to be with you. Thank you very much Hannah that was great Cora is on. Can we Lucian? Can you unmute core and see if she'd, like hi Cora, welcome, bye, Councilmember, Jens, hello, everyone, it's Cora here, chairperson Madame Messer I need an extra one or two minutes. I know the clock started kicking, but please give me a couple extra minutes regarding the cargo bite. Coral the proposed project by DOT is that okay, yes or I am happy to have you speak when we review it in executive session. If you would like all right, okay, so I will try it I'll. Try both on the legislative front. I just want to mention the package of age discrimination package that council member Chin is the prime sponsor for free bills. One is about telling drifter to advise the center of older workforce development on age discrimination. The second one is to create a center of older workforce development to provide trainings and resources for older adults. The number three is the New York City Commission on human rights, to conduct a two-year study about ageism in the workplace and also publish recommendations with regards to New York Harbor school. We all know that they don't have an aquatic training facility. We want to make sure you all know that council, member Chin has been a strong supporter of the school expansion. So today, Gigi our Chief of staff also put the meeting together to make sure the school leadership, the Pda School leadership, and we have CB1. Thank you, Tammy, Wendy and also Trisha, to join us for the discussion. We want to make sure that this pool will become a reality with the climate change. Aspect council member chain is also in great support of that. So we will continue to work with the harbor school and the governor's island, especially with now. We have the rezoning project. Okay, with the concerns about the cargo bike. Actually we always want to have the community get the chance to express their concerns and their opinions about any proposed changes to the neighborhood, but with this special project, it's unfortunate that they didn't get enough time to express their concerns. Dot did attend couple meetings before, but there's still questions unanswered. So councilman machine feels that it is really a shame that they couldn't send a representative to the November transportation committee and there should have been more advanced notice about the intention regarding the timeline for the installation and everybody woke up this morning, and then they found a bike car there. So our office have made contact with eot. We spoke with at pinker the board, commissioner, and also the staff. They are still responsive to the questions. So we suggest that all the committee members who share the same concerns who have the issues please do what CB1 suggested. As of last night, the contact from D.O.T make sure you send your advice, your suggestions, your thoughts, your observations and what you're going to see in the next six months, because they promised that it's a pilot project. So at this point we want to make sure you send in all those observations, any issues to the two contact that DOT gave us and we will document from there. Property management and the residents have already been in touch with me and we've been talking, so I will continue to work with CB1 to make sure all these questions got answered and the issues got addressed and I expect to hear from everybody in the next six months about this at least six months. Thank you very much. Cora I'll go over what those emails are and when we get further down the road into the session, I think that's it for all of our electeds. Today, unless Lucian or Collins see anybody else in the sign-in sheet, I don't see any of our other electeds okay. So we're going to open it up for a public dialogue and I will start with Rob Meg Liaro and then from there move to Steve Rodriguez. Okay, so Rob take it away. You have two minutes. Hi everybody! I'm calling in to talk about the reopening of the Brooklyn banks. I have a pretty unique perspective in that I'm calling in both as like a lifelong skateboarder, because it's a really important iconic spot for skateboarders, but also as the co-founder and principal of the Urban Assembly School for emergency management. It's one of the four high schools, that's across the street in the Murray Bertram Campus, and so that space is invaluable to our school. It's been closed since we opened there in 2013, but, as many of you might know, the Murray Bertram campus is both windowless and doesn't have immediate, accessible outdoor space for our students, so particularly right now during Covid-19. It makes it really difficult for us to have any pe classes, because indoor Pe classes with the aerosols and no outdoor ventilation, we can't really run any physical activity for kids. So if the space was open across the street, we would be able to do that pretty easily. In normal times. We could use that space for pe we've talked about it a lot across our built, our different campuses, the four different schools. My school serves 300 students, but there's about 2,000 students in the building. In all four principals, Npa leaders have been really interested in opening up the basketball courts there, the shuffleboard the Brooklyn bank space for our kids to use. We have city championship, basketball teams on both the girls and boys side, so the basketball courts at our school and our co-located campus. It's really difficult for us to get court time and coordinate across the building, so it'll alleviate some of that, and then we also have outdoor lunch for our students, so just in general, like opening that space up would really allow us to have some substantial access for outdoor learning in the foreseeable future and just for programming for our students going forward. Thank you very much. I know this is a topic that has been taken up at waterfront parks and cultural and will be continuing in that committee. So thank you for coming up, Rob and I. Think Steve Rodriguez is next on the same topic: Steve Stevens, hello, hi, hey, sorry about that! I had trouble connecting yeah. My name is Steve Rodriguez and just want to thank everybody. For their time. I've been a user of the Brooklyn banks area as well. Since the 1980s, it's a great open space downtown that the public has always used. Everybody from you know the students from the high school across the street or the local school across the street tourists skateboarders Bmxers rollerbladers, Parkour groups, people doing Tai, Chi people exercising it's a meet-up place for many people, I actually met my wife, I, actually also utilize. The space I taught my son how to ride a bike there, because it's a big open space downtown where he's not gonna run into somebody. I've worked with the DOT when the banks were kind of renovated in 2004, I worked with the DOT and parks department to help them re-envision the space so that it was space for everybody. I've also designed many skate parks for the D.O.T Golconda Skate Park Sergeant Dougherty, Skate, Park, Hybrid Skate park and I work with them on a public plaza under the K bridge in Brooklyn. You know the space is just a great outlet for people of all ages. Kids really thrive in that environment, where it's, this big open space in a city where there's less and less open public space. You know kids can challenge themselves there, whether they're, trying to slide down the bank on their shoes or ride a skateboard or ride a bike. You know it's just a place where they can challenge themselves. They can build relationships there because I've seen it for many years again since the 1980s and it's a place where I've seen many people, you know build themselves up, you know practice their whatever they're into and you know, there's also basketball courts. There handball courts. So it's just this multi-use space that I think needs to be. You know brought back perfect. Thank you very much. Thank you guys. As you know, it is still a topic in discussion. I, don't think anything is final. Yet and I stick around at Nsa All right. Let's move on to we've got a lot of people signing in this is good. We're going to recognize Susan Peters from New Yorkers for wired tech and after Susan Peters we're going to go to Gerald Forsberg. Thank you. Can you hear me we can. Thank you. Oh great hi. My name is Susan Peters I am a long time resident of New York City and a member of the local group. New Yorkers for wiretech I wish to alert the community to a health danger in our neighborhoods. The city of New York has approved all in one shot: the installation of 11 wireless antennas installed on utility poles. Eighty two hundred have already been installed in the five boroughs and there are plans for another thirty four hundred to be installed, but the public is not informed of the high levels of radiation coming from the antennas already causing residents of our city to move from their apartments antennas are installed outside of become too sick to stay where they are recently. The state of new Hampshire established a commission to study this issue. Their report just issued to the governor, concluded that safety insurances for 5 g have cloak come into question because of the thousands of peer-reviewed studies documenting deleterious health effects associated with cell phone radiation exposure. They asked quote: why have thousands of peer-reviewed studies, including the recently published U.S toxicology program, 16 years, 30 million dollars, showing a wide range of statistically significant dna damage, brain and heart, tumors, infertility and so many other ailments being ignored by the Fcc in the chat? I'm going to send you a link to my talk, my local organization and this new Hampshire report. Thank you very much. Please consider making this an issue to be studied by your community. Thank you. So much for coming and I think I'm not 100, but I believe that would go under our quality of life committee. So I look forward to connecting the two of you there great thank you. You're welcome, Gerald Forsberg you're next and after Gerald is going to be Roger Manning, yes, hi I just wanted to chime in regarding the governor's island. Rezoning I wanted to thank the trust for governors Island for updating their website and making a lot more transparent, as well as user friendly in regards to the real estate and the south, through zoning and the rfps. Beyond that, I'm gonna reserve any other comments. I guess for future land use meetings. Thank you so much. Thank you. Roger Manning you're! Next, yes, I can oh thank you. Hi folks, I'm Roger Manning a long time down downtown Manhattan resident and a frequent visitor to governor's island since 2005. I actually visited there in 1982 once as well. A more detailed presentation against the proposed rezoning of governor's island South will be sent to the community award soon. The current proposal for rezoning and development on governor's island will not resolve the financial needs and it is essentially a trojan horse that will facilitate over development on public land. The latest plan was revealed just in September and the Community Board Committee vote. I understand is scheduled for December 14th, and so there hasn't really been enough time for community input. It feels and I I'm sure a number of people I I've been speaking with. We would like to see. I know this, isn't necessarily the community to board some territory but to resume the moratorium on all uniform land reviews. Uniform land use review procedures during Covid-19 I know there was a moratorium up until like I, guess, September or so, or mid-summer and well, Covid-19, spiking again, and people just aren't able to give it. You know these things this and other issues the proper attention, so we're hoping that. Maybe something can be done about that. Two quick questions is where to find the actual uniform land use review procedure publication for governors Island I've found certain links, they give an overview, but I mean the actual wording of it, and the other question is roughly how many people have managed to send in comments regarding governor's island to the community board more stuff coming we'll be on. You know, future meetings with you. Thank you not a problem Roger. We are happy to connect you with our district manager early next week and he can go over with you where you can find on the website what information we have for the alert process, not a problem, and we are still accepting public comments. So I can't give you a number yet we did receive a significant portion of written comment as well as you can. Imagine from the meeting last month we will still be accepting public comment through December and all the board members will be able to review that as well before we vote in December sorry for the public comment, and that has a link to some of the materials for governors island. If you'd like to put in the chat perfect. Thank you you're welcome. Thank you Roger. Next, I'm going to Wendy, brawler and I hope. I said that appropriately I apologize, if I butchered that okay also on the topic of governor's island I, might be at the end of her availability for time. I, don't see, I'm looking I, don't see a wendy, so she may have dropped off. We will add her commentary to the public comment, because he was writing for governor's island as well. Okay, sorry Jimmy! You can read that yeah sure! No sorry! Oh it's in the chat. It's in now we'll submit it as part of her written comment for governor's island. Her comments that she put in when she signed in today we're gonna go to another topic. I'm gonna recognize Justine Kucha who's. Speaking on behalf of affordability in lower Manhattan Justine, thank you give me one second to okay, so not right, not the right one that I want to look at sorry, I actually have notes, go faster and I'm wasting my time all right. Well, what I want to talk about in local Manhattan is talking about affordability in not just battery park city, but all of Manhattan I. Think I have like written notes that I put in so it's going to be more eloquent than what I'm saying. But I've said before this board that 300 million dollars is enough for the battery Park city authority to collect from the residents and workers in residence and owners of businesses in battery park city, but that's only part of the conversation and part of the problem that 300 million is made up of ground rent pilot and also some other common fees whatever. But the biggest portion of that is the pilot, which is payment in lieu of taxes. Now that is what brings me to the rest of Manhattan. The rest of Manhattan is subjected to also taxes, real estate taxes and unfortunately, in Manhattan. There is a distinction: well all of New, York, City and all of New York state, there's a distinction between class one homes and class two homes class. One homes are like the little white House with picket fence, whatever suburbs one family homes, class two homes are large, condos and co-ops and apartment buildings, and then there's a little bit of a between. But let's just stick with that class one homes have caps on the amount of annual increases that the tax can be every year. That's why people like our parents and our parents could afford to stay in their homes, raise kids retire there. You know, look at their whole old age if they want to and actually have something that they can know and understand what the costs are going to be from the day they bought it until the day they sell it, 50 60, 70 years later, or whatever they decide to do differences class two homes in Manhattan. There is no tap and am I out of time, because I have flipped pages. So, if I'm out of time go and look at my written statement, but the point of it is that this is a something that all people in Manhattan need to come together on. We need to work together to attack the real estate tax, lack of a cap, and the mayor did try to address it before Covid-19 by impelling in paneling a task force to look into the inequities there. They came up with a really great report explains the whole thing explains the inequities, but the problem was: is that, instead of having a cap on the amount of money, it's just well? How are we gonna make it fairer? We need to collect, you know 10 billion dollars. How are we going to make it fairer? There's no way to make it fairer, you're going to take Rob from Peter to pay Paul? What we have to do is realize that we have to get our money for someplace else, and it can not be real estate taxes, because you can not take people and put them out of their homes. It was a great system that worked to keep our parents in their homes and keep the roofs over their heads for a long time that same benefit and that same consistency of payment and understanding what your costs are going to be as you age and as you grow needs to be in place for condo and co-ops in Manhattan, and it needs to remain the same for class 1 homes. Thank you, okay, good. Thank you very much. Christine now, you're welcome, I'm sorry, yeah. Okay, all right we're gonna move on to Dylan Agron hi. Can you hear me I can thank you hi my name's Dylan, I'm a former resident of 13 Harrison Street, and it's recently come to my attention that there's a proposal to construct an extension onto the roof at this address in Tribeca and I feel that the proposed project is a pretty major threat to the long-standing architectural history and culture in general of the neighborhood, the extension which has been proven by the mock-up. That's standing right now is visible from street level, as well as from neighboring buildings and speaking from personal experiences. Somebody who's really familiar with the neighborhood in the building in specific I know that the rooftop communities and villages that are there and still exist today are really integral to New. York City society as a whole and I have countless memories personally of growing up on my own rooftop and learning to garden from family on one side and also forging a pretty strong relationship with our neighbors on the other side and their two sons, Spencer and Thomas, who we're still in contact with so I feel like relationships like these obviously can't happen under you know a futuristic glass bubble, like the one that is proposed and the architecture of Tribeca to me, is really not a matter of design, aesthetic, it's the foundation of the community and it brings people that are strangers together to become friends and members of a United community. Obviously, the culture of the city is changing and kind of moving away from that unity. In my opinion, and I'm not really opposed to the change. In fact, I find it necessary in most cases, but I feel like this isn't a super necessary change and the plan is proposed by Mr Belowsky to turn a building that is stood as a warehouse. A single family, home, a communal, live work, space and, in my opinion, a pillar of history for so long into a collection of fancy. Condominiums is a pretty clear step towards the commercialization and erasure of cultural roots by the super wealthy of the beautiful neighborhood that I still call home and I think these buildings are lasting, standing to remind us of New, York, City's history, and these plans disregard that history and culture and threaten the communities founded in the small scale architecture. Thank you and happy Thanksgiving. Thank you for coming and thank you for speaking up and with that we're going to go to Jamie Sikorski, who is representing 99 and 101 Warren Street for those who are not at our executive committee meeting last night we had a rather robust dialogue. Jamie is here as the only one representing the group. There were somewhere around 50 people on just for that topic last night and then after Jamie were going to carry Davidson thanks, Tammy, I'm joining on behalf and, as Tammy mentioned in blue of all of the residents of Warren Street and the other community members that have expressed their severe concern surrounding the Amazon cargo bike. Corral prioritizing I just want to thank Tammy and the rest of the exec committee for their time last night and as Susan mentioned at the top of the call, certainly everyone's patience while they heard from quite a few concerned citizens. All of the concerns were also emailed to Lucian, so I'm not going to go over them again. Unfortunately, as Cora mentioned, which we spoke, despite the exec committee's proposed resolution to delay the trial period for the installation, it was in fact installed first thing this morning by DOT, which, in my opinion, is another example of a lack of transparency, a lack of honesty from the Dod and also their clear prioritization of Amazon over the residence and over the community, which is abhorrent. In my opinion, we'll continue to voice the concerns and hope to have your continued support. Sorry, that's my cat in the background, but really I just wanted to to thank everyone for last night, because you guys were amazing and you were super patient and I know that all the residents and everyone really appreciated you listening and taking the time. So that's it! Thank you. Jamie! Stick on I'm going to ask you to stick on through our executive committee. That would be great. Next is Carrie Parker, Davidson and Carrie. You are the last one in the public session, unless Colin or Lucian tell me that there is anyone else. I believe you are the last together tonight. So take us home, okay, well, I'll, piggyback on what Jamie was saying, because we have a similar issue with regard to the CitiBike infill and expansion plan and again it's lack of transparency, lack of regard for the Community Board, Transportation, Committee and lack of regard for the community that we all love. So, yes, I am the last one. Standing I have been at Community, Board, Transportation, Committee meetings, executive meetings and full board meetings, and these meetings last, as you know, three hours at a stretch- and this has been going on since September, while we've all been working hard, the DOT has failed to deliver. The community board asked for a review of a master plan. The DOT did not deliver, and it's becoming clear due to the guidance of this group that my efforts are better directed at the elected officials, because we can get our voices heard. Perhaps. Finally, if we reach those other additional folks, so I'm this office is no longer on it. Looks like Cora has had to go, but I will continue to reach out to them, and I will continue to rely on this group to represent the community in the process of prioritizing how we are using open space in community board, one. That means how we are using curb space. However, we are using sidewalk space how we are using traffic vehicular space so that we can build a better community life for ourselves and how we move about and amongst each other, in this neighborhood. So I appreciate the time and and on Carrie Stick on don't go anywhere so fast because believe me, you may think the conversation started, maybe in September, but I think they've been happening way longer than that, and this is not the first time, for example, that Madeleine came from Dwayne Park Patisserie to talk to us about any inequity in sighting of things in equity and approval. So this is not resolution started in September, but the conversation has been going on for months and months six months, exactly so I'd say: stick on with us. We you'll hear yeah, okay, so I think with that, let's I see no others Colin affirmed nobody else in the public session. Lucian affirmed awesome. So with that, let's put the agenda back up. Take we're going to close the public session. Thank you so much for everybody coming so who's got my agenda. Lucian. You need to pass presenter back to me. Please! Thank you! We're gonna, oh okay, so with that the October 2020 minutes went out, can I get a motion to approve that's okay, second I'll. Second, it all right, and if I he do, I hear any nays abstentions or recusals. All right minutes are passed. Let's start with our district manager, Report Lucian, Reynolds Greetings, everyone welcome and thanks for joining us here. It's always great to see everyone remotely. This month, I've mostly been on parental leave still so I. Thank you for all of your patience. I've only been actually technically at work a couple of days, but I've seen you at the meetings and everyone is still just blown along and so I want to thank the members for picking up some of my duties and I really want to thank the staff of the Community Board one office for really supporting us and me and Ej, and the family for allowing us to do this, and also especially Tammy for blocking off and running interference on lots of other things that keep them from landing on my plate. I was, however, able to connect with the department of design and construction and advocating for catch basins to be installed in Jp Ward in Washington the corner where water is collecting. Just on the other side of the curb line from the new pedestrian bridge, this is going to be a long process where DDC is interested in the idea, but I have to really push it and sell it to the department of environmental protection and there's all sorts of factors about existing sewer access and the like. So it's going to be a longer process, but I'll keep trying to push on that also want to report that Dick Bach, who is a housing excerpt expert I, had a conversation with him today and he'll be joining the quality of life committee meeting in December for an open discussion about affordable housing preservation. So if you have an interest in affordable housing preservation, please join us at that meeting. I'll be updating the agenda. So when we go everything goes on Friday. Everyone will see that, but it should be a good talk and that's all I have Tammy. Okay, Andrew, you've got your hand up and Justine has her hand up, I'm not sure if they're supposed to be, but you know how to unmute yourself, Andrew first, oh Andrew's down Justin is your hand up, for it was just a quick question for Lucian: that's affordable housing for renters, right or rentals, I'm assuming it's all rental discussion correct. Thank you dealing with our remaining portfolio, 421a, building, 80, 20 and any other affordable programs. Basically, building off of Tom Goodkind's legacy his work in collecting data and then seeing what best we have to do to take moving forward and trying to get the city and other groups to enforce what affordability is left. Thank you, okay, we're going to run into the cherished person report and in keeping with my preference for keeping it short. It's a really crazy busy month and time overall in the city very targeted, specifically to community board. One here are some of the highlights of some of the things we're going through. You've got 250 water. The zoning changes for governors Island the text, amendment change, I. Think those two pictures show a great deal. I'm going to. Let everybody do their own reports, but if you're looking at the yellow on the left on your screen, that doesn't look like a lot. That's what it used to cover the yellow on the right now covers it all. So that gives you an idea and, of course, dealing with outdoor dining and D.O.T. I have some sad news to present Mitch Roman's dad passed away this week, so he will not be with us this evening, but if you'd like to send an email or a note that I'm sure he would he and his family and his kids would greatly appreciate that. So please so it's been busy. As I said, we sent a letter to the SLA regarding submersive, which used to be called immersive, which is 18, William Street 20 exchange place. We were supported by all of our electeds. We hope that SLA understands that this does not add to the quality of life and is not in the public interest and denies our liquor license. As passed in committee cargo bikes. Well, you've heard we have a vote coming up an executive, so I'm going to go over things there with the next patterns and the next steps. 52 Williams Street, as of today, as you heard, there's no ruling the temporary restraining order remains for the group of men from the Lucerne until we hear otherwise and in case anybody is wondering yes, the borough-based jails, design plans are still continuing, even though the court case asked them to pause any physical things. The city does not believe that includes working forward on design plans. The next Hudson River Advisory Board Council meeting, is Tuesday the 8th it's held virtually. If you want to know what's going on with the trust, please feel free to drop in there and then public engagement process, let's hit the okay. So we've had a lot of conversations since I became chair about the role of the community board, and the key is that we are advisory, which is super frustrating because then we are also asked to assist with outreach in communicating with the people in the district. What I've seen in the last five months has been a complete lack of alignment of how the city does engagement in any stroke of the fashion, so where we have an applicant that will come before us for landmarks for land use issues for SLA, we have applicants that don't come and don't have any community input and yet to do things like cargo bike areas and we are notified, not asked our opinion, necessarily not statistics, not information. There's no two-way street I find it rather strange from a mayor who talked about governing from community base up, so we're gonna executive committee for the next couple months with the district manager are going to take on looking on alignment of engagement for the agencies and this kind of goes cross and every single committee, which is why we're going to take an executive and then we're going to come up with what we think should be an engagement process that makes it easier. Gail Brewer has spoken many times about a Zara public realm. Guess what we just want: public engagement, that's fair, engaging and full of facts and details. So that's one of the things looking ahead and you can tell we participate in budget the capital program, the district needs which includes ulurp and scoping and seeker review, etc. And then we are the people who monitor and evaluate delivery of services. It is exceedingly frustrating to tell everybody on a community level log your report to 311 and I'm standing there literally standing on the sidewalk, make my report to 311 and NYPD closes it four minutes later as being solved and five hours later, there's still a car blocking a fire. Hydrant nobody's done anything so we'll have those conversations in executive committee. We don't need to debate it now bring all of your ideas, bring all of what you know about how we engage in each one of your committees with your city agencies. Let's do a nice comparison and see if we can find some better ground to try and stake forward and help, because with an election year, gives us an opportunity to start saying. This is not right. This is what we need. Okay and I'm done with my chair report, which rolls into executive committee. Okay, oh sorry, Mark missed. You what's up mark just said, just a comment: maybe staff can research, this I think the language might be in the city charter for this, where regards to community boards, but it's somewhere, and it's states that the city, agencies or others agencies can not be arbitrary and capricious and ignoring our resolutions, even though it's only advisory, but it's advised but can not be dismissed outright or the language arbitrary and capricious. So we can have somewhat research to where that language. Exactly is I recall off the top of my head from a million years ago that it might be shorter, but if we completely know where that is, it was really hard to understand you. Your connection is not very solid, I, don't know if you were me, my is that better, yes, but please don't yell, because you're already quite loud. Okay, all right, I've moved my I'm moving my mic all right, so I'll start over and I'll be no, don't start over hold it all for executive committee next week. My point is that if someone can research to where that elections exist, so we can use it at the meeting. So we can quote it: I am licking. You I thought that the staff would have better resources. For this part, you got a great idea mark run with it and we'll see you at executive committee for it. Thank you all right, renewal of the Street, fair Task force resolution. If you can put that resolution up, please it is a very basic and easy. Our task forces need to be renewed yearly. They are by our charter by our bylaws. So we are getting a head start on this one because it expires in January. So just one less thing we have to vote on in December and when Diana gets that up, we'll go from there and then into cargo and then CitiBike and 13. Okay, give me just one second Tammy, I'm pulling it up right now, no sweat Tammy! While it's coming up I also have my hand up. Wow I saw a chat, okay go for it regarding it, no worries regarding 52 Williams. They had mentioned that. Although there was a somewhat of a moratorium on moving from the Lucerne, they did intend to move other individuals into that facility as a temporary measure or step. We know if that has proceeded. Yes, it is. There are 22 men who are living there currently put yourself on mute here, the dishes there are 22 men who are currently living there, Pat Moore. If you want to say anything more than that yeah, you know, we've been in contact with a provider black vets for the last three weeks, and that's it there hasn't been any problems. They've, like I, said, they've been in touch with us and we're waiting to hear whether how which way the case is settled with the Lucerne. Theoretically, if the clients from the Lucerne are moved down to 52 William, then the clients that are currently living there will stay there be joined by the gentleman from the Lucerne. The provider will be changed back to project renewal, who's running the laser at the moment, and that's what we know great. Thank you, okay, perfect Andrew! Thank you. So much I thought that check mark was. It was a thumbs up. So, thank you. I, don't see any other hands up so let's go! This is going to be a roll call vote because it's our first so remember. Roll call is always for attendance first and if you can hopefully see this, it is just extending the street fairs task force in the ideal and hope that we have a vaccine and we are able to do events outdoor events sometime in 2021. Okay, do I, hear a call. The question I call the question a second okay, Brittany Roll call great. Can you hear me okay, so if everyone could just say their name and their vote as they go through, that would be great Amber Russo, yes for Burton, okay, so just to remind what Britney has said. So when you do rolls ball and you're going to vote, you say: Meltzer votes. Yes, so it's on record! Okay! I got! We have you mark Emerson. We have you Tom Burton! Thank you. Sorry, Brittany keep going yup, no worries thing. Blank votes, yes, Brown, Kennedy, Tom Kennedy; yes, Cameron the Cameron votes. Yes, yes, votes; yes got it! Yes! Yes! Thank you! Cunningham! Yes, Curtis votes! Yes, Airman, yes, one yeah, one Flynn Votes, yes, Frank Goldstein! Yes, there's two beers, there's some background: no noise, Jessie Jamie James; yes, Joyce, hey! Yes, kennel! Yes, hotel! Yes, sorry Meltzer, yes, very excited! My son just lost a tooth okay in the house with me. Yes, my hawk my hulk, okay, Bon Jovi, more yes, Nataro stars Star is here: she's just got to be unmuted she's, one of the dial-ins I'm looking for the number now Bob is here too yeah. Schneck is here he's answering yes, yeah connect, yes to the panelists, okay, Star Laura! You should be able to unmute yourself. I can come back to her. Yes, Tedesco Townley, Foundly, Nice, Suede Wade, yes, Wine stock. Why not? Yes! Wendy is now unmuted in the Collins, okay, perfect she's, the first one Chapman great. Thank you. Okay, stars working on our audio by the way. Okay. I have a couple names before I get back to her Jessie: okay, Joyce, okay, you nataro, okay, Star, so she's here and she's over as an attendee she's. Having audio issues I see her so I don't want her mark absent. I'm not sure what we can do to help her Lucian. Can you try and shoot or I'm gonna email? You call in instructions: okay, Great, Tedesco, Townley, okay, that's it motion passes fantastic Jason. You have your hand up. Is there a reason? Okay, I'll take that as a no all right, let's rock and roll, so the next one we're going to in executive committee is the cargo bikes. So we had a really robust meeting last night for people who remember in October. D.O.T came to us about the cargo bike in transportation and we asked them to do some outreach to the buildings that were affected on the block they came back and the executive committee said they had done the outreach to the affected buildings and we had a robust dialogue and declined to support the cargo bike Corral and said to them. You know we really want to see other options. We want to have a different dialogue. Then we got a letter from commissioner Pinkar, which we shared last night, that I received on the 23rd of this month, saying they're going to move forward with the cargo bike Corral they had done everything that they felt they needed to do. It was a pilot program and that we could collect feedback and send it to them, because it is a pilot that they would like to get it tried. Now. The amount of community outreach last night that came back through was even surprising for me, because we had been told that they had done community outreach, but the buildings from 99 and 101 Warren came and said they were never spoken with, and the property manager came as well. The Tribeca alliance came and they were unhappy with it as well. So there was a lot of dialogue and a lot of conversation. This resolution tries to encompass everything that came both the concerns from the residents. The concerns everything this was not about. Only losing you know parking. It really wasn't about the parking it was quality of life concerns for having a privatized loading, dock open, 24 hours a day outside underneath residential buildings. We know that there is no enforcement, so cargo bikes, driving either direction on the street on a one-way, narrow street was a concern there were we tried to ask basically D.O.T to postpone it. We had also asked whole foods to come, which they never did to explain much, like other applicants, do who the who, what where, why and how, so it may seem moot because they are doing it. But what is really important here, other than being on record and the local stakeholders having everything put out here is that we are saying that all pilot projects must include community engagement outreach before so. This is not about notification. This is about engagement and we wanted them to bring the applicant to answer questions before installation, because I think it's totally fair they've not necessarily been 100 good neighbors, and you know one could say that. Well, you know it's better to not have the vans with the pollution which we all agree. That's really not. The question really was: is there a better alternative location, Zur Street, better suited, and the community said they believed that Murray Street was better. They believed that the loading dock would have been a better place for them to use and why they couldn't is not something that you know was answered to the satisfaction of the community by DOT or even answered at all by the applicant. So this is why we're voting on this today we will post on the website and in the newsletter, because what we're going to have to do is actual observations for those people who live around or anybody who travels through this has now become, unfortunately, in the purview of and the responsibility of the public to take photos and email them to DOT and CB1. So we can track all and any issues that exist, which include loading on the sidewalks, any delivery trucks because they're they, if DOT claimed in the letter that there would be no more deliveries either in going or outgoing on the Murray on the Warren Street side of the building. So there's that and basically anything that doesn't qualify as they described it. When they came so public access has to be maintained to the bike racks that they're putting over there and everything else that goes with it. So that is where we are, and since we've done a roll call, you can see the therefore be it resolves here and we're going to recognize questions, Mariama and then Bruce. Thank you. Yeah I just want to reiterate how very disgusting this is the lack of public engagement and, as you mentioned, that their name I guess, is that they're going to remove these vans from delivering. However, idling vans or idling engines period for more than five minutes is against the law. So they're not doing us a favor. By removing the bans, the banks need to be removed period, whether this happens or it does not happen and I. It just really makes me frustrated I'll be using nice. Words today makes me frustrated when people could run a con on me, like they're, doing me a favor with some money and of my peers and my friends and my family members who pay the bulk of taxes in the city by the way who are paying for it. It's one to go on record I. You know where I'm standing, I believe in cargo bikes as a general rule. I do not think this was the best location myself for it, but you know Bruce Airman hands up I, don't know if this is the stick to talk to. Can you hear me? No, yes, is it about the if it's about the cargo bikes or D.O.T, then? Yes, if not no dft is going to come up again. Is that correct in terms of what Kerry said? Oh that's the next topic. Yes, that's: okay, I'll wait to the next stop! You got it. However. I agree as usual. A hundred percent with Mario, but I'll wait till the next topic. Okay, so let's pass the cargo bike, one as it is, because we've already done our roll call to help Brittany out here and to make our meetings more efficient. The way we roll is everybody is here based on beforehand, the vote we just took. If you were not here for the first vote and you were not verbally recognized, I.e, Laura Starr, you need to call your name out and vote. Everybody else. You're only going to be called for Nays abstentions or Recusals, okay, so oops. Sorry, my kid's, showing me the tooth all right. So Laura are you on? Yes, I'm on and your vote yes perfect. So all others we will assume are yes. Are there any nays, no's? Okay, so I have Frank Kerr no I have Cannell; no hey, no ain't, no great anybody else. Are there any I have Kay Franker and Canel right. Yes, any Abstentions, Galloway abstain. Any Recusals results are abstaining. Sorry, okay, so we have three nodes: Zelter abstains and Galloway abstains. Two abstentions. Motion passes. Okay, thank you. Next one is the cargo bikes. Okay, so again we had a presentation bikes. Wasn't it yeah? Sorry next is CitiBike cargo bike CitiBike okay, so we have had a variety of different resolutions on CitiBike. This one is very specifically about intel and expansion. This one is very specifically targeted again with the discussion that they ca. They came to transportation this month and were to tell us of four new stations that they are looking to add. We did have a good dialogue with them. We asked them to come back at executive with a bulk of data because, as was asked to transportation, we wanted to understand what the saturation and usage was and what the master plan for Community Board won, which is something we've asked for several times. We're not saying we're against CitiBike. But what we wanted to understand in the world of Covid-19 and post and pre-covet is what does the usage look like? What are the metrics that they're working with and how it works? There was one of the representatives from DOT said it wasn't that they had a requirement to fulfill a contractual obligation for the expansion, and a lot of that was obviously in northern Manhattan, but there were large parts of it that were here as well. We don't have any issues with CitiBike as a whole, but we do want to say that there were problems that we had with the locations we have been. As Carrie mentioned in the public session, we've asked them to move stations. Getting a station moved has not proved easy, fruitful or timely, so we asked for more time again. This goes back to the public engagement process and there is a building who was quite dismayed with the sighting of a city by station on the historic stones which will be ruined. There was another building who was you know. People are unhappy about sighting it inside a pops or on a sidewalk, because there's not enough instruction, as you can see from the reso for people to know, had it where to be riding. The four stations that were infill were water. It John spruce at Gold, Fulton and Pearl in a pops and Albany at Greenwich. Okay, keep going so we objected in general to them being cited in front of restaurants. We you know which would limit space for open seats or on sidewalks versus the parking lane. If the parking lane was available again, it's a loss of parking but better for our sidewalks and social distancing. We said we didn't want them inside the pops where a parking lane could be available. So all right, so we supported the expansion in two non-controversial locations in general, water at John and spruce at gold. We requested for more robust engagement with the online portal and then slide down just a little bit, Diana, please, okay, so we urge them to take the feedback we gave them for Albany at Greenwich and Pearl and Fulton we'd like notification to come two months before. So we have an opportunity to do some outreach as well as they do to make sure that there's plenty of time for community feedback. What we don't want is the same situation we've been with in the past when it comes to CitiBike, where we have a restaurant tour who has reached out to the community board for help and then, instead of getting it moved, they get a notification that they have to remove their sidewalk stuff, because the CitiBike station is expanding. That's not. It flies in the face of everything that we are trying to work with the community and DOT to make a positive expansion, and with that you can read the rest of it. We're to open up with questions. Justina see your hand, but Bruce is first okay. This is my moment on the issue. First of all, are we I came in at the second part of Barry's public discussion? Are we including Duane Park, or is that not a part of this issue? We have already illusion. Didn't we do a resolution on Dwyane Park already in September, I believe so yeah we had already. We have already we've already done, one for Dwayne Park, that's already done we can. This is targeted to the four news stations that they're at that they came to us about. Okay. What I wanted to say was that at this point it's been for a while department of transportation is out of control, they're, an agency that some agencies just flounder, but I can reach department of environmental control much easier than d-o-t-d-o-t, as we have seen recently what the cons you can reward through and so on, there's so many changes of personnel that literally one round of personnel has no idea what the immediately prior round of personnel agreed to nor do in talking with them. For instance, about that and about this and about Bogartis Triangle. They often people assigned to our area have no concept of what our area is. They know they have no interior knowledge of our neighborhoods and I think we have to be a little stronger about D.O.T. We need to make a strong Un unmodified position like some of these are so kind and polite and modified do2 doesn't work that way. We have to make it clear to the extent that we have any muscle or power that we can not tolerate anymore dots, completely undemocratic way of serving the city I, whether it's a separate resolution, whether it's this resolution is made stronger, it's time to contact all of our officials and said that we can no longer stand dot's manner of operation, so that is going to come up on when we do public engagement in executive committee per Agency, because what we want to do is have it aligned. We want to be able to understand and have something: that's the burden should not be on the community board. If we're advisory, then they should work with us, so we're gonna. Those are conversations that will come with that for tonight we are opining on the four stations and the process that had with this, because that's all that they're asking us about and I do, hear you Bruce loud and clear, Justine and then Joe Lerner and then Jeff Galloway and then Vicky thanks, Timmy, all right, so I, actually I approve I support the resolution as written. It's all fine I have a question and I'm sorry I missed the executive last night. What is going on with the bike dock CitiBike rack dock, that used to be on West 10th street. They redid the street recently and now there's nothing there and I believe there's still nothing there. Are they putting them back? My CitiBike app says pending yeah, we. That is something that is not related to this particular one. But if you email, the office can follow up I believe it is they're not done with the road bed. Yet, oh, okay! Thank you. You're welcome Joe, Justine, take your hand down you're gonna, mute yourself gold and where, by the hospital that that's not good enough, what do you mean by the hospital on the hospital wait on the hospital block, spruce and gold at that intersection? Wait a second. You have to be more specific number one. There's a hospital and the ambulances go every which way around that area. That's number one number two, the school's there number three there is old seniors crossing there. So I would like to know specifically where Betty do you remember Dr k, sorry, I, don't mute; no, they just give the intersection, but again people have to realize they're putting them where cars currently park they're in a parking lane. So when you talk about seniors children, anyone else you're not answering. My question is where I don't care. What they're eliminating I want to know where let me see you may be able to help I, don't know. I wasn't part of that, but I live at 90 gold street, so it's either in front of our entrance or it's across the street in front of the hospital. Those are the only two places on spruce and gold where it could be yeah. It says it's on spruce at gold street, but it on spruce on the East road bed. Thank you so much so that's the dmg's. If I'm not mistaken, it's actually. This is pretty gloomy, but it's actually where the the box trucks were yeah, which seems weird well remember that they provide east. They provide free membership free. Thank you. Betty Free membership for essential workers, so I am Bruce between Gold and William is where the box trucks were Bruce between Gold and William. Okay, Box trucks for live on, spruce. The box. Trucks were at the end of spruce on the corner of gold right, but I think where these bikes look I, don't care either way to be honest, but it's also important people know that there's bikes at the other end of spruce as well yeah. Let me say that number one. If memory serves me, it's a stop and then you go very few of the cars stop and go on spruce and gold. It's a stoplight yeah, there's a stoplight there, a red, yeah I, have to deal with it every day. It's a stoplight yeah, it's a full traffic light. It's a full traffic light. Trust me, I'm looking at Google is that in the middle of the street, what's at the very end yep and it's a t intersection, you make a right or a left correct. There's a stop light there right there on spruce and gold Betty. Do you know if it's on the north side of the street or the south side of the street, because there's parking on both sides and gold, not in the middle there's? No, it says spruce street on the East road bed buy Gold Danny, I'm sorry can I just grab the floor for 30 seconds yep. What's the timing on this, they have not given us the time. Has the hospital been consulted on this? You know that's a great question. We don't know the answer to that because they just came to us. We can certainly ask and find out, but I just want sure everyone knows what I'm talking about when I talk about the box trucks, yeah. Okay, I know you've seen them I do there were two trailers there. That's why I said they extended in between gold and William, but if Betty is now terrifying that it is the east side of gold, then that's in front of 90 gold, because the westbound side would be the hospital when you're, walking, west or driving west side of gold is in front of 90 gold. Okay, so it's physically on gold, but not spruce, I apologize. If that's the case, John Gold by 90 gold, that's insane, it is not is 90. Gold may I jump in this is right by 100 gold street the HPD building, and if my memory serves me correct, they used to have a bank of those bikes out in front of 100 gold street and they moved them. That's where I suggested last night that they'd be in front of 100 gold. That would be on goal between spruce and Frankfurt. If it is the car, if it is the corner of spruce and gold, that's in front of 90 gold right exactly, but I do believe that they used to be right in front of 100 gold street. In front of HPD, because I remember walking by and I said: oh that's, nice, the employees can you know people can. You know personally, I'd be thrilled if it was instead of the placard parking that they have in front of HPD I'd be thrilled if they had a bike rack there, because in front of there they used to yeah, they have placard parking and then accessoried parking. So what we can do is if somebody is making a friendly amendment that they believe that location should be in front of a hundred gold. Betty I think that's a I'll make any before you do that. I'm sorry can I just offer a different motion. Can we table this? Put it back to committee until we hear from the damn hospital which seems to make sense, that would make sense, but I'm gonna put it as that is the responsibility of our council member to make sure that the DOT has done that, quite frankly, I'm not reaching out, and I'm so done with the D.O.T on this. That yeah I think we make it in here and we put if we put a thing that says they must reach out to the hospital. One would assume that they have because they provide them there. It's a left turn and then I would like to Second Joe's motion. Then, but I must say people who don't know the area just have no idea what goes on there, because there's just before you hit the Brooklyn bridge, there's a two-way roadway. So if you make that you're going down you're going west and then you have to make left because you can't go straight and then there's a double roadway from gold, it's a crazy place all around there, both yeah, because you got and you got one police excuse me: you have traffic patterns that don't exist anywhere else. Then you got the hospital and then you got the school and I. Just don't see it. That's all! Okay, correct and Joe you left out at 80 gold. There is a public splash, slash private garage right that the residents of Southbridge and the members of the public park in this icon garage. We don't own it. That's at 80, and then you got a couple of one or two parking spaces on that block, and then you have the ramp that is in front of 90 gold. That also gives them into 100 gold. Mariama, stop Joe, stop I heard what you said: let's let Jeff Vicki and Colin speak and then we're going to come back and put a, whereas in here D.O.T must reach out to the hospital and that our Recommen, and that we can put it in here that we would like it to not be in front of 90 gold. If that's what you're saying and to be on 100 gold I have no trouble. Well, yes, but if I could just finish that sentence the reason I'm saying that part is because the ramp that is in front of 90 gold is a ramp that gets access also to the cars that have pull up in front of 100 gold and use the the electric to power your car. So there's a right answer: okay, they're, not gonna block any of that, because they know that I mean reasonableness has to apply, but how much stuff can we have right there in front of one building? Okay and then everybody else? Can I'm done? Okay, Jeff, Vicki Colin. This resolution is difficult for me because I am as annoyed as everybody else is about Dot's, lack of engagement or, as well as any other city agency's lack of engagement. On the other hand, I'm a heavy user of CitiBike, and in fact, especially during these Covid-19 times, it's about the only form of transportation other than walking that feels safe from the disease, although not necessarily safe from the cars and trucks. There's kind of a I don't know an under a theme that comes through to the reader of the resolution of that CitiBike is a is an evil that must be minimized and that's what and although I know. Certainly many of the people who spoke in favor of the resolution don't feel that way, but it kind of comes through that way that this is a nuisance that you know, we've got to make sure. It's you know, we don't want it in this location. We don't want it in that location, kind of thing and I don't have any concrete suggestions to changing the hurting of the resolution, but it does come through as anti-bicycle Anti-CitiBike as a general theme, and you know I'm like every other New Yorker I, always hate any mode of transportation that I'm not currently using. So when I'm walking I hate the cars and bikes when I'm biking, I hate the cars and the pedestrians, and when I'm driving I hit the pedestrians and bikes, that's say, and it is indeed very difficult to cram in all of those different methods of transportation and any kind of sensible, safe or aesthetically pleasing way in the city, but I think I'm going to abstain on this motion. Even though I I'll tell you Jeff yeah take a minute. Look it over. If you have verbiage changes that you think would make it less pejorative more simple, factual, come back to me before I call the question: okay, I'll! Try! But if I don't succeed, I'll, probably abstain. Give yourself five minutes: okay, Vicky, you're next and then Colin and then Betty. Thank you. Well, I, like everywhere and I completely wrote, agree with Joe that corner at golden spruce with the hospital and the ambulances. That's a death trap for bicyclists. So I'm sorry, I completely agree. The congestion on gold street in general is bad because he goes. You know across fidei, terrible location idiots at D.O.T I mean we must hire the lowest form of people, no easy, because we do have some very lovely decent people who work there so whether they are Tammy ticketed about easy, not your cousins, no I, I'm in the industry, I know what I'm talking about. I have the right to express this. My life is in danger every day because of bad decisions that are made by this agency, and but I'm asking you so I'm supporting Joe and everyone else complete incorrect spot to add more congestion on golden spruce. Now I wanted to know that there's a who's that did somebody did you say: there's a new dog being proposed that John and Water Tammy it's a John and water. Yes, so let's go get back to congestion, isn't there a huge bike dog only at John and William huge, so it creates so then down that may be, but John and water is closer to the ferries and closer to the subway lines on water and two blocks up. You have a huge chunk of the street taken up by CitiBikes, like I, said I bike everywhere, but I have my own bike and there's a school now right below at 90 John and the amount of congestion and traffic when school buses come and block the entire road and then honking begins. I'm just asking look woody. Do we need another bike? Dog only two blocks down three blocks down. Apparently the answer was yes, yeah exactly saying: keep tabbing okay, Colin, Betty, Jason, yeah I. Think you've already answered my question, but it's someone who actually lives there. This is my neighborhood I saw what the hospital did during the pandemic and they literally owned the entire street. Both sides with ambulances with a checkpoint center with a military-style lockdown, I'm not for bikes, I'm not against bikes, I'm just for ensuring the hospital is okay. With this, I would like to see that reflected in the motion. Thank you, gotcha all right, Colin, Betty, you're next and Betty. Before you go, I'm trying to look through the drive. Do we have a presentation that they showed us where the bike would be located? Or did they just tell us verbally it was verbally, but there was. It was just that map with four dots on it. That's what I'm looking for the map, so that kind of gives you an intersection that wouldn't give you an exact location, I, believe they presented from their computer. We don't have the possession of the presentation lesson learned next time. I want procession. Well, I will look because I have a screenshot of it, but I can tell you that it's just dots on it on a map. So it's not in a particular location. It's on an intersection, gotcha, okay, but that would be really helpful to see yeah we started during the meeting, but yep we will make sure we get that going forward. Okay, Betty Sorry, to interrupt you, keep going I just wanted to say thank you to Jeff, very well said and I. The tone of it is very troubling to me, given that we deal with D.O.T and I, hear everybody else. What you're saying, but Michael and I just don't have trouble dealing with them with deity. So Betty I will tell you the same thing. I said to Jeff. If you can make a couple tweaks left or right, that gets it to be less pejorative about the sighting more factual, I'm happy to take them, think it through, and then let me know, but not rewriting the whole thing, because there are concerns that need to be addressed. There are, but there are a lot of negative assumptions, so I'm with Jeff I probably can't correct enough, but thank you. You're welcome, Jason, I'm in the group of people that live in the neighborhood CitiBike and want to move on. So let's, let's I like the way you're moving things on Tammy, let's vote or not or vote up or down, and we spoke a lot about it at committees. Let's move on Laura you're next Joe you've already spoken, so I'm not coming back to you I, just okay, I just wanted to support what Jeff said also and I wanted to urge that we get good maps from DOT. When we have these conversations, I think it would be really helpful to have a map of our community board area and where the bikes are and then a sense of how many more bikes they think we need and a kind of like really analytical presentation of the issue so that we could work with them and kind of like I. Don't think we're saying we don't want to have x amount of bikes here, we're just saying we want to have input on where the x amount of bikes are and I think. If we could somehow make that clear and be part of the process of the sighting, you know understanding the constraints involved, which I know the sidewalks down. Here are really that has a there's a lot of stuff on the sidewalks that get in the way of studying the bikes. It's not as simple as we think so that that's all so again, I'll put it back to you the same thing: if you've got some suggested things Laura that you think you want to put through I'll run the we can do it in the therefore be it resolves, and I'm happy to listen to all appropriate okay feedback. So no problem Joe, while you're thinking, Laura who's, giving these negative vibrations off Jeff, says somebody's being. Has this innate vibration against spikes? Who is it we're not here to point fingers Joe? He was talking about the tonality of the resolution itself, but that's okay! Well, if it's my resolution, I I'm just going straight english language, sorry, I'm getting dinner delivery, Sarah, you're up! Looking at the map on my phone and looking at the North south, you know the actual map and the directions, and things seems to be on the block with the hospital. Yes, hopefully on the hospital block where it's sited, which makes sense because CitiBike is giving the memberships to the people that work there. So I'm just throwing that out there that technically, looking at the map looking at North, South East West, it's on that block, it's on the hospital block. Okay, thanks, you're welcome, which I think is why we didn't object to it there, because that was the goal all right. I think everybody's had a chance to speak. So my you see the therefore be it resolves that are up if you have changes that you want to make, and that goes to the board members on the tonality of therefore be it resolves speak now. I have a few suggestions, I'm not sure that it hit it. Here is my problems. It may create more problems with others, but with a quick run through I would suggest deleting on the whereas clauses, not the last one that was fine, but the three before it, the ones that describe the complaints residents objectives. Residents reported as well as the one about suggesting that you put bike lanes wherever you have CitiBike docks, because although I certainly like bike lanes, I do drive a car and ride in a taxi from time to time, and I'm not sure that I want every single street to have a bike lane that happens to have a CitiBike dock on it. So that would be one suggestion all right hold on a Sec Diana slide. The resolution down so I can see the last three warehouses. Please, the one that says residents objected the CitiBikes being forever that I actually do want to leave there, because it is a concern that is that was brought up and discussed in by and large yeah. Okay. Well, then, I guess that I probably shouldn't go with the others, because that's one of there's a value judgment here that preserving space in front of a restaurant is better than bicycle, transportation and and all I think there's a balance between the two I. Certainly don't object to balancing those kinds of things, but the fact of the matter is wherever you put. Dots well, will impact someone locally you'll? Be taking parking spaces away, you'll be taking a traffic light away. Whatever, instead of residents objected to an elevator, we can Laura by the way you're unmuted. We can say residents prefer that CitiBikes be sighted in a park, not be sighted, because that is a preference. We're trying to support small businesses. I understand the concerns about the driving, but we are I think it's supporting the business to have a CitiBike thing nearby, not in front that prevents them from being able to have sidewalk seating, which is a throwback to what has been happening on Duane Street right, because if they can't open their restaurant because they can't go onto the sidewalk, they can't have any business. So it's got, it has to be a balance. Maybe that's the word you're looking for is balance because I hear what Jeff is saying and I agree with it, except I mean they've got to be somewhere and they've got to be somewhere, convenient and close to businesses, otherwise, they're, not useful, correct and so well, but Jeff. We also. So what? If we're talking about balance? We can say that the residents preferred that the docs are not cited because we this was. This is straight out what happened at the meeting no I know, but when you report something and whereas that the implication is that we join those complaints, we share those preferences and I. Don't I'm not saying that people didn't say that, but the you know the ones. We all know that the people who come to meetings are the ones who object to something, not the ones who favor something, and there may be just as many residents who favor it and for the very reason that it's conveniently located. We had both at the meeting. I will say you weren't there, but there were both rather than I, mean I. Think I'm probably just better off abstaining, rather than messing up your resolution, because I think the resolution is going to pass anyway and but I'm uncomfortable with these, I'm okay with prefer, because we have you know instead of objected to, we prefer, if you say certain residents, subjected or something like that. But when you say residents unmodified it, it's a declaration that the people want and how about? We add the word. Some fine, no problem with yeah some residents of death. That makes sense, I have a question here and it's because it's not showing it right now with the therefore be it resolves. Oh we're asking for transparency and input into the where they pick to choose the places right, because what we want is a master plan. We have to see it a couple times. Things have changed greatly since it's been seven years since the rollout we'd like to understand what the saturation, what the usage is. Where can we expect more? Where can we expect expansions we'd like to actually just kind of and that's based on? You know we already have a lot of bike stands down here: a bike station CitiBike stations down here it's based on the data that they we need more well I mean we have some that, where it's hard to find a bike at as well yeah, that's right, so I'm fine with some residents objected, I'm also playing with some residents reported. I would like to get rid of the warehouse that says put them on the bike lanes wherever you have bike dogs and then I have some suggested edits on the be it resolve, which may be a little bit more important than the warehouses and then one item, one other than the word reconsider at the beginning of item. One we reconsider the sighting I would say to consider DOT is urged to consider nearby alternatives to the siding at X, Y and Z, and then on. We actually talked to them about alternate locations already there so they're supposed to reconsider those sites and in the reconsideration, come back with us yeah. But this is the writing. This is the written resolution and reconsider basically implies. Maybe don't put any there at all and I would not support a resolution that says eliminate. Those two I would support a resolution that says to consider nearby alternatives to those two. That's in the weeds, I'm gonna leave that be. Can we say something like while some residents support, whatever others, have reported they're uncomfortable with placing these in front of a restaurant and still others report not having been spoken to at all, because I will repeat what I said at the other meeting 90 gold street was not asked and I don't really care. How it comes across has nothing to do with my riding bikes. My kids are right, but we have our own. We don't use the CitiBike, but in any case D.O.T has said they don't ask they notify they. Don't ask that's part of the discussion we're going to have, but if we're talking about what some residents prefer or don't prefer, then I think it might help to quantify the just the group if it takes two sentences, all right, why don't I suggest we just vote on the resolution, but also I wanted to remind everybody that Joe made a motion and I second it so we have to dismiss. We have to disperse with that or dispense with it. Somehow, however, that's going to happen and what was the motion about citing I? Don't remember anymore, I believe it was just to not cite a location in front of the residential on the residential side in front of 90 gold. Correct, probably Joe, probably I apologize for prolonging the discussion here. So why don't we go and keep in mind? This is executive and it's eight o'clock. So Joe is that where we were didn't, they say move it to in front of 100 gold. We don't know if it's on that side of the street at all, because Betty said it's just I think that may have been the motion is that what you're reminding us of Paul yeah? Okay? So I'm going to say yes to that motion for a friendly amendment all right now we're going to I'm going to ask if we can call the question. Yes, please, okay, so again we're gonna roll. The way we rolled before. So, if you it is a yes, a no etc. So all in favor, as unless you've joined us recently and missed the first roll call, you don't need to say a word. Are there any notes is Jason the only one that came in afterwards, so Jason you have to vote orally with your vote and so Jason Friedman. Are you a yes thank. You are marked present. If you are voting. No, please state your last name and your vote all knows. Abstentions, any abstentions, Galloway abstains, stains. Okay, abstains can I abstain. It's four! Okay, any recusals! Okay, perfect! Thank you motion passes, so I have Janelle K and Moruso and Galilei for abstain, correct and star. Okay, yeah! Sorry. Can you throw franker in there as well for abstain, yep, okay, so moving on 13, Harrison Street came back because there was a difference. As noted after the presentation, it was widely discussed and determined that a new resolution was not coming through executive that they would make a friendly amendment to the one that comes to landmarks and with that done, and thank you so much. Let's move it along to the next committee. Okay, do everyone a favor here and be as fast as I? Possibly can we had a great business, small business, Working Group committee meeting last month? We finally got around to doing some resolutions for that this month that executive Tim, you want to group them together. You want to try that okay, the first one was super easy came from Tom Burton I thought it was a great idea currently right now, if you apply for a SBA loan as a small business, and you are delinquent in your taxes, you're automatically denied that loan. This first resolution is seeking to remove that restriction. The second resolution is a support of the restaurant act. If you look at the resolution, it outlines basically everything that does, and the third resolution is a little bit creative leveraging, New York City, buying power to purchase supplies needed for small businesses for outdoor dining. That can include anything from barriers to reflectors to heaters to propane for heaters. We essentially want to be able to leverage the giant the gigantic buying power of New York City to try and lower the percentage of on hand cash cost for these businesses. Anyone have any questions on those I can't see the hands. I got hands for you and Mariama. James your hand is up yes, I volunteered. By way of Colin to look into the program that was with regard to 9:11, so I did look into it and I'm going to send you guys a couple of articles for the context, but basically it was a FEMA program and we can address it. However, we please, you know to city state federal whatever the case is going to be, but this one was a FEMA program as part of the individuals and families program, individuals and family grant. Programs. Sorry and I tried to get like a more specific name. As to this. You know, exact component of that grant program and I couldn't find that. But what I did find was a report on all of the FEMA programs at the time by the Gao, the government accountability office, and so, if we want to really like get into the weeds, we can find it. The reason I pulled a couple of articles on this is because you will find, if you do, you know, go down that rabbit hole. You'll find that at one point some like derogatory and then negative reporting comes back on it, but I just want I wanted to give you everything, because that was also corrected. Some people there was an argument that there was a lot of fraud and it was determined to not be true ultimately and Carolyn. Maloney and Gerald Nadler came out strong against that corrected the record. So, ultimately, it was found to be a good program yeah and you can I think anyone who's been watching. My resolutions, you'll notice that I try and be as big as possible. I do that on purpose, I'm not a big fan, I always say I'm a big fan of picking up the paint for the binders I just want to push the city in a certain direction and that's what this goal is here: okay, so if you're comfortable, you can, if you can refer to just the individuals and families grant program of 9:11. homework, I really appreciate it. Okay, so let's call the question seconded fantastic, I, think everybody's with us who was with us before all in favor. If you are a no, please say your last name and your vote: you're welcome any abstentions. Any Recusals next committee, Tammy, just one quick I, do have a plea like I had an executive the other night. The next thing I really want to address is venues music venues. If anyone has any thoughts on that and how to help these people, who floss their jobs and the venues the independent venues which are falling apart, please email me: I really want to get some ideas. Moving along Susan, Cole, Susan, I, know you're here, I forgot time, mute I said we could take all the resolutions together. Unless anybody has a question and I can give two quick reports. Basically just quickly 62 stone street is the finance Harry's is taking over basically that ownership of the financier, which has ceased to exist and they're, going to open up a cafe, it's all in the resolution and they're going to serve aperitifs supposedly with whatever that is, but if they need a liquor license and we approved it. A Pearl street sushi is not a problem and neither is the Nobu. So, basically, that's the those are the resolutions and I'm perfectly happy to take a vote quickly. If nobody has any trouble, does anybody have any questions for Susan in licensing? Yes, how much space is nubu asking of that wonderful building how much additional space it says there, any interior, dining space, it's a it's, not very big, Joe I! Don't have it in front of me and I, don't know whether Jen is on the line, but it's not a huge area, and it's during this. What they assured us and what we put in the resolution is that it's only temporary at this moment in time and they have to come back to us if they want to extend it is to to be able to have additional seating but within their larger space, but it is only temporary till this business. This pandemic goes yeah, so is over just so. People know that used to be one of the greatest lobbies in the city in New York and it's being shot to hell every time they come to us. It's a total disgrace and we should not allow them having extra space. Okay, it helps the landlord too, because the space has been vacant for a long time. So that's why they came into an agreement to use it to rent it. There used to be nothing on the and on that space the lobby was a plain lobby and it was the most gorgeous lobby in the city of New York and asked any architect here. Joe, you don't have any complaint there, but you're giving them space I'm giving it we're, giving it to them on a temporary basis. It's not on a permanent basis. You know that doesn't cold water, temporary Joe, you can vote against it mark and then Bruce well I hear what Joe is saying: it's an incredible designated landmark space, the Interior and we had a hell of a time chilling with it and discussing it over more than one meeting at the Landmarks Committee, and we do fear just like the pilot program of the ot on. You know: cargo bikes that once it's installed, it never gets uninstalled. So it's you know it's difficult for me to decide how to vote. Well. Listen! If you want to vote no, but you know I always have this view around licensing, because SLA can overrule us and I always want it down that we at least have a way to go back. That's my view on all of this mark has a question or has it had his hand up just a quick comment about additional space we've been noticing, and we should keep an eye on this and we have been that the restaurants are expanding. But using you know the social distancing guidelines, but the expansion doesn't take into account like they'll give us a it has we have 30 extra people, but the actual public assembly might be 65 when it's all said and done at the end of the day without Social desisting. So this is kind of a little bit of a nuance that we got to look out for because once this you know the virus is over they'd, be able to expand the expansion space, be able to have the reality of the true public assembly. So that's we have to look out for yes, I think that's correct! Okay, thank you mark. How long is the temporary for Susan again I think it says in the resolution, through this period of time, through this temporary in response to the state's executive orders and has agreed to come back to the committee if they wish to add more seating after the Al alteration is lifted? That's what it says in the resolution. Okay, perfect! Anybody else have any other questions. Bruce, you spoke I, don't know if your hand's still up Jason Friedman, I'm not sure why you ended up down there. I just forgot to lower my hand, okay Jason's in attendees, against, as you can unmute him and put him back up as a panelist. Well, I need him. Second I need him blah I'll call the question please for the resolutions at one time you have one more hand up and it's Jason, okay I, just can't unmute him from where I am well. I. Certainly can't I know. Yes, we are grouping these okay Jason your hand was up. I just wanted to ask to be a panelist again, but I'll take this opportunity to say that I believe Nobu is one of the great downtown institutions. They bring a tremendous amount of traffic and money spending and it's a good product and a long standing server of our neighborhood, so I would support them with anything like this, especially temporary. Okay, and with that, thank you. Jason welcome back to being a panelist and let's call the questions it was set called. It was second seconded yep, we'll run the same way. We ran before assuming all eyes. If you are a nay on any of the licensing ones, can you please state your name and what you are a nay for Joe? Do I hear any no's Mr Lerner I swear. He said he was voting no, but if he doesn't on, might no I'm sorry, that's okay, Mr Lerner confirm which one are you known for? Is it only 195 Broadway? Yes, thank you. Okay, anybody else, hearing no more no's any extensions, any recusals, okay and licensing is done. Thank you very much. Oh. Keep going you're on very quickly. There's a big turnaround. Blood manner and we're going to do some reconnaissance, but they don't have a liquor license, but I gather that complaints and whatever has been going on the street, is that people drink on the street or hidden, however, and they go to the delis and it's very loud and that the staff, when they leave, are very boisterous. So there have been some complaints about that. But it's not really. There is no liquor license per se for blood manner and then the last is 18 William. There was some mixed up around the the 500-foot hearing. We got a good letter from Margaret that went to the SLA as well as Gail and our other elected officials. We've sent a whole packet that we want to be informed. We can't speak when it goes before the SLA, but everybody is very concerned about this and we sent the negative resolution that we voted on in February and additional documentation and we're trying to be on top of it and that's it. Thank you. Susan and I will say it was very nice to have all of our elected jump on the bandwagon with us. In response to the community, so that was nice, Christine Welcome to battery park city, take it away, I got it. Thank you so much all right, so I've got only reports which is good. I'm going to go out of order because I'm going to go with what I think are the most important ones. First, so, first of all or last of all number five, the state of 421a and 421 g affordability in battery Park City Lucian gave a great discussion and summary of both programs for the committee and afterwards there were questions about what buildings are still subject to or have has 421a or 421 g available to them. In Battery, Park, City, Nick, Spordon graciously provided us his list of what the authority is working off of and gave us the information that his list is coming from. The affordable housing in lower Manhattan report that our member Tom Goodkind had research put together and compiled, and it was last updated. According to the report that Nick forwarded on July in July, 20 2012. and it was all part of the cb1's affordable housing task force that we need to put up. But just for the information we've got Tribeca point which is 41 river terrace with 70 units, river watch, 70 battery place, 43 units Tribeca park, 40,400 chamber street 81 units, South, Cove, Plaza, 50 battery place, 41 units, the Solaire 20 River terrace, 14 units, Tribeca, green 325, north end 14, and the verdesian at 211, North End avenue with 13 units Lucian, has access to the full report that this is. Maybe this is all you're making a phase. This may be old as of 2012. It probably is, but this was the list that he had provided. What would be really great is for us to get this affordable task force up and running to update the list update Tom's report, which Lucian has again it's up as of 2012. illusion has it and it can be shared, which I think is a great thing. Everybody should take a look at it. Next, the Gateway Plaza Attendance Association Class Action settlement Jeff Galloway, gave us a great summary of all that in a in real quick summary, HUD signed the settlement agreement. So it's now finally in full force and effect. There's some hiccups with the tenants association is on on it and working with the lefrak and gate and the management to fix, but there's some retroactive stuff going on, but they're working with it, and just so everybody knows what the settlement agreement does is, in brief, affords a 10 years of protection against double-digit rent increases for those remaining tenants who were in residence prior to 2009 and that's about 35 percent of the current gateway Plaza tenant residents. The remainder are subject to market rate rentals, whether they're up down or whatever senior life in Battery Park, City, Marianne, Braverman Report reported about what's going on with the time of Covid-19 with the seniors, things are okay, they were really good and going football steam ahead, but you know nine months in now, almost whatever it is it's petering out, but they are standing firm. One thing I want to note: is we at the Valley Park City Committee are trying to create a more robust dialogue between Allied Universal and the community. Member meeting was the first step and it's evolved into more of it, but we're looking to have allied, explain and provide a clear picture of what the ambassadors can and can not provide in battery park city and what the community's expectations are and with the discussions, how to bring them more in line with each other, because there's frustration on both sides and I'm hearing a lot of it offline and I'd like us to bring it online and have some. Maybe it's a task force. Maybe it's something else, but I think that the dialogue has to go forward and once again, the battery production authority can act as some a test case or a I. Don't know a shining light like they have done with which, at least from my opinion, what they've done with resiliency to how a community policing can be effective and how it can supplement, but positively supplement the NYPD and then that's about it. Rockefeller Parks opened mother, Cabrini statue in southern Battery park city has been put up and Belvedere Plaza comes over by where the mercantile Exchange is on the esplanade. They've got a installment art installment. That's called the house that will not pass for any color than its own Mildred Howard is the artist it's and it's it's cool it's in keeping with social distance. You can't go in and out of it, but it's the commentary on kind of inclusion and race and all sorts of stuff like that and the authorities addressing it in a quiet way and that's it I think I said everything. Any questions, I, don't see any hands. Oh Jason I think his science was still up from before. I would imagine it is, but anything anybody. Okay, thank you. Justine moving along next committee is Paul Goldstein, Waterfront, Parks and cultural. Take it away, Paul, okay, good evening. Everyone I am here to report first on Brooklyn bridge banks and dug out space along Robert F Wagner place. So, as the resolution says, I don't think this is going to be a very controversial item. I should note that these are items that the community board has supported through its budget process in recent years and we're just making a push for them now because again, we're fairly desperate along the east side to create spaces, additional recreation, spaces additional open spaces, and we think we have some good opportunities here. We had an amazing turnout on of former skateboarders, or probably we had about 60 speakers on it and they were incredibly eloquent and they talked about what an iconic and meaningful space this has been, and just as point to background for broken bridge banks Diana, you don't have the diagram showing where these spots are or do you anyway, Brooklyn I just need to switch to another document. So give me one moment: okay, but I'll keep talking. In the meantime, Brooklyn bridge banks was open for years and years it's under the Brooklyn bridge running from Pearl Street towards Rose Street, Face, University, okay, so there you could see on this map. Basically, it gives you some idea where these two spaces are so Brooklyn bridge. Banks was open until 2014 when the city started some construction, they're renovating the arches, they told us initially, it would reopen in five years now they're telling us it may never. They have no idea what it's going to go interesting at home I should also mention Bruce. In line of what you said about the ot we invited D.O.T to the meeting and they refused to attend, which was not very helpful. We did have NYPD at the meeting because we know there are also some security issues, possibly with these spaces, but NYPD didn't seem to have a lot of issues, at least from the person who attended the meeting anyway. The long and short of it is that you have a resolution before you, basically urging DOT NYPD and the city to work with us to create spaces that we think could work for the community. I should note that it's particularly with that dugout space, it's right on the border with boards, one and three and I've already reached out to like Satorus, who is in charge of Smith houses there. She really wants to work with us on this. It would clearly serve them as well, so this would be a rare opportunity to work hand-in-hand with another community board. Another community so I think that's also to our benefit and I also want to give a shout out to New board member Rosa. Chang who's been really great and a lot of help on this issue really figuring out things getting in touch with people and getting people excited about this possibility. So we do plan to try to have a follow-up meeting with D.O.T over the next week or two a smaller one, since they didn't want to come to the committee and we'll report back on that. But in the meantime you have a unanimous committee resolution and that's pretty much it awesome. You've got some hands up. I've got first Colin, then Betty and we'll go from there. Colin you're first Betty, your second I was hoping. I was the only hands up because I was just gonna call it a question. Nope. Sorry, please wait! Betty! The details of this resolution were not known at the meeting at the time of the vote. Otherwise, I would have raised this objection. Then I brought up at the meeting that there was a resolution passed by CB1 in September of 2020. It has some overlapping features. There really needs to be some resolution. In fact, this resolution doesn't even acknowledge that one exists in 2020 when it's already gone to the DOT, with our recommendations were some of these same very areas, so I actually would wish that you would withdraw this whole thing and wait a month as I asked before and work out, so that it works with the other resolution that was already passed by CB1 before promoting another conflicting resolution, which will only look worse in front of the D.O.T. This was raised. Are you oh you're still talking about it because in general, I don't disagree with many of the things that want to be done, especially the skate park. There's some wonderful features there, I'm talking more about the procedural issues here. I think this is an important issue that we should move forward on. I, don't think I think we did try to see if there were overlaps. I think that other issue is overwhelmingly talking about the road back. The lanes of the Brooklyn bridge and trying to rECABture those for pedestrians and bicyclists and others- and this is really a different issue as I see it and I. Think most of the committee heard your comments at the meeting and overwhelmingly unanimously decided to move forward. Actually could I also respond on that briefly Betty, so I. Thank you very much for sending Lisa Rosa hang on a Sec yep. Okay. I have no troubles with you responding, but there are also three other people with hands up so in trying to maintain decorum. I will say yes, but next time do me a favor, don't you know just I'm trying to keep you got where I'm going: yeah it's Rosa, Mark and Susan? Okay, thank you and sorry, everybody! So, just so! First of all, Betty thank you for sending that along. That was really helpful and I did review it and to see specifically if there were any conflicts or areas of overlap, and so the three points in the Manhattan side that they were touching with their proposal were number one: the off ramp that the New York Police department is currently using. As a parking lot which swings around, so it's actually cut off right now and they want to turn it into a cafe and bike service center and we are not proposing anything with that ramp specifically. So that is not actually a point of conflict, but that's just something that happens to be on the Manhattan side. The other part is the they wanted to do something called the understory, which was a community youth center that they were proposing to go within one of the or actually two sides of the archways, the the vaults, as we've referred to them on either side of Pearl Street, both of those vaults. The entire bridge is actually landmark, so they can't actually pull out one of the vaults and then put in their new proposed edition, which, because it's a landmarking issue and then the third part that they were proposing was a microforce which isn't specifically exclusively to the Manhattan side. It's all around its part. It's an integral part of their project, but the micro force that they were proposing is actually on the NYCHA property across the street from the bridge. So that is also not an area of conflict. However, I would absolutely welcome the addition of micro forests throughout the park. The area that we're talking about inciting of the that's directly under the bridge. That's it okay, thank you! Mark yes, I just want to state occur, make a correction here initially when we discussed this resolution, it kind of looked like we were going to have a vote and Joe Lerner interrupted and said asked. Can we have more details of what we're voting on? We weren't sure at that moment, I chimed in, and you know me, I'm a stickler procedure and I asked Paul. Please give us a point by point on it which he did so. The contents of the resolution when voted on were known. I just wanted to state that for the record, okay, that's it thank you mark Susan, you're next and then Jason I'd, just like to say I happen to think Paul is correct in the committee, because I think we can't do enough to torment D.O.T come on. That's not fair. Yes, it is I'm sorry, just one second I think we've tried very hard and they ignore us and I think it's a good I think we have to go forward with it. That's all I wanted to say: okay, Jason next I just wanted to say back in 2015 I made some presentations regarding this and we passed I know a resolution in full support of reactivating this area and I just wanted to point out that you know we're talking about tens of thousands of square feet of what was park and was then stolen away by who not sure, but when I moved down here it was a number one or two in the world destination for skateboarding and of course we want nothing more than to have worldwide destinations in community board, one that promote this type of activity. Okay, all right see no other hands. Betty made it made a request, I think Betty. Your request, unfortunately, was declined by the chair, so you can vote as you wish and Paul do you have anything else to add before we call the question? Oh no I think we could proceed awesome. Let's call the question all right again: we run as if we were in person anybody. We will assume that all our yays all hands are up for yeas. Unless you are. If you are a no last name and vote, please seems you lost Tom Burton he's gone, he probably fell off. Gotta, look for him in the attendees abstentions. Recusals okay motion passes noted that Tom is not here. Okay, thank you. Let me proceed okay. The next item is, we had a very good discussion with a gentleman named Kyle Kelly. He works for the Parks Department partnership for parks. That is a group that helps put together and assist friends of groups for parks, and he specifically works with groups in boards. One two and three, needless to say, I, think you're. All mainly aware that the city's budget situation is dire, the parks have had horrible cutbacks in their budgets, they've lost all their seasonal workers, so they are just you know. He acknowledged as a parks employee that they're dirty and they're not being maintained and I. Think anyone who is around the parks nose we're having a problem. So we really want to try to encourage people and groups and people from our district who are interested in helping a park near them to come forward and I would perhaps suggest that I know the community board puts out that weekly news blast. Maybe we could put that this in there for people to contact the community board and me, and we will try to you- know activate groups like that to help our parks. So that was a very positive discussion and the answer from the chair is: yes, write a blurb and we are- or we are happy to encourage that if you write us a blurb for the park with an email who they need to contact than for volunteers, we are happy to share that information. Thank you. You're welcome, okay, so last item Hudson River, Park, Advisory Council recent meeting regarding pier 76. Let me start with this and if Andrew has anything to add I'll, let him go basically. Pier 76 is up across from the Javits center in Board four, it is a space that's currently occupied by the toe pound, for the sit for the Manhattan. Tow pound is located there, so that is supposed to be part of Hudson River park and the state and the park and the governor have been pressuring the city for years and years telling them they have to get out and vacate that space and find an alternate space for the tow pound. The city keeps saying they're having a hard time finding spaces and from the accounts that I've heard they are really not finding any spaces. So that's a problem. I would just add, as an aside that there are people downtown who are looking into the possibility of suggesting 250 water street as a site to relocate that tow pound. Don't it's not such a far-fetched idea. I'll show you the history of that site. There were parking garages on that site running from at least the 1940s until the 1980s, until we can make it a distribution center. On top of that helps the community with cargo bikes. You know it can't want to put on top would be a a green space for the kids, the kind of green space that Howard Hughes was supposed to give us on pier 17 rooftop, which turned into their famous concert venue so anyway, the long and chart of it is that there is a dispute going on. This state has said to the city that starting January 1st they're, going to find the city 12 million dollars an additional 3 million dollars for each month, that they are unable to identify a site and move the toe pound off. So the city, it's another dispute between the governor and the mayor and it's preventing the development of and the completion of that segment of the park for Hudson River park. So that is the long and short of that issue. They are going to try to put interim spaces on there at some point, but that's about it. I don't know! If there's anyone if Andrew needs to add anything to that no Paul I think that's fine for tonight. Okay, awesome! Thank you very much! Mr Goldstein Next oops! I'm sorry! No thank you all and happy Thanksgiving. Thank you as well. Now, Mr Myhawk, are you with us this evening. I think he was supposed to give the report, if not Trisha and if Trisha is with us great. If not, what we're going to do is push that report down a bit and see if Jen can do it. So, let's go to the next committee and come back Mr Irman Bruce Landmark, with some preservation Europe. We will put their king Harrison second 271 Church street, which is also known as 90 Franklin Street. It's the North East corner of Franklin and church, where church and sixth avenue niche it's the Tribeca East historic district. The application is pretty self-explanatory. You may wonder why we're rejecting one infill window, it's really a two-story beautiful bay with original cross and cross double height, elaborate windows and moldings in this building. It's amazing! It's been through many lives and it's virtually intact and looks like it was just built with incredible original detail from 1930, so we rejected it. Anyone has any questions on that they can. Otherwise we can move on to 13 Harrison Street. Actually, we should vote on each separately because Turkey Comparison Street may be slightly involved. So do you? How do you want to do it? Should we do it now or at the end I think we should take 13 Harrison Separate I'd like we could do Trinity Wall 271. You want to do that together, okay, so 13, Harrison Street! Well, actually, after having when the presentation was made to us the do by the way, do we have the video very best to post I do have the video hi Bruce it's Diana. Give me just one moment: I need to switch to another application. Okay leave! This is when the presentation was made. The mock-up on the roof of the guys in bulk was not up after it went up whether it was congruent with the drawing in the presentation, or there was a real disconnect. I don't know, but looking at the view Carter from the corner of that street, it's an extremely disruptive mess and height on an intact 19th century block. In fact, there are matching buildings next to it, and it's presence is for me alarming. However, prior to looking at the mock-up itself, Susan looked at the mock-up, Alice I believe Alice. Looked that someone else looked at it, I wrote a resolution other than what we passed at landmarks and preservation with what I thought was. You know the actual visual knowledge decided not to not. We didn't vote on that resolution in the executive committee because it wasn't cut and dried. So what I wound up doing subsequent to the resolution that you see is suggested two amendments which you have gotten yet, but it's so simple I could read it to you. So, oh god, you could press the you could turn it on if you want now. This is the actual. I'm sorry. This is the street front. That's the bulkhead! It's completely visible. Otherwise there is no visible rooftop extension of any sort. We can go back again staple street now we're moving west on Harrison to the corner of Brennan Street. So I don't know exactly how to handle this procedurally, but you see the resolution and I am suggesting that we add up before the lens, whereas upon viewing the mock-up. The proposed rooftop edition appears larger and more visible than presentation. Materials seemed to indicate and I'll leave out and a serious rupture to a beautifully intact, 19th century block print I'll. Leave that part out just the first part and at the end of the therefore be resolved that adding but urges the LPC to direct the applicant to reduce the visible height and bulk of this proposal. Is that clear, I hope? So, let's open it up for questions after the video runs and then we'll see how clear it is how's that good, that's the video, so everyone can also watch it on their own computers if you wish so again, what Lucian has said is, if you are by any chance on a phone, he has posted the video in the chat, so you can review it on your computers. If you'd like I, see Betty has a handout followed by Andrew, thus far Betty Oop, these Hannah's gone Andrew, Zelter, so Bruce from a practical standpoint. Is there any structure you could put up there? That would accomplish that, therefore, be it resolved sure a lower. This is 20. This is at least 26 feet above the current rooftop, a lower one, I mean, although visibility is one of the main criteria in the landmarks district. Obviously things get approved all the time that are not, let's say, egregiously out of character: I, don't like the glass facade which has nothing to do with the Tribeca West historic district, but that's another matter. It's not really. The facade itself is not visible. The mass and the bulk are, and it's very disruptive but yes or I, would accept it if it were a lower. It's not a matter of me accepting it because I have to represent the committee, and the committee had voted in favor, although most of the committee did not see the mock-up, because it was only up for three days and it was after the presentation so just based on your experience- and this might be a tough question to answer, but based on your experience, what's there now is give or take 25 plus feet, based on where you took this video from what do you think it would have to be reduced to such that it wouldn't be an imposing mass or height I have to say that it's been the general position of the landmarks and preservation committee for very years that we do not redesign. We do not redesign proposals, we opine on their contextuality and their. You know their the visual bulk and so on, but we don't redesign it this by the way is the. As you can see, this is the original presentation. If you flip back to well, the video you'll see the difference, but even well. There I mean that's anyway. I can't say what height would be acceptable because we need to see a mock-up, but if it were lower, it would be more benign without preventing the owner from building a rooftop extension got it. Thank you, okay. That puts us as Susan Cole, then Vicky, then Alice Susan, you're up yeah I, just want to say I didn't get to go by a second time, but I went by the first time. I. Think Bruce's change is correct and I think it's just too high. That's it I, don't have any more to say: okay, that Vicky! Yes, thank you. Yeah I agree Bruce, one of the things as I recall. We had discussed and I think the height that was designed for comes, and this might help. Andrew's questions comes from the desire, I think to have a two-story inhabitable space. So the first one is the studio and yes, the glass facade and all that. But then they want to go up one floor up and have a terrace and I think that whole thing also extended at high was, you know, a bit of an overreach to get a higher view and a different experience. So this was problematic for us thanks Bruce. This was a good presentation. Thank you. Okay, alice yeah I did go by there today, Bruce and I. Just wanted to know. I could not find the the sloping glass roof scaffold. Is that some, how completely hidden then I it didn't make sense to me I thought that was coming up five feet and then counting back to the penthouse block. That's there I couldn't is that in this photo? That's here, because we're not seeing all of the pictures is that there somewhere and we're just not seeing it I'm talking about that. I could never understand there. There's the slope. I could never understand why we don't see that as part of the markup. It makes no sense to me that it's not visible from you saw the picture. I mean the parapet. Is the parapet isn't higher than that entire cross section? Do we have a picture of the front of the facade Jen so that you could just see what the actual total proposals keep going? Alice I think it was I know there is one I guess we don't have it here, but there's one that shows the rendering of what the front of it looks like is that it yeah Bruce I, think it's seven feet. High I recall asking that question. Yeah I know that we can recognize and call on bill to answer that. One question we usually do not recognize anybody in the po in the outside of board members, but if you do not remember, I would prefer to have the accurate information share and meanwhile Jen, please continue going through the slides I. Am you bill? Yes to answer the one question? Okay, hello, hi! Everyone. Thank you for this opportunity. The parapet. That's the top of the glass is 15 feet above almost 16 feet above the roof mine. That is not the cornice that you see the cornice that you see rises, 42 inches above the roof. So much of what you're looking at is the when you stand on the corner of Greenwich. Is the masonry party wall? I? Don't have the benefit of saying? Oh I'm on my phone, so I don't have the benefit of seeing the drawings that are being presented here. Can I just ask. The question is simply was: is the scaffold that's up the showing the slope roof or not? Yes, it has the it has described all the lines of the roof, not the face of it. The four lines that describe the plane, the scaffolding up, the orange scaffolding defines the lines of the accident Exonomic. Drawing that you have thanks. Okay, so I think we've gone through all the questions that we've got I see no more hands up to oh Jason, Friedman, sorry, Jason, you're, up, Jason, I'll, mute yourself. Please I just wanted bill to speak for himself and he covered the questions. Thank you, I think we're set. So let's get going Bruce. Did you change the resolution for the amend to add the friendly amendment? Oh Bruce disappeared. Bruce, I'm sorry I didn't because there was some time but I. At the beginning of the of my presentation, it was two sentences. Two new sentences in two locations which I can read again and I want to point out to the board that a different resolution, reflecting my personal opinion only because to vote on this and to vote against this resolution at this point means we have no recommendation for the preservation condition. So do you want me to read the two sentences and I? Can yes, please and Diana if you can put back up the resolution, so we understand where it goes. Bruce can you just remember the street level canopy the very large canopy that covers the entire sidewalk I do and I mentioned it. I went in the middle of the in the middle of it. The project also includes a large scarlet, canopy I. Think it's the original thanks on there. Yes, topping the first floor extending to the curve. Okay. Thank you, you're welcome! So, oh there it is so the before the last, whereas and after the one that says, was not available for viewing I'm adding, whereas upon viewing the mock-up. The proposed rooftop edition appears larger and more visible than presentation. Materials seemed to indicate and at the end of the existing, therefore resolve that adding but urges the LPC to direct the applicant to reduce the visible height and bulk of this proposal. We're now changing the architecture with I did, which I disagree with we're, not changing the canopy, but we're amending the approval, which it still is okay. So with that in mind, let's call the question all right. Second, you're calling the question fantastic, so everybody who's on board same as we all recognize as a yes, if you are a no please state last name in your vote and he knows Zelter no learn a note. That's Zelter! No learner, no any others! Abstentions! I'm sorry! Cameron! No! That's the third note abstentions. So that's snack abstains all right, slow down, I need to repeat abstains, so I've got schneck was that Cassell who's a little squeaky? Sorry, that's! Okay, Cassell abstains, melts or abstains from Kennedy abstains, Brown Kennedy abstains any other abstentions: okay, abstains, oh jeez. Okay, sorry, abstain, Oof, okay, anybody else! Any Recusals, Tammy can I ask a question before you close the vote. Yes, sir, the no vote means you're not supporting, therefore, be it resolved urging the LPC to ask the project to reduce its mass and height. That's what a no vote means you're opposed to that. A no vote means you that you do not agree with the application pretty much in anything because we're saying yes with the pro it's a yes, but right, so our butt is the reduction in the height. So how would one vote if you were in support of the application? You wouldn't either you would vote yes, but that doesn't make sense because you're saying yes, if you reduce the height, that's why I abstain because I think it's okay, the way it is well, then you abstain. Then you say no, but then it sounds like I. Don't want any addition on top of the building and that wasn't that's not my intent. Madam Chair point of information for procedural I think what the cleaner way to do this, and probably the proper way and I apologize I should have jumped in before this question was called I. Think because Bruce's amendment is more than just a friendly amendment and does substantively change based on subsequent information, the vote of the committee with an operative piece that wasn't a part of the resolutions they voted on the proper way to handle. This would be to first have a motion to amend on that on Bruce's proposed language and then see you know, vote that amendment up or down and then vote on what remains of the resolution, whether it is amended or whether it is original. You are the parliamentarian. If that's what you know parliamentarian says is proper procedure. I am fine with that and I would ask Michael Kutcher Mr Kettering. Sorry, I was muted, yes, I agree with Patrick completely all right. So here's what we're going to do then we're going to wipe the vote away because the first thing we have to do then, if I understand Patrick and Michael Kettering correctly, because we need to vote on the amendment. It's the two-line amendment to add or not add that to the resolution. Okay needs to be seconded yeah, so Bruce has made the motion I'll. Second, it perfect okay, so this is going to be a vote. Add the amendment to the resolution, which is a resolution for approval, and this amendment changes the our amendment to say: yes, but with reduced height, you have to do two votes vote for the amendment and then vote correct it amendment it's voting for yes, but without the amendment, as is, if we vote no to the amendment, as is it's just yes, no, oh you're voting just on the amended language, the language to add it to the resolution. No I understand it, but I'm trying to figure out what the effect of the language is and that's what I understood. That's so tell me what that was my question: I get what we're doing you get correctly. So the resolution was a full positive without restriction on the height of the addition. If you vote for the amendment, it is still an approval, but you are also saying that there that the height could be restricted, got it. Okay. Are there any other questions on the amendment before we because it's been called and we're ready to roll? So all in favor of the amendment is a yes. If it's a no, please call your name and say no all right. So are there any no's, Mahoney, no star, no or no James abstain, any recusals? Okay! So a moment can we go through the opposed one more time if they were a little fast? So if you were opposed, can you just say that one more time read who you have so we'll go that way, yep I have. Let me start from getting I have James is abstain. I have Mahoney as opposed Schneck as opposed and Zelter as opposed. Yes, Star was opposed. Thank you, Lauren learner, no learner are you opposed to the amendment Joe? The amendment was to lower it. No exactly idea. Gotcha all right, I, understand that. Thank you. You're welcome so and then I think Betty you were, the right was no on the amendment correct, okay and Kuchia is no on the other thing. Fran Kerr was also on the amendment yeah, okay, Franker and Kuchia Right and Lerner is a yes for this one: correct, okay and Brittany and Tammy. I'm sorry when this is all resolved. Can you just please give me the final tally for the amendment, so the amendment passes, because, if I understand correctly between the nose and the abstentions, we have seven amendment passes. I just need to tally. Please she'll send that to you off the side same as we do every other way, so the amendment passes so now we're on to the resolution itself- and this is now with the resolution. Are you saying this is an approval of 13 Harrison with the amendment which is a request to lower visible? Now, if you are in favor, that's a yes as amended. It's a no, let's call News Mahoney, no okay, no I'll turn out franker's a no joe. This is this Joe I hear where you're going but understand what you're voting on here. Did you want the lower or not no I want nothing? Then you need to vote. Yes, then I vote. Yes, thank you Tom. Thank you. You're welcome. I have Mahoney Star Schneck Zelter, okay, hey. Can we allow Joel Coppell to vote? I'm voting? Yes, thank you all right, so just to confirm for the nose I had Mahoney K Schneck Filter Star, who else Kucha okay Motion passes. Thank you everybody. It was a little confusing. We appreciate our parliamentarians and the process for making it work. Thank you so much, there's one more report and Tammy was very involved in this- is the I'm sorry Water street and 173-69 John Street, as you probably have all heard, on the parking lot site across from our school, the 250 Waterstream site a giant double story. Building he's proposed and is there do we have the revenue yep there, but the way it pops in this giant this century in the middle of a low-rise. Historically, the applicant kept referring to like the buffer zone between the landmarks and the non-land market. Lpc has never recognized, never a transitional zone. There's no such thing. We even wanted 20 years ago for LPC to recognize a transitional zone where there isn't an abrupt shift between the designated district and the neighboring neighborhood. They didn't so there's nothing transitional about this. It's an immense eyesore. It involves the displacement of on youth development rights on the pier it looks like this is another situation where the city is moving without us. I, don't know how we're gonna stop. This I will also add that the other building, which would wind up being a renovation and also addition to the assassin Seaport museum I, would check that image is arguably better than the architecture of the giant towers, but we also had some issues with that architecture, but it's much more contextual, it's much. It serves the landmark district. Much better. However, Tammy asked the brilliant question after three hours of meeting by the way is this getting built. Can we move on to the illustration of the actual building? We're not there? Yet that's what exists and the renovation? Well, maybe we don't have it I'll, just let you keep clipping about keep talking this part of it was well. The idea is that a building would fight in perpetuity the survival of the South Street Seaport museum, Tammy said well. Is it going? Is that money earmarked for the construction of the building and Lo and behold? The money is not. The money is ostensibly earmarked for an entitlement for the South Street Seaport museum and museum isn't required and doesn't have to and might not build this building. So that leaves us with that giant double tower and perhaps no extended museum. The last thing I want to say, I'm sure bad things is just having been on the community board for 21 years. The viability and sustainability of the South Seaport has never been off the table. It's been an issue for a quarter of a century, it just it never ends and at some point one has to say well, there are other dire needs for other dire non-profits in our country. So I'm including help our Manhattan cultural council, the poet's house, just flows, which was a wonderful thing. This has to stop like it's very nice, to have a South Seaport museum, but both its programming and its existence have been in question. For quite a while we're doing a resolution in December by the way we don't have one this month. The only thing I'm going to add is if you do not attend landmarks. If you would like to see the presentation or the recording I urge the entire report, it is way too much information to give and a report at full board. I urge you to look through the presentation. I urge you to look through the environmental impact and everything that we have, that is available, email. The office Lucy Diana, Jen Lucian. Anybody can get it for you. We have a lot of it out there publicly. You must educate yourselves because it was confusing and it continues to be Patrick. Go ahead. I see you want to echo that point and especially encourage members of the land use committee to do exactly that. I attended, because this is a precursor potentially to a land, use application. That I think everybody can appreciate and there's a lot of information that can be mined from those presentations as well, and it's really good to have that history going into this and I thought that there was a lot of course, information missing from the landmarks review, but be that doesn't mean exactly. Thank you. Patrick Bruce did we do the the other resolutions? Did we pass those? Yet we didn't I, don't think we did gonna take 270. Jason. Will you oh I, can't we're gonna, take 271 and trinity Super fast, please I, don't think we even presented Trinity did we I mean we can just vote on it? It's fine, otherwise, Jason wanted. You know there are any questions it was non-controversial, except that we wanted the intensity of the digital signs to be worked with on staff level. I believe that's what we came to. Otherwise it was an approval. Call the question. Thank you! Secondhand yeah, okay. This is for trinity and 271 church and thank you to Brittany for reminding us that we didn't pass that vote yet so all in favor for a yes is the way we work. If you are a no, please state your name in your vote, calling on knows Russo No on Trinity. Thank you mark perfect anyone else on both or one no on trinity. Thank you, any abstentions. Any Recusals motion passes. Thank you very much and Bruce. Thank you again support our landmarks committee. People folks support the land, use committee watch and read and educate yourselves, the historic South Street Seaport. This is our opportunity next committee. So if we're going environmental Alice and then we're going to go to youth in Ed afterwards, well wow hi there. What is it 9:18 and we're going to move into a zoning text? Amendment that looks what makes 250 water street seem simple. All right, I will on 250 water street the update of the brownfield cleanup just quickly there. The update will really happen, hopefully on our next meeting on December 7th, our community consultant Laura Dodge advised us that the they're in a holding pattern and are looking through the data still so that's. What is the update, we'll hear more? Hopefully, December 7th and most of this data collection should be completed in the next week or two. So, moving on to the zoning for coastal flood resiliency, it's definitely something people should are going to want to read through if you're interested. It is a pretty impactful text amendment and spending a lot of time with it. Allison Brown and Genu from DCP came and presented. I'm just going to read what Kramer 11 provides Diana go back to the first slide. Sorry, just so, everyone knows what it is and then we can quickly go through some of the details, but basically this was rather certified, rather for public review on just October 19th same time as governor's island. It's a city-wide text, amendment known as zoning for coastal flood resiliency. The proposal seeks to update and make permanent those zoning regulations that were adopted on a temporary emergency basis after Hurricane Sandy to facilitate flood resilient construction within New York City's flood hazard areas. If adopted, the text amendment would affect mostly properties located within the city's one percent annual chance, 100-year and 0.2 percent annual chance 500-year floodplains, although certain provisions would be applicable to all waterfront sites. In addition, the amendment would establish a framework of special provisions that could be applied throughout the city to facilitate recovery from future disasters, including those not involved in fighting with involving flooding or other physical impacts, including to address Covid-19. Okay. That gives you an idea of you know the meat here. So basically, this is about looking at buildings, primarily in fact, okay. So, let's just see the I'll try to run through this. Okay. So, as is noted here, the Z c F R would provide the option to design or otherwise retrofit buildings to reduce damage from future coastal flood resilience. I don't have to read it it's about it's in front of you, basically to make the buildings more resilient, and you see in front of you the different texts from which this has come. Okay, essentially, there were four goals that are presented by the Department of City planning for this and we'll go through each one, just very briefly goal one will come up next, so goal one encourage resiliency throughout the current and future floodplains. So this is a slide that Tammy had wisely put up earlier, which shows kind of the impact of this, so rather than looking at buildings, and take a look at governor's island for this you're, looking at lots. So the you're it's a much broader scope that we're looking at that this that the city-wide Texas Amendment is covering goal two to support long-term resilient design of all building types, and this is kind of an incentive of sorts to allow an additional story to be built on an existing site in exchange for assuring the ground floor of the building is made more resilient, either by a wet flood proofing, which is in residential construction, which is allowing water to pass through the building or dry flood proofing, which makes which would be making a commercial space, watertight and usable. So for people who are thinking. Why do I need to understand this? I'm jumping in to say understand. This will apply to every single building built on governor's island. This will apply retroactively to any presentation we have seen through landmarks for 250 water and the historic buildings in terms of historical context. So, just top the information that you're going in and yes, they are all on the same timeline thanks Tommy. That was a point that I wanted to make sure everyone got so good, so wait. How is this for new buildings built as well as existing buildings, to be retrofitted? That's correct, okay! So here you know, for there are some floor area exemptions, and this is something that again on governor's island is going to be somewhat important if space is dry flooded. Basically, what happens? Is you take the ground floor and you put it on top of the building, let's say so for that 10 feet that you're now going to flood proof can be then lifted on top of the building, making it simple and so, which I think was pointed out during the meeting. A 360 foot building, which is allowable now in governor's on, could be a 370 foot, one just in terms of terminology which doesn't seem to ever be defined in these packets, but design flood elevation is DFE which is used in building codes, and it's the same as flood resistant construction elevation which took me a while to figure out the frce, which is a zoning term. So this is a I thought, a helpful shot that they had in their packet, which shows what this would basically look like. So this area on the ground floor you can see, is raised next, one so gold, three that allows for the adaptation over time through incremental retrofits. So what this means is, for example, if you're living in a building- and you have mechanicals on the ground floor, this allows for the building to you, know, garner the resources and put it on the top or in a support space. Obviously, existing buildings and new buildings would be constructed as such and they there's basically flood protection measures and support spaces would be allowed and would not be counted towards far so I think we have some examples of well there's one for the mechanical equipment right, so you could have a separate structure on top and then support spaces oops. Well anyway, if you go back, I mean basically there's support spaces which allow for other things that don't go off the ground floor anymore, to be found to find a home, and it's anyway, she could go. I feel like I, could either say a million things or nothing. So I'm going with just letting the slide say it. But if you have a specific question about any of this, we're going to go over this in much more detail in our next meeting, which should be December 7th, where we're going to take some time to look this over more carefully together as a committee and then again at the executive committee. So you'll have your shot at trying to understand this more. But we will look at this in vis-a-vis, governor's, island, 250, Water, Street, South, Street, historic district, so that we could really make sure how this impacts lower Manhattan. Is that it? Oh, no okay, so the waterfront sites so yeah with the waterfront. That was a little bit of a gray area it you know it would it's. The idea is to encourage the provision of soft shorelines. The regulations would allow tidal wetland areas to partially satisfy requirements for waterfront yards shore, public walkways and planting. In addition, certain flood protection measures, such as temporary flood control devices, structural landscape, berms and flood gates would be made permitted obstructions in waterfront yards and visual corridors, and this is something that's very important when we again look at a lot of the areas that here in lower Manhattan, so we will do that goal. Four is the next goal, which is to facilitate future recovery by reducing regulatory obstacles. The Zsc, the coastal resiliency, would create a framework of special regulations that could be applied in the event of a future disaster to facilitate recovery by a separate text amendment to the zoning resolution. So they see this as a element of flexibility in the text amendment and there are permitted obstructions that will be allowed. For example, power systems that now are will be considered permitted expressions. In addition, accessible design will allow for ramps and lifts to be considered permitted obstructions. So, as Tammy pointed out, the governor's island and the DCP wrote the text at about the same time and both were certified at the same time last month. So we are assured that there's that they've looked at each other and they're similar and not to be not controversial. That said, the text here is about buildings being resilient, but, as DCP stated, it's really not dealing with city infrastructure and somebody asked about well what, where? How did the plans for finding the Seaport fit in here and well? We, it was answered well, this is that's more about infrastructure, investment and resiliency, and that's coming from a diff quote a different end of resiliency and I would say that we really, as a community, need to be very convinced as to how infrastructure, as well as buildings, are being accounted for in these texts. In this particular text amendment, so that's something I think we should be looking at very carefully. Alex you've got two hands up so far. That's that I think I'm done Jason and then yeah I feel like I've, never spoken so much in a meeting but I as someone who owns a building who had to rebuild their building from the ground up after Sandy I just want to make sure that when we, you know, actually write a resolution about this and this some of this came up during the meeting. You know it's fine to have a standalone zoning resolution text change, but it really has to come hand in hand with some, maybe in the sake of like landmarks staff level, changes to the laws because as a building, for example, in the Seaport, you know if we wanted to move our mechanicals from the cellar which is practically underwater, it would be the hardest part for us would be getting it across the landmarks table. You know and convincing them about visibility, all the stuff that we hear and then also at the same time, it's fine to have all these new zoning tax resolutions. But how is it handled at the building department and in terms of building code, which is another book that gets thrown at you when you try and do these things and I hope that they're working and we should ask that they're working hand-in-hand with these other agencies, to make sure that it's a comprehensive? You know some scenarios that we can set up, for you know the smaller buildings, not just the mega. You know, builders that can just do whatever the hell they want, because money is cheap or whatever, but more like the small condominiums and co-ops that line these neighborhoods on the shores of lower Manhattan, Tribeca Seaport. You know all these neighborhoods, so I think it's important that we, you know make them. You know, push them to work with these other agencies, because it can't just happen as a zoning text resolution. That's a very that's a fantasy you're, absolutely right, Jason that both those points were addressed. Actually, we did talk about landmarks and the need to have landmarks very much a part of this, so that they are aware of that. Just what you're describing that you know you don't finally get yourself together to eliminate your ground floor, mechanicals to find that landmarks has no interest in your. You know, fifth story and as far as the building department, in fact they came and presented after and they are very much in sync or so they say, and of course all these plans would have to abide to the requirements of the appendix G, which has been updated. So that's that has been to my knowledge done and is referred to a lot in the text. I think that again, this is one of these things that really favors the mega developers. We all know how hard it is to do. Small projects like this I mean imagine, adding a story to a five-story building in a co-op of four people that you know don't make 20 million dollars a year. It's just not it's not! The zoning resolution won't help them. It's really going to help people that just you know money. So Jason, but that's it, I'm done no Jason you're not done because now you have an opportunity to help us figure out requested changes, because we don't disagree on that. I brought that up at Burrough Board as well yeah. We really need all hands on deck. For this writing this resolution. We really need that your help. So please come to that meeting. Both meetings, the first one being an epc on December 7th thanks, Jason I'll, be honest: okay, Laura, hi, see your hand there yeah well just a second that you know that the DCP hasn't coordinated, what they're doing with other agencies, and they do need to coordinate it with landmarks and they need to coordinate it with DEC about the shoreline work which I realize. Cec is a state agency, but you know other otherwise it's really hard to move forward on what some of the things they're proposing I'm as I'm talking, I'm wondering if maybe we should have a conversation between this committee and the Landmarks committee. You know, within the community board, to talk about the implications of this for the smaller buildings in the Seaport happy to have whatever discussions you want just know that it has to happen quickly, yeah, simply because everybody's on the same clock and while I think that's categorically unfair to put that pressure on a community board and to ask us to opine on two of the largest. You know: land use, landmarks, zoning things that we've had in front of us in a while and change all the parameters by the zoning text. Amendment you get where I'm going: okay, yeah, okay, all right! Thanks, good points, yeah! It could be really helpful if everyone who is interested and can spend some time in the next a week or two and provide notes and send them to Diane and to me, so we can start to compile this for the resolution. I have certainly done that and I've included a lot of things Rosaceae. Thank you very much for a lot of the good points that you raised in the meeting. I've gotten notes on everything I'm certainly not going over tonight. Unfortunately, we don't have the time, but that's all going to be part of it. Rosa you're the last to speak on the topic and then we're moving on to I, see Android's hand up too sorry for a second I'll reiterate that I am available to help on this as much as you need me to because I think it's incredibly important and I just also want to agree with Jason 100 that you know- and this is the point you made at that meeting- that the benefits to the existing buildings are very few and very costly and the, but the benefits to larger plans, development that haven't actually been built yet that are able to integrate these things are enormous and so I feel like. If it has to happen, then it should be more fairly distributed and clearly delineated. The difference between how new buildings are handled versus existing buildings happy to have you on board and please send all suggestions. Yeah, Andrew I, see you took your hand down yeah. My question was related to that exact point. How the financial aspects will play out here and I. Imagine it's too early to have a definitive view on that police said that they are doing. They said at the Borough Board meeting that they are doing it to benefit property owners and new development fiscally to encourage them to do resiliency measures, so they actually did talk about the financial benefit and said it was specifically to target a fiscal benefit. We look at it and say that the fiscal benefit is not there's no equity or parity in it for existing buildings. You know what Jason and Rosa are talking about so yeah, that's what I was referring to retrofitting I would imagine unless the plan the costs are going to be borne by the tenants of those buildings. Oh yeah, yep, absolutely all right! So, okay, one more report. If we can bear it and just one thing while we've got everybody's attention on this- is to please let's look very carefully at also how this affects city infrastructure. It's absolutely missing to me anyway. Moving on so the DOB, the department of Building came I think for the first time to the Environmental Protection Committee, to discuss sustainability, and so we heard about changes for the building codes and flood insurance maps from Joseph Akroyd and Gina Boca who's. The chief sustainability officer very interesting conversation Ebay states that their objective is to transform the built environment to becoming more sustainable, that's good stuff. They highlighted at the DOB the local laws recently passed, which formed part of the green new deal. The city council, as most of you, know, past legislation, which this board has supported to mitigate the significant effects of greenhouse gas emissions and buildings, which contribute nearly three-quarters of city-wide emissions. According to the video, the purpose to reduce the greenhouse gas emissions by 80 by 2050, with the interim goal, 40 reduction by 2030, the DOB assist applicants. They want to make clear about new roof design with solar roof and green roofs, which can improve sustainability and resiliency profoundly. Of course, local laws also include laws requiring video building audits successfully and a successful energy grading system for buildings over twenty three thousand square feet, which in fact they say, formed less than four percent of New York's building stock but 60 of energy usage and like with restaurants, the Dobc's. This grading system is helpfully competitive where the public can understand how their building's energy consumption compares with others. The New York City Energy Code, went into effect in May of this year, which is credited to being very forward-looking, with the understanding that energy-efficient buildings are, of course, more resilient buildings. The DOB is now looking into how to incorporate an energy strategy into buildings, particularly like solar strategies. Most of these types of strategies are now found on the exterior buildings. They are working with the FDNY, for example, to get storage batteries safely inside of buildings. Our fearless Bob Schneck asked about Passive House, which was terrific again the board design on record for supporting this and asked if the Dod in court incorporates passive pass measures and they state that the New York state currently does not accept modeling software for passive house compliance and once the state does, they can accept it, and the DOB says the Passive House was quote a great voluntary code and I think I'm going to leave it at that. We then had a conversation about insurance, flood rate maps and can and I just I, don't know if we want to review that, but I'll just say that there are two maps that are currently being forced. New, York City maps are, interestingly based on data from 1983, which was re-digitized from 2007. So to say, it's outdated is slightly understated that right now they only show 35,000 buildings in the special flush hazard, but there have been adopted, 2015 insurance rate maps and basically New York City appealed these maps, which, however, they deem valid because through the appeal they were adopted into construction codes and the appeal was to allow for New Yorkers to afford flood insurance. So anyway, the updated maps won't be around until the estimate is 2025 which, at this point a hundred people will double who will need flood insurance. So that's, of course, a rather critical number and the DOB agreed with the members who stress the importance of educating the public about blood insurance requirements, and last week heard we heard from Josh Nakowitz Senior Vp of Economic development, the downtown alliance, our friendly neighborhood, and only bid about how the alliance supports sustainability, the sustainability and resiliency initiatives in lower Manhattan, which they believe is an important part of their mission. They spoke about recycling and composting as being one of their most. You know important missions and advocacy towards that went into some statistics about that which is probably on their website. I think I won't go over everything because it's late, but they talk about working with certain companies that you know do self self-contained composting bins which were interesting that they wanted to place in bowling green park, but that had to stop because of Covid-19, as did many of the recycling events that they had hosted last year, like a shred-a-thon and textile recycling and they've partnered with other companies to have more tech access, the one thing that they didn't answer that we're going to ask them to come back, and they will I'm sure, sooner than later, just really to talk about resiliency in terms of actual property owners and what they were doing in lower Manhattan. Since how effective that's it. Thank you all right. You give me three, you give me three huge reports. I did the best. I could I know. Sustainability will come back. Another time, yeah hear that one all right, Trisha we're gonna, do youth in Ed. Thank you so much. Thank you for waiting, I'm very sorry everyone. So our I want to start with the resolution. Actually, the the mayor and Chancellor Carranza there's a typo there had wanted to had discussed, possibly removing all screens from screen schools and doing away with Gnt during Covid-19, while looking at screen. Schools is probably a great idea because of the fact, mostly because they haven't continued building them and they're very overcrowded and now way too. You know fraught with some admissions issues. We did not feel as though this was the time to drop screens, most importantly because what we saw with their adjustment to remote learning is that they have no plan. As recently as today, the mayor was only identifying the problems we have and yet offering no solutions and so to abandoned screen. Schools at this particular juncture would be a disaster in our view, so this resolution just says until this pandemic is in the rearview mirror. We should not change admissions methods and we should also get on with it, and let parents know what they're going to be doing for next fall because they haven't yet, and it's very important people are trying to make decisions, especially now with remote learning they're trying to make decisions about what they're doing, and it's really important that we let families know. So that's what this resolution is about, so I will say: let's call the question: do I have a second awesome, we're gonna roll as we rolled earlier. We're gonna assume you're a yes. If you are a no call your last name and your vote, are there any no's? Are there any abstentions? Any Recusals motion passes unanimously. We love that I know. You've had a long day. If you wanted to give a one-line update on any of your other things, we would be not insulted by that. Well, Gnt is tied in with that we're not weighing in on that now. So it was all about just freezing it until later: New York, Harbor School only thing I'll say is we are advocating for them right now to make that school whole by finding them temporary and permanent solutions to pools, and then item number four really continued discussion. We'll have more on that, because we have a change in that area since our meeting having pulled out of blended learning so I'll shelf that one actually and then also say that the public library is also on hold given what's going on so there that's pretty quick awesome. Thank you very much and Diana is that our last committee report I, would love to say that it is I know that we still have land use which includes governors island. So let me get to that real fast. Okay, let's have transportation, sorry buddy! Let me find out which one's first hang on quality of life- oh man, okay, sorry guys! All right transportation, Betty, you're, next, okay, great well, I, can tell you it's pretty quick. My only comment is going to be on item number three. If I could have a picture, it should be the yes. If people remember back in December of last year, CB1 passed a resolution in conjunction with the youth and Education Committee about Trinity School, which is here in the blue area, and they wanted the extended sidewalk space for gathering of children and families before class, which is the area marked in Brown. That means the closure of the westbound Edgar Street. It turns out the D.O.T came to report, and not only they looked at the four options that were presented to us before and found with their crash studies and traffic studies that this the one we picked is the best option and the one that they were willing to move forward with preparation for the opening of Trinity School. The new piece of information quickly will be because the bus door is on obviously the right side of the vehicle, and we have a lot of one-way streets here. The drop-off spot for the bus stop would be at Elizabeth Berger Park on the corner where it meets Trinity. So that's South, West corner again. There is a signal behind it, so the entering traffic can only come from one direction and is stopped on occasions. So it's not a disaster. Trisha didn't have her hair on fire when she heard that we also found out that, because of the way people be exiting the parking garage which would be right at the base of Edgar Street there and denting onto Granite street, there may be some increased traffic on Cedar Street, which Pat Moore was not happy about, and we will be looking into that with the D.O.T to see what we can do to alleviate that one issue and that's all I have to say, and there are no votes, so thank you, Betty gets I have some of the hardest things and the conversation's not done yet because Pat has feedback. I know on this with your hand up and if you remember we're, also going to reach back to try and get Liberty street reopened. Yeah, I'm not happy about this at all. I'll oppose it constantly and continuously I. You know that we can not allow to have more traffic onto Cedar Street. This is extremely I'll, say it disrespectful for the people who live in this Little Greenwich, South area and I, don't know if bill wants to chime in, but I think. This is ridiculous: that they're going to put more traffic onto the only street that goes westbound at the moment, which is my street that I live on, which is a tiny little street. It's closed half the time because the fire department uses it to go in the opposite direction to go east, but we can continue the conversation. I'm really angry about this, which is why we don't have a vote yet and it is going to be discussed in community again. Jason is your hand still up yes and I wanted to let people know who aren't listening. The only option around that would be to open up the east. The West bound Edgar Street, which was the request in the first place, was to give a place for the students to gather, can I raise my hand. I can't see the truth so Jason, you muted, so I'm gonna say maybe Jason stepped away, Trisha go I'll, just say quickly. I'm surprised to hear like I did not understand that there was any unhappiness with the westbound lane of Edgar closing, most importantly because the at least 12 or 15 times I visited that location, there's no westbound traffic and I can't imagine you know. My hope is that it will not impact Cedar Street at all. As a result, I'm surprised that there's a perspective there's no other way to get to the garage, but people weren't using that entrance to the garage that I saw and I just you know again, like I hope that what I saw continues because it would be very little impact. I mean I'm talking two cars in 50 minutes and the only thing I saw on that street was the parked scooter. Police, scooters so or I never would have recommended it in the first place, but they will have to explain and discuss it again: Trisha Tricia! Yes, let's bring it back to committee. Let's get port authority, let's get D.O.T. Let's talk about the re-opening of liberty, which was the solution that was recommended but didn't feel was possible without advocacy from the community board through Port Authority and Silverstein and NYPD very good, okay Benny. Thank you very much. I know you get a lot of the good, confrontational ones. Jason is your hand still up nope, okay, we're moving on. Thank you Trisha very much and thank you. Betty Pat you're on I guess: I have to do it: Sammy, hi, Fern, hi, okay, so the at our October meeting, sorry November meeting the governor's island trust came back to formally present on their ulurp application and they presented. They gave us a huge presentation. I'm gonna, take you all through a hundred and something slides just kidding. I'd cut it down to about 20 here, but since we're so late, I will just try and do the high. You know the highlights. I think many of you are already on this call. Basically, the rezoning application is to allow a maximum of you know more than four million square feet it. You know I, think you're, all aware of that, and it's and the use is basically to extend it on the the South island as well as I'm looking at my notes here, yeah, so we're really adding a lot of development to the South island. If we can, we could go to the Diana if we can. This is the zoning change map that they shared with us. We can go to the unless anybody has questions. They showed us, the sub-districts, the areas where they were that they're planning to change where the development parcels are, let's see, I think so they what they did say is. They gave us some information on things like density and they wanted it to be adjacent to transportation and see. They also showed us some of the planned connections throughout the parcels and their plans for enhancing the esplanade. We had some questions there as well. They talked about the maximum heights and there were a lot of questions with that as well. There is a transition zone. Quite honestly, I did not understand this slide and I still don't. So. If you have questions I, don't think I can answer them, we can yeah so and then they gave us. They gave us a couple of different views of you know of what they expect. The development to look like from various vantage points on the South Island, so we're just quickly skipping through them. Here we have these slides and I believe we have them available for people to look at if they're interested. We do indeed so yeah, so they also did they. These were the I think these were the most interesting slides, because this is on the draft environmental impact and they showed how these the height would affect the island, and so that was a big that was a big focus of, and you know of questions and discussions at the meeting, keep in mind for everybody on the call sorry to interrupt you fern everything that happens in the Z zoning for coastal Resilience text. Amendment changes the presentation that we have seen, including shade studies and everything else, how that's going to work. I don't know. Yet we have asked that question we're waiting to hear back on that yeah. Okay, keep going yeah, so, oh and here we are at the end, okay, so the last slide I mean what I will say is there was a lot of input from the public. A lot of people signed up to speak, obviously we're still accepting written comments until December 14th, so anybody any members of the public on who are still on the call you can submit your comments and to the Europe application I think we have it in the chat window. The other thing I would mention is there was a big turnout from the parents from the harbor school and tying into Trisha's comment about getting them a new pool. That was made very clear. That was something that was missing and they were really interested in getting that done. Let's see, and there was talk about resiliency, but yeah I think that's kind of they come back to us for us to. We will be voting on the resolution at the draft resolution on December 14th for this application. So again, I'll recognize some questions but understand this is such a huge application. Everybody needs to look through the slides. Everybody needs to send questions, we'll be sending questions off to get answers back and just everybody's got to kind of do their own due diligence, I'm going to recognize hands that are up Jason, your hand is still up. Are you there Mariama, hey Fern I apologize for not being able to stay on for the duration of your meeting. I was wondering if, with regard to the hotel, they at least hinted as to whether or not they were looking for any permanent residences. I I'll tell you I think the answers that I it didn't sound like it, but I can't really say for sure it sounded like they did not expect there to be any permanent re res residents on the island, but it's really hard for me to say that they said absolutely no way. That would never happen. It can happen because when indeed, when the deed expires, there's a minimum of 735,000 square feet of private as of right allowed I mean that was the whole thing. It did not say unequivocally. Anything was off the table, and so did you say a minimum Tammy. That is what is allowed. Anything else. Would have to come back to us is what they've said I see. Thank you. Rosa hi I, just remember from the meetings that it was pointed out that they were basing their building heights off of the statue of liberty because they were trying to basically be lower than the stature of liberty. I just looked up and the statue of liberty is 305 feet tall. So I'm confused. You are confused because all the buildings with the setbacks and the allowables are at 360. yeah. The zoning text amendment is approved. Then you're talking 370, because there's a 10 foot bonus that goes back to it. All the setbacks would have to be different. All of the pedestals would need to be different and everything as presented for the structures of the buildings would have to be redistributed. So, yes, okay, so they actually did try to respect the height of the statue of liberty as a limiting no height we're stuck okay. Thank you. Andrew I saw your hand up and then down I'm good Timmy. Okay, Mariama! Is there anything we can do, maybe even just in general, about all of the privatization of public space, any kind of official stand we can take I, don't know good question and I think you're talking to a vice chair and chair who would agree with you on that Colin Sorry admitted just super quickly, I'm as upset about this project, as anybody is I just say to the group who are asking questions just show up to the next land use, meaning where this is being featured. That's where you should be here, that's we should learn about it and you should let them know how you feel. That's all yeah and submit written testimony. You don't have to just to vote. You can submit written testimony as well hiccups, all right, let's go to the bathroom soon. I just want you to know that. So, let's make it quick, Tmi, okay, Fern y', all that's it yep! That's it all right! Thank you. Take us home, babe, I, think you're right, hi, everybody Miriama wrote her first resolution the walking while Trans and it's fabulous so I hope you all got a chance to read it. Mariama, what do you want to say? I, just hope that everybody has read the resolution and will support us, and it's about marginalized communities that you know should have a very different lived experience than most of the rest of us, and so that's how this thing was allowed to go on for so long without anybody taking up the issue, but the hope is that, finally, the speaker of the New York state legislature will do just that awesome on the screen. Diana, please put the resolution up on the screen. I think this is our last. If I remember correctly, yes, I believe it is yep. Do you want me to give a report before we vote? Yes, give the report and then we're gonna? Do a roll call vote really quickly? Worst street Bruce is due to be completed. As of the last meeting last week is July 2021 I know, there's a project, that's slated to start on Nassau Street Rosa. This is of a lot of interest to Rosa, because it's on the corner of her building, it's from pine to Maid Lane right now, it's in design phase. It will last 24 months and it won't start until the third quarter of 2021 Bulgaria's park is due to be finished. They're waiting for Con Edison to hook up the electricity, there's a clock there and there's some lights on the first week in December. They plan to plant the tree, so that is then we got we had about all of the proposed legislation from Senator Cavanaugh and from assembly member new about you know stopping evictions and and mortgage defaults, but there's a lot of legislation we have. The committee has a lot of reading to do also. We were told that by the time it actually goes to committee and they vote on it. They'll probably be changes, but we're going to so next month. Everyone in our December meeting those of you who have never written resolutions and would like to learn how to write resolves here between Betty K and Mariama and Lucian. We are going to have a lesson in writing Reso. So please join us. Please join them! Please join us, so you can write your own resolves. What's all right! Well, just get better at writing them. If you're right resolutions Joe that's what they're talking about writing a resolution- Right Congressman Adler, it has some proposed legislation. The Ama has recognized racism and medical and how medicine is handled and dealt with as a health threat. So we will continue that discussion and that's pretty much the report. So please put up that resolution that we're going to vote on Bruce. The resolution is about to come up. Diana's working on it. You're welcome, keep in mind folks. This will be a roll call resolution. It is our last and as I know, people are going to want to jump immediately afterwards. You'll need a motion to close the meeting and so before that I will wish everybody a safe and healthy and happy Thanksgiving. My best to you and all of your family members don't go visit, but if anybody needs a friend to talk to, if anybody is one you know just text or call all right, so walking, Wall, Trans, Ban legislation, questions on this right, I have not seen a hand go up yet I just want to say I support it. Thank you well done call the question. That would be even better I'll. Second, your calling the question awesome. So this is the roll call. Miss Brittany, take us home awesome. So again, if you guys could just say your last name and then your vote, that would be very helpful. Ameruso no blank. Yes, Kennedy Brown Kennedy, yes, Cameron! Yes, what's the hell? Yes, Chang? Yes, yes, Airman Flynn, yes, Frank Franker! Yes, this is great Friedman great! Thank you! James! Yes, Joy Joyce! Yes, thank you! Miriama, hey, yes, Kennel Canal, Df foreign Nicu can I vote yeah go ahead. Susan. Are you old enough? Is everybody voting? Yes, I lost the whole thing. I was blank. Yes, I'll vote, yes, okay, great Thanksgiving, Nicu, I! Don't know why Meltzer! Yes, thank you! Mahalski! Yes, Jovi Mon, Jovi, more, yes, Weinstock jumped off who's ever talking. Let's meet sorry Joe Sorry Laura keep going Brittany. Is she how she? Yes? Okay? Yes, great thanks, Zelter Selter! Yes, okay, awesome! Do we have wine stock? Do we have Mcu Lammery Clementos, Capel, Friedman? Okay, that's it thank you and yes, oh, that was Friedman who's that Friedman okay! Thank you very much. Pat and Mariama. Anything else, that's it happy Turkey, Day, everybody, happy Turkey, Day motion do I. Have a motion to adjourn. Yes, I got a motion for my favorite unpaid public servant. Thank you very much for everything that you do. Thank you for being active and thank you for being a part of the volunteerism that we do to make the city great, have a go. I want to get back. I have to give a big shout out to Diana for putting together those slides for me that I didn't get to take you all through. Thank you, Diana you're welcome fern. Thank you! Happy kids, good night Thanksgiving, everybody happy Thanksgiving, everybody bye, take care. Everybody hi thanks. Everyone.",
            "summary": "Carolyn Mahoney is taking minutes now, as our secretary or Vice Chair, Alice Blank, and some of our other elected officers like Brittany Wade, who's going to help take votes and roll call.\nSo, At the start of the pandemic, controller, Springer launched an investigation into the city's preparedness for and response to, Coba 19, with the goal of hopefully learning about what we did and did not do in those early days and weeks, and to keep in mind that we can have better policy outcomes when now, when the second wave comes.\nWe can respond better as a city, Mr Stringer also wrote an op-ed this week on a topic which I know is close to this board, which is on the about greater transparency and accountability for police misconduct.\nWould, you like us to post your report in the chat for people to click on the link, I think we'll go that way, and so we'll move on to Lizzie Lee, which is our representative from Senator Kavanaugh's office.\nYou know we're continuing to work very closely with quality of life committee and the small business working group.\nLizzy, very much happy thanksgiving if the governor, if the senator does come later in the meeting, just please text lotion and let him know.\nSo, just quick, things, February, 1st 2021 seems like a long time away, But that's when the community board applications or reapplications are due number two.\nI, know we're all working on governor's island, we're all working on South, Street, Seaport.\nSo first, The congressman has been working on getting two-way split tolling from the with the Verrazano bridge for about 20 years now, and so we're really happy to announce that it's going to start December 1st.\nThe proposed project by DOT is that okay, yes or I am happy to have you speak when we review it in executive, session.\nWe want to make sure you all know that council, member Chin has been a strong supporter of the school expansion.\nWe always want to have the community get the chance to express their concerns and their opinions about any proposed changes to the neighborhood, but with this special project, it's unfortunate that they didn't get enough time to express their concerns.\nI will continue to work with CB1 to make sure all these questions got answered and the issues got addressed and I expect to hear from everybody in the next six months about this at least six months.\nIt's been closed since we opened there in 2013, but, as many of you might know, the Murray Bertram campus is both windowless and doesn't have immediate, accessible outdoor space for our students, So particularly right now, during Covid-19.\nSo just in general, like opening that space up would really allow us to have some substantial access for outdoor learning in the foreseeable future and just for programming for our students going forward.\nI am a long time resident of New, York City and a member of the local group.\nTheir report just issued to the governor, concluded that safety insurances for 5 g have cloak come into question because of the thousands of peer-reviewed studies documenting deleterious health effects associated with cell phone radiation.\nI wanted to thank the trust for governors Island for updating their website and making a lot more transparent, as well as user friendly in regards to the real estate and the south, through zoning and the rfps.\nNext, yes, I can oh thank you, Hi, folks, I'm, Roger, Manning, a long time down downtown Manhattan resident and a frequent visitor to governor's island since 2005.\nTwo quick questions is where to find the actual uniform land use review procedure publication for governors, Island.\nI mean the actual wording of it, and the other question is roughly how many people have managed to send in comments regarding governor's island to the community board more stuff.\nWe will still be accepting public comment through December and all the board members will be able to review that as well before we vote in December, sorry for the public comment, and that has a link to some of the materials for governors.\nI said that appropriately I apologize, if I butchered that okay also on the topic of governor's island I, might be at the end of her availability for time.\nLet's just stick with that class one homes have caps on the amount of annual increases that the tax can be every year, You know, look at their whole old age if they want to and actually have something that they can know and understand what the costs are going to be from the day they bought it until the day they sell, it, 50 60, 70 years later, or whatever they decide to do differences class two homes in Manhattan.\nSo, If I'm out of time go and look at my written statement, but the point of it is that this is a something that all people in Manhattan need to come together.\nIt was a great system that worked to keep our parents in their homes and keep the roofs over their heads for a long time that same benefit and that same consistency of payment and understanding what your costs are going to be as you age and as you grow needs to be in place for condo and co-ops in Manhattan, and it needs to remain the same for class 1, homes.\nI can thank you, hi my name's Dylan, I'm, a former resident of 13 Harrison Street, and it's recently come to my attention that there's a proposal to construct an extension onto the roof at this address in Tribeca and I feel that the proposed project is a pretty major threat to the long-standing architectural history and culture in general of the neighborhood, The extension which has been proven by the mock-up.\nI know that the rooftop communities and villages that are there and still exist today are really integral to New. And I have countless memories personally of growing up on my own rooftop and learning to garden from family on one side and also forging a pretty strong relationship with our neighbors on the other side and their two sons, Spencer and Thomas, who we're still in contact with.\nAnd I think these buildings are lasting, standing to remind us of New, York, City's history, and these plans disregard that history and culture and threaten the communities founded in the small scale.\nThank you for coming, and thank you for speaking up and with that we're going to go to Jamie Sikorski, who is representing 99 and 101 Warren Street for those who are not at our executive committee.\nLast night and then after Jamie were going to carry Davidson thanks, Tammy, I'm, joining on behalf and, as Tammy mentioned in blue of all of the residents of Warren Street and the other community members that have expressed their severe concern surrounding the Amazon cargo.\nI just want to thank Tammy and the rest of the exec committee for their time last night and as Susan mentioned at the top of the call, certainly everyone's patience while they heard from quite a few concerned.\nSo take us home, okay, well, I'll, piggyback on what Jamie was saying, because we have a similar issue with regard to the CitiBike infill and expansion plan and again it's lack of transparency, lack of regard for the Community Board, Transportation, Committee and lack of regard for the community that we all love.\nLooks like Cora, has had to go, but I will continue to reach out to them, and I will continue to rely on this group to represent the community in the process of prioritizing how we are using open space in community board, One. That means how we are using curb space.\nSo I appreciate the time and and on Carrie Stick on don't go anywhere so fast because believe me, you may think the conversation started, maybe in September, but I, think they've been happening way longer than that, and this is not the first time, for example, that Madeleine came from Dwayne Park Patisserie to talk to us about any inequity in sighting of things in equity and approval.\nAnd I really want to thank the staff of the Community Board one office for really supporting us and me and Ej, and the family for allowing us to do this, and also especially Tammy for blocking off and running interference on lots of other things that keep them from landing on my plate.\nIt's going to be a longer process, but I'll keep trying to push on that also want to report that Dick Bach, who is a housing excerpt expert I, had a conversation with him today and he'll be joining the quality of life committee meeting in December for an open discussion about affordable housing, preservation.\nBasically, building off of Tom Goodkind's legacy his work in collecting data and then seeing what best we have to do to take moving forward and trying to get the city and other groups to enforce what affordability is left.\nWell, you've heard we have a vote coming up an executive, so I'm going to go over things there with the next patterns and the next steps.\nAny physical things, The city does not believe that includes working forward on design, plans.\nWe have an applicant that will come before us for landmarks for land use issues for SLA, We have applicants that don't come and don't have any community input and yet to do things like cargo bike, areas.\nThere's, no two-way street I find it rather strange from a mayor who talked about governing from community base up, So we're gonna executive committee for the next couple months with the district manager are going to take on looking on alignment of engagement for the agencies and this kind of goes cross and every single committee, which is why we're going to take an executive.\nThat's one of the things looking ahead and you can tell we participate in budget the capital program, the district needs which includes ulurp and scoping and seeker, review, etc.\nThis I, think the language might be in the city charter for this, where regards to community boards, but it's somewhere, and it's states that the city, agencies or others agencies can not be arbitrary and capricious and ignoring our resolutions, even though it's only advisory, but it's advised but can not be dismissed outright or the language.\nTake that as a no all right, let's rock and roll, So the next one we're going to in executive committee is the cargo bikes.\nWe got a letter from commissioner Pinkar, which we shared last night, that I received on the 23rd of this month, saying they're, going to move forward with the cargo bike.\nThis is about engagement, and we wanted them to bring the applicant to answer questions before installation, because I think it's totally fair.\nThey believed that the loading dock would have been a better place for them to use and why they couldn't is not something that you know was answered to the satisfaction of the community by DOT or even answered at all by the applicant.\nThis is why we're voting on this today we will post on the website and in the newsletter, because what we're going to have to do is actual observations for those people who live around or anybody who travels through this has now become, unfortunately, in the purview of and the responsibility of the public to take photos and email them to DOT and CB1.\nWe can track all and any issues that exist, which include loading on the sidewalks, any delivery trucks, because they're they, if DOT claimed in the letter that there would be no more deliveries either in going or outgoing on the Murray on the Warren Street side of the building.\nWords today makes me frustrated when people could run a con on me, like they're, Doing me a favor with some money and of my peers and my friends and my family members who pay the bulk of taxes in the city by the way who are paying for it.\nOkay, So let's pass the cargo bike, one as it is, because we've already done our roll call to help Brittany out here and to make our meetings more efficient.\nWe asked them to come back at executive with a bulk of data because, as was asked to transportation, We wanted to understand what the saturation and usage was and what the master plan for Community Board won, which is something we've asked for several times.\nWhat, we don't want, is the same situation we've been with in the past when it comes to CitiBike, where we have a restaurant tour who has reached out to the community board for help.\nI, whether it's a separate resolution, whether it's this resolution is made stronger, it's time to contact all of our officials and said that we can no longer stand dot's manner of operation, So that is going to come up on when we do public engagement in executive committee per Agency, because what we want to do is have it aligned.\nSo I would like to know specifically where Betty do you remember: Dr k, sorry, I, don't mute; no, they just give the intersection, but again people have to realize they're putting them where cars currently park, they're in a parking lane.\nTrucks were at the end of spruce on the corner of gold right, but I think where these bikes look I, don't care either way to be honest, but it's also important people know that there's bikes at the other end of spruce as well.\nWe can certainly ask and find out, but I just want sure everyone knows what I'm talking about.\nOkay, they're, not gonna block any of that, because they know that I mean reasonableness has to apply.\nMany of the people who spoke in favor of the resolution don't feel that way, but it kind of comes through that way that this is a nuisance that you know, we've got to make sure.\nSo, when I'm walking, I hate the cars and bikes when I'm biking, I hate the cars and the pedestrians, and when I'm driving I hit the pedestrians and bikes, that's say, and it is indeed very difficult to cram in all of those different methods of transportation and any kind of sensible, safe or aesthetically pleasing way in the city, but I think I'm going to abstain on this motion.\nYou have a huge chunk of the street taken up by CitiBikes, like I, said I bike everywhere, but I have my own bike and there's a school now right below at 90 John and the amount of congestion and traffic when school buses come and block the entire road and then honking begins.\nOkay, Betty Sorry, to interrupt you, Keep going I just wanted to say.\nThat gets it to be less pejorative about the sighting, more factual, I'm happy to take them, think it through, and then let me know, but not rewriting the whole thing, because there are concerns that need to be addressed.\nS, Let's I like the way you're moving things on Tammy, let's vote or not or vote up or down, and we spoke a lot about it at committees.\nWe have these conversations, I think it would be really helpful to have a map of our community board area and where the bikes are and then a sense of how many more bikes.\nThey think we need and a kind of like really analytical presentation of the issue so that we could work with them and kind of like I.\nYes, hopefully on the hospital block, where it's sited, which makes sense because CitiBike is giving the memberships to the people that work there.\nResidents reported as well as the one about suggesting that you put bike lanes wherever you have CitiBike docks, because although I certainly like bike, lanes, I do drive a car and ride in a taxi from time to time, and I'm, not sure that I want every single street to have a bike lane that happens to have a CitiBike dock on it.\nI think it's supporting the business to have a CitiBike thing, nearby, not in front that prevents them from being able to have sidewalk seating, which is a throwback to what has been happening on Duane Street right, because if they can't open their restaurant because they can't go onto the sidewalk, they can't have any business.\nWe all know that the people who come to meetings are the ones who object to something, not the ones who favor something, and there may be just as many residents who favor it and for the very reason that it's conveniently located.\nI'm, okay with prefer, because we have you know instead of objected to, we prefer, if you say certain residents, subjected or something like that.\nAsk that's part of the discussion we're going to have, but if we're talking about what some residents prefer or don't prefer, then I think it might help to quantify the just the group if it takes two sentences.\nAll right, why don't I suggest we just vote on the resolution, but also I wanted to remind everybody that Joe made a motion.\nAs noted after the presentation, It was widely discussed and determined that a new resolution was not coming through executive that they would make a friendly amendment to the one that comes to landmarks and with that done, and thank you so much.\nWe essentially want to be able to leverage the giant the gigantic buying power of New York City to try and lower the percentage of on hand.\nHowever, We please, you know to city state federal whatever the case is going to be, but this one was a FEMA program as part of the individuals and families.\nWhat I did find was a report on all of the FEMA programs at the time by the Gao, the government, accountability, office, and so, If we want to really like get into the weeds, we can find it.\nOkay, So let's call the question seconded fantastic, I, think everybody's with us who was with us before all in favor.\nThey assured us and what we put in the resolution is that it's only temporary at this moment in time and they have to come back to us if they want to extend it.\nPeople know that used to be one of the greatest lobbies in the city in New, York.\nWe had a hell of a time chilling with it and discussing it over more than one meeting at the Landmarks Committee, and we do fear just like the pilot program of the ot on.\nThis is kind of a little bit of a nuance that we got to look out for because once this you know the virus is over they'd, be able to expand the expansion space, be able to have the reality of the true public, assembly.\nI, think it says in the resolution, through this period of time, through this temporary in response to the state's executive orders and has agreed to come back to the committee if they wish to add more seating after the Al alteration is lifted.\nWe can't speak when it goes before the SLA, but everybody is very concerned about this and we sent the negative resolution that we voted on in February and additional documentation and we're trying to be on top of it, Susan and I will say.\nFirst, so, first of all, or last of all number five, the state of 421a and 421 g affordability in battery Park City Lucian gave a great discussion and summary of both programs for the committee and afterwards there were questions about what buildings are still subject to or have has 421a or 421 g available to them.\nWhat's going on with the time of Covid-19 with the seniors, things are okay.\nOne thing I want to note: Is we at the Valley Park City Committee are trying to create a more robust dialogue between Allied Universal and the community.\nMember meeting was the first step and it's evolved into more of it, but we're looking to have allied, explain and provide a clear picture of what the ambassadors can and can not provide in battery park city and what the community's expectations are and with the discussions, how to bring them more in line with each other, because there's frustration on both sides and I'm hearing a lot of it.\nYou can't go in and out of it, but it's the commentary on kind of inclusion and race and all sorts of stuff like that and the authorities addressing it in a quiet, way, I, think I, said: everything, Any, questions, I, don't see any hands.\nI should note that these are items that the community board has supported through its budget process in recent years and we're just making a push for them now, because again, we're fairly desperate along the east side to create spaces, additional recreation, spaces, additional open spaces, and we think we have some good opportunities.\nThe long and short of it is that you have a resolution before you, basically urging DOT NYPD and the city to work with us to create spaces that we think could work for.\nWe do plan to try to have a follow-up meeting with D.O.T over the next week or two a smaller one, since they didn't want to come to the committee.\nDetails of this resolution were not known at the meeting at the time of the vote.\nIn fact, This resolution doesn't even acknowledge that one exists in 2020 when it's already gone to the DOT, with our recommendations were some of these same very areas, so I actually would wish that you would withdraw this whole thing and wait a month as I asked before and work out, so that it works with the other resolution that was already passed by CB1 before promoting another conflicting resolution, which will only look worse in front of the D.O.T. Oh you're still talking about it, because in general, I don't disagree with many of the things that want to be done, especially the skate park.\nI will say yes, but next time do me a favor, don't you know just I'm trying to keep you.\nGot where I'm going, And I did review it and to see specifically if there were any conflicts or areas of overlap, and so the three points in the Manhattan side that they were touching with their proposal were number one.\nWhen we discussed this resolution, it kind of looked like.\nWe were going to have a vote and Joe Lerner interrupted and said: asked.\nAnd, we passed I know a resolution in full support of reactivating this area.\nJust wanted to point out that you know we're talking about tens of thousands of square feet of what was park and was then stolen away by who not sure, but.\nWe really want to try to encourage people and groups and people from our district who are interested in helping a park near them to come.\nOkay, so I think we've gone through all the questions that we've got.\nYes, sir, The no vote means you're, not supporting, therefore, be it resolved, urging the LPC to ask the project to reduce its mass and height.\nA no vote means you that you do not agree with the application pretty much in anything because we're saying yes with the pro.\nWouldn't either you would vote yes, but that doesn't make sense because you're saying yes, if you reduce the height, that's why I abstain, because I think it's okay, the way it is well, Then you abstain.\nThink, because Bruce's amendment is more than just a friendly amendment and does substantively change based on subsequent information, the vote of the committee with an operative piece that wasn't a part of the resolutions they voted on.\nSo, Moving on to the zoning for coastal flood resiliency, it's definitely something people should are going to want to read through if you're interested, Allison, Brown and Genu from DCP came and presented.\nSo here you know, for there are some floor area exemptions, and this is something that again on governor's island is going to be somewhat important.\nFor that 10 feet that you're now going to flood proof can be then lifted on top of the building, making it simple and so, which I think was pointed out during the meeting.\nIf you have a specific question about any of this, we're going to go over this in much more detail in our next meeting, which should be December 7th, where we're going to take some time to look this over more carefully together as a committee and then again at the executive committee, So you'll have your shot at trying to understand this more.\nI just want to make sure that when we, you know, actually write a resolution about this, and this some of this came up during the meeting.\nYou know it's fine to have a standalone zoning resolution text change, but it really has to come hand in hand with some, maybe in the sake of like landmarks staff, level, changes to the laws because, as a building, for example, in the Seaport, you know.\nYou know, builders that can just do whatever the hell they want, because money is cheap or whatever, but more like the small condominiums and co-ops that line these neighborhoods on the shores of lower Manhattan, Tribeca, Seaport.\nSmall projects like this I mean imagine, adding a story to a five-story building in a co-op of four people that you know don't make 20 million dollars a year.\nIt's really going to help people that, just you know, money.\nYou know, within the community board, to talk about the implications of this for the smaller buildings in the Seaport happy to have whatever discussions.\nYou know: land, use, landmarks, zoning things that we've had in front of us in a while and change all the parameters by the zoning text.\nI. Think I won't go over everything because it's late, but they talk about working with certain companies that you know, do self self-contained composting bins which were interesting that they wanted to place in bowling green park.\nLast year, like a shred-a-thon and textile recycling and they've partnered with other companies to have more tech, access, the one thing that they didn't answer that we're going to ask them to come back, and they will I'm sure, sooner than later, just really to talk about resiliency in terms of actual property owners and what they were doing in lower Manhattan.\nI know that we still have land use, which includes governors, island.\nRemember back in December of last year, CB1 passed a resolution in conjunction with the youth and Education Committee about Trinity School, which is here in the blue area, and they wanted the extended sidewalk space for gathering of children and families before class, which is the area marked in Brown.\nThis is extremely I'll, say it disrespectful for the people who live in this Little Greenwich, South area and I, Don't know if bill wants to chime in, but I think.\nAnd I wanted to let people know who aren't listening.\nJust you know, again, like I hope that what I saw continues because it would be very little.\nI mean I'm talking two cars in 50 minutes and the only thing I saw on that street was the parked scooter.\nYou know I, think you're, all aware of that, and it's and the use is basically to extend it on the the South island as well.\nThat was a big focus of, and you know of questions and discussions at the meeting, keep in mind for everybody on the call sorry to interrupt you fern everything that happens in the Z zoning for coastal Resilience text.\nWe can take I, don't know good question, And, I, think you're talking to a vice chair and chair who would agree with you on that Colin Sorry admitted just super quickly.\nSo please put up that resolution that we're going to vote on Bruce.\nAnd, as I know, people are going to want to jump immediately.\nMy best to you and all of your family members don't go visit, but if anybody needs a friend to talk to, if anybody is one you know just text or call all right, so walking."
        }
    }
}