{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCWOA1ZGywLbqmigxE4Qlvuw",
            "title": "Top chat replay",
            "publishDate": "2020-10-08",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "cyk7ryiQe_4",
            "fillerWordCount": {
                "uh": 448,
                "um": 365
            },
            "readTimeFullTranscript": "105 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "cars": 38,
                "cameras": 35,
                "vehicle": 34,
                "enforcement": 33,
                "speed": 32,
                "fire": 31,
                "precinct": 29,
                "car": 28,
                "fireworks": 27,
                "education": 26
            },
            "wordCountSummary": {
                "education": 11,
                "enforcement": 10,
                "fire": 10,
                "fireworks": 9,
                "safety": 7,
                "crime": 7,
                "police": 6,
                "areas": 6,
                "building": 6,
                "cameras": 6
            },
            "fullTranscript": "You could give us an update on this information. If not, I can download it and to get out yeah. I signed an article. I could not figure out how to get back to it to see if the most current statistics are consistent. Okay, I ca not believe we got stuck with Webex again I hate it. I know it's horrible, they give it to me every month. I guess land use. We should rotate. I Wayne Heaven last month. Okay, what do you guys prefer zoom to Webex yeah? I do. Why? Is it even an option then to do Webex? I think we only have one zoom account. Oh I get it. I got it through two meetings going on luck of the draw. I hear you so you were looking in the 34th pardon my snacking. Oh all, right! I'm looking at the report now this is from what you sent us from the 20th. So it looks like the bicycle. Injuries are up: 200 percent wow I mean that's like two extra from last year there were like three reported events. One last year, in three years we had a fatality, not terribly long ago over at 155Th and Riverside drive west, where they as a youngster, got hit by a taxi, and the taxi Cab was not at fault, apparently from what I heard the kid accidentally darted into the intersection on his bike. So that report does not show fatalities. It just shows the in the incidents, but there's another link right here. You click there and you'll see the fatalities Manhattan north yeah, so one yeah I have one listed. You see that right there Alan. Why am I live? Excuse me who's in the office. It's not meeting has not started yet yeah, but hi Curtis Chanel, but we were told to start the live earlier, because I believe, like conversations that happen before the meeting time like are still considered like part of it, so we're supposed to go, live and record when you actually start the meeting. Okay, I was sharing my screen. Thank you. I was not sharing anything personal, but good thing. I did not say I did not curse out Sally or Alan. Now, hmm Curtis. Should I open my living room window, it might provide for some interesting sound effects. Oh let's not do that. Hi Mariella is mariello or Mariella. It's actually Mariella. But okay, I'm going to work on that. That's my goal for the year, all right, hi, nancy, okay, oh and you are Chanel. This is on facebook. Already it's on youtube, so this cisco does not integrate with Facebook. I mean it can, but it's just the way that we do it on Facebook. It's not possible to do it here. Got it got it got it all right, hey danielle! Are you feeling? Third danielle? Are you still down for the count or you're mute? Sorry, what'd, you say: are you feeling better? Oh yeah! Thank you all right. Let's just do a quick check of our, so I see Danielle Mariella Barbara Sally Graham. Are there any committee members on the line? I see several phone calls. If you are a committee member of Public safety, please announce yourself. So I know that you are here. Okay, we'll give it a few more minutes. Also you are from the precincts. Please identify yourself if you're calling in I do not see anyone's name, but I see several phone calls. So if you are on the line from the precinct or the district attorney's office or any other elected officials office, please let me know that you're here you're here, I see Natalie Espino from Manhattan borough president's office, hi Curtis and my counselor. Okay, I'm sorry one second who's from Fdmy Fabricio Carl, director of community affairs. Okay, could you type your name in the Chat box? Just for the record, I unfortunately ca, not I'm actually calling in through phone okay. Could you spell your last name: c- a-, r-, o okay, and we have someone from the 33rd precinct: hi curtis, it's captain Chung C- H-, U-, N- g from the 3- 3 in the Exo. Thank you very much. Captain chong for joining us. Do we have someone from the 3- 4 joining us, anyone from the 34th precinct on the line? No one, all right! It's the district attorney's representative here, yes, Ali E-, L- Y, is in the chat. Okay, all righty and I see superintendent Miller- are you here, Mr Miller, from correctional facility? I thought I saw him somewhere all right. Let's give it a few more minutes to see someone from the 34th precinct joins we'll go ahead and get started after that curtis. I have a question. Yes, I have an answer. This is regarding the budget items you just chug my memory, I ca, not recall, I'm sorry, the so all of these items are today's modified items. Are these the same items as look updated, but maybe I'm mistaken they are not updated. These are the same issue. These are the same items as last year, so our goal is to modify the list. If you want to keep them on the list or make edits to them, there were some text. I added you will notice that there's blue. So I added that to the three function line item because we we've learned over the past few months that 311 is. It does not have a spanish language option. I thought after I reread it and hit the complaints for the past six months. I added that as a as a part of the upgrade to 311, which I think is much needed. Everything else is the same as last year. I did vote a few items that we can. We can discuss to see if they should stay on the list or if there are other items that we need to add. Okay, I guess I just did not understand why we'd be ranking them before discussing them and modifying well we're going to do all that tonight. I sent them to you all to read and to provide any feedback last month. So today we have to rank them, but we can discuss them and rank them and modify them and then come up with the rankings for the committee. The community columnist is blank, so I wanted individuals to kind of look at it in advance, review it and have their individual rankings and discuss how to prioritize the rankings for our community. Does that make sense yeah? So we have what we submit to Eliezer she's. Probably ebenezer is our committee ranking, and that is, and that's still yeah. I guess they just wanted to make sure these and or delete items yep most. Certainly let me do one quick check- in for the it's captain. I'm sorry, 3- 4 just told me that they're having difficulty they were on, but you ca not hear them. Is there any way to unmute them curtis? Can you hear me? Yes, I hear you, okay, it's captain palmer from the 3- 4. How are you very well? Thank you for joining us all right. So I think we have all of our representatives we're going to go ahead and get started. I'm sorry was that someone saying is that someone else from the 3- 4 curtis? No, it's just captain palmer, I'm here with my we're good, okay, great, perfect! Well, thank you all for joining the public Safety committee meeting. For the month of October. It is 7 10.. We are going to go ahead and start off our meeting. We are joined today by our committee members, I'll just read your name since that's here our assistant, Chair Jenkins, Mariana, Cruz who's, our community member. We have Graham cerallo as a community member, we're also joined by Sally Fisher and Margaret General Board members for our priest. We we're also joined by a representative from the 33rd Precinct Captain Chong Representative Tara from the fdfi Natalie Espino from the borough president's office and captain paulo right from the 34th precinct, and we have la Sylvester from the district attorney's office. If there are any others joining us. Please announce yourself at this moment all right hearing, none our first item on the agenda, I'm just going to put that up for one second, give me a minute. I do not know how to use this system very well, all right, so you all can see the agenda. Are there any adjustments to the agenda that needs to be made by our committee members additions? So I did receive a request from Fdny the community affairs representatives. They should go first because there's a conflict, this move fdny above NYPD. If you do not mind you all go first, all the time. So hopefully you are do not mind, sharing the number one spot so without further ado, we're going to get started with our report from the fire department. So thank you very much. This is Fabricio Carl, I'm director of community affairs for citywide and apologies. We were having some issues with our system today in terms of pulling data, I was trying to get data for local fires and emergency medical runs for the month of September going into October, but unfortunately I was not able to pull it. I can pull it by tomorrow and I will definitely share that with the committee and again thank you for inviting us one thing to note: we did receive this agenda a little bit late. You know. The frequency of our presence in this meeting I know is not as as frequent, I would say from month to month, but moving forward. I can ensure that we'll either have somebody from my office or from the 1- 3 battalion, which does cover the Washington Heights Inwood community, which community board 12 does cover in terms of a report. I know there were questions on the agenda regarding fireworks campaigns and fireworks mitigation throughout the summer. You know again citywide it was a dilemma and it was an issue as the mayor's office did announce. The fdny did partner with local law enforcement NYPD and the sheriff's office to tackle the distribution of illegal fireworks, and, in addition, we worked with several affinity groups within the fire department to develop a fire safety education campaign and working within hot spot areas based off three one: data where communities that received the most 3- 1- 1 complaints were targeted for focused tabling and fire safety education information. With weeks leading up to the fourth of July, we did work on disseminating information and we did work again with other emergency and first response agencies to tackle the distribution efforts, as mentioned in the task force that was put forth by city Hall. Again, the issue was rampant this year. I think it was it was. It was augmented just because of the issue that we faced with Covid-19 and a lot of the issues with distribution and a lot of events where distributors were going to be providing fireworks. Being cancelled throughout the years, I think that it, you know, added to the fact that there was an increase of illegal firework activity throughout the city. You know in comparison to other years, but again you know we did work with our local law enforcement in terms of just mitigating and trying to mitigate as much as possible. You know in the future in following years or in future years to come. You know I have spoken with other community boards that were impacted, and I think one aspect that the fdny wants to do is work with civic and community- based organizations to do education and outreach well in advance of the fourth of July, maybe even targeting June and may because beyond just the prevention issue of targeting the distribution, I think it's an education and alerting community residents of how to report illegal fireworks to the fire marshal task hotline that we have and, in addition, fire for safety presentations in local neighborhoods to basically educate the community residents overall on the dangers of fireworks. Again, we are more than happy of partnering within the years to come, with the community board to basically spread that message in advance and work to basically to mitigate that issue in advance of the fourth of July season. But again I think it was. It was a different. It was a different time this summer, especially with the issues that we faced with Kobe 19.. Yes, thank you very much for your for that update. I did attend the 34th Precinct last council meeting this past month and they did speak about the task force. It was very vague, like the formation of the task force who's on the task force and it seemed to have been a transition of enforcement in the middle or the height of Kovitz, and I think that made it a bit extremely challenging for people to enforce. Would you do you think that so the task force is like 10 offers 10 people from the precinct? How does the task force function exactly and who's like the head person in charge of this firework task force? I again, I think I think I would I'd have to check with our Bureau of Fire investigation. I mean from my understanding it is our bureau of fire investigation in terms of fire marshals working with the sheriff's office and NYPD. Essentially, I think when it comes to the issue of enforcement, I would say at that point: NYPD would be taking the lead and with our assistance in terms of really you know our fire marshals enforcing where they can within fire code and fire Code regulation. So again I would say NYPD at this point was with the major lead, along with the sheriff's office. On that note: okay, all right! Well, the health and Health and Human Services committee are proposing a some sort of joint resolution to come up with the plan in advance of next year, and I spoke with Steve Simon who's, the chairperson of that committee earlier today, and he asked me to take some feedback. So I would definitely share that feedback on engaging with civic education as well as Cbo's for sort of public education projects prior to the fourth of July week, and I think that's a great. That's a step in the right direction. Obviously it remains a huge issue. I'm still hearing fireworks in my neighborhood heard some last night and I think it's completely out of control. I think one of the big issues that we have to figure out is: how do you disrupt the pipeline interrupt the pipeline because it seems like people are buying illegal fireworks from somewhere and they ca not buy them from New, York state, so they're? How do we? How do we? You know collaborate with the other states in our nearby states to come up with some sort of comprehensive plan to mitigate the distribution or interrupt pipeline? Do you have any thoughts on ways we can yeah? Well, I think that was done this year again, it's a tough from year to year again, when dealing with out- of- state distribution into the city. And again I do not think I want to speak on behalf of the NYPD. Maybe the NYPD could elaborate, but a little bit more. But again I you know. I do not want to discredit the fact of what the agencies did in terms of tackling distributors and really focusing on the on illegal distribution. This summer, I think the issue, and we have to continue working collaboratively, is basically the issue of reporting and again sometimes reporting. It is a little tough because I know community residents we do give out the fire marshal the fight, the illegal firework hotline right and there are tips and, as you just elaborated, sometimes community residents do report and then, when people do respond, the issue of fireworks that may be gone because then the perpetrators may not be there upon arrival at scene or it or maybe an issue where fireworks are not in display. Then at that point you know yeah and I think the problem. The problem has to have to deal like how you said was with the distribution, and I think that's a long- standing problem that all agencies when it comes to law enforcement are really tackling and they've been and, in my opinion, they've been doing somewhat of a more of a more focused approach, especially with what we experienced this year. I mean again how to resolve that, I think, is just educating residents on how to report out on the dangers of fireworks and basically how to work with local law enforcement to really address reoccurring issues with within neighborhoods. You know yep great, okay, great, thank you so much. I know you have to run so I'm going to take a few call. Excuse me I'll, throw a few hands. I see. Sally has her hand up. Are there any others? Please raise your hand or okay Sally, any other committee members, Nancy yeah. I guess my question is I understand that the mayor wanted to disrupt the distribution into the city, but that was not what the issue was. The issue was the point of explosion and they went on for months and months, and I you know I'm a great believer in education, but I do not think education is the solution to this problem. People know what the dangers are, the people who are setting them off, but it's just it's something that's been going on for years and it exploded this year and exploded every single day. I mean it's not just you know. It's looked at as a city as a quality of life issue, it's really a public health issue and we have to address it at the point. What I do not understand is why fireworks, which are illegal in the city ca not be seized at the point that they are spotted. The police would drive by acknowledge that they were being set off and do essentially nothing to stop the setting off of fireworks and it was hell and throughout northern Manhattan okay. So I want you to respond to that, but I would like Nancy to add her comment, her questions, so you can respond to both guys sure, thank you, and so in the beginning of your statement, you mentioned outreach starting in May, and you know by may. We were already equally involved with fireworks here in our neighborhood. So I think it's too late to think about that. I you know. I hope you would consider Outreach and some sort of action way before may. So that's what I wanted to add. Okay, thank you all right and we have one final. One final question for final question: Alan you're mute! So it's good to be able to be here, and I appreciate the report from the fire department. I was curious to see if we could get a report that summarizes the interdiction efforts and what successes were had are being had and dovetailing some of the other points just made in the earlier questions. I happen to work in a law enforcement community as a lawyer for a long time and the NYPD might answer this in connection with the fire department setting up checkpoints at toll areas from neighboring states that can be done in a legal on a legal basis random, but according to a plan where cars get checked and that might very well be deterrent. Okay, I'm curious to hear the answer to that. Thank you alrighty. Would you like to come into that? So in terms, I could not really hear the first part, because the first member who who was asking questions it was it got broken up a little, but in regards to education in terms of advanced, you know our fire Safety education unit that really provides year- round education on all levels of residential fire safety, and I guess dangers of certain of certain certain practices. When it comes especially around illegal fireworks, we can definitely work. I think I just put may just because, typically, when you look at fireworks and historically throughout the year, the months leading up to the fourth of July, usually around May and June, where you see the most firework activity around the city, I mean if we want to work a lot sooner. I am more than happy that my office would be more than happy of coordinating and working with the community Board to identify local partners of who would augment and strengthen that message. So I definitely do welcome that. In terms of the question of checkpoints and that's a question for our fire marshals and our Bureau of Fire investigation, I could definitely bring that back and see that that's something of consideration. Of course they would have to consult with NYPD. Ultimately, if that's something that would be considered, I think you know again, you know their approach and I would defer to them ultimately on what their approach is and how they tackle distribution and illegal distribution. But I know that that's been one of the focal points when dealing with fireworks is really targeting the distribution and the end, the entering of illegal fireworks into the city. Okay, thank you very much. I just want to acknowledge the Chat box before you head out, there's one final question from the community and I would love to get bernard to post his question, but I just want to share that. Sheryl Miller in the Chat box wrote that an apartment was burned out because of fireworks that were shot through their windows. That's a very serious issue. Obviously that happened and not just one time in our community. I believe there were several incidents where something caught on fire because of the fireworks so bernard. You have the floor you're. The last question is this: working? Okay, all right! My question is fourth of July. I had I had like a guy setting off fireworks right out in the middle of the street and also right next to my building, and I called 9- 1- 1 several times and no. There was no response at all without fireworks and besides that, the people that I observed setting up fireworks were grown adults, and I do not see. I would imagine that they understand what a firework is doing. You know I would imagine that they already know what it does and education. At that point you know I you know I maybe educate the community to call in and to you know, report it as soon as possible, maybe education for that. I ca not imagine education, anybody who sets off a roman candle and watches a goal and does not think that it could start a fire. I do not. I do not know what you could do for that person, who's, 30 or 40 years old. You know, I do not know, but anyway, that's my confidence. Okay got it alrighty. So, let's see here I think you know. The question was about at the point of explosion, Sally's question earlier that you were not able to hear why ca, not the fireworks, be responded to you at the point of explosion and that kind of attack that connects to Bernard's issue as well. Do you have any thoughts on what we can do about the point of explosion and tackling issue? At that point, I think it's overall coverage again. You know the issues of fireworks are overwhelmingly high and especially around the fourth of July, again having to deal with issues at the point of explosion to report out. I you know, I ca not imagine how many units, or how many calls are coming in at one time, especially in the neighborhood, where at point of explosion, there's a lot of reports going on that's tough to tackle at that point, you know, I think essentially, and it may be something to consider with operation- is how do we enforce right around those holiday seasons where you do see a spike in fourth of July, some level of presence or enforcement and again how that would look like and what we could do from an operational level, not only utilizing fire marshals or NYPD, but our local units as well. That's something that I would have to bring up with operations, but again at the point of explosion to report out. I think people are doing that. It's essentially how to report and respond. You know in due time right then, and there at the at the point of explosion. You know yeah, okay, thank you so much. This is a ongoing conversation topic and we're. We are going to be discussing this at the health and Human Services Committee, I'm Steve Simon and I talked like I said earlier about this issue, which is going to stay on both of our agendas as we work towards the early winter to hopefully have some sort of recommendation in the form of resolution for to share with the enforcement agency. So thank you very much for your report. We look forward yeah. One thing I would recommend I mean I and I did mention to Steve Simon, because we did report out last month as well. Okay, through his committee. Maybe something to consider is maybe a sit- down conversation to get a better understanding in terms of operations from our Bureau of Fire investigation and I think, having an open- ended conversation with both committees being that this is of interest, and we do welcome the support and looking at which ways we can potentially augment education or some level of operations other than just education. I think there would be some conversation and I would also welcome even maybe a joint task force or even or committee made up of both fdny and NYPD to basically look at it on the local level, because I again I do not want to speak for NYPD, because NYPD is on the call, but I think all emergency response and law enforcement agencies could essentially work together if there is an issue that the community wants to tackle a bit a bit more in a concentrated fashion. Okay, thank you very much, sir, and we're going to move on. We will be in touch and if you have any other items to share with us, particularly the summary of your any progress or positive things that happen over the summer there was a there was a comment about. I think just came from Allen about getting a summary of your efforts and what happened this summer, because you mentioned that in your report. So perhaps we can be in touch by email tomorrow with some other data points, so we're going to move on to the 33rd precinct. Captain Chong you're up next hi everyone good evening. I'm going to start with a crime breakdown, so robbery for the week today, we're actually even three for three last year, 28 day period, we're down 31 9 this year versus 13., so we're actually doing pretty well we've actually out of the 28 day period, we did have a really good arrest two days ago. It was a part of a pattern. We feel it was a three defendant going behind choking people and robbing them. So that was really great work done by patrol. I came over they fit. The description patrol did a great canvas arrested these people. It's part of our pattern. We feel the squads are working on it, so hopefully that will bring some numbers down next for the next 28 day period. So, although that is out of the 28 day period, it's a great arrest. Our burglaries were actually up a lot six compared to three for the week 23 versus five. So it's a 360 percent increase compared to last year's 28 day period. A lot of them were burglaries and commercial birds construction sites. Unfortunately, good thing is that we did close out one pattern. We arrested two defendant who was part of a pattern who was committing burglaries in the commercial, a doctor's office and so that closed out a couple of 61s. So that's not bad. We did take one place. It was hit four times four days in a row committed about the same perk, we're working on that there's one flyers from the squad and the NCOS are working on that glas were up 140 12 versus five last year, like I said the last time these dlas were giving these perpetrators opportunity to steal our cars of the 12 glas. We took this 28 day period. Five of them were because keys were left in the car and the car was running one of them. So I mean we it's easy enough for these people to steal cars. We should not be giving them the opportunity to do so. There's no reason. If you're running into the store this one complainant went into a coffee shop left his car running, another one was left unattended with the keys in it one of them. So this one was kind of particular because the car was running, but he had the key fob. So I did not even know that myself is that they could possibly drive off with the car, even though you think that you have the key fob. So you know we learn from other people's mistake, so just because you have, the key does not mean that they ca not drive away so of those 12 glas. Five of those were those instances where they leave the keys in there. We should not be giving these people opportunity to do so. I know you were talking about traffic, we're actually pretty good with pedestrian and traffic stat collisions were down. Injury collisions were down 76 versus 131 collisions last year. Injuries 18 versus 25 were down. 28 injuries were down 21 versus 38 compared to last year. So if a passenger gets into an accident, so the passenger getting hurt, there was 10 versus 31 last year, pedestrians, so how we count. That is that we do have an increase. It's a 400 percent increase, it's five versus one. So the way we calculate the pedestrian is someone's walking along the street and it gets hit struck by a vehicle. So that's what we consider pedestrians so out of those five two of them are pedestrians fault. Actually, so one of them pedestrians say she did not. Have she had the red light to cross the crosswalk. The vehicle was totally not at fault and second one was actually in the highway. There was a peddler and we feel bad. He was peddling. He walked in between the car and the car struck him. So again, it's not the vehicle's fault, and I know earlier before the conference call. You were talking about the pedestrian that was killed, the bicyclist. Actually, there was a fatality on 155 in Riverside drive it's out of the 28 day period. It happened in August 15th. I just want to make it clear that it was not the vehicle's fault. It was a tlc driving northbound on Riverside drive and a bicyclist. There was a young man on a bicycle and he ran the red light. We it's been determined that he ran the red light collaborated by the passenger in the rear of the vehicle and he struck the vehicle and he got ejected and subsequently succumbed to his injuries. So a lot of these injuries and stuff. So it's, I would say 50 of them are not the vehicle's fault. There has been an increase in enforcement of bicycles, running red lights, vehicle speeding, so we are doing our part in trying to minimize these for future instances. Okay, great. Thank you very much for your update. I do have I'm sharing my screen, I'm looking at the[, _, _], stats myself as well, and I must say I was out walking yesterday and I saw a vehicle in front of a bodega and I stood there for five minutes and it was completely on running the doors were unlocked and I it was unfathomable, but people are leaving their cars. I guess to run inside very quickly. I guess they're trying to shop and buy things quickly and maybe just run right out. I do not know, but it's insane to me. I would never leave my car running on the street. Yeah, you know what I think I think I understand parking is so difficult in here and around this area. So maybe they feel that leaving the car on notifies the traffic agent or the officers that oh, that we're nearby- and this is just temporarily- you know for a couple of minutes- which they should not do because again it's an easier opportunity for these perpetrators to steal your car. So why are we giving them an opportunity to do this, and why are we helping them with this? You know so, okay, so I have I'll open it up to questions from our committee, but I have one I'll start off. I have two questions. I also noticed on compstat that were shooting victims and a shooting incident. I guess that's within that's the current period 9 28 through 10 4., there was one shootings were up by one, I guess: shooting victims and shooting incidents. Could you share more about the shooting? You have any information, you know what I think it's we're it's pending the investigation and the squad is working on the case. Okay got it. Thank you very much. All right, I'm going to stop sharing my screen. Stop sharing alrighty cool. Are there any questions from our community members at this time? For the free I would curtis. May I speak? Yes, you may barbara one second, barber. Are there any additionals after Barbara? I want to get a good list right now, so we can keep it going all right, we'll just start with you all right. I noticed that burglaries are way up in the 33rd precinct. Is there any systematic connection with the crime prevention officer to follow up and secure apartments of people that have been burglarized so that the building itself and the places that have been burgled are really secured, because we do know that burglars tend to return to areas that they feel comfortable in? So that's my first question. My second question is: have you successfully prosecuted or has the met? D.A worked with you to successfully prosecute any of the quite prolific package thieves, so we're actually down on package depth this this 28 day period. So whatever we suggested to the super, you know not letting people in behind you. If you do not know them, if you expect the patch, like, I said, you know, maybe send it to a neighbor that is home and it really minimized this 28 day period. We do not have any package stuff actually for the 28 day period, which is odd, so whatever we're telling them is actually obviously working so prosecution. I think I would leave that up to the Da's office. I do not want to get involved with how that part. You know, and we do. Unfortunately, actually 12 of these burglaries are up because of commercial burglaries. So again, I'm saying these businesses, when you close up, leave the lights on. So it's easier to see. People inside make sure your windows are locked your doors or your back doors a lot. There is instance where the window is open or it's closed, but it's unlocked again. We just we need to kind of whatever we can do to kind of minimize the opportunity for these people. What I think people do not realize is we do tell them that crime prevention, we do have a crime prevention officer who does surveys for these people if they want, you just have to request it. It's a free service. The crime prevention officer will come to your residence if you're a vic. Even you do not even have to have become a victim, they could do a survey of your apartment and the building and they could make suggestions like putting up cameras, make changing a different type of lock. So we're going to try to spread that news around and let people know that there is a service that we not a service, but our crime prevention officer will do a survey for you. If you request it, that's good to know. Does that answer your question Barbara, you have any other yeah. I just wanted, though, systematically, since there are these burglaries. If you initiate on your own that hey you know, you were burgled yesterday and there's the report, because people are not necessarily aware to go. Ask I think that you should be proactive and approach the victim of the crime, the bodega or the insurance agency or whatever, and stop by and say hi I'm the crime prevention officer. I heard you got hit. I would like to assist you if you would like me to here's what how I can help you Mm-, hmm yeah. Well, that's why we have NCOS. I think they do a great job dealing with community. They they go out to businesses, they're canvassing for videos they work really good with, and that's the whole program and the concept behind the NCO program is that they work closely with the sector and these businesses know who they are so if they, if any and if they need someone they know who to reach out to okay all right. So I think I think I think Barbara is trying to say that the crime prevention officers should also be responsible for following up or checking in with those who are victims of crimes. Yes, I understand I mean it's just a volume of jobs for one person, you know what we could probably suggest. Maybe I would look into it. Maybe we could suggest training the NCOS on doing it. You know what that's something I'll look into. That's a great idea! Barb! Thank you again. You had 28 burglaries, we're not talking about thousands we're talking about 28 businesses already in a procurement. We got here, 23, sorry, even less! So that's really one a day for the working day come on. It's not that hard. But look! There is other. You know other responsibilities that they do besides just going out and surveying I'm aware of the many things that are done. I know I know I'm the secretary of the 34Th Precinct Council, I'm with you guys, but I'm asking you to up your game. Thank you. Thank you, Barbara and thank you. Captain Chong are there any additional questions, we'll take two more questions from for captain Chung, I have my hand up, curtis. Okay, let me see who's whose hand is up cheryl, no okay, so cheryl mellow you're up next. Okay! Thank you! Okay, so I have some things that I would like to mention to captain Chung. While he's on here. Okay, I've been seeing on twitter. I saw her on twitter the other day that the 34th precinct has been confiscating the illegal speakers and summonsing people. I want to know why the 33rd is not doing this also, I want to know what's being done about the illegal dirt bikes and these back to the future. Looking cars that have these illegal speakers mounted on the back of the vehicle. They are illegal. Those cars are illegal, they're riding around they have no plates on them. The dirt bikes have no plates and when those cars go around with those speakers, my whole apartment is rattling like it's like an earthquake. It's ridiculous and, as you know, captain chung Morgan Stanley children's hospital is right across the street from where I am- and this is a you know, this is a a hospital zone. They are not by war supposed to be doing that anyway in a hospital zone, and then I'm not going to I'm not going to stay on very long, but this is not a quality of life issue. As every a lot of people keep saying the police, it's not a noise issue. This is reckless endangerment where these cars are drag racing. The woman that was hit the other night was right around the corner from where I live and somebody I witnessed it and said that there was two cars drag racing, one that hit the woman jumped in front of the other vehicle swerved hit the woman and just kept going. I do not know what the condition of the woman is. I pray she's alive she's, not in great condition. I want to know what's going on with these drag racers, it's like they're doing this with impunity, because they know that the police are not doing anything okay. This is reckless endangerment, and this is against the law. Is the law, and also I'm seeing Commissioner shea and chief terence monahan posting on twitter other precincts that are giving out summonses to drivers that have these loud altered mufflers? Why are the precincts here not doing that? The precincts do not work independently of each other. The precincts are supposed to be doing the same enforcement. All the precincts. One is not independent of another precinct, and you know we have a serious issue up here. I do not know where you're at with these dirt bikes, I understand I've been told a million times. As I'm sure, a lot of other community members on here have been as well have been told. The police ca not chase them, because it's going to endanger the pedestrians. I want to know what is how is riding on the sidewalk jumping red lights and all that? How is that any less dangerous to pedestrians, walking on the sidewalks, all right cool? Thank you so much. I think we got suggested your question. Do you want to respond this also kind of connects to the 3- 4? So you want to take a stab at this captain chong before I move on. I do understand because we do get a couple of complaints about this, so I do feel your frustration. We do try our best a lot of times. We get these calls and by the time we get there, I we feel that a lot of these speakers are coming from vehicles. So, by the time we get there, the vehicle has gone and have left the scene. So it's very hard to track down these vehicles and the speakers as far as the illegal dirt bike, it's pretty much impossible by the time we get there, they're gone, they're, probably 10 blocks down or whatever. So again, that's, I think, that's my explanation. I drive around myself even and I've never witnessed any, I'm not saying it's not out there, but again, I'm hearing them every night. Captain Sean was starting. I'm hearing with my windows, clothes, an air purifier and an air conditioner, and I'm hearing them yeah. I do not well again that's what I'm saying I do not dispute it that it's not happening. I'm just saying that by the time the police officers get there they're, not at the scene that they were dispatched so then speed, cameras or speed. Bumps then, should be put up. Okay well, that is. That is something that we have to address at the city level. That's not something the precinct can install. That's like a chime, please. This captain palmer from the captain palmer from the 34 palmer. Okay, palmer! Yes, please go for it. I can. I can assure you we are very aware of the active and reckless behavior with these atvs and dirt bikes that are out here almost on a daily basis. However, the most you know it's nypd's policy that we do not chase. You know we do not chase motorcycles and or cars, and the reason being is that the underlying and most important thing is public safety. If you try to chase these motorcycles you're putting the public and also the actual offender in more danger and more harm's way than if you just let them go, what we try to do- I'm sorry, I'm. I have to say this: okay, because several people on Facebook that I that I'm in a group with okay, many of them have testified that they have just narrowly been hit by these dirt bikes. There's elderly people crossing the street and they ca not jump out of the way when they're seeing a dirt bike come zipping through a red light. So I'm sorry I have to disagree with that. I understand that completely. However, if you chase this motorcycle with a police car with lights and sirens, it's only going to cause them to drive even more right. Okay, can I can I stop for one second? Can we please allow the off the officer from the 34th President statement before we make before we have any follow- up so okay, thank you. Thank you! So much okay. So again, this is captain palmer. I will say what we do is what we try to do. Is we try to as best as we can gather as much intelligence about the groups as we can, including body-, worn camera, video and or Argus camera videos, or any other video that we can get so that we can identify these perpetrators and arrest them at a later time, when it's safe or when we'll put alarms out on them personally, so that if they encounter the police at a later date, we know we have an open case against them for reckless endangerment for operating these vehicles in a reckless manner, and as best as we can, we try to target, especially when we have the large groups. We try to get aviation in the air to be able to follow them, because these motorcycles and Atvs are being stored at storage locations, most of the ones that tear through northern Manhattan are being stored in the Bronx in the storage locations in the industrial areas of the Bronx. So what we try to do is try to get video and or aviation to follow them where they're stored and get warrants to enter those locations and confiscate. That is the safest way outside of putting the public in an enormous harm. I've myself tried to pull over motorcycles and even more recently, the vehicles with the paper plates that we know are all a lot of them are fraudulent and it's just going to cause them to run and drive even more reckless and I've seen them narrowly miss. You know, missed pedestrians and either other vehicles at extremely high rates of speed, so it's just too risky and it's just ny Bdpd's policy that we do not actively chase or pursue vehicles. Yes, we're very! Thank you very much. That is. That is always that's the policy, and I want to move on from this particular. Thank you for clarifying that. Thank you. So much for being patient we're going to move on to Allen. Are there any other committee members with questions? I did not get any hands from the committee members. If so, please raise your hand, so I can call on you Allen, Mariella first and then followed by Allen. No, it's more is captain palmer going to give a report for the 34th precinct first or yeah we're going to we're going to go to we're going to get a more a detailed report from the three four Alex and you want to after this next question. Alan is not a three- three, so I'm assuming this question is for the 3- 3 Alan correct. Well, actually it's addressing both captains, who I appreciate being on the call and filling us in on what their frustrations are and the work that they've done. Captain palmer thank you for sharing the police strategies that you've been trying to employ. I understand not chasing fleeing vehicles and the danger with that you raised. Your last point was that aviation has tracked these vehicles that you know have been committing crimes to warehouses in the Bronx. So I'm curious. Why- and maybe you can answer this in connection with the Da's office? Why not obtain a search warrant and obtain all the data? That's on those vehicles that would identify them and perhaps identify the owners subject to creating a situation where they could be seized and confiscated? Secondly, I do understand task tasking issues and I'm wondering- and this is probably a longer answer somewhere down the road, but I think it'd be worthy of considering task force, whether it's a joint task force with state police, denmark, cars when these guys are getting reported, traveling north at 155Th, Street on Broadway, and you can activate a task force to 165Th Street and as they approach they're blocked, then they have nowhere to go. Then they have to stop. And then you can do your police work and the beauty of this is and that this was going to come up later. So I'll get it out of the way now for both captains, the beauty of stopping these guys, whether it's on a motorcycle, an rv, a dirt bike or in one of these hot up cars that are out I've been listening to them. In the background during this meeting, I'm at the grinnell- and I can hear them out on broadway just over on Riverside drive. But when you stop them, you're going to find people driving without a license driving with a suspended license, people with bench warrants you're going to be able to look in the window, and this is beautiful because it's not stop and frisk. These are legitimate stops. There's got not going to be any questions. Pop shines, a light in the window. The car sees contraband. Now you have a different kind of arrest. There are ways and I'd be happy to I'm. I've worked in the courts 30 odd years longer than I care to admit, but I know what you guys can do and what you ca not do. So I can appreciate when you say you ca, not chase people. I agree with that, but there are things that you can do, even if you have to connect with other law enforcement agencies to make it work, and then it's a win and I'm just curious what you're off the tough response to what I'm saying hi. This is captain palmer. Again we try to implement and, as you know, the geographical characteristics of the 34 precent is we had. We have the bridge going into the Bronx at 225th street. We have the bridge in that goes into the Bronx at 207Th street, and then we have the bridge into the Bronx at 181 street, and then we obviously you have the you know the northern, the north and south avenues on that lead from the 3- 3 into the 3- 4 this past this past summer. You know we tried to implement at least I did in my command. We tried to implement a dirt bike, atv strategy, whereas when we saw a large these large groups of Atvs and motorcycles coming through- and I mean 100 150 200 motorcycles. What we immediately did was, you know I kind of spearheaded it and we shut all the bridges down, okay and that was to try to box them in just as you know, as you're suggesting. What we have learned is that these dirt bikes will go anywhere and everywhere to avoid you know, being pursued that our vehicles can not go. So you know when I spoke to you know the chiefs at you know: patrol board, Manhattan north, you know their advice was that they know and they can see they review body cameras and they can see how you know these motorcyclists are more and more reckless as we try to box them in. We just do not have the resources, the amount of vehicles and just to be able to kind of lock them into a location, and then it turns into we chase a lot of the 3- 4 into the 3- 3 and from the 3- 3 10. It goes into the 30th precinct and so forth and so forth. So in the abundance of safety, it sounds great on paper, but when you have, you know, 100 motorcycles driving around cars through cars on the sidewalk. It's just it's just inherently too risky for us to take that liability to say that this person is such a menace to society that we're willing to put others in that grave of a risk. So we kind of go the intelligence route and try to gather as much intel as we can. I know that's not the answer that people want to hear, but we always have to consider you know. The safety aspect is the most important part of you know of the whole operation. I ca not justify. You know someone a pedestrian got killed because I'm tracing an atv and then I'm just going to lock this guy up for reckless endangerment and whatever happens, or he gets a summons or so it really boils down to. You know the totality of circumstances and it really it's not worth risking a life for a summons, or you know, an arrest that at the end of the day, you know it's not it's not a homicide. I hope that makes sense. Thank you. Can you address the search warrant question, though, for where you know, they're, storing these things and they've been trapped to them. Alan I'm going to meet you for a second, so one second, we have. I Wanna move on to the questions and fewer of the comments. If you have comments to add or follow up items, you can put them in the chat box, we can come back to them, but I Wanna Con. I want to get our committee members, we have oc who's been trying to speak who's on the line who has a idea to share, and then we have Graham so oc you want to go. I hear you. Can you hear me? Yes, okay, awesome. So I have a few points. I'm sorry. I tried to raise those points before, but I was unable to speak so first there are atvs stored in the home Depot facility in Riverdale. I think it's 230th or 31st Street, I'm sure the officers know exactly which facility I'm talking about it's a it's, a storage, slash, you know truck rentals or for is it? No, I'm sorry, U- Haul. What am I saying? U- haul in Riverdale, so there are some atv store there every once in a while, when I drive through, I can see them get them in and out of that place. In terms of the speeding, I have to say that I think that it's absolutely imperative to install speed bumps the one of those short speed bumps, not the really wide one so probably is going to slow down some of the traffic, and I have to also add that cheryl was talking before about stopping people and giving tickets and so forth. I saw an officer giving a ticket to a guy on one of those electric scooters. We had no helmet and I'm not sure what else he did. It was on Iceham and Semen, and so I guess to some degree it is happening and some you know some there is some enforcement, not really the enforcement we want to see. But there is something- and I absolutely agree with the precincts saying that you can not chase after motorcyclists, because that could cause more harm to absolutely pedestrian and they also can harm themselves when they are rushing away trying to get away from the officers so from the police cars. So that's my point so far. Okay, thank you very much, graham yeah. I have a question. So why are why are atvs and dirt bikes? Why do they continue to be legal in the city? I mean I do not really fully understand why we ca not take away the toys, and you know if that's possible- or maybe they already are- and I do not know, but I think the status quo is just it's not working. I understand. Okay, not okay. They are not legal, so there's just something that I'm not understanding because, yes, dirt bikes, dirt bikes, the Atvs are not illegal in and of itself the operation on public highways is are illegal. Those are legitimate, off- road use only vehicles that are sold throughout the country. Unfortunately, in New York City there really is no off- road type of facilities. For these bikes to be operated, it's not like in a rural area where these dirt bikes can be utilized or Atvs can be utilized off a public highway on private. You know private property, or you know tracks or something like that. So the dirt bike itself is not illegal. It's utilization on public highways is illegal, so it seems like one of one solution would be. Why are not we advocating to our elected officials to make this illegal? If they're not intended to be used in the city? We should be our city council and our state representatives. I that's what I'm getting at is that I just feel that you know what why are this is it's. I understand again the not chasing them, but it's also a public health issue and a tenant right issue for us in our building, where we are on the Dikeman, Broadway Corner and literally they do not they're not riding through they're, just doing tricks right outside our building, and we have tenants who are leaving because of this leaving affordable housing because of this moving into their living rooms. Because of this, I think this is nuts. We ca not, and I'm not, I'm not directing this at the officers here. I know this is beyond your, but I think you know as a as a public safety committee as a community board, we should take a stronger stance on the legality of these vehicles, making them illegal wo, not hurt anybody, they're they'll, save people. I just think we should think about that. I would agree, I think, after hearing everything it seems like the only solution is to make them illegal in the city, but then it goes back to what happens after the illegal they're illegal. The enforcement level needs to also be considered like what happens if you're caught with them, one of the repercussions of that. So I think we can keep this on our agenda item on our agenda. Maybe this is something we can have someone. We can find a way to have a presenter help us understand the impact of making them illegal and what that, what the import, what the ideal enforcement will be deal. Enforcement will be for next week for next game. All right all right are there any all right we're going to go? Oh sorry, one last thing: I'm sorry one last thing because I'm not I'm not I'm not clear here when you guys are talking about making them illegal to me and from what the captain said dirt bikes in and of themselves, the recreational vehicles and of themselves are not illegal, but once they take to a city street they're illegal and that's the problem, so we do not have to make them any more illegal than they are. Am I wrong within New York City? You ca, not even store them. You ca, not you know. Okay, that's cutting them point while taking gram point okay, could you repeat that Graham though I was, I would say that you know if you're, if you're, when you talk about the enforcement, it actually helps with the enforcement, because, instead of chasing people and confiscating them when they're committing an illegal act, just the possession becomes illegal. So if you're seeing them stored in a garage. Okay, that's illegal! You know right, like I say I mean. I know this is a little. I do not want to get over dramatic, but a little like guns, I mean you ca, not you know you just ca, not you ca not have certain things like or if you see I mean, I just think that there has to be a tougher, a tougher law. Okay, but I agree with you Graham. I do say in the absence of a new law until then knowing seeing that they're following them from the air or whatever, and knowing where they're stored after they've been driven illegally, I think, gives the police the ability to seize them and confiscate them now. Okay, all right, so I think we need to move on. I think we got. We have we're going to have to move on to our report by the report. Let's turn it over to captain palmer hi good evening, everyone to in an abundance of time. I do not want to get too detailed. I I'll just say that you know I'll go through the numbers, but basically the 34th precinct is that the crime trends are a mirror of the 33rd precinct. So for this current 28-day period, where murder we're one for one, there's no change rape, we're down, 33 percent robbery were down 13 felony assaults were slightly up: 16 versus 13. Burglary, huge Spike, 27, verse, 7 and I'll get into that in a second grand larcenies again another a big spike 77 versus 45, a 71 increase and our biggest spike is Grand. Larceny, auto glas are up 21 versus three or six hundred percent increase. The burglaries, I almost can say, mirrors the three. What we're seeing are the exact same issues, construction sites, windows or people of you know when not windows, doors at residential buildings, where people are going in and going into the basement and stealing tools. That seems like the trend in the last. A few 28 days is tools being stolen construction sites being broken into and stolen the grand larcenies for us in the three four we're seeing a huge uptick in the rebel scooter battery thefts. That's what's driving our grand larcenies. The past few months we've been working on that we've made arrests, a couple of good arrests that would have been made. We actually caught one guy. Last week, live cutting open the seat of a rebel scooter, so that's kind of driving our grand larcenies, our glas are up 600 percent. As captain Chung said, the vast majority of those are unattended vehicles that are left either running or open. They have the key. Sometimes I reiterate what captain Chung said: they people believe that if they leave the car running and step inside a store very quickly and they have the key fob in their pocket that the vehicle can not be driven away. That is not true. These vehicles can still be jumped into and put in drive and driven away so that our glas, the vast majority of them, are from unattended running vehicles. What we've done is actually you know. I enlisted my traffic team now to start. As of last week, we started doing enforcement on unattended vehicles because we see that it's driving our crime and people are just. I do not know if they're just too lazy to get to turn the car off and get out or if they believe that leaving the car running, it would be less susceptible to getting a double parking summons. But you know I would you know, I urge you know the public and we put out things on our. You know outreach on our twitter and our facebook pages to not leave your vehicles unattended, I'm sure most people would rather get a double parking summons than have their vehicles stolen, but leaving your car running and unattended is no. You know no defense for not getting a parking ticket for double parking, so we're actively working on that. We see these cars all the time they're being jumped into and driven, and they leave almost three the Manhattan, the 3- 4 precinct almost immediately. They go over the bridge into the Bronx or you know, go south out of the 3- 4 into the 3- 3. So we've been aggressively kind to trying to enforce these unattended vehicles by issuing summonses quickly and in the traffic area. We've seen a drastic reduction in accidents this year for the 28th day, we're down across the board in all categories of collisions, except for bicycles and all of these instances of bicycles. They are the actual bicycle as fault. It's usually in most cases not the motorists. Sometimes it is, but usually it's the bicycle's fault that they're, you know they're, just not following traffic rules which they're required to, and we just had a small uptick for this 28 day, but year- to- date traffic wise we're down in every category of collisions. So far this year, the a large you know what I really concern myself with the most is the Pedestrian collisions year to date we're down 34 percent possession collisions, which is huge because in my eyes the pedestrian getting hit by a car is far more susceptible to having a serious injury or fatality versus a vehicle on vehicle collision. So we've been definitely concentrating on that in the 3- 4 we send our auxiliary officers out and they do outreaches they do crossing. They do pedestrian crossing help at our high locations of pedestrian accidents. We sit down and my traffic sergeant and I we every 28 day we go over and we look at. Where are we having pedestrian collisions at and I send the auxiliary officers out and they give out pamphlets and flyers, and then they aid in people crossing, especially the elderly and the kids, and making sure to ensure that we minimize those pedestrian collisions. So we've been doing, we've been doing great so far this year with that enforcement. As you know, enforcement this year has kind of been low across the board, almost across the city that had a lot to do with, obviously Kovac 19 and details with the protests throughout Manhattan and throughout the city. So our offices that have been assigned specifically to do traffic enforcement have kind of been reassigned up until very recently, and you know even regular patrol guys that are out there day to day they have been kind of shuffled out to other. You know other events throughout the city, so overall our enforcement has been down throughout the year. However, if you look at you know, once we kind of got a little bit normalized, you know my focus and my direction for my guys was to really concentrate on what causes. You know those serious injuries and those fatalities which was speeding and if you look at the 28, they were up 250 percent in enforcement for speeding, because I said that's where someone's going to get hurt seriously and or killed, and that's what we try to do. We try to kind of precision, policing and target those areas where you know you're going to get your most bang for your buck and you're going to have the biggest impact on safety. So that's kind of what we've been doing in the last and over the year, I'm very much so in the last few months as we're trying to get back to normal operations in New York City. Okay, great. Thank you very much for your for your update, I'm showing once again the comp stat data and there seems to be a few shootings over the past week. Do you have any update on what happened there and if it's, if there was a someone who was arrested for those shootings? Well as of now, we all those are active investigations, and I really I'm not as free to discuss kind of active investigations. But what I can tell you is over the last 14 days we have made six gun arrests in the 34 and which is great gun. Arrests have been down city wide, we've done a refocus the violence, as we all know, citywide has kind of had a an uptick. In recent months we did some refocusing and some operations and in the last 14 days we've taken, you know six guns off the street in Washington Heights. What I think is a huge, a huge accomplishment and we will continue to target that to minimize those shooting incidents and with the goal of eliminating them all together, but the active investigations are really not free to discuss. Okay great, I understand that completely so we're going to take a few questions. I just want to reiterate: if you have raise your hand, if you have a question, I see claudia has a question, and I also want to reiterate that. Yes, the atvs are already illegal, so we do not have to worry about that. It's the enforcement- that is the issue here, wendy from Assembly member El Taylor's office. Your representative also mentioned that in the Chat Box Bernard mentioned this. I just want to acknowledge that they are illegals. We have to figure out a way to how to how to better address the enforcement or the lack of enforcement, because it seems that they are legal as much as you see them around the city again. Just for clarity. Sorry, are they illegal to possess like are? Is there presence in the city illegal, where you can just confiscate them? If you see them or is there operation illegal? It seems like once you that once they're in operation right, that's the issue, so you can possess them still possessing them is legal. Operating them is illegal. So maybe we have to address the possession issue and change that. Okay, am I correct those who are under who understand this issue? Please feel free to jump in. If you have better information about this, I guess my question is that even if they are being possessed, they would not be. I mean I guess, I'm not. It seems like the time that they would see that somebody is possessing them is when they are actually operating them and then they still would not pursue them, because that's not their property. So right I mean right, but there you can. You could track down. Just give me one. Second, just give me a second sorry, danielle yeah. I have a couple of questions for the officer. Sorry, can you remind me his name, hello, you're, talking to captain palmer, Daniel Captain, palmer you're from the 34th correct? Okay, I guess a couple of things. The first question that I had was about package thefts and whether those are down or just what the status of that is. The package steps the pac recently a lot of troopers who have gone through with with our truck this echo was throwing me off. He got up. I apologize with the crime prevention officer and they've been installing, I guess, packaged bins in lobbies and in buildings in their locations in their building. We're now the I guess the super has control over who locks. They lock the packages in this cage when they make deliveries and package steps have definitely been down. Thank you for that yeah. That sounds great, that some supers have obliged. But what would you say for buildings? For example, my building has had- and I've personally experienced- probably ninety percent of my packages being stolen, but our building continues to sent to indicate that they're not going to do anything about it and that it's our responsibility. So I'm just wondering what mechanisms you have- and I've mentioned I've asked this before on previous calls. But do you have a mechanism to sort of force supers to install these these boxes, if they're buildings that have been identified as high crime or heart are buildings that have been targeted well, I would encourage your super to you know to reach out to our crime prevention officer, and we can discuss what we believe is, and they will go through your building and do a survey and give suggestions and recommendations on how he can harden that building to make it less susceptible to someone coming in off the street and and stealing packages. It's also, you can do some education. The super should be doing education in the building to say hey. If someone does not live here, you do not recognize someone just do not let them in, and I will tell you from personal experience with 25 years in policing if I need to get into a building in a hurry for an emergency I'll hit every button on the on the panel and sooner or later, someone's going to just open the door without even knowing who it is so. A lot of that is education, educating the residents to say, hey. If you do not know that person ringing, your bell, do not just arbitrarily open that door and just hit the button to open the door, because you know you do not know who's on the other line it could be. It could be such a simple thing as stealing a package, or it could be someone that has an order, protection against someone in a domestic incident and they're coming up to do harm to someone, so it just behooves us. You know all to say that, let's have you know better practices and what we do and not just arbitrarily open doors or allow people to come in when we do not know who they are or what their status is in the building. So that's just you know one way I mean if you want to come down and have residents come down into the precinct, we can make an appointment with your with our crime prevention officer and discuss things specifically for your building that works for you, because every building is not the same. The layout is not the same that you know the entrance and exits are not the same and your you know. Your access, control in and out of the building is not the same, so we could take a hard look at that. Take a hard look at that and say work to improve yeah. I guess it just seems to me that the most effective strategy would be sort of. I do not want to use the word forcing, but in a way forcing the supers to comply with your recommendations, because I think you can do education, but I think that even but sometimes people are still going to you know if you're being polite, you're and you're walking into a building you're, not just going to drop it on somebody who's behind you and so that person could potentially be. You know somebody coming to Rob to take the package from the lobby and I, like I said I've personally had multiple packages stolen and we watched, I watched the video with my super and the individuals have come in at different hours during the day in the evening, and so I just think I do not know to the extent that you have that you can sort of force for lack of a better word, the supers, to comply with the recommendations. I think that could be helpful. Someone in the cut in the Chat box, Allen who's, wait, I'm going to need to generate all right. So they're. Just reading a few comments, someone said you can sue the landlord. Some say that it's an issue between the landlord providing funds for the super to secure the building in a more efficient way. So those are just one of the comments in the chat box. So we're going to move on to, I believe Barbara is next followed by Mariella Barbara Mute yourself. Please am I muted now yeah, yes, okay, yeah! I hello captain palmer good to hear from you again. This is Barbara Frazier, a few hi yeah a few comments to make one there's again begun: these abandoned cars and cars that only have little paper plates on them or plates that are kind of being rotated among the same cars, the usual spots up at around 218Th Street, Hillside, Avenue, Bogardus and so forth. So again the I assume that these are either stolen cars from dealerships whatever, but again taking up numerous parking spaces. People have been, you know, noticing that and I mean or that they have seems to be fake tags on them and so forth. Are you aware of that? Yes, Barbara, as a matter of fact we're planning another operation like we did the last time we had to kind of take a backseat to that, obviously, because of the issue with resources in Colvin 19, but now as we're trying to normalize we're actually setting up another operation, hopefully we'll get it done next week with with our tow operation like we did the last time, so we we're aware of it. We know it's coming back. Not only are the paper plates being an issue parked, but for some reason, the paper plate thing has kind of exploded, even operating vehicles on the street. So what we've done is actually last weekend we did a. We did a paper plate kind of for lack of better terms initiative, and we kind of I almost say targeted to paper plate, because a paper plate in and of itself is not illegal. We did safety checkpoints in which we, you know, we had a systematic, arbitrary way of doing safety checks, and if that person did have a paper plate, we either confiscated it if it was illegal or expired, or we told the vehicle, I had them towed a vehicle. So the paper plate has become an issue, especially with New Jersey, because of cover 19, the these paper plates that are issued in New Jersey. When people purchase cars they were expiring. However, the state of New Jersey was giving them a stay of execution for lack of better words for 90 days, so it's very hard for us to distinguish which ones are legit and which ones are not legit. So we do have a hotline to New Jersey State police, where we can kind of validate and or check to see if those paper plates are legitimate and if they are not legitimate and they're fraudulent. We are arresting the operator for possession of a forged instrument and if they are just expired, they kind of get a pass from New Jersey, because New Jersey's, processing of license plates and registrations were severely delayed for covert 19.. Thank you, Mariella you're up next, I had a couple questions to curtis. I had a couple more questions. Okay, got it go for it. I'm trying to get us here by nine o'clock, so go ahead. Barbara! Okay, there has been a numerous retirements in the NYPD and also this budget decrease has kicked in what? How much is the decrease in staffing in the 34th precinct over a year ago and two years ago, your overall decrease in staffing. Our staff has decreased a significant amount. I do not have an exact number for you based on year, but I can, I can say it. It's we're at currently at 143 police officers, and I know when I got here in 2018, we were above 200.. It presents challenges, but you know at the end of the day, the mission must be completed and we have to do what we have to do. So you know it for lack of better words if we have to Rob Peter to pay Paul, we kind of do, but it does affect the number of cars that we can. You know we can put out for every shift. So you know I remember when I first got here, we put out maybe nine or ten cars, it's very rare- that I'm able to put out that many cars, so it does have an effect on staffing and response time, but we try our best to you know, even with the manpower issues to still you know, service the community as best we can. You know with the amount of resources that we have. Thank you another question. As you know, our community has been mainly invaded, I believe, from the outside this summer by the people that generally cause the noise and mayhem. Even when you issue tickets, often these tickets get ignored because someone in Jersey can ignore a New York ticket. Is there anything in place so that tickets issued in the tri- state area can be enforced out of state and so forth? You know what I'm talking about yeah. I know exactly what you're saying that, however, is not a function or a responsibility of NYPD. I believe that would probably fall into New York City finance. However, and I know exactly what you mean- the people, sometimes when they're out of state, they do not care, they say I'm only in New York for a second and I'm out, I'm from Jersey I'm from Connecticut, and they would choose to ignore it. But I will say that we do have our program where our lprs the license plate. Readers are out there. So if, for instance, if a person from New Jersey accumulates a significant amount of tickets in the city of New York and they do not pay them when an lpr reader or traffic agent or anyone scans that vehicle and says hey. This vehicle has outstanding summonses that have not been paid in New York City finances they're on their list, so to speak, the car would get towed and or booted until they pay until they pay their fine. So that mechanism is in place. But unless that person was, you know actively just parked or something, and someone saw that car. I do not know of any and I could be wrong, but I'm not personally aware of any thing that the New York City Department of finance does to have enforcement out of state. I know in New York state they will suspend your license if you do not pay fines, but in other states I'm not sure what that agreement between the Department of Motor, Vehicles and New York City finance is thank you very much property. Is our friend this evening, barbara we're going to move on. Please take it away. Hi. I have a couple of questions related also to the drag racing up in wood. So my question is: are there hot spots that the precinct is aware of and that patrols more regularly than others? And if so I mean, I wonder if the repeated presence, even if it's a little bit like whack- a- mole, you know like there's more presence in this one area for this given time than they move to another places. But I wonder if that's still something that can be done and then my second question is I I'm just getting increasingly concerned with the number of cars that park around the circle on Park Terrace, East South of 215 by the entrance to Eisen park the cars that park there are often ones with paper plates. There are cars that park there with very tinted windows in a non- parking spot. Sometimes they speed more regularly up hard, terrace east, and so I'm wondering if that is on the radar for the precinct. Okay, to answer your question about the hot spots, we definitely have a list of hot spots that we consider that were that were really problematic during the summer months, especially once the city kind of semi opened back up to the public on those areas were usually on the later. You know the later part of the night behind George Washington, High School 190th in Amsterdam that little stretch behind the school, the end of dikeman, my little, the the very end by La Marina, Slash Jimmy's, cafe, whatever it is now that was kind of an issue as well as 9th avenue. On the dead end streets, 202 203, 204 205.- what we did during the summer months when it was warm and hot outside and they literally set up pop- up parties. We changed the shifts of six officers and made them kind of a de facto response team and what they did was basically babysit those areas, because those were our hot spots. Those were the areas where we received the most 3- 1-, 1, complaints for noise and drag racing and just typical lawlessness, and when we implemented that the complaints reduced drastically my special operations lieutenant he personally supervised those six officers and he went out there and he visited those locations himself. Personally, I personally went out to especially 202 203 ninth avenue, those dead- end blocks right by the water and, like you said it, it's 100, whack-, a- mole. You know they're going to move from one place to another. You know, unfortunately, as Barbara was saying earlier, with the resources we ca, not put someone a you, know: stagnant post to guard a dead end block, so we do not have a party we ca. Not put. You know a cop at every intersection. However, you know we try to as best as we can between answering the emergencies. Send people to you know periodically check on these locations throughout the night and shoot people away. You know, I'm never one to say. I push my problem on someone else, but you know my border stops at the bridge, so you know if they decided to go into the Bronx that no longer becomes my problem, but you know in all seriousness, though it you know it helped it worked and we continued to do it throughout the you know throughout the whole summer, and now we only most recently stopped it to reassign those guys it's getting colder. We did not see the need for it anymore on a nightly basis. Now people are kind of you know: schools back in session. It's getting cooler at night. We, you know, we do not have the speakers and the parties, the pop- up parties like we had you know, say a month and a half ago. So that's that the other, your other question on about the issue park over there. We have not been aware of any issues over there. I was not aware that there was a huge issue. If there is, I will send my sector David over there to to check on it. Unfortunately, the paper plate in and of itself is not something that you know. We've discussed that with legal. That's, not probable, cause to take any kind of action unless we see something else going on with that vehicle. So I mean I mean it bears taking a look at it and say: hey you know, you know, what do we see? Is it a fix properly? Is it in the proper location where the plate is supposed to be? If it's taped inside the window, maybe that you know that's another story, that's not where it's supposed to be. Maybe we can dig a little deeper into that, but just the mere fact that the car has the temporary paper plate is really not enough for us to really start digging into that car, but I will definitely take note of that and make sure we have maybe some enhanced patrol over there during the nighttime hours and see what's going on. Thank you very much. Our next question is from Nancy Preston, followed by Claudia Claudia. Okay, thank you, hello. Captain palmer good to have you hi nancy. How are you I'm good thanks? So my question is about there's an incident that happened at taboo on Monday night, where there was a fight- and you know so. Let me just to explain so taboo is on dikeman between Seaman and Broadway. I live in a complex of 150 units. That is the half of that complex faces. Semen and residents reported that this fight was a throwing of hookah of tables of chairs of tackling and punching. It was very brutal and I asked our NCOS about it. The next day when I heard about it, because I got some reports and the response was nothing. No, nobody was hurt. There were no complaints made. There was not everything was in order. When the police arrived, there was nothing turned over or anything and that it was simply three females that were drunk and had an argument, and I kind of pushed back a little asking for details, because I got very different information from the residents that live above there, and I also asked about the fact that this is Dikeman gardens. It's an open street to have an open street. They must have security, that's part of the deal. So where was the security during this situation? How come they did not handle it and the police had to be called and it got out of control. I was also told by the NCOS that apparently this group of women were tried to were tried to get in patapolo and were not allowed in patapallo and then ended up at taboo, so this situation went on and security did not help at Dachman Gardens, and you know this is really disturbing and scary to our residents, because we have also experienced patrons from the clubs recently because it's timed, if they're busy, if they're busy, because there are only so many tables if it's time they have come into our complex to hang out in between and as you know, there has been a history of violence on the strip and as it gets busier, and you know, of course we know businesses want to be supported, they're, giving a lot of slack, and I just there are two different stories here very different stories and it's disconcerting to all of us. We're really kind of scared about. What's what this could grow up into information. I want to second what nancy is saying. We are part of the same tenant association in our building and our residents and I've heard the same thing from them. That there was a very different story from what they saw and I'm believing them, and I also can second, what nancy is saying about individuals coming to the complex while they are waiting for tables they come in, they sit on our steps, they smoke weed, they make noise they and when they're asked nicely to leave, they become really aggressive and often curse at the people and do not leave so you know I want to bring that up and just second with nancy. Thank you. Do you have a comment? Do you like to respond to that captain palmer? Are you still alive? Oh yes, I do yep well, I was not aware of the incident. I was not aware. I do not know if the NCOS were actually there that night I'll definitely have to look into this. Actually they told me they were there. Okay tell me they were there and they responded, and they told me that that's what I relate to you, what their responses were. Okay, well I'll, definitely take a look at it. The special operations lieutenant is here as well he's listening. He'll have a conversation with them. I was not aware of it. There was no reports made for it. So that's why I was not aware that this occurred so we'll have to you know I have to get back to you on. You know what really transpired, if you know if I have to go back and pull video or something like that, I will, but as far as the point where they're waiting in your vestibule area, where people are waiting in your vestibule, if that becomes an issue, then you know I would suggest to call you know: 9-, 1-, 1 and say people are trespassing in your vehicle. I mean in your in your vestibule and let us come and let us eject anyone. That's not supposed to be there. Just be there, you know. So, could you could you? Could you I'm going to put my email address? Could you follow up with us tomorrow after you gather about what happened, and my question was basically that this was what I did was drunk people causing a fight like, even if, even if there were not things being thrown around, which is what we were told- and you know that was a witness- is not that something that requires a disorderly premises summons. Well, we have kind of been I you know the governor created this task force to to enforce this. You know the whole clubs and the social distancing and the restaurants and stuff like that. They have been the one to enforce all of these regulations regarding restaurants. So, since the governor created this task force, we've kind of taken a back seat to that, because they've had they've been the ones with the authority to do it. You know they're they've, taken that responsibility. That does not mean that we ca not and that we wo not do it, but we have not been sending our club guy that we used to have that we no longer kind of employ because the state kind of took over that role again. But that does not mean that we ca not initiate some type of enforcement or do a referral which is really in a referral to the SLA and, like you said, a disorderly premise. Right and that's my concern is that you know our NCOS and there were more. I was I heard there were about six or eight police officers on scene when the melee was taking place and certainly to me that says disorderly premises, and why was not anything done about that? So there are some facilities. I'll take a look at it. Can you can you give me the time the data exactly do if you know was it was 9 30 on Monday great night, so you can email us with their follow. I put my email in the Chat box. I'll put it once again, so it's right there and I believe there was another question. I want to make sure I'm getting everyone. I think. That's claudia is our final question for the 34th present and then we'll move on from there, claudia yeah, hi good evening. I had two sort of interrelated questions, so the first question is regarding tinted windows. On cars, because boy there's a lot of them around, I spend you know just a couple of minutes. We'll see cars with completely tinted windows. I believe legal is that the back can have a certain amount of tint, but the front is not allowed to have it, but here where I am I'm up near the park on Seaman Avenue, you just see them go by all the time. So my first question is: what's being done about that and are there tint readers, I think there's calibration devices that are required in order to check the tent and enforce that violation. So that's my first question and then my second interrelated question is I'm wondering how, as public since the captain's mentioned, gathering Intel on bikes and on all of the things that we're seeing I'm wondering how we can best help. We have so many videos how you know. If I see a picture of a tinted window car is there somewhere. I can send that. I understand I can send things by Facebook, Messenger and they'll go somewhere in the 34th precinct, but is there anything that we can do, especially if you're trying to identify speeding vehicles they go by where I am all the time? How can we help? Okay, the first thing with the tent, the actual tent itself? It I believe it was 2017. The state made it illegal to have any tint on the front windows of the car the back windows can have can have tent. I believe it's 30 to 35 percent light transmittance in the rear of the vehicle. However, the front the passenger driver windows can not have any tent at all exactly and neither can the windshield. We do tent enforcement and it does require a tent meter, a light transmission detection device and we do have. I believe we have two operational at this at this point and the issue with them is they constantly have to be calibrated and go down for service, so we have them when we, when we, you know when we see them, we take enforcement. However, if the police officer that notices it at the moment does not have the a caliber currently calibrated tent meter, there's nothing, they can really do to issue that summons they'd actually be kind of issuing a summons in bad faith, because they know that it would not stand up because they did not use a calibrated tent meter. So they have to kind of be in possession of the tent meter at the time and unfortunately, we do not have enough temp meters in NYPD that every police officer rides readers are something that's going on. Claudia. I'm sorry wait one second, so I I'm trying to understand your concern with the tent is the tent itself causing some sort of public safety concern? Why is this being addressed right now? Me? Yes, yeah! Well, because pretty much all of the cars at speed have a ton of tint and most of them have like a hundred percent tent and it seems like an easy way to identify yeah, but it's it. But if there's, if it's a speeding issue, would not that just be traced to the license plate, what does the tent have to anymore? Well say: sin because if the, if there's an issue with license plates, either not existing or being paper license plates, then certainly it's possible to identify vehicles by tint. Even if there's license plates missing, okay got it. I understand alrighty. So is there a second part to your question before you move on yeah? Also I'd like to I'll answer that the also what you have to realize is that there is a responsibility of New York State Inspection stations. They are technically not supposed to pass any vehicle for New York state inspection if they have tent. So what our you know, what we've noticed in our concern is these vehicles around that have tent. They have current vehicle inspections, so where are they getting inspections that are allowing people or passing people knowing that their vehicle has a illegal tent on the driver and passenger doors windows rather, and that's something that needs to be addressed at? I guess at the state level of who's auditing the inspection stations to see whether or not they are complying with New York state law by failing a vehicle that comes in to get reinspected every year with license plates, I mean, I know the state does audits occasionally, but I do not know to what extent is that it? Thank you. Thank you very much. We have to move on the agenda, my apologies, so I think we are com. We finished the section, our agenda, where we are getting our reporting and answering and posing questions to our precinct leaders. Thank you all for joining this evening. I do want to turn it over to superintendent miller from edgecombe correction facilities, as well as followed by our district attorney representative for any updates they may want to share with us. I know this month is domestic violence awareness month and that's a big issue for them and they always share I'm great. So we'll start with first and we'll turn go to the district attorney afterwards good evening. Everyone things basically are the same. With the facility been functioning, we've been getting in population no problems as far as Covid-19, following all the protocols, the mask wearing, I'm understanding. There is an uptick happening in other parts of the state, as well as in New York City. So I would remind everyone to wear math and when you ca, not socially distance, and it's really a relevant and prevalent issue recently, we had a couple little situations. We had some vandalism that happened on our property at about 1 45 A.M. We really could not tell much from the video footage and we actually had somebody block our driveway at the driveway of a correctional facility for like like eight hours, so we did make several calls to get the card thicketed and towed. Eventually, I was able to flag down a passing control card to ticket the vehicle and then magically the person who parked came and moved the vehicle. Otherwise you know everything has been has been fine with the facilities. Okay. Thank you. Thank you for your report. I do have questions for you about the. Is there a construct there's? Is there some construction going on at the at the prison? I see there's like a lot going on outside and the lights are on and I was not aware of any special projects happening there what's happening. Yes, I believe. Last month I may have mentioned that we're doing a fence project, so the entire fencing around the facility is being replaced to do it properly. We literally have to break the concrete, put new posts, foundations. We put up a temporary print, which will be replaced once all the foundation and hosts are settled with the new fence. So we anticipate that finishing by the end of the year, but we're actually on pause right now, because some of the original materials that they're looking for are no longer available with the company, so they had to find another company. But it's still on schedule to finish by the end of the year. Okay, so it is taking up sidewalk space for the time being yeah. So it is it going to be a first place for those who are currently incarcerated there, or is it just the fencing project? It's just a fencing project. It has no impact on the inside of the facility. It's just the exterior fencing was aging and not really secure, as it should be. Okay, so believe me, it's something that the money was approved, maybe two three years ago, yeah. If it was a project for this year, it would not have happened with the budget constraints were under. Oh certainly, okay. Well, thank you very much for your update, we're going to go to the attorney's report now. Are there any questions for Mr Miller Okay District Attorney Elliot? Are you on? She was having a problems earlier. I think Bernard had a question for the district attorney yeah. I believe so. Okay we'll get to him once we get the once we get if they're on. I do not know if they're Ellie are you still there? Yes, I am on. I am I am. I can not hear you. Let's see, you must be muted. I see you there, you're, not muted. Actually, let's give her a Sec hmm. This is why I do not make this participant that represented allowed to hmm any idea. What's going on someone from the office in the Tech division, I see her microphone is not muted but she's, not able to say anything. I ca not hear it rather. Audio problem will be on her end. The audio problem may be on your end. Okay, so there's a problem with our representatives from the district attorney's office, we're going to move on in the agenda and hopefully they'll be able to jump back on and moving forward. So we have representatives from our assembly members Office from Assemblyman Al Taylor's office, and we also have a representative on the line from Assembly Woman, Carmen, De, La Rosa's office, as well as the chief of Staff Joanna Garcia from State Senator Robert Jackson's office. We can start with Joanna if you have any updates to share from Senator Jackson Hi. Can you hear me I can hear you hi everyone? I was not prepared to present anything specific, because I really just wanted to check in and hear what the community is saying. We have been getting a lot of complaints via calls and emails from the community on the very issues that you've been discussing tonight, including the drag racing, the noise levels, the concerns that the respective piecings are not being very responsive. I did hear some mention of the furious legislation as well. There's one called Sleep L- S-, L-, E-, E- p. We have definitely signed on to the furious. I believe we just signed on to the sleep. These are just different ways of addressing some of these issues. We are planning to circle. Back with the precinct, we had a recent conversation with the 34 precinct to talk about some of the hot spots and some of possible solutions to what's going on in the streets. We had hoped that, because the warm weather was behind us that some of this will go away, but it just seems that the noise level issues are being replaced with drag racing so really here to listen and that's all I have regarding public safety. Thank you very much who's. The sponsor of that furious act, Joanna it's Senator, Brad, Heyman. Okay, thank you very much. All right, orlando from Assemblywoman, Carmen, De, La, Rosa, hello, everybody. How are you curtis here? We go. Yes, I do not have much to report, but you know I've been paying attention to everything that community members have expressed, and you know we know that there are alarming concerns about the noise levels in our community. We've had constituents come to us and speak about that we've helped them to do the 311 complaints, but they seem to be not working as intended. So we've also reached out to the department of environmental protection about those and we've connected them to the NCOS for the respective black area. Also, on the furious acts we are, we saw information about it, but apparently it does not have enough does not have a sponsor in the assembly and we're trying to. We have been trying to reach out to the Office of Senator Holman to see what's going on with us to see if they have a status, because so yeah things have been slipped like going a little slower and I'm sorry about that's my daughter. Let me just shut the door. I apologize no follow- up. Yes, so yes, so we've been paying attention to that and you know about the sleep app that Joanna just mentioned. I have not heard about that one, but we're going to look into it, so it is important to be on this on these issues, because you know we know that there are quality of life issues, but also the assembly member has been aware of everything that has been happening in the throughout the summer months and in the middle of the pandemic. You know the drag racing, the Pedestrian safety issue, the speeding all that all that stuff that has been occurring in our community. I've seen it myself. I've reached out to a 34 person several times about it, and you know, like the one of the representatives said like when they come, they it's actually the people are gone already. The people that are the perpetrators of these drag racing and everything has been going on so we've been paying attention to it, but there's there has not been to come to a resolution, so you know, if anything I'll be here I'll stay to the remainder of the meeting and I'll put my email address. If any, there are any other prevailing issues, we're more than happy to assist. Thank you. Thank you very much, wendy from Assemblymen out Taylor's office. Do you have a update briefly or comments to share hi curtis hi everyone? Thank you for having us thank you for hosting curtis, pretty much what Joanna and Orlando were just saying. We have also been receiving complaints. You know noise, some drag racing, D.O.T kind of forgot to paint some lines over some streets and now they're just blank campuses for these guys to drag race on it's. You know as representatives, it's really frustrating because there's you know very little that we can do and we are reaching out to everyone we're doing everything that we can short of pulling the guys over and saying: hey cut it out man. This is not cool, but as far as the legislation like Orlando said, there has been very little news about it on the assembly side. It is definitely something that we're waiting for, and that's all I have to say for now. We will be by the way, sorry hosting a domestic violence event. I do not have all the details yet so as soon as I have it I'll send it over to the board, so you guys can help us distribute and that's it. Thank you. Thank you very much. As you know, we did pass resolutions last year on surrounding diversity, violent issues, so anything we can do to support, and I help advertise this issue, particularly because domestic violence is not just. You know, partners living together, it's also senior citizens and in the midst of Covid-19 we do have to make sure we are. We are equipping our community with resources and knowledge on the issue of domestic violence, which was not really discussed in great detail by the precinct, but we have received updates and complaints or concerns about how they're responding to domestic violence issues in the midst of Covid-19 when everyone's at home dealing with this issue of confinement all right. Thank you so much so thank you very much. Send it to the office with the most ready he blasted. I want you to have that with you hi encourages. Can you hear me? I can hear you yes, okay, perfect, I'm calling from my work phone and I have the computer with the it's a mess, but I'm here hi everyone, hello, my attorney's office. Before I start I wanted to share that. I noted Allen's questions down. I do not have the specific details regarding a search warrant why we did not get one or if we could actually get one for that investigation that captain palmer just caught in touch based on, but that's something that I can try to get some information on. If there is not enough investigation, sometimes we do not we're not allowed to share any additional information, but if there's anything that I am able to share, I will do so most likely next month or not. I will email curtis, so he can pass it along to you and the rest of the board members. Before doing so, I will probably reach out to captain palmer hi captain to get more information, because I'm not aware of it. If that's, okay with you, I think he must have dropped off yeah, but I'm addressing Allen, because I know he had a couple of questions. Oh yeah, I was about to type your note, but thank you very much and even if you ca not address a specific investigation, if you could provide us with a general answer as to the ability to use and then pursue search warrants in these kinds of situations, that would be really useful for us to know, because if it's in the toolbox, which I think it should be, that's great, if it's not in your toolbox, we, I kind of, would I think we all would kind of want to know. Why sure and that's why I wanted to make sure that you know that I heard your questioning and that I am sure- and I do I appreciate it, and I will check in with my office, and I will try to get back to you as soon as possible. I will definitely reach out to curtis and keep him updated. Thank you. Thank you thanks for recognizing that, of course, and I also want before I go, do you know I want to be respectful of every one time, so I'm not going to take too much of it, but I wanted to highlight a little bit of our summer and then move on two events that are coming up before. I call this before the pandemic before and everything that's going on. I spoke at this meeting about our summer internship programming and how excited I was to have people from the community to join and be part of it because of colvit. Instead of having a two- month programming in person, we had to bring it down to a two- session four- week. Programming, however, to be our first virtual programming, it was very successful and the students joined the love guys. The students were broken down into two different cohorts, a cohort, a career cover and a criminal ni policy cohort in the cohort. The student has the ability to come up with their own public safety campaigns such as human trafficking, domestic violence presence, and not only to the D.A himself, but also to other leaders. In my office and because the program was so, it was so successful. We are trying to have a similar programming for the year. Maybe the fall is not the spring. So if we are able to host a similar programming, I will be back here to share that information, because it was so refreshing to see young people speak of topics that they're actually passionate about. They picked their own topic. They did their own research. They worked very closely with ADA professional staff in my office to come up with this campaign, and I'm just sharing it, because it was very refreshing even for me, and I would love to see more people from the Washington, Heights and Inwood community be part of this program. Next courtesy curtis mentioned on domestic violence. As you all know, next month is domestic violence awareness month and my office takes it very seriously, not only by prosecuting our cases, but also by educating the community every October of every year. We do a whole outreach campaign where we offer a 30 minutes up to an hour presentation, slash, training and I say training, because if an organization is interested, it's interesting for the staff, we can provide them training if you're interested for parents. We can provide a workshop not only to bring awareness to the issues but to also learn about different resources that anyone who might be a victim of domestic violence where they can go, how they can get help. So if you know anyone that might be interested in this workshop, slash training, please let me know I'm going to put my email on in the box, so you can, you know, inform me of it as soon as possible. During this meeting, I heard a lot about gun violence, how there is a spike city- wide. It is a big concern not only from my office for NYPD for my hand for the bronze. It is a city- wide issue, and because of this, we are working very closely with NYPD to host a gun buyback event. It's called cash for guns, no questions asked, and this is going to be taking place on Saturday October 17 of 2020, which is coming up in a week and a half. If you attend this event, the participants can receive a 200 prepaid card for handguns and assault rifles. They can also receive a 25 prepaid card for rifles, shotguns and air guns, and the drop- off site opens at 10 am and it closes at 4 pm. I can send this information to curtis. I can also send it to Ebenezer Smith, so he can blast it to the community, but you know we're doing a lot of the work remotely. So as a member of the community, it is our job to spread the word. I am more than happy to share with anyone, but if you know anyone that should really attend this event and hand in a gun, it is our responsibility as citizens from my head and from the community. I am myself part of the community, so if you know anyone that will benefit from this, please spread the word. Let them know a lot of people are afraid of law enforcement. They do not want to participate in something like this and I understand the issue, but it is our responsibility to have the street credit and kind of spread the word. So I will be very happy if you can pass that along well. Certainly, thank you very much. It's good to hear that there is a buy back program. It's happening soon. Is that up? Is that Manhattan or is that north or where is that? Where is the drop off, and I some concerns were raised that were interested in having it in West Harlem, and I understand that every community wants to have a gun, buyback event and I believe, is picked based on what community is having the larger issue. I believe, two years ago we had it in West Harlem. I do know we had one in Washington Heights and do not recall when it's a yearly event. So this time we're having it in east Harlem and I just really hope we are able to spread the word. So people ca not attend. Okay, great! Thank you very much. I do you have any additional items or is that is that it for you? No, I just really wanted to touch the base on the gun, buyback event and then our domestic violence awareness campaign for next month. Lastly, I do want to share that are off. Some of us are still working remotely and although we are limited physically, we are available at any time. A lot of you have my work cell phone, my email- I can put it down again, so if you do have any issues, I do get back fairly quickly, especially if you text me. I'm always honest. So you know we are here. We are committed to public safety. Jacqueline Minaj, the director for Washington Heights Office, is also available, so we might not be physically at the office, but we are working and we are here. Okay. Thank you very much very much for that update. It's always great to get a positive leave with something positive. It's great to hear that you had a successful internship program with young people who may be entering the law enforcement world in the future. So I hopefully we can get more young people from Washington Heights involved, and you know I work with young people who are involved with the justice system, so I would love to have you all come and do a Dv presentation to our young people. So my question was and the only question I think anyone would that I have is do you have do you have any focus or do when you have these TV presentations? Do you do? Can you can you adjust it to serve the needs of teenagers who, as you know, many of them are in relationships and some of them have been in very harsh situations because of their you know online relationships online violence. Do you cater to that sort of like demographic? That is a great question and thank you for bringing that up. I should have touched on it and we also provide a presentation called teen dating violence, that kind of focuses on domestic violence but targeted to teens. We do scenarios with them like what will you do now? What do you do, but like we, it's kind of very interacting, so the kids do love it. As because they learn about it- and they see as like, this could actually happen to me, it could potentially happen to somebody. I know I can help them, because it's very engaging so we work with the audience that is interested in the presentation. So if you want to work, if you want to have preparedness, we can target it to parents. If you want to have it for our teenagers, we can work with you. So if you are interested, I can send you the email, so you can fill out the form and in the phone you provide the date you provide the audience and then, if, for some reason we might have more questions or concerns. Someone from our education team will contact you directly and they will work with you, but we do have a presentation already available for teams. Okay, great, thank you very much for the update. I think we have reached a point where we are going to move on in our agenda now. We do not have any questions for our electors. They did a great job sharing updates. We look forward to hearing from them again next month in the following months. After that I will be here next month. Thank you. I'm sorry, I apologize, but you know I will be here next month: okay, cool. We look forward to having you back okay, so we are. We have one final task and that involves the ranking, which is our annual price annual process. We have to go through our expense budget and our capital budgets and make recommendations for the board, and we have a a meeting in November where we look at all the items that from all the committees and we rank them as individuals. So we have to do this at the committee level to rank our own items, discuss our items, things that we think are important are needed, financial items. We need to purchase or expenses, they need to be made and we rank them and then we have they. We have yesterday the public can and give us input so you're. Here you can give us input on those items as well, so I created a spreadsheet today, shared it with the board. I also shared the rankings from last year with our committee, as well as our district needs assessment with our committee last month, and I think many of them reviewed it. I emailed that to them again today with a spreadsheet, for us to kind of do our individual like thought process, so we could have a more fruitful fulfilling conversation on what we want our numbers to be as a committee, and also to think in advance about items we need to add to the list. There's been a lot of talk on. Let's see here, I want to move. Let me start my share. Bear with me folks already. I know everyone's anxious to go watch the debate tonight, so I do not want to intrude on your date watching time or we'll make this quick and painless alrighty. So this these are our rankings from 2019. Under the category of expenses, we ranked expand domestic violence and sexual assault, harassment programs and improve multi- agency responses as number one. Our committee rated number two expand implicit Bias, mental health substance, abuse training programs. As number two number three was increased funding to support fdny in addressing and correcting violations for fire prevention and firefighter preventions and homes, nightlife establishments and the last item under our account. Our expense item was to add speed cameras in the 34th preset, and that was rated number four under capital. You can see. These are pretty. You all can see my screen right. We had rated number one as additional upgrade to the emergency response system being 3- 1- 1 number two was procurement of additional noise Decibel readers. I asked number two a light tower within the 33rd precinct that was on the that was upon after getting recommended by the by the precinct captains who were attending that meeting. The fdny requested that we add a bariatric stretcher for those who are not able to use the normal average size. Stretchers number five was the argus cameras across the 33rd precinct in high crime and low traffic areas, which we heard referenced this evening several times and then the last one is the procurement of an all- terrain vehicle for fdny, meaning they would be able to go into. You know the parks with the with this sort of all- terrain vehicle in the event there's a fire and there's equipment you have to take into the parks. So those are our items. I'm going to leave it right here and open it up for discussion first without this is a committee activity, so our committee members can go first with their comments on these of items. Slash comments, okay, okay, so do we want to go item by item or should I just speak generally about the items yeah I mean you seem like yeah. I mean you seem like you made your rankings. Okay, so I definitely I had some trouble with the rankings for the capital items. I definitely think that the three one response system and the spanish language option should be number one. I understand we've had some serious issues with noise pollution and that the decibel readers would help to address that. It's unclear to me what a light tower is and where exactly that would be installed, and it's also unclear to me what the purpose of this all- terrain vehicle would be for right. I remember the argus camera discussion. I remember, I think there being talks of that being a high crime area for car theft. I think yeah so yeah. Those are just some of my comments for the expense items. I guess I'd want to know where these speed cameras are in the 34th or the 34th precinct like where exactly they would be planning to install those cameras. Okay, those are just some of my initial thoughts. Okay, are there any other comments for mark? Are there any other comments from our other committee members? Other committee members yeah, I mean I think they were all hard to choose among all these really important issues, and actually, even now, I'm looking- and I was like- oh maybe I'll- change, some things, but one thing I rank number one in the public safety expense items for a reason: the increase in funding to support the fdny, addressing correcting violations and enhanced fire prevention. This is mainly because I want to raise some awareness about this. I mean we live in. My building is like a tinderbox and we also have the restaurants there and the restaurants have a bad track record of following the rules that are established for them outside or visibly. I it makes me very worried, what's going on, you know in the restaurants themselves and if they're following the correct rules and regulations there, you know, I just felt that I did not want this to sink to the to the bottom. Do you think we need to add? It seems like nightlife? Is this the restaurant issue or we need to change the word from night life, establishment to restaurant establishment, or just at the word, restaurant yeah? I mean, I think, Wrestler. I think you know yeah, I mean yeah, I would say restaurant because I think that you know there are fire hazards related, and you know we've seen you know the tragedy in these villages where the illegal gas hookup exploded. You know it's just it's concerning, especially since we've had so many fire issues in our buildings. Our wiring has spontaneously combusted yeah the bigger issues. There also is like as you as we enter the outdoors the winter months. People are going to have these heaters outside the heaters yeah that they do pose a risk and I think, there's going to have to be some sort of like how do we dress that? How do we educate restaurants to ensure they have the right? The right cores and their voltages are all that stuff. So I think that would fall under this item curtis. I have another comment if I'm in just chime in so I'm not sure if this is the. If this is the right way to address this, but we've mentioned on several occasions the the what you may call it: the adding mental health professionals to the staff of the NYPD and social workers and doctors, and so I'm wondering if we could include that here, if that's appropriate Mm-, hmm, do you think, maybe reword it sorry? What did you say? It was an echo. I think just this was a separate issue. No, I think my the issue was so. It seems like that item is addressing the trainings for police officers. I guess I guess, are you asking me if the multi- agency response is addressing my question? Okay, I Wanna, I Wanna know how okay I Wanna, I Wanna know what is yours yeah? I guess my suggestion yeah. I guess I would be advocating for the hiring of mental health professionals and or clinical professionals to the NYPD staff right, which actually falls away you're, echoing Danielle. I think it's your phone, I'm sorry. I keep trying to mute myself when I'm talking, I mean when I'm not talking, I'm so sorry. I do not know why all right cool. So I added that as a new item, because I think that's important. I just I want to say I agree with that. I felt the other. I even said I felt they were a little vague to me, but I do think that that's a good addition. Okay, all righty. Okay, any other comments. Okay, sorry, one more thing! I also I know that last year we talked about, we modified an item so that it would know. I think the item that we were just talking about is the item we modified because I think originally it was. It was reading as hiring more NYPD staff. So I think in addition to so, I think I would not want to necessarily be advocating for hiring new staff, but I'd want to. I want the NYPD to be doing more of what they talked about earlier, which is like education on the streets around like bike, Safety and pedestrian safety, and just like safety, generally kind of like with the fdny point like preventing fires. I just think that, there's more that we could be doing potentially like to help prevent some of the issues, because I I'm a bicyclist myself and there have been a number of instances where I've almost gotten hit on dykman on in the bike lane, because cars are just turning too fast, so yeah. I think that we can add, expand public safety like training programs or community engagement or education programs for NYPD and Fdny yeah. I know I think that would be really good to the extent that they could go out preemptively to educate the public, also something that I mentioned. I think a while back too was or a question that I had was whether the fdny collected batteries and I think that they no longer do that. Maybe I do not know it's something that does not need to be done, but yeah. I wonder if we could bring that back. What do we want? This to say, expand public education programs on public safety issues? What kind are there particular issues you want them to cover in this public education, outreach, sort of programs- I mean they mentioned fireworks yeah I mean, I think, fireworks driving safety. I do not know bike safety. Just anything I mean. I think that this would probably fall under the NCOS, and I think somebody else made a comment earlier about the NCOS and what they. What they're doing. I forget who it was that made the comment, but I just think that, like in general, perhaps we need more NCOS, because I think that, like there are only two of them and oftentimes, they are rotated out or promoted, and so so perhaps we need to have more such that, even when one gets promoted or moved to a different sector. There's still one person that sort of remains from like a familiar face in the in the neighborhood, and I do not know so. Maybe we can address it in that way by adding more and advocating for more NCOS. So as an increase in officers, though, we're not advocating for more police officers, we're advocating for more sort of like programs and efforts to kind of improve relationships with the community, but not necessarily by increasing the police number of police officers that would do things recover, expand publication, education, programs on public safety issues, we're just we're basically just saying they should be funding. Programs NCOS should be doing this already, regardless of whatever number they have. They can add. These are low- hanging fruit items that they could easily invest in. We can easily invest in and then a mental health clinical profession is only that is adding a staff position, but it's not necessarily it's a particular type of staff person. All right are there any other items you want to add or remove. I do not know if we're going to get the actual location of the cameras just yet they were I mean. Maybe we could we could email them the accent for locations they will put them at, but I do not, I think, by the time this is reviewed and approved. They'll it'll be it'll, be something different, there'll, be something different yeah. I do not actually like the speed cameras. I mean I feel like. Sometimes, even if you go a few miles over the limit, you get a ticket and I've gotten a few of them and it's kind of annoying. I mean I understand. The purpose is to encourage people to go slower, but I wonder if we could take a different approach by installing speed humps I just I do not know. I just do not like, I feel like we have so many cameras all ready and earlier the captain palmer was talking about. You know ticketing and I understand double parking, but I just feel like I do not know just because somebody has a car does not necessarily mean that they have. You know all of this money to pay for yeah tickets, for double parking and for going a few miles over the speed limit, I mean I do not want to justify the behavior that's illegal, but I also feel, like I empathize a bit as a driver. There were some comments from our from our community members about the speed humps Claudia likes to speed, humps Bernard says speed, bumps wo not do anything so we're we are so yeah. What are your thoughts on that claudia? You want to chime in here. I know you have some thoughts on speak on speed, hops yeah, so I think speed humps are great. I think speed. Humps can help a lot with the speeding for sure. I do think that cameras have a place as well. So, on semen, for example, there's a bunch of pumps all the way down, but it does not actually deter the cars that have. I do not even know what the installations are, there's something that makes them sound like they're, speeding and they screech away and so on, but they do not actually sorry there's some kind of a an echo so yeah, I think speed bumps are really good to help with the speeding, not necessarily with the noise, but I have also heard that the speed cameras help a lot with both items. Okay, curtis, this is I've, had my hands up and I'm waiting. Okay got it. I want to jump in yes. Please say: why are the speed cameras only in the 34th piecing I've been hearing these bikes zipping up and down the whole time I've been on this meeting every night, I'm on West, 165Th Street. This is and broadway. This is a hot area. Why is the 33rd precinct not adding speed cameras? What is the reason for that? There is no reason for that. This is based on who advocates, for this is from last year, so the precinct comes to our meeting and they shared. You know this is a list that is based on a needs assessment that is done year after year, and it involves multiple agencies giving feedback on concerns that they have complaints, they've received and there's a long report, and then it makes its way it makes it makes it to this list so last year. This is the list that was that was generated last year, so to add here so and then and then we have to, and then there's a big meeting next month where, if there is there, if there are items on this list that you want to particularly like bring to the attention of the full board, then you have the opportunity to come to our general body meeting to advocate and speak on the issues okay onto this list. Otherwise, once this list becomes a bigger list with all of the committees, the parks department, the other departments, everyone has their list of items that we have to. We have to advocate at our at our committee level. What is really important, so our so our overall board ranks these items. It'll be 200 items at higher than what than what than what they're here then. What's that so are you? So? Are you saying that I should speak on this at the General Board meeting, if you feel compelled to do so? Yes, that's what I'm encouraging. I do you, okay, I'm sure and there's a few others on here too, that also live in my area. All right so is immediate. As a middle ground is, it is safe to say that we can just add speed, bumps speed, cameras and bumps in the 33rd and 34th precinct, and then, if you, if there are particular you know, locations, we can recommend them in the in you know, after the stage orlando just made a comment about how DOT does not recommend speed humps on major roadways where buses are operating, so perhaps cameras on the major roads and then speed humps on the side, roads and also somebody made a comment about them: the cameras or the humps, not addressing the noise, but just to sort of play. Devil's advocate. I think the captain mentioned earlier that the dirt bikes are not plated and that some of the cars are using these paper license plate so so yeah. I guess I just wanted to make that, but that yeah, that's just that's possibly. I think I just maybe you want to push back a little bit against the cameras. I mean, I understand their purpose. We do not want people to speed, but I just feel like I have a thing about the towers and the cameras, like I think my opinion is. I understand the cameras being near schools, but I just think if we use this as sort of like a catch- all thing or if we just overuse this, I feel it feels a little too paternalistic for me yeah, it's very big brother, I'm not a fan of Cameras either because I think it becomes a little bit buttery and if there are particular that's why you know if there are high crime areas like, for example, jump line 16, we said there was an exact location because there's an exact issue, so I think, if we're going to advocate for cameras, we have to do our research and come up with the exact research exactly located in and most certainly you know they normally should be in areas where there is high crime. There are some areas around me. I think there are cameras, I'm not sure if anyone watches those cameras but they're, but they they're there, because there it is an area that there is a lot of drug trafficking and uses use there. I think that's why I was. I understood the 155Th street in Riverside drive because it was brought to our attention. I'm recalling correctly that was like sort of a hot spot for cars being stolen, so I totally get that, but I think that we had also discussed cameras in other areas, and I think I oppose that because I just do not think we should be installing cameras just whenever there is an issue and also, I think something, an issue that I have with the cameras too, is that there is this one camera on post or a tower. That's on post and I think academy, and I think it we have not- we've been asking for a while about when that's going to be removed, and I think sometimes these fixtures go up and then we do not necessarily know when they're going to come down- and I and I understand that that's not always they're not always able to provide us with that information, but I just I fear that these things will be installed and then it will be sort of difficult to find out when they're going to be removed. Okay, so how about we do this? So it looks like you were the one you really rated it individually, the lowest. There are two ones and two twos and a three so let's see here can I can I say something about the camera thing yeah we have we have to. You can make a make your comment please do, but we have to move on and vote on these items before we end the meeting real, quick, okay. First of all, camera does not get trick. The speed cameras do not get triggered unless you speed they're, not taking a picture of you all the time. Okay, that's number one number two is speed. Cameras wo not be effective if the cars do not have license plates, so that's something to consider as well. The other thing is that speed cameras can also be outfitted with noise detectors, which will give a car a ticket for being too noisy, which could help this community tremendously. But I do not know where that, where you start that conversation, I have no clue he's, probably not at this level, cutting the electeds or something you know yeah and that I'm just trying to be quick, all right, okay, cool! Thank you, so Danielle. How do you feel about that? Do you want to do you want to make a do? You want to amend this and just go with humps. Are the other committee members in support of that? If you want to remove the word, speed, cameras or just add humps, I mean I do not know, I guess I'm wondering: do we have specific streets that we want to advocate for humps to be installed or cameras to be installed? I think we should consult. I think we should. It should maybe be as specific as that other item or the 155Th Street, or do we want to just yeah? Well, these are true. I do not know well, these are they're going to be due by the end of October, so we can. We could if we want to do some if anyone who's listening who wants to advocate for speed cameras, including the committee and humps, have particular locations, we should have that information by the by we have to turn this in. This is due. This is due. Our general body meeting is the 27th, so this was going to be due. I guess the 20th of October. We have week 2 yeah. I think I would be in favor of installing them where there's either drag racing won or where there have been deaths as it relates to folks speeding. But I think I do not support just a sort of catch- all item. That's that advocates for cameras. Okay, so should we just add that here and just to be safe, yeah, I think there's been drag racing or where there have been deaths, because it seems like that's what we're trying to address. I think that noise is not going to be addressed by the cameras and also, as somebody just said, that it does not address the issue with the drag with the with the dirt bikes or illegal cars. So I think that what we need to really hone in on what we're trying to get at okay with the speed cameras alrighty. So I so I think I think, let's go let's go through this and try to rank these speed level. It looks like we have pretty much, not consensus on any of these items. Actually, so you know. Last year we gave domestic violence a one at the committee level, it seems like we have three twos one and one so it looks like it'll be it'll, be within one two or three. Can you ask the question curtis? Yes, so in the other committee we just made, you know we just added them up and went with the order of you know like the lowest number of the highest ranking. Are we going to do something mathematical? Are we just going to? You? May add them at least a starting point? Maybe you know what I mean: that's actually a really good idea. So you mean add up, add up these numbers and then divide by the community members or divide by the number of people who have put in their rankings and then the lowest number is actually like the highest rank right, okay got it. Let's do that want to do that. I'm sorry Curtis! I just have to ask you a question. The the new you know what you have in orange, yes, health and political profession staff see. I would rank that higher now. Is that going to be ranked by all of us, or is that that's if you want to redo your ranking now? Okay, oc? Are you still there and Joseph yeah? Okay, do you agree with this process of taking the average and then ranking? Based on that, I agree. We go and use the math okay, all right. So let's all redo our rankings and then we'll do the math I can just put in a formula at the end. Okay, perfect! Thank you! Okay, oh see, I think I might have accidentally modified your rankings. Can you just double check hold on I'm checking curtis? Do we still have the 33rd precinct captain on the phone? No they're here? What is this light tower? Yeah? I think that's really yeah. That was old. I think we could delete. That was a poor particular we had it back and it did not make sense. Then it does not make spam. So I vote to remove that the white towers are what police use to light up a street if there's stuff going on whether there's an event or otherwise. If they're looking for something I do not know. If they could be, they asked for it. Oh yes, I'm sorry! Thank you so much. I remember this is a removable light tower, so you they can use it at their at their just that's what they need it. So, when they're I've seen them, I've seen them out on St Nick and I'm Amsterdam. If there's a parade that day, they have them out, usually they actually have them out. I think at the end of Amsterdam it just slowed down the drag racing. I think they're actually very useful, yeah. Okay, we I do not because we can leave it again, so these are not the same lights that they have by the dyckman houses. On the Harlem river drive, you mean on 10Th, Avenue right yeah on 10Th avenue. They usually you can have someone stand up. There perched up there looking out, okay, because I think I think the danielle the lights on 10Th avenue my understanding. It's belong to Dpr to the parks Department not like, but I'm not sure, but I'm not sure yeah. I guess I just wanted that's why I wanted clarification, because I wanted to know if it was just for lights or if it was that same sort of tower that they installed that they have on post and academy and the same one that they have on that they had on sherman and somewhere for a bit too like if it's one of those towers that the person a person can sit in or if it's just lights. I think it's a light tower and a person can be there on the top. That's my impression either way. I do not think we should erase it just because not exactly what it is exactly what it is. These tires have multiple uses, I'm reading the comments- and so somebody mentioned like if this is a block party or something they want to keep the lights on bright on the block party. If there's a rash of car break- ins on a block, that's particularly dark or something else on a block. That's particularly dark. They can ask for and assign these light towers to that block, so they can light it up better and patrol it better. For a period of time I actually spoke to one of the NCOS in the 3- 3 about it they're articulating, so they go up and they go down to be moved and most of them, I'm not sure all of them, but most of them do have a compartment in which they can put an officer on surveillance, so they're very useful. Okay, all right all righty are we are we finished with our totals our averages? Well, I think we have a little more computation happening here. You know one thing I think really needs to happen with this process. I watched the Cb10 general body meeting today and also cb9. They send out. They send out a survey to the community and have the community do the survey. So it's not just like committee led it's actually something that we're getting information from the from the community about their particular needs, and then we use that information to make our decision. I think this process needs to evolve next year. Wow. This is awesome. Yes, please do not worry awesome. Are you referring to what I just said or that you just said? Oh yeah absolutely yeah. They literally sent out like a community survey like that two thousand people in this world saying we have until the month to complete the survey particular questions by committee. It was it was actually it was well done. It calls community participation yeah, it's not the Community, Board Classic Community board process. It's a great community! Sorry curtis! Why does the fdny need these vehicles again? I do not understand the very the atv was. There was actually a situation where someone shared recently they were in. They were walking in the park. I their person may be on the line. There was someone setting fires in the park. For example, you know it's very difficult to get a fire truck to get equipment up into the park in some of the areas, so this sort of vehicle will be able they will be able to use to transport any and from any material they need when they're, when they're police, when the fire truck ca not get into a particular area. So just imagine one of those little fast- moving atv cars, but for emptying why? I can speak about that. If you like that, yes, please, I was way back in the park and it's very difficult to describe exactly where it is, but it was way back actually where my classmate Sarah Fox was found murdered in 2004, which, if you know where that is that's under the Henry Hudson Bridge. When you take the path back through the park to get to the soccer fields, I do not know at the top of Manhattan it's about the northwest corner. So, first of all, it's difficult to describe. Second of all, when you go back there, it's a pretty thin path, and so there was a mentally distressed person who was approaching people stealing their masks, stealing their hats, stealing backpacks, just you know just taking them and he was also setting fire to things. And so there were two issues there. One was he was sending fire to things and the park was at a risk of having a fire there, and I realized that in the parks in Fort Tryon Park, there had been fires earlier that week and the second issue was this was a mentally distressed person and how was an ambulance going to reach him, and so an ambulance did come eventually that ambulance had a lot of trouble getting into the park. First of all so they're at indian, Road and 214th street there would be an entrance, but there's cars that are parked there. So it had to go down by indian road and it could not. There was no way for the ambulance to get up into that area and there's no way that a fire truck would have been able to get up there. Instead, people tried to help out in the back woods with making sure there were no fires and getting the person down to an area where he could be helped yeah. So that's basically the that's one. You know perfect example of why that sort of that they advocated for that last year. Does that meet your his answer to? Could you insert the numbers mariata into the into column? E? Yes, sorry, that's already there in a in column and okay got it yeah. Oh, so there's like a tie right, so this would be ranking one. This one is two and two. Ah, oh, I moved your check. It's now column, so the we have a tie, where's the tie, 3.16, okay, so number one is mental health is the is the third one, mental health, clinical professional stats that becomes number one, because that's the lowest number right. Yes, so just take out the two and make it a number one now and then we need to decide what becomes number two and what becomes number three, whether it's the implicit Bias mental health or whether it becomes the speed camera humps. If someone wanted gabriella, she could break the tie here, but she's not here. Are there any other committee? Are you the general body general members here? No okay? Well, that's! Okay! All in favor of the of the expanded, implicit Bias mental health item being number two say: I okay hearing none. I think it seems like the speed camera is going to be number two. Okay, there you go so that becomes two that becomes three the first one is number four. I do not know. I would definitely I would want it to be above the speed cameras for sure yeah, I'm going to agree with danielle on that. I think so. That's a two and a half one and two I did not realize it was between those two items. Okay, so number two is the number two is number three. Is the speed cameras and number four? Is the domestic violence right and this is number four? Then we have another tie. We have another tie, oh yes, okay, so all in favor of so we have domestic violence and the the NYPD correcting issue correctional issue, all in favor of keep it as making number the domestic violence issue, as number four say: aye. Okay, that was that two that's me and who and someone who else was the second person Mariella all right. This may not help us, and so we have how many people in the car one two three four, two three four. So we have five people, so it's only two people, so I guess number four is going to be. It becomes this and this becomes number five. Then this is number six. Does that seem accurate to everyone yeah, and we only have one tie on the bottom list for the sign up for number six. So this is number one. This is number two. No one more down. Wait, I'm sorry! What did I do something wrong? You put three in the wrong place: yeah, that's three! Okay, so number five light tower or terrain vehicle. My vote. I vote for terrain vehicle as num as higher than the than the light tower. I do also Mariella. I agree, Curtis. Okay, so that's three people three out of five okay job well done! Okay, so this is five and this is six alrighty cool I'll submit these to the office. Thank you all. It is now 9 51.. Are there any items for announcements or new business here? Hearing none! The meeting is officially adjourned. It's 9 55. enjoy the debate tonight. Everyone all right thanks! Thank you thanks! Thank you, you're still, there Daniel. Oh me! Yes, hi, that's so funny, I was like that's so funny. I was like get too. I do not there's only one time. I've ever heard that name in my life, who is this woman.",
            "summary": "The fdny did partner with local law enforcement NYPD and the sheriff's office to tackle the distribution of illegal fireworks, and.\nThink that it, you know, added to the fact that there was an increase of illegal firework activity throughout the city.\nBut again you know we did work with our local law enforcement in terms of just mitigating and trying to mitigate as much as possible.\nThink One aspect that the fdny wants to do is work with civic and community- based organizations to do education and outreach well in advance of the fourth of July, maybe even targeting June and may because beyond just the prevention issue of targeting the distribution, I, think it's an education and alerting community residents of how to report illegal fireworks to the fire marshal task hotline that we have and, in addition, fire for safety presentations in local neighborhoods to basically educate the community residents.\nAgain, we are more than happy of partnering within the years to come, with the community board to basically spread that message in advance and work to basically to mitigate that issue in advance of the fourth of July season.\nThink when it comes to the issue of enforcement, I would say at that: Point: NYPD would be taking the lead and with our assistance in terms of really you know our fire marshals enforcing where they can within fire code and fire Code, Regulation.\nI. Think one of the big issues that we have to figure out is: How do you disrupt the pipeline interrupt the pipeline because it seems like people are buying illegal fireworks from somewhere They ca not buy them from New, York state, so they're?\nSometimes community residents do report When people do respond, the issue of fireworks.\nThat's a long- standing problem that all agencies when it comes to law enforcement are really tackling I mean again how to resolve that, I think, is just educating residents on how to report out on the dangers of fireworks and basically how to work with local law enforcement to really address reoccurring issues with within neighborhoods.\nMy question is I understand that the mayor wanted to disrupt the distribution into the city, but that was not what the issue was.\nThe police would drive by acknowledge that they were being set off and do essentially nothing to stop the setting off of fireworks It was hell and throughout northern Manhattan You mentioned outreach starting in May, and you know by may.\nAs a lawyer for a long time and the NYPD might answer this in connection with the fire department setting up checkpoints at toll areas from neighboring states that can be done in a legal on a legal basis random, but according to a plan where cars get checked and that might very well be deterrent.\nSo in terms, I could not really hear the first part, because the first member who who was asking questions Broken up a little, but in regards to education in terms of advanced, you know our fire Safety education unit that really provides year- round education on all levels of residential fire, safety, and I.\nI, think I just put may just because, typically, when you look at fireworks and historically throughout the year, the months leading up to the fourth of July, usually around May and June, where you see the most firework activity around the city, I mean if we want to work a lot.\nI, maybe educate the community to call in and to you know, report.\nYou know the issues of fireworks are overwhelmingly high and especially around the fourth of July, again having to deal with issues at the point of explosion to report out.\nI you know, I ca, not imagine how many units, or how many calls are coming in at one time, especially in the neighborhood, where at point of explosion, there's a lot of reports going on.\nYou know, I, think essentially, and it may be something to consider with operation- How do we enforce right around those holiday seasons where you do see a spike in fourth of July , Some level of presence or enforcement and again how that would look like and what we could do from an operational level?\nWe are going to be discussing this at the health and Human Services Committee, I'm, Steve, Simon, Like I, said earlier about this issue, which is going to stay on both of our agendas as we work towards the early winter to hopefully have some sort of recommendation in the form of resolution for to share with the enforcement agency.\nSomething to consider is maybe a sit- down conversation to get a better understanding in terms of operations from our Bureau of Fire investigation, And I think, having an open- ended conversation with both committees being that this is of interest, and we do welcome the support and looking at which ways we can potentially augment education or some level of operations other than just education.\nAnd I would also welcome, even maybe a joint task force or even or committee, made up of both fdny and NYPD to basically look at it on the local level, because I again, I do not want to speak for NYPD, because NYPD is on the call, but I think all emergency response and law enforcement agencies could essentially work together.\nWe're working on that there's one flyers from the squad and the NCOS are working on that glas were up 140 12 versus five last year, like I , said the last time these dlas were giving these perpetrators opportunity to steal our cars of the 12 glas.\nMaybe they feel that leaving the car on notifies the traffic agent or the officers that oh, that we're nearby- You know for a couple of minutes, which they should not do because again it's an easier opportunity for these perpetrators to steal.\nIs there, any systematic connection with the crime prevention officer to follow up and secure apartments of people that have been burglarized so that the building itself and the places that have been burgled are really secured, because we do know that burglars tend to return to areas that they feel comfortable.\nWe're going to try to spread that news around and let people know that there is a service that we not a service, but our crime prevention officer will do a survey for you.\nI know I'm the secretary of the 34Th Precinct Council I saw her on twitter the other day that the 34th precinct has been confiscating the illegal speakers and summonsing people.\nWhat's going on with these drag racers, it's like they're doing this with impunity, because they know that the police are not doing anything.\nSo, it's very hard to track down these vehicles and the speakers as far as the illegal dirt bike I drive around myself even I'm hearing with my windows, clothes, an air purifier and an air conditioner, and I'm hearing them Just saying that by the time the police officers get there they're, not at the scene that they were dispatched.\nThere's elderly people crossing the street and they ca not jump out of the way when they're seeing a dirt bike come zipping through a red, light.\nIf you chase this motorcycle with a police car with lights and sirens, it's only going to cause them to drive even more right.\nWe try to as best as we can gather as much intelligence about the groups as we can, including body, worn camera, video and or Argus camera videos, or any other video that we can get so that we can identify these perpetrators and arrest them at a later time, when it's safe or When, we'll put alarms out on them personally, so that if they encounter the police at a later date, we know we have an open case against them for reckless endangerment for operating these vehicles in a reckless manner, and as best as we can, we try to target, especially when we have the large groups.\nThis is probably a longer answer somewhere down the road, but I think it'd be worthy of considering task force, whether it's a joint task force with state police, denmark, cars, when these guys are getting reported, traveling north at 155Th, Street on Broadway, and you can activate a task force to 165Th Street and as they approach they're blocked, then they have nowhere to go.\nI know this is beyond your, but I think you know as a as a public safety committee as a community board, we should take a stronger stance on the legality of these vehicles, making them illegal Wo, not hurt anybody, they're they'll, save people.\nI would say that you know if you're, if you're, when you talk about the enforcement, it actually helps with the enforcement, because, instead of chasing people and confiscating them when they're committing an illegal act, just the possession becomes illegal.\nI'll, get into that in a second grand larcenies again What we're seeing are the exact same issues, construction, sites, windows or people of You know when not windows, doors at residential buildings, where people are going in and going into the basement and stealing tools.\nSometimes I reiterate what captain Chung said: They people believe that if they leave the car running and step inside a store very quickly and they have the key fob in their pocket that the vehicle can not be driven, away.\nWe've been aggressively kind to trying to enforce these unattended vehicles by issuing summonses quickly and in the traffic area.\nDo you have a mechanism to sort of force supers to install these these boxes, if they're buildings that have been identified as high crime or heart , I would encourage your super to you know to reach out to our crime prevention officer, and we can discuss what we believe is, and they will go through your building and do a survey and give suggestions and recommendations on how he can harden that building to make it less susceptible to someone coming in off the street and and stealing packages.\nYou do not recognize someone just do not let them in, and I will tell you from personal experience with 25 years in policing if I need to get into a building in a hurry for an emergency I'll hit every button on the on the panel and sooner or later, someone's going to just open the door without even knowing who it is so.\nIt could be such a simple thing as stealing a package, or it could be someone that has an order, protection against someone in a domestic incident What we do and not just arbitrarily open doors or allow people to come in when we do not know who they are or what their status is in the building.\nI mean if you want to come down and have residents come down into the precinct, we can make an appointment with your with our crime prevention officer and discuss things specifically for your building that works for you, because every building is not the same.\nA hard look at that and say work to improve I do not want to use the word forcing, but in a way forcing the supers to comply with your recommendations, because I think you can do education, but I think that even but sometimes people are still going to you know.\nYes, Barbara, as a matter of fact we're planning another operation like we did the last time we had to kind of take a backseat to that, obviously, because of the issue with resources in Colvin 19, but now as we're trying to normalize we're actually setting up another operation, hopefully we'll get it done next week with with our tow operation.\nAs, you know, our community has been mainly invaded, I believe, from the outside this summer by the people that generally cause the noise and mayhem.\nTo answer your question about the hot spots, we definitely have a list of hot spots that we consider that were that were really problematic during the summer months, especially once the city kind of semi opened back up to the public on those areas were usually on the later.\nI push my problem on someone else, but you know my border stops at the bridge, so you know if they decided to go into the Bronx that no longer becomes my problem, but you know in all seriousness, though it You know throughout the whole summer, Now people are kind of you We do not have the speakers and the parties, Up parties like we Your other question on about the issue park over there.\nAnd my question was basically that this was what I did was drunk people causing a fight like, even if, even if there were not things being thrown around, which is what we were You know.\nI know this month is domestic violence awareness month, And, that's a big issue for them.\nWe have been getting a lot of complaints via calls and emails from the community on the very issues that you've been discussing, tonight, including the drag racing, the noise levels, the concerns that the respective piecings are not being very responsive.\nYou know the drag racing, the Pedestrian safety issue, the speeding, all that all that stuff that has been occurring in our community.\nI've, reached out to a 34 person several times about it, and you know, like the one of the representatives said like when they come, they it's actually the people are gone.\nWe, are equipping our community with resources and knowledge on the issue of domestic violence, which was not really discussed in great detail by the precinct.\nThey worked very closely with ADA professional staff in my office to come up with this campaign, and I'm just sharing it, because it was very refreshing even for me, and I would love to see more people from the Washington, Heights and Inwood community.\nIt is a city- wide issue, and because of this, we are working very closely with NYPD to host a gun, buyback, event.\nSo we could have a more fruitful fulfilling conversation on what we want, our numbers to be as a committee, and also to think in advance about items we need to add to the list.\nStretchers number five was the argus cameras across the 33rd precinct in high crime and low traffic areas, which we heard referenced this evening several times and then the last one is the procurement of an all- terrain vehicle for fdny, meaning they would be able to go.\nYou know the parks with the with this sort of all- terrain vehicle in the event, there's a fire I'm going to leave it right here and open it up for discussion first without this Is a committee activity.\nI guess I'd want to know where these speed cameras are in the 34th or the 34th precinct like where exactly they would be planning to install those cameras.\nOther committee members I mean I think they were all hard to choose among all these really important, issues, and actually.\nYou know it's just it's concerning, especially since we've had so many fire issues in our buildings.\nSo I think that we can add, expand public safety like training programs or community engagement or education programs for NYPD and Fdny Preemptively to educate the public This to say, expand public education programs on public safety, issues?\nAre there particular issues you want them to cover in this public education, outreach, sort of programs, I, mean, I, think, fireworks, driving safety.\nThe purpose is to encourage people to go slower, but I wonder if we could take a different approach by installing speed, humps And I understand double parking, But I just feel like I do not know just because somebody has a car.\nDo not want people to speed, but I just feel like I have a thing about the towers and the cameras There are high crime areas, like, for example, jump line.\nI'm, recalling correctly, that was like sort of a hot spot for cars being stolen, so I totally get that, but I think that we had also discussed cameras in other areas, and I.\nSo should we just add that here and just to be safe, I think that noise is not going to be addressed by the cameras and also, as somebody just said, that it does not address the issue with the drag with the with the dirt bikes or illegal cars."
        }
    }
}