{
    "YoutubeMetadata": {
        "author": "MCB12",
        "channelId": "https://www.youtube.com/channel/UCeDiMzJEUbPgaruDcXnD4Cg",
        "title": "Traffic \\u0026 Transportation Committee Meeting",
        "publishDate": "2020-06-01",
        "shortDescription": ""
    },
    "metadata": {
        "ID": "String",
        "creationDate": "datetime"
    },
    "CommunityBoardInfo": {
        "communityID": "MCB12",
        "normalizedName": "Manhattan Community Board 12",
        "twitterName": "Manhattan CB12",
        "youtubeChannelName": "CB12M NYC",
        "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
        "twitterHandle": "@MANCB12",
        "dateCheckLast": "9/13/2020",
        "status": "live",
        "Unnamed: 8": NaN
    },
    "properties": {
        "fullTranscript": "In our community board district, I'm gonna, let we I see, we have a lot of names, jennifer, hi, mabel, jess, jesse, lyle, I'm sure I'm missing, jackie, lazaro, and- and so, if you guys just you know, introduce yourself to so omar, you can grab the names and all of that- and I will hand it off to you. Thank you for being here. Thank you, debbie, first, just to introduce myself good evening, everyone. My name is jennifer santenez and I'm the Manhattan deputy borough, commissioner, with the new york city transportation, department of transportation. It's really nice to see many of your faces, and you know hear your voices it's nice to feel connected in this way and first I just wanted to take some time to extend my regards to everybody joining the call. I hope that you and your families are healthy and staying safe, not only through the last few weeks of the pandemic, but especially throughout the last few days of rallies, protests, community uprising and community togetherness. So I hope that everybody continues to stay well. I wanted to thank community board 12 for hosting us tonight to share our plans to expand city bike into northern Manhattan. Thank you to all of our elected officials, the bro president's office, councilmember rodriguez's office, senator jackson and all of your elected staff for your continued support and partnership and feedback on all of the DOT projects that we've worked with you on so far, and thank you to all of our neighborhood partners and community stakeholders we're looking forward to hearing your feedback after we present our plans to you tonight. Our partner lyft has been busy installing new stations across community boards, 9 10 and 11 in Manhattan, as well as in Bronx cb1 since last month, making citibike a four borough bike share system. So that's very exciting and my colleagues at DOT have also been hard at work with remote setups at home. As many of you are also teleworking to come up with a network plan that will provide residents in cv12 with access to this safe, healthy and affordable option of bike share. So, as I mentioned, and as debbie mentioned, we're here, to get your feedback on our proposed station locations around the district and we're focusing our presentation tonight on the southern portion of the board from 155th street to 184th street we're going to take the feedback that you share with us tonight, make adjustments to our plans over the next few weeks and start to install these stations over the summer and we'll return to the board to present our plans for the northern portion of the district later in the year, with those stations being installed next spring. So I also want to introduce my colleagues who are joining me tonight from the Manhattan office. You know lyle, blackwood and jackie lazaro and from the bikeshare team we have lisa marasco, jessie, cabrera and mobile kessler, who is the expansion planner for the bikeshare group and she'll, be running through the presentation tonight and sharing her screen and without further ado I'll go ahead and hand it off to my bell. Thank you, jennifer and thank you all for joining us tonight, and so I will share my screen now. Oh, I it says it's disabled currently for me to share the screen so debbie. Is it possible or ebony? Sorry, I was on mute, yeah ebenezer. Can you get mabel wait? How do you say your name, your first name belle yeah. Then I didn't do that right to start okay, so she can share her screen. Let me give one more try because I thought I could do it. You have to make her a co-host. Okay, we we're working on that now we're working on that. Thank you. Ebenezer hi, gerard greetings, deb, sorry, hello, hi! All okay- and one thing I want to note- is that while this is getting set up, the presentation and the draft map are both available online at our website at nyc.gov bikeshare, and we can. We can give you the link after the presentation is done very good and I think mom bell. You should be able to do it. I think you're, a co-host now so, okay, let me try. Let's see, okay, I think yeah, okay, my bell, you are called holes, you did it okay, good yeah. Can you can ever? Can everyone see my screen? Yep great all right, so thank you again for joining us to talk about bike share in washington heights and, first I'll, just start off by going over the basics of bike share and the city bike program in new york city. So bike share is a network of shared bicycles. That's intended for point-to-point transportation. It helps increase mobility, giving people more options for getting around their neighborhood or for connecting to other modes of transportation. These systems operate 24, 7, 365 and there's no worry about bike, storage or maintenance, because that is taken care of by the bike share company and as we move forward, we're always mindful of our environmental impact and bike share is a good way to move around the city emission free, so city bike is new york city's bike share system. It's a private public partnership between the city of new york and lyft new york city d.o.t is responsible for the system, planning and outreach. While lyft is responsible for the day-to-day operations and equipment, no city funds are used to run the system. All funds are generated through memberships and sponsorships. Citibike is a station-based system made up of a network of 900-plus stations where users can pick up and drop a bike drop a bike off at any of the stations within the service area. The stations are solar powered. They are not hardwired into the ground, meaning that if construction or another issue arises, stations can easily be moved stations, are module modular and can be placed on the sidewalk or on the street, depending on a variety of factors. So last week we actually celebrated citibank, celebrated its seventh anniversary, which is pretty exciting. The program launched in may of 2013, with 330 stations and 6000 6 000 bikes that were located in Manhattan below 59th street and downtown Brooklyn, as shown in the light blue on the map. Starting in 2015, we began expanding the system to more than double its size by the end of 2017, as shown in the royal blue, the phase two expansion area included the upper east and west sides of Manhattan. We went deeper into Brooklyn into neighborhoods, like red hook, and we went into Queens for the first time into long island, city and astoria. So we are currently in our phase three of expansion, which began in 2019 and will continue through 2024, doubling the existing service area. This expansion will cover the rest of Manhattan. It includes the Bronx for the first time and goes deeper into Queens and Brooklyn to neighborhoods, like elmhurst and sunset park, and the program has seen incredible growth in the year since its launch in members and rides per day. The program has over 150 000 members annual members and routinely sees over 90 000 trips a day during the busy spring summer and fall months since launch. There have been over 98 million trips taken, which is a testament to its popularity and shows that it's a mode that new yorkers want and use. There are a variety of pricing and membership options from annual to casual to one or three day passes as well as single rides. The single ride option is three dollars and gets you 30 minutes of bike riding and once you dock, there are no additional recurring fees. There are day passes and three-day passes that give you unlimited 30-minute bike rides over the course of a 24-hour or 72-hour period, and the annual membership, which is about 170 a year or 15 dollars per month, gives you unlimited 45 minute rides. Citibike also offers discounted memberships for certain groups. The reduce fair bike share program gives NYCHA residents and snap recipients access to city bike for five dollars a month with no annual commitment. In addition, there are also partnerships with community development credit unions, which also gives members access for five dollars a month, but there is an annual commitment so, as citibike expands into more neighborhoods, we want to build awareness that this is an available transportation option for those who want to use it. Citibike has different community partnerships and programs to help encourage ridership in low-income, neighborhoods and underrepresented communities. One program is the lifta partnership with the ymca that gives a free year of city bike to eligible 16 to 20 year olds. Lyft also has community grant program that distributes grant money to non-profits and other community-based organizations that can be used to fund programming or events or activities that help spread awareness and encourage ridership. So, as the city grapples, you know, with the spread of covert 19, d.o.t is working closely with city bike to ensure that new yorkers have a safe way to get around town and lyft, and the DOT are working together to ensure that there is an increase in cleaning efforts at depots and operation vehicles, as well as near high use medical facilities and understanding that access to transportation. You know that is socially distant and convenient is crucial for essential workers in march, lift in partnership with the city of new york launched the critical or the city bike critical workforce program, and this program provided eligible members of essential services with free annual memberships. The deadline to enroll in that program was may 31st. So next I will be talking a little bit more about our planning process and the public outreach process for the citibike program. So, in order to have a successful system, we need a high density of stations in the program and in planning the system. This is we maintain a network density of 28 stations per square mile so that, wherever you are inside the service area, you are never more than three to five minute walk from a station. We aim to have a station approximately every three to four north and south blocks and every major crosstown blocks with larger stations, near transit hubs or key destinations, so public outreach and along with our technical siding criteria and the network considerations, help determine where stations can be placed and some of the siting criteria we take into consideration: hydrants utilities, ada accessibility, among other factors. So you know, as with our other expansions, we wanted to know where residents of washington heights wanted city bike stations, so we held a community board workshop to gather feedback on location preferences into and then, if presidents weren't able to make that we also held three pop-up outreach workshops throughout the neighborhood at various community facilities, and there was also an online feedback map where people could drop pins, also stating their preference for locations. We also engaged with major stakeholders, like hospitals and other city agencies, to receive additional input so shown here we have the map that was presented at the cb12 workshop and you can see. Participants were asked to place, yellow and red stickers to indicate where they wanted city bike stations to go, and so taking all of those comments through the outreach we synthesized them and you can see in the dark blue circles is where there was higher community preference for city bike stations and we also in creating the draft plan, tried to eliminate sites that were unpopular or might be an issue for lyft operationally and those are shown in the in red on this map. So we combine this information to create a draft plan map which we will review and go into more detail a little bit later in the presentation. But first I just wanted to reiterate some of the things that jennifer mentioned at the beginning, that we will be installing in this community board in two phases, and so this summer we will be installing from 155th street to 184th street 30 stations and that's really to create a contiguous service area across upper Manhattan and the Bronx. As you can see in the accompanying map, we will be moving to the Bronx after washington heights and then coming back to fill out the rest of the community board next spring. So, following tonight's presentation we will take additional feedback and make adjustments where we can to the draft plan and then we'll create and release the final plan and from and that at that point, lyft will conduct door-to-door notifications to adjacent property owners to inform them, inform them of station installations and record any concerns that might come up and even after stations are installed, we will continue to monitor and take feedback. So if any concerns arise operational concerns, we can coordinate for any follow-up actions. So now we will move on to the last portion of the presentation and we will review the draft plan sites and, as mentioned previously, this first phase of installation will be from 155th street sorry to 184th street, and I also wanted to note that the draft plan presentation is available online at our website at new york city, DOT, gov, slash bike share under the maps and plans tab for easier viewing, so now I'll review the draft plan sites more closely. So the next three slides are close-up maps from 155th street to 184th street. So please bear with me and I'll just list out each location and then there will be time at the end to talk about any questions for any particular sites and then to review the symbology on the map. The orange squares represent roadbeds locations. The light blue triangles indicate a station. That's planned on the sidewalk along the curb line and the and the dark blue indicates that it's a sidewalk station along the fence line or a building line. Sorry, okay, so I will start on the southeast corner of the map, and so I will just. I can also point them out with my mouse if you're able to see that, so we have a station plan for the west side of saint nicholas avenue south of 157th street, and then in that it will be a sidewalk station along the curb line we have a sidewalk station. Maybe I think it. I keep getting a pop-up sorry about that. Have a station plan for the east side of amsterdam, avenue south of west 156th street also on the sidewalk, but along the building line there moving west, we have a station on the south side of west 157th street west of edward morgan place and that is a road bed station and then, as I'm sure, you're familiar there's a street improvement project along much of this area along riverside, and so we will be coordinating two stations in this area following further coordination with community board and residents and other stakeholders for that project, and so moving north to broadway. On the east side of broadway south of west 160th street. We have a sidewalk station planned along the curb line: moving east to the south side of west 159th street west of edgecombe avenue. There is a sidewalk station planned for the curb line: moving north to west 160th through 160th street east of saint nicholas avenue, roadbed station planned there and then moving north to the west side of saint nicholas avenue, north of west 162nd street sidewalk station planned along the fence there on the south side of oh sorry, in the north side of west 163rd street west of edgecombe, a roadbed station planned and the last one. On this slide, a sidewalk stationed along the fence line planned for the north side of west 163rd east of riverside drive all right now. Moving to the next slide, we can start at the southwest corner. We have a sidewalk station planned for the curb line on the south side of west 165th street east of 4th fort washington avenue and then a sidewalk station plan on the curb line for the west side of broadway south of west 165th street moving north to mitchell square. We have a station planned for a roadbed station, planned for the west side of saint nicholas avenue, north of west 166th street moving east to edgecombe, a roadbed station planned for the east side of edgecombe avenue, north of west 167th street and moving west a sidewalk station planned along the building on the east side of amsterdam, avenue north of west 167th street and then moving west. We have a station installed that was coordinated along with columbia, presbyterian, and this is the station, I'm sure you're, all familiar with on the south side of west 169th street west of fort washington avenue moving north to the south side of west 177 171st street west of saint nicholas avenue. We have a road bud station planned and then moving to high bridge park. We have a station planned for the road bed on the east side of amsterdam, avenue south of west one second 172nd street and then final station on this map is a sidewalk station planned for the curb line on the east side of fort washington, avenue south of west 173rd street and then now we're at the northern portion of the area. So I will start at the southeast part of the map. We have a sidewalk station planned along the fence line on the east side of amsterdam, south of west 175th street moving west road bed station planned for the east side of wadsworth avenue north of west. Once on the fifth street, another roadbed station planned for cabrini boulevard along the median there north of west 177th street, moving north a station planned on the road bus station on the north side of west 180th street east of fort washington avenue. Then moving towards the east side. We have a station planned for the west side, a sidewalk station plan on the west side of worth south of west 179th street. Another sidewalk station planned on the east side of audubon south of west 179th. Moving to the park again on. We have a station plan on the east side of amsterdam, north of west 180th street along the sidewalk and then going back west a station planned on the east side of west or sorry on wattsworth avenue, north of west 183rd street along the sidewalk. And then the final station for this draft plan is the road bed on the west side of fort washington, north of west 183rd, and then I think I actually the last one is on the east side of cabrini boulevard north of west 181st street, and so that's what those are the draft plan sites and so now we're available to take any questions on the city bike program or any sites in particular that you may want a little bit more elaboration, but thank you for joining us and for listening to the presentation all right. Thank you mobile. That's a lot of information. I imagine that some of the questioners will want you to sort of pitch to one. You know one of the three. I think your three different maps so we'll do the best we can. I am gonna ask: could mobile stop sharing her screen, because then people will be able to see my clock when I hold it up. Well, although I think we're gonna need, we might need this screen. I can see you jim. So actually, let's see if this works, because I've got you on my grid but I'll. Let you know if I lose you so first I'll take questions and feedback from the committee. We are gonna, try to be pretty strict about two minutes per comment and if I could, let me just see, I think we have and I'm sorry that I'm not, I don't know the order, but omar, do you want to kick off in terms of questions? Yep, no problem. The first question I have is because northern Manhattan is the hilliest portion of Manhattan. Will there be an adequate amount of electric city bikes offered up here, meaning a proportionally higher amount than there is in the wrestlemania, because those are limited in the rest of Manhattan, because certain parts of my hand only have a slight slope versus up here. You can see that there's a big gradient difference when you go from say fort washington and 100, and well yeah for washington and 190 and broadway 190.. That's a very big difference in grade. So that's my first question, then. My second question is: there's three different types of installations that were shown on the map. Can you walk us through? What are the differences between those meanings? Specifically, which one of those docstation actually removes parking spots, because that's the biggest kicker for our neighborhood is anything that threatens parking spots. So I can start off with that. First, questions about e-bikes yeah so for e-bikes, lift plans to add more right. Now, there's about a couple hundred e-bikes out in the system, let's plan to add by their count thousands of more e-bikes into the system by the end of the summer, the e-bikes naturally just ebb and flow from you know one part of the system to another part of the system, but we can make sure to tell this that the board requested that there might be some additional rebalancing of those e-bikes, especially in somewhere, that's as hilly as washington heights and inward. Yes, thank you. That'd be one of the high priorities that they continue to replenish e-bikes at a higher rate up here, because of the disparity in the in the neighborhood in terms of height difference in elevation gain okay and then the question about the parking who's going to take that yeah. So I can quickly talk about that. So I'm just going back to previous slide to just show, so the squares are the roadbed locations and the triangles are the sidewalk locations for the map. We currently have 13 road bed sites. Sorry from I think, I'm remembering correctly and the remainder are sidewalk sites in this area, with two stations still waiting to be determined. The two stations for the area under you know with the street riverside street improvement project there right and mobile. If I may, I did want to just underscore a point that you made about the difference in how we you know. We divided the sites here, omar for the majority of stations that we have planned. We have 30 that are proposed for this portion of cv12. The majority of them are planned for the sidewalk and in spaces that do not remove parking, because that was absolutely something that you know. Dot is aware of that. It's a priority and very important to the community board, and so we just wanted to make sure that we balanced your needs as well as the needs to create you know a meaningful network of bike share stations. Great. Thank you. Thank you, ebenezer. Do you mind? We have two or two people that need to be promoted: kiana diaz promoted to panelists, as well as one of the phone numbers, three four seven that begins three four, seven, four, six one. If you could take care of that, I would be most appreciative. I just heard from juana luna that she wants to be in some position where she will be able to speak at some point. Oh of course, no we will absolutely I'm sorry I should have. I should have said that more specifically, once we hear from the board members, we will move on to the attendees and we will get you unmuted and ready to talk when we're when we get there. So thank you for that reminder. So, yeah jim, did you have a question or comment yeah. I just wanted to sort of well, I have a question and then I want to jump on top of exactly what omar was talking about because of the topography of our area. We actually probably have fewer parking spaces than other areas. I never did an exact thing, so our parking, you know spaces are contested. Let's put it that way, and I see in the immediate area of where I live, which is on cabrini. There are three bike stations that will be, you know in the street or whatever you want to call them, and I presume they will remove parking spaces, and there will be much anger about that. So the and the three I'm specifically talking about the there's sort of a triangle south of bennett park, the w and then bennett park, the e at 180, first and cabrini, and then the one at 180th and fort wash again. If I were, you know in tr- and I didn't time myself shameless, but I'm going to stop as soon as I'm done our criterion up here is we don't want any parking spaces removed period because anywhere you remove them? People will be furious and this is not a good time. Of course. No, this is actually going to happen soon. This is not a good time to get people furious. People are pretty cranky at the moment. Thank you. Okay. I just had sort of one and a half questions just on that mitchell square location. That is presumes that the d.o.t work relative to going to one direction rather than two-way. In that section, around mitchell park happens. Do you know what I'm saying like that station is presuming that that's then a one-way street with all the changes that were approved so that station is planned to be along the bike lane on saint nicholas avenue on the west side there. So it may be a little bit unfamiliar. So I'm happy to jump in here, and I know I think debbie your office might be right across the street from that location on one on st nick and 166th street. What we're thinking here is exactly what mobile had mentioned is that the station would be installed in the road bed in the parking lane adjacent to the bike lane closer to 166th street, but our field staff did find, and we all know that, there's the ongoing construction- that's happening closer to 168th street and we can continue to coordinate with dbc to see if there's any way, once construction wraps to see. If we could utilize that space and decrease the potential parking tick in the area, no, I no my point's a different one, which is that DOT proposed all these changes to that air yeah and on that block, there's. Actually it's creating a lot more room to do things, because it would be going one direction, so it's adding like 20 parking spot whatever. So all I was saying was like this is contemplated for the new world of that block right, not the old world. Yes, we do coordinate with our other units as well, right, okay and then the other thing that I think might be helpful and then we'll open it up to the other board. Members is at least for me, is you know you talk about sort of the flexibility of these installs are done in a way that there are problems and it did need to be removed that it could be. Can you give us examples of like when that's had to happen, and you know and then and what were the circumstances, because I think sometimes people feel like well, you do something and our experiences is. It gets really hard to undo things so if there was an issue like what's an example of what that's looked like and what were the circumstances yeah. So, as you know mentioned in the presentation, any construction projects that come up that might impact the footprint of the station, whether it be on the sidewalk or the road bed. We coordinate to relocate the station for that construction and in most cases the station does go back to the plant or sorry to the permanent location location of where it started other cases that we've shifted stations if there have been operational issues that arise if issues with with trash collection or if there has been anything that the neighboring building has like highlighted as something damaging their operations and DOT reviews. Those and in those cases in some of those cases, we have been able to to change the locations there. All right based on on needs as well. Thank you before you go on. I did ask a question and it wasn't answered how many parking spaces do these in-road things remove. So we don't have the exact number of parking spaces, but we do. There are 13 stations plan, roadbed stations planned for the area and their average for the whole area. The average station size will be 25 docks, but we don't have the parking tape. Well. How many parking spaces is 25 docks? This is a fixed length. How much is it so we each dock is about two and a half feet, so you can do the math, so I think we do have some of those average numbers already worked out. So I think, as mobile said right, the average station size would be approximately 25 docks across this area of cb12 and that pretty much equates to, I think, approximately 65 to 70 feet, and that depends on whether or not there are utilities in the road to bridge or what not so the station could be longer, but there are situations and sites where we are able to decrease the station size. You know if there aren't any utilities on the ground that we need to quote-unquote bridge. I do also want to say that jim and debbie and omar, we hear you that parking take is definitely a very serious issue across the district and we tried very hard to balance parking take and you know utilize the available and feasible sidewalk spaces that we did identify but parking removal here for city bike expansion into cb12. It you know, can't be avoided, and so we really tried where we could to find feasible sites that didn't remove parking and where we can, we can look to. You know continue that when we expand further north into cb12 all right. I guess that would beg one more question from me. So let's say you described a situation where something didn't work out and you needed to move it, remove it whatever. But what happens if a particular station doesn't end up that utilized so because 25 ducks sounds like a lot to me like? Is there ever a scenario where that 25 dock station becomes a 12 station, so the minimum station size that we have is 19 docks operationally? We can't have shorter stations than that and sorry, okay, I don't know if I had some and then as the system grows some stations but the patterns for ridership changes and so some things that might be at the northern portion of the service area. Currently, once we start expanding northern, we might see shifts in the usage patterns for those standards and typically it is a little more challenging to rebalance those the stations on the edges of the service area. So you know, as things grow and as things change, those ridership patterns change a little bit and those are things that we're monitoring on an ongoing basis, and so it's hard to say one way or another. I guess what I'm saying is a station is successful, given, like a you know, maybe a short amount of time frame but yeah. So as the system grows, we learn how stations behave and how people behave. Okay, I see gerard yeah well, two questions, one. I would think it would be quite possible to actually make some kind of a visual footprint a little graphic for each of these locations, so that non-technical people just regular residents. That would be curious and would like to understand what you are proposing, certainly in terms of parking spaces loss. I think that's a very doable thing and actually you know, should certainly be part of your submission for consideration, and, secondly, would it be possible for us to have reporting on a monthly basis with the technology I would. I would. I would guess, presume that you'll be able to track just how much bikes are being used up here, so that if we, if the use and as kind of debut is alluding in the cases where, if it doesn't, you know really require a lot of bikes that a reconsideration could take place because, as jim was saying, we are in a very parking stressed. Neighborhood and people are, you know, really shouldn't lose spots if it really, if there isn't the value there. So I think that's up to you guys to show the value, the added value and the value over time. I think that would be very appropriate. Thank you. Thanks omar wait. Jim do you also have a do. You have a second round question no my hand, but I do have a comment. I did some calculations. It turns out parking spaces are required to be 18 feet, long like the distance between what used to be parking meters, and that means 60 65 feet is 3.6 of these spaces or basically four spaces. So each of these bays will take away, presumably about four parking spaces. I did that calculation. Thank you all right, omar! Did you ever you had a another question yeah. For me, it was more common than anything else. I've been actually a city bike member since 2013, since this thing first launched and the only reason why I didn't renew after that was because there was no reach to where I lived. So I was actually kind of double dipping into paying for a metro card and a city bike, and it just monetarily didn't make any sense. But now, with this expansion coming up here, what this at least allows for me, especially in this environment, where I don't know. If I can trust going back into a train system anytime, soon, like literally anytime soon and as soon as we get called back into the office city, bike is probably going to be the primary way that I actually come from home to work and back. So this is coming at a good time, considering that all the issues that we're having with the mta the unknown, recovered and kind of trying to avoid being put into a situation where we're constantly being established into an environment and being shepherd downtown. This gives another opportunity where you can actually do it. You know outside and not have to do public transportation in a different way. So that's just my comment on this in terms of what the new world might look like. It's welcome, at least on my end. It's welcome. Now. The challenge is again balancing the parking issue, because the one question I had is if there is a roadside dock, what prevents that roadside dock from being converted to a sidewalk dock like what's what prevents that process just for at once kind of fyi yeah. So there we have different technical setting criteria and we there are minimum sidewalk widths that we need to that. The sidewalk needs to be minimum with for it to be viable for a station to keep that ada accessibility, other factors are utilities or you know, like gas or water utilities, on a sidewalk that we cannot place a station over, and so we need to keep access to those clear and other factors are tree pits that prevent us from you know from installing stations or other street furniture gotcha. Thank you, okay. Thank you with that. I think we are ready to. Please ask a question: debbie. Oh you, oh yeah, and then okay so bruce, and then gerard you. It looks like you have a round two, but bruce hasn't gone, so I'm going to give him the first one. Thank you. Thank you. Bro bruce asks his question debbie, but I was also hoping to respond to a few of the other questions. Just that just wrapped up. So can you go back to 157 and morgan place? Please so that looks like a road bed. Dock, correct is on the south west corner of 157 and morgan place. Correct yeah on the south side of 157th west of morgan, go from the corner down 19 feet or 19 spaces on the roadbed say it again. Sorry repeatedly on the road bed from the corner of 157 in morgan, south to whatever the length of the road of the dock, is correct, so it's actually going on 157th street from the corner with morgan place west. So I have to, I have to say: that's a really busy corner and there's a bodega there and we're having issues with that traffic corner being problematic to begin with. So can we please discuss this offline at some point yeah we can definitely we can talk more about this about this. Thank you and debbie, I'm not sure if you're hoping to consolidate all of the comments and questions for us to answer as a group, but that might be you know just a good way to get that get all of the feedback to d.o.t right. I will yes, I will consolidate, and then you should also feel free to tell me like. What's worked best absolutely this moment, because some people are gonna then hear about the meeting and couldn't be. You know, look at this, and so we will have probably I'm sure, a decent amount of consolidation, so gerard, why don't you to do your round two and then jennifer? Maybe then, if you want to you, know wrap up before we go to some more board member questions. Great! Thank you very great, so I definitely would appreciate if those two questions, I had one about the parking space loss assessment if that could be included in a future submission just again for transparency, give people some idea of the total loss of parking spaces and also, if it's possible, to do issue a monthly report use report. I think, with the technology that probably is very doable and last but not least in the post Covid-19, it was mentioned the transit system. Now they learned after they made a lot of mistakes that they actually had to clean those trains. And it's pretty it's pretty a significant effort to make sure that those are being tended to what is city bikes going to do and what methods and means and practices are you going to put in place, you're, obviously putting bikes out on the streets, and that is a that's a covered breeding ground. So how are you going to protect the public or assure that the public be put in presented with information to protect themselves? That's a pretty big exposure based on what we know now. So what do you? What are you all going to do with that yeah? So lyft has. You know already started a lot of these efforts to sanitize the bikes more frequently and clean high contact areas more frequently. Every time the bikes are at a depot or when their operations photos are at stations, they're also making efforts to sanitize stations more frequently at near medical facilities, but it is yeah an ongoing process to you know to continuously keep that clean the areas. I think we need more than that. I think I think we I think, like timeout. Okay, so because we're our back and forth are starting to add up to a lot of time- and I do want to say it's not actually. Another thing that's coming out is like transmissions might not actually relate to services. So let's take the health issue because I think that applies to that applies to everything. This applies to program. It provides everything we do, but let's put that one aside and in the interest of time just the other two parts about that's an excellent question. I had it too that gerard asks about the you know: how do we track utilization and how much can be shared once you know this is going and can that be done month, but you know how does that work and then, when we might be able to get more specificity on the parking spot, loss and deb? I would just want metrics to see if they're going to answer the question. I'd like to see metrics, not a general, not a general thing like you know, right, that's specifics! So I'm happy to start- and you can, you know, feel free to add a little bit more color afterwards to respond to data and usage statistics. Monthly reporting citibike actually already covers that. So I believe is it monthly or quarterly reporting that gets posted onto their website, jesse and mobell? It is both monthly and quarterly excellent. So gerard you can go to the citibike website. That's been published for some time now, so you could actually look back on archives. You know do a little bit of you know. Research and you know folks, have really taken to creating and doing creative projects with the data that's available on the citibike website and in terms of the exact parking take across the board when we do come to transportation committees to present on our draft plans. Our final, you know surveys aren't yet complete. That's particularly the case now because of covet, and we don't have you know our field staff out completing those formal surveys just yet, but in a typical case you know we start this outreach process with our draft plan presentation to the board, and then we have lift our partners move forward with you know confirming if all of these sites you know work or if any adjustments need to be made. So while we don't have those specifics just yet, you know it is something that we take into account when we come with average station sizes just to share and give you kind of a general idea of what you'll be seeing across the board, and I think it was jim who did a little bit of calculation about the average. I think it was 18 feet per parking. Space d.o.t actually takes a more generous uses, a more generous dimension for parking spaces and for you know, passenger vehicles. We use 20 feet for that calculation here. If we're actually looking at the screen, I know there's only three road bed sites that are shown on this particular map, but you know, as you can see, there's a network plan where the station is approximately three to five minutes away or three to five blocks away from its next station. That's something that we really try to take into account, but you'll see that the majority of stations here are planned on the sidewalk and we tried to kind of disperse the network to ensure that users are able to still have meaningful service and reliable service across the board. Okay, thank you. Jennifer daryl cochran. Do you ebenezer? Have you been able to get daryl's telephone line promoted so he can speak I'll. Try to promote him. I don't think of anything thanks chanel, but that's dude. That is sorry. I've got a fire thing going off at my house: chanel, that's three, four, seven, four, six one in the hallway! All right! I okay! So, oh I'm sorry with the number again sorry, it's three-fourths it and it's three four seven and it ends in four six. Four. Okay! Thank you appreciate it. Oh hi, can you hear me yep? You can oh awesome. Thank you so much. I appreciate it. I had a few questions and before I do, can you go to the northernmost slide? Please and my general question is really about ada access and I know you have a number of sidewalk stations, and can you tell me how many you know interest that's leaving left on the sidewalks for passing? Yes, sorry I had. I was on mute. Yes, so when we put station on the sidewalk, we maintain at least six feet of clearance and requirements for ada. Accessibility are four feet, and so we are giving more space for that. Okay, thank you and also I see on the right next to bennett park, the top orange one that is along fort washington, avenue correct. So how far away from 183rd street will those stations start because both go in opposite direction and meet at fort washington? So those folks going east need to you know, have the sight line of southbound traffic yeah, so I think it cut out a little bit towards the end. So I may not have heard everything, but we try to sight stations as close to the intersection as possible, starting after crosswalks or stop bars to maintain sight lines for vehicles and for pedestrians. So you don't think this will obstruct the view of folks trying to turn there. So not if now, where I can't remember the particulars of this station, but we cite them so that according to criteria so that the view is not obstructed at any intersection. Okay and lastly, daryl it's one last real, quick, it's real, quick, so quick! So quick! It speaks to almost question as well. I think you said the longest time frame is 30 minutes to utilize a bike right. So that's for certain passes so for the day passes and the three day passes in the single rides 30 minutes and for the annual memberships, it's 45 minutes, and I just wonder because there will be a lot of people who will want to be commuting and from our neighborhood even to midtown. For you know a moderately experienced cyclist. You know that may take more than 30 minutes, so someone wants to travel all the way, downtown I'd say to chamber street or something that's going to take a while. So are these bikes being calibrated to take that into account and have a longer time? So the system is meant for these. You know shorter trips around the neighborhood or you know, connecting to other modes of transportation. But if you are an annual member have a membership you are able to. You know: dock a bike if you're nearing your the end of your time limit and then undock again or in some cases able to go to stations and to extend the time limits so that you, if you wanted to take a longer ride, that you would be able to do so, ebenezer chanel, I needed keana diaz, I'm putting the panelist and I somehow maria luna fell back to attendee status in terms of raised hands. If I could get some raised hands or a voice from any board members, because I'm just seeing two attendees jerry culligan and demetrius coutumbus and jack fogel with raised hands. So if anybody bill gotcha baby, I don't have access to raise my hand, so I made it: oh okay: isidro go ahead. Soy sierra medina from the washington heights business improvement district. Thank you debbie, for putting this together. I think it's necessary for the community. We I have worked very well with lyle has been a partner up in cv12 and I'm happy that this is coming to another hand, because you know a couple of reasons. We have a higher obesity rate in our community. We also have a high rate of asthma's rate, so I think that this can help in the long term. I do have some concerns for parking. This has been hammered down like many different times, but I just want to make sure that it's it hits home every time that we lose a parking spot. It's going to affect us all businesses, so another mahan is unique in the fact that we have a unique community where businesses make up a really good portion of what defines the community, and we hope that vot keeps this in mind in making sure that space space parking loss is at the lowest level, because, again anytime, that we lose three or four parking spots, our small businesses will lose big time. So I'm glad that this was a problem like many times and I would just bring it over again. I think that this should be also some type of way for people that do not have credit card could make use of these bikes. I know that you know this is a technology, but we do have a lot of all. You know mature people who might not have credit cards, and they might be left out so little bit concerned about how you might be addressing that issue for stability purposes, where some of the members of our residents might not have access to a credit card. So how will you address that yeah so I'll? Let jessie my colleague jesse. Take this question. Yeah and that's a very good, that's a very good point and that's something that we hear constantly lift is trying to work out. You know a system that doesn't require a a credit or debit card right now. Unfortunately, you do need one, but lyft ish does see that need, especially for the unbanked to give access to them to bike share. They do see the need of this sort of not you know, you don't need a credit card or a debit card right now. You know, there's not much, we can say, but I will make sure to tell lyft. You know every time we hear this whenever we're at stakeholders or other community boards. This is something that comes up constantly, so I'll make sure to make a point that you know again: community board 12 in Manhattan had an issue or had a concern with unbanked access to citibank for those who aren't unbanked. I think I'm just concerned that if you have this issue all times that we're going to be adding up to be one of those, we don't want to be one of those. I want to make sure that my people have full access to this price, because you know what we're going to suffer. A great deal forget about the pandemic has taken a lot of. You know number of lives, okay, but the fact is that this community cannot be neglected and if you're going to tell us that you know you're going to turn left to see what they do. No, we need to get something done all right. Let's see joe I'm sorry we're gonna, I'm gonna have to move on because we've still got still got a bunch of people and we're over our two minutes on that portion. So jesse yeah, if you can just keep up, keep close to us on this on that question all right, so I've got the list on the public attendees of jerry, culligan, dimitri cotembes, jack, vogel and phil bethel, I think, wanna. If she wants to be in on this, maybe maria you could just let me know, but why don't we just start jerry? You want to kick off. You've got two minutes. Sorry chanel! Are you doing this? For me? Are you? Are you getting people in a position where they can talk, starting with you, jerry culligan? Thank you, oops. Okay, I think you're, okay, jerry okay. The first thing is: there are only four stations around the hospital, which means that there's a hundred bikes for the hospital- all you have to do is to walk to the corner of 165th street and fort washington, where the people who work at the hospital leave their bikes and they leave almost 60 bikes there right now, you need more stations there. Secondly, about that, you need to actually put it on fort washington avenue and on haven avenue where the people are. That's. I think you need to reassess that. Secondly, you have a station on the southeast corner 165th street by broadway. That's a pretty narrow sidewalk. I think you need it across the street, but I may be wrong. I also noticed in 162nd street and broadway. There seems to be a hole of no stations at all and I'm not quite sure why that seems to be riverside oval. You have as a as a pending. You need to be a little more specific when that comes out to the people in that area and lyle. I think you really need to reassess the parking going to the center of the street, so they can do the city bikes along the sidewalk, as I suggested, and the final one is the 166th street and st nicholas station. That's in a landmark block, it's by the library, put it in front of the library which is on the street, and I think that's the change. You should need to do there. That's it okay, all right, demetrius, so chanel! Let me just give you the order. We've got dimitri's next and then jack fogel and then phil bethel. So if you want to do two at a time and if you know you're up next no funny stuff on the on the hot mic, hello, my name is dimitri. I've lived on 187th and cabrini for the past four years. I just want to thank DOT for finally expanding into our stations, and I see it as a thing. That's been long time to do. I guess my question is the selection of the plant city bike station locations gonna be complemented with a decisional bicycle infrastructure upgrades such as protected bike lanes, because I feel, like infrastructure, also comes in hand with the expansion of the system, because you're basically going to make it safer for so many other people to use bicycles as a form of transportation and actually achieve better utilization of your system as well. So yeah is there? Is there like physical bicycle infrastructure that will go in place with the expansion of the city bike system in our neighborhoods to provide a safer experience for our? Thank you, dimitri dimitris. So you know, as we expand city bike, we're always looking for additional opportunities to expand bicycle infrastructure, not only Manhattan, but throughout the five boroughs, and last year the mayor released a green wave initiative, which is a plan to expand protected infrastructure all throughout the five boroughs. So yes, as we go forward with expansion, we are always looking towards adding more protected lanes that you know. Any protected lanes will come through the Manhattan borough's commissioner's office and through the Manhattan community board 12. Before any of that discussion and actually gets put in the crown, but the answer is yes, but there are no sort of concrete plans right now. I just would like to urge for like okay jimmy I'm sorry, we've gotta, we've gotta just stop it there and then thank you, but and then, of course, as you know any time that kind of thing gets proposed, you know to come back here to traffic and transportation. I'm sorry. We are just getting a little backed up on time, jack, fogle, next and phil, and then maria don't forget. If you want to want to say anything just let me we're coming back to you good evening to new friends and old. Can you hear me yeah it's a little soft. Okay, I'll speak it up. Could you go to the map with the 158th street? Thank you. Well, yes, perfect. Okay, what I wanted to bring up is I missed last month's meeting, but it still ties in with today's topic and certainly because of the map to introduce myself. I've lived in the neighborhood for 38 years. I live at river arts apartments, which is riverside, drive west between 158 and 16 and something that became I'm the I'm currently the resident manager. So I have a constituency of about 500 people in my building and what has been very pronounced during this experience is ambulances. Ems calls to ems. I feel that we could actually save a life if we could address the signage, and I know that the community board was looking at this at the may. 4Th and you're looking at you know, realigning traffic study in that in this neighborhood cohort. What happens is every time I call the ems. They will tell me they are go. They send the ambulance to riverside drive in 158th street and for all of you, who know our neighborhood, that is, that is a dead end street to the west side highway on the map that the ems is using and the expediters they see a 158th street intersecting intersex secting with riverside drive west, but it delays the delivery of that ambulance by 10 minutes, at least for them to find themselves because they can't find our building because they're down on the west side highway have to reverse their course drive around. If we could solve this simply by riverside drive west, the sign doesn't actually say: riverside drive west, it does on the map and that's what I'm trying to address, which is good, but since you're making these changes and changing the streets, what we call the lower drive and the upper drive, which are the northwest streets. If you notice, the upper drive goes from 158th street to 165th, which is you don't want to lead an ambulance there, because they will again, they won't be able to get the riverside drive until they get to 165th street, which is again out of the way. If they take the lower drive, what we call the lower drive, then they could get the riverside but the lower. You are changing that to a one-way street south, so ambulances would not be able to get to riverside drive west if they took that. Okay, I'm just gonna just if you would like people, if you would label rivers the other. If you would just change the street sign to riverside drive either south or riverside drive east, then the ambulance will be able to get to riverside drive west because they could be directed to take riverside drive. Sorry, I'm just going to jump in here because we're all right, please save a life. Please just save a like you're, not letting me talk now, it's my turn, I'm done so jennifer and lyle. I assume you've got nick on that. Can you connect that was mr fogle correct? Can we connect you with mr fogle just and then you can grab your signage team and all that and yeah? We sorry yeah. We can take a look at that. That's no problem! Okay, thank you appreciate it and phil bethel now. Luthiel. Thank you yeah. So thank you to DOT for presenting the plan and continue to work on this expansion through the pandemic. As a city bike, member and uptown resident, I'm excited for the system to finally come to the neighborhood two comments. I would love to see a denser station network if possible, given that we're the edge of the network here- and I do worry, that stations are either going to be full or empty, and if you arrive at a station to find it full you're going to now have to walk three to five blocks. To find a station with bikes, so denser station network would be great. I would also like to push back a bit on the notion that everyone in this neighborhood is obsessed with parking. Approximately 75 of the households in cp 12, don't own a car and as one of those households, I would really like to see city bike stations located on the road bed actually, as opposed to on our already crowded sidewalks, where possible, but thank you to DOT and thank you to the community board for this forum. Thanks. Thank you for your comment. Your brevity maria or juana. Did you want to say something? And if so, if you just want to unmute, you are a panelist. You should be able to do that yourself. Yes, okay, so this was a lot of information. I think people heard the url where they could. You know, find the information just in terms of procedure. I think we got a lot of notes and we will share that with DOT, but if people could email ebenezer our district manager and with something in the subject line, you know citibank expansion, input and then he will get those to me and I'll consolidate feedback for DOT and DOT you just let me know when you: when do you need feedback consolidated and to you so mobile jesse? You know correct me if I'm wrong, but I'm thinking about four weeks. Okay, I just want to read out some of these q a so they get recorded because there's some comments here that people did not were not able to call in and say so. I've just been reviewing those, and I just want to bring those on the record because they're not they're, going to get lost. I'm seeing one here that says from karen greene. She says: there's three sites in your northern map. West side are all representing lots of parking spaces. West 180th street between fort washington and broadway is consistently blocked. So loss of space here is unacceptable. That's karen's comment. Adam fran asks: when will the discussion for the northern part of the district above 184th street occur, and I think that's a two-part question when will d.o.t return and one will dlt also begin to take suggestions from the community for that section or if it has already occurred so yeah I'm allowed to do that yeah to answer that? Yes, so for our public outreach we did. We presented an entire community board wide map, so people were commen. Commenting on both the southern and northern half, but when we come back to the community board with the northern half we're going to have another we're going to have another presentation, just like this and another period that people can comment on those northern half stations. Great, thank you victor asks. He says good evening, how's the demand. Okay, can we I mean? Can we victor asks good evening how's the demand for city bikes, now that the city is preparing to reopen? Have the plans changed because of that? Do you have any numbers he's a reporter for the bedford, bowery local news website? So this is a question that victor is asking? Okay all right, so I will let victor take that offline with d.o.t. Thank you for reading those out maria two minutes. Thank you. I was getting a little antsy anyway. I think these plans are really exciting. I am going to focus in 157th street by edward morgan. Have they consider placing these bikes against the little park, the inca payang, which is between broadway and morgan place as a poster on the sidewalk across the street? That is a you know. A very complicated corner, as you know bruce mentioned, and I think that maybe they should they should reconsider the you know the site now. Another thing is that I believe that it was on 168th street on broadway. We are talking about that isle, that is between opposite cougars, where you cougans used to be between 168th street and 169th street, where the ac and you know, number one train. You know you know those stations, I you know so the bikes are gonna be on that particular island there or, where so, unique clarification about that 168th street broadway, some nicolas amber and and 169. I guess, but my thing is that I think they should consider. I know maybe bruce, can you know we can take a look at that because they, the bikes, will go against the little park between, but it's called in catania payan, where the boss number six comes through from broadway, make a left. I think there's no space to place the bikes there. I think that should be considered. Also. I think that, on the on the upper area by cabrini boulevard, a gym is that corner where the light? Shell restaurant is yeah that that's in front of the template, yeah, okay and then making it right turn for the vehicles going down. Downhill is going to make it. You know a difference there. You know I am. I am all for bikes, but let me just tell you eli, I said say something about being that we have a community of these peop obese people, including myself. That's why I go to planet. You know fitness to go and try to lose some weight. No bikes, not everybody is able to rent for three dollars. For you know an hour or whatever in combination with subway fare and the elderly people. We have to consider elderly people in our community that cannot afford not, for they cannot use bikes to you know as a means transportation. So you know you have to think about that all right people. Thank you. So much all right, thank you, maria and then so I know dots heard that, but clearly a lot of you know 157th and edward morgan concern as well as the other observation and then just let us know when, and you know, as things do develop when you'll have more specifics about the pending information at riverside oval. So with that time for us to move on, I always have so many intentions of moving us a little more quickly. Thank you to the DOT team, lyle. If you could stick through the mta portion, I'd be grateful you. I know it's getting late so, but just because I do want to just touch on a little old business moment and but anyway and of course, anybody from DOT that wants to stay with us as well. We'd like that, but with that howard levine has been so patient in hanging in with us, and you know he should stop sharing their content. Please, oh right, thanks wow, all right, so how you should unmute yourself in part for richard allman's inspiration, but also just from the whole committee. We've had so much going on with with the mta and the Covid-19 moment, and you know on a few different dimensions, and so we asked howie to spend a little time with us and just sort of update us give us a view to sort of what comes next as we, you know, as we start to some people getting ready to go back to work, and all of that- and you know also we've had big changes like the cleaning, regimen and the closing of the stations you know between one and five so howie, I know that's a little amorphous, but if you could just give us a general overview of sort of what's been happening, how it has been going, you know with the changes that you've had to make and sort of what comes next we'd. Be appreciative sure, and just I hope everyone is safe and well with everything happening in the city and the country right now. I just want to say that up front, but just to start off with some of the broader changes that I think most people are aware of, but you know have been big changes for the mta and european transit since I've last met with the board, we're still running essential service at this time, which is intended for essential workers and essential errands. I think, as most people are aware, as you mentioned since may 6, the subway service has been suspended between one and five for disinfecting and cleaning of our train cars and our stations. You know, and that's gonna continue. I think even past one reopening of the city is projectors. We've been boosting bus service to have kind of an enhanced bus service schedule, that's 76 in overnight trips and 150, just the number of buses that we have active on the road during that time and additionally for essential workers who need to get to work or get home during that one to five hour period, we've created the essential connector program, which is you know if your ride is, you know not really possible, you can a four-hire vehicle at no cost to yourself to get home or get to work during those hours, and you can do that online. You can do that over the phone, and then we also created an app for people to look at our service exclusively during those hours and figure out if they are eligible for that service and book it if they would like. Additionally, I guess the other biggest change would be that we require all customers to wear mass on new york on all mta all mta services, and then we've implemented rear door boarding on buses. So you know, customers don't have to interact with drivers and vice versa. Most recently, we announced that we are piloting hand, sand tire stations at certain of our subway stations for folks to use hand sanitizer, that's just a pilot that was starting today. Also recently, we've been piloting, uv light technology in terms of cleaning trains and facilities a little less intensive than ideally just a quicker process. That might you know, help us in terms of avoiding the closure but still cleaning and with that technology, that's being piloted because right now you know at most terminal stations. What's happening is carbs are being cleaned with disinfectant and cleaning solution and additionally, at yards, where trains are laid up overnight as well. We've distributed 2.4 million masks to our employees and over 4.8 million gloves we have antibody testing available for our employees and on march 24th we launched the quote temperature brigade to take employee temperatures before they enter work locations. In addition to putting a plexiglas- and you know staggering work schedule, so there was less contact between employees as well just to mitigate the spread. We've eliminated cash transactions with the station agents. You can still make cash transactions at metro card machines in the system, which is not with our station agents, avoid the contact of the cash more locally. You know, I think people are curious. Our elevator replacement projects at 181st street on the a train and 191st street on the one train remain on schedule at this time and I think, as most people are aware, the bus shuttles that we were running to help with service ball as elevators are out or temporarily suspended, and that's been true for about a month now we plan to resume those shuttles when the pandemic concludes and ridership returns, particularly at 191st street on the one you know we're monitoring ridership. We want to ensure there's not any crowding on the m3, which provides essentially the same service as the shuttle that is temporarily suspended. So with that, I will give wheeled my time and take any questions. Thank you, howie. Sorry, let me restart my video. Let's see what we got going. A little bit have a hash on my sort of okay, so anybody first from traffic and transportation yeah. Sorry, I'm just not got two different things going, so I see gerard. Do you have something or is that your hand from before a nice yeah, I think that's his hand from before? Okay and all right, richard allman, take it all right. A first question: I saw a recent report that the disinfectants that mta has been using on the trains didn't meet certain standards and I wonder if you would speak to the metrics, how that's measured and I guess the accuracy of the report, but it was certainly concerning to hear sure. So I think part of that I didn't do that same report. I will say that just the safety of riders which I've received so to be safely, can you can you not hear me very choppy you're breaking up like you have a lousy internet connection, got it all right that my internet connection is unstable. I'm not sure what that quite means, but just let me know it means it's unstable. It's a little better! Try it try it one more time. So I was just going to say that the in terms of the safety to customers of cleaning solutions and disinfecting solutions that they're all EPA approved- and you know so that is kind of fully vetted there, but in terms of if they are ensuring that they are, you know, killing the virus and anything that may be on surfaces. I would have to look back at exactly how that was determined and things like that and get back to you richard. I don't know offhand what the methodology is there. I know we're. You know piloting some things, but you know the cleaning solution seems to be more of an established procedure. Right now run that information back to debbie and get it out to us thanks richard and just howie. I know we've discussed it a little bit, but you know at the sort of outset of this. Some concerns had bubbled up and I haven't heard it again, but I just want to make sure you haven't heard it when there was a switch to the rear boarding on buses that was sometimes leading to people who were trying to get on with a wheelchair or needed some assistance, additional assistance in boarding not having access to the front where they needed to be or not being seen and not being able to board, and so if anybody on the committee has heard more about that we haven't, I haven't, I haven't heard about it, but how has that gone? Is that the kind of thing like did you hear that kind of thing, and has that worked itself through or mary? Do you have anything to say on that? I sure do. Can you hear me we can hear you married? I had you know an incident at the beginning of all this, where I wasn't let on a bus. I had another incident on thursday and the lady who was driving the bus just absolutely refused to open the door, the front door. I have a walker, as you know, and refused to, and was you know, sort of viciously pointing her thumb to the back of the bus, and I said to her: if you don't open the door, I'm going to report you and she said she was- you know, saying: go ahead, go ahead. She didn't care. She was very rude and unwilling to do anything to accommodate me at all. I have not put through that complaint yet who? What is the best way to go about? Putting in that complaint? I think. Can you catch that last bit mary? What's the best way to handle that complaint? Who should I send it to yeah so, first off mary, I'm really sorry to hear that. That's happened to you twice, especially. You know it's the policy and it's been the policy since we started early on that in our signage reflects that you might have seen on the bus as well mary that the front of the bus is still able to be used by people with disabilities or just you know, who need it and request it not for you know not for the majority of customers, but for people who need it that the front door is still available and you can sit in the front of the bus close to the question to the driver. That's been the policy since the very beginning. When that happens, what is most helpful is to get the bus number to everybody that has like an individual number. Great I've got the most numbers, I'm the best, all that stuff yeah perfect. So that's what you need and if you want to just send it beneath your forward to me, I can make sure that driver gets spoken with. What's your info. Well, I can get you your info, yeah I'll, get yeah I'll get stuck to you. Send it to me debbie. Please sure! Thank you all right, thanks mary! So I've got first just so. I just want to say the first complaint is with the state department of human rights and that's pending a response from mta, also because I you know that was such discrimination because I don't have because they don't have a wheelchair. You know so. Okay, thank you all right. Thank you. So I've got bruce. I've got natalie espino a sidro, I'm assuming that's the old hand, but if it's a new hand just wave, if you want to say something, I think that's a new. That's a new one for you, sea, dro, okay, yeah, I'm watching the hands as they're going up. Oh thank you. Omar all right and natalie's been waiting, actually she's been waiting for a while, so all right so natalie and then bruce yeah and then a seizure. My question is quick howie. Thank you very much, for the update is to mary's point is call dialing online, calling 3-1-1 another way to report a bus driver who's being difficult. You certainly can the number for us actually is 5-1-1. I believe you can submit concerns that way as well. You know, but if you know you know I'm speaking with you and you know mary, I know you. I trust you and I want to you know, make sure it's taken care of personally so right, but it's simpler yeah, if I say to somebody 511 rather than call community board, ebenezer give them an email so forth, and so on yeah we're certainly not going to post. You know, send your complaints to ebenezer on every bus, stop and things like that. Thank you very much. Of course, sorry natalie did you have something I did I mean I am happy to wait. If other board members have questions it's up to you, that's okay! Go ahead! Okay! I appreciate it so howie hi good to see you my questions. I mean along the lines of mary's feedback. We have been getting that sort of feedback from across the borough. So if there's some way that the optics of that of chains across you know that front entrance and then driver education so that they know that it's not that we don't, they have the option to decline service to the nice service to the disabled. The other thing related, and you know channeling my inner edith here is as far as accessoried under normal circumstances, whatever normal means nowadays, accessories users have are penalized for extended periods of not using the service. Is that being waived now and how and can that, if that's the case can that be put on a banner on the landing web page for paratransit? So in terms of so first off, I natalie also good to hear your voice, the in terms of the accessoride issue. I don't know offhand. I can look into that and get back to you. I can't imagine that policy would remain in place during a time when you know accessorize users are you know, a vulnerable population that is encouraged not to be traveling, except for essential trips, so I can't imagine that would remain in place in the same way it normally does, but I will get back to you on that. Thank you and the in terms of the front door boarding for folks with disabilities. The you know I mean the response is the same is when this is seen we want to. We want to know about it. We want to be able to take care of it and make sure those bus drivers are following this policy, and you know letting all of our customers, you know, use the bus in the way that they need to. So you know, let us know, as you hear more of that you know, and whenever there's a bus number and a time and date that is extremely helpful and we can really specifically target the specific bus driver that might not be following this policy and discipline them if needed. We'll do. Thank you, natalie isidro, hi howie. Thank you all for the time and an update really appreciated very concerned about some of the bosses in the washington heights area, particularly the 181st street san nicolas and rowan, where on the bus stops, it's actually not accessible for any riders because of the back door as you use. It now cannot be accessed because of a lot of street vendors who already placed on the bus stops themselves and they are risking to some extent of the social distancing. But like mary said- and this is a very common problem here- there's not us easy access for people with disability to the bosses and that's one because they don't have the front door access. Nor can they actually come out through the back quite easily because the congestion, the street vendors. So I don't know how, if or if you can address that for me- so sorry- I didn't- I think my internet is unstable, as zuma was telling me it didn't catch. Quite any of that was it more of just general across the board. Was there a specific bus line that you're seeing that issue or bus stop where the front door is blocked by a vendor, or mostly obviously on 181st street, as a nicholas on both north and south, and also on money? First, on the south south corner, I heard 181st and saint nick, both north and southbound. What was the last one so paul from the south east of 181st and also on the southwest corner, got it okay, I believe, generally vendors are not allowed to be parked in a bus. Stop, I believe, that's just regulation the city has, but if that's something you're seeing in a particular spot where a vendor is often there, I would call, I believe you call three on one or get in touch with d.o.t would be the one to well. Actually a d.o.t can comment, I'm not sure if it's d.o.t or more of the street vendor regulation, that might be the department of consumer affairs would take care of that but yeah. But we would you know when that scene. We want to know about it, so we can make sure that the front of the bus is accessible for our customers. All right. Thank you. Do we have any other questions or anything so howie I've made people aware that we're trying to see confirm that we can have sort of a special tnt meeting on july 6th. I think it is to cover the 100, the you know, the next phase, elevator 190th, a train just remind me that would be for kickoff in september, correct yeah. If everything remains on schedule with 181st street, on the a that will conclude in august and then in september. At some point, the 190th on the a will, the elevators will be taken out of service for the full replacement right. Okay, thank you. So I I put out you know: I've asked ebenezer and eli just sort of how that needs to go, but I don't have any feedback yet, and but I thank you for being here and then yeah so we'll circle back sounds great all right thanks again, yes and it's good to see all of you and hear all of you and again, I hope everyone stays safe and well you as well howie regards to team mta. Thank you howie same to you, man, all right, just a few, a few items- newish business, oldish business first on sort of new things that are bubbling, but is that we've had two groups express or people both actually coming in from community board. Members have come to us to talk about street code naming and just as a reminder. We consider that next in october, so I anticipate we might have those in both, in both cases, there's sort of a nexus to the Covid-19 crisis, or actually that's not completely true. In both cases, there are some special circumstances: daryl cochrane's, actually taking the lead on one in terms of the idea and it's something that he talked about in the health committee and then domingo estevez has another that he's been working on. So just you know, keep that in mind we'll have that coming up in october. I know. Sometimes I forget myself that streetco namings are considered twice a year by traffic and transportation, so that's happening second on on more of an old business item so last month. Obviously we spent a lot of time on the proposal from the riverside. You know the riverside drive, work and so the short answer and, as everybody knows, the issues of the part of the proposal that related to the middle drive and making that one way southbound are sort of left unresolved and we have- and we obviously asked for sort of like more clarity on sort of what the options were, and we weren't ready to consider that I've asked DOT to be back at our september meeting and so that we have an opportunity to get a more full presentation of that aspect and have them. You know, respond to some of the concerns, but also to give us more background on sort of why that was the recommendation because, obviously, when they presented they presented, you know a plan with a lot of different parts. So we really didn't get to understand sort of the full sort of case of why they came to that recommendation as a specific matter. They did come back to us with and again we'll hear more about it in september. With that one, the sort of more narrow concern about the bus and emergency vehicles that will be traversing. That section should it become one way and whether that was going to be safe, whether there would be enough room to pass deal with the congestion, etc. So they actually did come back with some reactions to you know how you might create more cushion to avoid congestion and any problems with buses and emergency vehicles like through the no standing, but again they can. They can bring that forward. You know in september because I think we need to take it as a whole. I would say the last sort of leg of that is that, and this comes up when you know just now what we're talking about 157th and edward morgan wayne benjamin has over time raised the issue of you know: broadway and edward morgan and people making that turn and it sort of became clear again through this all. You know this conversation about the middle drive that like we need to understand, like what are the assumptions that DOT is making about, where traffic trying to do one thing, and that has done one thing for all these years like where are they assuming that will go? What's all the traffic diversion aspects of that so again september on that and debbie? If I could just add to that or clarify it, so basically they're going to come back in september and they will be addressing all of the various concerns that we heard about making this street one way. Is that essentially yeah or you know absolutely- and you know, to my mind again- we sort of didn't put a lot of precision around what does further consideration mean, but so this is the opportunity again for, like you know, they hear the concern about congestion, so they and they have some ideas about how to address that through no standing. But in terms of this committee's evaluation, and we never voted on that aspect of it. I think we need to be able to spend more time with the assumptions and where it came from, because people will still all taken together have to make a decision. So I want to make sure just in the way just to just basically have as if that was a standalone thing. I know it's not a standalone and it fits into other. You know fits into a whole picture, but I don't think we have a lot of a precise enough understanding of like how or why you know, I think, anyway, an upset. So it's back on the agenda for further consideration, as contemplated by the resolution that was passed at the last meeting. I'm quite certain. I am forgetting something. So this is the last chance you remind me what old business new business that I am forgetting, hey debbie tomorrow, just old business, that we continue to speak about. So we want to make sure that every month we kind of get an update from lyle is in regards to the lighting on the east side highway, leading from 178th street all the way to dikeman that dark area. I know. Last month I spoke about the fact that I think con edison was doing electrical work there to try to make sure they can bridge to the electricity to get those lights going, because this is a multi-faceted project that is not just dlt related, but it encumbers other entities as well. So if there's any update there, that'd be great yeah, I don't know, wasn't our lighting further south on weren't, we talking on the harlem river, or we were talking all the way up to deichmann yeah. The lighting issue occurs right where you begin to make that off. Off-Ramp towards 100 is yes. Is it from 10th avenue in dyckman down yeah, okay called pitch black all the whole area, yeah I'll see if I can get some updates on that, I haven't heard anything back from content in a little bit but I'll see. If I can get some answers for you and also my block still doesn't have any street lights, hardly any the same block that debbie lives on that's on cabrini right, yeah there. I think that there's some issues regarding that because of the pandemic from what I understand, they think it's in regards to some foundational issues that they have to address. But since ultimate site is suspended, they can't get their vehicles in order to be adjacent to those foundations. So the work has to be paused for the time being, so when alternate side gets back into effect and those cars are moved, then they should be able to get those cars in there in order to do the rest of the foundational work. Yeah, no problem, all right. Ask one question: yep! Thank you. So, in terms of the 157 overlap between city, bikes and other questions and 158 southbound, is it possible to have some kind of meeting during the summer with the various parties, like maria and jack in our group and d.o.t, to kind of pull it all together and city bikes, of course, because there's a you know, overlap questioning about 157th street and how that's going to flow? Thank you yeah. We, oh sorry, go ahead. Well I mean I'm not I'm going to reserve the right not to special meeting that. Yet I mean, let's see how this evolves, because I mean my understanding from city bike, presentation, lyle, correct me. If I'm wrong is that pending, where all that comes out, then we'll have to have like a separate process to understand what your proposal is for that area, because we don't know what your proposal is. The fact that we need that 157th and edward morgan proposed bike station is was probably the only one on this that got feedback multiple times. That's going to go through our response back to DOT on that presentation, and then third, I should actually, I should say, and bruce you're, probably getting at the fact like weren't, you gonna say something we are right. I was. I have asked lyle to kind of inventory for us 157th like coming from broadway sorry, edward morgan from broadway. That part wasn't on last month's presentation. Just the riverside drive end of edward morgan was but there was. There was work that this committee was part of for that sort of concluded that area and then it sort of relates to what we'll talk about in the september meeting when we start talking about. Where does traffic, who was normally going to the bridge through their go, and so it fits into the diversion of traffic discussion. But I've asked for like an inventory of all the projects sort of around there that have somewhat touched upon it, but not necessarily super directly and whether that and how that has so, first of all, what they are and, second of all, how has it impacted pedestrian safety there, because that was a place that was historically had a lot of injuries. But it's because also some of this was the year. I wasn't on the committee, I'm just trying to kind of see it in one place of like which of the other DOT projects around. There have made changes to that spot and what was the impact of those changes? So there's a few different ways we're getting at this, but I think if somebody's got additional feedback on the city bike thing, they need to put it through us and I will consolidate it if they have comments related to the middle drive issue. We'll take that up in september. So and then I guess lyle, if you could just sort of comment on my synopsis, but also just let us know like. Will you come back to us for like a little sub moment of considering the city bike stations that we didn't get to see that are in the riverside area? Yeah, the the plan is as far as at least those stations can be considered for the area around the oval yeah, that's essentially pending what ends up happening as far as the riverside project. So you know that conversation you know, will stem from what happens in september as far as the projects that we've done around that area, primarily around 157th, edward morgan, place and broadway. If you can recall, I think, was in 2018 the main meeting of 2018- and I remember this vividly when we had the meeting up at allen. Hospital this was the that was the first evening that we had of the presentation for our broadway project between 157 and 170 in the streets as far as traffic and pedestrian safety changes and at least by 157th and broadway, every morgan place that immediate area what we had done at least there we added some pedestrian space in the area in a painted median in order to shorten the pedestrian crossings, and we did an extension of a left turn lane to provide more queuing space on broadway. If you remember that left turn, lane was pretty short, as you were approaching the 57th, so we lengthened that left turn lane so that way, they'd have more space for cars, we're going straight to have their own dedicated space, and we did some signal timing changes around that area, so it would better sync up with the way traffic was flowing and to address spillback onto broadway. There is a capital project that is being looked at, which does include this area. They don't have any specifics as to what that project entails. It might edge it might address that direct area. You know by edward morgan m157, so we can have those conversations you know as that information comes in on our end, but yeah. If you know, we can also take a look at that specific area. You know between broadway and edward morgan, 157, I'm independent. You know of what happened so yeah, based on a couple of different factors like richard mentioning debbie, you know based off of what's already happened there and you know what we've already seen and based off of what's pending for the riverside project and the capital project, that seems to be forthcoming. Yeah. There are a couple of different eyes in this area, so, as the information is coming at least for the future, you know I'll give that you know I'll. Give you guys the heads up on that and, like I said you know, we had made those improvements. At least you know by the 157th street corridor. That's the southernmost portion of that broadway project from about two years ago. So you know we tried to address at least the furthest easternmost point. You know for that last project that we had, but we can take a closer look if need be at that western portion by edward morgan, broadway 157, depending on how things go between now and september yeah. Thank you. I think. Maybe our community will get together during the summer and hash this all out, and then we can have better more focused input to you all because, for instance, the city bikes could go across from next to pay and park. Like maria said, where there's a cross-hatch area, that's not being used right now, so there's some options like that. Maybe we can help you suss out. Thank you no problem, and you know where to find me. So if there are any questions or comments or concerns you have between now and september, by all means in order to find me bruce it's no problem any time. I can't hear you lost your debbie. Well, we still can't hear you debbie, oh yeah, that was that was not the dog ate my homework, but the cat walked over the keyboard. If we could get lyle, something that I can that the committee can see about so fine, you did those changes in 2018. But again you did the changes to make it safer, because people were getting hit on a not a regular basis, so just like before after like did it have the intended effect. Have the injuries gone down because yeah, that's it, and then that closes that point. But I just like when I was asked the question like recently by another board member. We didn't, I didn't, have an answer because we don't I don't I was like. I think we did something already: it's not that it was never addressed, but we also didn't we just it's good to take off the box and say it worked, and people are getting hit less often. So, just if there's a way to get that data at some point. I'd certainly like to see it and I'd like the committee to have that like as we're as we're looking into things because yeah hey w. Oh, I have a question, but natalie has her hand up as well. So I want to see if we can get her you're on this one where you go and then natalie will finish us out gotcha. My question is in regards to a recent presentation that was made by dlt, which is in terms of the potential project that will take place on 178th street, and this is the one that's going to bring that's going to fix all that traffic coming after washington bridge. When will we know more about that project? Like that's kind of like the question that I have that's a good question, we're trying to figure that out too, like you said, everything with this pandemic is pretty much thrown everything out of whack. Ideally, we were supposed to do that during the summer yep, as you know, everything's kind of up in the air for us and obviously agencies now so I'll. Try to see where we stand on this. I know that we've been going through our different projects to see what can be done, what resources we have and the time frames, but definitely I can see where we stand on that and see if we can, if it's a possibility for it to be done during the summer, but yeah I I'll see, I can find out for you. Thank you appreciate it. No problem, okay, natalie! Sorry, I had left my hand up. I had nothing else to add. Okay, great all, right all right with that. Do I have a motion to adjourn. Second, sir. This meeting is adjourned. 9 13., I would say goodbye for the summer, but I know I will see you all again if nothing else, hopefully we'll have a one special meeting in july to take up the mta matter, but I appreciate you all, thank you very much and wish everybody well. Thank you to you all. Thank you thanks everyone. Thank you, david best committee on the board good night. Everyone thanks chanel thanks ebenezer good night good night, bye.",
        "summary": "Community uprising and community togetherness I wanted to thank community board 12 for hosting us tonight to share our plans to expand city bike into northern Manhattan Thank you to all of our elected officials, the bro president's office, councilmember rodriguez's office, senator jackson and all of your elected staff for your continued support and partnership and feedback on all of the DOT projects.\nSo, that's very exciting and my colleagues at DOT have also been hard at work with remote setups at home As. Many of you are also teleworking to come up with a network plan that will provide residents in cv12 with access to this safe, healthy and affordable option of bike share and we're focusing our presentation tonight on the southern portion of the board from 155th street to 184th street.\nLyft also has community grant program that distributes grant money to non-profits and other community-based organizations that can be used to fund programming or events or activities that help spread awareness and encourage ridership As the city grapples, you know, with the spread of covert 19 dot is working closely with city bike to ensure that new yorkers have a safe way to get around town and lyft, and the DOT are working together to ensure that there is an increase in cleaning efforts at depots and operation vehicles, as well as near high use, medical facilities and understanding that access to transportation.\nWe aim to have a station approximately every three to four north and south blocks and every major crosstown blocks with larger stations, near transit hubs or key destinations, so public outreach and along with our technical siding criteria and the network considerations, help determine where stations can be placed and some of the siting criteria we take into consideration: hydrants utilities, ada accessibility, among other factors, So. As with our other expansions, we wanted to know where residents of washington heights wanted city bike stations, so we held a community board workshop to gather feedback on location preferences into and then, if presidents weren't able to make that we also held three pop-up outreach workshops throughout the neighborhood at various community facilities, and there was also an online feedback map where people could drop pins.\nWe also engaged with major stakeholders like hospitals and other city agencies, to receive additional input so shown here is where there was higher community preference for city bike stations, and we also in creating the draft plan, tried to eliminate sites that were unpopular or might be an issue for lyft operationally and those are shown in the in red on this map.\nBut first I just wanted to reiterate some of the things that jennifer mentioned at the beginning, that we will be installing in this community board in two phases, and so this summer we will be installing from 155th street to 184th street 30 stations and that's really to create a contiguous service area across upper Manhattan and the Bronx We will be moving to the Bronx after washington heights and then coming back to fill out the rest of the community board next spring and then we'll create and release the final plan and from and that at that point, lyft will conduct door-to-door notifications to adjacent property owners to inform them, inform them of station installations and record any concerns that might come up and even after stations are installed, we will continue to monitor and take feedback Now we will move on to the last portion of the presentation and we will review the draft plan sites and, as mentioned previously, this first phase of installation will be from 155th street.\nSorry to 184th street and I also wanted to note that the draft plan presentation is available online at our website at new york city, DOT, gov, slash bike share under the maps and plans tab for easier viewing.\nWe have a sidewalk station Have a station plan for the east side of amsterdam, avenue south of west 156th street also on the sidewalk, but along the building line there moving west, we have a station on the south side of west 157th street west of edward morgan place, and that is a road bed station there's a street improvement project along much of this area along riverside, and so we will be coordinating two stations in this area following further coordination with community board and residents and other stakeholders for that project, and so moving north to broadway On. The east side of broadway south of west 160th street We have a sidewalk station planned along the curb line: moving east to the south side of west 159th street west of edgecombe avenue.\nWe have a station planned for the road bed on the east side of amsterdam, avenue south of west one second 172nd street and then final station on this map is a sidewalk station planned for the curb line on the east side of fort washington, avenue south of west 173rd street and then now we're at the northern portion of the area.\nActually, the last one is on the east side of cabrini boulevard north of west 181st street, and so that's what those are the draft plan sites and so now we're available to take any questions on the city bike program or any sites in particular that you may want a little bit more elaboration.\nThe majority of them are planned for the sidewalk and in spaces that do not remove parking, because that was absolutely something that you know : It's a priority and very important to the community board, and so we just wanted to make sure that we balanced your needs as well as the needs to create you know a meaningful network of bike share stations , We have two or two people that need to be promoted, kiana diaz promoted to panelists, as well as one of the phone numbers.\nPeople furious In that section around mitchell park You know what I'm saying like that station is presuming that that's then a one-way street with all the changes that were approved so that station is planned to be along the bike lane on saint nicholas avenue on the west side, there So it may be a little bit unfamiliar I, know, I, think debbie.\nNo, and on that block, there's Actually So it's adding like 20 parking spot, whatever So this is contemplated for the new world of that block right, not the old world and then we'll open it up to the other board and then and what were the circumstances, because I think sometimes people feel like well So, as you know mentioned in the presentation, any construction projects that come up that might impact the footprint of the station, whether it be on the sidewalk or the road bed, We coordinate to relocate the station for that construction and in most cases the station does go back to the plant or sorry to the permanent location location of where it started.\nHow many parking spaces is 25, docks?, as mobile said right, the average station size would be approximately 25 docks across this area of cb12 and that pretty much equates to I think approximately 65 to 70 feet, and that depends on whether or not there are utilities in the road to bridge or what not You know if there aren't any utilities on the ground that we need to quote-unquote bridge I do also want to say that jim and debbie and omar, we hear you that parking take is definitely a very serious issue across the district and we tried very hard to balance parking take and you know utilize the available and feasible sidewalk spaces that we did identify but parking removal here for city bike expansion into cb12 It, you know, can't be avoided, and so we really tried where we could to find feasible sites that didn't remove parking and where we can, we can look to So. Let's say you described a situation where something didn't work out and you needed to move it.\nI've been actually a city bike member since 2013, since this thing first launched and If I can trust going back into a train system anytime, soon, like literally anytime soon and as soon as we get called back into the office city bike is probably going to be the primary way that I actually come from home to work and back So. This is coming at a good time, considering that all the issues that we're having with the mta the unknown, recovered and kind of trying to avoid being put into a situation where we're constantly being established into an environment and being shepherd downtown, You, know outside and not have to do public transportation in a different way.\nYou, know already started a lot of these efforts to sanitize the bikes more frequently and clean high contact areas more frequently, So. Let's take the health issue because I think that applies to that applies to everything and then, when we might be able to get more specificity on the parking spot, loss and deb?, and you can, you know, feel free to add a little bit more color afterwards to respond to data and usage statistics.\nI also noticed in 162nd street and broadway You need to be a little more specific when that comes out to the people in that area and lyle I think you really need to reassess the parking going to the center of the street, so they can do the city bikes along the sidewalk, as I suggested, and the final one is the 166th street and st nicholas station That's in a landmark block.\nIt's by the library, put it in front of the library which is on the street My question is the selection of the plant city bike station locations gonna be complemented with a decisional bicycle infrastructure upgrades such as protected bike lanes, because I feel like infrastructure, also comes in hand with the expansion of the system, because you're basically going to make it safer for so many other people to use bicycles as a form of transportation and actually achieve better utilization of your system as well.\nBut when we come back to the community board with the northern half we're going to have another we're going to have another presentation, just like this and another period that people can comment on those northern half stations, how's the demand for city bikes.\nWhere all that comes out, then we'll have to have like a separate process to understand what your proposal is for that area, because we don't know what your proposal is That's going to go through our response back to DOT on that presentation, and then third I should actually I should say Just the riverside drive end of edward morgan was, There was work that this committee was part of for that sort of concluded.\nand I will consolidate it if they have comments related to the middle drive issue Will, you come back to us for like a little sub moment of considering the city bike stations that we didn't get to see that are in the riverside area?"
    }
}