{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 October 2020 Chelsea Land Use Committee",
            "publishDate": "2020-10-26",
            "shortDescription": "AGENDA\\n\\n1. Committee Vote: CB4 Budget Requests for Fiscal Year 2022\\r\\n\\n2. Old/New Business",
            "lengthSeconds": "1:15:42"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "DkUAeE9kAKU",
            "fillerWordCount": {
                "uh": 111,
                "um": 142
            },
            "readTimeFullTranscript": "46 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "budget": 55,
                "elevators": 32,
                "housing": 26,
                "buildings": 18,
                "building": 17,
                "spaces": 17,
                "funding": 16,
                "expense": 15,
                "land": 14,
                "kind": 14
            },
            "wordCountSummary": {
                "budget": 15,
                "land": 7,
                "funding": 6,
                "kind": 6,
                "vacancy": 5,
                "associations": 4,
                "expense": 4,
                "tenant": 3,
                "guys": 3,
                "capital": 3
            },
            "fullTranscript": "Meeting starts Pam just make sure you look up your voting site, because a lot of places have changed because of Covid-19. Yes, I'm aware of that, and they had for early voting, they were going to send me to Madison Square Square Garden to that site, but for the actual day of voting, it's 20, it's the sales matter. That's and that's a public service announcement to everybody is just reconfirm your voting locations, because a lot of places have changed this year because of Covid-19. There you go it's true. I will check again tracking your ballot Paul, that's a question yeah again we're not in the if we're, not launching the meeting yet we're doing politics instead by my car business. So we only have one item on our agenda guys. Maybe we can be speedy. It's the our budget request and I maybe I could sort of lead us off in that. I look back at what people said at our last meeting when we talked a little bit about the budget. If you bear with me I'll, just tell you what some people recommended. We did not make an official form that we filled out yet, but we had from kid a recommendation for a study to analyze the feasibility of repurposing empty buildings such as office and theaters, to convert them to affordable housing. We had a suggestion from virum. Well he a comment from viren that DCP is studying vacant housing due to people leaving the city and that architecture. Schools were looking at retrofitting various types of buildings and malls. I do not is viren on this meeting yeah he's here: okay, Bert suggested reuse for health care and then Jesse raised. Who would do such studies and then I guess Jesse or someone said DCP or EDC, now that we could write a letter on that. If we wanted to have a collaborative planning effort and Brad mentioned, I may have gotten this little screwed up the need for state funding for infrastructure such as sump pump at fulton houses, which would be a capital expense. The other ones would be expense, budget items and Paul focused on four items: general items, security, education, housing and Health, and I've been involved with the Chelsea working group for the public, housing and Chelsea. So this is not discussed at the last meeting. I have, on my mind, funding for apartment renovations and other infrastructure improvements for those projects, and then we have Covid-19 related opportunities to make budget requests. I've got some ideas about that, but rather than listen to myself, maybe we could open the discussion on mainly expense budget items and Covid-19 related items. Does anybody want to put their two cents in do not all speak at once? Oh yeah? Actually I have a question betty. It's interesting that you brought up fulton houses what, as far as budget wise, what are we allowed to try to budget, for if I mean how does that fit into the whole process? I'm just curious. I do not know. I can't really answer that question. I just know that there's such a great need for funding of yeah we've been living for the last year, gnashing our teeth and pulling our hair out to find ways that we can, you know, sell their rights and do all kinds of exotic things to generate funding. So maybe Jesse can contribute on that yeah. Can I jump in there so hector? That's a great question. So, historically we've you know, we've done. The board has really done their budget. You know budgeting for getting budget information by from two ways: one from tenant associations right and literally just calling up the tenant associations for Fulton, Elliot, Chelsea and harborview and saying what do you guys need? You know in either capital you know or expense, and we've listed those historically in our budget, so it's not listed in the cl. It does not usually come through land use. It usually comes through housing. So it's not a it's, not necessarily something I listed here, that's listed in when in your first. But if you look at the overall document you can see from last year, we really did prioritize a number of the fulton and Elliot Chelsea and harborview requests, because we were, you know, participating in the Chelsea. You know the Chelsea NYCHA working group so much and wanted to make sure that we were advocating- and you know following through with what we, what we've been saying in those meetings so but it can be, it's usually all capital. It's usually all pretty large. You know projects whether it be something as simple as when I say simple, as it's meaning in the grand scheme of capital projects of replacing front doors to you know the lights in front of the the lights in front of else, Chelsea elliott, on 20. You know on 26th street there to the Cameras Security cameras to boilers to roofs, so it almost it can be. Almost you know anything related. We have not historically done anything in expense in terms of direct. You know, staffing of a certain type of you know a need, a staffing need or anything along those lines. So can I yeah and also hector in a general response to your question, and this is for the benefit of everybody and especially the newer people. What we are is in the beginning of the budget process for the next upcoming fiscal year budget decisions. So what we're doing now is the very early stages of what are the budget priorities from our community district right and we're taking a perspective from the land Use committee. Are there things within the city budget that we think need to be beefed up, whether it's a ongoing expense or a capital expense? And then that will go to a budget task force which will then get sifted out and then the entire community board will prioritize our budget needs for the upcoming fiscal year. So it's a we're in the very we're in the early stages of like a dream list kind of creation and as Jesse and Betty pointed out a lot of the stuff at NYCHA. The capital expenses are not necessarily from land use, but they would probably come more from housing. But if we can, you know help get our thought train running with ideas of what we want for land use priorities. Okay, so I guess my next question of the follow- up would be. I guess, I'm glad to hear we're still in the beginning process of of thinking about what's going to go into the budget requests proposals at what point do we reach out, I mean: do we reach out to the tas of both of all the housing of open NYCHA locations, or you know yeah, that's on my list to do so. I historically done that. I just reached out to Darlene right and Darlene and I produce a report. You know I do not want to call it a report, it's not it does not. It does not suffice as a report. It's a piece of paper that says this is what they report. This is what they said that they need, and I and I provide that to the you know, to the housing task force, I'm not the housing tax, I'm sorry the budget task force. You know it. It's always been a little. I will say hector. Actually, this is something that this is not necessarily something that clue. This is clue focus, but I do think getting more input from NYCHA residents and from NYCHA itself earlier on in the process has always been. I think, a struggle for us, and so it sort of has fall upon falling into this mic. Had my responsibility of just sort of getting the you know getting having a phone call with the Ta presidents, but I think if there's some way to include it more into the housing conversation earlier on, you know I think that would be something to have. I think that'd be helpful, and so maybe we can follow up with Maria and maybe the Tas and Joe, and have a conversation about how we can sort of make that a yearly thing, because it just does not. Unfortunately, that sounds great. I guess I I'd like to help along with the process, because, obviously I have a stake in both billy Chelsea and Fulton so and I kind of know all the players involved. So if anything you know anything, I could do I'd be more than happy to facilitate get this. You know get the ball rolling on some of this stuff. Oh sorry, did you want to say something you looked like you were about to say something well I was going to then I was going to do the same because we do have three members of the Chelsea languages committee on the nature working group. I do not see your hand, sorry Mike's hand is up. I see it, I do not see it so yeah, so the Pers Mike. I want that's perfect because I wanted to think if the NYCHA working group has any land use perspective, items that are coming out, that maybe housing will address something on the budget priority from the Nitro working group, but we as Lane juice perspective. Is there anything that we need to address Michael. Did you want to say something? Well, I did you know, and I can say that you know just as in the past, we really have not ever had anything strictly from Milani's perspective to comment on, but we did add stuff to the to the budget. The capital request we'll know so one of them this year that I think we can not. You know stop asking for, is you know to redo the elevators in this building and Elliott buildings. Elevators are catastrophe here. Every now and then you know we got people that are disabled, can't use the elevators as on and off it's all the time on and off you know. So that's one thing we should, you know do again about it. Suppose we put as sort of a holding spot or a till until Jesse pulls the tenant leaders, improve funding for improvement of infrastructure for the public housing projects, particularly redoing, the elevators plus other other parts of the projects that based on tenant feedback. You know that Jesse will get. Could we make some sort of general statement like that? Would that be kosher? Would it be more impactful if we just focused on elevator, maintenance and repair? That's probably the single biggest budget expense that any building faces aside from a boiler replacement or a roof replacement. Elevator maintenance is the priciest thing on the on the book that well, we I do know. I do know from the conversations of the working group that the heating system and hector and elzora you can correct me that the heating system would need to be replaced. Am I in which building we're talking about all and all of them? Actually, that's it's a major issue so because elevators and heating systems, that's basically the guts of your building yeah, it's a huge expense. It's a big expense yeah. So if we bulleted and everybody in different committees, all said you know, do the elevators get funding for your elevators and do the elevators. I guess the funding for elevators. Let me just say something: full disclosure, employees of the housing authority are my clients. Many of them are but the elevator maintenance people and, for example, it's also an expense item, because there are like right now, 45, I think something like 45 or 46 unfunded, elevator, helper positions. The housing authority is not filling those positions and using laborers using laborers to help the elevator mechanics, which is completely unsafe. It's a nightmare, it's a nightmare. So, if we're talking elevators, there's capital, but there's also expense items and they're, not even using the expense, what they're budgeted to use they're, not using it for whatever reason, so how does that affect what decisions we make about? What well I do not celebrate a maintenance, and I think part of that is the staff that the housing authority is using to maintain the elevators. How do we impact that? Yes, that's what we want to do. I mean we're talking budget here, that's in the expense budget, one to use all the positions that they have already in the budget which they're not using not and to use trained people in that elevator maintenance department, not laborers, which they have to use the labor is they have to do a very quick couple of weeks, training for the laborers to know which is the door and which is top and which is the bottom of the elevator wow that you really. You really know this bert well, they're. My clients is that is that is there data that tells you which of the positions are not filled? I have just I just have not. Today came across something from the union about that with the elevated maintenance helpers, so it sounds like we could. We could fine- tune this recommendation. What do you think Paul yeah? I think I think putting it both in capital and in ongoing expenses? Okay, so we'll just we can do that both and bert you've, given us some valuable information. Is there anything that you have in writing that you could share it with us that we could make a meaningful statement I'll get numbers that from what I saw the this afternoon and I'll email it to you, okay, you're, familiar with the language that we need in these forms anyway, so that'd be great. Jesse has something to add, though yeah. I just two things that I just wanted one just a little bit clarify what Paul had said earlier that at the beginning of the process, it is at the beginning of the process in the sense of like we're talking about Fy22, and we have just we're just in the beginning of Fy21, but in terms of our actual process, we're voting on these recommendations in November's full board. So we've had the last two months to negotiate talk about these from a committee perspective. Each committees have been discussing them in their own different fashion, and so what you're voting on tonight is what you're recommending to the budget task force now. Bert knows you know and I'm quickly checking around the room. I do not think anybody else on this call, but Bert knows for sure right that, then the budget task force's job is to try to combine all of these yeah and juggle them. So I just do not want to give people to, though I do not want to give people the impression that I tonight we will be, you will be voting on it so and then the other thing is I just it's your prerogative, of course, this committee, as a committee, but I just want to you, know historically the what you're, what you're, what you're voting on as recommend or budget requests, have been things that the committee itself has been on record for you know you know working on and you know you know either sent the previous letter about or has had a discussion about it. So I I'm just raising that as things that, if we're bringing in new information necessarily not to say that it does not require a priority, I'm just saying that you know you have existing stuff that you voted, that you've been recommending for years on that are on your list that you, I think at some point tonight. You should go through and decide whether you know what, where that all falls out, if it, if it's still relevant, if it's not relevant, however, you feel about it, but I just want to yeah that's interesting Jesse, because I've been thinking about it today and talking to Paul that I think a number of the things that I looked at them again and for the third time, like things about zoning and code enforcement and all that kind of stuff. I personally think that at this point in the city's economic situation, that those things do not feel to me to be high priority, those ones that we've had on our list- you know for a long time and that we may want to try to generate some new recommendations more relevant to our situation in the city. I do not know how everybody else feels, but I just feel that you know expanding a zoning district or upping code enforcement will not be. I think that those kinds of items would be very low priority in this city and that there may be other things given Covid-19 and the economic downturn. That would be more relevant, so they're in digital agreement. You know, as far as priorities go, I mean it's quality of life issues that we really should be addressing at this point and I think yeah. We should introduce some new ideas on this budget. If we can at this point, I do not know- and maybe it's late in the game, but I do not know what the process might be, but that might be something we maybe seriously. Consider I was going to ask Veron I kind of today was awfully late noticed. I send you an email, but that you had been talking at the last meeting about retrofitting or converting buildings that are underused or empty into other land uses, which I thought I thought is very relevant at this point or it could be relevant and that we could request funding for certain studies along those lines and you'd think that maybe architecture schools are looking at that already architectural schools. I'm looking at that, actually, even before Kowitt's truck for a variety of reasons, so New York City is known to have pretty high what you call it vacancy rate, irrespective of what happens the pandemic, but because the pandemic, I think the vacancy rate in housing apartments is 13.8 now and that's the data that actually is generally collected by HPD and real estate. You know brokerage companies, so that number does exist and that's sort of fairly accurate for office buildings. The vacancy is not high, but the buildings are empty. The office spaces are empty because only ten percent of the workforce is actually showing up to work. So that's the finding that, for of my students that actually reached out to a number of different property owners, which we have large diamonds so no time no large scannings have left any of these office spaces. So to speak and Paul can probably you know, qualify my statement a bit more and they have not left but they're not being used for me. So that's where we are so there is a there's emptiness which is not considered to be vacancy. That's the distinction that they're making housing vacancy is real and ranks are falling Israel, so that sort of you know is sort of known. Even New, York Times wrote an article about it and going back to the schools looking at vacant buildings and adaptive. Reuse, that's been going on for last couple of years, mainly because across the board there is a pretty large percentage of old buildings that are not exactly conducive to any kind of particular use right away unless you retrofit them. So schools are looking at those kind of buildings, then last but not the least. You might have read about industry city proposals being pulled back, meaning they withdrew that because it was not going to be approved, there was a big community push back and in the process. The whole project would actually be drawn, not rejected if it's withdrawn, but that's an important fact to know, because while we say that, could you just pause for a second? What was withdrawn things at park? The industry series was three buildings, three or four buildings that were to be converted for rapid reuse, and you know all kinds of cool stuff was going to come up there offices incubators sort of what do you call them startups food kind of places, food production places actually restaurants and water very large, ambitious project that was supposed to kind of bring the economic change to the to the community. But there was a pushback because of its perceived. What do you call it threat for gentrification, which has happened in Williamsburg? It is happening in the Brooklyn Navy yards and around there I mean the fact that the wag man shows up next to Brooklyn. Navy yards tells its story, so the community had a major pushback. That's the project. That's been withdrawn. The developer withdrew that proposal that was sitting in front of philly planning. Well, I mean, I guess the question would be. Would we want to make a recommendation for some kind of funding which would be an expense item for some kind of study along the lines of what we're talking about, and so you know could be DCP EDC, DHS HPD, some collaborative effort, because it seems there's I mean we we're just a group of people. We do not know exactly what's going on. You know we just sort of know what's going on and would that be a meaningful request. It could be for office spaces, I'm not sure yet, because there is not enough data to suggest that it's warranted. It would be. Probably it is probably happening for smaller office. Spaces River is a very particular circumstance. I mean that their situation is entirely different compared to the large sort of lease and the companies at least large spaces. For example, you know Post office is being released by Facebook now I do not know who's going to actually work there, but they're actually at least leasing that space. So though it is empty, it is not considered to be vacant. I'm just giving you a very jarring example in our own neighborhood right there are. There is, though, in a lot of the large corporations. You know I do not know exactly who, but there's a lot of sublease space now coming on the market, which means the large company is not giving up their space but they're, trying to see people see if they can sublease a part of the space. This is only recently in the last month or two months. It's now been you know on the market, and I only know this because not that I'm a broker, but I read it in the times. No, it is true. I think people are doing that people are retrofitting existing spaces to reduce the number of people who can actually occupy those pieces. So they you know, the reduction is so that kind of planning is happening. But if you ask me, technically speaking, does that qualify as vacancy rate no for offices for housing related? We could request that kind of a study through HPD because they are actually the keepers of you know how the vacancy, and because that affects their sort of what do you call it their mandate in terms of brand stabilization and land control issues EDC would come into play when we talk about industry, city or some other large. You know spaces that are being converted, so EDC might be potentially an agency that could help us understand the issue of office space vacancy, but there's no ct agency. That's keeping that because they're basically saying that's all commercial, that's not our problem and hey. What word would you use instead of because I should point out: it's not technically a vacancy. What's another word we could use there. The buildings are empty, they use the word emptiness, they call them empty buildings, just empty spaces, yes, empty spaces, yeah what they say. Sorry, I'm just going to qualify that little more, they say only 10 of the leased spaces are occupied right. So it's not technically a vacancy, because the companies are still paying the rent or the lease, but there's emptiness. So that's that I want to make sure we're clear on that distinction not giving up the space they are we'll be coming back. There was something in today's paper. Next July is the yeah. I read that next July will be the new January, but the question is not that they're not going to come back will still be Chase is putting up a whole new building on Park Avenue complete new headquarters. The question is: how are they going to use the building net when it's finished differently than when they planned it originally pre- pandemic? Now, how are these companies coming back? How will they be using this space post- pandemic as opposed to pre- pandemic? They might be not as many people in the offices. The square footage may be the same, but the number of people will be different, which then will affect the subsidy, not the. What's the word, the other, like the retail around the corner and the lunch spaces, because the local, the local businesses there would be less people, you mean it reverberates yeah. It sounds to me like. Maybe if we wanted to go down this road, that we might recommend two different kinds of study, one about residential issues and one about industrial commercial office building uses so different seems like they're, apples and oranges. If that's where, if we want to go down that kind of a route, they're two different things- and I agree with you Betty as a as an advisory group, our focus seems to be generally speaking, housing much more than office space by and large, I'm just saying as a community. That's what we sort of concern ourselves with the discussion that we had last month was potentially converting office spaces into residential we're not there yet, and that's the sort of reading that I get nobody's there. Yet there's a there's: a request for five percent reduction of the large leased spaces, but there's no whole cell walking away or vacating those from Isis. So that's where the distinction needs to be made. So, there's no way we can discuss converting office spaces into affordable housing, because that point is at least about. I would say, in my opinion personally, it's at least about a year away from today, so maybe next October November there might be his budget is done too. Hey Brad did I see your hand, go up yeah, I'm just trying to wrap my hands around what somebody said originally was we understand where the city's finances are. This is something we talked about on the other board. I was on with the parks and I'm kind of with our chair co-. Chair of let's aim small shoot small right I mean I think we should be very specific. We're asking for a big study, we're not getting we're not going to get any of. This is a pie in the sky they're not going to spend money on doing a study. Scott Stringer's office has done one. The Manhattan borough, president has turned out studies after studies of what they're going to do with the open retail the open office space. You know. Last week we were presented on a big board of all the incentives that Scott Stringer's office is trying to do to help them get money to reuse these spaces. I just I do not know. I just think. Maybe we could really just focus on one or two items. It's just my opinion. I think that's all great things to say, but you know unless they do it for free which we could advocate through our office, but I just do not think sending this to the city right now in any shape or form is even going to get looked at. In my opinion, that's a good point. Are there some specific items that you would recommend? Bert Brad? No, I just I yeah sure, bursts right above you in the box yeah. I I'm all for being very specific about affordable housing that we have now and letting people get on an elevator. I think mechanically, you know doing mechanical upgrades. That's a whole other wax that I do not think we're involved with, but to say to the city: let's put some money towards having maintenance on an elevator. I think is a realistic ass, because it's safety I mean. I have no problem with that one. I think we got that. I agree with Brad. I really agree with Brad on that we should stay focused on what we are best known for, which is our search for affordable housing and, as far as I'm concerned, safety in elevators. I do not know how many elevators there are in fulton houses. It's a number I'd like to know, but that's something that we could definitely focus on and have some impact and then the second one which I would say is which I happen to enjoy is we do approve these sidewalk cafe, so I'm for looking at. Obviously we want to say we want them to help the businesses, but I like the idea going forward more permanent. I think it adds a lot to the city, my opinion, so I do not know if we want to weigh in on something like that. I know they just announced that they could have their heaters and the rest of it, but maybe we should say as a community, we are advocating for them taking the side with space and maybe taking some street space just thought that coming up with transportation community, which I'm sort of part of so I can tell you that that's actually being taken up- and I think one more suggestion which is sort of right now floating not sort of put in place yet is that city also should gain something from it. So it's not because you actually are creating different types of conflicts. So when the public space is being used for private gain, what does city get out of it and what does the community get out of it besides? Well, I think I think one I just it killed me at the last meeting when our representatives sat there and said their answer to everything is more tax. I just I do not know where they're thinking of where this money just happens to come and people that make that top extra larger money they're leaving you can't it's just it's crazy to me. We're gaining what we're gaining is people working and our neighborhood is gaining skills they have somewhere to go. I mean that's just how I see what we're gaining we're, also gaining some city life that we have not seen in a long time of a chase and a rite aid on every corner, we're starting to me to see a bit more community that we did not have before as a positive thing. Yeah. That's just you know, that's how I see it. I think that's what we're gaining we're gaining our communities back, we're gaining shutting streets off. We should- and I understand transportation- has it in their agenda, but we're the ones that are prove it yeah. So now there's a couple of good things. There also, you know some places in Chelsea, particularly even in health kitchen. Actually, the sidewalks need to be expanded. You know now is the time to reclaim piece of the city that we can. Actually you know make permanent. So now I mean there are a lot of good ideas on the table and it does not matter which committee does it, but as a community board, I think a kind of clear agenda as to how we want the street space reshaped moving forward, so there's more room for the pedestrians and more amenities for the community, including outdoor dining and whatever else that follows absolutely. I think that's where we are. I think we are in a very good place, irrespective of the all the terrible things that we've seen. There is a real understanding of how communities can reclaim the city, and that can be done because I lived. I grew up in Chicago where they give permits, based on where you live, for a five block radius around your house that eliminated all the other parking problems they had and it really reduced this and forced people into outer boroughs or taking the train or parking in Jersey all right. You know, that's, certainly a transportation committee issue. Yes, it is let's try to let's try to refocus here, guys, one quick thing Paul before we move away from who does what kind of study I believe Stringer's office actually typically looks at retail vacancy issues more than any other city agency, and that I forgot to mention before we could probably just simply could be a matter of writing a letter to staying at the office. They typically do that every couple of years and I'm sure they're working on it. I just do not have a way of knowing, so we can inquire. That is there something to be done, but I also think varun. The important thing for us is the difference between vacancy and emptiness yeah, because vacancy reports are not going to address the land use issues that we're trying to tackle. So, as burke points out, you know less residents in I mean less occupants of these large office buildings, a lower percentage, because people will need more space inside of them. Post Covid-19 means less people on the streets, less impact, a greater impact on local retailers. So then, I had to correct you one more time: less people in the offices means people you're, giving you're incentivizing people to move out of the city as well, so they're the kind of it's a it's a circular loop. I mean you know, you know what I'm trying to say. So it is that already prompting people to leave the city, because there's no reason for them to come here all right, so yeah exactly and I think as Brad points out we are, I mean, we're seeing more community now. I know that when I walk around Chelsea and Hell's kitchen and I pass by the sidewalk cafes it ai, not a bunch of people from Nebraska anymore, it's people from New York who are out on the streets. So let's Betty do you want to recap, then what we're going to actually vote on? Well, I do not know if we're already. I do not know if we're ready to do that. I mean I think we have gotten two solid things. One is funding for the repair of elevators in our public housing projects and the correct and appropriate staffing of filling the spaces. The slots for the positions for skilled elevator staff or engineers, so that's one thing, and if we follow up on Brad's idea funding, I guess I guess fi, I guess I mean we have to always talk about money, because it's a budget so funding to support sidewalk cafes and that's as far as I could get, and it seemed that I do not know whether we have a consensus about asking for money for studies. Maybe that's unrealistic, and we should not do that. I have one tiny item to bring up having to do with open streets, which is budgeting for the expenses that are presently being born by individuals and the block associations to maintain the barriers replace them when they get wrecked and purchase the signage that's needed to mount on those barriers. Is that something veron is that something sounds like transportation is tackling. I know that when I was on that committee we talked about that a lot yeah. I think it's going to be one of those budgeting cam. I think that's a transportation issue I'll make it okay. I really wanted to take it to them. If it's not that we could, I mean look, we could like that. I mean to be introduced, it's all going to get smushed together by the by the Budget committee. I mean I feel attached to that item pam, because I'm in a church responsible for Thompson Street in the village and yeah, you know you're aware that it is not without cost to maintain. Yes, I have 22nd street between 7th and 8th and my in my Block Association, which is an open street and has been for several months. We've spent beyond 250 bucks just to equip the barriers to get the barriers, the appropriate barriers, not the big wooden jobs and also the signage. It's going to become an issue of manpower to set up the barriers and in the mornings and remove them in the evenings, because we can't hope to rely on our local citizens to step forward voluntarily and do that. Presently we have that and we're okay, but it can't last and that needs to be considered as well. That's sort of that was part of the selling point of the open streets, though, is that the bids and the residents would take care of it. That's how it got through the process. It's okay, those guys get paid for what they do. No, but it was bids it was bids and block associations both, and I see your point that if we can get city funding for that, it would be better to make that request. It would be more reliable for sure. Well, it's not just bids, I mean you know a church. Any black association are in much different financial consideration. Exactly I mean if we want this whole concept to be successful, it needs to be reliable so anyway. I particularly like that. I'm thank you. Thank you know, even if it is a transportation issue, you know it's land use in the sense that we, the citizens, are using these spaces and we want them to be successful and it's a land, it's actually a land use and that it's taking property and using it in a different way, yeah and it the impact, is on the quality of life, which is something we can certainly address, so very creative. I think how about some other ideas any other ideas, so I do want to also point out that I have another idea. If you want ideas, I got a lot of ideas. I think where are you a lot of times? We are an island, we should think dutch we should be thinking. Land use is water. We should be utilizing our waterfront, not just for a beautiful park we need to be, it could be a floating farm. We need to be thinking about land use out towards the water. It's just my opinion. I thought you were. I thought you were not going to get it there to pandemic. Maybe we could use a farm or a floating hotel that could help the homeless something I thought you were going to talk about a building code that would allow for drone deliveries. Brad come to my come to my studio. If you really want to talk about floating farms, I love the Floridan farms. My studio is looking at Ps76. Believe it or not. No idea we brought it up at the other meeting. But to me that's still a land use issue it is it is. It is, and if we- and you know, I'm conflicted with the notion of putting forward these priorities and also having budget constraints and being realistic abroad, as you recognize floating farms and floating homeless shelters is a grand scheme I think in when we have a stronger budget. Let's talk about that on the other side of it, I have been talked to by a number of people that when we talk about budget priorities last meeting, I said, let's just wipe them all out, and I was told that if we do not keep our priorities in place from previous years, they won't be right. You know it'll be hard to get them back in again in future years, so to keep our the other things that were in the budget request from last year, such as code enforcement issues, building department, building issues, land use on neighborhood needs things like that, then we keep them in there, but we recognize they're not going to be a high priority, placeholders exactly so Brad. Let's talk about water farms. Next year, yeah okay, I mean we could we could I mean it's all on our list. We can, you know, put him back, keep on going. I guess, can I bring up more yeah one more issue? It's housing related and it's been sort of. You know tossed around quite a lot. We had a building on West 18Th, Street, residential building that was supposed to be mass timber supposed to be what mass timber it was. A similar construction, timber frame high rise and that was basically pulled out because city will not approve it, and all of that is happening. City is now a little more sympathetic to it. So I'm not going to get into that particular project alone, but decarbonization in our community should be take taken into account when we actually have. When we start looking at new proposals and new buildings, we keep doing steel frame and concrete buildings all the time, because that's how the industry is set up but encouraging alternative materials such as mass timber, there are many others should be something that we should be able to have a sale, and you know this community actually has I mean this came up, came to my mind when we were actually looking at terminal straws. You know the timber frame building and then we putting steel thing on top of it, and the justification was mainly because city will not approve timber construction from far code point of view, but mass timber actually does deal with far code as well, and David can actually sort of testify to that as well. So I think we should try and I'm not saying that we should make the entire neighborhood timber frame, but for newer projects coming up, decarbonization should be put on the agenda. Sustainability should be put on the agenda. Water harvesting should be put on the agenda. Solar panels should be put on the agenda. Geothermal should be put on the agenda. These are the things, but I mean we're still talking about. We we're using 20th century tools and we are 20 years into 21st century. So I think some of these items need to be sort of woven into how our approval processes are shaped. Moving forward. I do not know how we do it, but there should be some mechanism in place. Well we're talking about the budget right now. So is there a way for what you want to be described as a budget ask questions? Well, one way would be the big new development, the building codes. Would this be a little bit yeah? I was going to say if there's a Europe, where you know they're trying to change or up zone, that could be something that we could say. Could there be put money in the budget to have a category for sustainable material or our big one? Environmental is what they're doing with the garbage, and you know I do not think that's. I think it's a pretty good idea, but for budget wise we could say: can we get some money in this city planning to add it in into their application? Just one idea, because you're not going to get it on a townhouse renovation, you're going to get it out of something like Hudson yards right yeah. So it's going to be on a bigger scale. Yeah. I do not know. I do not know which budget item it would certainly. I do not know the line item, how what how we can describe it but sustainability guidelines and how they actually get woven into city's approval process. Maybe there's something that we can ask DOB and DCP to come up with jointly, because one makes sort of you know one sort of makes the regulation the other one enforces it. So the two agencies should probably come together and find a way of making sure these things happen. My understanding is that for that 18th street mass timber building, it was to be where la Luncha net was that the city was working with the developer on that, and you know, was open to accepting it and looking at ways that the timber framing could meet the equivalent of the building code, and I know they got a good ways down the road with it, and I think at some point the developer just decided it was too complicated and backed out. I do not think it was reluctance on the part of the city at that time. No, I did not. I did not say that I would think that they pulled it out. They pulled out of the whole team going back to Bert's point about the budget issues. I think you're raising a very valid point, a very valid concern, and maybe what we do is try to tackle it at one of our meetings and come up with a letter to the appropriate agencies to change policy right directly. Instead of having to be a part of a budget discussion, let's have a policy discussion about it. No, I agree with you Paul. I think that's what other parties said. I do not know which line it fits into, but it's a discussion that we can have in the conversation with our next meeting or something yeah. I think that, let's do that. Let's take that approach on that one. Let's try to set. Let's try to figure out a letter. We want to write to the appropriate agency to work at policy change to improve sustainability and bring us into the 21st century in our construction engineering projects. So I have a suggestion on a practical level, because I'm practical minded what if we approach the concept of having a study? I know we're not talking about spending money on studies, but this one would be very sensible of in Chelsea, and this research should be doable all of the buildings that burn fossil fuel, either oil number four or number two oil or natural gas for heating for their heating systems and find and do a study about how many of those boilers what their ages are when they, when they're reaching the end of their age of their usefulness at about 40 years or 50 years. Some of them last that long that there should be some way to require the building owners to replace those devices with sustainable heating systems. That would be a study worth doing. Then. You could have real impact on the sustainability in the future, going forward either converting to electricity or geothermal or solar, or a combination of all those things. It's worth talking about to the to Buren's point about sustainability. Yeah again this that's not really a budget issue for us this week. It would be if it was to finance. If you were asking for the financing of a study to give us the information, we would need. Okay, I can I can frame any policy discussion as a study and get money there. You go it's just. I know it's just, but let's try that let's try to like hone in a little bit here on our capital and expense line items for fiscal year 2022 and what we can get accomplished as okay, and I think these are healthy conversations I have- and we should have an agenda item at a meeting to talk about how we can tackle sustainability in the city and figure out ways to do that. I do not think this is the right format for that. Okay, it is very interesting, pam yeah. I love it and listen. I can go off on that, but I'm not going to because I'm asking other people. Why do not we? Why do not? We just go back to the placeholder concept and it seemed to me that code enforcement, expanding and reinforcing code enforcement and DOB enforcement, particularly for our special districts and in our special districts, are a focus for keeping the placeholders. So let me ask this: everybody got the dropbox link to the spreadsheet that lists last year's spending priorities right Jesse yesterday yeah, so I mean if we just want to agree as a committee we'll just leave any ongoing budget line items in there as placeholders. Can we have an agreement, yes or no on that, so those in favor of keeping all last year's placeholders in place Jessie's just we've got a point caveat to that. Is that you, as reported by the agency, I am not saying that you know the problem is solved, but you did get something funded last year, so one of the one of the expense items was listed as being funded, so I would just say: if that's okay, we can either move to continued support level which is sort of a rank below or just remove it completely and saying. Thank you we're yes, we're done. I would I would I'd agree with. That. Is everybody else there's now, just if you look at if you look at the chart, you'll see that, for instance, code enforcement has specific topics of code enforcement, so one has to do with dedicated inspector for special district enforcement and they, the answer was. The agency agrees with this request will accommodate in part another one was code enforcement, additional funding for buildings, department enforcement, inspectors for non- compliant ADA entrances and says the department has increased the number of inspectors- citywide. That's just you know, and then there's a number of other ones. Now here's a study so we could skip since we can but Betty you and I, if the committee's in agreement that we're going to keep the budget priorities from last year and as Jesse points out, anything that is continued funding will leave on anything else. We can take up we'll just clean up the actual list as long as it agrees that we keep those placeholders in place. That's our first, but do we, but do we? Do we keep in place things like modify the special permit process of Wall Street parking, that's of a different nature? Do we want to keep that in? I think that the committee just said anything that was in previous years as a placeholder that needs. We we're just going to recognize it's a placeholder, it's going to be a low priority, but we're going to keep everything in from last year. That was not funded or is not continuing. You know like, as Jesse pointed out, we'll clean out the list, but everything else says I think Betty you said you'd had meetings with DCP and they were amenable to doing that. This has to do with the luxury high rises going in along the high line where they you know they asked to exceed the 20 parking spaces too. You know how long ago we had a meeting with DCP about that. I could not even tell you how long ago yeah no, we tried this year at the beginning of the year David to try to actually because every year they go. We want to talk to you about this. Please follow up and you know, and it always gets sort of pushed to the back, because there's always a euler that pops up or something else pops up, and so this at the end of 2019 and through into the beginning of 2020. I actually was chasing down DCP to follow up on this issue, because there's ice they're still not doing what we want them to do. Basically, and well, it's still a valid issue. I think we should leave it on there. I agree with you because I do not think we're just actually where I just think like what Paul said, I think is we'll. We have to recognize that, whatever I think you guys are discussing right now, the top priorities to the one two, three, the things that you want to send to the budget task force to say this is the most important last year's priorities are still important, but we recognize that those are all going to sort of be shifted down, and you know I have to say with regard to Brad's suggestion about use of the streets for restaurants, that's topical because it's a demonstration project, you know. Sometimes the city will do things like close streets like they do park Avenue in the summer on weekends, to give people a glimpse of what it would be like. If people could pedestrians and cyclists could take back the streets, we have that happening by accident on a huge scale. Now, so you know, I think it's good to strike while the iron is hot in this case. So to me, even though it seems more quality of life than something urgent in terms of looking ahead to the long term and making it a permanent sort of thing, you know it's. This is the time to do it. Simply because of practical reasons, so we have two new things as I, as I see it. Well, the we've got the restaurants, the outdoor, dining, okay and we've got. We've got the elevators okay, we've got the outdoor, dining and we've got the elevators at Fulton and Chelsea Elliott, and we do not want to do to propose studies and I think and betty what I would suggest we do to pull in Pam's point about open street funding for the citywide level is on the restaurants. A lot of them also happen to be on open streets. So, let's find a way of incorporating the language together. Do you think it should be combined? I mean, I think it's a more logical way of getting the funding, for that is to put it in with the small business appeal, because a lot of these, like I know, a lot of the streets that have restaurants, are pretty much closed off to cars now, not all of them, but there's some and that's a good way to get about tying these together. Okay, I guess we could we could. I think it's a little apples and oranges, but I guess we could do it that way. So we have two and a half new things that we would say are we are we happy with that list of new things? Do we know no other new things that want to be brought up? So I guess that's it. Then we have these two and a half and then we've got recycling. Our old proposals are we. Are we good on that? Yeah sounds right, yeah, that's what we that seems like we've arrived at with Consensus Jesse. Are we are we on the right path, yeah? So as long as you and Paul work on the together afterwards and submit something to the budget task force that it clarifies those the ranking right of what they are, who you want? What agency you're expecting the request to go to and if it's a, whether it's capital or expense? It's that's fine, that's completely fine and we have to do. We have to use table one table two and table three. I think it'd be easier for you guys for that, because you can just add your new I'm assuming the two and a half will be the first three right priorities, one two and three, and then the others will just you'll just rank roll down roll down or turn them into continued support or just say remove, because it's been funded, whichever one you want to do, okay and so then that's fine, and I think it sounds like what you guys done is actually combined table two and three into sort of our top priority ones that we just talked about. Yeah are related to the pandemic. Right and I'll just say one other thing I think, there's nothing. I think you do not necessarily committees have tried very hard not to sort of like go into the scope of another committee in terms of recommendations, but that does not mean you guys can't, or the co- chairs of this committee, or maybe through Bert at the budget task force say that they we recognize, there's these issues that are sort of go beyond what our normal sphere is, and we think these are really important. So we're going to back up, you know the transportation related things or the or the you know. I will say a lot of the street stuff. Just so we're all clear I mean, but they all go in front of actually more in front of BLP. You know like a lot of the future. You know the you know they used to go. All the restaurant stuff goes in front of BLP, and so just you know, I think that's something to be aware of as well. So but yeah, that's fine. So as long as you guys vote and you're all contingent of the can you I apologize just because it was a what would the two? The two and a half things are again betty the outdoor dining for restaurants, the city streets, which could be a subset of that or separate call that open streets? I mean open streets. Sorry, that's what I meant and the repair of elevators in the public housing projects, which would include staffing up with appropriate engineers and filling the lines that need to be filled. Yeah there'll be two requests there: one capital improvement and one operating expense right. Okay, you know when there was just so I understand, and I do not want to start us off. I mean I apologize if this opens up a whole nother can of worm, but are we prioritizing in that way? Are you saying? Does that matter to the budget task force put the elevators first? Well, the elevators. Are everybody in favor of elevators. First raise your hand there we go all right, elevators will perform restaurants and dining great, and we, I would just ask if we want to include boilers and roofs in that, though, because you know when it was written about in the New York Times what bad shape Fulton House was in. You know those were mentioned as well as major problems. These are the three sort of major ticket items you got, elevators you've got boilers and you've got the roofs. These are the three items that are killing nature yeah. So it's basically everything except for the brick which is the last not last night, not to mention Jessie, hot and cold water lines and the risers Jesse can I answer? Can I can I ask Jesse or Alzora? Betty? Is the NYCHA working group putting together a budget request as part of our Community board budget process? No, I do not think so. It does have to come through housing and us and whatnot. Okay, all right now, just so just so. I just want to create what usually happens here. Is that things like the roofs and the boilers and the and the elevators? And I'm and I'm not. I am not from defending NYCHA all here at this point, but that's their big ticket items you're all right about it and that's where they that's what their folk. That's what they tell us that they're focused on fixing right. So then one what every year! That's why we go to the tas, because if we say the boilers and the roofs and the elevators, their response is going to say, yeah we're working on it right, and so I that one of the reasons why we historically have gone to the tenant associations is because there's other things, there's other quality of life and public safety, things that do not get that sort of get pushed to the bottom or ignored by NYCHA that we do so. I just do not want to. I just want to be prepared that there will be a sort of if you look at what NYCHA or nitro requests are in the past even last year. You know there were things like front doors cameras. You know new lobbies, those types of things. Those are the things that the Ta had communicated to us. So I'm not stop. I do not want I'm not trying to get involved. I'm not trying to impede this conversation and say that the items that you guys discussed are not important, but I just wanted to be aware that there'll be another set of information coming in from the tas. That will most likely say yes, those are obviously all big ones, but we know NYCHA is already going to be focusing on those. What we want to advocate for is you know the lights in front of our playground that are not being paid attention to or the you know the things that have not been the you know. The trash compactor doors that have not been hector has his hand up so I'll defer. I mean T.A person to tell me if I'm wrong or not yeah, I'm like Mike or yeah. Actually, no, that's a that's a really good point. Jesse I mean you know I the type of strengths I mean I was a little confused as to I guess the budget timing that we have here I mean. Are we having this? Is the preliminary discussions or we're about to vote tonight for the budget items that we're going to put in today? Because, honestly, because, if I had, if we had the time, I would go back to the taa and both houses and asked them, you know what would you maybe the top five I get out of the top five? We can all have a later discussion on it, but if time is an issue here, then obviously we would have to go with. You know the top three, which is really the heat elevators just to clarify. I'm going to the budget task force is meeting on Thursday yeah, so I usually reach out this week to get in. You know either to check in with all of the Ta presidents to say this is what you requested last year. Is this still the same request? Do you want something new or has things progressed? For example, I know there's certain things that Darlene has, let me know have progressed you know, and so we have moved if you notice how we did it. Last year, with the with some of the Chelsea elliott requests, we made them actually continued support because things have been began to move on some of the issues that she had raised to us, and so we, let's how about you and me, talk tomorrow if that's all right, yeah, because I do not want to drag this out. I do understand that you've already got a process, and so but again, I think it speaks to a broader conversation about how we can get NYCHA more inclusive or how we can be more inclusive, with NYCHA going forward with our budget, because it's always been a bit of a kind of last minute type of quick call kind of thing rather than a you know, maybe a more thorough conversation. I would just like to clarify something because earlier we said we wanted to be very focused and specific, so we talked about the elevators and now it's being suggested that we add the boilers and the roofs. So I'm not sure if that direction is the way we want to go, because those are like very big items, and I thought we wanted to do some wanted to suggest something that was very doable. Well, let me chime in on something here. Okay, the reason why I left my comments only with respect to elevators is because of things boilers. You know the heat, hot water, the roof facades. You know pointing up brick. Those things are already being handled because there's an agreement with the you know with Hud and those things are covered already so they're dealing with that we've got. You know constant surveillance of the hot water system here, heating system elevators are outside that. Well, that's a good point they're outside that. In that sense, you know we do not have people monitoring the number of breakdowns and that sort of thing how long it takes to fix an elevator. How many times in a particular day has it gone down that sort of thing I'll tell you this much the elevator crews that work on the elevators had been in the past and probably are still today. For a time being, they have to run around to different developments. You know far apart from each other, now they're putting into pods that are close by so that they travel a short distance. One of the cruises headquartered in my building here, 10th Avenue, so they do not have to run up to the Bronx or wherever anymore they're. All thinking close by, but the elevators are a serious issue here. Serious it took us. You know- and I worked on this- you know with even greg Russ helped you yeah when we first met, we've got the compactor finally replaced here took six months or more compactor. The elevators are something else. There's going to be a tragedy here. You know it's happening. It seems like that you're making a very good point. If the Fed requiring work on the on the boilers and roofs that maybe we should just focus on the elevators, then yeah, I would I just leave it at that, and let people know that really is an issue yeah, okay, all right, so we're going to keep it on. Just the elevators, then is that can we have a quick show of hands on that? Is that good, yeah all right? And I think that that's going to be then we'll be able to call for a vote. There is somebody attending a public member of the public member is attending if that person wants to add anything to this conversation, if you just raise your hand either, I think it's star nine to raise your hand if you're on the phone or just hit the raise hand button, and if not, I'm going to call for a vote before we. So we can wrap up this conversation because I know a couple: people are trying to get off. This call right. I'm not seeing the hand go up. So is everybody good, then, with the two, the priorities as described by Betty Betty, and I will work on getting them formatted onto the form to get to the budget task force was meeting on Thursday, so we'll have to get it to them before then, and Bert is on the budget test for so he can clearly represent our viewpoints pretty strongly Kerry. Did you have something to say? I saw your screen light up, I'm just ready to vote all right, excellent. Who am I all right? All in favor, then you can do a physical raise of hand I'll be able to see almost everybody, except for Carrie and Michael Hi Carrie Aye all right seems unanimous. Thank you. Okay. All right, I think we're going to be able to wrap. I just wanted to make one other notification to everybody. The Flatiron bid was supposed to be on this month's agenda. We did not do it this month because they really we met with them. I had some meeting with them and Jesse and Tina. I think we're all like a month ago there was no real change to the bid proposal, so they're not coming forward yet, but when they do they'll come back to us again, just if anybody has any questions on that, you can really judge me I'll, be happy to talk about it all right. Thank you. Everybody and I know there was only one item on the agenda, but you came out and we got a quorum and that was very good, very productive. Thank you. Everybody good night guys. Thank you bye. Thank you.",
            "summary": "I've got some ideas about that, but rather than listen to myself, maybe we could open the discussion on mainly expense budget items and Covid-19 related items.\nYou know budgeting for getting budget information by from two ways, one from tenant associations Right and literally just calling up the tenant associations for Fulton, Elliot, Chelsea and harborview and saying what do you guys, need?\nYou, know the Chelsea NYCHA working group so much and wanted to make sure that we were advocating-But. It can be, it's usually all capital.\nWhat we're doing now is the very early stages of what are the budget priorities from our community district right And we're taking a perspective from the land, Use committee.\nAre there things within the city budget that we think need to be beefed up, whether it's a ongoing expense or a capital expense?\nIf the NYCHA working group has any land use, perspective, items that are coming out, that maybe housing will address something on the budget priority from the Nitro working group, but we as Lane juice, perspective.\nI personally think that at this point in the city's economic situation, that those things do not feel to me to be high priority, those ones that we've had on our list-You know for a long time and that we may want to try to generate some new recommendations more relevant to our situation in the city.\nI, send you an email, but that you had been talking at the last meeting about retrofitting or converting buildings that are underused or empty into other land uses, which I thought I thought is very relevant at this point: Or it could be relevant and that we could request funding for certain studies along those lines and you'd think that maybe architecture schools are looking at that already architectural schools.\nI'm, looking at that, actually, even before Kowitt's truck for a variety of reasons, so New York City is known to have pretty high what you call it vacancy rate, irrespective of what happens the pandemic, but because the pandemic, I think the vacancy rate in housing apartments is 13.8 now and that's the data that actually is generally collected by HPD and real estate.\nWe want to make a recommendation for some kind of funding, which would be an expense item for some kind of study, along the lines of what we're talking, about, and so you know, could be DCP EDC, DHS HPD, some collaborative effort, because it seems there's It could be for office, spaces, I'm, not sure yet, because there is not enough data to suggest that it's warranted.\nWe could request that kind of a study through HPD because they are actually the keepers of you know how the vacancy, and because that affects their sort of what do you call it their mandate in terms of brand stabilization and land control issues EDC would come into play when we talk about industry, city or some other large.\nIf we wanted to go down this road, that we might recommend two different kinds of study, one about residential issues and one about industrial commercial office building uses so different, And I agree with you Betty as a as an advisory group.\nSo now I mean there are a lot of good ideas on the table and it does not matter which committee does it, but As a community board, I think a kind of clear agenda as to how we want the street space reshaped, moving forward, so there's more room for the pedestrians and more amenities for the community, including outdoor dining, and whatever else that follows absolutely.\nThe important thing for us is the difference between vacancy and emptiness Yeah, because vacancy reports are not going to address the land use issues that we're trying to tackle.\nAll right, I know that when I walk around Chelsea and Hell's kitchen And I pass by the sidewalk cafes Let's Betty, do you want to recap, then what we're going to actually vote?\nSo that's one thing, and if we follow up on Brad's idea, funding, I, guess I guess: I mean we have to always talk about money, because it's a budget so funding to support sidewalk cafes and that's as far as I could get, It seemed that I do not know whether we have a consensus about asking for money for studies.\nI have one tiny item to bring up having to do with open streets, which is budgeting for the expenses that are presently being born by individuals and the block associations to maintain the barriers replace them when they get wrecked and purchase the signage that's needed to mount on those barriers.\nI know that when I was on that committee, we talked about that a lot I think that's a transportation issue.\nThat's still a land use issue And you know, I'm conflicted with the notion of putting forward these priorities and also having budget constraints and being realistic abroad, as you recognize floating farms and floating homeless, shelters, Is, a grand scheme I think in when we have a stronger budget.\nIn again in future years, so to keep our the other things that were in the budget request from last year, such as code enforcement, issues, building, department, building issues, land use on neighborhood Let's talk about water, farms.\nI think you're raising a very valid point, a very valid concern, and maybe what we do is try to tackle it at one of our meetings and come up with a letter to the appropriate agencies to change policy right, directly.\nSo I mean if we just want to agree as a committee we'll just leave any ongoing budget line items in there as placeholders.\nThat you, as reported by the agency, I, am not saying that you know the problem is solved, but you did get something funded last year, so one of the one of the expense items was listed as being funded, so I would just say: If that's okay, we can either move to continued support level which is sort of a rank below or just remove it completely and saying.\nIf the committee's in agreement that we're going to keep the budget priorities from last year and as Jesse points out, anything that is continued funding will leave on anything.\nYou know like, as Jesse pointed out, we'll clean out the list, but everything else says I think Betty, you said you'd had meetings with DCP This has to do with the luxury high rises going in along the high line where they you know they asked to exceed the 20 parking spaces.\nWe have to recognize that, whatever I think you guys are discussing right, now, the top priorities to the one two, three, the things that you want to send to the budget task force.\nThink it's a more logical way of getting the funding, for that As long as you and Paul work on the together afterwards and submit something to the budget task force that it clarifies those What agency you're expecting the request to go to and if it's a, whether it's capital or expense?\nI think it sounds like what you guys done is actually combined table two and three into sort of our top priority ones that we just talked about.\nI am not from defending NYCHA all here at this point, but that's their big ticket items you're all right about it , That's why we go to the tas, because if we say the boilers and the roofs and the elevators, their response is going to say, We're working on it right, and That one of the reasons why we historically have gone to the tenant associations is Because.\nI'm, going to the budget task force, Last year, with the with some of the Chelsea elliott requests.\nBut, again, I, think it speaks to a broader conversation about how we can get NYCHA more inclusive or how we can be more inclusive, with NYCHA going forward with our budget, because it's always been a bit of a kind of last minute type of quick call kind of thing rather than a You know."
        }
    }
}