{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Health & EnvironmentVirtual meeting",
            "publishDate": "2020-12-04",
            "shortDescription": "Health \\u0026 Environment December 2020 Virtual meeting",
            "lengthSeconds": "2:03:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Dvo0oVE452E",
            "fillerWordCount": {
                "uh": 396,
                "um": 296
            },
            "readTimeFullTranscript": "56 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "vaccine": 36,
                "testing": 24,
                "health": 20,
                "care": 18,
                "hospital": 16,
                "epidemic": 14,
                "zip": 12,
                "coronavirus": 12,
                "day": 11,
                "period": 11
            },
            "wordCountSummary": {
                "vaccine": 8,
                "health": 7,
                "care": 6,
                "coronavirus": 6,
                "testing": 6,
                "epidemic": 5,
                "events": 4,
                "hospital": 3,
                "vaccines": 3,
                "flu": 3
            },
            "fullTranscript": "Yes, so, oh, what's up so, yes sure everybody else's somebody watching inside edition. Who was that okay, hey Daryl, hey the beard is growing, the beard is growing, yeah I know it's time. I am leaving in a couple weeks. I was gonna, try to wait it out you're funny, and is that Paula helping us what a nightmare are we waiting for Steve, I'm assuming so this is such a nightmare system I can't believe we got stuck with the web. My agency actually stopped using it for public meetings. Yeah. It's like it's unbelievable. What are you using now Daryl games? We use zoom for public ones. We use zoom really is the best. It really is. Yeah I mean also we use go to meaning internally yeah they've been good too yeah. Go-To is good, I, don't really like teams either yeah I. Don't like teams yeah, it's not that it I, don't like it. This just makes you. Oh sorry. Let me not crunch in people's ears. Paula did Steve say anything that he'd be late. I think he'd have to be on time to make it have an impact. Oh can we spread? The Webex paint around like switcheroo I, think who's the other committee, that's taking the usual one Ariel oh I thought what folks discussed at the executive was that the committees would switch off. They would alternate mom, hi Natalie, hello, Natalie. Is there a new deputy Vp? No, that position is gonna. Stay vacant have had traditionally in the past for the for what's left. We do, however, have a deputy director of community affairs. April Adams, who is still has been and is still the liaison to district seven and nine, so she's, just taking on her responsibilities. Just by way of how a lot of all the responsibilities were being redistributed, I'm just laughing I would not want CB7 nothing. We can't say anything we're not being recorded yet aren't we are that's the problem. I met nice folks at cv7. They, even though this past couple of months has been a hot mess over there with that one issue, but they've gotten a lot of press but yeah. Now we will have a lot of people ready to go for the application screening process. Two people from CB12 have already turned in their application. Very exciting, well, I'll share a funny thing. I heard this week, if you don't, if no one minds, I was at the hell's kitchen Hudson yards alliance, the bid over there and they're talking about Bella Abzug Park, which I have not visited. It sounds fun, but they have. The largest statue of a gorilla in the world begs the question: how many statues there are of gorillas, but they have the largest. That's a good question too. That is my mom yeah. That was a that was done. She had that done when she was 18 for her parents and when we were cleaning out my grandmother's apartment. We found it we'd been sitting under the stairs for 30 years, so I never knew it existed. We put that picture also on her retirement. Kick she got a kick out of that good evening. Everyone! It's Marietta from the comptroller's office. I've been here just very quietly, so I'll be here for some other meeting great thanks for your patience. I texted, Steve I didn't hear peck, but what the hell I had it last night for the land use committee. You don't see that button. That says, like start video like next to the mute button, no are you on a computer or what are you or what are you on? I'm on my phone I can see it too. The hell is going on. Have anything to ask you to start a video when you we're logging in no, oh, you might have to Lo I hate to say this. Maybe law got a log back in all right. Yes, I should try it again. Yeah I mean that's. The only thing I can think of. Okay, all right I'll be right back all right. One more video I just said Star video. So something could be wrong. I'm on my phone too, with it so but I see mine, I see the video one at the bottom. Do we get a baby sighting today, no I plopped him in front of the TV I know I shouldn't, but he needs distraction right now, all right well, for whatever reason I don't seem to have video so you're lucky. You don't have to look at me tonight. Okay, all right, I see the lovely Betty Levin hi. All right now, I got a little blue thing that says lock this video. For me, what the hell is that disappeared, Jesus all right, I, give up all right. Betty is present. Francisco Alvarez, Absent, Tanya I heard Tanya Daryl's there, Catherine Dears, Nation Diaz Sally Fisher. Here Nate is here. President I, don't know if I haven't either Barbara Frazier the Jane Mazer one two, three, four, five, six, seven, eight one, two three four five okay, we have a quorum meeting is 7:12. is Dr Gordon with us. Yes, hi, Steve, okay, who just spoke Steve. That was me Pete Gordon, oh no I thought I heard no one else. So, actually, before I get to you, hi guys, this is Nye Whitaker from the space team. Can you guys hear me? Okay, all right, so Lorraine is not going to be able to join us. No Lorraine had a personal emergency. It seems like someone else is not on mute. So there's a lot of interference. Yeah, there's like there are a lot of people, not on mute people Steve. We also have Mary, Anderson and Richard Allman are here, just apply it. I'm sorry Steve just wanted to remind you that I do have to go to a 7:30 to also cover for Lorraine, so I'm being totally respectful of everyone's time but I apologize. We have a couple of different community boards that are meeting tonight that we are all trying to cover as a team. Oh okay, well, okay, I thought, okay, I misunderstood because I thought she said she. He was the one who had to leave at 7:30 and was leaving you behind. So you that was the original. No you understood correctly. She just had a family emergency come up since then so she's unable to cover at all. So I'm going to cover both the 7 and the 7:30. Okay, so I tell you what I'm going to Dr Gordon. If you don't mind, I'm going to bump you down slightly and I'm going to move Nye Whitaker up above you and Pauline. Can you wait until can I hold you until after Dr Gordon speaks sure? Absolutely okay, very good! Thank you! Okay! So Nye Whitaker is representing the New York City test and trace corps. We know you from some other capacity: you're, not a stranger to us. I can't quite place it, but could what they I know. You you've been to board 12 before okay. How do we get rid of this interference? Hold it like? How do we get? How do we get rid of this interference? I can barely make her out yeah. Can everyone hear me yeah? This is much better I appreciate the chair. For me, that's separate from being a new member of the test and trace training, all right, very good, so, on behalf of the test and trace team I bring greetings during this holiday season. I also know that this is a difficult season for many, and the current pandemic. I wanted to just stop with two primary asks. The first is that the chest and trace team is looking for activities, so we can partner, I'm across CB12 anything from elected officials that may be hosting food drives or coat drive for doing food distributions to any activities that might be going on at local pantries. Please yeah I'll send them to you: they're zip codes, 32, 33, 34 and 40, and if you could also okay, if you could also send your information to Steve that he can distribute to the committee I, don't know how to navigate Webex. So I don't even know where to find the information you post easy, so follow, send tested, Tuesdays I'll be taking place, start on December and then following pretty much starting at the part of Harlem working north to Washington, but and tell me again what is that day of action so the day of action? So if you have any okay, so it's not really a day of action. It's a week of action! Okay, always you don't have to send us the positivity rates, because I'm going to read them off right now, the for the seven day period. I'm sorry! Now! I did you finish your report? Yes, thank you. Okay, all right! Steve I have a very quick thing to add to nice. Information. Okay! Is that the famous Natalie Espino from the borough president's office, the infamous Natalie Espino, welcome no I just wanted to point out. Since you had asked about elected officials having events tomorrow, the local elected officials are having a Christmas tree lighting and, coincidentally, you guys had already planned an outreach at the same hours. He was very prescient over at Compton Eye associates which of course, will be hosting a testing site next week on the 9th. So you will have already a bit of a little bit of a crowd, not much they're doing it virtually but having the guest speakers be live at the tree, but it's kitty corner, of course, from that test site at Compton, Eye Associates. So it's a good time to meet. You know your some of your folks. Your volunteers and Gail always is good to roll out and help give out flyers and PPE and Natalie you. Where exactly is the tree lighting? So the tree lighting is on Broadway and Dykman. My I don't know exactly where it's being sponsored by the Inwood merchant association, but the I think it's right at the entrance to that open dining street, oh okay and yeah, and so that will be happening. You know they'll do a short five o'clock spiel there, but it'll be good for them to direct some traffic over to Laureen right, very good, okay. Well, we only have five more minutes with Nye I just want to keep her as I give the latest positivity rates for our four zip codes. So- and this is for covering the seven day period from November 24th to the 30th and I took this off. The health department website, which is full of useful data, so zip code 34, which has always been our best zip code, has always had the best ratings and the lowest number of cases. It has suddenly become a real problem spot. It's now our worst zip code. For this seven day period, it's number 40 out of what is it 177 zip codes in the city of New York, but the 17 day, positivity rate is 6.35 percent. 74 people found positive during that period. Zip code 40 is down the line: number 80, 4.3 59 new cases, zip code 32 is in the 87 spot, 4.75 percent 93 new cases and zip code 33 is in the 90s spot at 4.66, with the 75 new cases, so in this seven day period, 301 new cases in our four zip codes. Now what I want to ask you is this question came up in another call that I was on with Lorraine yesterday the significance of the zip codes. What exactly do they represent? I had assumed all along that they represented the residences of the people who were being tested, and yesterday she said that she thought it was actually the locations of the testing itself and that this did not reflect the actual residence where people live. Did she happen to tell you what she found out if she was going to look into that question further Nia? Are you still with us I? Guess we lost knife, but Pauline, do you know the answer? The sound is all muddled, again she's having audio issues, it's just her. It's no one else. Oh no, that she's too nice to have audio issues. Why do you say something like that? Biola, because everybody else is muted she's, the only one in the microphone? It's not her fault. It could be her internet connectivity. It could be a million things Steve, okay, we try not to hold it against him. Could not. Could you try again one more time yeah try again. Yeah, oh, could be where the person does live. Okay, good! That's that that's how I've been we've been representing it for the last eight months or whatever. It is very good all right! Thank you. Can I ask you a quick question yeah, who is that Daryl go ahead? It's Daryl hi! Do we have any rapid testing sites in the area, good question and I? Yes, okay, all right, very good, so whatever you send me I'll send that to the committee members all right, thank you. Nye I, hope, Community Board 12's health committee was at least as good as yours all right. So thank you. We do have in our district. We have at least two or three health and hospitals run testing sites and I believe. What I now heard is that the one in hybrid is doing rapid testing, okay, all right okay, so we do have some traditions on this committee. One of them is to observe World Aids Day every December by having it getting an update on the situation with respect to HIV Aids in our community and we're usually fortunate enough to have Dr Gordon Peter Gordon, the medical director of the comprehensive HIV infectious disease clinic at New, York Presbyterian hospital come before us and I'd say if this is a year when the infectious disease doctors have really come into their own and where we've really learned to respect them more than ever before so Dr Gordon. Last year you told us that was aiming to eliminate hello. Yes, hi Steve. Okay! Last year you told us what is the end of the epidemic, I'm getting feedback here yeah. You told us that HIV Aids epidemic by the end of 2020 we're now there. The goal was to get new infections down to 750 per year and so anxiously awaiting on where things stand. Well, thanks Steve I brought some slides, but after the late start and listening to, obviously, if not weightier, at least as witty issues, I think I'm just going to speak. Extemporaneously and kind of tell you that when I came before the committee last year, I think most of us were confident that the end of the epidemic initiative, which the governor launched back in 2015, was on close to being on target and I. Think that press releases that you saw from the state in the city do indicate that there's a historic lows in new diagnoses of HIV and increases in people who are on effective treatment and on effective prevention. And that's all great news. We don't really know what the impact of the coronavirus is going to have on reaching those targets. But I think most of us who are in this field think that we're unfortunately going to see some of those gains plateau off the sexual health clinics of New York City, which were so key for both diagnosing people who did not know their zero status and providing prevention for people at risk for HIV were close for many months. I will say that Nyp's sexual health service stayed open during every week of the epidemic and we've continued to enroll record numbers of people in HIV prevention, make new diagnoses and engage folks in care. But, as I said last year, when I came in from this committee, the hardest there's three pillars really that the end of the epidemic initiative stands on. One is helping the perhaps eight thousand New Yorkers, who don't know their serostatus, yet learn their cereal status and get engaged in care. The other is to greatly increase the number of people who are at risk for HIV in pre-exposure. Prophylaxis I think that current thinking is only about 25 percent, one in four people who would benefit from prep or receiving prep. But really almost the hardest group is the 20 to 30,000 New Yorkers, who have fallen out of care with their HIV and likely are not receiving antiretroviral therapy and because of that, their viral loads are not suppressed and they're capable of then transmitting the virus to others, and, as you can all imagine on this committee, the coronavirus epidemic has created really unprecedented challenges for individuals to access care to access basic services and so I think. We think that you know we're gonna, unfortunately, seeing a leveling off of the progress that was made to ending the epidemic and that we're really not going to see it by the end of 2020 and I know. Everyone publicly is often saying something differently, but I'm kind of here to say that we've got to redouble our efforts in the next six months and year. While we deal with the coronavirus to also deal with the other epidemics of HIV and Hepatitis, C and I, think all the discussions you know, we've been in discussions of trying to figure out ways to test for all three so that, as we mass test people for coronavirus, we find ways to also identify those people living with HIV, who are unaware of their diagnosis or hep c and navigate them into care. So I'm I think that's the challenge in front of us. I'm optimistic that Steve. As you said, when I began to speak, there is a new appreciation, I think for the impact of infectious disease on even you know. Well financed public health infrastructures like New, York, City has and I think everyone is thinking creatively and is focused on public health interventions and that's the right firmament for to kind of I think re-focus. Our efforts on ending the HIV epidemic, as we simultaneously have to you know, hopefully introduce vaccines and wind down the coronavirus epidemic in New, York, City and while we're at it, we should pull hepatitis c in there because, like coronavirus, we could, if we were assiduous and dedicated to this task, hepatitis c, HIV and coronavirus in a rear view, mirror you know in another in some reasonable period of time. If we remain dedicated to the task so I, I'm gonna, stop there and I'll. Take some questions. I do want to say that I would love to come back to the board in maybe three months or six months, when hopefully, this next winding down and talk about some of the novel interventions that Nyp is rolling out in the community to you know to try and make the end of the epidemic happen, but I think just in deference to the more pressing issues that are in front of the committee tonight, I'll stop there and just ask if anyone has any questions well, I said before I appreciate that and we're going to take you up on that offer you. So. Thank you very much, and but before we open it up for questions, I just want to refer to the latest annual surveillance statistics issued by the city on HIV Aids in Washington heights in Inwood. This is for the this is as of December 31st of 2019 and found I guess in calendar year, 2019 40, new Aids diagnosis among Washington residents, 4,918 people who were living with HIV Aids and 44 people who died as a result of the disease. So we are certainly affected by the disease, and let me just ask you: well: last year you mentioned hello. Yes, no I thought someone was into saying ask a question. Last year you reported that your clinic has 2200 ongoing cases. So are you telling us that the number has gone up significantly during this year? Yeah, you know so one of the slides I was going to show. Is we've built a very sensitive dashboard that looks to identify individuals touching the emergency rooms at Nyp and the other sites, and you know, picked up another 1700 people who seem to be living with the virus but have uncertain care engagement status. So we've always known this from other work that a large number of people who are living with the virus who are out of care, actually live in northern Manhattan and the south Bronx and they come and they touch the health care system and they touch other sites. People don't recognize that they've fallen out of care and could use assistance and care navigation get back in care. So, as we've built these more sophisticated surveillance mechanisms, we're picking up many more people and I will tell you that, just looking over the last nine months, we've had 22 deaths of people who are in that 2100 who seek care at the 168th street site, which is far more than we usually have in that time period and they're not due to coronavirus they're. You know they're, due to exacerbations of underlying mental health disorders and substance, use disorders that just have been exacerbated by the you know by the epidemic and by place, and just the lack of ability to seek care and obtain care. So it's a as you all know. It's a larger crisis than coronavirus itself. Folks are really suffering in many different ways. Other than in coronavirus and one more question from me of following up on something that you said last year, you said you were hoping to obtain a mobile medical unit that could travel around the community to bring services directly to people. Have you been? Were you successful in getting that done so we're successful in getting closer, but no, you would not be surprised to hear that the demand for mobile medical units shot after March and the wait time for a unit is up to 18 months. At this point, additionally, we were using dissert funding. We were planning to pay for that. We are now going back to the primary care development corporation because there were some stipulations on disrupt funding which would not. So we think we're on target to hopefully realize that in the next six months, but it did not come online since I last spoke well, you know something and on second thought, maybe as long as we're facing Covid-19 it's going to be a problem, perhaps delivering the services in that kind of way, but as long as you're still working on making and bringing that to fruition. That would certainly be a bonus for the community and we appreciate that effort as well. Are there any other questions? Hi I just basically had a question about colbit and HIV, and how that you know how people fare with that. You know I think we hear a lot about diabetes. You know obviously other like pulmonary conditions that how did HIV fit into all that mix when it comes to yeah, so I'll tell you, we've put out a study, one initial study looking at this and it's some of this remains kind of speculated. There is a theory that people living with HIV might do better with Covid-19 than the general population, because the lung damage that occurs is due to a hyper exuberant immune response. That then becomes unchecked, and it may be that some degree of you know suppression that people living with HIV that they're less likely to develop some of the serious lung complications. So we've certainly had people pass away with both, but it doesn't look like folks do worse. The one thing they may not do. If you're relatively asymptomatic is you may shed the virus for longer periods of time, and that's something that is true for any. You know compromise, so it may be that you're more susceptible to catch Covid-19. You may shed for a longer period of time, but, paradoxically, you may be at the same risk or maybe even a reduced risk of developing the immunopathogenesis, that's associated with the serious lung disease, yeah kind of interesting and a little silver lining for folks who are firmly contending with a lot to begin with. Daryl did you have anything else? No, you know I was just going to say too. You know a lot of people. I'll talk to you know. Anecdotally say they wonder if, because they are on, you know, cocktail regiments for a very long time that you know maybe they're not as susceptible to you know. What's been happening recently, I think there was hope that some of the antiretrovirals would have anti-covet activity that just really hasn't borne out the drug. That's in use right now, rem deserve, you know, was initially developed by Gilead for Ebola and it turns out serendipitously to have some. You know some activity against coronavirus, but the standard antiretrovirals and the doses that we use don't look like they have any of it activity: esteem, Steve, yeah, who's that Tommy. Yes, one quick question: the question is in terms of the vaccine: do you think that people in this group with Aids HIV, will have first access to it? Yeah I mean I. Think, as you know, the CDC and the acip and others have reduced, have produced some recommendations about a tiered approach to at-risk individuals, getting accelerated access to the vaccines as they come out of prioritization and I. Think we're pretty. So that's as much as I know, I probably know as much as you do about it. I fully expect that to be the case: human suppressed individuals. You know this is to answer the question that Daryl may ask before they may not be at least HIV. Patients may not be at risk for worse outcomes, but they may be at increased risk for infection and shedding. So they would still be a logical group to potentially prioritize when vaccines become more readily available. I agree, thank you so much sure, and is there any progress in finding a vaccine for Aids itself? There is slow progress, not so much on the vaccine, as in pure strategies which might be able to render someone not needing antiretroviral agents but either exchanging the body of the virus or allowing an individual to kind of control it more effectively, but nothing on the immediate horizon. This is if the timeline always seems like it's five to ten years in the future and I think it it's. It still remains there, unfortunately I think. Fortunately, coronavirus is proving to have to be a much easier target than HIV. Well all right, any anyone else, all right, Dr, Gordon, Steve, sorry I, would just add, maybe for when the doctor comes back. If folks don't know, July 3rd of 2021 will be the 40th anniversary of the New York Times article that came out about at least you know, 41 homosexual men that you know came down with this unknown illness. So for many, that's the beginning of the HIV Aids epidemic and so that'll be in July. So maybe come to a meeting done. I. Remember where I was when that broke, that article, it was the start of everything and it'll be great to be winding down the epidemic, hopefully on that anniversary. So thank you for having me and I look forward to coming back at some point in the not too distant future. Well and I appreciate the fact that you do take time out every year to talk to us and to bring us up to date, and let us know about the vitally important work that you're doing and I don't want that those slides of yours to go to waste. You know you spend some time on them. Why? Don't you send them to me and I can actually send around to the committee members, so they can take a look at them. Are you nodding in agreement there? Yes, I am I, don't know how you know that, because you can't see apparently you're on a phone but yes I can see. You can't see me. Okay, very good. Thank you so much Dr Gordon and we now return all stations to our regular broedcast on Covid-19 and we have the wonderful Pauline Ferrante representing the City Department of Health and mental hygiene. Pauline come in hello good evening. Everyone I hope my audio is okay but, as you all know, the numbers of positivity is trending in the wrong direction, and the mayor announced today that he thinks we are entering into a second wave, which is not what we want. I did see in the chat that Cheryl had a question about why upper Manhattan is not listed as an orange zone, so the Covid-19 zones are determined by New, York state and the governor's office, obviously in coordination with city Hall and it's a very dynamic. You know conversation that happens because obviously a lot of things are impacted when so zones are designated and restrictions then have to be put in place. But I do know. You know your community board in particular. Mr Grubman has brought this up very frequently, as well as other folks in community board 12 about the gatherings and about the social distancing violations. So I encourage you to continue emailing me, any location that you find to be problematic. I am forwarding those over to the mayor's office of special enforcement. They are tasked with sending out enforcement. You know inspectors from all agencies to go and really try and crack down on this. You know on the activity that is occurring so the biggest message I have right now is, unfortunately, this holiday season. We are asking folks to not to travel and to not have gatherings with people outside your immediate household, which is really depressing and sad for a lot of people who have been looking forward this whole year to hopefully see a bright spot at the end of the year. Unfortunately, we are all going to have to sacrifice a little bit this holiday season, so next holiday season. We might be able to come to a new normal where we might be able to gather again so across the board. We are working very closely with test and trace to get information out into the communities about the importance of getting tested. We have been seeing certain folks using rapid testing as a means to use it as a passport if you will to go and travel or to go and gather with their friends, and that's not what rapid testing is meant to do, and so we really want to get that information out to folks as well to curb that behavior. You know there was a restaurant that I think was in the news about saying how they were providing rapid testing so that their patrons can dine in at their restaurant and it cost fifty dollars. I mean there's just so many things wrong with that. You know, and so we just want to make sure that people understand that rapid testing is essentially meant for folks who need to return to work quickly. You know for essential workers and for people who really need to know their status so that they can continue doing what they need to do to survive on a daily basis. This is not for you to go and gallivant around town or go on a plane as proof that you're fine, because you can get tested today and then on your way to the airport, come in contact with Covid-19 and then you are then in a position where you could potentially be spreading the disease. So we just really want to make sure people understand that rapid testing is not meant, as a you know, get out of quarantine card for free, like this is not something that people should be taking advantage of. This is meant really to help people move forward and get back to work. You know as quickly as possible, but also for people to know what their status is, so that they can keep other people safe. So sorry for that long diatribe, but it was just very disheartening to hear that people were using these testing services as a means to gather. So we have information on our website about the holiday travel guidance and about you know gatherings, but we really just are looking forward to having the community help in sharing this message, because I think people are very tired of hearing from government I think people are exhausted from having to be. You know, sheltered away from their families, and so we just really need everyone's cooperation and help in pushing out this messaging and really also, you know putting up information about mental health services as well, because we know in general how the holiday season can bring out a lot of emotions and feelings in people even prior to Covid-19, and so we really want people to continue to maintain their mental health as well. During this period. Additionally, there have been some new information about vaccines, some of them very promising. I. Think the main priority, as the CDC state and city hall have listed, would be frontline healthcare providers and then also people who work in congregate. Medical settings like nursing homes, because they are around people who are very vulnerable. So they would probably at this point right now, are listed as the main group of people or the first cohort. If you will to get the vaccine as it rolls out, and hopefully we will be getting the Covid-19 vaccine from different. You know either Moderna or a Pfizer sometime mid to late December. So that is all good news. But again we want to make sure that people understand that, just because you had an antibody test that came back positive or you had a Covid-19 diagnostic test that came back negative or you get a vaccine doesn't mean that you can go around and you know skirt the laws or the regulations around social distancing. We really need people to you know continue to be vigilant and remember that it's not just about our individual, you know are just about us at this point in time. It's really about the most vulnerable among us and that we really need to just continue to do what's right for us and for our neighbors and for our loved ones. So that is my main message. I will be putting some links into the chat that might be helpful and then, of course, I encourage everyone to utilize our website. I know Steve loves looking at the data page, so we will continue obviously to keep that as up-to-date as possible and there is a new vaccine page. So, as information about the vaccine comes in, we will be updating that information. So that's all I have for tonight. Thank you. Well, Pauline. Speaking of the data page I in the past, I was able to easily see statistics on the number total number of cases and deaths per zip code. I can't find that anymore, so has that been removed, I don't think it's been removed, but I think it's been it's probably in a separate tab. So I will look through the website and then I'll send you the link where you can find it. Okay, I appreciate that Pauline I also have a question before you get there. Let me just with respect to the rapid testing what I? What I've seen is that people coming back from the thanksgiving breaks that they're running to get the rapid testing so that they can find out right away whether or not they can go back to work or resume their regular schedules. Is there something wrong with people doing that the whole point about people using rapid testing as a means to you know, go out and gather with their family and friends, and you know skirt the social distancing regulations and then either way using it as a means to like first I'm going to break the rules, and then I'm going to see if I'm okay to go back to work or I'm going to get rapid testing to see if I can break the rules. Neither are you know the acceptable uses for rapid testing in my opinion and I think it's really disheartening to see people using rapid testing as a way to do that. I think what we really need to make sure that people understand is that this rapid testing is meant for folks who are required by their employer to go get tested and that they don't need to be in quarantine. For a long period of time, while they're waiting for their results so that they can go back to work, I mean there are people who really can not not work, and so I just really encourage people to remember the reasons why we are encouraging testing and encouraging people to pick up the phone for contact tracers. This is not about you know, being able to just go forward with your life so that you can pretend that Covid-19 doesn't exist, but it's really to help assist people who really need you know either to go back to work or to understand like what their status is, so that they can keep their family members safe while they are maintaining and practicing all the social distancing. You know, guidelines and the core four obviously, which is to stay home, wash your hands wear face covering inside and outside and practice social distancing, so I hope that answers the question. Okay. But do me a favor, put up, try to condense that and send me something that I can say that I could pass around with that message? Explain it like: don't use rapid testing as a like? A get out of quarantine free card. Well, you said it a little better a moment ago, but you could use that line too, but to send me something I can use I can sure at least incorporate into the minutes. Okay, all right! Thank you! Sally did you have a comment or question yeah I have a question: has there been any progress in trying to figure out admission rates and death rates by hospital for some reason we required of nursing homes, what we don't require of hospitals, which leaves us with no information and I. Just wonder if there are any plans to provide that information. I will check with the I can check, with our leadership, for the state, managed hospitals and then I can also circle back with Laureen's team about h, hospitals, I, don't know why they don't keep that information or that they don't provide it to the public. I'm not sure why what's a very powerful hospital lobby, yeah all right, I, don't understand that either. Frankly to me it doesn't make any sense I we should. We can look at the State Department of Health website and we can see each and every individual, nursing home but and I. Think Sally is correct, and we've made this point before similar information should be available for each of our hospitals. Anyone else all right. Thank you. Pauline thanks, well, I, see in the chat that Cheryl had another question about what the mayor's office is doing. When you report areas of people gathering so again, they created a task force in the mayor's office, with special enforcement, they've called inspection teams from every single agency that has inspectors that are able to write up summonses. So you know they could be DOH Mh inspectors, DEP inspectors, the Wp inspectors if they have DOB inspectors. So any agency that has an inspection team they've asked some of those folks from each of our agencies to go and be part of this task force and that anytime there is a complaint regarding social, distancing violations or gatherings where you know that are very concerning they will ask these folks to go to those locations to do enforcement. So please continue to. Let me know where these locations are and I will continue to forward them over to the mayor's office of special enforcement. Thank you very much. Thank you. Oh actually, do you have any sense of how many such complaints have come in about locations in our district? Oh in your district, specifically I, don't I can definitely find out. I'll ask but I know across the city. They were very focused in those areas where we were seeing a lot of social distancing violations and they were able to close down some businesses and issue some violations. You know close down schools that were open that shouldn't have been open, so I know that they have done a lot of work in that regard, and then there have been some where we've heard about restaurants in Manhattan, where they were having too many people at a certain time or they were gathering outside, inappropriately and they've sent teams to go and enforce. You know the regulations there as well, so I know that they have been very busy sending folks all over the city, but in terms of specific numbers, I'm happy to reach out to see if they can provide that yeah. Thank you and again. You know it would be according to our four zip codes, unless they, unless they're reclassifying them by community district. Thank you very much sure thanks. Okay, the next Julio Batista, are you with us, I'm still alive. Yes, I'm still here, okay, very good! You have a report for us, so let me just start off by you know talk about food insecurity. You know, food security continues to be a great problem for many of our residents, our community during the Thanksgiving holiday, our staff, both at the island hospital and Milstein, prepared 400 bags of food for a family of four that were distributed to a local community, mostly through El Nido Esperanza, and also we also partnered with elected officials to distribute about 2,000 turkeys. Also on the issue of food and security, the Medical Center neighborhood fund, which some of you are aware of it's a fund- that's supported through our employees, have dedicated most of this year's efforts really to combat the issue of food and security and staff, and you know I've gathered more than 90,000, which has been given to a number of organizations, including cloth and catholic charities, to do some of that some of their work- and you know a lot of kudos- goes to Colombia or Sandra Ross and Natalia and Janil for really leading that effort and getting so many employees to make contributions to support our community. And, of course, you know, chalk continues to support our local families, they're working with local supermarkets to create drop-off boxes that you know that are delivered to the door front of some of the you know some of the you know, members of the community who have food insecurity and the you know these boxes are really geared to provide. You know a month worth of supply and delivered through some of the car services in the community. I know that there were also questions that you had Steve and I believe they were also articulated at some other folks and in other venues it's a it's around the Acn, and you know whether there were any closures you know, I, don't I'm not sure where that information is coming from I checked with the Acn again as early as today, there were no closures. There are no closures. Our patients at this point is not are not being redirected anywhere else, and so I asked that you know whatever information I have regarding that information. If you can share that with us or with me so I can you know further look into it? Why don't you stop there for a moment? Is nature still on the call nation Diaz or did I see that she got off nation? Okay, that nature is the one who, at the last meeting, said that she had heard that the you know that the clinics had been closed, which I told her at that time. I, didn't think was true, but I did think that maybe you would- or someone had told us that maybe some of the services had been consolidated or well. When the you know, let you know when the we had the outbreak, the early outbreak in spring, there were some consolidations where we wanted to have a certain you know we want to have patients go directly to one central location instead of going to different locations that was during the spring. Since then, everything has returned to their operations. So again, if you know, if you have information about that or concerns, you know feel free to send it to it. But at this point there are no changes to our acns okay, so every single one of them is operating as normal right now. Correct, yeah, okay, yeah, all right, so I'll try to make sure that the nation knows that she may, who knows she may have been referring to some private facilities. Maybe you know I don't know, but whatever her concerns are I mean, please, you know get it to us and that you know I'll look into it. If there's any specific departments that she's referring to, let me know- okay yeah I, also like to say that before Pauline gets off, is that I really want to thank her and the oh or really partner with the hospital and supporting our various flu shot events that we had in the community I think more than ever, the flu shot this year is more important because of everything that is happening. So you know so with that. Let me just also say that you know, as experts predicted, this is really becoming a very dark winter I believe. Yesterday, the you know the U.S set a single day record with over 28 hundred corporate debts. That's throughout the country. A lot of folks have pinned their hopes on a vaccine, but you know, as you may have read today from I guess. The Wall Street Journey reported earlier was the Pfizer vaccine distribution will be cut to cut in half because of running into supply chain problems. So you know the vaccine is not end at all so I like to like I like the spring. You know we at the hospital relied a great deal with care providers from out of state who came volunteer, who came to New York to help out. Unfortunately, you know this summer round. That is not the case, because we are not the center of the epidemic, as you notice, you know, if Utah Midwest, you know they they're going through very difficult times worse than what we're going through here in the spring, so we can not really rely on those. You know health care workers to come to the aid of New Yorkers or for assistance, so New York producer has planned and has been reported. You know during the last few months that you know we have planned for the surge. We are adhering to the governor's request to increase capacity as things tickle up, and you know we're working to ensure as part of those plans that you know those staffing levels are appropriate. So we anticipate this to happen, and the bishop at the hospital is taking measures to ensure that again capacity, as we mentioned and, of course, that we have personnel and the appropriate PPES to be able to deal with the issue in terms of basis again, this is our system-wide numbers. As of today we have 375 orbit positive patients. 65 patients are in Icus, but the good thing about this is that you know, unlike the spring, the length of stay for some of these patients in the hospital and in the ICU are far less than what they were in the past. So that is, you know, that's a good thing, but there is an uptick in the numbers. Unfortunately, that is the case throughout the country and are you seeing an uptick in the people from Washington Ice in England throughout the hospital network with the vaccine? Well, you know, I have to register once again my dismay that we can't get specific numbers for the three facilities located in our district I understand. But again you know I, I'm still trying to get a clearer picture of what is happening to patients here. But if you look go back to the very beginning of this, if you would ask me you know what were the numbers and I gave you the numbers, it would have been representative of this community because those patients that we had were not from this community so giving you a picture, it's really what the image is of. What's actually happening, I. Think again, you know the permanent health you know has a wonderful website and I think that that's a vehicle that we should use well and we do use it, but we also have a particular interest and concern about the institutions that directly serve our community and how they're being impacted by this disease and having more specific information about the numbers of patients being admitted to the hospital and staying in the ICU and in the regular beds would be helpful information to have- and you know, I can't blame you, but I, don't understand why the hospital is so resistant to providing such basic and simple information. Let me talk about the vaccine when the vaccine becomes available. Do you think it's going to be possible for you to provide to do similar community events as you do with the flu shots? Is that part of the plan? No I, that that's not really the immediate plan? I mean you know the Pfizer. We anticipate that we may get the Pfizer vaccine, and you know that number has not been cut in half in terms of that immediate distribution. So we will be getting that vaccine. The anticipation is really a frontline staff. Those who are treating patients will be the ones to first get it not sure. When the you know end up, you know the back end. Staff would will get dead doses, but there is no plan at this point, but do that, especially when you look at the Pfizer vaccine, which requires it to be kept in a real sub-zero temperature? Do you have the equipment to keep it at sub-zero temperatures? Is that going to be a problem? The hospital does? Yes, we don't have an issue with that within the hospital okay, but and put by the spring, or so when you, when the supply is more ample, you don't think you'd be able to do a community of vaccination events. I couldn't speak to that. At this point Steve this is very preliminary very early. It is something that we can look at in terms of, as other vaccines become available. Where storage is not that much of an issue so like the Moderna or the Astrazeneca, which is part different, but it's something that we, you know I'll take back and see. If there's anything done sometime and you know sometime next year- oh Steve, sorry, it's Pauline I can hop in and thank you Julio for your kind words, but it'll be I, think each individual hospital will be provided, vaccines for their staff and their frontline workers. I think it'll be up to the state and to the city to stand up locations where we will be able to provide the vaccines to the community and so right now we have a vaccine task force that is working out. What that would look like how that would all operate, and then also there is this question about equity and also about vaccine hesitancy among certain communities, and so we will definitely be reaching out to the community board local community-based organizations on how we can message properly again. People are very tired of hearing from government, and we understand that, and so we're going to be looking for community partners, community leaders to really assist in that messaging and getting people onto these vaccination locations. So that's very preliminary. Of course, information will be shared as soon as it comes in, but I just wanted to. Let you know that there is a citywide plan for vaccinating. You know New Yorkers, as the vaccine becomes available to us yeah. Well, actually, the thrust of the I didn't make it very clear. But the thrust of my question for Julio about doing the community events was making it easier for people in the community to get vaccinated and to try to overcome whatever hesitancy they may have to make it as simple as possible. Yeah I think because this is so large scale and widespread that it's like part of the emergency management of the city, to do that type of vaccination event, and so it will be held in locations within the community so that community members can go out and get the vaccine without much difficulty. So that's, hopefully the plan, so I will keep you all updated. Obviously, and I also think Steve that groups the community board would play. You know, I think, would need to play a very important role, as bling said that there has been a history of folks really not getting vaccinated for the flu, so we'll probably have the same situation where people will not get vaccinated or will be reluctant to get vaccinated for corvid for a lot of reasons. But I think that you know there'll be a. It needs to be a large campaign convincing the community that this is an important thing to do. Convincing the country at large I forget which program I was watching the other night, where somebody pointed out that in 1956 in order to convince people to take the polio vaccine, they had Elvis Presley on the Ed Sullivan Show in public on national television, get the polio shot in order to convince people that anybody could take it and it wasn't dangerous. So we need to have somebody similar step forward and demonstrate in public that the cover 19 vaccine is similarly not dangerous and something that everyone should say. Well, Steve. Did you see the three presidents are going to? Oh, no I didn't see that yes, the three presidents before the current one are going to oh, very good, Steve Mary Anderson. It is I just wanted to say that the community outreach you know, ideas about you know for the vaccines is something that we talked about in our aging committee this morning and you know Julio you'll be getting some information from me and you know we want to be involved if we can, with anything that goes on Pauline. The same you know goes for you if there's something that the aging committee can be involved in, please let us know all right. Well, let's work together, Mary as we usually do and get the information around to everybody right, Barbara, your next stream. Yes, I wanted to say that one of the challenges of this clover vaccine is that it requires two administrations and if you don't get both shots, both administrations, it's the same. People need to mute themselves. Yeah. Thank you. Okay, as Archie would say. Please stop for yourselves right, okay, so one of the challenges of this Covid-19 vaccine is that people have to get two administrations of it. Other very good points, yeah. Otherwise, it's useless now I think you have to look at is the challenges that have arisen with the shingles vaccine, which also requires two administrations approximately two to six months apart, and that has been a challenge, because many people have gotten one and then fallen to the side. So I think that we should that the health community has to look at overcoming the obstacles that have happened with the shingles vaccine. Then the follow-up is necessary, especially with more transient populations and then Pauline or Julio. Do you know what the? How quickly do you have to get the second dose I believe it's two months, but I'm not a hundred percent sure, okay. Well, I'm sure we'll find out as soon as the vaccine becomes available. The word will get out, but it's definitely something that I think you know the state and the city are thinking about in terms of how we are going to be distributing the vaccine and then also making sure that people are getting that follow-up dose. So it's something in discussion about the best way to make sure people like we keep on top of people to do that. Obviously you know it requires. You know people to be cooperative in that regard, so yeah one month, 21 days to one month, is the second dose is that right, I don't know Steve I had a yeah, I'm Tom, you go ahead. Yeah I heard I also heard the second dose knocks you out for a day, but that's just what I heard so there might be. We might need more supports for people who may not be able to work the next day after or two days after that, but anyway the question I had was I want, and this is going back to I think what Pauline was talking about and Julio about. Equity I was thinking about because I remember when remember A21N1 and that whole flu thing- and there was hoarding of the vaccine and no offense. But you know people who had access to it like medical workers were making sure their families got it and others. You know wealthier people and I mean actual wealthy people were, you know able to get it so I wonder if you know if there ends up being a shortage or not as many doses available and people? How can we make sure that it's going to be equitable, that the people who need to that we're not have people cutting the line? Let's say that and to get the vaccine, I'm not saying it's going to be a rush. Some people want to have it, but there may be. We don't know how people are going to respond. It depends on the first group, but I just want to know what you would you know how you know what efforts will be taken to make sure that doesn't occur with this yeah. That's a question I think for Pauline, yeah Tanya, that's a great question, and that obviously, is something that our movie team is very concerned about. I, think that it will go down to the you know the cohorts and how they're defined. So, of course, you know the first cohort would be the frontline medical staff and then it'll be people who are most vulnerable so underlying conditions, and things like that, and so I believe that there is a lot of discussion about what this would look like in terms of making sure that it's equitable across the city and who you know, falls into the category of being vulnerable and working it out that way. So it's definitely something that is in the forefront of discussion and so, as that begins to be more clear, I think we'll be able to share that with the community, but again I think we will rely very heavily on all of you and community-based organizations to get that messaging out about. You know the vaccine, the importance of taking it and combating a lot of historical. You know trauma as it relates to you know, medical malpractice among certain communities too, so we really just want to make sure the messaging is sensitive, but you know so all of that is very important. Let me just put it that way, and so and it's something that we are working very hard to try and figure out what the right you know, balance will be all right. Anyone else, Bernard I'll, get to you in a moment. Anyone else on the committee on the board. Yes, I, had a question: who is that Sally? That's Sally, yeah Julio, any update on Alan's, psych and also and when you're looking at increasing capacity, did you ever consider anything other than psychiatric units to shutter? Well, at this point, there's no new development with the Ellen Hospital's psych unit, as I mentioned to Steve. You know, as I mentioned earlier. You know that's part of our capacity building right. There was, as I mentioned, to see there was a big investment to convert that a space for Covid-19 use, because you know, and for us to have to recreate it to then dismantle it again would not have made sense. So I think that once we you know, go through this phase, people are getting you know vaccinating. Then there will be a decision in terms of when that unit will be back. There was a letter that Dr Corwin sent to the elected officials a few months ago, saying that he was going to initiate some kind of a planning process for improving mental health services. Sometime in the fall did that ever take place. No that doesn't hasn't initiated. Yet do you know if that's still, is that still the hospital's intention? Yes, it is, and you know I could follow up with Warren Dr warning where we are with that right. Is the community board going to be involved in that process I'll make the inquiry did I hear that the director and the psych unit is now gone? The Allen Psych unit is no longer there. I couldn't say that I'm not sure of the personnel, I'm not sure who that was either okay. Can I go to? Can I go to the public? Any other committee members, okay, but Bernard Grobman, wants to ask a question. Payola is there's some way we should be. We have to bring him on board. Nothing. All he has to do is speak and unmute himself. Oh okay! So there's no feature on this thing about raising hands. But, okay, how do I know? How do I know I just happen to see a message from him? How do I know whether or not anyone else out there wants to speak? If you have a little red DOT on the chat box that should be on the lower part of your screen, you can click on it and see who's there or I've made people like Daryl a co-host. He has access to look at that too. So someone can help you with the yeah and I just unmute Bernard. So if he couldn't do it but yeah Daryl, have you been able to track the people in the chat asking for permission to speak? Is that something you can do I mean everyone can do that everyone can see it well, I! Guess I'm yeah I, don't think yeah I think the phone may be a little different from you, but Tanya is on the phone. So maybe she can help you. Okay, all right! Steve, just I, do have my hand raised so does Barbara Fraser, because if you expand the participants list right, you can see the hand raised icon and each of us can click our name and have the option to raise our hand. Oh god, okay I, don't see it. Okay, all right Bernard go ahead, yeah, but go ahead. I just saw the hand raised okay, yeah, quick question: how will you know who has pre-existing conditions to be at risk? In other words like it's, not just age right, it would be like age plus. You know, let's say heart condition or something like that. So how would someone prove it or how would you know that or how would the you know? How would the city know that to get them in their correct place online for the vaccine? I? Guess that's for quality, maybe I'm not 100 sure in terms of how all of that is being defined. But I do know that, in terms of like hardest hit communities, they are prioritizing getting the vaccine into those locations and so that'll encompass. You know large-scale, like parts of the community, but based on information we've seen as to where, like Covid-19, has impacted communities hardest I, think maybe that will be the indicator as to where the vaccine should go. First, when it's available for a larger scale consumption. That was a good question Barbara. Did you hear the Reflection Barbara, okay, Natalie? No amazing, you I got it now, I got it I figured it out. Okay, thank you. Okay, Natalie I was only demonstrating the Handrais feature. Thank you. Oh thank you. Did it very nicely? Thank you, and there is Mario has their hand up go ahead. Hi good evening again, it's madian from the comptroller's office. Is this the appropriate time for me to just say something in general or is it a question for Julio I didn't get that piece, no yeah we're not up for a general conversation. Yet, okay! Sorry, that's what I thought it was I wasn't sure. No, it may sound like it, but it did, but no okay. Anyway, you have a question actually now that I thought of it, because I'm here for Julio, if he's still on, because I can't really see everybody I, don't know how to use this either. So it is nothing to do with how much you use this I still don't get it but Julio. If you're still on. Is there any kind of support provided to families of community members that have a hard time making it upstate to visit family members in the psych unit? Well, they yeah I mean if they're, if we have any families that are, you know, have patients up in Westchester and need some support getting up there either. You know having the person speak to their social worker or the patient, or you know just feel free to give me the information and we'll make some arrangements. Thank you so much sure that was it okay. Thank you all right. Any other questions for Julio, okay, very good. Okay! Janil! Are you still with us? Hi everyone? Yes, I'm still here, okay, very good! Thank you. Do you have a report for us. I do and I will be super brief. Considering the time good night again, everyone first start off with the campus testing data. We continue to offer on-campus testing for staff students and affiliates for the week of November 23rd to the 29th. 1332 tests were conducted on the Cuymc Camp campus and three positive test results came as a result of that testing. I'm across Columbia University campuses over 4,000 tests were conducted over the course of that same week as it is that time of the year again, we are hosting the annual Cuymc holiday toy drive in light of recent Covid-19 protocols. We will not be accepting the traditional in-kind donations. However, we are accepting donations online towards grants for the purchasing toys for over 400 children and youth who access services through local daycare, centers head start programs and Cbo's in northern Manhattan. So the drive started on December 1st and it's going until the 18th. Technically, it is open to the public in the event that anyone wants to donate, but we do have a prize aspect. That's only open to cymc staff, but you can learn a little bit more about the toy drive on our website. As Julio generously mentioned, we you know, have been working really hard on the medical Center neighborhood fund, and we want to thank him for that, because this is really a collaborative effort. The 2020 grant period has come to a close and the awards will be sent out to I believe it's almost 40 Cbo's serving our neighbors. I'm sure many of you are aware that we would traditionally have an awards ceremony where we would really give a chance for a lot of the Cbo's to see each other and members of the community to really you know, promote and highlight the important work that they do. Obviously, we're not having an in-person ceremony and everything, including our timeline, had to be adjusted for the pandemic, but all of the Cbo's will be receiving an update, I'm thanking them for their hard work. Thanking them, for you know maintaining in light of everything and followed by the allocation to continue providing services. We've also been doing a physician's webinar series in conjunction with Nyp and the Dominican Medical Association, the last physician webinar Series took place on November 8th and the topic covered was telehealth. These series were really open to community physicians to help provide not only Cme credits but an opportunity for them to learn about what resources were available at the hospital to health care professionals. Additionally, on the sixth, we have the sixth annual Omaha conference on the 21st of November I'll have some details about how many people actually attended that conference and I will include that in the report on the 7th we joined the Broadway Mall Association to do a cleanup. It was largely successful, as that particular mall had already been mostly clean, but it was attended by Donna and Ross that we have photos on our facebook of them actually helping clean out if you're so interested and inclined to take a look and seeing how the hot topic tonight was about vaccinations and what to expect. We are planning our symposium within the next couple of weeks regarding vaccinations. As you know, I'm not a clinician or a researcher, so I can not answer any specific questions on that, but, as the details become available, I will certainly be reaching out to the board to help promote the event and make you aware of it, and that's my daughter in the background. So I'm gonna go on. Unless there are any specific questions. Any questions sounds like your daughter. Has a question. Don't get me started? Okay, very good! Thank you! Janil, okay, bye, oh god, I feel as though there should be somebody in her family who's. A captain should be a captain in Geneal, okay, Betty, Lehman, yeah, hi I have a very brief report. I represent Isabella Geriatric center, where we are maintaining status quo, which is a good thing. We had a very bad spring as you all remember. We are maintaining our adherence to state and federal guidelines for infection control, including the weakness that testing and staff. We are also working very closely with the university Department of Health and essentials for Medicare and Medicaid, where they strongly recommend against residents of the nursing homes leaving for home or family visitations over the holidays. As you can appreciate the opportunity for be extremely high and we are really discouraging any kind of visits outside of the nursing home if they are due leave, for whatever reason they have to test prior to returning, they have to go through. Residents would need to go for mandatory quarantining in a separate unit or section for 14 days and have at least three tests upon their return. So we have to be very careful that we do not bring Coleman back into the facility. We made a decision recently. You know we use our a lot of our space community space for organizations in the community, for you know, purposes of meetings and so forth and for the purposes of planning for 2021, we do not foresee an opportunity to host community events on our campus, at least for 2021. As far as you can tell at this point, that's just an abundance of caution. We are maintaining our opportunity to have window visits with our residents and families and weather commissioners. The help of the employee company resident permits so we're maintaining status quo. Everything seems to be okay for now, but it's a wait-and-see approach. You know very vulnerable population, so that's all I have to say for now any questions I just want to be clear. I think what I heard you say is that a decision was made not to host any community events for the entire calendar year, 2021 out of an abundance of caution. Yes, at this point, I mean it's planning a position that was excuse me a couple of days ago, because we're looking at the use of space and the CEO said for the purposes of the community and meetings and so forth. But we don't know how long right, it's understandable, I, don't think anybody could have could argue with you on this one I think what I read is that in the same breath that people at the I think it was the FDA or at CDC. At the same time, they recommended that the vaccine go to frontline workers I think they said it should also go to nursing home, not just nursing home workers, but nursing home residents did I read that correctly. Yes, that's the latest that I read as well, but if you know a lot of this is still under review and decision making is still in the works. That was why I heard as of yesterday- that's good yeah, okay, and when you say that you're maintaining status quo, I didn't get a chance to check the later State Health department reports, but that means there have been no Covid-19 related deaths at the nursing home in the lab. That's great, okay, very good. Are any questions for forbidding I had a quick question regarding the public space that won't be utilized for 2021, the safety and health of the residents is most important, but I'm curious if that will result in loss of revenue for Isabella. Well, we don't usually charge for the use of space here. I mean the only charge that we ever really dealt with any organization that uses our space has to be either a 501c3 or government organizational school, and the only charges that we ever really used were for catering pretty much, and that was just to cover the cost of the Gatorade. So it really wasn't a revenue generator. Of course, it's part of our thing. That's good tonight, have you been able to maintain a reasonably full occupancy at the at Isabella, no and frankly, across the board? Nursing homes in statewide and maybe universally, but certainly in New York state, are averaging between 70 and 76 capacity. I'm sorry! Where are you we're in that range 70, 76 percent capacity 70 to 76 right, along with all the other nursing homes, everybody's suffering from census issues, as you can appreciate, if someone has hip replacement surgery, for example, and they might want to go to a nursing home for rehab at this time, they're up into the home, and if we have a call because they're concerned obviously based on what happened earlier in the year, they might be exposed to clothing. So there's a lot of lost revenue coming into us because of our last revenue happening to us, because people are opting to go home or stay home, yeah that that's not just Isabella, that state. That's a statewide situation, and maybe you know maybe country wide, but I know it's 70, 60, okay! Well, that's where you would be losing money not from the meeting space you're losing money, because in the past you had a much higher census interest rate. We were always operating pretty much at 100 percent yeah. So this is here: this is pretty significant. Okay, any other questions all right, very good, okay, Marielle I think this might be your time. Sorry, it takes me a second hi everyone again. This is Marielle from the comptroller's office. Just wanted to basically say that our office has been hosting and I think this is the right space to do that or we are. We have a survey that we've been passing along regarding work-life balance and we're trying to see one if employers are following rules that they have to follow, but two. What is the experience of a New Yorker going through Covid-19, so maybe working from home or maybe having to work outside of the home and what it looks like for them and I will make I've shared it with the community board, but I just wanted to re-emphasize that in this piece, because a lot of folks have been suffering with a lot of issues regarding physical health, mental health as well. That's one piece and also to Steve I, would love to talk to you. This I mean today's Thursday, so maybe tomorrow, if you have time or next week and I've emailed you already, but I will also email you the survey, so you have it. That's just pretty much it and thank you for having me here all right, I'll get back to you. If not tomorrow, I'll try to get back to you on Monday I know. People have been telling me that their emails have been flooded so whenever I can communicate with people I try to do that. Okay, very I, appreciate that. Thank you and yeah. Just real quick. This is Daryl I, don't know what your plans are or if you know, but the parks Committee next week, we'll be talking about the possible renaming of Bennett Park and there is a name floating around that may interest your boss just FYI. Thank you! So much Daryl, I'm gonna, try to make that meeting and what was the other thing since you reminded me, we will come up with a guide. That's helpful to the Lgtbq community and I know that Daryl had given ideas of who to add I. Just don't know when we're releasing it. Just like you reminded me of that, but we've been working on that just updating that list: oh okay, great, okay, old business, the corner project, as you recall, made it made a presentation to us last month about their plan to have five trailers on Amsterdam Avenue between 176 and 177th street as a temporary facility, while they're still searching for a permanent home Eli Bueno. Our chair is has asked, is a has said that he would like to have a separate public hearing to discuss this issue and I heard back today from the corner project that they are willing to participate in such a hearing and I'll. You know: I had originally spoken to Ellie about scheduling this thing for December I, don't know if that's still possible, but so, if it's not held in December I assume at this point it that public hearing will be held in July in January. So I'll get the information to you as soon as I can on the street and sidewalk cleanliness ratings. Our for October, our cleanliness rating of the streets, was at 94.1 a six to give it an increase from September when we were at 78.4 and our sidewalk ratings were 97.5. A report I have from the department of design and construction on the gas main and the water main work east of Broadway in the 180S between 183rd 189th street. For the most part. Actually, some of the work is also in the 170S. Also Eastern Broadway they're at 27.5 percent they're planning to install a 12 inch water main there has not yet begun, and the looks as though they expect to be completed by June of 2021. When they'll do the roadway restoration, I'll forward the report to the committee members, that's all I, don't have the gp or service request. That's all I have on old business. Does anyone have anything else on any new business? Yes, I have no business. Is that Sally that is Sally two items, one and I record this news feed. There's a candidates forum on mental health for the mayoral candidates on the 10th, from 7 to 8:30, I think that it would be who committee members to attend. So we know what's coming in the next administration. Second, the Manhattan borough president on November 20th posted an episode of represent NYC, awarding the community boards that had achieved the most the biggest increases in paper recycling. As you all might be aware. Community board 12. placed first in the quarter and second in the year, if you want to have the actual amounts we recycled, 1452 tons of paper in the fourth quarter, 5,554 tons in the fiscal year, so we won first place in the quarter and second place from the year in our community board. There are two groups: honored one is friends of Inwood hill park. The second was community league in the heights. The third place winner for the year was community board, 11 am, and they honored concrete, safaris and then first place was community and they honored Harlem and warm NYC, which deals with domestic violence. So it was a huge win for our community board and for the honorees. Could you go back to those numbers 1,452 tons of paper in the fourth quarter of whatever of the calendar year, the June the fiscal year, July 1 to June 30th, and then in the fiscal year it was 5,554 tons, so 5:54 tons yeah for the entire year for fiscal years, what fiscal year 20? Yes, okay, so great job to our community board district, and we were first in the fourth quarter and second for the year. Yes, in terms of achieving the biggest increase in paper for the biggest increase yeah all right. Well, we frankly, we probably came from we've- probably started out at a low point, but yes at least we had at least we made we're making real progress very good. Thank you! Oh and I did have one question. Mulch fest is coming up so, as you gather your holiday greenery, remember that you can always recycle in our parks and I trust that Inwood hill park will be a site for the chipping this year, yeah I heard about I heard that that's probably going to happen right and any other new business. Any announcements- oh we're doing well here, all right, any anyone have anything they want to say before we adjourn at 8:53 motion to adjourn. Okay. Thank you all. Second, okay, very good, all right! Thank you all! Thank you! Bye! Happy holidays! Oh yes, happy holidays! Thank you, Steve! Thank you! Everybody! Okay, bye thanks good night, everyone good night! Thank you! Paola you're. Welcome have a good night guys good night. You.",
            "summary": "You could also okay, if you could also send your information to Steve that he can distribute to the committee I, don't know how to navigate Webex.\nSo I, don't even know where to find the information you post easy, so follow, send tested, Tuesdays I'll be taking place, start on December and then following pretty much starting at the part of Harlem working north to Washington, but and tell me again what is that day of action.\nMy I, don't know exactly where it's being sponsored by the Inwood merchant association, but the I think it's right at the entrance to that open, dining, street.\nSend that to the committee members all right, thank you, Nye I, hope, Community Board 12's health committee was at least as good as yours.\nOne of them is to observe World Aids Day every December by having it getting an update on the situation with respect to HIV Aids in our community and we're usually fortunate enough to have Dr Gordon Peter Gordon, the medical director of the comprehensive HIV infectious disease clinic at New, York Presbyterian hospital come before us.\nExtemporaneously and kind of tell you that when I came before the committee last year, I think most of us were confident that the end of the epidemic initiative, which the governor launched back in 2015, was on close to being on target and I.\nThink most of us who are in this field think that we're unfortunately going to see some of those gains plateau off the sexual health clinics of New York City, which were so key for both diagnosing people who did not know their zero status and providing prevention for people at risk for HIV were close for many months.\nI will say that Nyp's sexual health service stayed open during every week of the epidemic, and we've continued to enroll record numbers of people in HIV prevention, make new diagnoses and engage folks in care.\nReally almost the hardest group is the 20 to 30,000 New Yorkers, who have fallen out of care with their HIV and likely are not receiving antiretroviral therapy and because of that, their viral loads are not suppressed and they're, capable of then transmitting the virus to others, and, As you can all imagine on this committee, the coronavirus epidemic has created really unprecedented challenges for individuals to access care to access basic services.\nWe deal with the coronavirus to also deal with the other epidemics of HIV and Hepatitis, C and I, Think all the discussions you know.\nAs you said, When I began to speak, there is a new appreciation, I think for the impact of infectious disease on even you, know.\nOur efforts on ending the HIV epidemic, as we simultaneously have to you: know, hopefully introduce vaccines and wind down the coronavirus epidemic in New, York, City and while we're at it, we should pull hepatitis c in there because, like coronavirus, we could, If we were assiduous and dedicated to this task, hepatitis, c, HIV and coronavirus in a rear, view, mirror.\nThank, you very much, and but before we open it up for questions, I just want to refer to the latest annual surveillance statistics issued by the city on HIV Aids in Washington heights in Inwood.\nIs we've built a very sensitive dashboard that looks to identify individuals touching the emergency rooms at Nyp and the other sites, and you know, picked up another 1700 people who seem to be living with the virus but have uncertain care engagement.\nHi I just basically had a question about colbit and HIV, and how that you know how people fare with that.\nThat then becomes unchecked, and it may be that some degree of you know suppression that people living with HIV that they're less likely to develop some of the serious lung complications.\nYou know some activity against coronavirus, but the standard antiretrovirals and the doses that we use don't look like they have any of it.\nThe question is in terms of the vaccine: Do you think that people in this group with Aids HIV, will have first access to it.\nIf folks, don't know, July 3rd of 2021 will be the 40th anniversary of the New York Times article that came out about.\nWell and I appreciate the fact that you do take time out every year to talk to us and to bring us up to date, and let us know about the vitally important work that you're doing.\nBut, as you all know, the numbers of positivity is trending in the wrong direction, and the mayor announced today that he thinks we are entering into a second wave, which is not what we want.\nYou know there was a restaurant that I think was in the news about saying how they were providing rapid testing so that their patrons can dine in at their restaurant and it cost.\nSo we just want to make sure that people understand that rapid testing is essentially meant for folks who need to return to work.\nWe just really want to make sure people understand that rapid testing is not meant, as a.\nWe have information on our website about the holiday travel guidance and about you know gatherings, but we really just are looking forward to having the community help in sharing this message, because I think people are very tired of hearing from government.\nYou know, sheltered away from their families, and so we just really need everyone's cooperation and help in pushing out this messaging and really also, You know putting up information about mental health services as well, because we know in general how the holiday season can bring out a lot of emotions and feelings in people even prior to Covid-19, and so we really want people to continue to maintain their mental health as well.\nI know Steve loves looking at the data page, so we will continue obviously to keep that as up-to-date as possible and there is a new vaccine, page.\nThe whole point about people using rapid testing as a means to you, know, go out and gather with their family and friends, and you know skirt the social distancing regulations.\nThink it's really disheartening to see people using rapid testing as a way to do.\nI think what we really need to make sure that people understand is that this rapid testing is meant for folks who are required by their employer to go get tested and that they don't need to be in quarantine.\nBut it's really to help assist people who really need you know either to go back to work or to understand like what their status is, so that they can keep their family members safe while they are maintaining and practicing all the social distancing.\nI know that they have done a lot of work in that regard, and then there have been some where we've heard about restaurants in Manhattan, where they were having too many people at a certain time or they were gathering outside, Inappropriately.\nThat's, supported through our employees, have dedicated most of this year's efforts really to combat the issue of food and security and staff, and you know I've gathered more than 90,000, which has been given to a number of organizations, including cloth and catholic charities, to do some of that some of their work.\nOkay, That nature is the one who, at the last meeting, said that she had heard that the you know that the clinics had been closed, which I told her at that time.\nI, also like to say that before Pauline gets off, is that I really want to thank her and the oh or really partner with the hospital and supporting our various flu shot events that we had in the community.\nA lot of folks have pinned their hopes on a vaccine, but you know, as you may have read today, from I guess.\nYou know, we at the hospital relied a great deal with care providers from out of state who came volunteer, who came to New York to help out.\nYou, know health care workers to come to the aid of New Yorkers or for assistance, so New York producer has planned and has been reported.\nDo, you think it's going to be possible for you to provide to do similar community events, as you do with the flu shots.\nI think it'll be up to the state and to the city to stand up locations where we will be able to provide the vaccines to the community and so right now we have a vaccine task force that is working out.\nThat would look like how that would all operate, and then also there is this question about equity and also about vaccine hesitancy among certain communities, and so we will definitely be reaching out to the community board local community-based organizations on how we can message properly.\nPeople are very tired of hearing from government, and we understand that, and so we're going to be looking for community partners.\nThe thrust of my question for Julio about doing the community events was making it easier for people in the community to get vaccinated and to try to overcome whatever hesitancy they may have to make it as simple as possible.\nYou know, I think, would need to play a very important role, as bling said that there has been a history of folks really not getting vaccinated for the flu, So we'll probably have the same situation where people will not get vaccinated or will be reluctant to get vaccinated for corvid for a lot of reasons.\nIt is I, just wanted to say that the community outreach you know, ideas about you know for the vaccines is something that we talked about in our aging committee.\nSo I think that we should that the health community has to look at overcoming the obstacles that have happened with the shingles vaccine.\nThe word will get out, but it's definitely something that I think you know the state and the city are thinking about in terms of how we are going to be distributing the vaccine and then also making sure that people are getting that follow-up.\nYou know people who had access to it like medical workers were making sure their families got it and others.\nAnd I mean actual wealthy people were, You know able to get it.\nSo, of course, You know the first cohort would be the frontline medical staff and then it'll be people who are most vulnerable so underlying conditions, and things like that, and.\nSo I believe that there is a lot of discussion about what this would look like in terms of making sure that it's equitable across the city and who you know, falls into the category of being vulnerable and working it out that way.\nIt's something that we are working very hard to try and figure out what the right you know.\nSo I think that once we you know, go through this phase, people are getting.\nAny other committee, members, okay, but Bernard Grobman, wants to ask a question.\nBut I do know that, in terms of like hardest hit communities, They are prioritizing getting the vaccine into those locations, and so that'll encompass.\nAs Julio, generously, mentioned, We, you know, have been working really hard on the medical Center neighborhood fund, and we want to thank him for that, because this is really a collaborative effort.\nYou know very vulnerable population, so that's all I have to say for now any questions I just want to be clear, I think what I heard you say is that a decision was made not to host any community events for the entire calendar."
        }
    }
}