{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCjTkV9P9szNXPht8tJKl0aw",
            "title": "PSA: How to Complete Your Absentee Ballot",
            "publishDate": "2020-10-27",
            "shortDescription": "Two small corrections: Vote for 4 Candidates for Justice of the Supreme Court – 1st Judicial District and 3 Candidates for Judge of the Civil Court – County – New York.\\nView the two referenced Voting Reform Task Force meetings at https://www.cb8m.com/event/17805/ and https://www.cb8m.com/event/18094/. Find your poll site at https://findmypollsite.vote.nyc/. Track your absentee ballot at https://nycabsentee.com/tracking.",
            "lengthSeconds": "0:12:19"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "e3P7x9pBy_A",
            "fillerWordCount": {
                "uh": 15,
                "um": 3
            },
            "readTimeFullTranscript": "6 min read",
            "readTimeSummary": "1 min read",
            "wordCountFullTranscript": {
                "ballot": 29,
                "absentee": 16,
                "voting": 15,
                "envelope": 7,
                "reform": 4,
                "force": 4,
                "vote": 4,
                "election": 4,
                "candidate": 4,
                "tape": 4
            },
            "wordCountSummary": {
                "ballot": 5,
                "absentee": 3,
                "person": 3,
                "voting": 2,
                "day": 1,
                "2nd": 1,
                "option": 1,
                "signature": 1,
                "mark": 1,
                "times": 1
            },
            "fullTranscript": "Hello, my name is Sherry Weiner, I'm co- chair of the voting reform task force of Community Board 8, which represents the Upper East side and Roosevelt island. Recently, the task force has put on two programs dealing with voting in November 2020 at our first meeting, Assemblyman Dan Court updated us on all the new voting reform laws that had just been passed in Albany this past week we had as our guest speaker, Susan Lerner who's executive director of common Cause, New Jersey, who gave a wonderful program on the ins and outs and vote, are voting in New York City in on November third and for this election. The purpose of today is I'm going to do a little public service announcement on the correct way to fill out. Your absentee ballot today is the last day to apply online today being October. 27Th is the last day to apply online for your absentee ballot, but you can apply for it in person through November 2nd. So before I do that, I want to just show you what you should have received by now, which is your vote safe NYC. In this it has all kinds of valuable information as to the hours that you can do early voting. If you choose to do that, and it also has a card that looks like this, which is an express voting card that when you go to your designated early voting spot and that's very important in New York City, you can not go to every any early voting location. You'll have to go to the one that you're designated the two most prominent ones for the Upper East side or early voting at the Robert Wagner Middle school, which is 225 East 75th street between second and third. And then, if you live in the upper part of the district, you would have your early voting at the Jackie Robinson Complex 1573 Madison Avenue, with an entrance off 106Th street. So it's very important to remember. You can't go to either you have to go where designated and the way to find that out is to go to the website, find my poll site. Dot vote, DOT NYC. So that's how you can find out if you want to vote early now for those of you who have decided that you do not want to wait online and the lines have been long. Four hours to vote, you can fill in your absentee ballot. So hopefully, by now you have requested your absentee ballot, and now you have to fill it out. So this is the envelope that you would have gotten, which is your official absentee ballot, which is right here. Okay, so now we open it up, and in here you have your. You have your ballot on the ballot which is here. You fill out the name of your candidate and though the instructions say darken in the bubble. Next to your candidate, it's the bubble actually is above the candidate and be careful that you can only vote once so, even though, let's say for President, Joe Biden is on both the democratic line and the working family line and Donald Trump is on the Republican and the conservative line. You only can vote for a candidate once it does not matter how many times they are on the ballot and then when you would continue down your ballot, you would vote for a member of Congress State Senator, an assembly member and then remember to flip it over, and you will vote for a justice of the Supreme Court, a judge of the civil Court County and a judge of the civil of the civil court. So the ballot has two sides be careful: do not put any extraneous marks on the ballot just to fill in the little bubble, with a black or a blue pen. Okay, so now you've done that. Oh and another thing do not be concerned. If up in the corner, it says of official absentee military ballot, there should have been a slash between absentee and military, but they left it out, but this ballot is still appropriate for you to use as an absentee ballot, even though you are not in the military okay. So now we filled that out in your envelope. You will have the official absentee ballot Envelope. Okay in this envelope, you will take your ballot and you will place it into taking the ballot and now we're placing it into the official absentee ballot Envelope. Okay, then you have to seal it. Take the tape off. You can not put scotch tape or anything else on this, so you've just taken this tape off, and that will enable you to seal this now to help us out after the confusion in the June primary, they actually have a place that you have to sign, see the red x. We did not have that before, and many people did not vote so you're going to vo you're going to sign your name now. You have to be very careful that the signature you use here is the same one you use when you register to vote. Otherwise your ballot will be thrown out and you need to date the date that you're signing this all right. We're almost there now to add to the confusion and actually to speed up the process. You're going to take this envelope and you're going to put it in the official election envelope now on, you will notice on this envelope, there's a little clear area. You have to put the barcode, which is here there, so you have to turn it upside down. So here we go so it's upside down and that is going to go into the official envelope and now the barcode is visible, because this is how they're going to expedite checking all of these absentee balls for the general. They are not stamped. You need two stamps to put on here. If you forget, or only put one stamp, the post office has to deliver it, but it you really do need two stamps to put on there all right. So now, what are your options? You can go to the mail and mail these? They have to be postmarked by November 3rd, but if they are postmarked, they will still be valid through November 10th, because in New York I mean they have to be. They can need to be received by November 10 because in New York, interestingly, they do not start counting absentee ballots until seven days after the election. That is because, even though you've requested an absentee ballot, you still have the option of voting in person. So if you vote in person, they will not count your absentee ballot. So that is the reason for the seven day delay in doing that now, some things new that are happening in this for this general election. You can track your ballot when you get your absentee ballot, there's a number on there which you can use to track where your ballot is, and if your ballot has defects and is curable, you will be notified. What makes it curable? Well, let's say: you're they're, not sure if your signature is the same as when you registered or you forgot to seal it or if you are voting with a mark and it has to be witnessed, you have not. You have not witnessed it and they will actually call you. They will try three times by phone to notify you that your ballot has a defect and it can be, and it can be corrected, so you would have that opportunity to fill out an affidavit and vote again. I'm just trying to look at my notes here. I think that kind of you know summarizes it. I do can tell you that there are long lines at the at the early voting sites, but you can just go in and drop off your ballot. So let's say you've filled your ballot out, you're, not comfortable putting it in the mailbox. You can go to your early voting location or on November. Third, you can go to your actual voting location which may be different, so you really do need to go and check at it is you can go to find my poll site, DOT vote, DOT NYC you put in your address and it will direct you and it will direct you where to where to go. So you have that option, but so hopefully this has been helpful to you. I've tried to identify the issues that have come up with people having their absentee ballot rejected. Remember to sign it, remember no extraneous marks on it. Do not use tape to seal it. Put two stamps here and the message from the voting reform task force of Community Board aid is that we encourage everyone to exercise their right to vote and vote early. I can't say about often- and we look forward to seeing you on future meetings of the voting reform Task force. Thank you so much.",
            "summary": "27Th is the last day to apply online for your absentee ballot, but you can apply for it in person through November 2nd.\nEven though you've requested an absentee ballot, you still have the option of voting in person.\nIf you vote in person, they will not count your absentee ballot.\nWell, let's say: you're they're, not sure if your signature is the same as when you registered or you forgot to seal it or if you are voting with a mark and They will try three times by phone to notify you that your ballot has a defect and it can be, and it can be corrected.\nI do can tell you that there are long lines at the at the early voting sites, but you can just go in and drop off your ballot."
        }
    }
}