{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB5",
            "channelId": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "title": "Power to the Youth: Creating Change from Activism -  A Youth Town Hall Event",
            "publishDate": "2020-07-09",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB5",
            "normalizedName": "Manhattan Community Board 5",
            "twitterName": "Community Board Five",
            "youtubeChannelName": "Manhattan Community Board Five",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC-qjOBGaBHStwauSQwayM2w",
            "twitterHandle": "@ManhattanCB5",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 2,
            "um": 37
        },
        "wordCountFullTranscript": {
            "people": 85,
            "school": 37,
            "things": 35,
            "education": 30,
            "lot": 26,
            "question": 22,
            "way": 21,
            "time": 20,
            "health": 20,
            "system": 18
        },
        "wordCountSummary": {
            "people": 16,
            "education": 7,
            "office": 6,
            "school": 6,
            "lot": 5,
            "officials": 4,
            "policy": 4,
            "government": 4,
            "things": 4,
            "borough": 3
        },
        "fullTranscript": "You good afternoon, everybody we're gonna start in just about 30 seconds, so thank you for joining us about 30 seconds, we'll go ahead and get started. Okay, everybody thanks for logging in and taking the time out of your afternoon to attend our first power to the youth town hall, brought to you by our partner community board v, which is so graciously hosting this event. A very special shout out to Luke's abydos community associate and Molly Rubin district manager cv5 for making this happen and to my colleague sandy Renwick, our NYPL government relations associate director. My name is Richie Yukiko and I'm. The managing librarian for young adult services at the Stavros Niarchos foundation, library of the New York Public Library. So a few housekeeping items for all of our attendees and again, thank you for joining this new meeting is being recorded if you do decide to log off, for any reason, no worries the recording is available via livestream right now and will be viewable later on cb5 youtube channel. At the end of the discussion, there will be a short Q&A at the end, where you can raise your hand with the button below and give which gives you an opportunity to queue up to ask questions to our panelists. Of course. Given a time constraint, we unfortunately may not be able to get to all of them. So, as our library president tony mark said, recent events have yet again made all too clear our long-standing racial injustice, division and hatred. The deaths of George, Floyd, Al, Manar, burry, Brianna, Taylor and Tony McDade weigh heavily as they are tacked on to a long, incomprehensible list. We have heard the voice of so many young people out in the streets and online calling for change, and what can change really mean? What can change look like for young people who are directly affected by policies implemented now and in the future and who better to ask than our very own New York City teens today for power to the youth, we've brought together three young leaders who will be in direct connection with our lead public officials, and you could go ahead and pour that over. So we could see their faces on our sly. We have hawa Tom youth leader, 18 years old, who will always have the passion to do little things to change the world: cynical Garcia, youth activist dancer and artist, whose interests lie in advancing black excellence and dismantling white supremacy. He is the current vice president of Nan youth huddle and that's National Action Network and is in the midst of planning several justice for black lives rallies. He plans to continue to keep politicians accountable for their actions and advance the cause of young people. Then we have an ayah or nya Danforth youth leader, 18 years old, and aspires to be a professional dancer activist and filmmaker that exposes the corruption within our criminal justice system and in conversations with them. Today, for our public officials, we have deputy borough president Matthew Washington of the Manhattan borough, president Gale, a brewer first deputy public advocate Nicki Smith of the office of public advocate Jumaane Williams, and then we have also New York City Council member Carl, inna Rivera of district 2 and with all of those introductions with that I cede the floor to our young people, and if you could go ahead and show on your camera Paula, would you like to take the mic? Yes, thank you so much Vicki for the introduction. Our first question that I would like to pose is what has got you into the public service that you are a part of, and why is it relevant for today and today's day and age? Should we just pick who goes I can start this a first of all than to thank all young people who are a center in this conversation thanks eb-5 and thank the public library for a whole sing. This event I think anytime. We have a chance to Center the voices of young people who are really the leaders of today by tomorrow, with during all of us ourselves, a big favor and in fact that Ashley is a great segue into your question, which is why am I in this stuff as I get into policy and politics and organizing for me, I think it started around the same age as I. Think some of the attendees here, maybe a little bit younger I'm, originally from California Los, Angeles and I. Remember to like formative, things happened in my younger years. One was I was a witness to the Rodney King uprising in Los Angeles and my family was actually directly impacted by the uprising at that time. So a few things I pivot in my head, which would be one but my family are used to on a small restaurant out of Los Angeles and it burned down. During that time, I was a bad impact on family I, recall, obviously, a black man being just brutalized by the by the LAPD for basically ridiculous, unjustified reasons of and I also recall, looking outside on the street I miss seeing National, Guard military tanks rolling down the street and then the president. At that time, then President Bush senior getting on TV I'm. Basically, in my opinion, victim blaming black folks at that time for responding to you know that the brutalizing of a black man Rodney King, so that was sort of my first taste of okay. There's a this thing called race and class and systems that may disadvantage. People who look like me then fast forward in terms of how I, really, if I'd, that I would be doing this work as a career was in 2000 as a result of the presidential election again bush-gore but where's the Sun and I. Just remember again talking about black people and systemic inequities. We had a hard time casting ballots, particularly in the state of Florida, which was the state that the election I came down to. So with those two sort of formative events, I sort of realized, one I want to be involved, I'm, not sure exactly how but I want to be involved in the political process. I think for me, I ended up going to college I went to UC Berkeley and cow in California I'm a getting involved in city politics there. It was a super fortunate to be able to I. Think, like you all, are doing here, speak to the elected officials and actually getting involved in city government there. So, while I was spent years here in New, York helping elected officials literally drafting right bills, I did that myself during college, so that was really great grounding my soul, to wrap it up and to get to your point power about how that all relevant said today. Those experiences inform how one I should be listening to people, particularly young people, and you know what you all are saying. One is the problem and two are the solutions and I'm privileged to be in space now, as deputy public advocate working with public advocate's Ronnie Williams in pushing the mayor or certain reforms, and also working with council members, including councilmember Rivera, who is on and adopting the reforms that young people in others are pushing hard on so I love that question I. Hope that answered your question. It definitely did answer my question. Thank you. So much for that very descriptive answer. Would anyone else who was an elected official like to answer this question I think that was a setup for the councilmember as she's, the only one elected so take it away and I'll happily follow her. You were both very supportive and Nick and I met as legislative directors. So I guess. The question is like kind of the relevance of our position and how we got here right. I, don't want to go to on too long. I want to make sure that I kind of really answer your question, and so for me, I was never like. My family I will tell. You is not was not the most political. We always voted, though right. It was always like a big deal to vote. I tell people. There were three times my family got dressed up. That was to go to church, to get on a plane and to go vote. Those are like three very special events that we would do together and I. Just remember that being so important and I grew up with a single mom and I would just see kind of like to grow up in New, York, City and Section eight, and to be raised on programs like WIC, which is a full supplemental program for low-income families. That kind of just all informs the path that you're, eventually going to go on. I never thought that I would be an elected official, but I tell you that now that I am I've used all the years of organizing and providing services and being on the community board, which all of you all can do and now I'm in a position where I can actually push legislative reform or I can advocate to you, know, repeal fifty-eight and make sure that we have transparency and accountability in the NYPD that we're still a very long way from that. And then you know, put forward a bill to ban the chokehold nationally to make sure that I'm funding programs and services that not only I needed as a young person, but that I know that are important to just basic survival. So to see all the young people here. Everyone involved, especially the protesters that are that are leading not just this movement, but young people have led every significant civil rights movement ever in this country. It gives me a lot of hope and I'll. Tell you there right now in the youngest woman on the City Council I'm, not the youngest person, and you look at me and I'm, not I'm, ready to let that go. I'm ready to have this new crop of women in LGBTQ and tgn CMB New Yorkers come in and really bring that energy that I'm seeing here right now. So sometimes you know I remember as a young person saying politics and the government, they don't do anything. But when you look at what we're funding, how we're making things happen, how we're providing services to people I mean my office has hundreds and hundreds of cases. You're gonna see that you really can affect change and being an elected official being in government. Sometimes it can take a little long and you know you can get impatient, but as long as you have the people behind, you can really do anything awesome and how I? Thank you very much for the question. Many thanks to you and anion pinnacle for leading this discussion today, being the youth leaders and activists that we need who need to tell us what we need to do. Those of us who are working government and all so much thanks to Sidney and Richie in New, York, Public Library, and also to Lucan Community Board five, how I love that you're promoting reading on your shirt, which is awesome because we definitely need to read it's so important and critical, and you know when I think about how I got into public service. You know it's just it's through personal experiences. You know: I was born, bred and butter in East Harlem, so I'm, a native New Yorker and you know growing up in East, Harlem I was born in 1982 and so experienced the city in the 80s and the 90s, and you know seeing the complexity and the challenges that our city faced. You know: I grew up in a single-parent household. My mother raised five of us by herself and you know: I lost my father when I was three years old and my father was a drug addict here as a heroin user and contracted HIV from using needles to inject drugs into a system, and so he died of AIDS in 1986. But when I was three years old, and so my mother at 33 became a single mother of five children and growing up in East Harlem in the mid-80s, you know around plenty of other drugs around violence and other things. You know it was easy for people to say. Look at these five black kids, they're, probably gonna fall to the streets, but by the grace of God. My mother cared enough to say she wasn't going to allow that to happen. She was going to focus our attention on education. She was going to make sure we went to church and she was going to make sure that we understood that we had options and growing up. You know like any other children in the neighborhood. We would play basketball with others, and you know growing up. I saw you know young people who I used to play basketball with who lost their lives. You know to gun, violence or otherwise or were just no longer around, and we didn't know what happened and you know as I was in school and even in high school I joined student government, which was interesting and exciting, but there was always this draw to my community because for me you know again by the grace of God myself, my four siblings. None of us ever fell to the streets or drugs or gangs, or anything like that and we were protected, but I never felt any different from the friends that I grew up with the people in my neighborhood, the young people in my neighborhood, who didn't go off to college and wanted to stand up for them to be a presence. You know for my neighbor to say, I care about you and I'm gonna fight for you and it continued after I graduated from college. You know coming back home to East Harlem with my mother know: I didn't want to live my mother forever, so I was looking for a place to live, but you know that was the first time. I realized how broke I was because I couldn't afford a place in my neighborhood to live and I had to get out of my mother's place. But thankfully my older brother was still in the city at the time, so I was able to live with him for a while, but it was like man like wait. A second like I'm trying to fight. For you know the people in my neighborhood and I want to fight for them. I want them to get jobs and I got a job and I went to college and I still can't live in my neighborhood there's a real problem here, and so it started and kicked off my effort to join my community board and be in public service to say, I'm going to use whatever power I have whatever voice I have to fight for somebody else, because I know some of the struggles, but I know that if we're given an opportunity, if we're given a doorway to walk through that's different than what somebody else may have told us, we have to walk through. We can make that the best choices for ourselves, so I got in. So I could help make sure young people know that we have choices and we can do great things. Thank you and you're speaking about choices and young people, and so I want to again go ahead and open the floor back up to our young leaders. Did you want to go ahead and talk with our with our public officials about your questions on policy? Yes, I would like to start Matthew. You mentioned three things. You mentioned youth community and protection. So my question is in a time where black and brown communities are struggling. What are you doing to ensure that we are getting the upper hand, whether it's education or mental health, sure our pinnacle? Thank you for the question. It's an important one when we think about our communities and when we look at proficiency rates in reading and mathematics too many times too often we're falling behind, and so what are we doing there couple of things right when we look at those things when we look at protection, when we look at education, we look at health. You know big component and you know Councilwoman Rivera started talking about food assistance programs. We got to make sure we have food on the table if people are not able to eat if people are not able to get meals when they need them, particularly young people. It's just going to be a domino effect and everything else is going to be impacted by that, and so, when I think about the need for food for people in an economically disadvantaged areas, we have to make sure that we're providing food and so our office in Manhattan borough president's office. One of the things that we have really worked hard to do is to make sure that there is food available by supporting farmers markets in neighborhoods by supporting growing programs working with great organizations like Green City force that are putting farms on NYCHA developments, harvest home farmers, market, concrete, safaris and many of these organizations that are help providing food. So that's one of the things that we are doing in our office to make sure that food is accessible. Also when we think about education and schools, the school facility makes a big difference. If the schools have a broken bathroom or broken air conditioning unit, how can you comfortably get your education if you're struggling to find a place to go to the bathroom or in the middle of the summer, you're worrying about whether or not you're going to pass out in your classroom? And so one of the things that we've also done in the borough president's office? We have the ability to give funding to schools to help them fix bathrooms and air-conditioning units, because if you don't have that space that you can learn effectively in then you're not going to do as well as you can. So. We've been investing a lot of funds into schools to make sure schools are as best as they possibly can be, and we look at the different school districts. You know in Manhattan we have six different school districts, and so we look at those that are performing best and then those that are having more challenges with performance. And so we try to address those school districts that have the greatest challenges, but even within districts that are generally doing well, they're still, schools that are having a hard time. So how do we work on each school that you know over 300 schools in Manhattan? How do we work with all of them to make sure they have what they need is critical and then, when we think about the protection that you talks about, pinnacle is making sure communities are healthy and alive and thriving, and you know if we are building more cohesion amongst ourselves between us and our neighbors. We have safer communities, and so you know what do we do? We've hold held a number of activities to focus on policing, community relationships, building those, but also working in communities with others, to build community task forces and coalition's to work collaboratively on different ideas, and so we think a community that's working together as a community, that's going to stay safe together. Thank you great point. Would anyone else like to take over and answer the question? I've got a quick point about. Actually you mentioned mental health. I think this is a issue for young people and not so young people in terms of many prongs but I will say. The office of public advocate is working on some legislation right now on the mental health issue, to support families and including young people, I think, as many of us know right now, if you call 911- and you complain that you know a friend or a member of the family is going to a mental health crisis right now, they send police officers to respond to the scene, but then often yeah they often can become a dangerous situation, because if you think, logically, by sending someone in the uniform with a badge and a gun and their posture is, you know not necessarily to de-escalate a situation and they may not have the training to de-escalate those can turn into some pretty terrible situations and I think in particular, of a black woman who lost her life for Deborah Danner in a similar circumstance and there's just all the cases across the city, but in recent history of encounters people who are experiencing some stress by any counters with police. So one of our goals is to ensure that we pass legislation to reform the whole system itself to not have a person with the badge and a gun in a uniform respond. First, we have a mental health counselor or a peer or someone better trained to respond to those encounters, as opposed to again sending cops to those scenes so that that's one of the initiatives that were suing as an office, I would also say in terms of mental health of young people. I mean this kind of forum. I think is really fantastic in the sense that you are yourselves organizing and pushing change, and we try to as an office make sure that we are having similar types of events, but ensuring that we're listening as people who are in government, because there is no real division between you know, quote young people and Carlina Matthew to myself. I think we all have an understanding of, or should be listening to what you are saying, because you are closest to the problems. Our role is to really hear you and I would thoroughly, and lastly, just say in terms of listening, it's important for those of us who are parents or teachers or others to again listen to what young people are saying. It isn't a space of young people, don't know what they're talking about they really do earlier on. The call and I was making some very poignant points about gentrification, pretty impressive and that's the kind of conversation of that teachers and parents and folks in government. Listening to you all, really do have the answers to the problems that we face, and why is that mental health related? If you know the problems, and you can't push people who are a quote in power to solve them, that can also be a stressor. So this form I think it is great to help those in power really hear from understand the things that you are pushing for some grateful for this space, pink I'll just say: I'm, the you know in the City Council on the chair of the Committee on hospitals and a lot of my work has focused on addressing systemic barriers to healthcare, and that includes mental health as well, and Co would really Illustrated the inequity in our health care system. That most of us knew was there all along. We knew these communities that were disproportionately affected. Black and Latino communities have always had they have just a history of a lack of investment in these communities for things as basic as health care and so I'm, advocating for greater transparency in the city's test and trace program right now to make sure that it's actually helping the black and brown communities that are suffering the most right now because of kovat 19. And if you don't know what testing traces- that's, okay, it's just as people get tested for Covid-19 19 if they do test positive, making sure that they can trace the people that they've come into contact with to make sure that they get the services that they understand what it means to quarantine. So we can get to the point where we can continue to reopen our city. Thank you great question. Thank you and everybody's here. Speaking about school and education. I know one of you I, believe niya really thought about education, reform and questions on education. If you wanted to go ahead and talk about that or asked about that, hi I'm nyah, so yeah I, don't really have a lot of questions in regards to policy, but a lot about education and I just feel like k12 is not getting the proper education, especially black and brown teams, and we really ask ourselves why teens of color drop out of school, but when we see what we're learning at school and has nothing to do with our history, it has nothing to do with where we come from. What reforms do you think we should make in the education system to make sure that all groups are represented and all groups are all forms and traces of history are talked about and understood not just by black and brown kids, but also privileged white kids as well and I do want to interject Maya before everybody else. Answers about that niya you and hawa just recently, graduated as well in white and persevering, and congratulations and persevering in our remote learning environments. Congratulations two-year! Thank you. Well, we could start with putting forward a curriculum that actually covers black and brown history in a real way. Instead of spending a day on slavery and a day on, you know, civilizations in Africa and not really going into the afro-caribbean history and redlining, and the lack of Economic Opportunity, there's so much there that we just all we do is read about the founding fathers and there's nothing wrong with that. But all we do is read about the founding fathers and the Nina and the Pinta and the Santa Maria, and it just you, don't have it in front of you. How are you ever supposed to be able to digest it to absorb it and to actually understand that there's so much trauma in our communities that go so far deep so far back decades and centuries and for the City Council to have to fight to you know include LGBTQ, inclusive curriculum, that's ridiculous. We shouldn't have to do that and what schools can also do. Hyper locally is maybe teach a little bit of history about. Why you're that your school on that block in Harlem? What are the Lower East? What is the Lower East Side history, who are the pioneers around here, who worked on affordable housing and made sure that you know Puerto Ricans were allowed to finally have a limited equity co-op on Grant Street? You can get so nuanced and just spend a little bit of time. So people understand that just like organizing it starts right in your home. It goes right to your block into your neighborhood into your city in this country in the world, and then you get this kind of international understanding that can change your perspective on policy and try to bring in new fresh ideas. While also grappling with what is just you know, racism, systemic racism, entrenched and really just affecting everything that I think is basic, which I always say is food housing, education and health care. You know one thing about K to 12 education and thank you for the question and I yeah I. Think we've got to do a better job that at making education a little bit more relevant. You know, trigonometry is great! Geometry. Is awesome, I actually love those subjects quite a bit. But how are we thinking about the needs of families and if you are in a low-income family? Well, can somebody tell me how trigonometry is helping me get a job that I can help take care of my family with and so I think we need to infuse more career pathway, ideology into schools and help young people. Think about that I think what Carlina mentioned was important. We need to have a more holistic approach to education, thinking about history and not just hey it's, you know: January 15th, Martin, Luther, King, jr., Day, and then you know January 16th, it's like all right back to trigonometry and it's like wait. A second what happened, and so you know I think we need to have you know when I think about you, know economics. You know the importance of economics, you know how many you know how many young people are learning about credit in high school right. We should teach about credit and to understand credit so that we can reduce the impact that negative impact that credit can have on so many young people as soon as you turn 18 you're out of the house or whatever it is, you get a credit card. No one has taught you how to use that and so I think we need to think about that a little bit more. You know we, there used to be more classes that you know taught cooking in school, right home economics what it used to be called, and there were some concerns about that, so those were removed. But now you look at that the food network- and you see you know these amazing chefs who were doing incredible things, and why not? You know the young person who grew up in NYCHA. Being the you know. Next great chef, you know whatever show that we're watching these days, and so how do we think about the conversion from the classroom to real life, to addressing real life needs and I think we have to do a better job at showing those connection points and providing more information to young people about how there is a pathway for something beyond just the classroom? Now education is important and there's some things that are great and some things that you know are important knowledge to have that you may not need to use in your day-to-day life, but are important facts, but how do we also infuse this idea of there's something next and I'm, going to show you different pathways to get to different careers in the future? I think those are two really great points. I would just add one other element, which is the issue of the dollar money. Aside from the curriculum, is also about equity through resources and a few years ago a bunch of parents sued the state, so the state has the ultimate responsibility. Well, the federal government has ultimate responsibility for funding, but the state has a large part of it and Aaron sued and the campaign called the campaign for fiscal equity which, in the end, ruled that New York City, with about 1 million students, had been underfunded by about 5 billion dollars as compared to other districts in the state in the state. Even up today has just refused to fund that missing gap, and that means stuff, like lack of computers, for our schools across the city, including neighborhoods, like mine books, resources, and that has a real effect on outcomes. So when it comes to your point clinical about the curriculum and the relevance of it and it comes to the money, it is actually up to our elected leaders, including the governor and our state, blessed officials to adopt a better curriculum, a more relevant curriculum and fund our schools equitably across the state. So that is a long, ongoing sort of arduous task, but I think with all of you and all of us continue to speak out and push particularly the state I think we can't have some progress. I really feel, like you guys, made really good points about, like all the elements within education, especially the connection between, like my life and the life that we learn about and I feel like a lot of older people who, you know, aren't really worried about high school and learning anymore. You know they don't really have that recollection of what it felt like to be a high school student or to be a regular student. Elementary student middle school student learning these things, because it's like you're in school, you just go to school because you are told to go to school. So it's not even like we're growing and affection towards what we want to learn. Necessarily it's more of a like. We have to learn it because people say that we have to win it so I feel like it puts this like a force and a lot of young people's brains that we have to be a certain way and it kind of creates that divide between the privilege of black people and the privilege of white people and I feel like there's a lot of misunderstanding when it comes to. Oh, the black lives matters movement, because people feel like it's an anti white movement when it's actually not you know, black lives matter is a movement that is trying to emphasize our value and our worth in society. The fact that we have to continuously repeat over and over our life matters, because other people look at us and feel automatic threat or feel like we just automatically don't matter in society that you know just because the way that my skin color looks and not what's in my brain and my potential and how I want to strive to be important, strive to move Society, it's very disheartening to be a person in society to continue fighting for something that we shouldn't even be fighting for. So I feel like when mr. Smith mentioned the value of money. I feel, like you know, a lot of white supremacists really are involved with money. I feel like everyone in the world loves money. But it's like you know it's more of a greed thing. It's not more of a let's, be united. Let's help each other out, let's bring each other up from the top it's more of like whoever gets it first is whoever gets it first. So when it comes to the school system, they're, not thinking about what we need, they're, not thinking about what needs to be said, they're, not thinking about what we actually need to learn like how mr. Washington mentioned about computers and how we need all these different things about home and learning about credit, and we don't have that. You know no. We literally learn about history and math and an English Composition and go into the world with not a thought in mind of what we actually have to do. What we want to do so it's like what are different ways that we can. You know, reach out and actually make this message heard. Well, how I think the first thing that we need to do is all sit down, keep our mouth shut and listen to you talk because you have, you know, just you know an incredible passion and understanding for what's going on and the way you articulate the argument is really powerful, and so thank you for being willing to share, and you know, with respect to what we need to do. You know I'm always reminded, and so often when we talk about different issues that are happening. We talk about the civil rights movement and great civil rights leaders like Reverend, dr. Martin, Luther King, and you know, but I'm always reminded of this Dylan Student Nonviolent Coordinating Committee out of Shaw University young people who decided they were going to have sit-ins and they knew they weren't allowed to sit at these lunch counters in restaurants, but decided that they were going to walk in, and you have teenagers who were going in to say we're not going to stand for this injustice, and so I think you know where we see injustice is where we see so many things that are, you know happening. It's figuring out: how can we stand up and say this isn't right and how can we demonstrate? You know, love towards others in a way, that's meaningful and show respect for the people who were trying to fight for and so I think it is. You know, Nick earlier said you know, you're, not the leaders of tomorrow you're, the young leaders of today, which is so appropriate because young people are always history is shown. Always young people are the ones that lead and it's the older folks who jump on afterwards now I'm only 37, so I'm still young I, consider myself a young person. So don't knock me out and let me join you, but I think we need. We need your voice right. It's a few years that I've been out of out of high school, so I need those of you who are in high school or just graduated from high school. To tell me what I need to do to support what's happening there and so I think what we need are your voices in that area and I. Think when we look at when we talk about economics and money, I think we have to change how we perceive money. You know money should be seen as a tool, not as a crutch. We shouldn't see money as something that we need help to walk, but something that we can utilize on our walk. You know what I mean, and so it's like thinking about what you know if we are too driven by money, we're missing the point there are needs and how do we cover our needs and then how do we share? What we've learned and that knowledge with one another and so I think it's that sharing in exchange? That's so critical for growth as a community very quickly. Just a great example of what you're getting at is looking. You know when I turn on the TV and I see just the amazing protests that you know folks are engaging in terms of the murder of George Floyd within the councilmember mentioned the Copa 19, just disparity and I, think you know we move policy by building quote critical mass or just you know a moment where folks are basically fed up and moving our government officials to finally change things and I'll just say you know: George Floyd, as he was dying, repeated the phrase. I can't breathe several times, as did a New Yorker that we know for not way reasons Eric garner. He repeated that phrase several times while he lay dying in Staten, Island I can't breathe, I can't breathe. You know we hit a moment now in you know the current city council here in New York City, were passed. Man you know, I was actually an aide in the council back in 2014 I. Remember a bunch of us put forward a bunch of bills and some of them move some of them didn't, but I think you know, because of the organizing that so many of you and of course allies in the council throughout government are engaging in we're. Seeing some of these systemic changes that we've long, you know push for and that's going to continue so part of it is, you know, keep pushing your government folks elected officials, but you yourself should consider getting involved civically. So we have boards called community boards and I know Matthew mentioned he was on. One I was on CB nine for about five years, council member as well. So almost one community boards and that's a sort of a way that many of us can start really engaging in a quote, unquote or formal capacity with issues that we're seeing you know on our block and in our neighborhoods so and I think the age was dropped to I, believe it was 16 or 17 right, say: 16 yeah, so you can even apply to become a member, and actually you can just obtain these meetings and they talk about issues of housing and policing and education and they also push themselves as board members, elected officials and others with solutions that you pitch and then you know more longer-term, consider running for office yourself. All of you are incredibly and I. Don't wanna use that word articulate to know that's loaded I. Just you know the answers to the problems that you yourselves are identifying, and so you know don't wait for one of us to you know, move things we should be moving on things you're pitching, but consider how you yourselves can join a board or even run for office, because you just you qualified to do it. I mean you are the leaders that will make these changes. Yeah I would just say absolutely join your community board. You know, I have interns in my office, young people and I post questions to them constantly just to get different perspectives of people that you know are in high school that are going to college in college. I recently asked my interns, you know what does it mean to you when we talk about defunding the NYPD abolishing the NYPD just to hear directly from the people that are out there from the people that are really have been served with a lot of the mistakes that we have made as a society and that they're going to have to live with and try to grapple with police brutality with climate change, with everything else so is just trying to bring as many of y'all around the table and the way you can do. That is through all the ways that my colleagues just mentioned, and you know I was never in interning government actually, which I had so that's a great way for you all to start how I started was volunteering at a local organization? I became a housing organizer, I did counseling services for seniors and I took that and I brought it with me into government, and that was an elected official. So you know sometimes it's not easy to think about. Oh, what's gonna be my next opportunity or my next job when you're just trying to help your parents pay the bills or you're just trying to figure out how you're gonna put food on the table or like you'd like a new pair of sneakers every once in a while I get that. But you know just that: civic action that's out there has been inspiring for all of us and please know that what happened just recently with the repeal of 58, with the cuts that did come to the NYPD, though all of us have been very vocal that it did not go far enough. That was all because of the momentum outside literally outside of City Hall from all the protesters and everybody who has spoken up and I just want to add a quick shout-out for a councilmember Rivera. She didn't get a chance to mention, but she was also very active in her local hospital board. There's a Community Advisory Board for the hospital- and you know I think just remember you know, as young people just as people. You know your voice is just as important as the person next to you, there perspective of their age, and you know so just thinking about the councilmember. She really. This is her story, I'm stealing her story, but it's such an awesome story. So can you talk a little bit about it? I joined that you mean the community advisory board. Every HOH Hospital, which is the major hospitals, has a board and well it's an interesting array of people. These are people that truly care about hospitals that are technically that some of them are consumers, which means they actually get services at the hospitals themselves, and we will talk about everything from the pharmacy hours to patient advocacy to really just the rules on how do we bring our voice to the actual system and affect change within the institution? So I was the youngest person on the board by maybe a couple decades. No big deal, but it was fun. I learned a lot and you know there's a lot to learn from our elders as well, so I try to use it as an opportunity and I made some friendships with some older adults who not for nothing. They helped me on my campaign like hard. They were in the streets all the time so, as you all are preparing your own elections, remember that you can always meet an ally in the unlikeliest of spaces, so just be true to yourself. I do want to mention that our public officials do have some time constraints. I do want to pass the mic quickly over to and I offer a particular question to Nick, okay, so I kind of have a - two questions in one. So in regards to what I was saying about gentrification and it not being an editable in it kind of having the blame being put on low, not even low income people, but black and brown communities. How do you think we one go about environmental racism and add light to that? And how do you think that will affect the way that we fix? The issue of climate change: oh okay, climate change, yeah- this is a one that I have also some personal experience with I. Think growing up I actually live near an airport, and when you live near an airport, though you have planes shooting over and you have sort of. If you look at some of the studies, you see elevated rates of enforcement, cancer and asthma as a result of one of those result of living and their Airport and other environmental factors. The complication is it's a kind of a three-part solution, so all three levels of government have a role and hopefully reducing person made climate change at the City Council I think the council's been the most actually progressive on this topic of environmental racism by one looking in house. First so I know there was a bill that passed a few years ago that set certain benchmarks, for example, what city buildings could emit. So I recall that happened a couple of years ago. But when it comes to you know people of color in these areas it is making clear to our electives that you know we live in certain communities, sometimes not by choice, sometimes by design. So you know we can afford homes in areas that are not the most been environmentally friendly. So, as a matter of you know, like housing policy alone, it's making sure that we can afford homes that are kind of more spread out in different areas that we have opportunities to live in areas that are not dance terminal to our health. Quite frankly, and so, while we all experienced the effects of person made climate change, we as people of color just experienced those effects a little more kind of dramatically. So it is making clear you know what those problems are to our electives and pushing all three levels, particularly the council, in the state level, on solutions, I know the federal level. You know, I'm gonna, be a little blunt. We don't have a president and in their full Congress. That really believes in science believes that we contribute but to climate change, but I think if you're looking toward a state by the city, that is a sort of a better path to solving some of the problems particularly comes to having a racism. So where dance is key and then pushing some of the solutions, it's keys. Well, thank you for that, and you know the conversation is going really kind of so incredibly, but I need to go to go ahead and but I, you know we promised a Q&A, so we're gonna jump right into there, and- and thank you, everybody for your conversation. So far, it has been really kind of exceptional. There was a question beforehand. You know pointed to us before the actual registration started, which was what is the most significant method of communication. A team can utilize to garner attention from their district leaders, and all of you mentioned the community board. You know and looking for those options so to have their voice heard so I hope that addresses that in our Q&A chat in particular I know we have a lot of educators in the audience on this question is how can I support the educational system for the youth? How can we change the subjects and curriculum with the educational system? So how can so? You all talked about education broadly and great things to add to curricula, but how do we support that as a whole? What is this for anybody? Oh we answer. I just want to make sure. Oh yeah sure. Of course you know what let's go ahead: Crillon it I would love it for you. If you can answer that and I could, if you know pinnacle, you talked about education from job. If you could go ahead and address that as young person Keith I'm. Sorry, can you repeat the question ooh, let me pull it back up. How can I support the educational system for the youth? How can we change the subject and curriculum with the educational system? I'm, basically demanding it talk to the parent coordinator, making sure that the students are getting every research that they can making sure that able to get books, technology or trips are a great way to learn. I know when I'm on the trip I get the best education, because I'm able to look at different things and I'm able to understand things more clearly, because I can see what how the art I can see like. For example, if I were to a museum, I love paintings, I can see how the painting was created and I can tell what story a painting is telling so I think museums, anything feel really being going outside is a great way to be educated, so yeah. Well, that's exactly that's exactly right in terms of hearing from students themselves, so I had a bill that passed in the council to create these diversity working groups, but what's different about this, then in previous kinds of cohorts or task forces. Is that we're actually including students, parents and school leadership, because I think that's? The most important thing is to hear from young people themselves. I mean what you all want to do is kind of like an everyday no-brainer and in some school districts, because they have the resources they can go on trips all the time, because they're PTAs can raise a million dollars. You know not. Every PTA can do that, sometimes giving two dollars. It's a lot of money for a family. So you know we want to give you the museum's, and you know I remember in school. Those were the ways that I went to the met or I went to the Queen's Hall of Science. We just didn't really have the money for that. So there is so much here in New, York City that we can that we can bring to young people. We just need to make sure, as Nick mentioned, that there's equity and how these resources are being distributed to our school systems and we're not listening to the young people. I mean you know the school leadership teams, the community education councils. Those people are doing work on top of work that they're already doing so. They are committed to this mission and building a better school system. We just are not providing the fair share of funding, and that is a very big issue in government and it goes across all of our systems. The way that dollars flow to our hospital systems, -, is very inequitable, so I think it's really listening to you all and then making sure we're looking at some of these formulas that deal in finances that are just not coming down to the black and brown low-income immigrant communities that we need them to also want to encourage on education. You know, for those who may not know, there's a body called the panel for educational policy or pet for short, and this is a 13 soon to be 14 member body, one person selected by each of the five borough presidents. So we play role in that in our office, eight members selected by the Chancellor and the mayor and then one other person is going to be selected by the community education councils, which the council member and the first DEP we're talking about. You know we this body, they have public monthly meetings. The next one is coming up fairly soon, I think as July 15th is the next meeting of the of the panel for the panel for education policy and this group Oh Thank You Luke for posting- that in the chat. But this body is making decisions on what schools close schools that open, approving all contracts for the Department of Education over a million dollars talking about collocations of schools, they're dealing with gifted and talented programs, and so these are public meetings. And so much of this and what we've heard from the councilmember and the first deputy is, we got to show up, and so we have to show up to be engaged, and so it's going to the school leadership team meetings, it's going to the community education councils. But it's also going to these peppers, because this is where a decision these this is where decisions are being made about. Schools that are impacting all of us and so make sure we show up to these meetings, get all the information that we can to be present and all the information about joining through teleconferences right on their website get the agendas find out. What's going on be engaged and make sure all of our voices are heard in these discussions, and thank you - posting that information in the chat and, of course, I know. Curly now has a tight time constraint really quickly. There's that one question from Natasha I want to ask how we fix the healthcare situation, not only for blacks a lot next, the Native Americans, primarily as they suffer greatly and are often forgotten. How do we fit integration in this as well? Thank you for that question. You know black indigenous people of color, then, who has that who's or those groups are being disproportionately affected, so our healthcare system is a long way long way to be fixed, I mean you only have to look at maternal health and how black mothers die. You know seven times or have morbidity seven times higher than then a white woman giving birth or who is pregnant. So there are many things I think we can do. One is I mentioned. There is something called there's, a formula in which dollars come into our hospital systems and the way that it is happening right now at the state level, it's very inequitable, so our Health and Hospitals, which is our public system, which is the largest municipal system in the country which serves predominantly black indigenous people of color immigrants, people that are undocumented. They just don't receive the funding that they need. So we can't even reach that level here in New, York City with a street a literal street called billionaires row. They call it with all that money in this city, all that wealth and we can't even have people receive the services that they desperately need. So there's going to be a couple things we have to do. We have to change the way those dollars come into our systems, and we also have to look at kind of the local health clinics that serve people very culturally, humble care, our federally qualified health systems, which is, are those local clinics that probably a lot of our families go to and how are incorporating health into the education system. Why doesn't every school have a school nurse? Why are we talking about sexual education in a real way and about respecting our bodies and consent? And all of that so I think we have a lot of work to do. I've learned an incredible amount being the chair of the hospital system and what I'm always looking to experts, recommendations and any ideas you all may have I would also just say: support black dreams. If you know any black people trying to go into the medical field, support them, which you can to get them in there, because I personally has health issues and I do have a fear that going to a doc, you know I'm now, 18 I can go to the doctors by myself and I'm afraid of having to encounter someone saying I'm not going to help you simply because they don't want to. But you know that's an issue. So if you know black people who are trying to get into the medical field, support them help them get their support. Black dreams for black business, just support black everything, black supported everything native support. It just support yeah I want to support a nice dreams. That's what I want to support here. There's a good point think about how often I don't know. When did you have your first black doctor? If you have, when did you see your first black teacher I mean there's some real issues right there and a lot of that is, you know, actually lies in our education system, even medical school, the bias that is within that institution. So we have a lot of work to do support black dreams. It is 2:00 p.m. so we ran a little long but F, because conversations that are great tend to go that way. I do want to open the floor now for last box in being again mindful of time constraints on if you do have to blip off, just go ahead and wave it or like take the mic first from me, so that you could go ahead and take your statement. First I have to I'm sorry go ahead. Good I, just wanted to say I'm today, at 5:30 I'll be holding a protest at Columbus Circle. So if you know anybody who needs to go to a protest today or if you want to go to a protest, 5:30 Columbus Circle, that's great, you want it quickly. Sad! You have to jump off in a minute. I just want to thank everybody for this conversation. I do want to stay in touch. I just want to put our website out there, so people are aware by it's advocate DOT nyc.gov, any of this stuff that was mentioned today, whether you know any policy stuff I'm happy to assist in pushing just get in touch there again. Thank thee for I just want to say that. Oh sorry, you can go first, I know it's alright, you can go ahead. Okay, I just wanted to say that not only that when you do this, because I want to make sure our voices are heard, but I also want to do to serve brandy Hendrix, he was a youth that was shot and killed in the Bronx and I wanted to do this. For those who didn't get any justice or did get justice and to make sure that their voices are heard to Stop gun violence. In our communities also, my organization, nanu Todd own- will be holding a March on July 12th at 1:00 p.m. starting in Brooklyn and ending in Brooklyn at st. mark Holy Church, which is located at 1988 Fulton Street Brooklyn Europe. Also, we will be having our March in Washington August 28th and that will be led by our founder Reverend Al Sharpton. If you have want any more information, you can follow us at Nana huddle at Instagram. Thank you, I just wanted to like cuz. There was this question about. How can we like change our education? I? Don't really remember what that question was but I just wanna, I'm, sorry for any noise. There's construction going on I just wanted to say that there's you don't necessarily have to change what we learn. It's basically we're just adding things that are missing. You get what I'm saying. So it's not! We don't have to stop learning about what we learn in history. We don't have to stop learning about math or English composition, because we do need those things to read, and you know it's just like. Sometimes simple math can be used in real life, but not in ways that we assumed it would be. But when I'm speaking about history, you know there's a lot of missing history with Native Americans and black people and Hispanic people and there's a lot of questions that are always over my head and I know. There are always a lot of questions over my peers, heads about certain things and we always have to educate each other on different things. It's never oh yeah. We definitely learned about this in school. Like I, definitely know what I'm speaking about. So it's not I, don't feel like. We have to change our curriculum, it's more of, like you know, adding the things that are supposed to be there, things that we already supposed to know and we already invest in learning online school. There's many schools that invest in schedule a Google classroom. You know people pod, so we, if you, if we can't have the money to support and get textbooks or books, we can simply just go online, find our own resources. Do our own research. You know it isn't necessary. We have to everything, doesn't have to involve money and I feel like a lot of people. Don't really understand that, because we're already online we, this whole half of the year, was our school year was online, so it I know there are some schools that don't have access to computers and stuff. So you know going to the library is free. You know, there's many resources that we can touch but aren't thinking about. Thank you so much, however, I put in the library and again, okay, so again, being mindful of time, I'm gonna go ahead and give the floor, like it support give anybody a chance to flip out now, while they can, without it being too awkward. I know no one wants to leave, although you they're talking so please we're going to wrap up with last minute announcements from CD five and I'll go ahead and do one more plug again for Naya. You have here March again today, right now at 5:30 for Columbus Circle and then Fernan youth, huddle, pinnacle you're, doing Saint, Mark's, Church 712 in Brooklyn and, of course, the March on Washington August 28th, led by Reverend Al Sharpton, okay, folks, thank you so much and Luke did you want to jump on speaking of community boards Matthew that you continue to push. Thank you for that for our young people to join Luke. Did you want to talk a little bit about the community board meeting coming up on Monday and I will take this cause opportunity to plug the census? Definitely the census! You know make your make your lives out there. A number count. You know first important, fill out the census. It literally takes five minutes, probably less it's online. If you can on your phone, take the census and again I do want to invite Luke back to the floor. To talk a lot about cv5 meeting on Monday Casey doesn't change Richard well, Lucas is getting back on I just wanted to give a big. Thank you to an eye on how and pinnacle for leading this discussion today. You know the program that you put together and the questions that you came up with, where my thoughtful and challenging, because they challenge us challenge myself. You know certainly challenge the council number two to continue to fight for young people to continue to for underrepresented communities, unheard voices and the three of you are really incredible. Really amazing and so I look up to you and then grateful for the opportunity to be in this town hall with you and I have nothing but love for council member carleenrenee, or so it's always wonderful to see her and Nick is my guide too. So. Thank you all for letting me be a part of this space and you know continue to show up continue to be present, continue to focus on reading and giving shoutouts for the New York Public Library, because a reading is critical. We need to do that, and you know I'm just grateful for this and many things to look for it for being the hosting and keeping us all together. So I'm just grateful for the opportunity to be here and just have love for everybody. So, thank you I'm just going to say that since this New York, Public, Library and CB 5, who they know, I love them so much. You know a couple books that, to me kind of I just think are important. There's the indigenous peoples history of the u.s. there was a book. I read called the war against all Puerto Ricans, which talked about how they treated and killed political prisoners. Sterilized Puerto, Rican women. There is a lot of content out there, so Anaya. How are you all right? There is information out there on, but you all deserve investment. We deserve investment in the systems that are supposed to protect and serve and care for us and that's what we'll be fighting for every day, but I'm so glad that you're leading the way thanks. Everyone. Thank you. Thank you. Thank you for Lena. So is that I guess I do want to plug, of course, the New York Public Library. We will be reopening on Monday eight select locations and if I was more prepared, I would have that list ready. Few Library District, so the Stavros Niarchos foundation library, is reopening, is formally known as the mid Manhattan library, and then we have additional branches open as well in the Bronx Francis, Martin library, Parkchester library and the Bronx library Center in Manhattan. We have George, proves Epiphany and of course, like I mentioned the Stavros Geragos Foundation and in Staten Island we have Richmond town library and Todd health westerly library, so these locations are open for grabbing those service. Only so again, if you need to apply for your library card online through our simply e app and then you could go ahead and make your request to pick up your items. If you just need to return your books, you can hold off on that. For now, the fines are not accruing where we just want everybody to be safe and you do need your books. Please browse our catalog and make your request a time to be sent to any one of our eight locations. Okay, oh pinnacle is asking, of course, pinnacle has been an attendee and an hawa is what I hope to see you soon. Nya pinnacles attended our teen zone. So we have a brand new teen center at the Stavros Niarchos foundation, library, which has a recording studio. The media lab Oh been my dream to open it for our young people here, but, of course, taking into consideration safety or health of everybody. We aren't opening that floor just yet so far grabbing drug service, but you folks will be the first to know. I can guarantee it. Okay, I think that's a great point to end last thoughts from our young people, one more time since everyone's saying thank you. I just want to say thank you as well. I feel like. We got a lot of points out there, even though I feel like we can talk about this for hours. I just want to say thank you for everyone for putting this together. I want to say thank you for everybody who participated and everybody who is watching and gave questions. Yes. Definitely thank you, everyone for coming and joining us. Thank you to our thank you to Matthew, Carlina and sorry, my Nick sorry Nick for joining us and yes, like Richie, said the census is very important, fill it out and yes, thank you. I was a little nervous to join this I'm so nervous. So thank you for making this welcoming and just somewhere that we could talk and have important conversations, because it's very important for everybody to speak during these times. So thank you for this everyone. Thank you so much for coming into our attendees. Thank you for joining us. I! Guess we're signing off and thank you take care. Everyone see well take care.",
        "summary": "What can change look like for young people who are directly affected by policies implemented now and in the future and who better to ask than our very own New York City teens today for power to the youth, we've brought together three young leaders who will be in direct connection with our lead public officials, and you could go ahead and pour that over.\nWe have deputy borough president Matthew Washington of the Manhattan borough, president Gale, a brewer first deputy public advocate Nicki Smith of the office of public advocate Jumaane Williams, and then we have also New York City Council member Carl, inna Rivera of district 2 and with all of those introductions with that I cede the floor to our young people, and if you could go ahead and show on your camera Paula, would you like to take the mic?\nWe have a chance to Center the voices of young people who are really the leaders of today by tomorrow, with during all of us ourselves, a big favor and in fact, that Ashley is a great segue into your question, which is why am I in this stuff as I get into policy and politics and organizing for me, One was I was a witness to the Rodney King uprising in Los Angeles and my family was actually directly impacted by the uprising at that time.\nWho look like me then fast forward in terms of how I, really, if I'd, that I would be doing this work as a career was in 2000 as a result of the presidential election again bush-gore Remember again talking about black people and systemic inequities.\nThink, like you, all, are doing here, speak to the elected officials and actually getting involved in city government there.\nAnd then you know, put forward a bill to ban the chokehold nationally to make sure that I'm funding programs and services that not only I needed as a young person, but that I know that are important to just basic survival.\nBut, when you look at what we're funding, how we're making things happen, how we're providing services to people I mean my office has hundreds and hundreds of cases.\nBut as long as you have the people behind, you can really do anything awesome and Those of us who are working government and all so much thanks to Sidney and Richie in New, York, Public Library, and also to Lucan Community Board, five.\nHow I love that you're promoting reading on your shirt, which is awesome because we definitely need to read It's so important and critical, And You know when I think about how I got into public service.\nWhen I think about the need for food for people in an economically disadvantaged areas, we have to make sure that we're providing food, and so our office in Manhattan borough, president's office.\nWhat they need is critical and then, when we think about the protection that you talks, about, pinnacle is making sure communities are healthy and alive and thriving, and you know if we are building more cohesion amongst ourselves between us and our neighbors.\nI. Think is really fantastic in the sense that you are yourselves organizing and pushing change, and we try to as an office make sure that we are having similar types of events, but ensuring that we're listening as people who are in government, because there is no real division between you.\nThis form I think it is great to help those in power really hear from understand the things that you are pushing for some grateful for this space, pink I'll, just say: I'm, the you know in the City Council on the chair of the Committee on hospitals and a lot of my work has focused on addressing systemic barriers to healthcare, and that includes mental health as well, and Co would really Illustrated the inequity in our health care.\nI. Don't really have a lot of questions in regards to policy, but a lot about education, And I just feel like k12 is not getting the proper education, especially black and brown teams, and we really ask ourselves why teens of color drop out of school, But when we see what we're learning at school and has nothing to do with our history, it has nothing to do with where we come.\nDo you think we should make in the education system to make sure that all groups are represented and all groups are all forms and traces of history are talked about and understood not just by black and brown kids, but also privileged white kids as well Answers about that niya you and hawa just recently, graduated as well in white and persevering, and congratulations and persevering in our remote learning, environments.\nWell, can somebody tell me how trigonometry is helping me get a job that I can help take care of my family with And, so I think we need to infuse more career, pathway, ideology into schools and help young people.\nThe fact that we have to continuously repeat over and over our life matters, because other people look at us and feel automatic threat or feel like we just automatically don't matter in society that you know Just, because the way that my skin color looks and not what's in my brain and my potential and how I want to strive to be important, strive to move Society.\nWithin the councilmember mentioned the Copa 19, just disparity and I, think you know we move policy by building quote critical mass or just you know a moment where folks are basically fed up and moving our government officials to finally change things.\nWith issues that we're seeing you know on our block and in our neighborhoods So, you can even apply to become a member, and actually you can just obtain these meetings and they talk about issues of housing and policing and education and they also push themselves as board members, elected officials and others with solutions that you pitch And, then you know more longer-term, consider running for office.\nInterns in my office, young people and I post questions to them constantly just to get different perspectives of people that you know are in high school that are going to college in college.\nI recently asked my interns, you know what does it mean to you when we talk about defunding the NYPD abolishing the NYPD just to hear directly from the people that are out there from the people that are really have been served with a lot of the mistakes that we have made as a society and that they're going to have to live with and try to grapple with police brutality with climate change, with everything else, So is just trying to bring as many of y'all around the table and the way you can do.\nAs a matter of you, know, like housing policy alone, it's making sure that we can afford homes that are kind of more spread out in different areas that we have opportunities to live in areas that are not dance terminal to our health.\nI know when I'm on the trip I get the best education, because I'm able to look at different things That's exactly that's exactly right in terms of hearing from students themselves, so I had a bill that passed in the council to create these diversity working groups, but what's different about this, then in previous kinds of cohorts or task, forces.\nI mean what you all want to do is kind of like an everyday no-brainer and in some school districts, because they have the resources they can go on trips, all the time, because they're PTAs It's a lot of money for a family.\nWe just need to make sure, as Nick mentioned, that there's equity and how these resources are being distributed to our school systems and we're not listening to the young people.\nI mean you know the school leadership teams, the community education, councils.\nLooking at some of these formulas that deal in finances that are just not coming down to the black and brown low-income immigrant communities that we need them to also want to encourage on education.\nYou know certainly challenge the council number two to continue to fight for young people to continue to for underrepresented, communities, Thank."
    }
}