{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCxsk7hqE_CwZWGEJEkGanbA",
            "title": "September 2020 CB8M Health Committee  Meeting",
            "publishDate": "2020-09-22",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 124,
                "um": 384
            },
            "wordCountFullTranscript": {
                "patients": 88,
                "health": 76,
                "care": 72,
                "people": 51,
                "hospital": 35,
                "hospitals": 33,
                "women": 32,
                "time": 32,
                "vaccine": 31,
                "things": 29
            },
            "wordCountSummary": {
                "health": 18,
                "care": 18,
                "patients": 18,
                "women": 12,
                "people": 7,
                "hospital": 7,
                "postpartum": 7,
                "patient": 6,
                "community": 5,
                "hospitals": 5
            },
            "fullTranscript": "Barbara you can unmute whenever you want, I'm muted hi, everybody hi everyone just going to start. My video are more people signing in oh, yes, there are okay, we'll wait a few minutes and you have one of the doctors who's going to be speaking. Dr davis hi max. I'm rebecca welcome to the team. We're really looking forward to getting to know you. Oh it's max. How are you matt there we go hi. Thank you very much max. Were you the one that helped us with the parks committee? Didn't you for open space at one point, or is it a different max? When was that a couple of years ago? No, it wasn't you, okay and for all those tuning in max is our new assistant district manager and we're really happy to have him. Thank you. More people are signing in will yeah still coming and who is he is dr, is dr davis here, yes, yeah I'm here, can you hear me? Yes, I can oh good. Thank you and dr mcdougall. Is she here not yet okay, she will be. Did you get the slides, rebecca and barbara? Yes, and will you got it also slides are great I did and if you would like to share your screen, you can, but otherwise I can put it up. Oh yeah, you can put it up I'll, just say next slide, please we'll give it another five minutes, or so it's just 6 30 now an elite is not on yet is she just joined and our anna garcia is great wow and is dr mcdougall coming soon. Do you know is that unmuted will no she's not, but she is now she can anna. Oh, you just muted yourself back. Try that again hi! Yes, you see dr davis or dr mcdougall or dr riley. Is that what you were saying doctor mcdougall yeah perfect? So let's give it another. Three are more people signing in at this point, will let me check? Thank you, yeah, there's a few folks who have signed in recently that have not popped up yet, okay. I do not see anybody else signing in right now. So if you guys are ready I'll get started, then so welcome everybody to community board aids. We are the health senior social services committee. I'm barbara rutter and my co-chair is rebecca danagor and leita camp is the chair of our community. Thank you for being so helpful and supportive. As always, we are living through very unprecedented times. This pandemic has brought to the forefront the many dangers that we all of us are facing, but we've also realized that how this virus has affected the disadvantage, especially hard, and we all are aware, especially those of us that stayed in the city how interrelated and interdependent we all are. How can we forget how dependent we were on those that came to help us help feed us to deliver our goods and to make our city a more work, livable and workable city? Our committee is the health committee and therefore we want to address equity in our health care system. Equitable health care for all is not only a moral issue, but I think we all realize that our neighbors health means our health also. We are committed, as a committee, to address some of these issues. We're presenting this is the first of three different meetings that will we will present to address what is wrong with our health care system. How is the health care changing, because what we have learned and what do we still need to do? We are so pleased and honored to have two outstanding doctors, one from the public hospital and one from our private hospital to help us address some of these issues. Our first presenter is dr nicola davis, who is vice president and chief population, health officer for the new york city, health and hospitals. H is the largest public care hospital in the united states and please, dr davis, you will tell us what a chief population officer actually is. Dr asha mcdougall is the director of women's health practice and community health at new york presbyterian hospital, where she is committed to provide the best care for all of her patients, and she is. She is now with anna garcia, we're so pleased to have anna, who is the director of government and community affairs? Is that right? Anna, I think that's correct. Am I right in that and if she wants to say a few words, maybe at one point she will be able to do so, but before we begin, will breitball who's our district manager and who manages to magically put these zoom meetings together seamlessly. He will give us some of the rules and please we will hold our questions until both presenters. Thank you, hi everyone yeah! Thank you barbara. Thank you rebecca. I will be very brief just if it is your first time at one of our community board 8 zoom meetings. We do have everybody muted, so that you don't accidentally interrupt any of the presenters today. The way that you'll engage the presenters and engage the co-chairs whenever they call on you or whenever the time comes up, is that you'll use the participants button at the bottom of your screen to find the raise hand button so you'll open up the participants box. So, if you're looking at the bottom of your screen, it looks like two little people standing next to each other with right now the number 28 next to it. That number will change over the course of the meeting, but once you click on that button, a box will open up on your screen and you'll see in that box a raise hand button. The co-chairs will see your name go up on the participants list and they'll be able to call on you in order that you raise your hand, they may ask for you to be unmuted and we may need you to unmute yourself at the bottom of your screen. Whenever that time comes up, you'll see a little prompt that pops up on your screen. So if you're called on by the co-chairs, look for that too, as it'll speed up the course of the meeting. If you have any questions about the way zoom works and about the way the meeting is run, you can always chat me in the chat box. Will breitball otherwise I'll hand it back over to our co-chairs and look forward to the great meeting dr davis? Great? Can you hear me yeah? Thank you perfect. Will you be sharing the slides? Yes, let me go ahead and get them up if you're ready, yep, I'm real. Sad. All right great, thank you. So thank you very much for this invitation tonight. I'm really excited to talk to all of you and I'll just share a few slides that'll just go through how Covid-19 has highlighted healthcare inequity and hopefully, we'll be able to have a rich discussion following both mine and my co-presenters presentations this evening. Next slide, please phone so I'll just start just to level set. So we all know what we're talking about when we talk about health equity, the health equity is really very simply put it's when everyone has the opportunity to be as healthy as possible, the opposite, healthcare inequity and really the avoidable differences that are unjust or unfair, and it's a situation where everyone does not have the opportunity to be as healthy as possible. Next slide, please, I think, what's really important to understand is the difference between equality versus equity and when we're thinking about equality speaks to the same everyone having the same thing and as you can see from the top half of this panel, everyone indeed has the same exact bicycle. So, theoretically, they should be able to get from point a to point b because you've, given them the same tool. However, we realize that it's not really the right fit for many of the participants here right. So the first person is too short. Their feet can't reach the pedals, so they're not going to be able to get from point a to point b, the second person. Well, they are, they have the right side bicycle, so they should be able to get to where they're going the third person you can see they're too tall. So when they're on the bicycle, they may be able to get from point a to point b, but you can imagine that might be a slower journey than the person in front of them and the fourth person is in a wheelchair. So the bicycle is of absolutely no utility for her, so they all have the same equal tool, but they they're starting from different levels of opportunity and they're not able to use the same tool. Now when you see equity, what will happen is to get from point a to point b. They will have the right tool that fits them, so the smaller person has a shorter bike, has a smaller bicycle. The person that's in a wheelchair has a hand cycle, and so now they have the same opportunity to get from point a to point b. So I just say this so that we can understand the difference when we're talking about equality as opposed to equity. Next slide, please, and in this slide we're really we're emphasizing the same thing, which is the difference between equality and equity, and so you can see that to be able to look over the fence. You know in the second panel you need some. The shortest person needs more blocks, but the reality of it is that there's some people that have many blocks and they are have a significant amount of advantage. While there are others that are really disadvantaged, and so we have the differences that we can see between equality equity, but then we have the reality of what we're seeing on daily next slide. Please so to drive this home a bit more. As a physician, I'm going to give you an example of a patient, and this is just going to give you an example of how we see healthcare inequity and this isn't a real patient. That's not a real story, but it's very similar to what we see, and so you can think of it. For me, as a culmination of many different people that I see so miss j is a 42 year old woman who lives in the Bronx she's had diabetes for five years she's. She has a primary care doctor that she sees regularly, but she has had difficulty controlling her diabetes, she's, a single mom with two children, ages, 11 and 8, and she works part-time as a cashier at a c-town and part-time as a home health attendant. Sometimes she has to leave her children alone with her child with her neighbors who check in on her children next slide. Please so next slide, please well great. So what happens to miss j during Covid-19 19.? Well, first of all, she lives in the borough with the highest rate of Covid-19 19.. So you can see that when you look at the number of cases- and this is data from the department of health- the Bronx has the highest rates of Covid-19 19 as compared to the other borrowers. Miss jay also is an essential worker. Remember she works at the sea town, and so she works at a supermarket and she's, also a home attendant, so she's and so she's unable to work from home. She is likely using public transportation. She has diabetes, so she's at high risk for getting Covid-19, and she is at high risk for having bad outcomes if she gets Covid-19. Her children are also at home. So what happens when she has to go to work? Is she able to go to work if she has a 11 and 8 year old that are at home and what happens to her children now that they're also in a remote learning environment who's there to support them? So you can see where there are many instances of health and health care inequity for miss jay next slide, please! So why are we seeing some of these racial and ethnic inequities with copenhagen? Many of our patients, they have higher exposure, they're essential workers; they may live in crowded conditions or multi-generational households. They have less ability to telecommute. They may have higher rates of underlying health problems like diabetes, hypertension and obesity. These all increase the risk of cova at 19., and they also have structural and environmental factors such as access to care, discrimination and racism. Next slide, please. There are also inequities or, and disparities that you can see in addition to by race or ethnicity. You can also see inequities as opposed related to income or gender. You might also see it related to where people live versus a rural environment versus an urban environment. You can see inequities related to sexual orientation as well as disability. Next slide, please now I'm going to just talk a little bit about how our public health system addresses health and equity next slide. Please. So at new york, city, health and hospitals, we are committed to equity and we, as you know, we are in the world's most diverse city. The mission of our hospital system is to provide quality care with dignity and compassion, regardless of race, ethnicity, gender, national origin, religion, sexual identity and orientation, or ability to pay next slide. Please. So we are the largest public health care system in the united states and we provide care to over a million new yorkers each year, and that is with that's done in our 11 hospitals. We also have over 70 community centers. We have long one long-term, acute care, hospital and five skilled nursing facilities. We employ over 40 000 employees, and we also have the correctional health service next slide. Please, when we look at the demographics of the patients that we take care of more than four in ten of our patients were born outside of the united states and when we look at the the sources of our foreign-born patients they're coming from the dr from mexico, lots of the caribbean also from bangladesh and from colombia and china, we use interpretation services very often at health and hospitals. Over 13 million minutes of interpretation is done in 200 languages in the last year, and I can definitely say that there are days when I would see patients and I would be going from interpreter from language to language just because of the diversity of our population, and so that's pretty incredible to be able to take care of such diverse patients next slide, please, and one of the things that we really work hard to do, is to address the social determinants of health, and this is part of what we do in our office of population health. This is one of our teams that we focus on, and so what are the social determinants of health? Well, these are the conditions in which people are born, grow, work, live and age, and the wider set of forces and systems shaping the conditions of their daily life. These forces and systems include economic policies and systems, developmental agendas, social norms, social policies and political systems. Next slide, please, and when we think about what these social determinants are, we know that there are upstream factors that are driving both health and inequity, and these are the social determinants. So if you look at the left half of this slide, what you'll see is that we have social inequities. We have institutional inequities, these lead to various living conditions, and these will lead to the risk. The different risk behaviors that patients may encounter eventually might lead to disease and injury and mortality now downstream far on the right. This is where health systems primarily work. However, what we can do in this space is limited and to really have an impact. We need to get more upstream, and this is what we try to do when we take care of our patients, and so they asked me to talk about what a chief pop health officer does- and this is part of what we do is think about the entire patient, the entire population of patients that we take care of, and how do we get high enough upstream so that we can really have impact in our on our outcomes? So we recognize that helping our patients get and stay healthy requires a lot more than just the healthcare aspect of things and one of the things that our team does. Is we really try to prioritize the social needs of our patients and we try to prioritize it at the same level that we prioritize their physical health as well as their behavioral health needs. Next slide, please, and just to give you a couple of examples as to how we do this. So one of the things that we do is proactive screening of our patients for social needs and once we've identified needs, we really try to meet these needs, and many of these needs are their legal needs, food, housing and income, specifically during Covid-19. Some of the things that we did were to have active outreach to patients that were discharged from the hospital with a diagnosis of Covid-19, and we outreach to them to assess their social needs. By being proactive and outreaching to these patients, we were able to reach about 6 500 patients, who had who were died, discharged with a diagnosis of covit. Of those we were able to identify food needs food insecurity in about 25 percent of them and to get them that food assistance we were also able to part to in through grant funding and, through some partnerships, be able to provide cash assistance to some of our patients, who really had extreme economic hardship, and we were able to provide a thousand dollars to some of our patients who had such hardship next slide. Please, for some of our patients with chronic diseases, we really had to work to try to provide them the best care possible in these challenging circumstances. So we did a lot of pivoting from in clinic visits to televisions. We did a lot of proactive outreach to our patients to identify their needs as well. We purchased and distributed blood pressure monitors so that our uninsured patients with hypertension were able to monitor their blood pressure at home, and we really worked at trying to expand some services, such as peer support via telephone, to help our patients manage their diabetes more effectively. Next slide, please! So, as we know, during the midst of the Covid-19 pandemic, we fur we experienced a lot of unrest and protests as a result of the killings of george floyd brianna taylor and richard brooks. This all happened at the same time and it really helped to emphasize the dual pandemics that we were seeing in America. Not only were we seeing the pandemic, that was due to Covid-19 and recognizing the disparity that was happening in terms of outcomes amongst black and brown patients, but we're also seeing that pandemic of police violence and worse outcomes that were happening, particularly among black men. Next slide, please, and at new york, city, health and hospitals. We recognize that it was really the slide before that. Sorry, one more after oh okay. Well, maybe we missed one, but at new york, city, health and hospitals. We really recognize the importance of standing with our community in terms of really speaking out and standing in solidarity, along with our patients, who were out protesting many of them, but really recognizing that this was a time for us to stand firm and in solidarity with all of what was happening and to speak out against these health inequities that we were that we were witnessing and how we do this. You know we we've really established our health, our equity and access council is one thing that we established after this was all happening and really taking us taking the time to listen to our staff and to think about how we move forward at this time. Honoring all of what has happened, but really thinking about how we move forward, to help our patients to have the best outcomes possible. One of the things that we do. We really aim to provide culturally responsive care, independent of where our patients are coming from really providing that care that respect and response to their health beliefs, their values, their behaviors and the languages of our diverse patient population. At the end of the day, it really is treating patients how we would like to be treated ourselves, showing that respect listening to them, honoring, where they are, and really doing our best to recognize all of the challenges that they may be having and taking the best care of them that we can in the space that they are and with the challenges that they may personally be experiencing, and I think I'll end there and save time for questions later. Thank you. Thank you very much, thank you and then dr mcdougall hi good evening again. I believe we had a little technical difficulty, so I'm going to speak exceptionally, but first I just wanted to acknowledge that actually, the chair of our department, dr laura riley, has been able to jump on in her busy schedule juggling a number of different things. So I just wanted to if she wanted to just have a chance to say hello and we'll talk more about cohen hospital, as well as the women's health clinic and the hemsley tower 5, to describe some of the community engagement that we participate in the services that we provide. Dr valley, would you like to say a few things? Well, were you on moot and muter? I don't see dr riley. What does their name appear? As I see her picture? Is there? Can she wave at me or raise her hand to the? Could it be the zero one? Nine. I think I think I found her lar. Oh no, sorry, okay, I'm unmuted! Now, okay, awesome, hi good evening, everybody, I'm so sorry to be hopping in late and then someone just called me at the same time. This is the problem with zoom. You can do multiple. So thank you for joining. I am the chair at weill, cornell, medicine, department of ob gyn, and I actually have been here for about 18 months, and one of the main goals I had when I came here was to start to and do a much better job with maternal mortality recognizing the horrible, racial and ethnic disparities in maternal mortality that exist in new york and actually across the world. But you know the u.s particularly, and so it's been great to work with many partners in new york city and I'm actually on the maternal mortality review committee, which has been an eye opener for me, because I'm actually a bostonian so sort of this whole new york thing and how big you guys are and how complex it is and has been a learning experience. And I know that there's lots more to do. But it's been very helpful in sort of setting the goals that I have from my own department, one of which was to make sure that, at the very least for our patients in the women's health clinic that we have a leader who is dedicated to community health as opposed to someone who's. Just there feeling stuck- and that was one of the very first changes I needed to make, because I think, as many of you will recognize your ability to make meaningful change. I think for both staff, as well as for patients, really has a lot to do with who the leader is and how much you know, dedication and investment that they have so I'll turn it over. To aja, I'm actually also a high-risk obstetrician, and so this is yet another reason that I am completely dedicated to making sure that we make a change in terms of maternal mortality. Thank you. Well. Is she muted? Yes, but she cannot mute. Okay, I'm sorry! I wasn't letting me on me for there for a moment there. Thank you, dr riley and dr david, so nice to meet you as well virtually and hear about all the great things with health and hospitals. I am a native new yorker, just so just a little bit about myself, I'm a native of the outer boroughs, I'm from Queens, born and raised a product of new york city, public school education and am so proud to have returned after living out of state for quite a bit and moving back to new york, but in long island, suffolk, county, a very different feel and really coming back home to you know, participate here in will cornell as a member of community health. So you know again with dr riley and dr davis kind of being aligned with the same goals of advocating for patients who have been underserved and having be being able to really take advantage of a private institution, a institution that is well-known and has many accreditations just this year. So and now with another live goal towards health care. Equity, I think, is a perfect opportunity for us to reach out to various communities, especially one that's home, to our institution, to tell you about what opportunities we have for you to be involved and what services we provide for our patients. So I think our my slides did not get through, so I'm going to be just speaking a bit extemporaneously so bear with me a bit. The clinic where I currently am working is called the hemsley tower. Five. We endearingly refer to it as the ht5 clinic on the cornell campus, and we have a number of services that we provide. Our providers are a mixture of medical doctors. We have training resident physicians as well as medical student education, so this is really where the ob gyn practice, where our residents learn. Ob gyn and where they get all of their experience, for both the outpatient and learn about both how to care for pregnant women, how to care for women, gyn surgical needs, and we, you know, take care of patients from pediatrics to geriatrics. So we have a full gamut of care that we provide. We have nurse practitioners registered nurses, social workers as well, and we also work very closely with our in-house emergency care services as well. One of the great things about this facility is that we recently had the designation of the new york state patient-centered medical home. We renewed that designation for another three years and originally got it in 2014. What does that mean is that we have three aims: better health, lower health cost and better patient experience, and we know that this year, especially in the leadership with dr reilly, that patient experience has been one of our main aims to make sure that there is an equal experience while we're giving equitable health care in order to get this designation, a facility must achieve 40 core criteria which are governed by the new york state again and in addition, we are article 28 space. So what this means- and what this means to us is that we can provide government insured patients with who are covered by both medicaid and medicare services in our facility. Our patients come from all five boroughs, including new jer, new jersey and westchester, and about 80 percent of our patients are from outside of the upper east side, so they've traveled from far sometimes an hour and a half or more to receive the care that we can provide before will cornell and new york presbyterian. So that's something to take into consideration when we are thinking about health care equity is that patients are coming to our. You know. The upper east side from outside because of the idea that they will be getting care that they perceive is high level the care that and living up to the expectation we provide government insured patients, charity care, uninsured and self-pay patients on a pay scale basis. We have a number of different services from high risk obstetrics to reproductive endocrinology urogynecology, as well as general ob gyn. We also work very closely with our adolescent and pediatric teams to provide teen pregnancy care and we also have family planning services for both contraception and abortion care as needed. So those are all the services that we provide, and one of the things that the pandemic, for example required us to do is to extend our services through telemedicine. So with now, we introduce a telemedicine arm of our practice almost immediately in March and went from zero telemedicine visits to over two thousand, and these are visits that are through that are provided by all providers, including our nurses, for education, lactation, services, antepartum and postpartum care. So another service that we provide you know in regard to maternal mortality and morbidity is a two-week telemedicine visit for all patients who are delivered out of the new york presbyterian cornell campus hospital, regardless, you know if they are either privately or in our in our clinic a two-week postpartum visit by a provider either a nurse a nurse practitioner or one of our physicians will contact them and discuss a number of different things, including postpartum depression, lactation, support and continued care in that postpartum period, which is very important in meeting our aims for increasing our health care outcomes for patients who are pregnant and immediately postpartum. So that's a general overview, and then one thing I actually wanted to mention is the new alexandra cohen hospital- and you know dr raleigh knows about this very well, but I know that there was mention on one of our previous calls that you know. I don't think they were that everyone was aware that there is a new hospital that just opened up in august. So, even in the rush of everything that has happened this year, it was very successfully opened in the david cole building between 68th and new york and in a in and as far as health care equity. All patients are seen there who deliver at new york presbyterian, whether they're in our clinic or the faculty practice, and regardless, if you can pay or not, you will get a single room where you can have privacy with your loved ones, immediately postpartum. So that's one thing that you know. I know that is important to patients, especially after they delivered. So again, you know we do provide a number of different services. I do see some information also here in the chat about the women, the hemsley tower that was provided. Thank you will for that and if there's any other questions be happy to answer them, am I unmuted? Can I start off asking a question: how do your two hospitals work together? Does health and hospitals have a obstetrics center? Also, do you see the same patients? Are you in competition with each other? How do you work together? I don't know if you both want to address it. Am I a muted yeah? We heard you, I can't hear dr davis yeah. I have to unmute myself yeah. No, I mean we're different hospital systems. I think we have different patients that come to us. We take care of patients, our primary patients are medicaid and some of them are uninsured as well, but that's the vast majority of our patients and all of our patients, all of our hospitals do have obstetrical services. We have 11 acute hospitals, there's obstetrical services that are available at each of them as well. So I wouldn't say that we're in competition. I would say that we're different hospital systems right. I would agree with that. You know a lot of health care in new york city from you know. My personal experience is about your geographical location and you know health and hospitals a huge system as well as your presbyterian. So you know, competition is one thing, but I think really, the focus is on how you relate and con with your community, whatever type of relationship you have with the members of your community, and you know how we can all work together to meet the needs of those who don't have direct contact with you know certain hospitals or certain services, because there are certain hospitals that may have various levels of care that they can provide to different patients. I think that, in terms of hospitals working together, I think actually new york, certainly new york city, actually new york state- that's unfair. New york state has done a better job than many other states in the in the u.s. The safe motherhood initiative brings together all obstetrical units in new york city in new york state to work on several different initiatives to ultimately decrease maternal mortality. I think that the- and there has been some progress in terms of you know decreasing the disparity. I think what is what is difficult and what is going to be the heaviest list, lift for all of the obstetrical services and probably for all aspects of medicine is, as you were talking earlier about the social determinants. I think we're really good and getting better at taking care of women and making things safe, while they're in front of us right so, while they're on labor and delivery, while they're in the immediate postpartum stay. But if you look at the maternal deaths that have occurred in new york city, many of those deaths occur postpartum, so they're no longer right in front of us, so they've survived the delivery that wasn't the high risk point, but they then easily get dropped off between week. You know one week after their delivery until up until a year after their delivery, and so I think that really the challenge for obstetrics, as I see it anyway, is that we will need to partner better and some of us partner for the first time with the community, so that there can be those bridges and so that, as was discussed earlier, we can start way earlier, because when we start to sort of try and change people's health during pregnancy, we have missed the first 30 years of their lives. That has already impacted. You know, what's going to happen during that pregnancy and then you know for all sorts of reasons, they're with us for a short period of time, and even if we do a good job with that, we haven't incorporated the rest of their lives, and then they go back to that life right. So I think that the challenge for, as I see it, the challenge for people taking care of women is really going to be. How do we work together to take care of women long before the pregnancy and then definitely long after the pregnancy? And you know, all of the data shows right now that certainly you know I'll just give one like little example: pregnant women that get pre-eclampsia or toxemia of pregnancy, which is a pregnancy-only disease of high blood pressure and swelling and can affect your kidney and your liver, but just those women who have preeclampsia during pregnancy depending on the study, some something like five to have a five to twelve times higher risk of cardiovascular disease as early as ten years after having their baby so their you know, pregnancy, actually is probably this horrible cardiovascular stress test that you know women who are already not in good shape, then don't do well during pregnancy and then they don't get the necessary care to. You know impact the rest of their lives. So I think that that's really, you know that's going to be the challenge going forward. I think we've spent a lot of time looking at the statistics, lots of time documenting the problems, but not enough time coming up with the solution. So that's where we are now great thanks. Can I see trisha a board? Member has a question hi everybody. Thank you. So much barbara and rebecca for putting this together. Just I I'm so amazed by the speakers, and thank you thank you all for being here. So I'm really sorry and that's my son right next to me. I'm really grateful that you're talking about this. It's something that obviously I as a young mother just went through myself and something that is really bothering me, and I I just I guess I'm I have so many questions, but one in particular is I completely agree with the doctor who just said that we need to be focusing on the on the months leading up to and even before, pregnancy and then afterwards, but if you could talk a little bit more about how we're actually expanding care for these for these women after in the 12 weeks after they deliver. I know that there was some talk about additional nurse visits, but I think that there I just think that there should be so much more to that. It's incredibly stressful, it's incredible as a new, first-time parent I can attest to how just shocking it is to try to be recovering from major surgery, and I did have preeclampsia and stayed about 17 days in the hospital due to my high blood pressure after and drink and after delivery. So it's it! I just really do think very firmly that we need to be doing more to expand care after in postpartum. I also was wondering about if you can all speak to the implicit bias training that you that I hope is happening at your institutions and who is required to take that training. How often and if it also is inclusive of people like who work at the front desk or people who like how what kind of level of staff right now is required to take that implicit bias training. I just think in general patients come into contact with so many people in the hospital that I personally don't like the idea of requiring this kind of bias, training only for nurses and doctors when I think that, like everybody, should recognize that there are biases ingrained in our health care system. So I apologize it's probably two or three questions in there, so I can answer the last one: the bias training and we required- or I should say I because actually it was me- I required bias training of all the providers, as you said, but all of the front desk staff, all of the nurses in the outpatient space, all the medical assistants. Essentially, I sort of took a page from what you just said and decided that everyone who was going to come into contact with a pregnant woman needed to do this training, and we did- and I think many people learned lots of things, but I think that you know I'm not naive enough to think that one bias, training or even one series of bias training is gonna change. Much of anything, so I can tell you that 90 of the staff and physicians, everybody, I call everybody, the staff did the training and we are doing a the kind of training that we did. It was really quite very interesting. We have broken down into five different groups where we're trying to do smaller series of workshops to look at other aspects of bias and how it you know reflects on patients, but also how it sort of can interfere with staff and how it interferes with our ability or inability to make a more diverse staff. So we're continuing that original training. In fact, yesterday we in our faculty-wide qa, which is you know, usually people- think of quality assurance where you go over cases that you know you didn't, have a good outcome and you want to review them and see how you can do things differently and not make the same mistakes that you know potentially made them pass. And actually one of the cases that I presented was a woman who had an experience, an african-american woman who had an experience recently in the hospital where she felt disrespected and where she also felt like she wasn't being heard, and I saw the patient and had a personal conversation with her. Actually a couple- and I felt like it was an important case to present to the faculty and the nurses and the pas and the residents etc, because I think that until people recognize that this really has an adverse impact on care, they won't really change their behavior, and so I think that we're gonna have to just you know, present these over and over and over again, and I and I really respect what you said you know. How often are you doing the training? I think it's you can do the training, but I think how often do you review the cases and the instances and bring it to people's attention? I think it's a whole different answer and that's kind of the approach that I'm gonna take we'll see. I don't know how successful I'll be, but I think that there were a lot of people who were you know several people who did the training, who were still shocked at the experience the patient had, and I was like. Why was it? Why is this not shocking? It happens every day, but I think these are the things that we have to just bring to people's attention and I think also you know, sort of making sure that patients feel empowered enough to actually make the complaint. I really appreciated that the patient made the complaint. It's helpful, we'll do better next time dr davis want to respond. Also, I don't mean to project yeah sure, so. We've also rolled out implicit bias, training and you know similar to what you're saying dr riley one training. Doesn't you know, do it and it's continuous, so we we've rolled it out and it goes out to all staff and now we're trying to figure out how to do different types of training. That are, you know, more smaller type of group sessions and feedback and in different ways right now, we're also going through what we're we're. Also doing, I guess kind of like a listening tour to some extent where we're just having what's called employee voice sessions, where we're really just listening to our employees and trying to understand- and these are in safe spaces, where our employees are able to speak anonymously over the phone, their facilitated sessions, because it's really been such a challenging environment. For all of us. Our employees come from the communities that that you know our patients live in, and you know we all they. We all live in the same community, and so just having these open conversations with what everything that has been happening and you know being able to talk about bias in the workplace itself and being able to feel safe to have. Those conversations has been really important, and so we've just been working on creating the space for those types of conversations to happen and for people to be forthcoming at what they might be experiencing. You know, but I think it always goes back to treating your patients treating our patients with a degree of cultural humility and just kind of understanding, our patients and being in you know, being in their shoes as much as we can, so that we can really help them to. You know help them to really achieve what they need to achieve in terms of having good health outcomes, and that's often challenging to do, but that's what we all really strive to do and the more that we can remember that. I think that's what makes us you know better advocates and doctors and nurses. We had a one of my teams, the hiv team. We hosted a sigma summit last year and I consider myself a you know, a doc that really tries to be empathetic and understand. You know my patient's perspective and you know the stigma summit was pretty unique because it was really put on by our patients like they were. They organized it. They had some guidance from us, but it really came from them and it was really interesting to sit and listen in that space just to hear from them. As to different situations where they felt stigmatized on her, you know just not listen to and and just terminologies that were used to you know to describe. You know that they may have heard describing them. So you know a term like a substance abuser and just you know how negative that term is and what that means every time they hear it as opposed to someone who uses substances and so really just being able to create those types of environments where we can really hear from our patients and have patients, and you know, healthcare workers in that same room. I think it was really one of those situations where, as a doc, I completely felt I was not empowered to speak at all in that space, because I did not want to say the wrong thing and offend in my just ignorance of not understanding what certain terms meant when a patient heard it, and so I think that you know creating those types of environments and dialogues is really important and something that I hope that we're going to be able to continue to do. Thank you have elita up next with her hand up. Thank you. This is really excellent and so informative. Thank you so much doctors for being here. If this was addressed earlier, please accept my apologies. I've had to run in and out of this program, but I was wondering about the mental health component of healthcare, especially with pre-pregnant pregnant and postpartum women. I have two children when my second one was born. It was a lot more difficult just in terms of sleeping of entertaining the little one and the little one and- and I think mental health issues may have some still have stigma attached to them, and the stigma may vary in different populations. So again, if you've already addressed this, I'm wondering and then how do you I apologize, but I'm just wondering if it is something I think it is because you said social work, but how you address the various needs of patients and and how you make that health care available and and work with, to avoid or minimize the kinds of stigma that still may be attached. Thank you. I know thanks audrey and so one thing that we it's kind of interesting. I felt like we were kind of slow to it, but we definitely started to consistently do the edinboro edinburgh depression scale, which has been recommended for the last. I don't know two to three years, at least by the american college of obstetricians and gynecologists, that you actually give that scale at some point during pregnancy and then give it certainly six weeks postpartum as and that really is just the tip of the iceberg is so that you can. You know, sort of standardly get this same information from every patient, and since I got here, I just couldn't get people to do it in a standardized way, but we finally got it up and running right before Covid-19, and you know, I think, as dr davis said, you know, and certainly the mental health system that really doesn't exist was really, if you think about it. You know it was a situation where and we still are debating, you know is Covid-19 worse in pregnancy. So you know pregnant women were scared. We thought that it was going to be like influenza, which is really bad in pregnancy. You know no vaccine no medications, and then there were no visitors and you know then we went from you know no visitors to you know what my patients will tell me. In fact, a woman said to me today. She said you know I'm kind of excited to go home but kind of not because she's not going to be surrounded by family when she goes home with this newborn and talk about the stress of that right. So you have all the stress during pregnancy, of all the unknowns about Covid-19 and what the impacts are on your baby. If there are any and thankfully there haven't been, but you have all of that as well as all the other stuff right so am I gonna have a job. Do I have food? Is my husband going to lose his job? You know all those things and then you go home with a screaming newborn and no help. So Covid-19 has really kind of you know, brought it home in terms of you know all the deficiencies, and so what we're setting up at the moment is because it's so difficult to get psychiatric help in the city for all sorts of reasons, probably because there's just not enough of it, but we're hoping to set up a system where there's a layering effect of social workers, psychologists, psychiatrists, community health workers, who can you know, help women at where they are, as opposed to where we think they may be, and because I think many women at least my experience of having practice ob for about 30 years now, many women have elements of postpartum, depression and postpartum anxiety, but not all of the elements and not all of them need drugs. Some of them need help in other areas right. So it's more the situation they're in than it is the hormonal issues going on, and so we need the resources to be able to parse that out and take care of women in whatever space they're in that's. What we're working towards is this layering system just be because thinking that you're going to have enough psychiatrists to take care of the 30 of most pregnant populations that need it not gonna happen, we just don't have those kinds of resources or in people or money or you know whatever. So I think we're gonna have to be much more creative, though, if I could just add insurance treats mental health treatment very differently than physical health. I think- and it probably depends on the kind of insurance and is that something that varies across the patients from h and the patients at a private hospital like new york, presbyterian or wild cornell, and how the city is able to handle those disparities in in not just access, but the ability to actually get treatment. Thank you. Access is a huge issue. I think it is across all of the state to be honest with you, and I think it's layered on it's multi-factorial. It is the insurance issue. It is the lack of providers issue. It's you know, sort of the pockets of the city where you can find what you need and then there's also just knowing what you need like someone recognizing that you need some kind of an intervention. So I think this is an area that I think all of us have a lot. A lot of work will dr davis respond, also yeah sure yeah I mean I would agree with everything that you're saying one of the things that we do we you know we do a lot of mental health care within our primary care settings and what we've done is developed a collaborative model through our, where we have consulting psychiatrists, who then work with our social workers, some of whom come through the mental health service corps, which was the thrive NYC program. But so we have the consulting psychiatrists, who work with the social workers and even some of our nurses, where we have educated on how to do some counseling and depending on how impacted that patient might be in terms of their mental health. Sometimes that's enough that they see a social worker or they might see who we. What we call a collaborative care nerve under supervision by a psychiatrist. This allows the psychiatrist to be able to take care of many more patients, because they will have been like weekly case conferences where they discuss all of the patients. So it allows that one psychiatrist to have a much larger reach in terms of the amount of patients that they can consult on as opposed to the psychiatrist. That's trying to see patients one-on-one, so those are some of the ways that we're trying to expand the reach of our mental health services. We do screen our patients for depression and also anxiety, as well as we're screening our adolescents and we're screaming screening in our women's health clinic. So we do proactively screen our patients for a depression and we're anticipating that the needs are gonna, go go up. Even more covert has traumatized new york city. I don't know if you guys feel traumatic. If you haven't lost someone, you know someone that has lost someone. You know I don't you know. I don't know anyone. That's gonna! That's lived in new york city during this time that has not been impacted by Covid-19 and in some way, and I think for our patients with limited resources, they're impacted even more because they're living in the communities that had extremely high rates, where they saw lots of deaths where they've lost lots of loved ones, and I think we're going to be going through a long period of post-traumatic stress disorder. So I think we have to screen our patients. We have to screen them more aggressively now for mental health. If there's you know just lots of financial issues, you know, like you said, do I still have a job? I don't have a job, we're seeing you know, food insecurity is the rates of food insecurity is so high people who've never depended on any social services are now depending on social services. So I think it's you know it's gonna be a lot for us to manage as healthcare systems and we we work to try to manage it and to expand our resources as much as possible. By doing these layers of care and using our you know, psychiatrists as consultants in some ways, but yeah I mean, I think this is a. This is a need that, unfortunately, I think there's going to be a gap and that gap is probably going to widen because as months come, you know in the coming months. I would expect that there's just going to be lots more mental health needs right. And can you hear me I was thinking before yeah. One thing, you know what both dr riley and davis mention it you know is the multi-layer and really the need to collaborate with a number of different providers, not just physicians, so at the ht5 clinic we'll be starting group prenatal support classes, which is actually a new program that our social workers have initiated because of the results of the devastation from Covid-19. So that is, you know it sort of addresses the shortage of providers, but it provides a ability for access, and we can do that virtually so I think you know, as far as for our patient population, telemedicine has been at least somewhat helpful in bridging that gap for access all right. Thank you. Thank you. I see ellen has a question hi everybody. So this is really interesting. I have a few questions for for both institutions, all three of the doctors in both institutions, so to expand your reach in the the. What do you use midwives in for postpartum and prenatal care and while cornell? Unfortunately, we don't I'm not happy about that, I'm working on it. Actually, we are hiring a midwife in January, so that'll be great. I actually am a huge fan of a doula program. I really I am convinced I don't know. I worked with a great doula program in boston and I'm convinced that it that a doula program could be incredibly helpful for a wider population, and the thing I like about the doula program is that there can be many more of them because they're in the community, as opposed to midwives, which you know that's a few years of training and training up that many that's, not gonna, we're not we're, not gonna get to the numbers. We need quite quickly, but I do think that there's a lot of benefits to a doula program. So that's what I'm working on we do me. We do use midwives at health and hospitals. I don't know if all of our hospitals have them, but we definitely do use midwives there. So you really use whatever you. Whatever groups, you can to other professionals to expand your reach, as you said before. That's great, definitely, okay, all right! So my second question: this is actually a very unfortunate circumstance that happened to a friend of mine. She went for a mammogram and the result of the mammogram was that she needed a biopsy, except that the doctor didn't tell her. She needed a biopsy, so she went another whole year, probably a year a year and a half before she got another mammogram and found out that she had needed a biopsy the time before. So by the time she had this biopsy, her cancer had progressed to the next stage and it was more and she required additional treatments and more extreme treatments. It was very unfortunate she's still going through it. So I would like to know what protocols your hospitals have in place that avoid this from happening. Did you have checklists? Do you have you know? Do you have do people? Do you have other people? Well, let me let you talk. You know for in the in the clinic what we all results are reviewed by our nurses. So we have registered nurses who review all results and abnormals are addressed by the providers with either a phone call a visit, appointment or telemedicine visit. So I think at least we have that one layer of checks and even when we're having supervision for trainees attending physicians are the ones who also receive and check all of those results. You know I'm not. I would remiss be remiss to say that it's a perfect system, but you know by at least having that multi layer of checks. We you know hopefully, can avoid those type of unfortunate things that you know you experience yeah. Similarly, for us, I don't know how it if it's the same procedure at every single hospital, I can speak for the one that I've seen patients in within health and hospitals and that and they're similar structures in place, but it really is having multiple levels so that if there's an abnormal for our hospital, the radiologist would report. Actually, the radiology technician would report that abnormal and would relentlessly contact you until they have had confirmation from a doctor. That said, yes, I have seen and have placed the order for whatever that follow-up test is. You know these are some of the biggest fears in medicine is to kind of miss something and and for something to progress without you know, because someone did not, you know, follow through on a result or you know so I think we try to and we try to put in processes that are not dependent on any one person so that there's some redundancy in these processes to try to prevent these types of things from happening because, anytime, it happens. You know the one time it happens, it's one time too many, and you definitely want to try to prevent that. So we have some redundant processes to prevent that from happening. So you said that the radiologist relentlessly pursues who the radiology technician actually relentlessly pursues the physician to make sure that they've seen the or you know they've seen the abnormal and they've ordered. Whatever follow-up needs to happen. So there's some automatic, you know there's some things that are a little automatic through the through the electronic medical record system, but if they haven't seen the order, then they would, you know, pursue and say, hey doc. How come you didn't write that order? Let's make sure that it's written so that the patient can come back? I see so it's not possible for a physician to just blow it off to say yes, I know about that and then not write the order, so they actually follow up and make sure the physician yes yeah they try to put in systems so that it would trigger. If that patient, you know, didn't get that appointment, that's how they would try to that. That's how we try to do it, at least at the hospital that I was seeing patients at if they were pretty relentless in their pursuits. Okay, and did they follow up to make sure the order was actually got to the patient yeah, because if the patient actually doesn't show up, then you know, then that's a problem. You know so, even if you've written the order and then a patient missed the order. This is, you know often oftentimes, sometimes where the challenge is, they miss the order and then there isn't that follow through so yeah. They try to create the systems or we try to have systems so that, even if the patient missed that appointment, we would say. Oh no, like this, isn't just one of those appointments. We want them to miss right or we can deal with them missing. We want to make sure we get them in, because this could be something serious. Okay, great! Thank you now I have one more thing, one more my pet, please, and this doesn't have to do with ob gyn. It has to do with just general medicine in general that older adults, who very often come in sick and have some sort of delirium are treated as in and I've seen this across the board in many hospitals are treated as if they have dementia and so they're kind of dismissed and then serious illnesses are not necessarily taken. You know taken into consideration because you know if the blood tests all check out and then and they're still acting nuts. You know people are not. The medical staff is not treating them as if they have a real delirium or potentially another serious illness, they're just dismissed as if they have alzheimer's. You know it's just like another demented adult older adult and it just it just infuriates me, so I just want to put that out there I don't know. Is there? I don't know if ob gyn is the place to address it, but I just want to bring it up and I will bring it up continuously. Well, I think what you bring up, though, actually is that, and I think that there's plenty of study that would support this statement is that it is another area of bias right. So you know you make assumptions about people when you walk in the room and people make assumptions about the you know. The patient looks old and they're not acting quite right. The next assumption is well must be dementia. I mean it's a form of bias right without stopping to do the investigation, to ask more questions and to you know, make a better diagnosis. So I think I don't know that it's necessarily gyn, but I think that it is. You know yet another one of the things that we just have to be aware of which happens in medicine all the time. Unfortunately, all right. Thank you thanks. I see next we have betty cooper wallerstein and is it star six done mute or star nine well, star phone star, six betty hit star, 6 and we'll be able to hear you hi. Thank you so much. It's been an excellent discussion. I am a donor as well as a patient to the medical department of new york, presbyterian and wild cornell as well, and I'm interested in knowing about the new cohen hospital in the coke building. You spoke a little bit about it, opening up this past august, how much of the hospital, because there's several divisions there, how much is available for the patients that you discussed? Who would have single room for where you were talking mostly about tyn and people? You know having babies etc, but can you tell me a little bit more about what is available there and is it available for everyone or just for people from that hospital? So the alexandra cohen hospital for women and newborns is the top five floors of the david coke building. The twelfth floor is all of ultrasound obstetric and gyn ultrasound and antepartum testing. The 14th floor is an expanded, labor and delivery. The previous labor and delivery had about 11 rooms, and this is 16 rooms. It also has about 20, triage bays and five operating rooms. So it's quite a huge space. It has the capacity for about 7, 000 deliveries, and currently we do about 5300 deliveries a year. So are these patients only for the for the hospital or do you have take patients from, for example, would someone from a city hospital who might be having some concerns and some difficulties and questions about delivery? Do you also take patients that are not of hospital patients but might be city hospital patient referred? We take any patient who shows up in labor. We don't turn anybody away we, but in general I think most obstetrical services want to take care of the people who have gotten their prenatal care in our institution, whether it's in the ht5 clinic or it's in one of the faculty practices, that's the bulk of our deliveries, so you know, but there are women who you know were getting their care at montefiore or one of the city hospitals and they hear about a shiny new hospital, and so they show up and they deliver. Hopefully they have a really good experience, but that's you know. That is because you know there isn't. I don't believe that there's any hospital that can turn you away when you're in labor that's an intolerable violation that just is cruel and unusual. The hospital is all women and children's, and so it's all labor and delivery, and then there's a neonatal intensive care unit which is really quite expanded. So that's now a 60 bed nicu and then 785 single postpartum beds, so there's no gyn there either gyn is in this original space that it's been in. Thank you very much. I was very interested in all that. You were saying I had another question, though the city hospitals that are, I think, there's only one in the district of cb8, but in Manhattan how many city hospitals are there. Let's see, I think three we have metropolitan harlem and bellevue well metropolitan. I know where is the harlem hospital it's in harlem at about 135th street? I believe in adam clayton powell, somewhere around there and bellevue is downtown Manhattan around 30th street and first afternoon. Thank you so much you're welcome. Next, I see dawn hi. Thank you so much. I really appreciate this webinar and the opportunity to hear all of this great information. I have two questions. Please the first one is I'm aware that, prior to the pandemic, there has been a challenge with poor providers with knowing where to refer, women who are experiencing maternal depression for treatment. So screening is one thing, but then I've spoken with a lot of providers. Who said we don't know where to refer. So I'm just curious how that's gone during the pandemic and has telemedicine made a difference with that at all we heavily utilized telemedicine psychiatric services during covend. We utilized them for the staff that definitely needed it, and we also utilized it for patients and we actually had more psychiatric help during Covid-19 than we had before or after Covid-19. It's like starting to go away. I think part of it was the psychiatrist. You know were easily able to go in to use the telehealth platform, and so they were they really sort of rolled up their sleeves and started helping everyone. So we actually had a very good experience. But again you know now that the immediate part of Covid-19 is winding down. I think that you know we're in the same situation that dr davis mentioned, which is you know. You really do need to layer your resources, because you know there's never going to be enough psychiatrists or psychologists. So we need to you know, take advantage of the fact that there are social workers and nurses who can pers. You know who can help. You know triage patients and primary care, physicians and actually obstetricians as well. You know I there's nothing wrong with me. Picking up the phone as an obstetrician to ask a psychiatrist, do you think I should start ex medication? I mean, I think, it's a matter of being sure we all feel trained and comfortable and have those resources. But again you know psychiatric help in the whole, us is terribly underfunded and under-resourced. Thank you, and I know dr mcdougall has to sign off soon, so I just want to make sure I don't know if you have any closing words or anything you want to say before you have to leave it. No, you know thank you for this opportunity. You know, I think I just started recently actually with cornell nyp in January and immediately after that it was called. So I haven't really had an opportunity to you know: do the community outreach and meet some of the members of the upper east side? So it's you know it's great to have this opportunity to speak happy to join in future events that you may have please reach out to a number of people. I know anna garcia is also here who may be able to provide more information. Thank you will for providing the information about hensley tower, but please, if you have any other questions or you'd like to reach out to a community, an underserved population, that's right in your neighborhood, where you live, find out how you may be able to get involved and contribute. Thank you, dr davis, did you want someone? I'm sorry did you want to respond to dawn's issue at all? I saw you shaking your head. Yes, so I don't know in total. Can I just say to thank you dawn for coming dawn is one of liz, krueger's, wonderful staff and I've worked with don over the time, so it was good hearing from you don, oh my pleasure, and may I ask one other question, please sure, okay great, so this is related to telemedicine as well or more specifically, to telemedicine. So senator kruger has you know just questions about what might the potential be for telemedicine to create a two-tier system of sorts, so in other words whether some people would have greater access to in-person medical appointments or even to telemedicine, and I guess there could be advantages to either depending on the circumstances. Instead, so I don't know if you have thoughts about that at this point yeah I mean we've definitely pivoted a lot towards telemedicine, and that is definitely one of the things that we have to be really concerned about is not creating another level of inequity. Through telemedicine services, we have telephone visits, which you know most of our patients have access to a cell phone. So so that really isn't the issue. However, not everyone has access to unlimited minutes on a cell phone and they may not want to use those minutes to talk to their doctor, so I mean so. I think you know we have to always think about that video visits. You know we're also utilizing video visits, but not everyone has and not. Everyone has a computer that they can access the system through, because most people really utilize their phone as their source of internet, and they may not all work through the cell phone app and you might need you know the computer or a tablet. So I mean I think we have to be careful with the technologies that we embrace that we're not creating any type of system where some people are accessible to it. You know or have access and not, and then they're. You know, in addition to just having access, you have to think about the digital literacy of some people right, so some folks are not as comfortable using video devices or telephone to access their medical care, and how do we serve them just as well as people that are more comfortable? So I think I think telemedicine in some ways has made things you know more accessible and absolutely during Covid-19. You know we have to pivot, towards that we were leaning towards doing a lot more telemedicine anyway. Kova completely accelerated that, but we also have to keep in mind that it could be creating some inequities, and this is something that we'll be looking at very closely to make sure that the same level of care that we're able to deliver that same degree of care. For example someone that has diabetes. We can do a lot of things through telemedicine. They can send us their blood glucoses. They can, you know sometimes upload it through through a glucose through their glucometer. It can come into our emr. There are a lot of things that it can do, but it's, but it's not for the same for each patient, and so we still have to figure out how to meet patients exactly where they are so that they have. You know the right tool that can help us to take the best care of them, and I imagine that insurance and reimbursement rates play a role as well. I'm just guessing yeah, so insurance and reimbursements is definitely something that we take into consideration. The ensure the reimbursement for things like video visits are pretty much the same as as in-person visits, whereas for a telephone visit, it's not the same, so you have less reimbursement when it's just a telephone visit. So of course you know we would want to be doing more. Video visits, but what's most important is that our patients are getting some care. Some of the technologies are not paid for by insurance, for example, you know glucometers or only paid for by insurance flucometers, that might only upload that might upload a blood glucose result directly to our system. That's not going to be accessible to our patients. Without insurance, it will be accessible to those who have insurers. That will cover it. Thank you so much. I really appreciate it. You're welcome thanks. Next, I see merrell hello hi. It was a great, an interesting webinar, just any thoughts on how the a pandemic a vaccine might be distributed to children and mothers who are on welfare and who are in circumstances that would otherwise result in them not receiving the vaccine. Is you know it seems to me that they're so eager to get it out there, but that there's going to be a lot of problems in distribution and clinics such as you described it at wild cornell, certainly have ample opportunity to reach out, as do all the municipal hospitals, any just general thoughts on how we might get a vaccine to all these people who so need it. So I think the sax scene story is just it's a toughy right. I think that you know there's one part of it is you know, will the vaccine be safe for all of the people who need the vaccine? That's one major question: will the vaccine be efficacious? That's a whole other question, I'm going to say yes, the vaccine's efficacious. Will we have tested enough of the population to feel comfortable that it's safe in all of those populations? So I'm a huge vaccine advocate, but I'm also a huge women's health advocate, and it worries me to death that pregnant women aren't included in late phase three trials. So when the vaccine is available, it's going to be very difficult for me to have conversations with my patients about whether or not to recommend the vaccine during pregnancy, and I feel like it's possible that we may not recommend the vaccine for all pregnant women, but certainly the data would suggest that women with diet, pregnant women with diabetes and obesity, and some of those with hypertension are at significantly increased risk for severe outcomes related to Covid-19 19., in which case you might want to think about them or healthcare workers right frontline. I think that the next piece of that is, you know it's all about the safety and obviously efficacy, but it's also about patients, acceptance of the vaccine, so the very population that may actually need the vaccine. The most are also populations that historically have not been excited about any vaccine and a vaccine that you know is being pushed by operation warp, speed and making people feel more comfortable. So I think we just it will be interesting to see how it all plays out. I think that you know I'm actually on the cdc's work group on Covid-19. That's good. So I think great people on those task forces. I know- and I think about this all the time, but those are all the things that we need to be worried about. Just having the vaccine is not really the issue, it's people being immunized, that's going to change our lives so how we go from a vaccine available to people actually being immunized, as you said, is really complex. That's my problem, as somebody who would be you know, like somebody in the public officials are confronted with this issue of distribution. Immunization, as you put it so clearly, and I don't think they really have a plan, but I think they're going to get one real fast, because it's the nature of this pandemic to do everything too fast. So we'll see what just as you suggest has been very interesting, but let's hope it's not full of pitfalls and that we get this thing moving and that in fact, it kind of ameliorates some of the inequities in the system as it stands, because it's the first test that the government's really had to do something useful just to stop inequities in public health care. Anyway, I'd like to hear from dr davis about what effect would have the public hospitals will the vaccine yeah, I mean yeah, I mean I think when we it's such a charged question. I think the question about distribution is probably the least of these parts of the equation, because I think the vaccine will get to the hospital we have a. Let's say we have this amazing vaccine that works and it's efficacious, and everyone is convinced that you know this is great, no problems highly optimistic. But, let's, if we're in that space, those vaccines will get to the hospital and the vaccines will then get to the patients or will they will have the opportunity to get that vaccine similar to how we do massive vaccination with flu right? The question then becomes whether or not people are accepting of that vaccine. We are unable to vaccinate everyone for flu because there's a lot. You know for various reasons, but there's also distrust in the flu shot doesn't work. I think we're going to see that you know. I think that that's just going to be taken even more to the extreme, with a vaccine for Covid-19 because of everything and all of the conversations that have been happening around that vaccine to date and just having so many mixed messages about it. You hear about one trial, stopping then it's restarting, so I think you know for people that are just kind of hearing the one-liners and seeing the snippets that go across the tv screen every morning. This is really confusing right, and so, when there is a vaccine and it is available- and eventually there will be one- maybe not at the time frame- you know that our federal government would want to say, but eventually there will be one, but there's been already so much confused con. You know confused messages around it that by the time I think we get one. I think we will have to spend so much time trying to to change the conversation and to change what people have already thought about it, because there's going to be so many preconceived thoughts and people would have already made their decision up. I think as to whether or not they're going to take the vaccine or not, I think people are already making the decision as to whether or not they're going to take a vaccine when it becomes available, and I think to your point dr riley, like we have to have it tested in all of the populations that should be getting the vaccine. We can't give the vaccine to the elderly, who we know, are at really high risk of having bad outcomes with Covid-19. If they haven't been into clinical trials and many people in the trials are you know, young, healthy patients, I this particular trial, that's enrolling. 30 000 should have a wider spectrum of folks, but the initial trials have been young and healthy individuals, and so I think we still have a long way to go, but when the vaccine is available, you know my understanding is that the strategies will be to get it to those people that are at the highest risk of having Covid-19 and having adverse outcomes with Covid-19. Thank you. Thank you. Next I see elita. Thank you oops. Thank you. The sign says I'm muted and unmuted. At the same time, but anyway, if we could go back to pregnancy for a minute, I just wanted to ask you about breastfeeding, because that's something that, from everything I understand, could have a lifelong positive effect on babies as they grow into children as they reach adulthood. And is there a different impact? Is there a different desire to breastfeed babies among different populations and how to both doctors from both hospitals address that and urge, if you do women to breastfeed their babies and then how you also ensure that what they're ingesting themselves the vitamins and nutrients are sufficient, because so many more calories are needed. So I'm just curious about this, and thank you. It's a nas. I mean it's a national priority for to breastfeed children up until the age of one, if that's possible, and it's a priority for a couple reasons- one because, as you said, it looks like children have better outcomes. Certainly in the first few months of life they have lower risks and rates of infection just from maternal antibodies. So I think you know that that's just one of many reasons to breastfeed, I think also- which we don't talk about that much, but it's important is for a lot of women. It's the good idea to breastfeed, because it does help with losing weight postpartum and for those women who you know have issues with sort of being unable to get back to their pre-pregnancy weight. That, then, just you know, leads to more problems later it becomes, you know even more important for them to breastfeed and in their best interests. Actually you know, I think that a lot of I would say, probably every single obstetrical unit in this city, if not in the state, has a huge sort of group of people who do lactation support, there's a lot of lactation support in the hospital. But again, as I mentioned, we do there's a lot of things we can do in the hospital that then just can't get carried on outside of the hospital. You know we're trying to do virtual lactation support. We started that with Covid-19, it's been done elsewhere, just we weren't set up to do it and so we're doing it now and it. You know it works to some extent, but again, I'm more interested in the doula program, because I think that they're much better at it to be honest with you and they're in the community and also they have a better understanding of sort of what some of the community preferences are, because you know every racial and ethnic group has a different feeling about breastfeeding and a different idea, and so sometimes I find the nurses are all you know. You must breastfeed like 25 times a day, I'm like really. No. I don't need to do that. I can breast and bottle feed, because that's what my west, indian parents told me. So I think that there's you know some benefits to opening that line of communication up a little bit more, and I think we just have two more questions, but I know dr riley, you said you had to leave. I think yes- and I just want to thank you so much for your surprise, joining our call. We can't thank you enough for participating and we hope to work with you again soon. My pleasure happy to come back and dr davis. What a pleasure to meet you nice to meet you as well. Can I ask one last question of dr davis that I think is over. I know that there's a health in hospital says 11 hospitals and a large number of community hospitals. I don't know what they're called. What are they? How do they affect health? Can you explain a little bit about what the community outreach are? They call community hospitals or no they're, not they're, not hospitals, they're, just they're community practices, so they're like various clinics that are throughout new york city. Let's see so, instead of going to the hospital to a doctor, you would go to one in the community near you know a community area I'd say and then, if you needed to be realized, you would go to one of the 11 hospitals. I'm sorry! If you need to be hospitalized, that's when you would go to one of the 11 hospitals along the way. Okay, yeah. The community sites are all ambulatory care centers. So they're your primary care clinics, your that's your! You know your gyn care, your pediatrics care, all of your outpatient, regular medical care and then at our 11, acute hospitals. They all also do have an outpatient part. You know, so you do have an outpatient clinics there as well, but the 7dr throughout new york city in our community settings. That's great! Thank you! Okay, rebecca anymore, I don't see anymore, but this has been. Thank you so much for everybody. That's left. I think this is so interesting and so helpful just want to say that rebecca and I and our whole committee have identified two more of these zoom meetings that we're going to have one we'll talk about mental health, specifically with senior issues during this part and after and the third one I think, would be more of an overall discussion about. You know more of a high level of what else needs to be done, and what have we learned? What have we learned in the past with aids and so on that we're working on so stay tuned? Everybody- and thank you again, dr david. All of you that have been a pleasure. Thank you. I just want to thank dr davis, dr mcdougall, dr riley, anna, andrea, nicole, and will, of course- and I see we have one hand up so maybe we can let billy have a quick statement before we have to go, but dr davis and thank you so much for sticking around with us for so long. We really appreciate it no worries. Thank you, yeah I'll, keep it super short, and hopefully it's worth it, but I just wanted to commend barbara and rebecca for putting this together and the panelists. This is one of the most informative community board meetings I've been to in a long time. So, thank you all. I really learned a lot. This is terrific. Thank you. Thank you. This was wonderful and I'm just so pleased with everybody. Thank you all right. I guess that's good night and good night and thank you will as always, happy to be here happy to help. If you have any of your friends who missed today, the video is gonna be on our website, so just have them check it out on youtube great. So good night, everybody good night. Thank you.",
            "summary": "Dr asha mcdougall is the director of women's health practice and community health at new york, presbyterian hospital, where she is committed to provide the best care for all of her patients, and she is.\nWhat's really important to understand is the difference between equality versus equity and when we're thinking about equality speaks to the same everyone having the same thing and as you can see from the top half of this panel, everyone indeed has the same exact bicycle.\nAs a physician, I'm, going to give you an example of a patient, and this is just going to give you an example of how we see healthcare inequity, For me, as a culmination of many different people that I see so miss j is a 42 year old woman who lives in the Bronx As a cashier at a c-town and part-time as a home health, attendant.\nPlease, when we look at the demographics of the patients that we take care of more than four in ten of our patients were born outside of the united states and when we look at the the sources of our foreign-born patients, they're coming from the dr from mexico, lots of the caribbean, also from bangladesh and from colombia and china, we use interpretation services very often at health and hospitals.\nNext slide, please, and one of the things that we really work hard to do, is to address the social determinants of health, and this is part of what we do in our office of population.\nWe need to get more upstream, and this is what we try to do when we take care of our patients, and so they asked me to talk about what a chief pop health officer, does- This is part of what we do is think about the entire patient, the entire population of patients, that we take care of.\nHaving and taking the best care of them that we can in the space that they are and with the challenges that they may personally be experiencing, and I, think I'll end there and save time for questions.\nAnd, we'll talk more about cohen hospital, as well as the women's health clinic and the hemsley tower 5, to describe some of the community engagement that we participate in the services that we provide.\nYou know the u.s particularly, and so it's been great to work with many partners in new york, city, And, I'm, actually on the maternal mortality review committee, which has been an eye opener for me, because I'm actually a bostonian so sort of this whole new york thing It's been very helpful in sort of setting the goals that I have from my own department, one of which was to make sure that, at the very least for our patients in the women's health clinic that we have a leader who is dedicated to community health as opposed to someone who's.\nThat's something to take into consideration when we are thinking about health care equity is that patients are coming to our.\nAnother service that we provide you know in regard to maternal mortality and morbidity is a two-week telemedicine visit for all patients who are delivered out of the new york presbyterian cornell campus hospital, regardless.\nYou know if they are either privately or in our in our clinic a two-week postpartum visit by a provider either a nurse a nurse practitioner or one of our physicians will contact them and discuss a number of different things, including postpartum depression, lactation, support and continued care in that postpartum period, which is very important in meeting our aims for increasing our health care outcomes for patients who are pregnant and immediately postpartum.\nEven in the rush of everything that has happened, this year, it was very successfully opened in the david cole, building between 68th and new york and in a in and as far as health care, equity.\nYou, know a lot of health care in new york city from you, know.\nYou know certain hospitals or certain services, because there are certain hospitals that may have various levels of care that they can provide to different patients.\nI, think we're really good and getting better at taking care of women and making things safe, while they're in front of us right So, while they're on labor and delivery, while they're in the immediate postpartum stay.\nAll of the data shows right now that certainly you know I'll just give one like little example: Pregnant women that get pre-eclampsia or toxemia of pregnancy, which is a pregnancy-only disease of high blood pressure and swelling and can affect your kidney and your liver, but just those women who have preeclampsia during pregnancy depending on the study, some something like five to have a five to twelve times higher risk of cardiovascular disease as early as ten years after having their baby, so their you know, pregnancy, actually is probably this horrible cardiovascular stress test that you know women who are already not in good shape, then don't do well during pregnancy.\nI just think in general patients come into contact with so many people in the hospital that I personally, don't like the idea of requiring this kind of bias, training.\nYou know help them to really achieve what they need to achieve in terms of having good health outcomes, and that's often challenging to do.\nYou know a term like a substance, abuser Where, as a doc, I, completely felt I was not empowered to speak at all in that space, because I did not want to say the wrong thing and offend in my just ignorance of not understanding what certain terms meant when a patient heard, it, and so I think that you know creating those types of environments and dialogues is really important and something that I hope that we're going to be able to continue to do.\nHow do you I apologize, but I'm, just wondering if it is something I think it is because you said social work, but how you address the various needs of patients And and how you make that health care available and and work with, to avoid or minimize the kinds of stigma that still may be attached.\nYou, know, sort of standardly get this same information from every patient, and since I got here, I just couldn't get people to do it in a standardized way, but we finally got it up and running right before Covid-19, and you know, I think, as dr davis said, you know, and certainly the mental health system that really doesn't exist was really.\nKnow, brought it home in terms of you know all the deficiencies, and so what we're setting up at the moment is because it's so difficult to get psychiatric help in the city for all sorts of reasons, probably because there's just not enough of it, but we're hoping to set up a system where there's a layering effect of social workers, psychologists, psychiatrists, community health workers, who can you know, help women at where they are, as opposed to where we think they may be, and because I think many women at least my experience of having practice ob for about 30 years now, many women have elements of postpartum, depression and postpartum anxiety, but not all of the elements, and not all of them need drugs.\nThe situation they're in than it is the hormonal issues going on, and so we need the resources to be able to parse that out and take care of women in whatever space they're in that We're working towards is this layering system just be because thinking that you're going to have enough psychiatrists to take care of the 30 of most pregnant populations that need it?\nIt probably depends on the kind of insurance and is that something that varies across the patients from h and the patients at a private hospital like new york, presbyterian or wild cornell, and how the city is able to handle those disparities in in not just access, but the ability to actually get treatment.\nSo we have the consulting psychiatrists, who work with the social workers and even some of our nurses, where we have educated on how to do some counseling and depending on how impacted that patient might be in terms of their mental health.\nYou know is the multi-layer and really the need to collaborate with a number of different providers, not just physicians, so at the ht5 clinic we'll be starting group prenatal support classes, which is actually a new program that our social workers have initiated because of the results of the devastation from Covid-19.\nAnd I'm, convinced that it that a doula program could be incredibly helpful for a wider population, and The thing I like about the doula program is that there can be many more of them because they're in the community, as opposed to midwives, which you know that's a few years of training and training up That's what I'm working on we do.\nI am a donor as well as a patient to the medical department of new york, presbyterian and wild cornell as well, and I'm interested in knowing about the new cohen hospital in the coke building.\nYou also take patients that are not of hospital patients, but might be city hospital, patient We, don't turn anybody away we, but in general I think most obstetrical services want to take care of the people who have gotten their prenatal care in our institution, whether it's in the ht5 clinic or it's in one of the faculty practices But there are women who you know were getting their care at montefiore or one of the city, hospitals They hear about a shiny, new hospital, and so they show up and they deliver.\nSenator kruger has you know just questions about what might the potential be for telemedicine to create a two-tier system of sorts, so in other words, whether some people would have greater access to in-person medical appointments or even to telemedicine, And I mean we've, definitely pivoted a lot towards telemedicine, and that is definitely one of the things that we have to be really concerned about is not creating another level of inequity.\nYou know it seems to me that they're so eager to get it out there, but that there's going to be a lot of problems in distribution and clinics such as you described it at wild cornell, certainly have ample opportunity to reach out, as do all the municipal hospitals, any just general thoughts on how we might get a vaccine to all these people who so need it.\nI think that the next piece of that is, you know it's all about the safety and obviously efficacy, but it's also about patients, acceptance of the vaccine, So The very population that may actually need the vaccine.\nI think that you know I'm actually on the cdc's work group on Covid-19.\nYou know, I think that a lot of I would say, probably every single obstetrical unit in this city, if not in the state, has a huge sort of group of people who do lactation."
        }
    }
}