{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Landmarks Committee - August 10",
            "publishDate": "2020-08-11",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    LES Preservation Initiative Informational Presentation: State Historic Preservation Office's Determination of Eligibility for the ERP Track House and Tennis House\\n3.    GVSHP request for support for better landmark protection of old PS 64/Charas to require better seal of property to prevent existing break ins and proactively prevent fires and destruction\\n4.    Vote to adjourn"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 218,
            "um": 137
        },
        "wordCountFullTranscript": {
            "building": 81,
            "buildings": 36,
            "city": 33,
            "community": 28,
            "resolution": 28,
            "slide": 24,
            "people": 23,
            "preservation": 19,
            "time": 15,
            "thing": 15
        },
        "wordCountSummary": {
            "people": 10,
            "building": 10,
            "city": 7,
            "community": 6,
            "letter": 5,
            "buildings": 4,
            "lender": 4,
            "village": 3,
            "preservation": 3,
            "state": 3
        },
        "fullTranscript": "Me last time I did this, I kind of turned it this way right, so we had that's more interesting, wow, okay, so we are now recording welcome everybody to the meeting of the cb3 landmarks committee. We have some interesting topics to take up today. I'd like to begin by just acknowledging the work of our preservation organizations in our community. I think you guys are amazing and both of the topics on our meeting tonight have come about by grassroots efforts by members of our community and the organizations they belong to village preservation, lesbian, east village, community coalition- so you guys are unbelievable. The first topic on our agenda is approval of the minutes. Let me just keep admitting people to this meeting. While we do that. Yes, okay, so let's see we have mitchell and me oh carolyn, you made it good carolyn. Is there uh-huh and sandra sandra's here I know I think not david right, david was going to come in by phone, so david, if you're here make yourself known, so we have what we have so may I have a motion and a second to approve. Last month's minutes, I make a motion to approve last month's minutes. Thank you hi. Second, all in favor aye. Thank you. That's done all right, so the first topic on our agenda tonight is get down to my list here. It's the initiative regarding the national register listing of the two buildings in the east river park, and we have richard and deborah presenting, and you guys I'm gonna make you post. So you can there's one. This is david adams. I finally got it, I'm so glad you made it yeah. I can't see anything really, but I can. I hope I didn't have the wrong call yet yeah. It's okay, yeah, that's unfortunate, but it is what it is david. I had trouble blocking you. I wrote down the wrong number and I had to go back a few times, but I couldn't see it as I. You know. Okay, this presentation is coming from lesbi and we have richard moses and deborah y. I don't know how you guys are going to divvy things up you're, both co-hosts should we share the screen, then linda. Good luck, okay, share, okay, you're opening vocal! Thank you. Okay, so richard was going to start right richard here we go so good evening. Everyone and thanks, linda I'm richard moses, from the low east side preservation issues, initiative, also known as lesbi and last february. We reported to this committee on our new york state, historic preservation, office, application for the historic east river park, track house and tennis center comfort station, and now I want to provide you an update and review the results in 2019 lesbi was invited to be a consulting party for the east side, coastal resiliency project dealing with the east river park, reconstruction for flood protection, which I know most of you, are familiar with. After initially focusing on the east river park's fireboat house, which was already listed as eligible for the state national registers of historic places, we turned our attention to the track house and tennis center comfort station, which you see on this slide here: two distinctive structures from 1938 that are threatened with the complete demolition, with complete demolition in the current east coast, resiliency plans. Unfortunately, these buildings were not flagged as historically or architecturally significant during the environmental impact statement phase of the project. After reviewing the building's fine architecture and researching their history, we decided to bring them to the attention of the new york state historic preservation office, also known as shippo as potentially eligible for listing in the state and national registers of historic places. We received additional support for listing the structures from eight local preservation organizations. Last month we were thrilled to receive the shippo's positive determination of eligibility for the building's architectural and historic importance. Our hope is that this will help in our efforts to save the buildings now slated for demolition. So here you can see that some of the most and can you just go back to the list. Some of the most prominent of the city-wide and local preservation are amongst the supporters of this listing of the buildings. Okay, thanks next slide, please! Okay! Here you see the two buildings, the track house near east 6th street, at the top of the screen and the tennis center comfort station between river rivington and delancey streets at the bottom of the screen. The shippo's assessment value the quote high degree of integrity of the two structures with original materials both inside and out and their hip roofs massing, scale form and window patterns all intact. From the original construction, shippo noted the historic aspects of the buildings as part of the wave of new deal construction accomplished under robert moses and mayor fioriello laguardia, but the main focus of the shippo's evaluation was on the building's architectural distinction, as designed by aymar emboury ii, lead architect for moses in the 1930s. The buildings combine both art, deco and modern, classical elements in a style often referred to as WPA modern. The ship will also remarked on the fact that the buildings remain in their original locations. My fellow lesbian board, member deborah y, who carried out phenomenal research on these buildings, will walk you through our slides here. You can see in this historic photo that the tennis center comfort station is here in the foreground, and the track house is way back here in the distance. This circular structure is no longer there, but the area around it is this slide shows the track house and how it looked when it was first built and how it looks now in the bottom right. The only difference is really in the backgrounds where the tenements can be seen in the 1939 photo, and today, there's public housing, shippo noted the distinctive three-part structure of this building accented by two chimneys at the ends and an unusual stone cupola at the center. Here's a closer look at the cupola, which also shows a detail of the blue terra cotta freeze with the greek key design, alternating with rosettes. This is the water side of the building. The other side faces. The fdr drive it's a little difficult to see here, but the entrance doors are bracketed by curving walls, which you see here, which are very characteristic of art, deco buildings, art deco elements are also found in the spandrel panels. Beneath the windows you can see here. Here's a closer look at one of the terracotta panels, with its stylized waterfront motif, including fantastical fish, vegetation and water all in rhythmic patterns. This is the ladies room at one end of the building. Even here, the sensitive placement of the elements makes a harmonious ensemble. You can see the original slate tile roof. The freeze and the decorative terracotta door surround here's a detail of the distinctive motif around the door. It recalls the maritime past of this area, just as the spandrel panels beneath the windows refer to the waterfront. You see the design at the left and the clear reference to something used in shipping called a marine anchor bow shackle. Another feature the chippo called out is the use of plasters to articulate the corners of the three-part building. Such blasters are typical of the modern, classical buildings of the 1930s, particularly as seen here in conjunction with the greek key design in the freeze. Now we'll turn to the tennis center comfort station, located between rivington and delancey streets. Again, all original materials are found here, limestone, cladding, terra cotta trim, slate, tile, roof and glass block windows. Such glass block windows are often found on art, deco buildings, here's a picture from 1939 and nothing has changed. You notice the same motif in the door surround, but here the freeze is different: it's a beautiful blue terracotta, sprinkled with stars which may reference nighttime navigation for ships. Here's a closer look! You can see here that some cleaning and some slight restoration work would be a help. I'm showing you here on the right, the interior of the tennis comfort station, as it is seen today, you'll notice, the glazed wall tiles and the floor. Tiles on the left is an early photo of the com of the comfort station in the park. The materials are the same as you see today. The integrity of the interiors of both the tennis comfort center station and the track house was considered significant in the shipo evaluation. In conclusion, I want to note that these are the only two remaining buildings of five such structures that once populated east river park, it seems imperative to lesbi that we not lose these as distinctive links to the past and as two of very few examples of art, deco buildings on the lower east side, we're open to any ideas that might serve to mitigate the effects of the planned new construction, which could include raising the buildings and adaptively reusing them. So thank you. If anybody has any questions, you know we'd be happy to answer them. If we can. Yes, I do now that the buildings have been determined eligible for the state and national register. I assume there's going to be state and or federal money and licenses for the east river park reconstruction. So have you been in touch with the shootout at all in terms of section 106 and how that will play into the fate of these two buildings? Yes, well from our understanding, we were in touch with them. They weren't didn't, provide us a lot of detail on what they're doing right now, but they did say that they were reaching out to you, know the city administration and going to work with them on possible routes to remediation. Unfortunately, state and national register listing as opposed to eligibility, really requires that the owners are compliant with the listing. So if the city doesn't want the buildings to be listed, you know they won't be listed and the shippo's role is really advisory here as well. At this point, so it's a little bit sketchy, but it seems as if there's not a lot of teeth in this designation, except for hopefully to you, know guilt some of the parties into doing the right thing and having some kind of a meaningful mitigation for these buildings yeah. You said that the fire station is listed. If I could just jump in, I think the distinction is that the fight cross is listed as an architectural resource on the environmental impact statement, but these buildings were not, and it's that omission that caused us to conduct a survey and ask the ship up to take another. Look at the building so that we're pleased that they've agreed that they are valuable buildings and that they're recommending that the city consider mitigation along the lines of the section 106 process, but we just don't know the outcome so we're hoping to go to parks and asked for a resolution from parks which has been really working on this project to consider the adaptive, reuse, preservation and adaptive reuse of these buildings to recommend that from the city. That is our next step, but we also you know. Obviously we know that there's support here for the work and we're just interested in hearing from the committee what you know what you recommend at this point of other courses of action for us and we do want to get the support of you know the local elected officials- and you know some of the other organizations going forward to push the city to do the right thing here. Well, that was pretty interesting. I got completely disconnected oh no, oh no! Oh! No! I had to actually change computers. Did you guys finish your presentation? Yeah? We can go over with you sometime linda. That's fine! Sorry about that, at the beginning of this meeting I neglected to ask that people attendees go in the chat and put in your name and affiliation. So we have an attendance list. We don't have a way to pass one around. Okay, so does anyone want to say anything about this presentation? I'm sorry. I got totally wiped out here, but if you would like to please raise your hand, I think it would be one if olympia raised your hand and you might be muted. I can't hear you. I can't hear you olympia, you're, gonna, mute yourself, not muted, but maybe your microphone isn't working or something yeah. I just tried to do that yeah, so I just took off my microphone and maybe you'll hear my kids in the background. So so I had a question basically based on what they were discussing after the presentation that you were not here about what they're pursuing here and I'm wondering since now. You have this evaluation, and should you also pursuing to hear the new york city landmarks to have a meeting around this and give some sort of? I don't know comment about this situation. It's a good question: we actually pre, we actually approached informally the landmarks commission about the buildings and really did not get a positive reaction. We didn't give a put in for formal requests for evaluation, but we kind of feel that the buildings are a little bit borderline in terms of individual, landmark quality, and that's why we wanted to go and being that this is such a political, hot potato. This project that you know we wanted to go with the national and state register listing, as the best way to you know, bring the buildings in some measure of recognition and protection. Thank you carolyn. Well, you know, I think the buildings are great and it's absolutely amazing that there is an intact, the interior as well as amazing carrier yeah. I mean that in itself I mean considering sandy and what the devastation that it wrecked on so much of the neighborhood. It's absolutely awesome that those buildings are constructed so well that they withstood the whole force of that surge. The other thing that's an issue is what the parks department is currently proposing to replace them with is something else that are like rectangular blobs that are different colored. We were told that they're supposed to be playful, but they're like basically cement block rectangles, and these buildings are far superior to what they're planning to put in there absolutely well. If you look at the plans for the escr and the parks department and what they're proposing to replace them with it's really frightening, I hear you okay. Anyone else want to comment. If not, we don't need any vote on this. I understand, and everyone should know that you all are going to make a presentation at parks committee in September. Am I right? We hope so that's the idea. Yes, okay, so keep an eye on the agenda for that. If you're interested in pursuing this with you know with the actual escr, which is what is all being done in parks, so it's parks that will need to write a resolution if they choose to do so. Mm-Hmm, okay, so we're going to move on then to ps 64. and let me just get ready here, it's interesting to wear so many hats. Okay, I'm going to share my screen and I don't know who's going to speak first. It says village, preservation, sure I shall, as you thank you so much chair and as you share the screen with everyone, I'm harry bubbins. I am the east village and special projects director of village preservation, formerly known as greenwich village society for historic preservation. Thank you very much chair and the committee for hearing this emergency request for august. I know you don't normally meet this month and this is a joint request by our colleagues and team members with east village, community coalition and lower east side preservation initiative and for our brief presentation, that's coming up. I will be joined by sarah bean admin. Our director of research and preservation, laura sewell, the executive director of east village, community coalition and richard moses, who you just heard from president of lower east side preservation initiative. So I can't see the presentation myself you can't. I can't. No, I don't know if I'm looking anybody see it. No, I didn't share the screen, yet that's a good reason and thank you to everyone in the public attending today. I know you care deeply about this issue for many years better. Yes, there it is yeah. So, as I said, this is was a joint request to be on this agenda tonight again, thank you to everyone in the public for being here, we're gonna go over together a bit a very brief history, which a lot of people here know far better than me will go over the conditions past and present of this hazardous and emergency condition building and then the action steps. We hope that the community board will take next slide, please so sarah b natman harry just introduced me. I worked with him at village preservation. Most of you already know. This is former public school 64., one of the cbj snyder schools, which was very innovative in its time in terms of its design and allowing light and air for students who knew that would be a new idea as well as specialized areas within schools, and this is the h plan design again allowing that light and air, which was a new way of approaching school architecture. Next slide, please harry again, and what the history of most people know is: charis el bujio, the community center in the 70s when the building was taken over and while there's not enough time tonight to go over the immense amount of programs and educational experiences that were offered. That was a critical resource for the neighborhood that was lost next slide. Please it was lost because then mayor giuliani sold it at an auction very contested. I see some faces in the crowd that were probably present, that day sold for just a little bit over a million dollars in 1998. next slide, please sarah yeah and it was, as probably you all know, better than harry, and I it was landmarked in 2006, with huge community support and next slide. Please next slide, please well just to take it further. The singer, who owned the building at the time, started to strip off some of the architectural detail even before it was landmarked in the hopes that it would compromise the integrity in their or not get landmarked, and if we're able oh there, we go okay, hi. Can we have the presentation or is that no longer viable? I think c actually dropped again of the zoom, oh wow, having some computer problems. I don't see her anymore here: okay, harry, oh no you're, not you're, not richard moses is a host right now, if you have your, if you have the powerpoint and you want to share it well, we I think we ought to wait just for her to get back on, because I'm hosting the meeting how's everybody doing [Laughter]. Meanwhile, do you want to see if you can cue it up, you do have it and that may make it possible for linda to stay on. Maybe here richard are you with us? Yes, I'm with you, but also now with you in terms of voice. So yes, sorry, I was responding, I'm not I'm muting myself! So I have this hold on I'm going to share the screen right and we can wait for linda, but it might make it easier for her. Thank you and I'm just going to go through the go through the slide. There we go. So let me see where we are here. If we can scroll down to where the building is starting to be taken apart. Thank you singer. We can continue the gablet a little more yeah, so I just started to say that he started to strip it down in the hopes of it not being able to get designated and didn't succeed on that end, but continued to leave the building exposed. We village preservation, as well as other groups, had been in touch with both lpc and dop. Throughout the years, I've only been with village preservation since the end of 2015, but it has been a continual back and forth with lpc about how the building has been left. Can I have the next slide, please that shows some of the details in 2016. Actually, there were no windows at the top story. They were removed and in March of 2016 the elements were literally getting in and we were sending pictures to lpc about this situation next slide. Please- and this just shows more details of the hazardous situation and next slide. Please, the the structural issues which clearly are being shown here in this picture. So thanks. Sarah and the quote from the village voice that you saw on one of the slides, was something to the effect by the current owner that we start chopping it today and you saw the tatters of the blue tarp, which has up until now served as the kind of protection and care for this landmark that has been evidenced by the owner so fast forward to last year. Many of you know- and I know carolyn as well here in her wearing our hat as the neighborhood resident association member as well, the it was so bad. They had to evacuate the adjacent buildings they closed down. East 10th street, the fire department, con ed and the office and of emergency management had to come on the scene to see what was going on the building because of cracks- and I know we're waiting for linda, but I we want to respect everyone's time and carry on I'm sure. She'll understand next slide, please. So the department of building issued a vacate order in 2019, one that exists until today and along with the vacated order, comes orders to repair next slide. Unfortunately, there are. This is a little older version, but in any case, there's many there's dozens of active violations, severe violations next slide- and this is from our online documents for one an eyesore and a magnet for garbage and darkness, because the lights aren't maintained the scaffold, that's a permit. The scaffold was applied for in 2006. The scaffold has been up since then. Obviously, the repairs and necessary improvements to the to the property have not occurred, hence the need for the vacate order. Hence all the photos you just saw, and so that does not seem to have encouraged the owner to do anything next slide. Sarah, would you want me to continue? I know no, I'm unmuted. So after back and forth, lpc did there was originally back in 2013 in order to repair a permit to repair which was never executed in 2019. The order to repair was issued, and this next slide please does come with the threat of daily fines of five thousand dollars a day which, to our knowledge, has not been applied next slide, please harry sure, and I think that that five thousand dollar a day potential fine from the lpc is not a typo. I think it goes to show the importance of taking care of our landmark structures, as well as the possible dangers and hazards that can accompany an older building being left to decay, and so that's a lever of power that the city has at its disposal, which we're not aware it's been utilized. Yet this is an older slide. This just goes to show that the the the owner has utilized different kind of filings there. The loans have been taken out, which I don't know if this presentation is going to have, I might have to speak about it over 50 million dollars in loans on the property under getting financing for the property, calling it an apartment building which the accuracy document on the right shows, and yet the building is tax assessed as a as a school which doesn't comport and just shows what potential lack of transparency that the owner has been representing next case next slide. Please thank you and I just before laura jumps in here there was a slide or two missing. I'm sorry about that. The owner, as shown on public documents across documents, has taken out over 50 million dollars in this property that they purchased for just over a million dollars. They are in a foreclosure case. The lender to one of the major lender to them of 44 million dollars is madison realty capital, who you might have known, also lent to tolenato in the neighborhood. For those who are aware of the tall and nato tenants coalition fighting for their rights, so madison realty capital is currently foreclosing on the owner of the building for lack of paying the mortgage. In addition, and as of august 3rd, they were asking the court to continue the matter after the Covid-19 pause. In addition- and I'm sorry I had I edited the slide right before laura goes now in the current condition, which is terrible since 2015 on public documents, the owner has paid over 500 thousand dollars in lobbying fees. This shows the priorities of what the owner has been doing with their money, and it seems, instead of paying to fix the building and repair it and address the hazardous conditions. They had over half a million dollars for lobbying fees according to public records. So thank you with that. Laura actually. May I just jump in real quick, the situation with the youth breaking into the building. I reported to john weiss at lpc back in, I believe, June. He immediately shared it with DOB said they did an inspection and they didn't find any such break-in and the there were a number of cc's to other DOB people and then, with carolyn's picture. I sent this to DOB as well saying we see them clearly accessing the roof and damaging the building, and I have not. We village preservation has not heard back from DOB since then that was in July. Sorry, laura! Please go ahead! No thank you. Thank you. Thank you for that. So, while the landmark has periodically suffered from vandalism and break-ins over the years, these incidents have really escalated. In recent months, residents have frequently observed varying groups of teenagers hanging out on the roof straddling the parapet. Wall climbing down the scaffolding at the 9th street entrance and again there's a full vacate order on this building because of the conditions inside and fire erosion of fireproofing. So it's dangerous for them to be there. At different times. The kids have taken a pickaxe to the rooftop ventilation systems. They've used the tool to break up cinder blocks and bricks, which they then toss into the interior courtyard or into neighboring roofs and there's. Video of this they've used spray paint to graffiti the roof and parapet. You know it's just typical teenage stuff, but some of it includes some hate speech. That's unpleasant for neighbors to see. Every day this past week the pickaxe was discovered in the backyard of the charlie parker house, at 151 avenue b, which is adjacent to the building it's adjacent to where you see the kids, we can move to the next slide. If we can so it's adjacent to where you see the kids hanging out- and you know it's clearly the same rusted pickaxe with only a bit of blue paint on the handle that the kids were using on the roof. You can go on to the next slide. Imagine finding something like this in your backyard. It's like out of a horror movie, you know! No one wants to call the police on teenagers, especially in the present climate. Our youth desperately need activities that are productive, not destructive and there's not a lot out for them. Right now, the solution is to secure the building, to discourage these excursions and any further damage to the landmark and sarah has explained what happened when photographic evidence of the break-ins was forwarded to the DOB, an inspector found a locked gate, and that was enough. The pro considers the premises secured. The police have told us that they're not able to enter without a warrant because of the lock gate, but the kids have no problem, climbing the scaffolding dropping down into the courtyard and getting into the building. So you know who knows where this might end as they egg each other on to greater and greater acts of vandalism and the danger of fire is very real and very present, always a bunch of concern for immediate neighbors. If somebody were to decide to do throw fireworks or light matches and they're getting to the roof from inside the building. So it really is very much of a concern considering what has gone on elsewhere in the community, and I think it's back to harry richard. I think okay yeah and, as laura mentioned, that the threat of fire is very real and you can see what happened to another lower east side landmark the norfolk street synagogue three years ago caught on fire, because some teenagers were planning were playing around in the building and the building has current has subsequently been demolished and delay marked. So it was really a loss, historical loss for the community, and on top of that, during the construction around the kind of the clearing the site, one of the workers for the project was killed. So it actually, you know, resulted in a death as well. So nobody wants that kind of thing to happen at ps64 and and charis. And finally, you know, I think we have very basic requests for the city at this point that we're looking for the city to secure the property so that teenagers and whoever else cannot enter and can't do any more damage to the outside. We want the department of buildings to go ahead and make immediate structural repairs and also secondary repairs as well to elements that, if they're not repaired quickly would further deteriorate the building. Some of the areas that you saw earlier, where the ornament was stripped off, that brickwork leaves the facade open to the elements and call and really accelerates the deterioration to the entire building, allowing water infiltration and possible future loss of material. So we need the we would. We want to see the developer, find five thousand dollars a day and apply to apply a lien to the property, as per the you know, city, rules and regulations. And finally, we want the city to reacquire the building for the community as everybody, as was mentioned before, was a community center for several years before being sold by giuliani and the city. The east village community certainly needs and deserves a community center, and there's no reason why this can't be prom. It can't be given back to the community, as promised by the mayor before his re-election and so again this is one of the most historic buildings in the community and also has a very close place in people's hearts for many reasons and has not been treated the way it should be by the city, including really the buildings department and the landmarks preservation commission, because in our view the proof is in the pudding. You know they can say that they're following procedures and they're doing inspections and they're contacting the property owner. But when you see a building in this condition- and it's been in condition this condition for so many years. There's really, you know no excuse on the part of these agencies that they're doing what they're, what they're supposed to be doing, not just ideally but by following the letter of the law, of what they're responsible. For so does anybody else have anything else to add. In conclusion, the only thing that I would want to add is that there was one suggestion from a resident that the community board write a letter to the lender, describing the sorry condition of the building the vandalism and trespassing that are allowed to happen. It's another action item to potentially consider that I think just didn't make it into the this earlier draft of the presentation, and I don't want it to get lost in the shuffle thanks. Any luck at all I'll stay here. Well, believe it or not. My second camp, my first computer lost its wi-fi access and the second computer just crashed, so I hope it doesn't crash again. This is not good. No, I have one more computer. I guess I should get them all up and running anyway. Hopefully I'll be here and to start. The discussion should be discussion by committee members. First, and would you please raise your hand if you want to discuss who's raising their hand? Carolyn are you? Yes, I'm going to raise my hand, I'm trying to get there to do it, because I think you were you're at the closest neighbor to this building and I think it would be great if you would yes, I raised my hand. Okay. Okay, can you hear me? Yes, okay, I live immediately across the street from character. I used to organize block association meetings in the building when it was still occupied by chadas. The condition of the building and what's happening to it right now represents a threat to the lives, the welfare, the property of everybody who lives around this building. It is an utter disgrace that the city is allowing this to go on the city. We wrote from the block association complete with images in April of 2019. We received a notice from a letter from the landmarks commission saying: oh you know he could be fined up to five thousand dollars a day. He's never been fined five thousand dollars a day. They seem to think that it's been sufficient, that he put up two heavy-duty black tarps on the areas of the building on 10th street. That was sufficient to meet their requirements. Then you look at the other dormers that are covered with that tapestry of blue tarp that blows in the winds that he's destroyed and damaged all the gutters on the building, both on 9th and 10th street side. The kids are using the scaffolding like monkey bars. I counted nine kids, at least on one occasion that looked like they were between 12 to 14 years old, coming out of the building like March, marching up climbing up kind of helping over the scaffolding. We've all been taking pictures. It's just it's scary. To think that somebody is actually taking a pickaxe and tearing the building down from the roof up. They've knocked all the chimney pots off the chimney and are taking the bricks out of the chimney. I mean it it's sort of like unbelievable vandalism. I mean it's like why and we sit there and we watch it. I've notified the ob. I've called three one: I've called the police. You know we filed complaints, I've written the community board, we organized the town hall where we had 99 people come to the town hall to express concern about the building and how they would like it returned to our neighborhood and it seems to be frozen in a moment of time and that no one takes any action and it's just it's like a horror story. It's waiting for something to happen, and I think that we need to try to draft either a resolution asking lpc to move forward with demolition by neglect. Action against singer he's allowing this to occur. Okay, I think it's a great idea to notify the lender, but in the meantime, we're stuck living here. Dob needs to issue a warrant that the police department can enter the building. The building needs to be secured. That laura. Do you have that photograph handy? That shows the area where charis is in the whole area of the block. The aerial photo that's available. Excuse me just let me interrupt for one minute. Carolyn, please hold in your head the question of the police ability to access the building. We do have a draft resolution, but that is not in it. Okay, go ahead! Sorry, laura! You know I can look for that carolyn, but I don't have it handy: okay, there's a an aerial photograph that shows the location of charis and all of the buildings that surround it and the number of people's lives who would be affected if that building it caught fire. Okay, the fact that there's a vacate order on the building means that the fire department will not enter the building. Okay, it. It's tragic that we're allowing a new york city landmark to be demolished in front of our eyes and the city is absolutely taking such minimal action to protect it. I don't know how to say it any stronger than that, but it's just sort of like it's a real assault on our community that they're doing this. They need to get it together and do something. Okay, thank you. I'm gonna! Let anybody else who wants to raise their hand and speak to do so, but I have a request- and this is because of the annoying behavior of my computers. If you put your information into the chat before, would you do it again? Because when my computer crashed, I lost the chat now anybody want to raise your hand. Olympia. Thank you. So thank you guys for the presentation and thank you linda for hearing this. I don't have a powerpoint, but I do have a window in front of charis elbow here and I wanted to show you that actually one of the things that is missing in the recent pictures is this brand new graffiti that I've been watching the last two months and that is on fourth floor third floor. So basically they have to have access somehow that high to do this graffiti and also what I want to show everybody and it's the top windows. Every afternoon when there is a little bit of wind, there are broken pieces of glass that they tilt and they do. They send signals into my living room and this has been happening for five or six before Covid-19 and I called 9-1-1, because that was around the time that the lady died when a debris fell from the building, and I have serious concerns that with the wind, these pieces of glass can fall on someone passing below and hurt them. So I talked with 3-1-1, I filed the complaint 9-1-1 and they did send NYPD and they called me- and they just didn't- do anything this thing still tilts every afternoon and sends lights to me when there is wind- and this is like real danger- and I don't know I'm happy to hear that you are drafting a desert today. I my complaint has a number I passed it to susan stetcher, but every afternoon, I'm afraid that if the wind blows a bit extra, somebody may get hurt seriously and so again thank you for writing this razor. Thank you to all of you for doing this work. I think, of course, as an architect I have, and as a community activist, I have a lot of reasons to love this building etc. But right now, in the copy there, it is really a matter of safety, of a lot of people, the casual passer buyer, the people who are living near that- and so this is this- is too negligent. They need to do something about this. You know that that's another new one on us keep that in your head. Until when we write the resolution olympia, one thing you may not know is on the on the landmarks preservation commission's website: there's a violation form and any time you see a violation on a new york city landmark, and we see lots of them on this building, go on there and fill out one of those forms. Let's harass them a little bit there aren't. That is a violation and they're not addressing it. So thank you I'll. Do my homework yeah, it's a very simple form. It's you know no big deal right, I'm sure there are many of you have used it. Okay, anyone else want to speak sandra. Yes, I think that the letter to the lender is a great idea that way, if you know he's already gotten 50 million dollars the owner on based on it being a residential property which it isn't right. So I think hitting him that way that you know would make them make him at least stop and think. But what I want to say is: I think we should get the elected officials involved as well. I think elect letter should go to them and get their support as well. Has that been done? I know carolyn had a town hall many times many times many times the elected officials and nothing's been done. They will all get a copy of this resolution. I'll be sure that is part of the you know, there's a little part in the bottom that says, send to we'll make sure they all go. Okay, I'm just surprised that no one has done anything to support this, that this has been going on so long well, some of the people who've been watching this for a very long time can maybe speak to that I mean I think some people have tried, but you know I don't live in that neighborhood, so I'm not as up to date on the day-to-day happenings right me either. Well, I cheers thank you olivia olympia. I want to say thank you also to olympia. You know and carolyn I mean you're right there witnessing it. So I really appreciate that. Thank you. Does anyone else care to speak? Please raise your hand. Can you hear me? Can you hear me who am I hearing richard harry? This is harrisburg. Yes, since you mentioned, and thank sandra for those important points about the letter to the lender, making them aware of it in case they're not aware, and as far as the elected officials go, you know, many people have been involved doing different things to the best of their ability. Our hope with this agenda item- and this hopefully forthcoming resolution is to armed with that. To go to the elected officials and point out how community board three has taken a strong stance in support of these action steps. It's been, you know now, there's the vacate order. Now, there's the order to repair. Now there is the authority of the city to go and fix it themselves and build a landlord and all the other action steps. So in following up what you're saying we're hopeful armed with a resolution from cb3 a strong resolution that the elected officials and their staffs who are here today, I see some of them. Thank you very much will be pressing the city all together. Thank you and richard. I just sent you that aerial photo that carolyn was requesting if you're able to share it, because I'm not a co-host. I can make you one if you like, that, that's easy to do either way, whichever one of you gets there. First yeah. I have it here. Let me let me just pull it up. Let me see here, can you see it? Yes, yeah, I think, what's really important about this image- is that it shows the densely populated neighborhood that surrounds this building and their residences, that you know it would be such a tragedy to lose a beautiful building, but it would be a far greater tragedy to have people made homeless or killed because of actions that are not being taken by the city. Even the vandals that are getting in there are in danger, because that building is not. You know, this stuff is going to be got to be falling off the ceilings and the walls inside and they could be harmed if you're, taking a pickaxe to the roof and knocking the chimney pots off yes and taking bricks out of the chimney. What do you think they're doing inside right? I mean the graffiti is mild compared to the actual physical damage that they're doing. The other thing that's noticeable is that the copper flashing over the entrance on the ninth street side has been flapping and blowing in the wind, for god knows how many years I called complaints, I've called rosie when she was the council person. You know if a piece of that flashing breaks off and flies down the street. It could behead somebody yeah, I mean they're literally like little pieces that wave in the wind every time there's a strong wind. Okay, that's great! I like this photo a lot. It's very clearly really puts it in context. Yes, it does. Somebody would forward it to me I'd appreciate it. I don't have to do it right now. Okay, anybody else care to now. I can't see ray's hand, so you have to just start speaking if you want to speak. Yes, I'd like to know what is the expected planned follow-up for the proposals to the city, I guess harry your office will be doing that. What how will you follow up with the city? How can more pressure be put on them? Well, we will be. We will be submitting a resolution which will be go to the full board of the community board and be approved there, I'm sure, and that will definitely have some weight. We haven't really done that in a long time we haven't had a resident haven't, had a resolution, so I have some hope that will get someone's attention and that's why we're doing this? Anyone else care to speak. Should we move on to the resolution yeah? Okay, so I'm going to attempt to share it. Let's see without my computer blowing away again. Okay, can people see it? You have to read it. I can't see this is day, but you have to really see it. I hope it's not too long for you. It's very long lot of it david. I don't think you need all the long list of whereases. I don't really just the air force yeah, but I want. I do want people who are here not only committee members. Usually resolutions are edited by community members only, but I do feel that the groups have been working on this deserve to have a say. So you know if you have a thought about something that should be added the first part of all these whereases is essentially a history of. What's happened with the building it goes on and on and on we're asking all the history which you all probably know. Let me skip the warehouses and go to the their force and then we'll see if we need to change anything so therefore be it resolved. Cb3 recommends the following actions: DOB properly secure the building and make emergency repairs and build the owner. Lpc, take legal action to compel repairs and issue the maximum fines retroactively and moving forward and three place a lien on the property and send a letter with this resolution. If passed to the lead lender of the owner to make them aware of these issues, I'm going to take it, you know, take your password, I'm sorry, you have to say a fifth, no I'm taking that out. That doesn't make any sense. Okay, I took it out david bit further. Thank you. Thank you. Via further resolve, cb3 reiterates its call made in a resolution in 2013, requesting that the de Blasio mayoral administration returned the former ps 64 school building to the community by legally retrieving and then selling or giving it to a well-established, not-for-profit organization. With a long history of serving the people of the lower east society's village, including, but not limited, to restoring the not-for-profit organization known as charis el boheato to the building located at 605 east 9th street, now carolyn, perhaps this point about the police could go into the this bulleted list yeah. It would be helpful if it could be with the DOB and besides properly securing if they could issue a warrant for the NYPD to be able to enter the building to stop the destruction. Okay, I think that could be a separate bullet, though okay, but it seems like it should be right after that. Yeah dod is the one according to the precinct, it's the DOB that has to do it. Okay, d.o.b, should must judge. Dob must issue a warrant allowing the NYPD to enter the building. Can they do that or just must the owner do it? I mean if the bucket order doesn't allow fdny to end there? Why would it allow NYPD to enter? That's what the precinct told us yeah danger, I'm sorry, this is dave. Is there a danger cause you could put in there due to danger that the for the public safety there before you put a get an order in sure as carolyn's pointing out the in the end fire there could create tremendous damage to public safety issues must issue a warrant allowing the NYPD to enter the building. That makes sense david, I think so, since I can't see it why no you have to you have to have a good memory. I have nothing that I can say to you about your computer situation, no something it happened. Well, one of my air conditioners has a like a safety thing in it that and a blue, and I think if something could have happened to my box, I'm gonna come and put power to my box. My box has no power. Ah, that's not good, though I have no there's nothing's gonna work, so that's my problem. They have to. They have to come and give me back. You know have to come and repower my box. Okay, good luck! For the next month, barbara, you have your hand raised. Oh they're, very responsive. As long as I try to get somewhere for three hours to the line, I was very responsive. Don't worry, can you hear me? Thank you, okay, can you hear me hi, I'm very happy that you included the part about putting pressure on the de Blasio administration. I want to emphasize the urgency of that, because he's not around that many more months and he has made us a promise and we need to get that building back and restored to us. The part where you put to a community organization. I would state to a coalition of community organizations which we have coalitions, organized supporting the chadas resolution this, but there are people who would represent the lost services that the community center provided to us for over 21 years, as well as the unmet needs expressed by the community on behalf, you know which our local community organizations through a coalition can express- and there were lots of studies done by pratt. There were lots of community coalitions that were set up on this behalf and I think that should be activated and if the city purchases by eminent domain- and we need to keep pressuring de Blasio administration, that we need to put a coalition entity in charge of how this building is used. I don't think in the landmarks resolution. We can be that specific about what should happen to the building after it's purchased. You know what do you say it should go to for profit organizations, but I don't think we should be too specific. You put singular organizations, so you should put coalition. It says organizations for in its organizations right. I just didn't read it that way. Sorry now we do talk about and one of the, whereas is just above this that this is actual. This building is the subject of a foreclosure action, because if this man is not among other things, he's not paying his mortgage, so it's really a shambles linda. I have my hand up. Can I ask you a question? You may so one thing, a small thing I would say in the first new york city DOB, just at the world immediately because, to be honest, we just had uob set a wall on between my building and eighth street between two buildings that are falling apart. Also, but those are private buildings and dobby came and put the scaffolding and built those owners within 24 hours. So I believe they need. We that's the kind of turnaround time. We need to demand for charis right now, because it's crumbling and somehow they think it's okay. I really have a concern about public safety here, because there are people actually living under this, shall we say and make immediate emergency repairs properly and make immediate right immediately. They should do everything right. They should before anything else. That should be immediate right. You know, thinking about the pickaxe being thrown off the roof. Okay, it could have killed somebody. No, it's a real hazard and I don't know exactly made that point in our in our whereases and I think we've talked about the damage to the building, but I don't think we've talked about the hazards right. The exact dates that we started taking pictures recently: oh yeah, we did actually where's the president consistently. It was made hazard to life and property, so we did say that right so shouldn't we add in the second, due to public safety and hazardous conditions. Carolyn said something about a piece of material that could fall off at any time and it's going to be headquartered, flashing, yeah, the copper flashing, so we should say students. I also had a strategy question because I don't know when we send the results to the various departments and I'm happy that among the audience we have both representatives of carolina, rivera and harvey's office, but basically because this, of course, is a building with huge history and every time we say each other, some people just roll their eyes. So should we have like a premise in which we say new urgent, you know what I mean like do. We have like a cover letter with the results so that they understand that this is not us talking about. Let me say that we should say it in the resolution, and it may be that there's enough of that up in the beginning that we didn't read and this, whereas got a long list of whereases, that's why I don't want to really read them because they'll be here all night good as long as we stress that there is new evidence for which they demand immediate action. You know new hazardous things, whatever okay, I think that's covered, so I do intend to specify that this should go to DOB and ltc. I think it should also go to the elected officials and even the mayor, although he doesn't care obviously, but we'll, send it to him anyway and so that'll go together. No, they don't always go to everybody. You know I want a broader audience than would usually be the case. It would probably go to carlina, but not further. Okay anyway, we'll specify all that. Don't worry, linda, oh sorry, not to interrupt in the middle of the resolution, but there there's also just a question about whether keeping the scaffolding up is something for when whether any of these issues might be something that could also be raised at transportation and public safety right. A little more specific here man, you do you think that the scaffolding itself is a hazard? It's the problem is the how the scaffolding acts as shelter for the homeless. It also acts as monkey bars for the kids to access. Yes, I would be more concerned with the condition of the sidewalk that there's not the lights, aren't on that it's hazardous for pedestrians and that you know there. Obviously there is the potential for someone to throw something right now, because people are getting in that would hit the street or blow off and hit people despite the sidewalk shed being there right. So I don't know I don't. I don't know that we need to interrupt this process for that, but I just I'm asking an opinion before we finish. Could I make one suggestion one of the things that helps to obscure the kids going into the building when they climb on the scaffolding is the signage that's attached to the street light that it's right by the gate, and it's made it very difficult to document with photographs when you see them climbing over, because the signs help to obscure them. So if they would move the signs that would at least be somehow whose sign is it it's transportation? It's parking signs. I think that's probably another thing that doesn't go on a landmark's resolution. I hear you though, well no, if they could remove the signage, to try to secure the building and make it safer. I think linda is right that so that has to be evaluated as a safety issue, and we really can't do that transportation committee yeah. Maybe they should put it on the agenda for the transportation committee yeah. I think. Okay, that's a possibility right. That would be that's their double hit, yeah. Why not get a double hit and you know you can and that you can talk about the condition of the sidewalks. You can talk about. You know the fact that the sheds are monkey bars, that's all part of transportation, committee's charter. Okay, isn't it what also parks possible? Oh you mean they're playing around I'm sorry yeah! No, not real monkey [Laughter] very bars funny all right yeah, but that's good! That's good! Do we have enough here? Can we or does anybody want to do one more thing before we pass this resolution? I think it's good. Okay, I mean the question is: do you wanna have a stronger call as a bullet point to the ribleage administration, to reacquire the building or to this thing that somebody said in the pre presentation about demolition by neglect? Is this? So then sorry, I hear someone speaking, but I can't hear you very well. I can't speak to you at a time. He reveals our request how they treat it. I think you know we can't push too strongly on. I don't think we can push too strongly on that. That's perforal, I mean we can't tell dlb to buy the building back right. Well, actually, because the mayor made a promise to do it. We definitely are asking the mayor to keep his promise that you could do, but you can't do it most, that's about as strongly as you can go. I think on it, yeah, that's right, and essentially you can't see that there'll be a further resolve, but if you, what about the demolition by neglect, because the lpc could move on that they've gone after 12 different sites in Manhattan, according if you, google demolition by neglect, there's a particular building in harlem that they acquired through demolition by neglect the corn exchange building there. I remember that building yeah, it's a beautiful building, yeah, that's we. They have to decide whether to actually they have not yet decided that this is demolition by neglect. Maybe we should say something about that, because if it is, then they have certain tools that go beyond what they have here. I thought it was mentioned in the one of the air force it, whereas is I mean yeah? It's not. I don't think it is. I'm sorry can I happen here for a minute linda, it's richard! Yes, I'm wondering if perhaps there could be, therefore, that the city retain a qualified preservation engineer to thoroughly assess the building and identify you know any potential hazards, areas where the building has been structurally compromised and areas where the exterior envelope has been has been compromised. That's really good say that again, I can only say these things once then they leave. I know the city should retain a preservation engineer as soon as possible to assess thoroughly assess the buildings for potential hazards for areas where the building structure has been compromised and the exterior envelope go down. I gotta assess the building for potential hazards potential hazards for areas where the building has been structurally compromised: okay and the exterior envelope for points of water infiltration and potential water infiltration and degradation of the original building, materials, potential, water and filtration and degradation of original building materials. I like it, if I may, when they redid the rules, you know what was it now 2017 the lpc has on a retainer to to engineers who specialize in historic structures it's actually mostly to deal with the row house situation, which you know is very pertinent in east village and greenwich village, but they already have that on retainer. That was a new thing when they, when they instituted the new rules, yeah lpc has them on retainer for sure yeah, but they didn't use to no, but they do now yeah they used to rely on DOB. So it's our those that should be already important and not the city here right, thank you, pardon I'm gonna, say lpc and not the city, because we don't want to all right, that's great! Well, I would, I would suggest, perhaps doing the city slash lpc, just so that if the city, if lpc, is already maxed out on their budget for the fiscal year or there's some kind of issue with you know bringing them in that there's some wiggle room in terms of how the engineer gets retained right yeah. I know when we were before the fire in that hammerdash they definitely. This lpc definitely supplied an engineer. They were trying to save that they really tried hard. Actually they didn't want to. They didn't want to be finding the rabbi, but they definitely tried they got an engineer in there. They thought they could stabilize it. Unfortunately, the trouble is if you wait long enough, the kids get in there and do their damage linda, I'm sorry to interrupt. I don't think I can raise my hand because I'm a coach and just go right ahead. Okay, so I I'm a little unclear just as to the committee's intent on the fourth, therefore so place a lien on the property would be the city place, celine, it should be the city and we don't know what agency does it? That's what I do someone's a little bit vague here and then send a letter with this resolution to the lender of the owner to make them aware of those these issues. I thought that was a request to cb3, like maybe they're, taking this resolution to the lender, to make them aware of these issues. I think that was a request for cb3 to send a letter. Well, I don't know whether cb3 wants to send a letter or not okay, so I just want to make sure I just want to know you want to be clear on your intent. It doesn't if this reads, as you intend that's great with me yeah, I don't think cb3's letter would have much impact that should be better from whatever agency. Probably you know that is responsible department of finance, hello, any further comments. Before we pass this resolution, I presume we're going to pass it. May I have a motion. I would like to know if you can say to send a copy of the resolution to the lender. Yes, oh, you went oh you're being specific about the wording. You got it yeah man, I don't think. Maybe you can't send a letter, but you can let the lender be aware of our resolution. Absolutely okay! Thank you anything else. Can it go to the speaker of the city council as well, and can we change the language of as soon as possible to immediately wait a minute? You mean the resolution yeah. What you said you were going to cc to our elected officials? Can it go to that will definitely include the speaker and city council. That's a good idea, and also can you change the language from retaining a engineer as soon as possible to immediately retain you really. You were talking about the city here. I think you're good enough to say that they're not going to immediately do anything so they'll claim they don't have a budget right, but we'll just put a little fire. Maybe they can assign a city for someone from the city to do it. Well, yeah! That's what they don't know if somebody from the lpc has interviews under contract. Yes, okay, you guys still have your hand up. Were you done again? I can lower your hand. I just didn't wanna there we go. I make a motion, there's a wait. There's the sign that is blocking the sign is blocking the documentation of the ongoing criminal activity. So I mean it's easier for people to take a picture of that and document it. We already said that's going to go to the transportation committee. That's not a landmarks issue sandra! You want to make this resolution yes, I'll. Make a motion to adopt this resolution. Call us favor need a second right all in favor. Yes, everybody said yes right, yeah, okay, sandra carolyn, david and I all said yes, yeah, okay, yes, okay, all right! Thank you very much. Thank you. Thanks for all your hard work, carolyn very appreciate is that it yes, is there anything else? We're gonna have a motion to adjourn. Did we adopt the minutes from last month? We did we did that at the beginning morning. I forgot all right, so the meeting is adjourned and thank you very much and thank you for whoever stepped in and finished presenting the powerpoint when I blipped out that was richard. That was richard. Our co-host richard had it in his backpack. I was speaking, I'm so glad that I made some co-hosts, because my pleasure, I think, we'll always do that. If my technology continues to fail me this way. Okay, all right have a good evening, all right, good night, everybody. I need ice water.",
        "summary": "I. Think you guys are amazing and both of the topics on our meeting tonight have come about by grassroots efforts by members of our community and the organizations they belong to village preservation, lesbian, east village, Community, coalition, The, first topic on our agenda is approval of the minutes.\nIt's the initiative regarding the national register, listing of the two buildings in the east river park, and we have richard and deborah presenting, and you guys I'm gonna, make you post.\nWe reported to this committee on our new york state, historic preservation, office, application for the historic east river, park, track house and tennis center comfort.\nAfter, initially focusing on the east river park's fireboat house, which was already listed as eligible for the state national registers of historic places.\nThey weren't didn't, provide us a lot of detail on what they're doing right now, but they did say that they were reaching out to you, know the city administration and going to work with them on possible routes to remediation.\nSo, we're hoping to go to parks and asked for a resolution from parks which has been really working on this project to consider the adaptive, reuse, preservation and adaptive reuse of these buildings to recommend that from the city.\nAnd we do want to get the support of you know The local elected officials- Sorry about that, at the beginning of this meeting, I neglected to ask that people attendees go in the chat and put in your name and affiliation.\nThis project that you know we wanted to go with the national and state register listing, as the best way to you.\nThank you to everyone in the public for being here, we're gonna go over together a bit a very brief history, which a lot of people here know far better than me will go over the conditions past and present of this hazardous and emergency condition.\nNext slide, please harry again, and what the history of most people know: is: Charis el bujio, the community center in the 70s when the building was taken over and while there's not enough time tonight to go over the immense amount of programs and educational experiences that were offered.\nEast 10th street, the fire department, con ed and the office and of emergency management had to come on the scene to see what was going on the building because of cracks- The department of building issued a vacate order in 2019, one that exists until today and, along with the vacated order, comes orders to repair next slide.\nI think it goes to show the importance of taking care of our landmark structures, as well as the possible dangers and hazards that can accompany an older building being left to decay, and so that's a lever of power that the city has at its disposal, which we're not aware it's been utilized.\nIf this presentation is going to have, I might have to speak about it over 50 million dollars in loans on the property under getting financing for the property, calling it an apartment building which the accuracy document on the right shows, and yet the building is tax assessed as a as a school which doesn't comport and just shows what potential lack of transparency that the owner has been representing next case.\nIt can't be given back to the community, as promised by the mayor before his re-election and so again this is one of the most historic buildings in the community and also has a very close place in people's hearts for many reasons and has not been treated the way it should be by the city, including really the buildings department and the landmarks preservation commission, because in our view the proof is in the pudding.\nThe only thing that I would want to add is that there was one suggestion from a resident that the community board write a letter to the lender, describing the sorry condition of the building the vandalism and trespassing that are allowed to happen.\nYou know we filed complaints, I've written the community board, we organized the town hall where we had 99 people come to the town hall to express concern about the building and how they would like it returned to our neighborhood and it seems to be frozen in a moment of time and that no one takes any action.\nBasically, they have to have access somehow that high to do this graffiti and also what I want to show everybody They send signals into my living room, and this has been happening for five or six before Covid-19 When a debris fell from the building, and I have serious concerns that with the wind, these pieces of glass can fall on someone passing below and hurt them.\nI. Think that the letter to the lender is a great idea that way, if you know, he's already gotten 50 million dollars the owner on based on it being a residential property which it isn't right.\nSome of the people who've been watching this for a very long time can maybe speak to that I mean I, think some people have tried, but You know I, don't live in that neighborhood, so I'm not as up to date on the day-to-day happenings Yes, since you mentioned, and thank sandra for those important points about the letter to the lender, making them aware of it in case they're, not aware, and as far as the elected officials go, you know, many people have been involved, doing different things to the best of their ability.\nYou know it would be such a tragedy to lose a beautiful building, but it would be a far greater tragedy to have people made homeless or killed because of actions that are not being taken by the city.\nWith, a long history of serving the people of the lower east society's village, including, but not limited, to restoring the not-for-profit organization known as charis el boheato to the building located at 605, east 9th street.\nRight, thank you, Well, I, would, I would suggest, perhaps doing the city slash lpc, just so that if the city, if lpc, is already maxed out on their budget for the fiscal year or there's some kind of issue with you know bringing them in Okay, I'm a little unclear just as to the committee's intent on the fourth, therefore What I do someone's a little bit vague here and then send a letter with this resolution to the lender of the owner to make them aware of those these issues.\nWell, I, don't know whether cb3 wants to send a letter or not okay , I."
    }
}