{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCb--64Gl51jIEVE-GLDAVTg",
            "title": "Top chat replay",
            "publishDate": "2020-10-01",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/1/2020",
            "status": "live"
        },
        "properties": {
            "fillerWordCount": {
                "uh": 159,
                "um": 291
            },
            "wordCountFullTranscript": {
                "care": 70,
                "child": 68,
                "families": 59,
                "seats": 58,
                "program": 53,
                "programs": 32,
                "school": 31,
                "children": 26,
                "bridges": 24,
                "space": 24
            },
            "wordCountSummary": {
                "care": 22,
                "child": 19,
                "program": 13,
                "families": 10,
                "seats": 8,
                "children": 8,
                "programs": 8,
                "need": 7,
                "school": 6,
                "bridges": 6
            },
            "fullTranscript": "Hey shanna, are you middleton's? I think that's you is that you hi. Yes, can you hear me? Yes, okay, I'm just gonna, also rename you so that easier to find and let me introduce you to gail barron who's, one of our co-chairs, hi shanna nice, to meet you and thank you so much for joining us. We're delighted, hi, susan gail, barron and peggy price is with us as well. We co-chair the women and families committee. I can't hear you peggy will. Can you hear me? Yes, no yeah. Now we can hear you yeah so the way that we run the cba meetings just to keep everybody from like talking over each other. We mute everybody and take away their ability to unmute themselves. So as best you can try to not mute yourself whenever you guys are giving your presentation. If you need to at any point, you can always chat me and I'll. Send you the thing to be able to unmute yourself again, but until then you know you guys can stay muted and everything. But shanna are you doing most of the talking for the city officials or are all five of the city officials gonna be speaking or what will no? It will be mostly, I would say, a combination of susan she'll. So I will kick us off just a brief inter introduction. Very short and susan will be leading most of it and we will also have elizabeth from the DOE okay great and for Q&A. I think it just depends on. You know what the question is: we'll have to rotate amongst us. Okay, thank you. That'll work, that's excellent! How does jennifer pronounce her last name? Is it guilin feeling I want to say guiling, but let's wait when she joins. Perhaps she can confirm okay, hi trisha hi peggy. How are you good? How are you I'm good? I'm sorry to have the video on right now, I'm here with my screaming child here, teddy hi trisha hi gail, we're good! Thank you someone's happy yeah. Somebody's bedtime is about 10 minutes. Oh, my goodness. Okay, we're just gonna, go back on you until we get started and then I'm gonna we'll see. Can you say good night? Okay, we understand he's so cute, okay, but 6 28, but we'll wait a bit until everybody is able to get online yeah. We have about 30 people who've already rsvp yeah, oh good, because when I was looking at the bottom of my screen, it didn't show that so I wasn't no they're not here yet, but they are but they're signed in to get the information for the media. Perfect, good, excellent, so some folks sign in twice so it's a little less than that. But that's all right! Now! That's excellent hi jennifer! I think you're muted! Well, if we can just unmute jennifer, so she could pronounce her last name so that we all have it accurately and introduce herself as well hi nice to see you. The last name is guyling like g-u-y-l-I-n-g hi, jennifer hi, I'm gail barron and along with peggy price, we're the co-chairs of the committee and we so much appreciate all of you, helping us out and really being able to respond to the update of what is happening. You know it's so important. We get questions, but we don't have answers so we're delighted that you all are here, of course thank you for the invitation. It's always so difficult in its own way with zoom, because will has to be letting each person in individually as compared to when we're able to be face to face in a meeting and everybody and just come in at the same time a little bit less cumbersome. I think our elected officials aren't here yet if they don't come by 6 30ish, I we'll start with shanna. Okay. Let me just check on elizabeth one more person from our party. Oh sure, let's give her a couple of minutes. Oh of course you know, then I'll do a general welcome and all and hand the program over to peggy. Thank you so, okay, so I think elizabeth is on will. Can you just confirm that you see her? I don't see her. Is she? Is it possible she's calling in from the phone? Let me check and if she is- and she can hear me just hit star nine- to raise your hand, so I can on you and talk to you. That's the one phone number ending with two five zero: you can unmute with star six hi everyone. This is elizabeth! Sorry, no! I'm elizabeth hey! I was just having trouble getting on video, so I had to had to call in and thanks for letting me I'm new how's everyone doing good we're actually just about to begin. Do we have a lot of other people to let in will or can we start? No, I think you're good to get going and I did see keith powers. The council member is here as well excellent, okay! Well, let me begin by welcoming everyone: gail barron, I'm the co-chair of the women and families committee of cb8, along with peggy price, and tonight we're going to have our meeting center around the urgent need for child care in our district. This is an issue which our committee has looked at over the past several months and we know how critical the need is for both affordable and quality child care, and we're very excited to be able to have our speakers tonight, because we're interested in finding out what kind of child care facilities are in essence funded by or at least the funding is assisted by the city of new york and if any of those facilities are in our district and we're also very excited to get an update from representatives from the city on mayor de blasio's program of providing a hundred thousand child care seats for those students who are now the younger grades back in school and, of course, the challenges for parents who really need to have some place where their children are able to be taken care of. While the hybrid model is in place and their children are not in school full-time. We have some marvelous presenters with us. I'm very excited about that as well, and I'm going to turn the program over to peggy price who's, going to tell us a little more about the speakers and some housekeeping details. Peggy. Thank you very much, gail and good to see everybody tonight so tonight we have a stellar group of speakers to address the need for child care on the upper east side and the city's learning bridges program that hopefully addresses our community's need. We'll be hearing from our council members, ben kaylos and keith powers followed by city officials, shauna middleton, associate director, intergov and community boards, susan haskell, deputy commissioner, youth and services for the New York City department of youth and community development, jennifer geiling, deputy director policy and partnerships from the mayor's office of contract services, elizabeth williams, director data analytics for the New York City department of education and molly rexen assistant director, social services for the office of management and budget. But before we begin, I just want to go over some procedural practices of what's happened. Tonight. First, we'll hear from the elected officials, as I mentioned, followed by the city officials and after that we'll have a Q&A session that will begin with questions from the public, followed by those from community board members. At the end, cba members will be considering a resolution related to child care and our community. Everyone except gail, and I and our guests, while they are speaking, will be muted throughout this meeting during the Q&A. If you have a question, please click on the participants, tab at the bottom of your zoom screen and then click the hand icon on the right. When recognized, you will be unmuted temporarily. So thanks again for coming tonight and let's begin our program from hearing from our elected officials about the need for child care and what the learning bridges program will mean for our community. I think we have ben kaylos here and council member kalos and then followed by keith powers. I'm gonna go, I'm gonna defer to keith if he wants to go first, okay! Well, thank you! Everybody nice to see you and thanks for all the agencies that are here as well, and thank you to cva for doing this, because I it's such an important issue to shine a light on, and we don't always talk about it enough. But before I start I just want to say you know, I'm I'm. I really want to give a lot of credit to councilman kayla's for a second, because this has been an issue that he's been talking about in the city council in the district, even before I got to the city council, which is the need for good quality, early education programs in that breeze side, but also to have good child care services for new yorkers. If you work for the city, if you are an east cider, whoever you are to be able to have it, I think I'm sure it's educated by his own experience of being a father on the on the east side. But we have seen even as we you know, even as they rolled out really important and great programs like upk, that we had gaps on the east side for how that was covered. When we talked about 3k trying to get that to come to the east side and, of course, making sure that working parents have child care and access to child care, so I just want to say you have a I'm okay, but you got ben who has been really making this a kind of a cornerstone of his work here in the city council. So I'll just. I just want to talk about it quickly about and then you're going to hear from the agencies about the announcement on the mayor's proposal for childcare, child care, which is called the learning bridges program, which was just started and was announced a few weeks ago, which is basically a new program to provide child care options for children, 3 decay, 3 3k, through 8th grade for days when they're scheduled for remote learning and that's obviously makes a lot of sense. The parents are struggling right now to find the balance about how to educate their student, how to be with them, while they're remote learning, but also how to be able to work themselves. So we really needed an opportunity to be able to help out with child care for lots of the working parents here in the city, and it was announced a few weeks ago and just launched. I believe, is this past monday or tuesday we just launched, and it's essentially meant to be operated by community based organizations and partners to provide opportunities to connect us children with their remote learning activities, which could be including art and recreation activities and other age-appropriate appropriate activities, including, and also, of course, including meals and snacks, for free at all those locations. It's meant to be sort of help with the learning process here, but also, of course, has to follow the health and safety precautions that schools have to follow. At the same, you know, while you're doing your remote learning- and you know, as I understand it- they've been working with the district, 75 principals and families to make sure that there's also supportive placement for children in the in the program, and now that we have sort of learning off the ground in the last couple of days, we're going to be able to see sort of the effectiveness of the program and how it will be able to support families. I believe that on the first day there was about 30 000 families, out of the 100 000 or slots. I should say that are able to take advantage of this program, and it's supposed to re. You know eventually reach a capacity for a hundred thousand children here in New, York City admitted through a rolling basis, and I believed you know continued to head on and grow, so I believe that offers are still being distributed and still being accepted, but I'll. Let the agencies talk a little bit about it, but just to zoom out on this, no pun intended. You know what this really means. Is that we're not just saying you have to go back to learning and you have to do you have to find a way as a parents, we are putting some investment in to make sure the well-being of the family and the student particularly, is being thought of at the time that we're doing the remote learning, because I know my two nephews, I know my parents, my constituents who are parents, have all really tried to find that balance and how to make sure that the student gets the right educational opportunity and the right nurturing. You know sort of nurturing, but also they're struggling at home as well to find their own ability to balance those things. So I think it's a. I think it's a an investment. That's worth our time here in a very difficult moment, and I might really my goal here. I think, along with councilman, chaos is to expand child care options for parents and families in the city into the long term beyond this moment. So it's a good start to see how this works to give people the necessary support. I'll leave it at that. But I know you have really some great speakers from DOE at DYCD and other agencies here to speak about it, but do want to appreciate the work they're doing to make sure that this works and get off the ground. It's not an easy task. Everything we're doing is new here, but we're trying everybody's trying to make the best of it, and I know there's a lot of work giving it to us. I want to say thank you to all our folks in the city agencies for the work they're doing but anyway I'll hand it back to you and and to council martials as well. Thank you cbh for doing this. I think it's a really great topic and a really important time. Thank you. Thank you. Can we now hear from council member kalos? Absolutely I'll be honest. I was trying to stall for time. Bedtime is that at seven o'clock so's you will hear my daughter in the background, I'm in a one bedroom with my wife and daughter, and so I'm in the living room with the baby until she goes to sleep so we'll see him. Hopefully I can go step out briefly to tuck her in so I'm council, member ben kayla, since ben kayla's on social media. That's my daughter. I want to start by thanking elita camp chair of community board, aide, gail, barron and peggy price co-chairs of the women and families committee. I will note that when I joined cb8 back and I think 0.506, we didn't even have a youth and education committee and I remember being a troublemaker with sarah chu and getting that started, and it's only natural to have a committee just focused on issues that the families are facing. So I want to thank. We have susan haskell from DYCD, shannon middleton from OMB elizabeth williams from DOE, and we also have jennifer geiling, who I work very closely with at mox. She is I'm chair of the contracts committee, and so we work very closely on making sure we get non-profits paid and then she's also a constituent, so she's technically also my boss. So I try to do my best by her and I also know she's a parent in the district, so this is all close to her and just so grateful for the partnership with keith powers. He actually showed up at our upk rally when we had it all those years even before he wasn't elected so he's been on this and I'll just say, like pre-k, has been important to me, particularly in pre-k and child care, because when I started running in 2012 even before I was married and before like the idea of being a parent, was in my eye when I talked to people who I grew up with in the neighborhood, people would be here until they had a kid and that just seemed to be that moment when people say it's too hard to make it in the city. I can't, and if you look at the population in New, York City, you see this bulge happening until people turn the 30ish and then, if you, if you look, there's just this absence of 30 to 50 and then folks come back when they retire. So it was just the worst part of my job is when somebody says I'm leaving, because I can't afford child care and then got married 2013. I had my daughter in 2018, and so she was born and we're like. Okay, let's go check out some child's care options and once the directors of the 15 child care, centers, I visited in the district, fell off their seat laughing because we showed up to look at child's care after the baby was born. Instead of the first month we got pregnant. We discovered that the child care costs in this neighborhood average about thirty thousand dollars a year, which is about three times the city average, and I don't care what you make or who you are that's not something that most people have access to, and I just I see we're joined by michael stinson from the new york comptroller's office. He he's the one who did a lot of the study on the work around the cost of child care in our city and found that average of about ten thousand, and so it's just that that's more than it's. Basically, that is more than I paid for college, and so we've been working closely with mayor de Blasio. We supported universal pre-k when we weren't able to get the pre-k seats on the east side, we started with 140. We worked closely with the mayor and put a lot of pressure to get the seats up we're up to 100 at this point, we're not really turning anyone away that I've heard. So I want to thank DOE for their partnership and then the mayor I was always pushing for 3k, and the mayor announced it. So now we have 3k in Manhattan pretty much north of 96th street, so we have it in district four. We have it, I believe in. We don't have it in district two, which basically goes from the from 96th street to the tip of Manhattan. We don't have it in district one. We were supposed to get 3k in district one, and then we don't have it on the west side in district three, and so basically, we've hit about half the school districts in the city, but we still have half the students who don't have it. So I'm big on 3k, and so as we were coming back from in this pandemic and trying to figure out how to get back to school, the issue was just that whether families are choosing to learn remotely or going to have half the kids doing the hybrid model. The reality is like I'm here right now. My daughter is literally throwing things and I'm hoping it doesn't land on me, but like it's not easy, and so the thought that we put out, we sent a letter to the mayor, saying we would love to see remote learning, centers, thankfully, and to his credit, he's doing it. He did it. We have the learning bridges program. I've been, I I've been pretty proactive and some suggestions on ways to move forward with the program. I'd love to see more seats, same thing as pre-k. The mayor can be a victim of his own success and I will just put it out there right now that we do have a handful of locations I'll just put it out there for cba and DOE, and while I have all the players on in the same place, we have a child care center that we negotiated as part of the supportive housing on 91st street that we'd like to offer up. It's all renovated. It is ready. We just need somebody to take it over. I do something called been in your building. It's broken and daddy will fix it. Oh wow, you did break it. Okay, I have to fix this. It is broken. We also have a site, I believe, on 84th and third, that is a former dwayne reed that I did have been in your building and said: can you please cancel the lease with whoever you're going with and give me child care sloths, and I think we have a number of other locations in the district. Pretty much I've sent a letter to doie about this, I'm pretty aggressive about it. We have all these empty former dwayne, reeds, there's hundreds throughout the city, so we'd love to do that and I think we're still waiting. We have parochial schools that for better or for worse, have closed and we have a long history with the archdiocese. We have 17 that closed in the city that I'd love to see, become new schools and or child care programs. So I think, as you also know, as a community board, which I would love to have official support on, but I've gone to every developer in the city, including extel, to say, if you plan to build in the neighborhood and you are legally allowed to build 210 feet, I would like to give you what the community boards help another 40 feet of height, so you can give me 40 feet four stories of a school and I'm not going to give you the sky I'll. Just make you whole I'm a lawyer. We make people whole, we don't give them a windfall to try to build as many school seats as we can. And last but not least, we do have funding in the budget and I believe it is still there at least 93 million dollars to build 950 new school seats in the neighborhood, so hoping we can work together to get that done. So that's me. I want to thank this committee for looking at this important issue and I will be doing everything in my power to get child's care and I think the one piece is at this point, I'm starting to come to terms that I may not get 3k by the time. My daughter turns three she's alexandra. How old are you two years so we're probably not going to get to 3k, but not yet, but if I I'll do it for the for the next generation. Thank you very much very helpful council members, kilos and powers now we'd like to hear from the city, officials and we'll start with shanna middleton. Thank you thank you for having us. Thank you board. Eight. Thank you to the co-chairs. Thank you, council members. For that introduction. Your summaries of learning bridges was excellent. I think you've both earned honorary badges as part of the learning bridges team so come on over when you're ready again. Thank you for having us. We are excited to speak to you all today about the program. The team here today across DOE DYCD, mox and OMB, have all been working tirelessly to help the program get up and running operationally. As you can imagine, nothing is easy at this time. Definitely not you know this task or this program, but we can say that the program was successfully launched and we are continuing to work with providers and families across the city to continue to grow the program. Today we prepared an overview for you that touches on many things or common questions or information. We believe that would be useful to you, but if there's anything that we didn't cover, we will be taking Q&A right after. I would just remind or ask that this team we have is just the learning bridges team, so the Q&A, if we could just focus on learning, bridges and anything else outside of that, we would probably have to get back to you. So I will kick it to susan deputy commissioner from DYCD to get us started susan. Can you take us away? She might be muted, hello. There. You go all right, hi susan haskell, it's great to be with you guys tonight. I really appreciate the topic child care really pleased that your committee has taken this up. Shanna made a good point. The highlights are out there about learning lab. So I've just made a few notes about some details that we can add and then I'm sure you want to get to Q&A. So, as you heard, learning bridges, free child care programs for students who are enrolled in blended learning, the program is for students enrolled in DOE schools who are participating in a hybrid approach their school week and on the days when you're not attending school in person, you could attend a learning bridges program and get free meals. You need to be fed, you want. We want to make sure young people have a full stomach. You would get support to participate in the remote learning activities and in the downtime you would be supported with your social, emotional needs and participating in recreational activities, anything from literacy and creative arts to physical fitness. So that's kind of a picture of the program we're ramping up. We have had an application portal open on the department of education website and anyone who you know who might be interested it's very important to send them like the first step, would be going to schools.nyc.gov learning bridges and inputting your expression of interest, also your application. So if you know families who might be interested in this, it's a good place for them to for you to direct them to we. The mayor set an ambitious goal for us to ramp up a hundred thousand child care seats by the end of this year, and we are moving as quickly as possible towards that goals. I heard it said we opened our doors on 30 000 seats this week, beginning on tuesday. I'm sorry my colleagues from the early childhood division are on this call and they actually started last week, big kudos and hats off to them at the department of using community development, we're overseeing the k-8 grades and those launched this week with in-person for k-8. We have been sending offers on those 30 000 available seats, we're managing referrals to these open seats in a way that really maximizes safety and cohorting. So I said open doors. It's not really like an open flood gate, we're proceeding very deliberately and matching schools with learning labs programs so that to the best of our ability will be having the same young people attending school, going to a learning bridges program and that to the best of the program's ability. Those cohorts could be maintained from the day that they're in school to the day that they're off school, we have already a program in your district operated by Stanley Isaac. So we've got more than 200 programs, almost 300 programs between the 3k and pre-k and the k-8 in operations, and we have one operating in this district. We are going as I mentioned. We have a long way to go. We're going to continue to grow. We want to hear about open spaces. I heard some great ideas expressed, I'm glad to hear they're already been communicated to the team, that's working on vetting spaces and we also are seeking providers to run service in those spaces. So there's my colleague jen is on the line and we've got in passport the city's procurement system. We've got an open request for information. We encourage people who are interested to be partners with us in learning labs to go ahead and apply before I close on. I just want to say this was mentioned too, that we are 100 following all the safety protocols of New York, City, department of health, new york, state office of children, family services, working in conjunction with with department of education and those safety protocols and for short, we're calling our safety measures a high five we've got wearing masks and participating in daily health screenings. Most important thing to do is stay home frequent hand wash if you don't feel well frequent hand, washing cleaning and disinfecting of the program space in your common areas. Practicing physical distancing within the program to the best of the ability, so we won't have a lot of like high contact activities going on in the in the learning, labs programs, and then cohorting is really you know a unique strategy, we're taking, which is try to maintain to the best of ability, young people with groups that they that they are in at other points of the day or at other points of the week. So at this point, I'm not sure who's next on the agenda but worse, I know we'll at some point be ready for questions. Shawna did you want some other members of your team to speak or just want to head into yeah? We can open if elizabeth, if there's anything else, you may want to add. Otherwise we can dive right into Q&A yeah hi everyone. This is elizabeth williams from the division of early childhood, I'm on the pre-k 3k side of the team. Susan gave a great overview as the council members, as we said, but I just want to add that we are also giving priority for these seats to a few different groups who we know really need this service. A lot of them are sort of our who we think of as our like most in need: families in general, so folk families in temporary housing are experiencing housing and security, including those in shelter, families who are in foster care or are in the child welfare system at large, but also our kids as teachers and of program staff we're including them as well. Here you know we could not could not reopen schools without our teachers and our school staff. So those folks are getting priority here as well, not to say that we won't. We don't want to accommodate every single person who needs the service, but we are sort of giving first shot at the at the seats to those groups of families and that list that list of who's being prioritized is also on the DOE website. That was just shared in the chat. If you want the full details on that as well but yeah, I think happy to happy to hear your questions. Okay, great gail! Did you want to take over peggy I'm having some problems with my screen, so I'm going to exit and come back on so why don't you start with the Q&A? Okay? Great, thank you. So would anybody who has a question please raise their hand, you click on the participants tab at the bottom of the screen and then, when you go look to the right and click on the icon, that has a raised blue raised hand and then oh great okay, so we have tamika map. Can we unmute she's, ready, hi? How you guys doing? I just have a quick question for the providers. What are the criteria for provider to apply to become a provider? Do they need warrants or they just need the child care license? That's a great question. Tamika and I'll also turn to jan and admit if she wants to add anything here. The request for information outlines a lot of questions about your experience, working with children, your organization's staffing, whether you have site control over a space, we're also taking people who want to apply because they just have space or people who want to apply because they're just able to do the service, and we have a classic responsibility, determination that providers go through in order to get to the contract process if you're a new contractor to DYCD. You will also have a final interview around with some basic questions again about your experience. Working with young people, you don't you're not required, actually to have the license at the time of applying. Certainly that will get you moving more quickly, but we're also willing to partner with department of health and ocfs and move those license processes along if the if the school-aged child care is something that's new to you. I don't know if my colleagues want to add anything to that very good jenna great just trying to thanks and motions. No, I just want to jump onto what susan said thanks susan and thanks to the community board as council member mentioned, I live in this district, so I'm delighted to be here: nyc.gov backslash passport, there's a more detailed link in the chat box, but tamika and any other provider that is here this evening and actually any business that has space interested in learning. More about learning, bridges is invited to come to passportnyc.gov backslash passport. That's a one-stop shop for learning more about the city's online procurement platform or in more simple speak. It's the place where you can learn about opportunities to do business with the city most significantly for this evening about learning bridges, so you create an account and jump in and there are. There are the questions that susan mentioned in the platform. You can fill them out. You can ask questions of DYCD in the platform while you're doing it and the process is completely digital and we encourage you know all businesses that are interested in learning more to come into the system and see what opportunities are there. Susan mentioned at space, as well as child care opportunities. Thank you very much. Are any members of the public? Are there questions from any other members of the public? Well, I have somebody who just chatted me but motoko. If you don't mind raising your hand and just verbalizing the question, otherwise I don't see any more questions. Are there any questions from the community board? Trisha, sharma moore? I thank you for the presentation tonight. I had a couple questions about the program at Stanley, isaacs and then a couple other broader questions. My first was just if you could talk to us a little bit about what the capacity is at Stanley isaacs, how it's been going who's been in those seats. Are they put people from primarily, I hope, isaacs and homes or is it? Is it around the city just curious? If you could tell us a little bit more about the program, that's in our district and then I have a second question. You know. I appreciate that question. I think we're planned to serve. I'm gonna check this while others are talking. Maybe I'll drop it in the chat as many as 60 young people at that site. I don't have the details about this week and you know what young people were matched specifically to that site. I'm gonna see if I can also like dig up additional details there and I'll drop it into the chat yeah and we I can just add to we are in the process and please susan or elizabeth or jen correct me. We are in the process of working with all providers to get a standard system where, on a weekly, you know bi-weekly basis, we're getting information from them on the students in the program in terms of enrollment and things like that. So that is a process that we're working to standardize across the various programs. Can I just follow up on trisha's question I'd like a little more information about this program at Stanley isaacs, so are 60 people being served now, 60 young people being served now or that's in the future, or what at? What time frame? Are we talking about? That's a good question. I mean we have so we've we're in contract with Stanley Isaac for those seats, and the next steps in that that have probably already happened is that across all of our you know, two to three hundred learning lab sites that are in operations already is that young people, families who have applied through the DOE portal, who go to certain schools or live in certain sites, would be matched to a learning labs program so match to Stanley isaacs, Stanley isaacs would get a roster of those families and students that have applied and be encouraged to do outreach to the families as they are also connecting with Stanley isaacs, to kind of complete those processes and fill out. You know emergency contact, information and kind of finalize the enrollment process. All of that is ongoing like day to day throughout, and so that's the best we have in terms of details right now is that Stanley isaacs would have gotten a roster of applicants, especially noting the priority applicants that elizabeth outlined and they would be- and we're going to keep following that process through until those seats are filled. So we would keep you know, communicating interest and interest that connects with the schools or sites that are matched with Stanley isaacs until that site is completely filled. Part of the reason it's a process is well, it's not an open door, necessarily, as I mentioned, because of our trying to cohort for safety the stable groups. At the same time, every young person that comes in has an individualized. You know schedule all young people in the learning labs programs are going to be participating in blended learning, so our programs need to connect with the family and understand a little bit about more about the young person comes in, most importantly, which days do you need the service? And how do we schedule you into those days and we'll keep continuing that on a rolling basis, peggy and guilty? Can I ask my second question? Yes, nothing, yes yeah. So my second question is about is about child care before three years old, although I appreciate everything that the city is doing for 3k and this program seems like a real, a real service to so many families. Child care concerns don't start at three. They start at for me three weeks. That's all I got in terms of maternity leave and that's all a lot of people get and council member kalos is absolutely right. It's, I would love to know of a 30 000 program, a child care program in our neighborhood, because I've only seen 35 to 50.. It's really debilitatingly scary. To think that you have to choose between your job and taking care of your kid and I'm just curious, so many families with young children before the age of three who are suffering and trying to figure out what to do with their jobs. Has the city thought about any sort of child care program for those young families? I appreciate the question trisha it's you know. We heard the council member also bring it up. It's something we hear a lot. You know throughout the city. I don't have kids yet, but my husband and I we discuss it and we discuss how expensive child care is. We will definitely keep working with and communicating with and letting the broader child care group back at the agencies. Do we you know your feedback and thoughts? I don't think we have the right group here unless I don't think we have the full group to give you to really engage you on this topic. You know pre-learning bridges page, so we will definitely take it back and we'll continue to communicate with the broader child care groups, policy and operations. Folks at the DOE and shannon I'm almost happy to jump in here a little bit as well. I think this is an incredibly important concern, I'm with the division of early childhood by the way- and we would we would love to have you know more opportunities, particularly for families with young children. I know what we what we do have and what is part of our portfolio is family child care settings. So that's sort of care provided through a network of home-based providers and those opportunities are certainly out there. They are in general means tested. Programs, so would have to folks would have to qualify based on a certain income threshold. So obviously, that's not an opportunity for everyone and we wish it were, but that is certainly out there and happy to provide the board with some information about where those slots are and how you how you might be able to enroll in them. So I mean yeah. I think that whatever information you guys can provide is great, maybe something that the committee can think about doing in terms of providing just highlighting some opportunities that are out there from what I've learned from other families- and this is all anecdotal, but from other friends of ours who also have small children- it's not even worse than it was before, and I think before we're only taking care of like 10 of our kids or something like that right now, with child care facilities, small shrinking their size, classroom sizes for obvious safety reasons. It's it just seems that, like this is, this is a luxury that nobody can really achieve, and- and that's where I'm getting. You know personally concerned and also concerned, for you know when we talk about keeping families in our city, I don't see how this happened. How we do this without child care, we agree, tricia. I think we will definitely. You know, look into that, and I see that council member kaylos has his hand raised. Perhaps he wants to add something absolutely so I just want to thank trisha for highlighting it. We both got the small kids just to add on to what folks have shared administration for children services, and I don't believe we have them on the call administers early, learn NYC. You can learn more at accessnyc.gov programs. Early, learn dash child care. It's been pasted into the chat that is means tested, a family of three would be 46 692 dollars, and so it is free and or on a sliding scale. It also includes child care vouchers, and that is for families, starting with as young as six weeks. And that being said, I I'm completely with you in terms of trying to get to child's care for everybody. I want to see integration across all of our programs throughout education, both racially socioeconomically, and that means having everyone of every income and that's one of the beauties of pre-k, and so one of the things about pre-k is it's actually federally funded in part and state funded in another part, and so when we did the 4k as I as it now, I guess some of us call. I knew that mayor de Blasio was looking at 3k, because I knew that three-year-olds were also federally covered and we needed to we're still not getting the real state contribution. I do see we have a state committee member to make a map on the call. So hopefully she can help us with advocacy on the state committee level as it were, but I think that everything you said is correct and I think for me, I've just been focused on four years old, three years old, and I think everyone knows that I'm planning to continue down. As far as I can- and I also know that I don't know- michael stinson is still on the call, but controller stringer has been pushing for NYC under three. I wanted to put in just two quick questions. First question and I wrote a law on this. I'm hoping I can just give it without having to go through the reporting process. Do you happen to know how many folks, from community board 8 have applied for learning bridges just so we can gauge what our mission is, as elected officials and community board is to make those seats available and find them we. I do not have that on hand right now and we'll have to take that back. Unfortunately, don't have that to share with you if you can share it with us, it's it just it helps us know. So if we got if we got 10 applicants and they're all going to be served by isaacs, that's great. If we got a thousand, then we need to know exactly what we're working towards a thousand applicants might mean. We only need 500 seats, so I think that's one piece, and so I think you state committee member map already asked a little bit about it. So and I mentioned some sites, but I already know some of the answers. If I am on this call- or I'm watching the recording later- and I I'm in a co-op with an empty space or a condo with an empty space or I'm a landlord with an empty space, because we have so such a blind of empty storefronts, what type of space is ideal? What's the minimum? What's? Is there a maximum? So what's the minimum space that would be safe for this and are you open to with pre-k? Sometimes the city will operate a location, so will the city come in and retrofit and take over a location if we have- and we can deal do a deal with the city or is it only with providers? So two questions: what type of space is the minimum and who can occupy it and run it I'll get started? I'm gonna try to reference the rfi again like as we're talking a little further, but the school-age child care regulations outline like the minimum space specification. You've got to have minimum square foot for young people. Certain number of bathrooms you've got to have many different safety stipulations around. You know what the space looks like and fire and ventilation and those kinds of things, so I think some of that might be outlined in the in the rfi that jen referenced in passport. It's certainly part of the school-age child care regulations, and I don't you know I don't have all the details on that space, but to put just like kind of broad strokes on it is you know a safe place for young people to be socially distanced to be able to eat their meals, participate in activities. A welcoming environment that you know facilitates learning with broadband or you know, with wi-fi capability. Those are kind of the big picture: basics we're looking for on space department of using community development. We don't provide any services directly we're going to be contracting all of that programming through providers. We won't be doing any direct service provision of these learning labs, but we have an amazing footprint across the city of community-based organizations and they've really been incredible. Stepping up at this time to meet the needs, even despite these extraordinary challenges. So we're going to continue to build off of that network for this k-8 services and just a poll from the rfei which the link is on there for an early childhood space. The minimum is two classrooms with a minimum of 450 square feet per classroom with open floor space and sinks with warm running water and one toilet for every 15 students for the learning lab space. It is 35 square feet for each child and I believe there is a a toilet requirement of at least one toilet and wash basin for average 20 children just as loose guidelines, there's a lot more in there, but I think those are the minimum square footage that we're talking about. If that is correct, appreciate that, thank you. Are there other questions I did. I did connect with motoko, so she was ready to ask her question whenever council member kayla's was done hello, hi first, I wanted to say thank you so much for you know everybody's hard work for doing this. I have two kids, fourth grader in pre-k, and so I'm wondering so it seems it sounds like the early childhood and the k to eight are separate centers. Are there other, like centers, that offers for both? That's the only question I have, I think elizabeth, I think. For the most part, all of our programs are in separate locations. If we cross-reference there might be some co-location, but for the most part, we're looking for spaces that are appropriate for those different age groups and the programs are operating in separate spaces yeah season, I think that's correct and that's some somewhat to do with the fact that we already have a strong network of contracted pre-k and 3k providers just out there in the world and so are working with those folks. First and as susan said, you know standing up these brand new learning labs in other places, there's also a bit of a bit of a distinction between the sort of license requirements for what's required to serve kids under five and over five. So that's a little bit of a of a distinction. There too, thank you is trisha. Should I have another question yeah sorry, I have a lot of questions unless you have one just thinking about what you had said about Stanley isaacs and about how you basically give you would give I Stanley isaacs a list or give whatever the provider is a list of recommended applicants and ultimately they decide I'm wondering about oversight of this and how the city is planning on ensuring that a provider doesn't give all of their seats. To I don't know people to people who they presume can pay versus people who can't afford to pay or people who they want to have as long term clients of theirs and ultimately it becomes something where, because the city doesn't have enough oversight in this, it's and there's only a limited amount of seats. We ultimately give all those seats to some and leave others behind you do. I am yeah. Those are really good and really important questions. We're absolutely controlling for that. No one in a DYCD, funded program of any type should ever be paying a fee. There are a hundred percent free programs, and very rarely we do hear reports where a fee based part of a program would be blended, and that is absolutely forbidden. You risk your contract, so on top of that, the initial school match for Stanley isaacs is ps 198 we are so we would be starting there and we'd possibly be expanding the match. Schools to that site, depending on the enrollment, as we mentioned, the rosters that go over are noting priority families. Every one of those families must be contacted to enroll in a program. There really isn't discretion to the to the point that you're talking about it's. The communication and enrollment process that I talked about is about just getting to know the child and getting the important information about. You know. Safety for the child, like I said, pick up emergency contacts and then enrolling the child in if there were a barrier to that, would have to be communicated back, and I guess my other piece to this is I'm so many families who may have been doing okay before are now struggling with things like food insecurity or they've, or income insecurity or health care issues, and I'm wondering to the degree that, when you guys are doing this outreach to those families who are asking how much you're, intersecting or integrating other services, or at least helping helping. You know check in with these families that I I've not talked to one family who's, doing who would say that they're doing well, you know at this point I've not one has told me that they're happier thriving or in a in a good place. Most of the families. I've spoken to are have received some sort of pay cut of some kind or are dealing with a lot of mental health services, they're dealing with a lot of food issues and others. So I'm curious about, if there's any sort of like also just other service like direction of services for these families, a hundred percent. Yes, those are excellent points. You know, we've been working like clear, easy to ramp up the child care component of this, but one of the benefits of like elizabeth mentioned building off of our current contractors. Stanley isaacs, is a great example of this. As a comprehensive community-based organization, they've been providing food and essential basic resources since March really to programs, many of the pro same providers that are offering these programs are able to attach families in need of whether it's like again social emotional support or basic needs connection to food, pantries jobs, programs, the benefit of us building off of this network of community-based organizations as many of those have those resources right within their own doors. It's not at that center to make an easy connection, and I would say, in this administration the emphasis on those connections on all of our contracts has been emphasized. You know more than ever before it's a priority for anyone. We fund that they, you know if they can't provide those services directly, that they can demonstrate that they know how to find those services for any of the families getting there other questions you have one from tamika. Yes, I just have a quick question for the provider side. I know that sometimes in the past some providers haven't been paid by the city on time. Are we ensuring that our providers is going to be paid on time when they open their child care up for this program? I think that's a great question and I will ask my colleagues to chime in, but just to get it started. You know once you have a contract with DYCD, for example, payment you know, reimbursement on your contract value, isn't something that takes a long period of time. I think when people talk about that they're talking about situations where we're trying to ramp up programs very quickly and the contracts you know once the contract is in motion registered, you won't hear a whole lot about payments. It's that initial stage of getting your contract registered one benefit of these emergency times is that I think we'll be able to register contracts, probably more quickly than you ever have before, and we're working on creative solutions to help our providers find ways to have cash flow even before these contracts are amended in some cases by creating some workarounds where they can possibly access their base contract value. Or you know we want to hear from anyone who's having trouble making payments, but we're certainly like attuned to a sense of urgency that and ramping up a program this quickly. I have a question I'd like to ask of susan. So if we don't know right now how many applicants there are for the 60 possible seats at Stanley isaacs? When would we know that, so we could plan to see what the need is. Do you have an idea when we could get that data yeah? I think we should give it a few days, maybe a week or so before we anticipate seeing like that data flowing centrally. I have every confidence that there are kids enrolled and participating this week, but, as I said, you know they're working out that enrollment processing families there might be a little bit of a lag time, but I think we should be able to get. You know. This was the first week just started for k-8 on the Stanley isaac's program in particular just starting this week within a within a couple weeks. I would say: maybe next week we'd be able to look at preliminary data and the other thing I was wondering so. We've been talking about means, tested and lower income families and serving that group. But you know people that are more sort of middle income, as tricia had said, lost their jobs. It seems as if they're not going to particularly get served and that's a lot of our community would be more of a middle income middle middle-class group. Is there any way that some seats in this under a thousand seat program could go to people who are not desperately poor, not on welfare, not struggling, but more middle class people who can't afford 35 to 50 000 a year for child care? Absolutely this program is not a mean tested program at all. I think elizabeth is making reference to seats for very young children through a different family program, but this is not a means-tested program. Our strategy for ensuring that the seats go first to the people who are most in need is identifying these priority populations that elizabeth outlined so making sure that they are able to get a foot in the door as the seats are ramping up. But we we're also looking at specific geographic areas for citing these programs up making sure those are areas of need, including for people who are working, families, essential workers, teachers, workers at community-based organizations like the ones that are running the programs. So we've established a strategy that helps to get those seats first to the people who are most in need, but everyone is able to apply for these child care seats at the website and anyone who's in need of the free child care service should go ahead and express their interest. That's great. I think that council, member kaylos had another question, or did you not actually wanted to provide an answer to the previous question, but I want to thank peggy for getting a cert date certain on when we'll have it, and I'm just going to ask: if will can paste the link for enrollment and if we can deputize everyone on the call to make sure we get this out to folks so that they know it exists, so we can make sure we can show the city that we can demonstrate need if folks don't apply. We can't build it's helpful to know that there's demands so that we can build for it and that's precisely how we got up to 1100 pre-k seats. I in terms of state committee member tamika maps, question regarding to on-time payments. I just wanted to say that when I became contracts committee chair last year on time, payment was something I prioritized. We worked very closely with jennifer geiling at mox and the rest of her team on getting people paid on time. So I will give my email address. I'm not sure if she will share theirs, but if you are having any trouble, if you know of any provider in the city of new york, who has a contract with the city any of the people with 17 billion dollars in contracts, thousands and thousands of people, they can email contracts at benkaylos.com and we will get them paid great. Thank you. Thank you for the I'm sorry to interrupt, but thanks for the invitation council member kalos, I'm happy to also provide the mox email address. We often co-team on this. So thanks for raising it. It's helpitmox.nyc.gov and I'll put it in the chat as well, and we've worked really closely with DYCD and DOE to realize more timely registration and also working closely with council member kalos in infusing our practices with technology, which also allows for more timely payments. So I'll put that in the chat, so you all have that too. Thank you so much and billy friedland. Do you have a question yeah thanks, gail and peggy? This has been really terrific panel and thanks everyone, who's asked questions. It's been really insightful. I just have one question for now, which is what is the message to someone who has to be at work at a certain time? Let's say 8 a.m. Around the time say, child care starts, they sort of seem faced with the choice between get your son or daughter to child care or get to work on time. What is your message that person? What recourse and options do they have? Well I'll start with that? You know what we really tried to do was look at. You know mirroring. These are extraordinary circumstances where you might have a kid enrolled in school who's only going to three days a week and has two days off at a minimum, we're trying to mirror what a student would have if they had a full five day schedule of school eight a.m. You know will, depending on how far people have to travel to their work. 8 a.m will meet the needs of many people who need to report in person to work and it won't meet the needs of every person, but I think we tried we tried to look at you know at you know. I don't want to use the word replacing, but you know providing a supplement to the blended learning plan with mirroring what a typical school day might look like in concept 8-3. I also you know. I want to add that, because you mentioned the earlier part of the day that sometimes families need care after 3 p.m, and learning bridges certainly only go from 8 to 3, but we also have many after-school programs in the district that will cover the 3-6 period, and so those baseline programs that DYCD has funded in your community remain and those can be accessed at learning more about those programs can be accessed at discover, DYCD, you can google discover DYCD and get the. Can. I drop a link in this chat and learn more about those programs. When someone applies for learning bridges, would you provide that information to them? Do you say, congratulations, you have a seat and also by the way here are after school programs in your district from three to six or are they sort of left to figure that out for themselves? And if so, is it possible to? You know, give some people more affirmative guidance once they are placed in learning bridges? Elizabeth, do you want to talk about the communications that go out once the family has gone into the portal? I know we're doing our best to keep in touch with family so that they know it's been received and that we're working on it yeah billy. I think your suggestion about sending folks a follow-up and making that connect with after school opportunities is a great suggestion. I'll take that back to the team, that's probably something we could easily integrate, but yeah when after a family has applied and the way that it sort of works on the DOE side, is we just we check to make sure that family is indeed enrolled in DOE schools and that they are enrolled in blended learning? That's sort of just like really the only two checks that we're doing sort of on our side. There's no other, like eligibility criteria, sort of beyond that, and if their school has a matched learning lab, they would get an offer from the DOE. They would get an email offer directly from the DOE. The application is online, but you don't definitely don't need to have an email address to fill it out. We'll give you a call if you don't submit an email address with that, so you'll get an offer as sites come online for the first time, you'll there'll be a sort of big batch of offers that go out to families and then, as sort of susan was referencing earlier after we send out that first big, batch and providers start to have those conversations with families about what days they'll need care. They then might have a wait list of other interested families that they could keep calling off of. So it's sort of it's a little bit of a difference between how we do our regular 3k through 12 admissions, and that we do. We do a big batch centrally first and then we because this is like a really. This can be a really granular conversation with families about what particular days they're going to need care wanted to give providers some flexibility to round out the remainder of their seats just in conversation with families, so that may be more detailed than you wanted, but that's sort of how it's working on our side great. Thank you. I believe that the the great team from the city- they were gonna, say until 7 30, but they did ask if there's a last call so any one last question for them before they before they all have to run and go to another meeting. It doesn't look like it and, if you're thinking of the last question as we're as we're dropping in email addresses, I would also plug that we have learning bridges at schools.nyc.gov, there's a few, a few of us who are in there all the time getting back to families on a sort of one-off basis. So, if folks submitted an application and have a question or have a question as after you leave this meeting, please feel free and we'll get back to you within a day on any of those questions that you submit there. Thank you very much for all your information for sharing your time with us tonight. It's been very helpful for us and for the families in this community. So thank you and I'm sure we'll be back in touch to talk about this and more with you, we're very appreciative and we'd love to keep the dialogue going, so anything also that you may need from us, please feel free to reach out so that we can have continue to have two-way communication. Thank you again. Thank you. So much thank you for having us I'm just going to meet our chair, who I think she may want to say. Thank you as well. I do I just want. I want to thank to say thank you for all the rest of the city. The information that you have is so crucial to families who want to stay in new york and help their kids get an early start on education, and thank you to gal and peggy for organizing and putting together such an essential program. Thank you, and you know the members of the community board here stick around please. We want to discuss a possible resolution. Thank you. Thank you. Thank you. Take care. Bye-Bye hello, community board, members, hello, it seems to me and to gail that we're going to need some kind of a resolution. We want to really beef up the options available to people in our community and apparently it doesn't have to be people who are, you know just for people below the poverty line. So you know why don't we see what we can do for the community at large here? Obviously, we know that there's a need for more than 60 seats. Maybe people in the community really haven't applied or don't know about this program or know how to apply for this program. So it seems as if that we need more for our community than just 60 seats. To start so, does anybody want to trisha has her hand up trisha yeah? I mean, I think that in general, just on my like first reflections on all this, I think that it it's great to have the 60 seats and I think that any sort of resolution- although I don't think I'm putting one forward at this moment- should commend the city for taking for taking this on and recognizing that the difficult moment that families across the city are in right now. I don't think that 66 seats is at all adequate for the number of families who are struggling. I also am just I'm always going to beat this drum, but I really think that we that the city needs to start thinking about the families that families of children who are under the age of three there are no supports relatively none no supports for these families. I don't know how a family of three that can live off of forty six thousand dollars or forty five thousand dollars to qualify for these other programs and and be in the city. So I would guarantee you that the vast majority of people in this district won't qualify for the thing for that singular program that could be there and so they're stuck struggling here. So I think that whatever kind of resolution we put forward, we certainly call for more seats. We certainly call for to billy's point, I think, the pairing of of after school services. The other thing that kills me is that, like we think, a full day is like eight to three when, like zero people actually work eight to three, it's much, it's obviously much longer than that. So we make sure that we pair additional services with with any sort of provision of seats so that we are actually giving comprehensive child care. When we when we're, if we're saying child care, it should be comprehensive child care and then secondly, I think that we really need to calm the city to pay attention to those young families in our district and across New York City, who are struggling with zero options, and you know those are you see. I I've seen countless articles new york times, seeing it like every news outlet talking about how. Ultimately this is going to hurt women. It's going to take we've already seen it. We've already seen a drop right before the pandemic. We saw that women were actually for the first time since the great recession feeling and taking being employed at a slightly higher percentage than men and we've already seen it drop two percentage points. You see articles time and time again with women with young children saying that, ultimately, they have to leave the workforce because they just can't do it. So this is as much as a taking care of families issue as it is in gender equity issue, and so whatever we do. I think that we should also put in something for that makes sense, billy your thoughts yeah. I agree with everything. Trisha just said, and I would also add you know she asked. The excellent question about you know loses any sort of preference for the seats at isaacs, and I think that would be an important point to put in any sort of resolution which I would also support. If someone wants to propose one so yeah, I echo everything. Trisha said: I think that all belongs in a resolution. I think we definitely need more seats and I think we need to look at this through an equity lens and think about. You know families, particularly those in you know, in our community district, that at homes in isaac's, and you know a lot of the families you know in roosevelt island we've got a lot of families. Of course you know section eight families who I think you know for whom there ought to be a preference. You know when we think about who gets these seats. So you know I don't know whether folks agree that those things those points are appropriate for the resolution. But that's what I would like to see if someone wants to propose one. Does somebody have a resolution they'd like to propose, or we could suggest some language? My own thought is that, given that a lot of our communities have moderate income struggle is terrible for them too, they can't live if they can't keep their job there's just it won't be enough income. So I think we have to help not only the people who are truly poor, but much of our community, that is more moderate income and it's a larger number than 60 seats. That's for sure, and so it seems like what we need to call for is a whole lot more seats. Be able to have some of them for people that are moderate income, so they can go to work, can always prioritize the seats for people who are lower income. But by asking for a significant, larger number of seats, then we do reach that population, because what tricia said is so true: how much do you have to earn to be able to pay 35 000 to 50 000, just for your child care? You've got to pay for rent and food and everything else and to force a parent, and usually it is the woman out of the workforce in order to do that is really a tragedy at this point in time trisha. I know you wanted to add something. I just wanted to suggest that, if you that just calling for some of the seats to be reserved for in community board eight- or it like or just to say that that's at least some of the succeeds should be- should be kept within this community board. I think that helps a deal with some of those that it makes it so that we prioritize the neighbors in our in our community, regardless of where they are income wise. To do that, you still, you still allow for those priorities to be separate, but it, but then it works in that year, you're just making sure that they are that some at least some of the seats are are dedicated to this community board and I think that's a nice way of of making sure that some of them, regardless of and you know, regardless of income, stay in this community board, and I still think that all those other priorities of of those who who are dealing with extreme poverty, those who are essential workers- you know that still can be baked in as long as they. You know, as long as you have some going to our community district good point, go ahead. Peggy, it seems to me. Maybe we could decide on some sort of numbers that we think what the numbers we get may depend on. Whether or not people provide facilities. I mean there's the facility of Stanley Isaac. We need more facilities to begin with, but that's more the city's job in not the community board. Maybe we should, for starters, think of a number if okay, so we've got 60 seats, Stanley isaacs. For starters, we obviously need double that and we, as a community board, can do more outreach and provide more information to people who probably aren't aware of this, offering at all or how you even apply, but for sure we ought to have some kind of a goal, maybe double the 60, maybe so yeah. I would peggy just I'm sorry to interrupt you, but to suggest something- and maybe this is me putting forward a resolution, but I would, I would say, call for resolution that supports the creation of the learning bridges program. However, and thanks the whatever the city for recognizing the difficult position that our all families are facing at this moment, but to also say that 60 seats, without even having the data in front of us, the 60 seats we understand is not adequate and to call for the establishment of additional facilities in our district, with at least that takes on takes on a population of at least 50 percent of students of children benefit coming from community board. Eight yeah that sounds good, so just to clarify so 60 seats is not adequate. We need additional facilities, but can we would you recommend something to at least bring the number up of seats up to x number by the end of the year or some other thing? So we could be specific. This is this is completely from a personal perspective, so I defer to the whole group, but generally, I think it's harder to walk. I think it's fairly difficult to walk anywhere further than 10 blocks with a young child, so I would generally say if there's one at Stanley isaacs and looking at the rest of our district, we should probably have four or five more, because that would cover the rest of our district, and I generally think it's it. Ten blocks is my max with my son, so I think it's like generally. We should have four or five four or five facilities, but that's my own person. I have like that's obviously no science behind that, but I defer to the group of whether or not they want to put a number to it actually trisha. There is a science in the sense that child psychologists will say that they don't think that a child, particularly if they're, three and they're walking, should have to walk more than six plus blocks to get to nursery school or any facility that it just becomes too much of a of a trial for them if they're actually walking. So I think your point is well taken. You know to try to look at perhaps five different locations, and maybe we don't say double the number, but if we know that you know, we state that the 60 seats that are in Stanley isaacs are not yet adequate, but we think that we need a minimum of five sites in the district. Then that speaks to what ideally the numbers would be, because it would be 60 times five. Now, whether or not you know that would be doable, we understand the challenges, but at least I think that we should go on record, asking for more and trying to be realistic and, as peggy says, if we can help with the outreach to find other sites and be creative, then right now, as they're looking for sites, I think it's an ideal opportunity for the community board to actually help yeah. The other alternative is if they are basing a base on the site, based on like they're trying to keep the kids together who are going to the same school. You could say that we want as many early bridges learning bridges programs as we have schools in the district, which is obviously even more than that, but then that's the argument that they were saying that they should keep them all together. So why not have one for school so that for kids, who have to like to completely shape that for as many schools we have in the district, we should have learning bridges programs so that we keep everybody safe. We provide a like an alternative location for every school and that's that should be the standard even more than that. Obviously, but that's the other, that's the other, you know and then, if you have more programs, then you don't have to have bigger facilities. You can have smaller facilities. You could have as ben caleb's actually recommended. You could use store empty storefronts. You could do you know based on whatever size and whatever, but that's the other option. Okay, so alita had a question or comment. I do first, we could certainly e-blast out what you would like gail if you and peggy could draft something, if, as outreach for people for these programs, we could send that out so that people may be aware of that, and we could certainly call on the elected officials. I know ben was here, so he will, but we could call on the others to include it in their newsletters. I'd also like to ask, maybe not so much for the resolution, but maybe the, whereas clauses that we include reference to people of moderate income recognizing that essential workers change right now. I would say that teachers could be fairly considered essential workers they might not have been in the summer so that it's a recognition of all of the people of less wealthy income and especially if you're talking about zero dollars to 50 000, there's a huge gap of in terms of costs that it's kind of crazy. To think that someone on a teacher's salary, a nurse's salary, a firefighter salary, can afford that. So to recognize that the seat should it should be for people of various income levels and and also to recognize the importance of keeping women in the workforce. I think these things should be stated explicitly, so our rationale is clear and in terms of numbers I say, don't negotiate against ourselves and ask for something: that's not crazy pie in the sky, but maybe more than their than they would come up with themselves, so that it just shows how seriously everything is needed. I know that there are obviously significant financial troubles in the city, but that applies all the way down, as trisha pointed out. So thank you. Thank you. So far with the resolution that we have a thank you, but 60 seats is not enough. We would like, potentially, by the end of the year four to five more sites that would accommodate different numbers of children but closer to their home. Is there more to the resolution that people would like to contribute? Rebecca dan gore has some input rebecca hi. I think we should follow up with what ben asked, which was how many families filled out the survey to express interest. I would like to see that number and possibly include that in the resolution, whether it be brought forth in a friendly amendment at the full board meeting, or we accept to include that number now. You know, whereas x number of people, something like that, because yeah that will just especially including as of x date because more and more will apply, but the number 60 looks way smaller when it's next to a larger number of people requesting. So I think that's important yeah. Would it work for you that it would be a warehouse clause yeah, of course, good? Okay, alita thanks. I'd, also like to add that the city call on developers to provide space, particularly if they're, unsold or unrented units in their buildings, they're still continuing to build very tall buildings, and it doesn't look like everything is being sold or rented necessarily or to use the commercial space. I know there are all kinds of financial issues, but if the city makes an affirmative effort to try and enlist developers in this, maybe something good could come of it, especially if they could get some kind of beneficial rate from it. They want to be members of the community. Let them put their money where their mouth is so to speak. So I would maybe I don't know if that's appropriate or not, but I just think the city should be actively pursuing space, because that's a lot of a cost. Thank you, yeah. I think we should include it in the resolution either the main body of it or as a be it further resolved. I agree. Billy you had something else to say. I do, unfortunately, so I just wasn't sure if we're still trying to land on a number to request, but you know something maybe more proportional to our population out of New York City, so whether it's the population of children of a certain age or the overall population, just to take the latter as a quick example, if it's 200 or 210 000 people in our community district out of eight and a half million, that's you know two and a half percent and there's a hundred thousand seats in learning ridge. As I understand it, you know that would come out to something like 2 400 seats. That's just an example, but we could either give a concrete number or we could say in the resolution. We request an increase of seats proportional to our population, and then I leave it to the committee whether we want to say our population as a whole or a population of children, of a certain age who would need child care, but I think that would at least give us something more concrete to demand. So I thought I'd suggest that so our population in the cba district is 200. Is what I'm saying in 19 000 219? Thank you 220, it's you're 219 at 920.. Well, it would be good to be able to figure out just of that number how many would be of the age where they'd be eligible to be considered as part of the program. So we do have a lot of I'm sorry to interrupt, but we do have a lot of seniors in cb-8. Well, I know we absolutely that's why I'm thinking if we could at least have more of a handle on the population and the different age groups, because I think billy's on the right track, but rather than just say a particular percentage of the overall city population to be able to hone in to the number of young children whatever that percentage ends up being will probably knows and again I'm sorry for interrupting, but the city council members might have the specific demographics at least the DOE. Would this population would be three-year-olds to eighth grade people? I would just say school-aged children, which is, I think, generally, I think that's better yeah. We can do that hi lori. Do you have some comments? Yeah? I just wanted to say one quick thing, which is that I was actually surprised to learn that the upper east side does not have among the higher populations of school-aged children. So I would, I would advise against using that verbiage. You know I mean I think you should. You should use the overall population, because that seems to make sense, but I think that there are places that have there are communities that have many more children. So that's not going to be to our advantage. So that's it! That's all I wanted to say thanks. Trisha only wanted to say that I agree with with billy's point of changing the changing the number to be a proportional to whatever we ultimately decide. I don't mind, but I think that that's a more reasonable request than my very unscientific four to five. Well, what we can do is we can look at what the child age population is versus the total population and whichever is able to make a stronger case, that's the percentage that we can then go with great okay, peggy. Well, yeah is it? Do we want to vote on this, though we haven't fully decided on what numbers we're going to use other than the 60 seats. Do we want to vote on the general idea that it we're going to call for a lot more seats, hopefully starting anytime before the end of the year and with a either a whereas or a be it further resolved that the city call on developers to provide space in buildings? Should we vote on that resolution? That, or does anybody want to add to the resolution yeah? I just think that after hearing you say it peggy. I think that, though, that the developer piece, I think it sounds better if it's if it's aware of- and we should encourage the city to look elita respectfully unless you disagree, but I think that it sounds better if we say as aware as and that we also encourage the city to look at all creative and innovative solutions for for spaces for this, and we can say especially under our developed spaces that are currently in development or what not, but you know, and also empty storefronts or other ways, and I also think that if there is going to be a second, where a second be it further resolved, I would like us to say that the city should look into additional opportunities for younger for young children to be cared for childcare for young children and keep both resolutions focused on the child care piece to it. One we need more seats and two. We need additional options for young families with children, ages, 0-3, good point, elita. No, that's fine! However, you want to to work with the idea of space as long as it's creative and as long as we're recognizing that there might be a lot of empty space opportunities in addition to storefronts, I'm wondering if we should echo the idea of monitoring, what's going on with with vendors and oversight for the preschools, that or if it's in the purview to just reinforce the idea of adequate vetting and adequate, because with pressure to engage vendors and contract with them, not everyone is on the up and up and not everyone is experienced, and I just I so I don't know. I guess I'm just raising it, which has nothing to do with the number of seats, but just more has to do with the quality of what's going on, because part of it is for people to trust everything and it's hard for people to leave their little kids in daycare. And it's one thing if it's a city system and it's another if people are privately contracted. So I don't know so ask me the thought: can I say something I think: can we hold off on that and just keep a focused resolution. It seems like with sure yeah I'm sorry, I'm sorry for bringing it up. It's just how I think so. Forgive me thank you. So do we want to vote on this resolution? I second thank you all in favor. Anybody opposed well raise your hand if you're voting no need to abstain or need to not vote for cause and then peggy. If you don't mind, reading the list of the board members into the record yeah, so, okay, lori, boris gail, barron, trisha, shimamura, billy, friedland, elita camp, rebecca dangor, peter patch, sandrea coleman. Me, I think, that's it right rebecca did you did we miss somebody? I said rebecca dangler. Was there another rebecca, we missed kaina. She has left the meeting. Oh, she left never mind. Okay, sorry, yeah! So that's the list and it looks like it's unanimous. That's the way. It looks no raised hands. Well, good, all right! So, oh is there anything else to be mentioned now that everybody have dinner? Okay, any motion to adjourn there's a motion to adjourn motion to adjourn a second okay, so we're adjourned. Thank you everyone. We really thank you for all your input. Thank you for a great meeting you guys. Thank you very much. Thank you. Welcome take care all bye, great job.",
            "summary": "Gail barron, I'm, the co-chair of the women and families committee of cb8, along with peggy price, and tonight we're going to have our meeting center around the urgent need for child care in our district.\nWe know how critical the need is for both affordable and quality child care, and we're very excited to be able to have our speakers tonight, because we're interested in finding out what kind of child care facilities are in essence, funded by or At least, the funding is assisted by the city of new york and if any of those facilities are in our district and we're also very excited to get an update from representatives from the city on mayor de blasio's program of providing a hundred thousand child care seats for those students who are now the younger grades back in school and, of course, the challenges for parents who really need to have some place where their children are able to be taken care, of.\nTonight we have a stellar group of speakers to address the need for child care on the upper east side and the city's learning bridges program that hopefully addresses our community's need.\nAnd let's begin our program from hearing from our elected officials about the need for child care and what the learning bridges program will mean for our community.\nI really want to give a lot of credit to councilman kayla's for a second, because this has been an issue that he's been talking about in the city council in the district, even before I got to the city council, which is the need for good quality, early education programs in that breeze side, but also to have good child care services for new yorkers.\nAnd then you're going to hear from the agencies about the announcement on the mayor's proposal for childcare, child care, which is called the learning bridges program, which was just started and was announced a few weeks ago, which is basically a new program to provide child care options for children, 3 decay, 3 3k, through 8th grade for days when they're scheduled for remote learning and that's obviously makes a lot of sense.\nWe really needed an opportunity to be able to help out with child care for lots of the working parents here in the city, and it was announced a few weeks ago and just launched.\nWe just launched, and it's essentially meant to be operated by community based organizations and partners to provide opportunities to connect us children with their remote learning activities, which could be including art and recreation activities and other age-appropriate appropriate activities, including, and also, of course, including meals and snacks, for free at all.\nAt the same, you know, while you're doing your remote learning- They've, been working with the district, 75 principals and families to make sure that there's also supportive placement for children in the in the program, and now that we have sort of learning off the ground in the last couple of days, we're going to be able to see sort of the effectiveness of the program and how it will be able to support.\nI think, along with councilman, chaos, is to expand child care options for parents and families in the city into the long term.\nI want to say thank you to all our folks in the city, agencies for the work, they're doing I , think it's a really great topic and a really important time.\nAnd I'll, just say, like pre-k, has been important to me, particularly in pre-k and child care, because when I started running in 2012, even before I was married and before, like the idea of being a parent, was in my eye when I talked to people who I grew up with in the neighborhood.\nSo I think, as you also know, as a community board, which I would love to have official support, on, but I've gone to every developer in the city, including extel, to say.\nI want to thank this committee for looking at this important issue and I will be doing everything in my power to get child's care, I'm, starting to come to terms that I may not get 3k by the time.\nWe have had an application portal open on the department of education website and anyone who you know who might be interested It's very important to send them like the first step, would be going to schools.nyc.gov learning bridges and inputting your expression of interest.\nI just want to say this was mentioned, too, that we are 100 following all the safety protocols of New York, City, department of health, new york, state office of children, family services, working in conjunction with with department of education and those safety protocols and for short, we're calling our safety measures a high five We've got wearing masks and participating in daily health.\nSusan gave a great overview as the council members, as we said, but I just want to add that we are also giving priority for these seats to a few different groups who we know really need this service.\nWe don't want to accommodate every single person who needs the service, but we are sort of giving first shot at the at the seats to those groups of families and that list That list of who's being prioritized Is also on the DOE website.\nThe request for information outlines a lot of questions about your experience, working with children, your organization's staffing, whether you have site control over a space, we're also taking people who want to apply because they just have space or people who want to apply because they're just able to do the service, and we have a classic responsibility, determination that providers go through in order to get to the contract process.\nWorking with young people, you don't That will get you moving more quickly, but we're also willing to partner with department of health and ocfs and move those license processes along if the if the school-aged child care is something that's new to you.\nNo, I just want to jump onto what susan said thanks susan and thanks to the community board as council member mentioned, I live in this district, so I'm delighted to be here, Nyc.gov, backslash passport, there's a more detailed link in the chat box, but tamika and any other provider that is here this evening and actually any business that has space interested in learning.\nWe're in contract with Stanley Isaac for those seats, and the next steps in that that have probably already happened is that across all of our you know, two to three hundred learning lab sites that are in operations already is that young people, families who have applied through the DOE portal, who go to certain schools or live in certain sites, would be matched to a learning labs program so match to Stanley.\nYou know schedule all young people in the learning labs programs are going to be participating in blended learning, so our programs need to connect with the family and understand a little bit about more about the young person comes in, most importantly, which days do you need the service?\nThe city thought about any sort of child care program for those young families?\nI think that, whatever information you guys can provide is great, maybe something that the committee can think about doing in terms of providing just highlighting some opportunities that are out there from what I've learned from other families- And I think before we're only taking care of like 10 of our kids or something like that right, now, with child care, facilities, small, shrinking their size, classroom sizes for obvious safety, reasons.\nIt's, certainly part of the school-age child care, regulations, and I You know I, don't have all the details on that space, but to put just like kind of broad strokes on it Is you know a safe place for young people to be socially distanced to be able to eat their meals, participate in activities.\nYou know they're working out that enrollment processing families there might be a little bit of a lag time, This was the first week just started for k-8 on the Stanley isaac's program in particular, just starting this week within a within a couple, weeks.\nWe we're also looking at specific geographic areas for citing these programs up making sure those are areas of need, including for people who are working, families, essential, workers, teachers, workers at community-based organizations like the ones that are running the programs.\nI, don't want to use the word replacing, but you know providing a supplement to the blended learning plan with mirroring what a typical school day might look like in concept.\nI want to add that, because you mentioned the earlier part of the day that sometimes families need care after 3, p.m, and learning bridges certainly only go from 8 to 3, but we also have many after-school programs in the district that will cover the 3-6 period, and so those baseline programs that DYCD has funded in your community remain and those can be accessed at learning more about those programs can be accessed at discover, DYCD.\nThe information that you have is so crucial to families who want to stay in new york and help their kids get an early start on education, and thank you to gal and peggy for organizing and putting together such an essential, program.\nOther thing that kills me is that, like we think, a full day is like eight to three when, like zero people actually work eight to three So. We make sure that we pair additional services with with any sort of provision of seats so that we are actually giving comprehensive child care.\nAnd we, as a community board, can do more outreach and provide more information to people who probably aren't aware of this, offering at all or how you even apply, but for sure we ought to have some kind of a goal, maybe double the 60, maybe Maybe this is me putting forward a resolution, but I would, I would say, call for resolution that supports the creation of the learning bridges, program.\nWe state that the 60 seats that are in Stanley isaacs are not yet adequate, but we think that we need a minimum of five sites in the district.\nIf we can help with the outreach to find other sites and be creative, then right now, as they're looking for sites, I, think it's an ideal opportunity for the community board to actually help The. Other alternative is if they are basing a base on the site, based on like they're, trying to keep the kids together, who are going to the same school.\nBut you know something maybe more proportional to our population out of New York City, so whether it's the population of children of a certain age or the overall population, just to take the latter as a quick, example, If, it's 200 or 210 000 people in our community district out of eight and a half million.\nWe request an increase of seats proportional to our population, and then I leave it to the committee, whether we want to say our population as a whole or a population of children, of a certain age who would need child care, but I think that would at least give us something more concrete to demand.\nWe want to vote on the general idea that it we're going to call for a lot more seats, hopefully starting anytime before the end of the year and with a either a whereas or a be It further resolved that the city call on developers to provide space in buildings?"
        }
    }
}