{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "title": "Parks & Cultural Affairs Committee",
            "publishDate": "2020-12-09",
            "shortDescription": "",
            "lengthSeconds": "2:31:00"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "eukVs_cjzPw",
            "fillerWordCount": {
                "uh": 327,
                "um": 382
            },
            "readTimeFullTranscript": "78 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "park": 71,
                "parks": 39,
                "history": 25,
                "names": 19,
                "land": 18,
                "chat": 17,
                "playground": 15,
                "nobles": 14,
                "organization": 12,
                "public": 12
            },
            "wordCountSummary": {
                "park": 21,
                "parks": 9,
                "land": 7,
                "names": 6,
                "history": 5,
                "suggestions": 4,
                "conversations": 3,
                "bridge": 3,
                "entrance": 3,
                "award": 3
            },
            "fullTranscript": "Okay, hi Sally: how are you I'm good? Just setting up give me one. Second, okay, c: hey Paola, hi Sally hi live. How are you setting up? Let me know if you need anything okay, it says we're live on YouTube trying to set that up. Yes, both live streams. I have to do a little bit in advance in case something happens. Give me one Sec got it okay, so I'll try not to have too much conversation about what I had for dinner. Thank you. Nima for your email, Daryl had sent that out. He was just kind of compiling a list of stuff he had seen on social media for the benefit of people who, like aren't necessarily on Facebook, so we try not to have conversations over email, because it's not public but I love. Your suggestion and I am can't wait well. I mean I am excited for that part of the conversation when you introduce that one to the mix I think it's going to be a robust conversation and I'm looking forward to it. I have many screens open, I feel like that guy at the Dnc who had all the computers you know. Okay, I'm gonna go grab a cup of tea in the next day, yeah we're gonna start. I'm gonna try to start the meeting on time, but we have you know three minutes and so yeah. If you're gonna grab a cup of tea, go do that in the kitchen it's a one minute: walk, okay, probably won't get into a lot of traffic between here in the kitchen. Okay, welcome to our attendees I see. We've got Matt Levy representing Senator Jackson. There are some folks who are on the attendees list and it's not really clear who they are because there's just like an initial or part of a name or some bit of code, that maps to their email address. So it's helpful if you have the ability to do it to change your name so that it's your name so that like, if you have your hand, raised I, can call on you by name, and it also makes it a little bit easier when we take our minutes and we have the attendance for people for us to be able to say who was there I also see in the attendee list, somebody named Ny1, so it seems we appear to have some media in the house. That's exciting! These meetings are public. They go out on our YouTube channel, so you know it's cool. If the press is covering it as well. Yeah we've got somebody named s. It would be great to know who that is, and we should be getting started in a couple of minutes. I'm vamping for time, while one of our members who has agreed to take minutes gets on the call, hello, Darryl, okay, I also want to. Let people know got it anonymous. Attendees says they can't figure out how to check their name or rename as an attendee on a webinar. Notwithstanding the fact that I did ask everybody to please change their name, if they can I, don't actually know how to do that. So, if you can't that's okay, just let us know who you are when you're called on excellent here comes nobles Crawford, our minute taker. Thank you. Nobles yep, hello to you got a haircut no last week. Okay, it's definitely different. All right! Daryl! You got them all cut. I! Think I, don't see you every week. That's true! That's a very good point! Daryl it's been a month got it. We've got greetings from people in the chat. Somebody is saying that you can as an attendee, sign out and then sign back in and when you, so that makes sense and when you sign in you can change your name the second time so just remove yourself from the call and then sign back in and when it asks for your name. Instead of putting in you know an initial or a name just put in your name, so it is 6:31. I'm going to call this meeting to order. Can we elevate our illustrious past full board? Chair no okay. I mean we could, but the people who are the panelists are the members of the committee and I tried Shaw yeah. We will welcome those who would like to speak to do so during that portion of the agenda and absolutely and they will have their. They will have themselves unmuted so that they can participate. Excuse me really quickly for sake of the attendance. Were there any excused absences tonight that you'd like me to record yes, Alexis Marnell is excused okay and I haven't heard from any of the other committee members so I will they will be here in the fullness of time. So I'd like to start with some welcome and opening remarks, and also a couple of housekeeping notes. So welcome everybody. This is the community board 12 parks and Cultural Affairs Committee. If you're here for a different meeting, I can't really help you with that. But this is the meeting that you're at and you are. We welcome all of you. We have one main item on the agenda this evening, which is a discussion about Bennett Park, which I think will be, which I'm really looking forward to devoting. Most of the meeting to that we have some other things to get to first and I would like to do that. I. Welcome you to throw questions into the chat to throw general greetings to other people. Those won't be. Greetings won't be addressed. If you have questions for Jennifer Hoppa who I who will be on the call later, you can put those up in the chat and the fact that we aren't addressing them yet does not mean we're ignoring you. It just means we're not at that part of the agenda yet so please don't feel slighted if we don't get to your question yet and resist the urge to ask it repeatedly, because you think we didn't see it so, questions about parks specifically will be directed to Jennifer. Who will be on the call later? We have our no our November resolution from last month's meeting regarding Amelia Gorman Park passed the full board. It was not unanimous, it was 38 in favor, none opposed. There was one abstention and one person not voting due to conflict, and that has been obviously sent along to the parks Department and the Public Design Commission. We do not have any update hello Jennifer. We do not have any update from Luis Ramos on his petition, a signature gathering for a street co-naming for Lenape Way adjacent to just gonna. If everybody could, please kill their audio because if there's background noise, it gets there's a little interference thanks. I leave that on the agenda, just as a reminder to check in periodically with him and I wanted for people to just hold that in the background, as they consider the parks renaming that we're going to be discussing later in the agenda in terms of oh this morning, very important got to start my day off right with a parks ribbon. Cutting we had the ribbon cutting for the adventure. Playground did I, get the name of that right, I, always confuse Jennifer, the adventure playground and the playground in Fort Washington Park. It's adventure, playground and sunken playground right. We opened today, yes and it's beautiful, oh my god, it's so beautiful. It was a just destroyed, wasteland of parks and now it's gorgeous with wonderful play, equipment and I got to test out the slide. It totally works. It's very cold. It's metal, but it was, you know, shout out to council member Rodriguez for his tremendous support in directing funds to the parks department, which is the bulk of what no most of that renovation was the anchor park from the mayor. Yes, so that was mayoral Money Council member Rodriguez is very generous to parks in other ways, but not that particular renovation, but it is beautiful. I encourage you all to go there, even though it's cold, we all need gross motor movement and to be outside and that's in high bridge park. That's in high bridge park along the entrance is that there are multiple entrances, but the main entrance is at like 164th street, across from the former state, elementary School and the correctional facility. It's beautiful. Take your kids. There there's an adult, workout area in it too excellent. Thank you. There was also a recent installation of a bird mosaic honchoed by Avi. Gitler I forget the name of the artist, but he is he's the one who's been working with the Audubon project. Those are all the birds that are painted on the sides of buildings. This is a mosaic installed. I want to say, 163rd streets, I, forget the exact location, but I think he sent me some pictures of it before it was installed. It's beautiful, I'm super excited, I, love this project and the way it just elevates Audubon's work and makes it incredibly public I think that's it in terms of announcements in terms of housekeeping I, think I've got that covered on the chat, and so without we had review of Inwood rezoning EDC Poa commitments. Thank you very much. I only was up until three o'clock in the morning. Looking at that document, which is why, of course, I forgot hold on so the inward rezoning. Sorry, it's going to look like I'm not paying attention, because I'm not looking into my camera. It's because I'm looking at my other screen, so the inward rezoning is a 39 document. The points of the Inwood NYC points of agreement signed August, 2nd 2018, is just making a note of the time for the minutes. Yep. It has 83 different items related to housing, schools, infrastructure, road infrastructure, small business and workforce community services, arts and culture and parks and recreation. So Wayne Benjamin, who is the land use chair, suggested that each committee should take a look at the Poa just to see where some of these things are and are there things where we want to nudge our respective agencies, along in terms of whatever commitments may have been made under the inward rezoning. So all of the board members should have received this document multiple times, both in 2018 and then at subsequent iterations, and then what I did last night was I pulled out just the parks, just the ones that are relevant to parks and cultural affairs and I will send that along to you after the meeting, because it's too many things to do at once, but items 26 through 38 and then items 69 through 72 and item 75 relate to this committee going in reverse order. Items 69, 70, 71 and 71 relate to the Urpa the immigration research center and performing arts facility, and there was an RFP for that and that's still being Natalie has that been awarded. Yet it has not because the reversal and then reinstatement of the zoning text amount of the amendment to the zoning text happened while that was in mediares got it. Thank you. So there was an RFP for it. There were a lot of people who applied there were lots of meetings around that and then for reasons that Natalie just described it's stalled. So I don't actually know what the status of that is. I, think it's pending and I. Think one of the things to keep in mind is that a lot of these commitments relied on. You know the whole economic landscape has been dramatically altered by Covid-19. So in the case of projects where shovels are already in the ground, those will continue and in the case of projects where ground has not yet been broken, they may get put on hold. So the erpa. It's not really clear what the status of that is. I can check in with EDC and find out if they've got any kind of an update for us same thing, with building a new, state-of-the-art library in Inwood and same thing, also with programming at the historic Audubon Ballroom. So funding for that is on hold the capital projects. There's the construction of the Sherman Creek Malaccan at Academy Street, that is Jennifer. That's on hold correct, okay, restoring you did a request for proposals for design firm, but it hasn't really advanced beyond that: okay, restoring the North Cove and creating a North Cove park again. That was totally linked to the construction of the massive building that was maybe going to go up, was on hold and now isn't done old, rebuilding monsignor Ket playground that is moving forward. It's in design. This committee saw a design approved a design and that's in the pipeline, and it's moving forward for OMB approvals to enable it to continue through the process. Okay, repair, waterfront infrastructure along the Harlem river from south of Dikeman Street to West 155th street. That was a design timeline to begin this fiscal year. I, don't believe any design has started on that and that's probably on hold correct, repairing waterfront structures near the Daiquin Pier, improve public access to Dikeman Pier and build a new dock. Similar timeline. There was capital funding, for it was supposed to start this year. Also put on hold Liz, there is a hand up I, don't know if it's about something you're currently talking about that's going to be a hand up from Dave Hunt who I believe is looking to speak to the Bennett Park issue, correct, putting hand up hands up on that already eh yeah, yes, Dave, okay! So again, as I announced a little bit earlier, we are definitely going to be taking lots of questions on that issue, but not until we get to that point in the agenda totally understood fantastic. Thank you so much so I'm actually going to lower that hand and okay and if we've got board members who aren't members of the committee. When we get to that item on the agenda, we can promote them to panelists as well. Excuse me, chair, may I, ask us something of our guests when it comes to secretarial duties, if you're here representing an organization, it would really help me out if you put your organization next to your name in zoom. So that way, when I'm taking the attendance here, which I'm doing I can at least put your organization in the minutes that you're representing thank you we're not sure if zoom allows you to change your name unless you sign off and sign back in. Oh that was covered because yeah you can, if you're a panelist I, do that all the time. But people who are on the phone, maybe can't got it. Thank you. It's all good, that's just it was a nice to have, but I don't know right, but no I have a question for nobles I, don't see a way for panelists to raise their hand correct. So there are a couple of downsides of the webinar format, one of which is panelists, can't raise their hand you're going to have to like physically raise your hand and wave it so that I detect movement in the screen, and it also means that panelists can answer the questions in the chat. But panelists can not put information up in the chat, so you're probably used to other zooms where you have a web link and you want to throw something in the chat. We can't do that right. It's a weird quirk of the webinar format. There are some advantages to the webinar format, but that is a disadvantage and Barbara. I'm just going to put you on mute because you got a little bit of background noise so going back to these capital items improve and enhance hybrid park through the anchor Park Initiative, and there are many projects related to that are in the pipeline, including the one on which we just had the ribbon cutting this morning, which was fantastic so that, fortunately, is moving along phase. One is either done or in process and phase two is in design phase two is done, phase two is done, that's where we were at today, except the public. Restroom and OMB has released that and so construction on the public restroom will advance now. Okay phase one is likely street to 181. thanks Sally I see your hand and what I'd really like to do is get through this part, and then I will take questions but I think if I take questions on each thing it's gonna take longer than it needs to reopen the high bridge water tower that is in design and is moving forward as a construction, renovate the dikeman rest and transform the space into a welcoming entrance. That is in construction, upgrade court amenities. No, the other side of Dikeman is in construction type. Unrest is on hold, got it okay and what is that? But the project? That's behind the dikeman rest, going up the hill adjacent to Hillside Avenue! That's in construction, no construction going on there. The east side of high bridge at Dikeman and 10th Avenue is under construction. That's phase one of the anchor parks project. Okay, thank you. Upgrade court amenities at Highbridge park. What's going on with that, we did the resurfacing at Wallenberg playground. That's been pretty early on. Okay, renovate and Loftus playground that was that's in design and sign and about to be awarded awaiting OMB approval. Okay award awarded for construction, excellent, renovate, Inwood, Hill park soccer field, one that's another one of the ones that is on hold correct, it's in design and then it'll have to go into procurement. Okay, install adult fitness equipment in Inwood hill park, that's done and people are using it and yeah. It looks great and it's heavily used and then deploy mobile field lighting pilot at Inwood Hill park, ball field that was done like two years ago. So those are all of the items. I am happy to send this to committee members and to anybody else who asks for it. But for the most part you know many of the commitments that were made according to this agreement have been completed or are in process, and some of them are being held up because of the unsurety as to what's going on with the larger scale development. So with that, I can take some questions first from the committee and then, if there are any members of the public who have questions about that Sally, you would had your hand up first more a comment than a question. A number of the items that they include in that list are things that have nothing to do with the rezoning they were committed way before, like fitness equipment was part of participatory budgeting. The anchor Parks initiative preceded this whole discussion about rezoning. So when we're looking at dollars committed, we just need to keep in mind that they threw everything in there, but in fact the total dollars committed is much less related to the rezoning than appears from looking at that list. That is an extremely fair point and thank you for raising it because you are 100 correct. My other question is: where are we on the Inwood rezoning task force? I, don't know, I can't answer that and that's actually outside of the purview of this committee. That's a question that has to be directed to the chair of the board. You know, as you know, we voted to have an Inwood rezoning task force that comes under the responsibilities of the chair, and there has been no report by the chair to the executive committee with respect to appointment of members or any kind of working structure. So you'd have to ask him. Okay, other questions from committee members. Yes, Natalie I was just demonstrating the hand raising feature for panelists Edison Thiago sent me a text too. We can raise hands if you expand the participants list. So if you click on participants, then it shows 91 participants. I'm sure audience on YouTube is excited about this demonstration and you what you get in my case. The window appears on the right with the entire list of panelists, and then you can toggle between panelists and attendees and then on. The very bottom are three options: invite mute me or raise hand. Ah fantastic. Thank you very much. Natalie full service, Community Planning, Board coordinator. Your next job is a do it I think right, yeah, I think the issue is Liz is if you're a host. You can't raise your hand, but if you are a panelist, you can raise your hand I still don't get it okay, but it's all good. That's all right! I am totally fine with you. Just turning on your video and vigorously waving your hand, seeing no other such movement or raised hands activated from the panelists looking over at attendees, I'm not seeing any other raised hands on this item. Sorry, it's a very long list. Wow. There are a lot of people at this meeting. There are okay. I've got one panelist with a raised hand; no one attendee with a raised hand, Maggie, it's not clear which Maggie. This is because it just says Maggie, but you had a question about the capital items: yep, that's Maggie, Clark, okay, so I wrote it as a question in the Q&A as well, and I'm not sure if this committee can help us, but the ring garden got 50,000 capital grant from borough. President Brewer in 2017, but parks has yet to advance our project. We desperately need for it to advance. Composters are falling apart, I could go on. Yes, that's an appropriate question but easier to answer offline, so you know because I just don't think we need to have 91 people listening in on that, because it's a very specific technical question. So can you call me tomorrow and we can discuss and I can figure out? What's the best follow-up on that? Okay, great, oh, we've got all right and John Rumley had a hand up. I can answer John's question on the Audubon playground? Yes, so the remaining section of play, equipment and safety surface is expected to go in by late January and then the last piece of that project is a separate contract for the building for the comfort station. So that's probably going to be ready for the summer. Okay, thank you all right. I'm going to lower that hand! Next I'd like to move into the brief programming updates from cultural and friends of parks organizations. This is a round table format. Everybody gets two minutes, although if you can do it in less, that would be great. There are a couple of people who have conflicting meetings and need to leave before 7 or 7:30. So I'm going to call on Natalie Espino and then no actually can I call on Alexander Campos first and then Natalie works with me. Where'd you go, I'm not muted, I'm here. Okay, great sorry like have to move the screen around hi everyone good evening. All those asked me to say that our outdoor installations treasures on the terrace closed this weekend. We are excited that there are many neighbors stopping by dropping in as they wander along Broadway to see the exhibition and we're also pleased work plan to do another exhibition this spring on the terrace, and we think these are really important ways to engage the local audience who live around Washington, Heights and so forth. To visit the museum in a safe manner. We are planning a holiday virtual, guided tour of our collection and this plugin plan for other cultural organizations in the neighborhood. However, I would like to invite the course community, Board and I believe the date is going to be December, 15th or 16th and I will send a link to Liz and so forth, so she could share with the rest of the community board. It's basically going to be like a 30 35 minute tour of our collection and hopefully a little bit more chairs since kind of like a holiday party. Another thing we're going to have is on December 20th at 11. Am we're going to have a storytelling event for kids with Josefina and Reyetsa, and it's going to be on history, based on the concept of friendship and giving and to sign up for that. Please email, education, hispanicsociety.org again education, hispanicsociety.org and you will get the link for the event. And lastly, but not least, I would like to say that I'm leaving the phone call now because we're doing our monthly chatulia this week on two, the second Tuesday and the first because of thanksgiving on the glorious Spain, our major traveling exhibition that is in Houston and closes at the early in early January, and I'm happy to share that link with. And this has it and she's happy to share it with people if she likes- and it is it's going to be about the x mission in Houston and that's my battle time. I need to go to that now. So I'm getting off I want to say I'm very happy that the exhibition is traveling to London back to Europe in 2021. So that's really wonderful, I know I should do Washington heights, so really grateful for that. Thank you all and I'll put these in the chat just in case no could copy them or whatever yeah nobles like Barnes and noble with an s. It's all good I want to say no wow. If I go not know all I know something else. It's all good. My friend, okay, I'd like to move the agenda. Thank you very much. I am super excited that you were able to come at all. So thank you for that. Natalie, hello, my favorite committee on my favorite board. This is Natalie from the Manhattan borough president's office. Your community affairs liaison to this board, but relevant to this board, is that during the last few months, I also became borough wide cultural affairs specialist for the borough, President Congratulations Natalie. That means that when I'm attending this meeting, I'm getting paid twice, I'm just kidding but I did want to put on your radar and I'm sorry. I do have to step out of this meeting soon, so I appreciate being allowed to speak for this. I will try to come back when I am done with that meeting, because I'm sure that the planned discussion will still be going on for a while, but I wanted to put on your radar the open culture bill. This is Intro 2068, a introduced by council member Jimmy, Van Bramer, the chair of the Cultural Affairs Committee, and this is pretty much following along the lines of the success of open streets and open dining. This is Cr allowing or cultural organization and artists the opportunity to use public spaces for their work. It creates a one-stop shop for expedited permits, guaranteeing follow-up within five days and for cultural programming and rehearsals in New, York City open spaces. So this little this could include the existing NYC open streets in all five boroughs, not that we care about the other ones. But you know they're selected by the DOT in consultation with the local council member, so like the existing open street, open dining D.O.T will probably come and notify folks that this is going to be rolling out in the spring, but there isn't an approval process from the board, so you're gonna want to be in close consultation with your council member with your DOT reps with your these all these organizations and to follow this bill. It is gonna, be up. It's already been negotiated at city hall, a lot of back and forth with a lot of input from the creative community through various hearings. It is the first of many of the bills that are essentially aiming to support the creative economy of New, York City and in a recovery from Covid-19. But there have, you know, also been you know, there's been you know there was a hearing to create a position specifically for anti-racism work that also impacted cultural affairs. There was a bill introduced through business development, economic development to streamline an app so that people can easily find where open city-owned spaces are so there is this push right now to make things a little bit easier on the culturals and to make sure that phase reopening does not leave the cultural organizations out. So please do follow that and follow Councilmember Van Bramer. For more on that. Thank you. Next up we've got Yolanda Pineda and I'm gonna set a timer, and I'm gonna ask that when you hear it, if you could wrap up your comments in 15 seconds, Yolanda, oh wait. Sorry I have to unmute you my bad okay, you should be unmuted excellent. Can you hear me? Yes, we can hear you hi good evening. Everybody just briefly. Many I come here like every fall to report on the work that we were doing. Connect Temenos is the organization and it's a very grassroots volunteers, driven organization. So we ran a eight-week Saturday program, starting on October 10th with it's my part day, and we are very appreciative of the support that we get we got from park. Software is my it's. My part day event, so what we did is that, with the blessing of the parks Department and it's my part day, we started planting bulbs on the bed right inside high bridge park between at 190th and Aston Avenue near the one Bosch Plaza, the Green Space initiative. In addition to the one Bosch Plaza, there are two other spaces, one space that is under the jurisdiction of parks, that is, the West 186th Street basketball court, and this huge space behind George Washington, Educational Campus, that is not on the parks, is under the Department of Education. So our goal in there is to have an urban farm, but I think it's just natural, since high bridge park is right across from the George Washington Campus that we connect these three places because two of them are on the park. Someone is under the DOE, so when I was here a year ago or so, I propose for parks to support us, because the biggest challenges that we have is cutting of the trees. So I'm happy to report that now the DOE and the parks department are in conversation to do that and I am very appreciative of two or two elected officials, the Manhattan borough president and our local councilmen, because they have been the two elected officials pushing for parks and the DOE to come together. I need you to wrap up yes, and there is a meeting coming up next week between these two departments and the DOE so I keep you posted. Thank you Liz for your support and thank you gen great, and thank you for your incredible work on that area. You've really you've taken something you've taken a really neglected area of the park and turned it into something. That's got really tremendous potential and for all of that, the entire community owes you a debt of gratitude. I'm gonna have to leave soon because it's my oldest grandson, 15th birthday, that's totally cool. Thank you very much for making some time for us this evening. Next up, we've got Megan Burns from the Morris Jamal Mansion hello good evening. Can you hear me? Yes, great hi, everybody. My name is Megan Burns and I'm with Morris Jamel mansion. We have a variety of events. This December that we'd love to invite you to starting on Saturday at 11 a.m. We have our monthly bilingual mansion and grounds orientation in spanish, followed by a grab-and-go, explore the holidays activity kit featuring a dreidel, a charmico and a multicolored lantern for kids and families to make. We just confirmed our participation with artist Andrea Arroyo at the reimagined digital event, with New York, City's, missing them project on Sunday from 12:30 to 2:30 p.m. We'll be posting that on our social media, basically reflecting on those who have been lost to the pandemic and her our public art installation in Roger, Morris Park, with Andrea of the same name, Covida will be on display until the end of the month. So if you have not had the opportunity to visit, we would love it if you could see it in person, it's really moving on the 14th Monday. We are doing a partnership with New York adventure club on the history of ice cream in New York with one of our educators, including an ice cream making demonstration. So for those of you of a sweet tooth, there is going to be a peppermint candy crunch that you can make along with Meg, followed by on Wednesday. We are hosting Avi gitler, who was mentioned earlier in conjunction with Audubon mural Project, and he will be in conversation with author Matthew Spady talking about how Audubon Park has changed. That will be on Wednesday at seven and then I think that I think, oh and if any of you haven't read Matthew's book on the history of the area, you can pick up a copy of his work through word up great. Thank you. So much I appreciate that next up, I'm actually going to Avi had put some information up in the chat. So Avi, I'm gonna. Take you off of mute. Can everyone hear me? Yes, yeah, so I basically wanted to fill the group in and let the CB know that the mosaic that you mentioned at the beginning is being installed presently at the northwest corner of 163rd and Broadway next to the pharmacy, and the mosaic was assembled by the artist Carlos Pinto and John Siri, and it's in progress and people are encouraged to come and participate, apply glue to some tiles that have not yet been installed. Mix grout any way in which they'd like to participate and the ideal days for people to come would be Thursday and Friday when the weather will be great there'll, be music pumping, it's gonna be a great time. We're gonna skip on the ice cream because you know it's freezing outside, but maybe I could make a batch of my famous hot chocolate for whoever shows up. Thank you for your time and consideration and best to all what organization are you with just so I? Have it in the minutes? Oh apologies. I'm sorry with the Audubon mural project, which is the ongoing art public yeah awesome. Thank you so much of course fantastic. Next up and thank you and maybe I'll, see you Thursday or Friday Joanna Castro from northern Manhattan arts alliance, you're off mute. We can hear you if you're talking or maybe we can't Joanna Castro going once. Okay, perhaps she's having some tech issues, we will get back to her. Are there Sally, Fisher, okay, unneeded just quickly I wanted to report back on the Manhattan paper challenge. Friends of Inwood Hill park was one of five recipients of grants from the paper challenge. What that is, it's funded by Pratt Industries they're, the guys that recycle paper make all the pizza boxes. Basically, it's looking at the top three community boards recycled the most paper year-over-year increase in each quarter and in the fiscal year which ends July on June 30th community board 12 was number one for the fourth quarter and we were in second place for the year just so you can have an appreciation for what was recycled in our community. We recycled in the quarter. 1400 tons of paper in the fourth quarter 5,554 pounds in the fiscal year, so we are first place again and to report back on what we're looking at doing with this is first seed giveaways. Basically, we've been planting a lot of milkweed all over the neighborhood. We have more milkweed seeds to offer and we will be buying wildflowers and other native species as well. We want to get them in the ground before the first frost. Second, will be, and probably most exciting will be a community toolbox which will be a library of tools and other supplies that we will loan to other groups so that they don't have to go out and buy their own equipment. You wake up. You want to clean up your park, we have gloves, we have grabbers, we have shovels, we have rakes, you want to take care of your street trees. We have trowels aerators, cultivators plants and milkweed. We've got some seeds, save a monarch, there's some milkweed. So basically, what we're doing is formalizing, what's been an informal lending library, so that every group that wants to go out or even a couple individuals, if you want to go out and take care of your environment, we have the two seconds: I love you and finally, a read-aloud book series. I just want to make one note which is mulch fest everyone's buying their holiday greenery mulch fest this year is from December 26 2020 to January 9 2021, the drop-off locations in community board. 12 are Inwood Hill, Park and J Hood Wright, and on the weekends of January 2nd and on January, 2nd and January 9th from 10 to 2 p.m. We will have a chipper at Inwood Hill park, so we hope everyone joins us great. Thank you very much. I'm going to try one more time. Yes, Jennifer you've got some announcements. Sure thanks Sally, for making a pitch for mulch fest in early January I. Also I'm Jennifer Hop, I'm the administrator for northern Manhattan parks and I just want to give a shout out to all of our community partners. As many of you know, we've had an 84 million dollar budget cut, that's the loss of 1700 staff and our parks are more heavily used than ever, and I'm really happy to report that the community has stepped up and has started working alongside us throughout the pandemic, and it's so encouraging. We've invested over 8,000 volunteer hours in Uptown's parks and that's over and above the great stewardship of our community garden sites. So thank you all for that. There's another opportunity. Friends of J Hood Wright, are partnering with the parks Department this Saturday, the 12th we're collaborating on reclaiming the Haven Avenue ramp that links J, Hood Wright Park down to the Fort Washington Waterfront. We've had two successful events. Thus far this Saturday it's at 10 a.m, on the ramp at Haven Avenue at 176th street, and on the arts front. Many of you from the J Hood Ride community, hopefully have seen that parks, arts and antiquities spent 20 days hand erecting scaffolding to be able to do restoration work on the permanent artwork there, the 3000 ad sculpture, it's been transformed, which we're really happy about, and two upcoming events I hope. Everybody's been seeing the Eagles in Inwood Hill, Park and Fort trying park, but if you haven't, you can come out with the urban Park rangers on Saturday December 19th they're, going to do a bald eagle watch meet at Henshaw and Dikeman Street entrance to Inwood hill park at 9. Am. If you want to know more about your park history, you can join NYC parks rangers on Saturday December 26th to learn more about what pre-dated Inwood hill park, the different types of fuses that were there and that's a hike at 1 pm at 2:18 in indian road. That's kind of perfect timing! Thank you, and next up we've got Maggie Clark who I am guessing is going to give us some information about the ring. Yes, we've got our 31st annual Christmas tree and menorah lighting happening this Saturday at 4:30 p.m, and this year we have both Santa and Mrs Claus in attendance for the children because of Covid-19 we're trying to limit it to 25 people at a time. Wish us luck asking for masking and you can bring your own thermos. We won't have singing this year, but that's about it. For that one and I had a question since the paper challenge, winners were brought up and at a previous meeting, I had suggested that the ring garden could receive some money from this, because we were the only place in the district for residents to bring their food scraps for composting for most of the year, and we didn't hear anything back about this. I can tell you that we did not. We Sally's organization was the recipient of an award. We did not make the award, so I can't actually give you information about that community league of the heights. Also, who made this decisions I, do not actually know who the funding authority was on that I think it came through I think it went through the borough president's office and Natalie is no longer on the call. I would ask her, but she is no longer on the call. So I am I'm sorry to not be able to answer your question because it's a totally solid question. Is it okay, if I follow up with you tomorrow or okay? Thank you hold on a second I just want to make myself a note. So I don't forget. Next up, we've got I. Think we've got Joanna back on the call Joanna from Noma. Yes, can you hear me? Yes, okay, great good evening? Everyone welcome to apologies for my tech issues, I'm the consultant for special projects for Noma. We are winding down a pretty robust year of public programming, so our last program of the year is this: coming Monday December 14th at 7:30 brainwave, sound wave with Miguel Cenon, who happens to be a stroll honoree and the special guest is Dr Daniel Kimmel talking on communicating through music, you can join us via zoom, as well as Facebook. I, also wanted to make a shout out to our neighbors at Dyckman Farmhouse they're, having a projection tomorrow from dusk I, believe until nine ish, I'm not sure, which looks to be pretty exciting, feel free to follow us on social media. Lots going on this holiday season, so yeah. Thank you very much and happy holidays to everyone. Thank you and Liz. Yes can I just say! Thank you! Joanna and yeah. What's happening. The diagonal farmhouse is very cool. I, don't know if anyone's available to talk about it, but it's super cool, yeah I was actually going to raise that in the context of the upcoming discussion. But since you want to explain a little bit about what that installation is Daryl me or Joanna, yeah I mean there were. There was some coverage on patch, but I think for the benefit of people. Who may not be aware of what the exhibit is. You want to give a 30 second recap of that, because it's pretty important sure so on the Duckman Farmhouse has an exhibit, so they are open to the public. Talking about the fact that the dikemans had slaves, so one of the three artists will be doing a light. Installation I believe it already started on Monday, and tomorrow is the second night and basically in huge letters. Slaves lived here, which is just incredibly powerful. Curb also has had an article called the Dikeman. Farmhouse has gotten quite a bit of press on this exhibit, and this is just part of the exhibit. It's actually got an international press, I believe there's also an article in I'm trying to think now. I'm having in the guardian as well the guardian, yes correct, thank you Jennifer and it's pretty powerful because the projection is in Spanish yeah, it's english and Spanish. It's quite remarkable, so I strongly encourage anybody who is able to head up to see it there to check that out tomorrow. Liz I wanted to add something. Yes, what Maggie had said about the ring garden? In addition to understand, we not only do a holiday tree lighting. We also have a very distinct menorah, which is celebrated at this season, and the menorah lighting will also be. We will light it on the 10th, because that I believe is the beginning of Hanukkah, but then it's also celebrated and enhanced. Then on Saturday December 12th with our tree lighting very large menorah is there in the ring garden? Yes, I encourage everyone to come by and equally treasure, both excellent. Thank you very much. Looking through the panelists and the attendees, I'm not seeing any additional raised hands so going once going twice. I think we can move to the next item on the agenda, which is I suspect what everybody is probably all here for the possible renaming of Bennett Park by way of introduction on this issue, I hope that people I know many people were here at our meeting last month, where we talked a little bit about why this is an issue that James Gordon Bennett, who owned the land on which Bennett Park now sits, was a 19th century journalist well respected in his field, who, as it turns out, is, was quite a controversial figure and a vowed racist, a secessionist someone who routinely used inflammatory language around African-Americans and slaves who opposed Lincoln who supported secession. He it was after him that an award for bravery in the fire department was named and the fire Department recently renamed that award for Chief Ganchi, who was the highest ranking FDNY official, who died on September 11th. In the wake of that, there's been considerable public interest in renaming Bennett Park to something else. We had somewhat of a conversation about that. Last time there have been a bunch of different names that have been thrown out. There's been a pretty robust conversation on social media and well, I. Think it's great for people to have conversations on Facebook or on Twitter. That's not a publicly accountable, transparent forum, which is why, when I saw a lot of different comments on Facebook I, frequently said things like. That sounds like a great idea. Please come to this meeting, so I think that a lot of people have a lot of different opinions and I. Don't think anyone is right or wrong. I think there are different opinions and we're not necessarily going to agree, but it's really important to respect other people's thoughts on it on the matter. My goal this evening is to continue the conversation. I'm not sure that it's realistic to come up with a resolution this evening, so I don't want for people to think you know this is a timely conversation and this is an important conversation, but it's not a conversation that has you know a strict and pressing deadline. We do not have to have a resolution on this month. We don't even actually have to have a resolution on this next month, but I would like to have as expansive a conversation as possible. This is a diverse community. This is at the moment an overwhelmingly latino community built on dutch estates which were themselves built on land that was basically stolen from the native Americans who lived here. So there are many different ways to honor the land under the neighborhood's history, which has evolved over the decades and over the centuries I did reach out to the folks at CB9 to get a little bit of their input on how they did. They had lengthy conversations in several of their committees around the removing of the Marian Sims statue on central on Fifth Avenue in central park on the renaming the ways of honoring the exonerated five, because I think it's important. You know we're not the first community board to get into a conversation like this, so I think it's important to look to what our colleagues and other boards have done. I have not actually yet heard back from board. 10 I will share that information with you when I have it. Although I was able to read their resolution on the renaming for the exonerated five and again, I can circulate that and that's actually available on there on their website. You can go to the board 10 website and look it up. They passed it in June of this year. He said board. Ten, not nine was for Miriam Williams Right or ten was four board. Ten was for the example. Nine was for Marion. Thank you, no board 10, it was bored, it was all aboard. 10. I think it was all board 10, okay, cool! Thank you. There's also. You know also important to recognize. Maybe 15 years ago somebody came to this committee. We were back when we were meeting in person to talk about the possibility of renaming Fort Tryon Park, because why do we have a park named for a british governor? Why isn't it named, for you know an American or someone? So this is not a new conversation. The conversation about Bennett Park specifically, is new, but the idea of how do we honor people? What do we do when we've, when we are, have failed to honor people or are not honoring the right people? This is that's not a new conversation, so we have to build on conversations that have happened in other boards as well. So are there folks on the committee who want to just jump in we actually have, or people from the public I feel like secretarial question just really quickly, instead of recording all of the names that say exactly what I was wondering if I could just give a summary of the conversation between board and community? Is that okay? Oh you mean? How do you want the minutes to read exactly because there's going to be a lot of input here, so I just want to be prepared for it in the way that you want it I think probably the easiest thing to do is to have, as people are talking just to make a brief summary of what it is. They're, saying, okay, so individual by individual yeah, okay, because it's not like the public is of one mind and the board has its own I mean our job as a committee is to hear from the public. That's why I asked yeah so I would actually like to throw open the Q&A first to members of the public. If that's okay with members of the committee, it's a little different than how we usually do it usually we'll hear like a presentation from somebody. The committee asked questions and then the public asks questions I like it public. First, okay, that's fine with me public! First! Let's do it publicly all right, so I'm actually going to go to Dave Hunt first, because he had his hand up first Dave you here. Can you hear me? Yes, okay, great now, I have lots of good news, so I have to first say that as many people in Washington Heights, community I knew nothing about James Bennett. Until about a week ago, when the patch article came on at that time, I thought it was extremely appropriate to rename that park in memory of Jim Dwyer and the feedback that I got from the community was tremendous. Just from all aspects of our community. Great respect for Jim I contacted all his family, his wife, his children, his cousins, his brothers and over the last couple of days. We thought about this, and the final decision is that, because the name change is due to a racist background that the renaming should be a name that completely goes against that to fight back against racism and therefore the Dwyer family came to the conclusion as wonderful as an honor, as it would be that it would be much more appropriate to back a suggestion that would represent a person of color to rename Bennett Park. So that's our position, cool! Listen to time. Are we going to give the two minutes for each person speaking or are we just going to leave it like that? I'm actually doing it in a minute and 30 seconds, because I there are a lot of hands up and I. Would like to make sure that people and I'm timing so and Liz yeah, so what I'm actually going to do is I'm going to set the timer for a minute and 15 seconds and when you hear the timer go off, you've got 15 seconds. To conclude your remarks, thank you. Dave. You were going to say something. Is this a procedural thing? Daryl? Yes, it is, would it be helpful, but before we continue, if maybe Jennifer outlined the parameters of naming parks and because there are a few yes thank you for reminding me of that was actually I had a bunch of written notes, and that was one of the things that I had noted and forgot. To actually say parks would need to be it's done at the discretion of the commissioner. The parks commissioner looks to a park can be a park does not have to be named after a person. It can be named after a group of people. It can be named after geography after a timed event, but if a park is being named after a person, the person should be dead and the person should have been dead. For three years, so there were many wonderful suggestions of people who are living and, as my grandmother used to say, we're not even going to discuss that, because I don't want to bring the evil eye on anybody who is living that feels but yeah. So typically in the event of people in the for, in the case of people naming a park after people, it would be for people who have been deceased for at least three years am I missing. Anything is that it election Daryl. So then Daryl had so okay. Next up, we've got Debbie, Cardona, Welcome, Debbie, Baller, Happy, healthy and safe. I've got a lot of mixed feelings and I am never good about. You know bragging, but I would love to propose my mom, who you know, but others may not know at the time of her death. 10 years ago she was vice chair next to Pamela North of CB12, when parks and cultural affairs both became one. She was the chair of the committee. At that time she was a brilliant educator, her career at Brandeis, High school. She at the time of her death was on the board of directors for Riverstone, where she helped with the Alzheimer's clinic. She was on the scholarship fund for Isabella I could make the list go on and on. She was one of the original educators that implemented title vii, which is bilingual education in New York City. She was born in Puerto Rico, but her mother came from San Pedro, De Marquaries. She and her. My fam grandparents arrived in this country into Washington Heights in 1945 and I have to say you know, I, look and I see what goes on in this community and if those of you that knew her and those of you that have a memory of what it was like 10 years ago, a lot of changes were going on, and you know this would be something incredibly positive when you think how much she gave to this community and did to help and others like her coming up. Thank God. So I'm done! Thank you. What was your mother's name Debbie before you go, so I can put in the next Emilia Tony Cardona. Thank you. Oh my god. Yeah put Tony in parentheses, if you can yeah we'll do. Thank you. It's I'm not planning on speaking and commenting on everybody's suggestions. That would be inappropriate, but I feel that I can't not say something about Tony Debbie totally made me cry and I will say that I always wanted to get the Bell tower in high bridge named after Tony, but yeah. That's a super deserving suggestion and I'm gonna go cry now. She was quite a woman, Alexandra Barbosa hi. Thank you so much thanks for taking me. I am a resident on Pinehurst Avenue and I'm in Bennett Park. All the time and I did just recently hear about this and I had friends and neighbors coming up to me, because my great uncle is actually already memorialized on a plaque in this park on the South Side Emilio Barbosa, and he immigrated here with my great grandparents when he was a teenager from Nicaragua he enlisted in the Navy at 17 and did die in 1945. He I mean he already had he's been memorialized already. My grandfather worked very hard to make that happen and I think it would be a really wonderful way to honor, not only him again, but the immigrant community and the legacy in our neighborhood. Thank you, Jen ping, hi. Everyone. Thank you. So much for hosting this conversation, I similar to the previous commenter, am a local parent right along for Washington Avenue, and you know back before. Pandemic rates were so high, was often in Bennett Park as well, and I'd encourage the community board to help us kind of understand what this process is like. I'm really appreciate hearing from you, Liz that you want to have the conversation be as expansive as possible, but I know that folks who frequent the park would also love to kind of understand how the process even works bureaucratically, and the last thing I'll say, is having heard all of the wonderful suggestions about names that one thing I would like to propose that folks have been talking about in my smaller groups has been potentially reflecting the Lenape land that our parks are all on, and so that's one consideration. I'd like to share with those listening as well as you on the board for consideration. So thanks so much for listening and appreciate all the future commenters who are going to share their thoughts as well. Excuse me chair. Do you mind if I build on that for a second, she asked about correct? Do you want to speak to that really quickly, very quickly? What I'll say is right now in the interests I know that I said: I want to have a conversation, but in the zoom world that's a little bit difficult. So what I'd like to do is call on as many people as have their hands raised and give everybody a minute and a half to say what they have to say. Then we're going to do a lap through the committee we may find ourselves coming to some consensus. We may not so I think the I don't have a set road map for what this meeting will look like in terms of moving towards resolution. I think how exactly we do that is going to depend on what it is. People have to say so yeah. So I'd like to kind of take a lap through the zoom as it were and get a sense of what what's on people's minds in terms of the largest sense. At some point, the committee with public input is going to have a recommendation. We would pass a resolution out of the committee making a res making that recommendation that would go to the full board would vote on it and if it did, that would then go to the parks department and then it would be up to the commissioner to act on that or not. And then you know if they didn't, then you know we would then take it from there, but in terms of this meeting, I'd actually like to spend as little time as possible on process and as much time as possible just hearing from people and hearing people's thoughts so that we can, as a group figure out what's the best way to move forward, make sense to everybody. Note it in the minutes fantastic. So next up we have Daniel Glover I love your movies, probably a different Daniel Glover, I'm just kidding hi, I'm Daniel Glover I started a Facebook group called Bennett Park parents a couple years ago after my son was born and it's grown and people have really become involved with the park. I am also a former firefighter and I was very aware of the renaming of the Gordon Bennett Award to chief Ganci and I, just kind of wanted to follow that with a renaming of our park, I thought it was appropriate, and one of the suggestions in our group was that I really took to was what was just mentioned: kind of giving recognition to the people that were here, and you know pretty much devastated the indigenous people that were on this land and had names for the land and I have been trying to reach out to local indigenous groups, still kind of waiting to hear back, but I think it would be important to reach out to them and get their input and not speak for them, because this might be something they don't even want. But I do think it would be something great for the neighborhood and something great for the kids to learn about who was here excellent. Thank you very much. I appreciate that, at the risk of going out of order, I'm actually going to call on Timothy Brutus, because he has some comments that dovetail quite directly to that. I did also want to say one thing that I forgot is Bennett Park, like many other parks, has interpretive signage, with some fairly lengthy text talking about the park and if indeed, we do make a recommendation to rename the park. The text of that sign could and would change to reflect. I would hope. Not only the history behind whatever is the new name, but also some information as to the old name and why we changed it, because if all we do is say we, you know this guy was terrible and we have to erase him from history, and then we rename it. We miss the opportunity to understand why that was a bad choice that needed to be corrected so interpretive that can be included in the interpretive signage, which presumably would change Timothy Brutus, yes, hi. Thank you. Everyone hope everyone's well I appreciate a chance to speak today. I also, you know, I left it in the Q&A I accidentally sent it I didn't mean to send it out in the Q&A. But yes, I agree with the prior caller about you know using a Lenape name. If that would be their desire, if we could engage native groups on this and I put a few different names in the chat that are just beautiful in the Lenape language and there are there, you know there are people that have been pushed out and pushed out from. You know: New York to New Jersey, to the Midwest to Indiana to Oklahoma, and they just kept getting pushed and pushed across the country. I also think we should, you know, maybe expand the Barbosa Memorial a little bit because I think that's you know going back through generations make that a little more pronounced because a lot of people don't know about that and I. Think that's a great idea- and you know Washington Heights has been an immigrant community for a long time. But my main question was about process. How do we give a name to the parks Department or how do we suggest a name to the community board and I guess? This is not part of this meeting now, but I will be here in the future and you can check the Q&A I put some there's a whole Lenape dictionary there. That is, it's really beautiful to look through and I've been going through it for years now. So. Thank you very much for the time. Thank you. I appreciate that, and in terms of answering your question and I guess, the unspoken question that others may have is part of the reason why it's important to have this conversation here, as opposed to on Facebook, is so that the minutes can reflect all of the different names that people are recommending. So nobles is writing down all of the names that people are recommending and that's all going to get thrown into the mix. Okay, great! If you could just check the Q&A, yes nobles, if you can cut and paste from the Q&A would be great. Thank you so much noble. Thank you! Next up, Jacob fine! Really quickly! I'm sorry! Could you just do me a favor Timothy? Can you put all the names that you put in into one text into the Q&A unless you already did it because there's a lot already in there, it's just one: I haven't gone through the Q&A yet, but I'll make sure to grab it. I have a few right to get all four of them and one little thing you can cut and paste right now: fantastic thanks, I'll grab them spellings, so but if they're beautiful words copy paste. Thank you. Liz, I'd like to put a small comment in Bennett. Park is the highest point, so Barbara I know and, as I said, we're going to take a full lap through the members of the public and then we're going to get to the members of the committee. I know you're going to have valuable input, as does Richard and the other members as well. So Jacob, fine hi. Can you hear me? Yes, okay, great I, just like to put forward the name, Margaret Corbin. She was somebody who dir I guess during the battle of Fort Washington, she took over a cannon and did a great job with it, fighting the British and she's a historic figure for that, and so really like the first woman in America to serve in our military in a combat role and just the fact that there's a that there's already a cannon in the park, it just kind of seems perfect. I. Don't know, that's it I'll yield my time. Thank you. I appreciate that suggestion. Next up, Jen Shriver hi, sorry, they just started honking on my block, so you can probably hear that now. I am also a mom of a four-year-old and a member of Bennett Park parents and he spent his whole life in Bennett, Park and I agree. All these names have been amazing, but I agree with Dave Hunt that the renaming of the park should go against what it is named now and in the face of that I think we should invite the indigenous community to decide what the land should be called. So I agree with Daniel Glover I, don't think we should decide for the indigenous community, but we should collaborate with a member of the Lenape to decide if they would like an indigenous name and I imagine. We would also want to support a naming ceremony with them. If that was the way we went so that would probably be a part of it. I also have reached out to folks in the indigenous community and the message I've gotten back, that it should be an organized response that feels respectful and maybe has a little monetary donation to an organization since they've you know been devastated by colonization, but that's my thought thanks for listening. Thank you very much. Rob Snyder I think the idea is that people have put forward are really great and they're very interesting because they show how one park is the focal point of attention for many different kinds of people with many different kinds of questions and relationships to the past and the community, and the one thing I think about is how can the signage? How can the use of a renamed park somehow recognize those many different attachments that people have to that park and I'm not sure, there's an easy way to do that? It's partly done in the signage. It's partly done in the name, that's chosen, but it is the site of Fort Washington. For example, it was a pivotal battle in the American Revolution and for years I've often wondered. Why is it simply not called Fort Washington Park Bennett? Is not more important to that spot on the land he got his name on the park only because he was a landowner there. So if we change the name in doing it, make sure to incorporate the history of how we got to the name change into signage and try to recognize the many important roles of that piece of land in the history of northern Manhattan and just for clarification, can you state your very particular area of expertise and your title as it relates to your comments here this evening? So I'm a Manhattan borough historian and I'm also author of a book called crossing Broadway Washington Heights in the province of New York. Thank you. I knew that, but I was guessing other people might not. Thank you very much for your comments. Jessica Griffo, hi I am calling to suggest the name. Emilio Barbosa, as Alex did a while back I learned about this meeting through patch, because I wanted to save feral cats and I am totally educated or being educated right now, it's like amazing. All of these names and the history of the park is just like sending me down a rabbit hole. So I am a lifelong friend of the barbosas I am very aware of their story and would visit their grandparents, who was the brother of Emilio Barbosa who the park is, has a plaque for and yeah I just I've been visiting. This neighborhood I now live here, I'm a little nervous, I'm rambling, but I'm learning so much and that's what I'm gonna do. I'm gonna end there. So I was calling for Emilio Barbosa, and this is really cool thanks for having me okay. Well, thank you very much for coming in. We appreciate your input, Angela Fernandez hi! Thank you so much. My name is Angela. Fernandez I live right across the street from the park, and you know my kid is 13 years old and I. Think like many people on this call with kids have spent a lot of time in the park and I just wanted to I. Think you know support what a lot of folks have said. There has been centuries long, erasure of the Lenape history, both literally and metaphorically, and so I think that it would be tremendous to be able to partner with Lenape. If that is the way they would like to go is to choose a name that is that's relevant for the space and for the area. I myself had looked up the word for mountain thinking of it being the highest natural point in Manhattan and thinking that could be appropriate and it's Ocho Wiki, but I agree with everyone that has said it that it's really not us to decide, and so I reiterate that sentiment and that thinking behind that so I just wanted to support that. So, thank you very much and now that there's a Bennett Park parents, Facebook Page, and he wasn't aware there was one but I hope to bump all and bump into all of you in the park. Excellent. Thank you very much. Vanessa Carridi! Yes, hello! Can you hear me? Yes, thank you, I'm just basically calling in to kind of amplify the voices referring to weaving in the indigenous people of the area. I am indigenous America, I'm not from this area. I'm from the state of Maine and my family is Miguel and dualistically. Geek I just want to say that names really matter, because our names were stolen from us. The names that we often call ourselves is no longer what we are referred to by the government and by the rest of the country. So a lot of the idea of reconciliation is what's been. Taken can not ever be returned, but there is something powerful and meaningful in the acknowledgement of that and that the names of these places really do matter and I also just want to you know. Second, what Danny initially said, which is that I also think it's very important that the Lenape be very involved in that process. That a name is not chosen on their behalf, but that's pretty much all I wanted to say. Thank you so much wow that was powerful. Thank you. Molly Heim, hello, I, grew up playing in the park myself and I'm now raising my kid every day and I'm here to throw one more voice in the ring for consulting the indigenous New Yorkers to rename the park appropriately to honor their legacy and do the little part we can to clean up our little corner of the world here in Washington heights by undoing some of the colonial legacy and violence that was done here. So I just want to appreciate Daniel Glover for starting the conversation in our Bennett Park parents group, and thank you Vanessa for what you just said so powerfully I just want to agree. Thank you Jayden day. Can you hear me? Yes hi. This is actually Margaret Day, I'm using my sons. Ah hi. How are you I will change that in the minutes? Attendance? Oh, if you want to give him credit go ahead. That's fine. I grew up in the PA in the park. My children play in the park now born and raised in this neighborhood and I want to throw support, Daniel and the rest of the group with collaborating with the Lenape peoples to find a name that they think would be appropriate to name the park and as the everyone's covering everything I would have said. The one thing I would like to say is that I think we are at a very crucial time in history and it's our responsibility to change the world that our children grow up in and part of. That is how you learn your place and where everything else is in the world, and we don't give enough credit to indigenous peoples and I think it's very important that be part of the narrative and acknowledgement that children growing up in our community in every community, but we're responsible for the ones in our community, especially, are aware of this that be that's part of the narrative to them in growing up and I. Think that's crucial and I. Think that's critical and I. Think now is the time that we start doing these things and changing these things and that changes people's worldview as they age and how they see things and their sense of responsibility and helping others and paying respect and working together. So that's what I just wanted to say and I'm very moved by it, I'm in tears now I did not expect this. When I came to this meeting, it's beautiful and I'm so proud to be born and raised here. Thank you, Bruce Kamiat, okay, oh hi! Thank you. My zoom connection keeps cutting out, so I'm afraid that I missed some of what has already been said. There may be some people on here who know me and I'm going to surprise them if there are, by taking a far more conservative view than many that have been expressed so far in this meeting this park, its location is historically important, primarily as the site of Fort Washington. That is a significant site for the history of the of this city and the history of this country and I. Believe that should be the focus. I propose. Sorry, if somebody has already said this because as I say, I've missed some of what had been said. I propose that Colonel, Robert Mcgawe should be honored by naming the park after him, he was the commander of Fort Washington at the time of the battle in November, 1776 and I would like to read something that he you said there's time, you could just conclude your comments because we're trying to keep everybody to like a minute, 30 and you're already at a minute, 15. Okay, all right. Well, then I won't read the quote, but he cited that what they were fighting for was the most glorious cause that mankind ever fought in that that's part of the quote and I think that the values that represents should be honored here. Thank you. Okay, so we've had a number of people from the public. I'm going to call on. We've also got several people who are members of the board, but not members of the committee and I'd like to get their input as well. I also want to say that my goal was to end the meeting by 8:30. There's still many people who would like to speak, and it's already five minutes after eight, so if you're, okay, with going until nine I'm fine with that, but I think I don't want to go longer than that, because I think people get cranky after it's impossible to have a bathroom break like two minutes after this section. If we want to, but I'm just saying like if you know sure also if you need somebody to take over taking minutes that you can do that and just kill your audio video okay, so I do actually want to call on Richard Allman to just give us I had asked Richard at the last meeting to reach out to the fire department to get a little bit of information about what their process was in renaming their Bennett award. So Richard. If you could give us a brief summary on that, I'm going to give you a two and a half. If that's, if that works for you, you're, muted, Richard, okay, I, just first I want to acknowledge. What's a really great and robust discussion, that's going on right now! The fire department's process on this was actually fairly simple in 2020 the issue had been coming to within the fire department and actually raised, especially by someone who had been given the Bennett award, that it was just not an inclusive way of honoring people in the fire department and that the name should be changed. A series of fire commissioners and Fire Department leadership did not act on that. The current commissioner this year, the current commissioner think it's negro, Daniel Negro, but I don't have the name of the tip of my tongue, made a decision it's time to act on this and actually didn't follow that much process this year around it. There was not a consultation with anyone who might be part of the Bennett family. The organization that had helped carry the issue within the fire department was the fire Department's Falcon society, which is where african american firefighters come together. If we continue this discussion passed tonight, it might be interesting to invite someone from the vulcan society to present and I'd be glad to follow up on that. Also part of what got my attention I think a lot of other people's attention in the first place was an article a couple of months ago in the New York Times about this I put the link to that article in the chat for people to say two things in just closing up this presentation: one: the list of community heroes that people are talking about tonight in so many different ways, really catches me and I. Think once we get past. Whatever is the discussion that we're going to have around Bennett Park? We really should look at the task of how do we honor more people who have made and built this community, and there may be any of a number of ways to do that: I'd, love to be involved in the process and I believe there's some public and foundational support if we were going in that direction. Having said that, I want to add my own suggestion for a name that might make that we should consider, and that would be to consider naming it Sosua, Park or Sisua Square, which would be Sosua, which would be a way of acknowledging some of the intersectionalities in this community ways that different parts of this community have supported. Other parts of this community and a chance perhaps find good ways to celebrate the bonds within the community on an ongoing basis for people who may not be familiar with it yeah quickly. Last ten seconds for people who aren't familiar with Cesua, it is the name of a community in the Dominican Republic that 80 years ago, around the time of World War Ii took in a large boatload of jewish refugees from the holocaust, who did not have another place to go. They were given a home, it's been a way to celebrate, and those are two substantial communities in upper Manhattan with Dominicans, certainly being the largest of them, and the jewish community being very significant in the Fort Washington Corridor I think it would be a potential for ongoing celebration. Thank you. I appreciate that report all right, I'd like to hear from Tonya Bonner and then Omar Tejada, who are two of our board members who are not on the committee and then I'm going to bring it back through the committee and the reason why I'm going through everybody except the committee first is most of the people who are on the committee did have the opportunity to speak a little bit to this issue at our last meeting. So I just want to make sure that we're doing the fullest possible loop and getting the most possible voices so Tanya hi. Can you hear me? Yes, thank you for the way you're handling this meeting. Thank you for being inclusive of the community. I wanted to say. First of all, I wanted to speak to the erasure of Illinois people and I wanted to say that when I was a graduate student at Columbia University, we actually had to do a sit-in for hours in the dean's office just to force them to allow us to have Lenape people open our graduation, and it was a very infuriating process that speaks to the arrogance and the erasure of these people on whose land that we sit and we live, and for us to have to go through that process. Just to get them to be represented, was real, so I want to. You know echo what people are saying about the need to acknowledge, but I also want to point to the erasure of black people and black history in this community and I say that, in the context that this Mr Bennett was a pro-slavery racist who uses editorials to slur, blacks as inferior and wild beasts and I think a lot of times. We don't acknowledge the pain and the suffering that has occurred to black people in this community and to hear all the comments about all of that and not really deal with the who this person directed his hatred toward like Maya Angelou said when you take something for someone give it back and so I think we need to figure out how to address that pain and suffering caused by this man to the people. His hatred was directed to, and I haven't heard that in any of the comments, so I hope that we can find a way to do that. Thank you. Omar Tahara I just want to say thank you to this committee for shining a light on this, and thank you to everybody else. Who's made comments that have been extremely informative. I also want to thank Richard as well, because we covered this topic yesterday at the transportation committee, and part of that discussion was what caused me to come on to this committee as well, even though I've been on it in other meetings as well, because we are also curious to see how the discussion evolves in this committee as well as we are also looking at Bennett Avenue on our side. So I just want to thank everybody for taking the time and all the comments have been extremely informative and it's been extremely heartfelt to see all the names and the suggestions just because of how important this is again. It's also extending on our end to Bennett Avenue. So that was it. Thank you, everybody! Thank you! Okay! Yes, before we get to the committee members, I'm not sure if that was next. Yes, there is a gentleman named Michael, who is a former FDNY firefighter that mentioned in the chat that he would like to speak, but I don't think he raised his hand necessarily but okay Michael in all caps. Oh okay, let me Michael in all caps. That's Michael I was wondering all right. Sorry, chair chairperson, after this can we set a you know close it in terms of speakers just for the time, so that yes, at this point, if you haven't raised your hand, then yes, yeah I, think I was done with the public comments, because I thought we were done but he's Michael is getting in because he had raised his hand in the chat and I didn't realize that so Michael are you. We I think we can hear you thanks Liz. Can you hear me now? Yes, last name Michael, please. My name is Michael Regan, I'm retired. First deputy commissioner of the New York City Fire Department I. Just want you to understand that the Gordon Bennett Medal was and now known as the piquancy the highest medal in the department. When someone does the most heroic activity he or she gets the Gordon Bennett is a big deal and I am so embarrassed. It was named after him and I wanted to say this publicly. I also heard what Dave Hunt said earlier and I also wanted you to understand. I'm a flappish guy, I'm not a Washington Heights Guy Jim Dwyer is a herculean man, I compare him to Pete Gansey and some of the people that I knew at the Fire department. Jim Dwyer, look at the central Park 5 video about how he feels about people of different race and I hope. I wasn't invading. This is one of the most unbelievable meetings. I've ever been to I am so impressed with the people of your community. I am so impressed with their heart and their thoughtfulness. I wish I lived in Washington Heights, but I wanted to say what I want to say about Jim Dwyer, you guys were blessed to have him in your midst name the park, whoever you want to but consider Jim's wire, because he was an extraordinary person thanks. I'm sorry that I not at all, thank you. I will put that down the minutes as a herculean of a man. Thank you. No thanks and Francisco I was talking about your daughter. You were holding up your daughter before she's beautiful, be proud of her thanks guys. We one of the best parts of meetings on Zoom is. We do get to see people's children and I can't agree with you more love that thank you so much for joining us. Michael I appreciate it. Thank you, okay. So now I'm going to go through the committee members I'll call on you in the order in which I saw your hands, go up, it's gonna, so it's gonna be Nima. Barbara Francisco wait a minute! I'm gonna write this down: Nima Barbara Francisco, Nobles, Sally, Danielle, Daryl Co-chair with the last word, love it. Okay, Nina Pacifier is in the chair. It's in the bed. All right. Can you hear me yes, hi good evening? Everyone. Thank you so much for your time. So the suggestion that I want to make it actually touches upon what and I and I've never spoken to her about this. But Tanya Bonner mentioned something earlier in a way of writing the wrong of the p or directly impacted by the person who the park was named after by Mr Bennett, and so a person that came to mind is John. Greenleaf, Whittier and nobles I'll send you the spelling. He was a Quaker, a poet, but, most importantly, he was an advocate for the abolition of slavery. So in his time he was an abolitionist. He was an anti-racist. He even sacrificed his highest dreams and aspirations for political office in order to stand in solidarity publicly against slave owning, and so he did the anti-racist work back then and I think that that's a direct reckoning to the racist and destructive work of Mr, Bennett and so I would suggest. John, Greenleaf, Whittier I. Think that also it's important to note that he is the writer of a poem that can serve as oh I can not share my screen he's a writer of the poem is called. Don't quit and I will only read the first verse. It says when things go wrong, as they sometimes will, when the road you're trudging seems all uphill when the funds are low and the depths are high and you want to smile, but you have to sigh when care is pressing. You down a bit rest of you must, but don't you quit, and so I think that using you know his name and it's a symbolism of unity that our community needs again because of the work that he did is directly related and juxtaposes the work that Mr Bennett did so that's my suggestion and I also wanted to say thank you for this opportunity. Liz just doing this because as I listen to others in the audience or in the from the community, I could understand and appreciate those other suggestions. So I'm not tied to this suggestion that I'm making I'm very much open to other ideas, I also liked when Miss Deborah Cardona mentioned Mr Daniel Glover So school park. Those were great. So thank you so much. Thank you. Next up, Barbara I wanted to say that first of all the I'm aware that is the site of Fort Washington, but we do already have Fort Washington Park up here in the heights, and that is very aware of that history. In the Revolutionary War Bennett Park. We have these important layers of history in our community of the Lenape, the rich revolutionary war. History and I always think about programming when we're in a park and programming for children and I. Don't think that it's in conflict that you can have those layers within the naming of a park and playground I mean, for example, we can rename the park with, for example, a Lenape name, and you can have parts of the playground or something memorialize, Margaret Corbin. So I don't think we have to limit ourselves in that way, especially because there's a cannon there. So I think we can look at this in an imaginative way in terms of the park and the playground together and I want to have an open mind about that in terms of and I think we want to look throughout our community hoping. Hopefully this opens up a in a good way, a pandora's box of ways where we can memorialize our many layers of history and growth in this community in different ways throughout the community. One, for example, I had brought up the over at the dikeman houses memorializing and working with the reconstruction of the Dikeman Basketball to remo, to memorialize and show the history of the negro leagues that played there in the Dikeman oval, so I think that we really have to really work it and Tanya. That speaks to the erasing of the african-american history in our neighborhood. So that's my two sense. Okay, thank you. I appreciate that next up Francisco, can you guys hear me? Yes, okay, cool, happy, Tuesday and I'm gonna be honest. I was not expecting what we're getting today from the community and in general, how I wanted to put my hat in the ring as far as representing and showcasing and highlighting the indigenous folks of Manhattan, especially those that were uptown and I, wasn't sure if there was going to be a lot of support for that, because, typically, unfortunately, we live in a world where we just focus on what we see in front of us and we don't focus on the past and how we illuminate that, especially after such tragic and colonization period that we suffered so to see that people were thinking in that same way from all backgrounds. I think it's pretty amazing to hear and to witness and all the great ideas that everyone has just keep flowing them in and we'll try to figure this out, but yeah, I'm with the indigenous folks and representing them, and giving them as much light as possible along with a plaque. That's educational, so people just don't see the name and I actually like the idea of the highest point in their on their language too. So not just putting their name. I haven't said the name because I don't want to mispronounce it, but one of the callers had mentioned the name of the highest point in Manhattan and I. Think we should add that as well, I don't know nobles. Did you get that name at all? Angela Fernandez mentioned it. Yeah Angela Fernandez mentioned it. It's in the minutes. I didn't get the spelling of it, but it's for mountain and I also agree with a prior person saying that we should also put us on another side plaque telling them what it used to be and why we don't represent that any longer as well. So that's it. Thank you guys. You bet thank you. Next up, nobles I have a minute and a half or two minutes what guys minute and a half minute and a half okay cool, I'm starting now too little known thing about me. My first name is native American. My on my mom's side. We came from a chief and during the trail of tears, my family was basically assimilated into american culture and ripped their names away, and they were part of the chieftain society of the lumbar tribe, which is an offshoot of the Cherokee they were given. The name nobles I was given nobles, because my mom had eight sisters, no brother, so the last name wouldn't have lived on because there were no sons and I got that name. So I have two last names. Nobles native american culture is very big in me, and the injustice that has been done to the indigenous people of this country is horrible, and everyone here knows that, and so that being said, I want to fully put my support behind the Lenape, having the right to name Bennett Park to whatever they want, and if they do not want to do that, I still think that we should honor it for the indigenous people of this land, maybe not specifically Lenape focus, but maybe something a little bit more broad. So that's first and foremost. Secondly, I do not think that we should be including Bennett's name on a plaque once this park is renamed. The folks of privilege have already owned the book. They do not need to own the last chapter and that last chapter should be owned by the folks that put the blood in to actually till this land and with that I am done. But thank you for your time. Thank you. I did not know that nobles. Thank you. No problem, Sally I believe is next yeah I want to also voice my support for honoring. The Lenape I think that we should probably be reaching out instead of trying to come up with names on our own. We should reach out to the Lenape Center, because that's their whole mission in terms of land acknowledgements and we've had some dealings with them as friends of Inwood Hill park, I'm happy to take a lead on that or to work with anyone else on the committee, but I think it's important that we do acknowledge the lenabi. This is their land. Thank you, I will take you up on that and more on that. At the end, Danielle hey, can you hear me yep, so I also want to say that I'm very pleased with how this is how this meeting has been going. It's really nice to see folks working together in a really positive way. So I echo what Francisco said it's so nice, okay. So that's that I don't have a particular person in mind, but I agree with what everybody has said about the Lenape I think that is what I support and, furthermore, support incorporating them into conversations and deferring to them on what they feel is an appropriate name. I respectfully disagree with noble with what nobles has said about the and I really appreciate everything that you said. Call yourself noble, but I. Do s respectfully disagree with having the name mentioned, because I personally feel that having something that explains the name change and why we felt it was so important can be powerful, but I definitely get where you're coming from I'm trying to think. If there's anything else, I wanted to say I got 10 seconds. Think that's it I'm just so pleased with how this has gone down it. Just it feels so good I have like chills and stuff. Thank you, that's it and for your comments in the beginning, you said anyway, I'll tell you later. Thank you. Daryl me. Okay. Last word, just no, not last word but and Liz will definitely have the last. But just you know real quick, some names that weren't mentioned that I know I mentioned, or that I definitely saw a lot on Facebook. The Facebook groups had like 200 something plus comments that I went through just to name them real, quick garrison summit, high point or naming after people, including Dr, Paterno, Stanley Mcgaw that was mentioned and mother Cabrini as well, which I don't believe she was mentioned before and also you know, I just want to bring it to a broader conversation and maybe not rush us into naming it. Oh and let me also say I fully agree with the naming it after you know or having the Lenape folks, you know name. That is definitely my first choice. Daryl quickly, you mentioned another tribe in one of your. There was another tribe and, like you said, I can not pronounce. It starts with a w, but it's probably about 14 letters long but yeah, but I. Think maybe you know folks can have that discussion. I'm sure they know you know. Maybe it was a subsection of the Lenape I, don't really know their history other than what's on. You know online. You know, but in terms of the broader conversation and maybe Jennifer can and can speak to this as well I think maybe we can do a full inventory of hey. What naming opportunities are out there? Naming the entire Park Bennett Park is not the only one you know, I think there are maybe Barbara mentioned. There are playgrounds within parks that haven't been named, like Anne Loftus playground is in Fort Tryon Park. There are various new, like gates coming up in high bridge park that you know can be renamed I, don't believe either of our two recreation centers are named other than for the park that they that they're in so I think there are a lot of naming opportunities out there that can take in so many of these wonderful richness of ideas that we have. It doesn't just have to focus on this one part, so I think. If we do that full inventory, it would benefit everyone. Yes, thank you for that. So I will say that as I suspected, we didn't really get anywhere in terms of definitely what the full recommendation of this committee is, but I think we have a clear direction. There's overwhelming support for the idea of looking to the tradition of the people whose land this was first for guidance on how best to rename this park there's also clearly consensus. I, don't I didn't hear any objection whatsoever to actually renaming the park so at the risk of stating the obvious I think that there's a unanimous agreement that the park should be renamed and strong consensus on the direction we should go so I think the next step. Procedurally, is you know, nobles has taken copious minutes and we will put those together and those are going to be publicly available. They'll be distributed to the full board at our meeting and then in the fullness of time, they'll be uploaded to our website. You know, I, don't want to speak for our staff. I know that they have lots of committees that they're dealing with, but it looks like our website is pretty current with the minutes. So I think they do a great job on the website. They do a really good job on uploading that so I think that you can look to these minutes being uploaded, probably by the end of the month, or certainly before, our January meeting, which will be the second Tuesday of January at 6:30. Whatever that date is so thanks, I see Richards telling us it's January, 8th, excellent. So I don't feel like we have a conclusion, but I'm okay with that. I'm incredibly grateful for everybody's input. Just a couple points. To summarize we, it seems like there's broad consensus and agreement in looking towards multiple places to possibly rename, because there have been many good suggestions and it would be really ironic in the worst possible way to pit these suggestions against each other, as if we can only do one of them for openers we've got Bennett Park. We have, as Barbara, suggested a playground within Bennett Park, so we could quite easily Ren I mean it'd, be weird if we renamed like each bench and tree, but we could totally make a suggestion to rename the park and to rename the playground, and that feels like pretty consistent with what the parks Department does. There is Bennett Avenue, with the renaming of which is much more complicated and frankly expensive, because you know you're talking about people's addresses and mapping and it's a much different thing than a commissioner just saying: I renamed this park or this playground. So I appreciate Omar's comments regarding that and what the traffic and transportation committee is doing there I do want to throw out that, through this process and through the wonders of Facebook and Wikipedia, I did learn about Lamar Bennett, who was an african-american sociologist and historian, who worked on a lot of the storytelling and reclaiming african-american history and how you talk about memorialization and how you have these very conversations. So he feels I mean not that it's our committee's job to tell the traffic and transportation committee what to do, but it feels like he's, maybe an interesting name to consider, because it gives the city the opportunity to rename Bennett Avenue without changing anybody's address. So that's me and Liz, yes, Liz. Just to add, there were other suggestions like Michael Bennett or Tony Bennett, Michael, Bennett or Tony Bennett sure also white men, but anyway, but yes or one of whom died of Aids just FYI. Also true, thank you for that. There's also Bennett rest, which is a small parklet on Bennett Avenue, just at the northern end, just before it curves into Broadway, and then, as I said, there are all sorts of other more expansive naming opportunities. In light of this conversation, so I'm gonna recognize Jennifer in yeah, so what you got Jennifer so I just want to say you know this is the it's been so encouraging to hear all the ideas and all the thoughts and just to Daryl's point. This isn't the only opportunity, as obviously there's consensus about renaming Bennett Park and the parks Department wants to hear. You know the community's ideas and recommendations and concerns on that, but I hope that some of the arts organizations that are on this call will take some of this information. This energy, all you know these histories that have been underrepresented. It seems like there's so much to draw from there's so many stories that can be told about the strength of this community about the different immigrant communities that have gone through here. So I just feel like there's so much content that can be mined. And can you know to Danielle's point? You know to connect, there's so many more there's so much that we can draw from I guess creative capital from this, so I hope this is the end of this conversation, this type of dialogue. This is so not the end of this conversation, and this dialogue and I am grateful to everybody for their suggestions and for bearing with me in an unusual country. Usually we have all of these conversations and then they're very directed to a reso and I really appreciate people's willingness to just go on the journey of a conversation and not feel like we had to come up with an answer, but that we could just sit with our questions and then figure out together. What's next, that fills me with optimism. So thank you for that before I recognize Naima, I'm going to just I am embarrassed. We've got Wendy Olivo right I was wondering if you want to save that, for the elected officials, part of our conversation, okay, no, she had her hand up for a long time and I'm just gonna unmute her and Wendy what you got hi everyone. Thank you for having us. My name is Wendy Olivo senior Advisor for assembly member Al Taylor, and it is such a pleasure to have listened to this whole very constructive conversation, and you know the assembly member last night. We were talking about this because it was mentioned in the Department of Transportation Committee because of Bennett Avenue. This is such a beautiful conversation. I have learned so much of all the possibilities and all the history that we can. You know discuss, and you know thank you so much for having this very constructive critic. Conversation and I hope that we can continue to put our minds together. So this is, you know. Barbara said this is so many layers of so many different people and history. That should be recognized again. Thank you all so much for having us and I hope that, once we are standing at that park, dedicating it to you know wherever it's gonna go it will. You know, bring about this unity that I see here in this conversation. So, thank you all so very much and see you at the next meeting, and it is such a pleasure to be at a CB12 committee meeting where a conversation has been so beautiful. Thank you thanks, Wendy, thank you. Okay, Nima you're gonna get the last word on this and then I'm gonna go to. Then I've got a follow-up question for Natalie and then I'm gonna go to Jen for her report. Liz. Thank you. So much I almost feel like just not saying anything because, as it's been said, it has been a beautiful conversation. It's been very thought provoking it's been very. This has been very powerful, I guess just to put it all together, something that Barbara mentioned something that Daryl mentioned just the idea of recognizing all these different communities that have made up the land that we're on starting with the Lenape, but also recognizing the do I say the african-American, the slaves that also were here on this land and the fact that we're having this conversation, because the gentleman was a racist, was basically running black people through the mud, with everything that he did and so I just want to. You know reiterate that when we are thinking of these renamings and all these different locations, whether it's streets, Parks, Rotundas whatever it is that we do. Keep that in mind of you know our black brothers and sisters as well, who also make a part of this community and I feel a lot of times feel left out, particularly here in Washington Heights, and thank you yes, okay, Natalie is back on the call, and there was a question that Maggie had asked earlier about. The recycling I feel really bad going from something so lofty to something so mundane. But thank you again. Everybody for an incredible conversation: that's as best I can do for a transition. Natalie Maggie had a question about what was the mechanism for awarding the recycling challenge grant and what was the mechanism for determining the ultimate recipients of the funds? Did that come from the borough president's office am I under the so the Manhattan paper challenge was an initiative from a private organization, Pratt industries that does an incredible amount of paper recycling and in collaboration with the broke president with the Manhattan borough president and with the specifically with the Manhattan borough, president's solid Waste advisory board swab. They initiated this program and they set aside these pockets of money and the paper waste reduction numbers were based on department of sanitation numbers, so the district of Washington Heights Inward community district 12 from 155th to the tip of the island, managed to place first for the fourth quarter at different points, different quarters. There were different boards that scored higher and were allocated funds. So this is I think the third goal of awarding these, and so the way that they had set it up was so that the community board, with no specifics, oops, sorry, I, don't know what happened. My computer started singing so with no specific guidelines other than the local community board leadership would be able to select the recipients they and in most cases they were supposed to select one, but other boards had already made. You know set up the precedent that we would really like to pick two organizations and so community board. My understanding is that they also did that, but the individual boards were not given any rules or restrictions on how they would select the recipients, just that was what their task was to do. Okay, thank you for that. So Maggie I, don't know if you're still on the call, but if you are I will reach out to the board chair and the district manager to find out more about what was the process after that so Elizabeth, if I may, and just because I'm I will be looking at YouTube for the piece of the conversation that I missed. I'm very glad that it went very well I just did want to you know to transition back to, because in government we deal with the small and the sublime, and you had been talking about the inward rezoning earlier and I want to bring back to people's attention that one of the things that we all advocated for and that EDC kept assuring us would be part of the inward zoning agreement, but was never really detailed in the commitments was wayfinding for both first people's sites, as well as the 212th street site of the enslaved african burial. So that is a piece of Inwood's history that should be part of that conversation and we certainly in the Manhattan borough president's office, included it in the response to the Euler application for the inward zoning that we wanted that memorialized in some way it is private property. It has been acquired by a certain group and I think that there is an opportunity to right wrong, no matter what ends up being developed on that space. For this board to ask that whatever is going up, there include something, a sign, a garden, something to acknowledge. That is the place where enslaved Africans were buried in Inwood. Yes, thank you for that reminder. I appreciate that and I will, even though you've made that comment here, I'm going to ask nobles to put that cover. Yeah I already did all up in the inward re-zoning section of yeah. It's there. We got that way better flow. Thank you for that. So with that without further Ado Jennifer, do you have additional items for your report? I mean usually there's a lot about capital and stuff, and we covered that and I see that you've been answering some questions in the chat, but are there other items that you have to report to us? No I think we covered it. Just additional work at Highbridge that wasn't I, don't think was mentioned. Was the five million water tower is going to be reopening in July? Okay, there are several other projects. We have that we're waiting to hear from oh and beyond, at high bridge, it's Kiscay bathroom and the HVAC at the recreation center and multiple other sites. I think we covered most of it, but if anybody has any questions on a park issue that they didn't write in the chat, I'm happy to respond. Okay, thank you. So then I have three quick things before I adjourn. One is Paola. If you are I, know you're on the call, because if you weren't on the call there wouldn't be a call for any of us to be on, if you can do me a favor and whatever is the internet zoom magic that you do make sure that you send me the full chat that way, if there's anything in terms of hard to spell difficult to pronounce words that we want to make sure captured in the minutes. We have that, and there are a couple of items of follow-up that I want to make sure my almost 60 year old brain does not forget. So if you could send me that would be wonderful. I forgot to announce when we were in the community organization round table that taking off my parks, Department parks, Chair hat and putting on my synagogue, hat next Wednesday. If you're not doing anything and you like klezmer music, I, welcome you to dial in to assume that we're having a fantastic klezmer concert, modest donation, zoom link, it's really wonderful music that will have you dancing around your living room or wherever it is that you have. Your computer feel free to reach out to me for information on that, and if there is no further business motion to adjourn. I would like to adjourn this meeting in memory of my friend and former colleague. Tony Cardona got it. The record shows that thank you. No problem do I have a second, and if anybody wants more information on recent park renamings the park commissioner announced 10 city-wide on black solidarity day. November 2nd. There have been several articles about those two of them were in Manhattan at St, Nicholas Park, something for Langston Hughes and something for James. Baldwin I tried to put it in the chat, but wouldn't allow me to embed a link. Something really quick for the Manhattan borough president's office has capital funding for not-for-profits the applications open in January they're having information session, this Thursday the 10th at 11 a.m. So look at the borough president's website and you can see the link to register. Did you second or adjourning? We already seconded it Liz. You have the minutes and you have the minutes and you're sorry about that. You're all set excellent. Thank you. So much I appreciate you all and I will see you next week at our general meeting and thanks to the public y' all come back now you're here. Thank you. Everyone for all this great input all right. Take it easy thanks! Paola you're welcome good night guys. Thank you. You're welcome bye-bye night guys thanks! You.",
            "summary": "He had seen on social media for the benefit of people who, like aren't necessarily on Facebook, So we try not to have conversations over email, because it's not public.\nIf you have the ability to do it to change your name so that it's your name so that like, if you have your hand, raised, I, can call on you by name, and it also makes it a little bit easier when we take our minutes and we have the attendance for people for us to be able to say who was there.\nIs the community board 12 parks and Cultural Affairs Committee.\nThis evening, which is a discussion about Bennett Park, which I think will be, which I'm really looking forward to devoting.\nAnd I wanted for people to just hold that in the background, as they consider the parks renaming that we're going to be discussing later in the agenda.\nIn terms of oh, this morning, very important got to start my day off right with a parks.\nIt's metal, but it was, you know, shout out to council member Rodriguez for his tremendous support in directing funds to the parks department, which is the bulk of what no most of that renovation was the anchor park from the mayor.\nThat's in high bridge park along the entrance is that there are multiple entrances, but the main entrance is at like 164th street, across from the former state, elementary School and the correctional facility.\nIt has 83 different items related to housing, schools, infrastructure, road, infrastructure, small business and workforce community services, arts and culture and parks and recreation.\nSo Wayne Benjamin, who is the land use chair, suggested that each committee should take a look at the Poa just to see where some of these things are and are there things where we want to nudge our respective agencies, along in terms of whatever commitments may have been made under the inward rezoning.\nAnd I will send that along to you after the meeting, because it's too many things to do at once, but items 26 through 38 and then items 69 through 72 and item 75 relate to this committee, going in reverse order, Items, 69, 70, 71 and 71 relate to the Urpa the immigration research center and performing arts facility, and there was an RFP for that.\nThat's, going to be a hand up from Dave Hunt who I believe is looking to speak to the Bennett Park issue, correct, putting hand up hands up on that already eh.\nSo again, as I announced a little bit earlier, We are definitely going to be taking lots of questions on that issue, but not until we get to that point in the agenda.\nYou're going to have to like physically raise your hand and wave it so that I detect movement in the screen, and it also means that panelists can answer the questions in the chat.\nThink if I take questions on each thing it's gonna take longer than it needs to reopen the high bridge water tower that is in design and is moving forward as a construction, renovate the dikeman rest and transform the space into a welcoming.\nOkay award awarded for construction, excellent, renovate, Inwood, Hill park soccer field, one, that's another one of the ones that is on hold correct, It's in design.\nOkay, install adult fitness equipment in Inwood hill park, that's done, and people are using it.\nAs you know, we voted to have an Inwood rezoning task force that comes under the responsibilities of the chair, and there has been no report by the chair to the executive committee with respect to appointment of members or any kind of working structure.\nOkay, so I wrote it as a question in the Q&A as well, and I'm, not sure if this committee can help us, but the ring garden got 50,000 capital grant from borough.\nSo you know because I just don't think we need to have 91 people listening in on that, because it's a very specific technical, question.\nWe are excited that there are many neighbors stopping by dropping in as they wander along Broadway to see the exhibition and we're also pleased work plan to do another exhibition this spring on the terrace, and we think these are really important ways to engage the local audience who live around Washington, Heights and so forth.\nBut there isn't an approval process from the board, so you're gonna want to be in close consultation with your council member with your DOT reps with your these all these organizations and to follow this bill.\nWe, just confirmed our participation with artist Andrea Arroyo at the reimagined digital event, with New York, City's, missing them project on Sunday, from 12:30 to 2:30 p.m. We'll be posting that on our social media, basically reflecting on those who have been lost to the pandemic and her our public art installation in Roger, Morris Park, with Andrea of the same name, Covida will be on display until the end of the month.\nSo I basically wanted to fill the group in and let the CB know that the mosaic that you mentioned at the beginning is being installed presently at the northwest corner of 163rd and Broadway next to the pharmacy, and the mosaic was assembled by the artist Carlos Pinto and John Siri, and it's in progress and people are encouraged to come and participate, apply glue to some tiles that have not yet been installed.\nThey're, going to do a bald eagle watch meet at Henshaw and Dikeman Street entrance to Inwood hill park at 9.\nYou want to know more about your park history, You can join NYC parks rangers on Saturday December 26th to learn more about what pre-dated Inwood hill park, the different types of fuses that were there.\nI think we can move to the next item on the agenda, which is I, suspect what everybody is probably all here for the possible renaming of Bennett Park.\nBy way of introduction on this issue, I hope that people I know many people were here at our meeting last month, where we talked a little bit about why this is an issue that James Gordon Bennett, who owned the land on which Bennett Park now sits, was a 19th century journalist well respected in his field, who, As it turns out, is, was quite a controversial figure and a vowed racist, a secessionist someone who routinely used inflammatory language around African-Americans and slaves, who opposed Lincoln, who supported secession.\nWhy, when I saw a lot of different comments on Facebook I, frequently said things like.\nPlease come to this meeting, so I think that a lot of people have a lot of different opinions and I.\nI, don't want for people to think you know this is a timely, conversation.\nThey had lengthy conversations in several of their committees around the removing of the Marian Sims statue on central on Fifth Avenue in central park on the renaming the ways of honoring the exonerated five, because I think it's important.\nYou know we're not the first community board to get into a conversation like this, so I think it's important to look to what our colleagues and other boards have done.\nThe conversation about Bennett Park specifically, is new, but the idea of how do we honor people.\nAre there folks on the committee who want to just jump in we actually have, or people from the public.\nI feel like secretarial question, just really quickly, Instead of recording all of the names that say exactly what I was wondering if I could just give a summary of the conversation between board and community.\nUntil about a week ago, When the patch article came on at that time, I thought it was extremely appropriate to rename that park in memory of Jim Dwyer and the feedback that I got from the community was tremendous.\nThat completely goes against that to fight back against racism and therefore the Dwyer family came to the conclusion as wonderful as an honor, as it would be that it would be much more appropriate to back a suggestion that would represent a person of color to rename Bennett Park.\nFor three years, So there were many wonderful suggestions of people who are living and, As my grandmother used to say, we're not even going to discuss that, because I don't want to bring the evil eye on anybody who is living that feels.\nI, look and I see what goes on in this community and if those of you that knew her and those of you that have a memory of what it was like 10 years ago, a lot of changes were going on, and you know this would be something incredibly positive when you think how much she gave to this community and did to help and others like her coming up.\nMy grandfather worked very hard to make that happen and I think it would be a really wonderful way to honor, not only him again, but the immigrant community and the legacy in our neighborhood.\nMuch for hosting this conversation, I, similar to the previous commenter, am a local parent right along for Washington Avenue, and you know back before.\nPandemic rates were so high, was often in Bennett Park, as well, and I'd encourage the community board to help us kind of understand what this process is.\nI'm really appreciate hearing from you, Liz that you want to have the conversation be as expansive as possible, but I know that folks who frequent the park would also love to kind of understand how the process even works.\nBureaucratically, and the last thing I'll say, is having heard all of the wonderful suggestions about names that one thing I would like to propose that folks have been talking about in my smaller groups has been potentially reflecting the Lenape land that our parks are all on, and.\nWe may not so I think the I don't have a set road map for what this meeting will look like in terms of moving towards resolution.\nWe would then take it from there, but in terms of this meeting, I'd actually like to spend as little time as possible on process and as much time as possible just hearing from people and hearing people's thoughts so that we can, as a group figure out what's the best way to move forward, make sense to everybody.\nI started a Facebook group called Bennett Park parents a couple years ago after my son was born and it's grown and people have really become involved with the park.\nAnd I was very aware of the renaming of the Gordon Bennett Award to chief Ganci and I, just kind of wanted to follow that, with a renaming of our park, I thought it was appropriate, and one of the suggestions in our group was that I really took to was what was just mentioned: kind of giving recognition to the people that were here, and you know pretty much devastated the indigenous people that were on this land and had names for the land.\nAnd I have been trying to reach out to local indigenous groups, still kind of waiting to hear back, but I think it would be important to reach out to them and get their input and not speak for them, because this might be something they don't even want.\nI did also want to say one thing that I forgot is Bennett Park, like many other parks, has interpretive signage, with some fairly lengthy text talking about the park and if indeed, we do make a recommendation to rename the park.\nAnd I guess, The unspoken question that others may have is part of the reason why it's important to have this conversation here, as opposed to on Facebook, is so that the minutes can reflect all of the different names that people are recommending.\nI, Don't think we should decide for the indigenous community, but we should collaborate with a member of the Lenape to decide if they would like an indigenous name.\nAll of these names and the history of the park is just like sending me down a rabbit.\nFernandez I live right across the street from the park, and you know my kid is 13 years.\nLike many people on this call with kids, have spent a lot of time in the park.\nSo I just want to appreciate Daniel Glover for starting the conversation in our Bennett Park parents group, and thank you Vanessa for what you just said so powerfully I just want to agree.\nAnd I want to throw support, Daniel and the rest of the group with collaborating with the Lenape peoples to find a name that they think would be appropriate to name the park and as the everyone's covering everything I would have said.\nOne thing I would like to say is that I think we are at a very crucial time in history.\nI had asked Richard at the last meeting to reach out to the fire department to get a little bit of information about what their process was in renaming their Bennett award.\nThe issue had been coming to within the fire department and actually raised, especially by someone who had been given the Bennett award, that it was just not an inclusive way of honoring people in the fire department and that the name should be changed.\nWhatever is the discussion that we're going to have around Bennett Park.\nHaving said, that, I want to add my own suggestion for a name that might make that we should consider, and that would be to consider naming it Sosua, Park or Sisua Square, which would be Sosua, which would be a way of acknowledging some of the intersectionalities in this community ways that different parts of this community have supported.\nThe need to acknowledge, but I also want to point to the erasure of black people and black history in this community.\nWe don't acknowledge the pain and the suffering that has occurred to black people in this community and to hear all the comments about all of that and not really deal with the who this person directed his hatred toward like Maya Angelou said when you take something for someone give it back, And, so I think we need to figure out how to address that pain and suffering caused by this man to the people.\nSo I just want to thank everybody for taking the time and all the comments have been extremely informative and it's been extremely heartfelt to see all the names and the suggestions just because of how important this is.\nYes, there is a gentleman named Michael, who is a former FDNY firefighter that mentioned in the chat that he would like to speak, but I, don't think he raised his hand.\nSo I, think we can look at this in an imaginative way in terms of the park and the playground.\nAnd I think we want to look throughout our community hoping.\nI was not expecting what we're getting today from the community and in general, How I wanted to put my hat in the ring as far as representing and showcasing and highlighting the indigenous folks of Manhattan, especially those that were uptown and I, wasn't sure if there was going to be a lot of support for that, because, typically, unfortunately.\nNobles native american culture is very big in me, and the injustice that has been done to the indigenous people of this country is horrible, and everyone here knows that, and so that being said, I want to fully put my support behind the Lenape, having the right to name Bennett Park to whatever they want, and if they do not want to do.\nThat, I still think that we should honor it for the indigenous people of this land, maybe not specifically Lenape focus, but maybe something a little bit more broad.\nSo I also want to say that I'm very pleased with how this is how this meeting has been going, It's, really nice, to see folks working together in a really positive way.\nYou know, I, just want to bring it to a broader conversation and maybe not rush us into naming it.\nThere are various new, like gates coming up in high bridge park that you know can be renamed.\nThere's, overwhelming support for the idea of looking to the tradition of the people whose land this was first for guidance on how best to rename this park.\nI do want to throw out that, through this process and through the wonders of Facebook and Wikipedia, I did learn about Lamar Bennett, who was an african-american sociologist and historian, who worked on a lot of the storytelling and reclaiming african-american history and how you talk about memorialization and how you have these very conversations.\nIn light of this conversation, so I'm gonna recognize Jennifer, in, So I just want to say you know this is the, This, isn't the only opportunity.\nAs obviously there's consensus about renaming Bennett Park and the parks Department wants to hear.\nAnd I really appreciate people's willingness to just go on the journey of a conversation and not feel like we had to come up with an answer, but that we could just sit with our questions and then figure out, together.\nRight I was wondering if you want to save that, for the elected officials, part of our conversation, okay, no, She had her hand up for a long time."
        }
    }
}