{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCESA129fi17yddOjOdPigag",
            "title": "Manhattan Community Board 8's Special Meeting",
            "publishDate": "2020-09-03",
            "shortDescription": ""
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "9/18/2020",
            "status": "live"
        }
    },
    "properties": {
        "fillerWordCount": {
            "uh": 9,
            "um": 9
        },
        "wordCountFullTranscript": {
            "room": 13,
            "breakout": 12,
            "meeting": 7,
            "people": 6,
            "guys": 4,
            "second": 4,
            "screen": 3,
            "candidate": 3,
            "board": 3,
            "motion": 3
        },
        "wordCountSummary": {
            "candidate": 2,
            "job": 2,
            "people": 1,
            "applicant": 1,
            "guys": 1,
            "meeting": 1,
            "order": 1,
            "section": 1
        },
        "fullTranscript": "Now enough people did say that they're coming to be a quorum. We just go we're just going to wait for a few more minutes. I mean we'll just wait. I have a note on the computer that says that it is streaming live on youtube. Only this part where we'll set up a breakout room so that I will be moved into the breakout room. No one else will be able to join it because that will be controlled by will won't be in it and we'll have utter privacy and it won't be recorded. Okay. Thank you. You're welcome. Well, did you, I see it looks like I'm co-hosting. You are co-hosting, I'm also going to make the secretary's co-hosts. I don't see anything here about a breakout room, though it's hidden, because I'm sharing my screen. Oh okay, so you're almost at quorum. Just to let you all know right: okay, good, oh god, someone left yeah chuck warren just left. He can't be bored already, I'm sure he just had connection. I know I'm just joking. He must have just joined and then left immediately because I've been tallying. I must be very dull. I know I have a sense of humor. That was a joke. It was good. Oh, it is a little. Let's get started yeah. We just have to wait till we have 26 people, hopefully we'll have them and then we'll move. I don't want to waste your time by starting to talk about a candidate. If we don't have enough people to vote, not a candidate, I'm in a job applicant job candidate just need three more so right. No, we need four more because will you're one of the people, no he's not, but enough yeah like in the participants right, but you need 26. yeah. So four, more yeah, four more without you do you want to send any emails, will to the people who said they'd be here and they're, not here yet. Well, I you just had brian join and let me answer the phone call. That's coming in it's wilma! Okay, oh okay! Well, will move us into that breakout room. I think you guys need to bring the meeting to order and then vote to go to executive section. Oh okay and that's when you guys can all move to the breakout room: okay, we're gonna be official, which is the right thing to do. Sorry, okay, so it's after five on thursday september. Third welcome to a special cb8 meeting to on a personnel matter. This is an executive private meeting, so we will not be welcoming the public or any of the board staff or any public members of the board. This meeting is for full board members only is there a motion to begin that personnel. Meeting. Marco, yes motion: you can unmute yourselves by the way you're, not it's not a regular meeting where you are muted, automatically and permanently without a muting, so barry yes, so second move to adopt the agenda. Okay! Well! Thank you. Elizabeth! Is there a second for that? Our agenda item is the first second okay: will you move us into a breakout room? Then I will thank you all start to get a message in a second to move to a breakout room, at which point you will not be recorded and it will not be streamed online will. Can you still hear me you'll just push as people join? If anyone else does you'll move them automatically, I will okay and rebecca will keep track. Thank you. Does this work? If I'm on audio only I should okay, brian. Did you get it wilma? I see you're here, I'm gonna you're going to get an option to move to a breakout room and that's where everybody is voting. Felice you're still in the regular room, you may have to click something on your screen to join them. This is bob right got in okay, great I'm gonna, rename you and then I'm gonna move you into the breakout room where they're all meeting for the executive session. Okay, thank you. I also see there's an iphone user is they can unmute themselves if they want to tell me who they are sherry, I'm going to move you over to the to the breakout room. You'll have to select something on your screen to move. Did you guys vote to adjourn yeah, I'm not sure where they are I left for me. I left the breakout room, so I'm back with you. They should. They should probably go to adjourn but yeah after we fire. You, though, oh I hope. I hope that was the resolution to a leader. Wouldn't would let me put it on the floor thanks guys, okay, I'm leaving bye. My lips are moving you're, not hearing me okay, so the vote was 27. Anthony was unable to vote 27 to nothing in support of hiring max. So thank you very much to the secretaries. I see rebecca is the only other one here, and so we should adjourn this as well. We adjourned the meeting in the breakout room, since that was the whole purpose of the meeting. Anyway, there was a proper motion and a proper second to adjourn beautiful, okay, so you and I should have a phone call, but this is adjourned. I'm gonna stop, recording and stop live streaming. The weird conversation we're having well, I just meant so that.",
        "summary": "We don't have enough people to vote, not a candidate, I'm in a job applicant job candidate just need three more so right.\nI think you guys need to bring the meeting to order and then vote to go to executive section."
    }
}