{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCGDansqZAB2jTXYNvgeDI5Q",
            "title": "Top chat replay",
            "publishDate": "2020-10-20",
            "shortDescription": "",
            "lengthSeconds": "3:48:05"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "f-oiOZswzK0",
            "fillerWordCount": {
                "uh": 495,
                "um": 448
            },
            "readTimeFullTranscript": "115 min read",
            "readTimeSummary": "11 min read",
            "wordCountFullTranscript": {
                "building": 132,
                "windows": 80,
                "street": 58,
                "door": 46,
                "floor": 39,
                "plan": 36,
                "facade": 33,
                "entry": 33,
                "glass": 32,
                "color": 30
            },
            "wordCountSummary": {
                "building": 26,
                "street": 15,
                "door": 11,
                "landmark": 9,
                "windows": 9,
                "entry": 7,
                "ramp": 6,
                "floor": 5,
                "avenue": 5,
                "design": 5
            },
            "fullTranscript": "Will hi Jane, you hear me? Okay, sorry, absolutely! I can get in through that link. But tonight I could not oh the one that I sent you in the email or the other one, the one in the email no and I had to use the passcode, and you know the I d number normally I do not yeah anyway, it does not matter. Let's see it's almost 6:30 is not it 6:20 99. How many board members are there? I see Elizabeth, I see Elita Marco, Anthony and Michelle okay, I know Sarah's going to be late and Kim Kimberly can't come tonight so and oh and christine is also on the phone. Okay. Thank you. So you know. Oh sorry, go ahead. Oh do you know is David joining us. I'm assuming he is, but we'll get started anyway. Is the is? Oh sorry all right, David's on Gail's, also on so most of the committee is here David. Can you hear me David? Can you hear us you just have to unmute? Okay, oh David. I just wanted to. I should have called you earlier, but I handled I've already written up resolutions for number. Three and number six because we heard number three we heard last month and then they've come back again same with 1022 Lexington number six. So what would you like me to do? Well I'll, take number one the hard one I'll take number one as well, and you can take the three others. I do not think they're very difficult, which are the that's three. That's the other. The ones that you have not written up are two four and five. Two four and five that's correct and I'll. Take number one which looks complicated: okay, nothing's ever uncomplicated, but that is so true is not it. Okay, I think we're going to start well at 6:30. You might want to say a few words about the process, all right, we'll get going. So let me get everything set up all right well for anybody. This may be their first time at one of our virtual Community Board committee meetings, you'll notice that everyone is muted and you're unable to unmute yourself to participate with us during the meeting over the course of the meeting. Whenever Jane and David ask for public participation, you'll use the raise hand feature that you can find in your participants menu at the bottom of your screen, so you'll click on the word participants that has a little image of two people standing next to each other with the number 37. That number will change over the course of the meeting. But if you click on that button, a new box will pop up on your screen. That has a list of names at the bottom of that list. There's a button that says raise hand you can tap that once and we'll see you and your name will jump to the top of the list and then Jane or David would ask for you to be unmuted in turn as you go through as we go through the participants. If you have any questions during the course of the meeting, you can always chat me. The chat is only really for asking questions about zoom. It's not for asking questions of the applicants. They will not see it with that. I will return. Yes, you have a question so Jane, so the ones that you've written up because they we had them previously. We are not going to discuss them. Is that correct? No, we will discuss them, but I've already, we've already heard them before, and we have the existing resolutions which I wrote up so I'm sure there'll be adjustments to the resolution. Okay, I understand. I understand what you want to do: okay, yeah, so that would be number three: the party synagogue and number six 1022 Lexington and then I'll hear number one now which is 135 E, 71.. Okay, so we go one two three, then I mean you do one and three, then I do one you. I do two four or five and you do six correct. Thank you David. I should have gotten in touch with you. Okay, we're going to start. I'm not sure it's weird how many people are there, but this tonight is the October meeting of the Landmarks Committee of Community Board eight, and we have six applications before us. We will start with number one. We are here to listen to the applicant, hear from the public and then go into executive session, and our mission is to vote on the context and appropriateness of the application within the historic district, and we do have one individual landmark tonight as well. So with that we're going to go right to 135 East 71st street, the eppery side, historic district. This is an application to reclad the first floor. Exterior we play storefronts, amend the window master plan and propose a signage master plan. So will is the applicant here I've seen Noelle yes, and is there anybody else on your team? I mean Josh. Is here, here's the he's the board president, but he won't be presenting. But if he needs to put some, you know have some input in he's here as well, and Mary is here she's on the board, I'm so sorry you're presenting for the applicant? Yes, and what is your name again? Noelle Fontaine Noel, Fontaine, okay and you are with Crowley engineering or no catholic engineering. Yes, I'm sorry. What is the name of the firm Cowley Engineering? Oh just know r C o W L E y. Yes, oh thank you so much. Okay, thank you and I'm assuming you're going to do a screen share, so we can see the drawings yes great. Okay, so you may proceed okay, and can you see it? Am I up yeah? Thank you! Yes, okay, so our proposal is to reclad the bottom story of 135 East 71St street. Along with that will be signage and the storefronts will be they'll, be revised. It's a it's a strange building. It sits in the Upper East Side, historic district, but only half of it sits in the historic district. The northern portion does not it's only the southern portion of the building, it's two towers that are separated in the middle by just a low area that has a storefront. So, as you can see, it's located right here in the Upper East Side, historic district and half of it is in and half of it is out. Here's a shot of the building the tax photo from the 1980s and the current photo. Now in the in those 40 years, 30 years the awnings have changed, but basically the building has stayed the same. Lpc has it as being erected in 1955 and the architect being H.I Feldman, but the engraving at the building entrance says it was the architects were sylvan and Robert Beine and that's what the DOB has as well. For this we will I'm going to refer to the north building in the south. Building the north building is not LPC. The south building is it's a long building. It spans the length of Lexington avenue, 71St, Street and 72nd street order it. These are the existing conditions. The storefronts are in pretty bad condition. The frames of the storefronts are different. Metals they've had an issue with the granite cracking at the fronts, and the planters also have issues where the cladding has been separating from the front. I no matter what the building has to go through some work because of the damages that have just been done over the ages. The windows are, are not energy efficient, so we need to replace all the existing windows and let me just get my notes: the awnings are not LPC approved and they are all mismatched. The arrows here show the locations of the photos, so this page has the photos are at the 71st street side, which is the south building, and it is the LPC side of the building here on page six are some shots of Lexington avenue storefronts again, this is the southern portion of the building, which is the landmark side. As you can see, the awnings are all different. There is no matching the only the only thing that makes them similar is the size and shape. Colors are different. All the logos and fonts are all different. This is the separation area. There's one store in here, and there is a very large vent that we will be. Removing this portion of it is not in the landmarked portion. Landmark starts at this red awning. These are some photos of the northern part. As you can see again, the fronts are damaged. This store in particular, can not have an awning because of the height it won't meet code. Photo number two shows the area under the awnings. This building, when it was constructed in the 50s, was constructed with retractable awnings. They were they've become damaged over the years and the current awnings cover those existing retractable. Awning air areas and new master plan will comply with all the LPC regulations and they'll be flushed to the facade. No more the awnings will be removed, and again this is the northern side of the building, which is not landmarked. I believe, there's nine store fronts in total page eight shows an original rendering that was found in the super's office of the building back in the 50s. The rendering shows that originally the lower area was going to be a gray-, clad granite and we are proposing to put the gray back right now. It is red and LPC actually calls it yellow brick, but it's not it's really a red orange, but their description is a 17 story. Apartment House, Yellow, brick facing above polished, stone, ground floor setbacks begin at the 12th floor, terraced Roof, with gardens the building is listed as having no style and therefore does not contribute to the architectural character for which the Upper East Side historic district was designated. We're hoping to bring back a little more beauty to the building. By putting this gray facade in place of the current red, you can see this red at the engraving on 71st street with the architect's names. This is the listening at the bottom of the painting which is cut off. These are the finishes we are proposing. The light white granite is proposed for the columns and the darker for the facing the value will be the same as the existing red, so it will not be a lighter or darker color. The black is showing here is the proposed colors of the windows, and that is part of the proposal as well, because right now the windows master plan, the windows are yellow and that's the upper stories, and they are actually painted like that. In this render, bearing the we would just be changing them over to a black that would match the granite. Is that all rendering that's the windows on the lower level? I'm sorry, I'm a little bit confused, only yeah only the windows on the lower level. As we look at this page, only the colors would change. The layout of the windows would not change. The windows will remain the same. So you're changing the color from yellow to black correct. Thank you only for these lower levels. The will remain the same. I'm sorry if you could repeat that I am having an internet problem, so it's unstable and it freezes on me from time to time. I did not hear what the color of the windows above the plaque. The current colors are yellow, I'm going to say between a yellow and a white. I'm not sure. If I have any photos, I here you can see them here. That's the existing color of the windows, and that is, as they are listed in the Windows master plan through the LPC they'll remain that color. They will remain that color correct and it's only the windows at the lower level that will be changed to black. Yes, all work is only on the lower level. There is nothing above okay. Thank you! That's okay, that's yeah! Only the lower level is being is being revised. So here's the rendering this is the an elevation rendering of the first story on 71St street. There's a garage entrance on the left. This stairwell goes down to the base spoon. The front end is fully main. The columns will remain the same color they currently are we're just proposing to put a small reveal in the columns, as well as on the planters, to give it a little bit more texture. It's a very plain front. The planters on the east side will be lowered slightly about 12 inches and that's for the planting. It's a very tall planter they've had multiple problems with leaks, it'll allow us to put less soil in it, and it'll also you'll be able to see the plantings a little better, but the layout of the windows. These elevations show the south and the north side. Again. The south side is the landmark side. North side navigator is at the end of the southern building. So right where my, where my arrow is so the proposal for the storefronts, I'm just going to get to my notes, it's a bit of a tricky building, because it's on such a slant on Lexington avenue, the problem that they have right now is the windows are extremely low to the side. Walk at some. Only about six inches above the sidewalk, where the window actually begins. The granite is such a small area that it has cracked and they've been having problems with the storefronts and holding the windows up the wall that holds the store fronts up right now is only four inches wide, so our construction of the new straw fronts will differ. Also, the size of the windows will differ only because to get the energy conservation code for the the new window panes, we can only make a certain size, the windows right now. If you look at page 11, the Red outlines show the existing windows and the black shows what we're proposing the existing windows are much larger and we are raising the sill so that we can get the energy code windows in, and the windows therefore, will be smaller slightly smaller, very slightly very slightly. If you see the red lines, yeah see how close and that's to me so amazing energy go ahead, yeah, that's to meet energy code and also for the windows. I believe there are two windows where we actually can't make a window that size at the northern section on 11. This window needs to be divided when the new windows go in only because they can't make a piece of blast that size, the signage that's being proposed, will all be the same north and south building we're proposing that both buildings will be the same and every tenant will adhere to the to the signage that's being proposed. This is a sample, it's a black background with a stainless steel lettering, and this is the font. I actually can't read it. I can't remember the name of it, but that is the font. That's been chosen to go on all storefronts logos of any store would be allowed background with what kind of lettering I'm sorry the lettering is stainless steel. The background will be a black aluminum which will match the storefront right and we're hoping to we're hoping to have the building blend in to the community and right now, it's kind of a mishmash of a lot of different things, a lot of different colors. We want to give it uniformity, page 13.. These are the details at the planter and at the column, are there a slight reveal to be put on the granite just to give it a little bit more texture? This is the detail of the planters that will be. That will be. This planter will actually be removed and rebuilt because of the leakage going down to the planters are basically above grade. Is that correct? Yes, and they do sit on the West side on 71st street? That planter sits at the the stairwell so below? That is the stairwell goes to the basement, the East side. This is the detail of that planter. The basement is below, but currently there's a lot of soil, it's about 12 inches higher than what we're proposing and it's a lot of soil in that's being held up by the slab that is above the basement. Thank you. You're welcome. These are sections at the storefronts. This is the existing storefront. As you can see, it's about a four inch wall. That's holding up this current the current glass and this height varies because of the hill. This is the existing awning that are not being used anymore. They're awning boxes, they were retractable awnings and none of them are in use any longer. Our proposal at the areas where there is no awning, which is a couple of the storefronts we will clad the front but where the awning is we'll enclose it, and that is where the signage will go so that 12-inch piece of granite, that is now the awning that will remain that 12 inch piece of granite. The science will go above and that's where the awning is right now, so the layout of the cladding above the granite will remain the same, and the 12-inch piece of granite will be where the signage goes. The new storefronts will be built with cmu blocks so that it can hold the extra weight of the new windows and a decorative element will be placed under the sills, which will be an aluminum, a black aluminum powder coat to match the storefronts, and now it will be the insulation will move to the inside and it will all be energy they'll all be energy efficient storefronts. We are also proposing some different lighting. These are the existing sconces at the 71st street side. We're proposing something a little more modern that will go with the storefronts and we're proposing this new door at the doctor's office, and I can go back up to that front. Here is the doctor's office and, as I said, the existing front doors will remain. I do not think I missed anything. Josh and Mary are also on the on the zoom call. If they have anything to add. I do not know quite how you guys work with other people speaking well. Normally we go to the public, but if your team has something else to add, I think you covered just about everything. I just I'm the board president, and I just wanted to say I'm here to answer any questions that you have you all covered. It quite well we're hoping to move forward with this if it's a if it works within the context of your needs. Thank you. Thank you for coming, will. Is there anyone from the public who wants to speak to the application right now? No one has their hands raised and just because there are a few people who joined after the start of the meeting, you'll just need to use the participants menu at the bottom of your screen to open the participants box and use the raise hand feature for us to call on you. Thank you will if there is not anyone from the public, we can go right to the committee and I guess, go in alphabetical order which we've been doing in these zoom meetings. Okay, Michelle, I'm going to lower your hand and we'll get to you as we go through alphabetical order, so first would be Elizabeth, Ashby Elizabeth. I think this is a perfectly acceptable plan seems to tidy it up a little bit. This is not the most wonderful building in the city, so I do not think that we have to be too strict about this, but I think this is a perfectly decent plan for a 1950s building, which is not my favorite era. Thank you, Elizabeth next would be gilbert. I think that you really are achieving the uniformity that you're seeking. I do have a question where you're lowering the planter about 12 inches on the east side. Have you considered lowering it on the West side so that you would have more symmetry, or was there a reason that you're not able to do that? The reason is because it's the stairwell okay, so we actually can't lower it. If we could, we probably would but it's the stairwell, so we have to keep it at that height, okay and I'm curious with your window master plan. So this is an amendment, but as far as the entire building plan for the upper floors are the windows at this point to remain, as is for the near future, as is okay, the only changes to the master plan is the color of the windows on the 71st street side. I believe, there's four windows and it's only the color to match the granite. Great. Thank you you're welcome, I'm finished will thank you next would be Michelle. Thank you just a couple of questions. What are the dimensions of the planters? I know you're lowering them 12 inches, but so what will the height be? I, the height, is, will be about 30 inches, but it varies because there's also a slope on the 71st street side, so it ranges between I'm going to say 30 and 36 inches, okay, right now, they're and they and it runs the whole length of the building the plant. I know that planter only no. They only run there on the 71st street side and actually, let me pull up the elevation, it's easier to show you the planters. This is the 71st street side, so this is where the stairwell is and to the right is the planter. And if we go down to the 71st street elevation, that's the length of the planter on the Lexington avenue. If you were standing on Lexington avenue, okay and on that's on 71st, correct, yep, yeah, okay, 72nd, nothing is happening. 72Nd is not landmarked, but everything will be as it is on 71st street. But there are no planters. There is only an entrance and one storefront window. Okay, so it will be re planned to match all right: the doctors, the color of the doctor's office door. Yes, are there any other doors that are near that and are they the same color, it's the same color as the entry doors on 71st street, and it will remain the same color, so it will be to match that oh yeah that'll be to match that stain on the front door. Okay, what are the what's the sizes of the light of the lighting, the lighting fixtures? How big are they? Let me see if I can read it comes in two sizes we were going with, I believe the medium which is 16 inches, high, seven inches wide and two inches deep. Okay, that's is that much bigger. It does not look like it's much bigger than what's existing. That's probably about 16, no looks so that's not a problem. I wanted to ask you about the awnings two questions number one. You implied that the awnings were there. They were non- compliant, in other words, somebody just put them in there yeah. I do not know how when they came in, I'm not sure if they were installed before it was landmarked. The only thing that's non- compliant about them are the sides. You can't have enclosed sides for the size of them. Okay, it's just that. The sides you can see here are enclosed, but you're removing all of them completely, and I believe that they were enclosed because the awning underneath where the retractable awning was, is I mean it's so ugly? It's you know it's a metal piece that just fills in that 12-inch area above the windows, so you believe they wanted to cover it well, I was not quite clear you differentiated between those windows that had the detractable retractable and others that did not and how you're treating the stone. I did not quite get that the retractable awnings were there in the 50s. There are none existing anymore. All the awnings that are on Lexington avenue now are non- retractable. They cover where the retractable awnings were originally, but you said that you're treating one of them that has, I guess the mechanicals of the. I did not quite get that the mechanicals of the retractable. I think I think I can. I think I confuse you with the nor the northern portion. If you look at photo number one on page seven, this particular awning can't it can't go over the street because of the height won't be code. Someone could hit their head on it just because of the slant at Lexington avenue, so that storefront in itself. I believe it has two fronts to it- can not have an awning that would overhang the sidewalk but you're, eliminating all the awnings anyway, so yeah. So you remember that you know to say to make it to make it universal, because this one can not come out over the street. All we're going to get rid of all the awnings. It makes everything a lot easier not to have the awnings. No, I get that what's confusing me is if you're removing all of the awnings, including that gray one with the White Stripe, because the height is not does not need code if it comes out over the street, so you're removing all of them. So why is that location being treated differently? That's what I thought I heard you say I may have misunderstood. Oh no, that's not clear vacation any differently. It will be the same. It won't be treated any differently. The signage will be the same, and also this is on the northern section. This is this is not the landmark section, but it will be treated the same. It will have the 12 inch by the length of the storefront, the new, the new signage, the band and Noel. Could, I maybe just add a little bit for Cl yeah. Absolutely. Could you maybe pull up the Lexington avenue Ren, I'm sorry the wide view of all of lex, the the rendering that we have the elevation that on lex so the buildings, it's we're two different residential apartment buildings. One of them has an entrance on 71st. The other has an entrance on 72nd and they join in that lobby. The retail kind of connects them and they're connected in the basement. But, as you see there, the second storefront in which is the left most storefront on the 72nd street building, because they're two different buildings, you could see, there's a big height issue with that storefront and so that storefront currently does not have an awning. It's got a little dinky awning over the door, but the full length of the storefront is a canvas flat top over the storefront that is was sort of improvised because of the nature of the height issues over that sidewalk. So when Noel was helping us come up with a unified look for everything that issue sort of drove everything and we decided to remove all the awnings so that we would have a unified look throughout. Does that answer yeah? It does so. Nothing special is happening to that. Building to that storefront, I just got the feeling that you were treating it differently, but in fact nothing is the other and I'm sorry to interrupt the other thing just to point out again, I know Noelle has pointed this out the entire lower elevation that you're looking at when it says Lexington avenue north that whole set is the 72nd street building, which, for reasons no one has been able to explain to me, are not in the landmark district. Okay, all right are those are those the windows that you're changing their size. No all of the windows where the size is changing. Are these larger windows on the south side, and it's only because we can't get windows as large as exist right now in those in those storefronts, but the configuration is going to remain the same well, these are sort of vertical. I thought that what you showed me was more horizontal. Now it depends on the storefront you're, looking at they're all different, like this is the northern side, where they are more horizontal and are you keeping them that way? See that here? Yes, any window that we can keep the size will be keeping okay. Terrific! Thank you very much. Yes, thank you. That was a big help. Oh and next we have elita our board chair hi. Thank you and I walk by this building a lot because I live off Lexington and I appreciate your efforts to make everything uniform. I know the north side is not. I have to say, though, that I do not like that the columns will be a different color. I think it would be more in keeping even though it's a building of no style. The landmark said it's still more in keeping with the period it's more elegant, there's already a lot of colors going on so I'd, say that, and I have to also say I up the framing and a metal door, I'm losing I'm losing her yeah Elita. Otherwise I think that I think that's it, but it I it will look. I think, a whole lot better than it does right now. I did not. I did not hear the second half of the question, but the the columns currently are white. We were leaving them that color kind of I do not know Josh. I do not know that we had any particular reason to change them. We were we wanted to make as the least radical change, knowing that this is a major change. We wanted to be as respectful of the existing conditions as we could be, and so we thought that we would keep the contrast between the darker color, which today is red and the lighter color, which is now a sort of a light, gray or a white which we would keep it in that in that color a similar stuff. That's why it just feels that they're there now that's how it is now. It just feels more contrasty with a darker gray and a light than with the red, but then that's if there's a historical context for it. That's fine and my second comment just had to do at the doctor's door that there's something about a metal plane framing and a metal door. That's what it is right that reminds me of an institutional facility. So it's not modern in the sense of some kind of 1950s building. I like the glass and the door handle, but just the rest of the door. Just strikes me as institutional as in not in a good way, but I am an outlier here. So those are my comments and thank you and thank you for working to keep the building uniform, even though only half of it is in his is in a historic district. I'm done! Thank you. Thank you. Next we have Sarah Chu, who I know just joined. If Sarah was not here for the presentation. Well, we can go to the next person all right, then after Sarah is Anthony. Okay. I think this is perfectly fine. Among my favorite, unattainable, antique stores in the city is La De Viv in this building. So it's a building, I know well, even if it, even if my connection with it is sort of standing with my face pressed against the glass but anyway the I think. First of all, this is fine, and I think that one of the interesting things about this is in fact that it combines the names of two of the Upper East sides, most iconic 50s and 60s architects, Sylvan and Robert Bean Father and son and High Feldman. Hi Feldman was more of a almost like super expediter in the 60s and 70s, and certainly Sylvan and Robert Bean have left their mark on the Upper East side for better or worse in many places. One of the things that's interesting to me, however, is that when landmarks designated this as a no- style, building, Upper East Side historic district is one of the few districts. That has something that is described as no style, and I think it's ironic that so many buildings on the Upper East side, which are these generically described as white brick. Buildings are in fact no style buildings. It's a an observation. I also think that the lighting, the new light fixtures are a huge improvement over the existing completely period, inappropriate sconces that you poor things have now. So that's it. I think this is fine. Thank you, Anthony next is may hi. I missed the presentation, so I do not have any comments or questions. Thank you thanks. Man next would be harrison, just mute yourself, you're, muted, right now, hi. So the plan sounds good to me so far. You know. I've got no significant issues with it. Sorry, for the background, noise, no significant issues with it, the design seems sound, seems like it will come out without disrupting the general architectural Gym. So sounds good to me. So thank you for your presentation, thanks Harrison, finally Marco and then we'll move to the public numbers hi. My I'm going to make two comments. The first one is, I think the proposal is a good improvement. However, I found it that the planning creates more contracts with the residential requiring, I think, is excessive, but still acceptable, and the second comment is: you are claiming the question about the existing windows. There are no efficiency. How come how? Oh, let me ask the question: how do the new windows become energy efficient and if you have the same, having the same size windows? It's just only a curiosity, nothing to do in my decision of. Are you talking about the size of no I'm talking about how you can't become energy efficient windows? Oh the energy. Efficient windows are two layers of glass with an ergon center, so they're a thicker window and when they're milled the machinery only allows a certain size. I believe it's 80 inches by 108 or something I can't remember the exact size, but they can only be made a certain size without special order and ordering the windows from someplace outside of the New York area. Well, I think the only thing I'm going to say, which is not part of the my opinion or in the final decision, is the only thing you increase one's 110,120 of 101. So basically, if you put double window triple window eagles window, there is no much difference. You did not show me, for instance, the details of a leakage which basically is another factor, but I do not want to continue in that direction, because we have many other applications and my opinion. My final opinion about this application. I would support. Thank you. Thank you. The next is our public number for the Committee Christina Davis Christina Starsix. Yes, thank you will no. I have no comments and I approve it as presented. It was a very good presentation. Thank you. Thank you. Christina. We have at least one board member who's, not a committee member who's here and that's Russell squire. If there's any other board members here, they would please raise their hand, so they can find them. Thanks will this looks good to me? I do not have anything to add beyond what has already been said. So so I that's thanks. Russell Jane and David well go to David first. My only comment is that I think the presentation, oh dear, we lost it graphically of what the actual building is going to look like other than that. I have no objections. I'm sorry! I missed your comment. David. Could you repeat it? Well, given my unstable internet, I'm missing an awful lot right now, so I hope when I act as the chair that I wanted to keep interrupting, to have people go back. What I said is that I was disappointed in the quality of the presentation. I thought it was very abstract and I do not think it showed the true character of what's really going to be, and I think we had to infer what that what it's really going to look like, but other than feeling that the presentation was not as realistic as so many of the presentations we see or is evocative of what the reality is going to be. I have no problems with it. Thank you David. I actually concur with David. I do think the presentation was not as concise or as informative or as narrowly defined as it might have been, but I'm going to approve the application. My sense it's a move to approve to so does anybody want to formulate a resolution will any hands up on that front resolution to approve as presented? Thank you David. Do we have a second thumbs up? Elizabeth gave a wave great. So could we go to the vote? Will yes give me one second, to get the screen up all right. Can everybody see the vote sheet yep. Thank you going to mute all the board members right now. Yes, and then I'll call the royal Elizabeth. Yes, all right, Elizabeth you're, a yes! Thank you gail! Yes, thank you Michelle! Yes, thank you elita, because I did not catch the presentation. I would just not vote. We we can't, I would not abstain. Is that abstraction is a no okay. If I, if I may not, vote yeah, just do not vote yeah, okay, anthony! Yes! Thank you! David! Yes, may! Oh may you're! Muted! Again! May sorry, yes, harrison NBC harrison. I will come back to him. Marco, yes, thank you, Christina Star 6., oh christina you're, unmuted, yes, yeah! Thank you! Kim is not here Russell. Yes, I saw Sherry here, but she left, so you have to go back to May. I oh amaze now is, may not voting he's not voting and Harrison was here, but I do not see him any longer. Okay. Well, it looks like it was unanimous approval. So thank you. Thank you. Thank you very much. A renaissance revival, apartment building designed by pickering and walker in 1911 12. application, is to establish a master plan for six over one aluminum, clad double hung windows in the primary facades of the building, and I assume there's somebody here to present. I do not see a name of a presenter, it should be Peter Folsom there. He is Peter good evening good evening, Ms, Parchell and Mr Halpern. It's a pleasure to be before you all again. It's been a while. I think our presentation this evening is relatively easy and relatively simple. Proposing is a master plan for the two visible facades of 969 park avenue to be in the existing six over one mountain grid pattern. Basically, the look of the building would be kept the same as it is with really no changes and we look around and see that most of the area in the vicinity of 969 is somewhat of a jumble or one over Ones 930 park. Avenue, for instance, has some nine over one windows on the third floor. 960 park has a smattering of eight over eights on the lower floors. 983 has a mixture of six of our ones and eight over ones in a spotty concentration. I'm really the only two buildings that have consistent fenestration with mountain grids would be Loyola at 978 park and the new building at 985 park Avenue. The Landmarks Commission has raised the issue that they think that possibly the original condition was six over six and we're asking the building to go with that configuration. But I would like to and tell the committee that the building has, since the 80s a unified alteration agreement that requires a six over one month and grid pattern, and that is what all of the windows that we're proposing for the master plan have now. So this building actually has a very lovely and a very uniform appearance, and the building would like to keep it that way in, and there is precedent for that since, for instance, 985 park Avenue or the 925 park, Avenue wanted to keep its one over one instead of going back to mountains, muntins and that was approved in the past. I would urge the the community Board to think about that to think about how well and how fastidious 969 has been at keeping their building Peter two things number one. I lost your last statement. Number two: are you going to share any drawings? I can share some drawings if you, if you would like, I think it's important. Otherwise, we do not see what you're saying okay, but if you could repeat your last, so this is the master plan for 969 park avenue, whatever your last statement was, and what I was last statement I was saying is that there is precedent for a building which has had a unified, cohesive plan for their fenestration in the past. That is not in an exact conformance with the historic or very original condition if they have maintained well, landmarks has ruled that they can continue that pattern and I was referencing 925 parcc, keeping their one over ones. Instead of going back to to windows with Munton grids that had originally been there, I was wondering: did you hear that I went through a number of buildings? I do not have to catch every word. I can also read the drawings. Yes Sir. I said I do not need to catch every word. I can also re read the drawings ultimately. So if you want to share your screen, you just hit the share screen button at the bottom of your screen and then select what you want. I thought I had done that already you have not yet you just select the one you want to share and then hit the button at the bottom that says, share. Okay, can you see my screen now? Yes, okay, and this is the building. It is at the corner of 82Nd and Park, and the two major landmark pods are the South Facade and the West Facade, and there is a little return around the corner that is also being included in the master plan. It's this facade here there are. There are a couple windows on this facade, as well as the 82nd street and the Park Avenue facades. These are the historic photos this which you can't really see very well here, but I believe that you were previously given a copy of the of the alteration agreement window rider that states that all windows must comply with having a six over one muntin grid. They will not accept anything else and have not accepted anything else since the 1980s, hence the the current uniform look and, as you can see, the building is very uniform and does look very lovely. This is the the East facing facade that would also be included in the master plan, so it would be the Park Avenue Facade, the 82nd street facade and this area here. The windows in the back courtyards that are not visible would not be included in the master plan and that's generally done, because those would be windows where shareholders would normally put in exhaust vents for kitchen exhaust things like that: they're not visible, and if they're not in the master plan, it makes it a lot easier for landmarks to approve variations. This is the existing fenestration pattern. You'll notice that some of the small bathroom windows do not currently have to have muntin grids, and this would be the proposed where those windows also would have a four over one mountain grid pattern. This is the 82nd street facade and this would be what it will look like again. The only change is for the small bathroom windows. The shaded area is non- visible windows in the rear that would be individually applied for to landmarks and could have variations. So really nothing would change on the look of the building. Having the master plan go into effect, it would just serve to preserve the look of the building. Are there any questions? This is you're putting in aluminum windows. They would be, they would be aluminum clad windows, either aluminum, clad wood windows or all aluminum windows, but they would have the same. Look the same three- part mount. I have to ask you to explain it again, because my internet, when I went out again, they would be either aluminum, clad wood windows or all aluminum windows. Will they match the shape of the current muttons? Yes, sir, they will so everything to the eye will look the same yes, Sir, uniform and the same okay presentation, yes, Sir! Thank you. Thank you very much, sir okay. So we'll go to the public, anyone in the public who would like to comment if there's anybody from the public who wants to comment on this application. Please use the participants button at the bottom of your screen to use the raise hand feature so that your hand comes up on the list. Give it three seconds. I think that's nobody from the public. You are still sharing your screen by the way. No something's happened to the screen. Peter is still sharing a screen and he's trying to figure out how to unshare it. I apologize that's, okay, I'll, take it away. Thank you. People from members of the committee may want to refer to some of your drawings or some of your images. I'm not sure why I have zoom phone an ad for oh there we go. Thank you all right, that's better! So David who's! Next, okay, there are no members of the public who have their hands up. So would you like to go alphabetical? Let's go in reverse order. Yeah! Okay, reverse order, we'll start with marco! Thank you. It's not clear! Your presentation about you see. I I'm seeing the old teacher, the historical picture that says one over six and you are proposing one number, six, I'm sorry six over one! Yes, okay! So, but I hear that is also. I do not know where I hear that you say it can be six over six. Is that correct? The original windows I understand may have been six over six. This would be a presentation of the original window. That would be a six over six. Oh so that means original. It could be six over six that correct the original. The historic photos are very unclear, but that's what they suggest, although it has been six over one since the 1980s. Well, I prefer to see more the six over six. That is one question. The one point that I would like to raise. The second is I, in the way that you show in your presentation, I'm seeing the windows are wood or I'm dry or wrong, and it's cladding with aluminum. Is that correct the profiles they jump? They are. They are clad with aluminum. Well, what is being proposed is clad with aluminum and what is there now is basically clad with aluminum. Okay, yes, but the original was wood too, is the original were all wood okay. So all the windows in the city were originally wood. Okay, because I'm trying to make a pattern we're going to discuss later, probably in the committee. What is the efficiency of these windows? What is the U factor and the solar gain factor? It's about a a? U of.28 and a solar heat gain of about four point. Four yeah point four and the other one is point. Eight point two, eight point: two, oh twenty, eight okay, so I think definitely is an improvement in that part. I think I do not have no more questions. Thank you all right. After Marcos Harrison who has left he said he would be back and then may no questions. Thank you. Thank you. Then Anthony. I do not see any compelling. I do not see any compelling reason or sort of excuse me. I do not see any compelling evidence for this. Having it one time been, six over sixes six over ones are fine. I think that there's a real effort here, in contrast to some applications, we get to replicate maybe the wrong word, but to at least imply the original profile. So I do not have any problems with this project. Thank you anthony next to Sarah Chu. I had no questions. Thank you after Sarah is a leader. Thank you. I have to say if there is historic evidence that the windows were six over six, then I know window master plans are important to this committee. Then I'd have to go along with that. However, I do agree that six over one is better than the building next door, which is or not that building, because I see that there is some divided windows there, but other with the big play glass windows. So I would like to know what landmarks is basing this on and how firm they are in their suggestion that that's what it was, but other than that. I do not know I'll see what my colleagues say. Thank you thanks. Then next would be Michelle. Thank you. I have to say this is very hard when there, when the building has been, has taken the trouble to alter their alteration agreement and require uniform fenestration, and I respect that and I'm very happy that the building did this. For me. However, unfortunately they did not go far enough in terms of requiring replication of the original window style. Now it's always a question that if you go back- and you say well now, I would like to see six over six and I would like them to be all wood. If the originals were six over six- and we know they were all wood, that would be ideal. I like to stay with that recommendation, even though it appears as though it's going to create some little bit of patchwork over the years, because eventually the aim is to get the building back to where it was so to approve what was, I won't say, an error, but what perhaps should not have happened in the first place and now to reinforce it in history and make it that that's how it has to be that we have to have an aluminum window and it has to be six over one. That's disturbing to me, even though I understand that I would be talking, I mean I understand that some uniformity over the next many years would be would be sacrificed. Having said that, however, I think I'm for the reasons I stated for historic reasons. I think I have to vote against this application. So thank you very much. Oh next is gale Baron. Well, I would prefer the six over sixes. However, I do think that the uniformity is a very strong argument in favor of approving the six over ones, because I can imagine what a mismatch it could be for years and this way, when you look at the building, it may not be perfect. It may not be exactly as the original windows were, but it's still with that uniformity. It's very appealing, so I can support this. Thank you. Thank you, Gail. Finally, Elizabeth Ashby yeah. I also have a problem because I from the look of the building, I would assume that it was six over six, although in that period there were six over ones, so this could have been the and because they've had a program now for 30 or 40 years, they do have a possibly the correct, fenestration and have it I do want to speak, though I think we have to be very careful one thing that I'm always afraid of. We get the uniformity argument and alone what we have to avoid, which we've found on buildings before is yes, it's uniform, but we have uniformly inappropriate windows and that's what I want to make sure that we avoid. I think I will support this one, because these could have been they're, not single-, paying tilt and turns, or anything gossipy like that these could have been the historic windows they're of the they're appropriate to the period, and I wish we actually knew whether they were six over six or one over one originally. But I guess that those are my thoughts and I will approve this. Thank you. Thank you. Elizabeth Next is our public member Christina Davis. Yes, I can approve this presented. Thank you thank you and finally, our other board member russell squire thanks. So it's a little bit unclear to me what the you know, there's a looks like there's a sort of blueprint version of what the new windows are going to be compared to what the compared to what the old one is, but as a as a layperson, it's a little bit difficult to really tell what the new version is going to be in comparison to the old version. I understand they're both aluminum, but I wish it was a little clear, although I like the fact that we're adding muntins now in the new version, I think you know basically I think, in the interest of uniformity, I'm okay with you know, having keeping the aluminum and six over one and as opposed to the historic version. So if my impression is that people seem to think that the the proposed aluminum version is going to look the same as the as the existing aluminum version, so I think, if that's the case, then it's probably fine. That's all Dan and David David, I'm going to vote to approve the application. Well, I'm also going to approve it. I think that the I like Elizabeth use of the word uniformly appropriate in the sense that this might have been. We have no guarantee that it was six over six originally, and this is clearly appropriate in deference to Michelle the minute. You turn this to six over six. You will have a patchwork and will be another 30 or 40 years, if we're lucky before we have uniformity again. So, given that the muttons are going to be correct and given that it will be either aluminum flat or aluminum, but still having the appropriate appearance, I am very much in support of this. I do not think people who I do not think a building that has made an effort to do it right, since the 1980s should be penalized and have to change all their windows to a different to a to a different arrangement so anyway I'll approve it. Thank you, sir. All right. Well, I'm going to take this screen away and I'll put up the vote. Oh as soon as somebody makes an option. Sorry David, oh move to approve as presented. We need a second. We have. Okay. Elizabeth was a second, so call the role play as well. All right make sure everybody can see the vote sheet and mute everybody who is not unmuted right now, all right, starting at the top Elizabeth Ashby yeah approval, yes, gale baron! Yes, thank you, yeah, I'm going to vote no because I want that position represented in this vote, elita going to abstain, because I think we ought to have some more definite response from Landmarks Preservation Commission about what the history was. So thank you. Thank you Sarah! Yes, thank you anthony. Yes, thank you. David! Yes, may yeah! Thank you Jane! Yes, thank you. Harrison is still not back marco Osteen. Thank you, Christina. I may need to unmute you again all right, christina there you go. Yes, thank you and then russell. Yes, thank you all right. Let me mute everybody and Unmute Jane and David Ladies and gentlemen Shane before you Jane. If I could just interject before you move on sure, I would like to remind everybody, particularly the newer members and the public members and our board members, that an abstention is a no and it would be nice to just vote yes or no. I do not understand people doing abstentions when they mean no. So that's just my comment on the evening. I'd like people to think seriously about it. Okay, David, I'm thinking seriously about it and I'm listening to you. So I'll vote no, but it's not that I object to this. It's that I object to lack of clarity and that's why I was abstaining, but you make a compelling case. I know I asked for it at the full board meeting so I'll go with a no thank you and I'm not looking to get into a lengthy discussion on this, but I think Mr Folsom was very upfront with us by pointing out what it might have been, even though nobody apparently knows for sure. I know it's just that he made the point of saying they suggested it. So I think that if there, if it were possible for more clarity, I that would have been appreciated in any event it passed, and I know it's not the applicant's issue, it's but you know what I think. It's not the applicant's issue and there is a point to be made, although it is a very slippery slope with saying uniformity, because we've seen that with the explanations for the awful window master plans, I think this case could be distinguished because landmarks is not clear, so I'll change it to a yes. So you see David, we should have these conversations more often well not to belabor it, but I think I think Elizabeth stated at the best it's appropriately uniform, whereas a lot of buildings are inappropriately uniform, that's correct! So that's why I'm switching! Thank you. Thank you David. I totally agree with you. We are going to move along to 163 East 67Th Street, the Park East Synagogue, it's an individual landmark. We heard this application last month and we really did not approve because the applicant could not tell us about how the wiring was going to get to the led sign boards. I think that was the reason we turned it down. So I do not know if we have to go through the whole application again or just hear from the applicant on his proposal for the wiring, the conduits for the led boards. Yes, that's what we're going to propose we're going to show you the wiring path and just keep it brief. Briefly, thank you. Okay. Can I share my screen? Yes, okay, can you see the presentation? Yes, thank you. Okay, all right! So, first thank you for letting us present again and giving us another opportunity to expand on our last proposal. So this is our second presentation in regards to the upgrade of the existing signs at Parque Synagogue located at 103, East 67Th, Street Dan, I'm sorry to interrupt, but will I still have park Avenue on my screen? Is there any way you can intercede? Is everybody else would it? I can see the synagogue on my screen, yeah I'm seeing one 163 East 67Th Street Park, Avenue, East Synagogue on Monday you're, not no! I'm seeing Park Avenue, okay. I also seem to have lost your video feed, so I'm going to move you to a waiting room and bring you right back and see if that fixes anything right. Give me one. Second, thank you for everyone's patience. Hmm Jane, I'm worried his connection was too unstable. I know I think we should just go ahead with the presentation. Well, if you can't get me fixed, let's see what but happens can't. I can't share anything if I can't see it but you're back you can you see anything right now, yeah park Avenue, it's beautiful uniformly appropriate! Okay, let me because it does not show that you've even rejoined our meeting that yeah it looked like. I never left and I never rejoined everybody can hear David right. Yes, okay, thanks David, can I ask you to leave the meeting and quickly come right back I'll email, you, the link again, all right I'll, go out totally trying to find a place on my screen to do that bottom right hand, corner hit the leave button and you'll have to approve it yeah. Well, let me you know, I can't even move my. I can't even move my cursor right now. Let me see if I can do it this way. Okay, the leave is not coming up. I'm just going to shut off the computer and start all over here. Okay, David! Is it okay? If we continue, yes, continue? Okay, so why do not we go back to you can bring me up today? Okay, 163 67., okay. So, thank you, as I mentioned before, we presented this in September, and the last remaining comment was the electrical conduit path and since then, we've taken your guidance and provided additional details about the path and we like to show what we've come up with right. So here it is. We explored several options with the Electrician architect and landmarks and found that this is the best solution and it would be a direct path of conduit along the bottom edge of the baluster resting on the Brownstone molding detail that you see in the picture. We found that this path is the most direct and least intrusive option, as it creates one the fewest amount of penetrations. It is the shortest run of conduit and it is the least visible option from the street and would also be painted to blend in with the Brownstone base and the next following slide. This is a view from the streets, so it would be barely visible over here and, as I mentioned, we discussed this with landmarks and they agreed that this is the least intrusive option and the best solution to provide power to those proposed signs, and we just hope that this solves any questions that you might have about the electrical supply path and thank you again for giving us the opportunity to come back and present again. I hope that was clear enough. I think this was the only thing holding up formulating a resolution. I know there are a couple of new members, but I really, since we have three other agenda items, I'm loathe to go through this. In summary, the synagogue which is a beautiful individual landmark just wants to change on the signage to led signage, and we had concerns about the electric how the electricity was going to get to the signage. So I think you've covered everything Dan and I think we could will. Is there anyone from the public there? No, we have two board members who raise their hands, though well we're going to go to all the board members. So so, if there's no one from the public, I think we can go to the board members and we can do it in the regular alphabetical order up to bottom all right, Elizabeth, Ashby yeah. I just have a question, did not we were not. We concerned that this, that the signage be black and white and not have pictures and so on were not. We concerned about the signage being restrained and the other thing is just a suggestion, but they're quite it. Maybe this is what you proposed that when you paint the condit, there is very good that I've seen used stone, textured paint and you might be able to match the stone color with a stone, textured paint, and that would make it disappear even more. So if you have not thought of that, I would suggest that you do it and that you agree to just restrain black and white steinage. If you have not already done so Elizabeth. I think the question of what goes into the boxes we decided at the last meeting. It really should be left to the the congregation, and you know it can't be up to us. Well, I would pref for that that they choose something restrained. I would assume that they would, but I would prefer not to have color and not to have pictures. Well, maybe we can divide the resolution into a couple of parts, but I really want to leave that to the church, but thank you. I appreciate your comment and we'll see. Other people may feel the same way. You do. Will yeah okay, who's next is gilbert. Thank you dane. I actually agree with Elizabeth. We had discussed that and there were questions if you started to have a lot of color moving images. I mean like right now on Park Avenue, where there's the led sign. Even those lights are so bright that people in the neighborhood compli really complain about them. So I think that having something that is a little bit more restrained is not an inappropriate thing to ask for. Thank you. Thank you, Gail, that's the loyola! If anybody's curious, that's the Loyola church at 84Th and Park. Thank you, Gail Welcome next is Michelle yeah I happen to. I agree that the signage should be restricted with no pictures, and I do not remember if we talked about when it would be turned off. I think we did mention hours like until 11 o'clock at night or something like that. That's my recollection, anyway. With regard to this, I mean I'm heartened if there is paint out there that looks like stone that can be matched to this color, because the way it looks now is really quite unsightly as you descend the steps and are not there. Two of these were not there two signs. Yes, there are two signs. How are you running the other one? It's exactly the same. It's a symmetrical building and it's mirrored on the other side. Okay, so I think it is quite unsightly I mean it's a decent sized lip. I guess I do not know if you can go with a smaller conduit. Are these just regular wires? Is there anything special about the wires yeah? I think there's regular wires going through the conduit. We had a representative from Benjamin Moore who used the device and matched the color of the base and found that this is the color to best match. Do you see Michelle with paint samples which are on the right, no yeah, all right down here right there? I do not have that on my screen. Oh I see I see, I see okay, I see that now yeah, but they did not say anything about a paint that looks like stone that may be a commercial they may not carry it. I mean yeah, we are doing our best to match as close as possible, but they did mention. This is a total. This is a metal material and it would be difficult to make it look like stone. It's not stone. No, but if the paint has is rough, it would blend in more sure yeah. We can explore that option and make it match closer to the texture, and the other thing is the size of the conduit. Did your electrician tell if it's just regular wiring, that's going in there? Did your electrician tell you that that's the smallest diameter conduit that you can use? Yes, they gave us these specs for half inch, rigid aluminum over here and the diameter of 27 by and what about the strap, the strap? How many of those are you going to need? We proposed two as per code. One is required for the first three feet and then every five feet after that and it's about a seven foot run. So that would be two straps. So where will you put them one at the beginning and one at the end? Yes, those that would be the least obtrusive, nothing in the middle. Yes, yeah, I'm not happy with it, but I want you to have your sign, so I would since we're going to formulate a resolution. I would love in the, whereas is just mention of the fact, whereas the applicant will be looking into you know more closely matched paint, whereas the applicant warns that they're using the smallest conduit, they're, not jane, you can choose not to put that in, but that's my recommendation, but it's okay. If you do not want to, but to me, as I say, I want you to have your sign, but- and I would like it to restrict you know- no pictures and some kind of a lighting. This is a side street, some kind of an out. You know what hour the lighting michelle you know, there's a police department and a fire department right, acrosss, the street. The 1919 precinct is right, acrosss the street. Practically. This is not a residential block. Okay! Thank you. After Michelle is Elita Camp, a lady you have to unmute. Thank you. I have to agree with Elizabeth and my other colleagues in this committee that we'd like to put some restrictions on the sign living around the corner from Loyola. I think that they're necessary with respect to the conduit Benjamin Moore, is not the only paint game in town. There are other paint stores. Benjamin Moore only carries Benjamin more paint, I believe so maybe Sherwin- Williams and there's an excellent paint store in englewood New Jersey called Eagle Paint. They carry tons of different kinds of things and could give you good advice, because the stone matching would be better other than that. With respect to the conduit, I leave it to the architects on the board to raise any questions about if there is a better technique or not. So thank you. Thank you. Elita next Sarah Chu Sarah just unmute. I appreciate what the applicant did in terms of the conduit and and presenting us with a detailed plan of how this is going to work just with respect to the signage or the content. I am also reluctant to tell the church what to put on there, but perhaps if we so I would prefer not to, but if we are going to design a resolution with regard to the sign, could it perhaps be limited to to aspects of the sign like the lumens and and kind of the physical constraints, or I do not know how you would say it, but rather than aspects that would impact the content. So that's my one comment thanks. Thank you. Sarah I'd just like to say, yeah go ahead, go ahead. I just wanted to mention that we will be working and conferring with LPC and in regards to this playing it at night. We will be dimming it, so it's not going to be a huge bright display board, but very appropriate for the neighborhood. It is a synagogue, so it's not going to be showing anything inappropriate or bright and flashy. I just wanted to mention that. Thank you, Dan Next is Anthony. This is fine. I'm done. Okay. May is next yeah. I also agree. This is fine. I want to say that, in terms of the content of the signage, I just want to sign on and echo what Sarah Chu said that I would recommend against prescribing to the place of faith, what they can and can not include on that signage. I do have a quick question for the applicant, and forgive me if this has been it was covered already today or in the first presentation, the in terms of the potential moving images and digital images on this in the signage and correct me. If I'm wrong that that's not part of the plan, if it is part of the plan it was, that is, was that decision made for accessibility reasons? I ask, because I want to make sure that we are not requesting to take away something that can potentially further marginalize a group that I'll stop right there and if you can answer that would be great. As in terms of why we're having the presentation I mean having the display yeah and is the display going to is: has it been designed in a way that is conscious of the needs of our you know, just our residents, who have various accessibility needs right, like I guess, I'm wondering I'm less inclined to be. You know, disappointed in any kind of or concerned about bright lights or whatever. If it means that means more, people are going to see it if there is an actual accessibility, centered reason for it yeah. The reason is because a lot of the members of the synagogue they are elderly and some of the information on the current existing signs are not enough to display updated information and such as wearing like flyers. For wearing masks when they go in other things are such as passings for people in the neighborhood and the elderly. They do not really have emails and they do not have any way of knowing when somebody passes and they have a memorial for them so when they walk by, they would be able to see that sort of stuff on the display. So that's also one of the reasons why they want to have this. Thank you and I assumed as much but it I just thought it was important for you to read like clarify that here and so, for all that reasons, not only do I support this, I do not support any recommendations of amendments to the signage. I would leave it to the synagogue to do what it wants with its sign. Thank you thank you. May I do not see Harrison back yet so the next person is marco. Thank you. That is fine. Thank you, Marco Christina Davis. Yes, thank you for coming back and resolving the problem. I think you came up with a very good solution and we are not a content committee, so I would not we do not direct people what they can or can't say it's a church. So so I approve the solution. They've come with for the conduit. Thank you thank you Christina. Finally, our we have one more board member russell Squire and then Jane just for your information, two of the other board members who've already spoken, have their hands up. Thank you, okay. So I had a couple of questions so on page 14, I just want to confirm that the the sort of base area that the conduit is going to run along is the same color throughout, because I think from the picture on page 15, it looks like it's all the same color there, but on some of the and I think it's a issue of the lighting, but I just want to confirm yeah. It is the same color. Okay, it is the same. Color from this base runs along to the wall and then on page 15. That picture on the right is a picture with the conduit there to show the visibility from the street. Is that right or no, the conduit is not there, but it would be barely visible, even if it was there. I'm not sure if you'd be able to see it, got it. Okay, all right! Well, I guess I so I think I mean I think it would have been nice if, since you have paint picked out- and you have a conduit section to have seen what what it would look like with a with a painted conduit but and then the other with regard to the sign yeah and just on the pain issue, I just think it's it's just it's a little different to see what you know a sort of small sample up against the stone there compared to what a fully you know painted section is going to look like. I think you know it's potentially going to look a little different, which is my my concern with that and then on the sign. I agree that I do not think we can tell a synagogue or any applicant really what should go on the sign, but I think there is on page 12, there's a discussion of there's, basically a proposal about what the dimming schedule is going to be, and I think that's pretty content neutral and it sounds like that is what is the synagogue's proposal for how they would do it, and it seems to me that it would be appropriate to incorporate the proposed dimming schedule into what we're doing, because that's something that the that the synagogue put forward. I think that's. I do not think the content is really the concern. In any event, I think the concerns have to do with you know brightness at night and things like that, and so I'm wondering if, if the applicant has an issue with just incorporating the the display the evening display discussion into a resolution that would not be the applicant. That would be me. Thank you russell. Well, you said a couple of other people had their hands up. Michelle, Alita and Elizabeth raised their hands. I guess okay, thank you! Michelle yeah! Thank you. I would just like to say that there are a lot of ways that you can make that conduit of you know blend in and there if you're just painting it- and you just chose a non- commercial paint that paint wears off and you're going to have all kinds of peeling paint along this conduit in very short order between rain and just wear and tear. So I do not think that that's a route you can go. I would like you to look into commercial paints, or even you know, while you're doing this project is going to be, you know lasting forever. We hope and I think it would be a really good idea to look into a baked enamel. You know not an I mean a flat surface, but there is a way and people do it may be costly, because there is not very much pipe and I'm sure the less the amount of product the more expensive the process is. However, I would suggest trying to find a stone, finish paint and have it baked so that it's made for outdoors and it never peels and nothing ever happens to it, and you never have to worry about it again, because otherwise this is going to be a maintenance issue for you, as well as being quite unsightly it'll. It will in very short order. This is going to start to peel off, so I would encourage you to do that. I do not know what we want to do or say about that in the resolution. Nobody here wants to deny you this option. I want you to have it, but I think it really should be done in the most professional way to guarantee longevity both from an aesthetic and from a maintenance point of view. I feel strongly about that. Thank you. Thank you. We will definitely look into that part. We will work with landmarks to make sure they approve that as well. Thank you, Elita and then Elizabeth both have their hands up again. Thank you. I did want to say thank you very much for coming back for the board. We really appreciate when people come back when there's a change or a question that can be answered. So thank you. I also was not sure of the question that may ask him and whether you answered it, so I was not sure whether she asked just about the image and having a moving image and whether because it sounded like you were answering the question of having the entire sign- and I was not even sure about that. Well, I agree with not the content police and that it's not a residential block, sometimes led moving. Images can be wholly distracting from the surrounding building, which would be a shame because everything in New York ends up being a busy street and people do walk by and it is a it is a singularly beautiful building. That seems with my knowledge, to be unique so in the city, and so that's why I'm just more conscious of the sign, while at the same time being cognizant that it's a religious institution, so I just was not sure what you were answering and that's all, but thank you again for coming back so will I think Elizabeth had her hand up yes, Elizabeth yeah. I do want to say that, as far as I know- and I do trust my fellow Board members- nobody is suggesting that we're regulating what the synagogue says on its side, but I do think that we've had a very bad lesson of not watching the visual aspect of the sign right. You know on Park Avenue, so I think that's what our concern is and I think that's a rightful concern. It is not that I distrust the synagogue. I think they probably will do a most restrained, but I think I think we've learned a sad lesson that we not the content, but the appearance is something that we want to make sure we that it does not look like the church. Thank you, Elizabeth will did David manage to get back into us. Yes, David is actually on the phone right now. David hit Star six to unmute yourself, David, it's star, 6, Marco, you're, so unmuted we can hear you will we're not good picking up David, I'm not I'm not getting him to unmute, okay. Well, I just want to make a few comments before we go to a resolution. I really won you know and I drove right by them last night, the signage at St, Ignatius Loyola, and you know I think these churches deserve for us to pay attention to their needs, and one of their needs is to tell the world who they are and one way they do. It is through these through their new, updated, led signage, and we are cognizant of the fact that this synagogue chose to dim their signage in the evening hours, as Russell pointed out. I do not think we should be telling them at all what to do on their signage every congregation. Perhaps not this one is looking for new members and is looking to expand their profile in their surrounding community. I also think the synagogue is well aware of the heritage of its beautiful individual landmark and how it's chosen to paint the conduit, and I appreciate what Michelle said what Elizabeth said, but they they're trying to do the best they can. They spent a lot of time on this and I want to support this application as presented. So that is my what my comment on this and the synagogue came back to us. They had a huge crowd there at the last September meeting who were in support of the congregation and you we all know how much we care about the community coming out to support the things they care about. So please, all of us. Could we get behind this and support this beautiful, landmark building really on a non- residential street with a landmark in police. The 19th police precinct headquarters is right, acrosss the street, it's an individual landmark and that wonderful old firehouse, which is also an individual, landmark they're all on this block facing each other, and I think David can join us now and then we should just go to a vote Jane. I can't see anything because I'm on my iphone, I just want to support everything. You've said because in principle we should not be telling them what to put on their screens, if that's part of the issue, but I I'm also going to ask as a separate issue that somebody, so you know to do all of these. Maybe somebody can volunteer to share one or two of the one or two of the applications. Thank you, David. I think we're ready to go to a vote. Does somebody want to formulate I want to? I want to give you the option here. Then I see you. There is a person named Lynn who is a member of the public who apparently missed your opportunity to speak in the public part of this. Do you want to go back to the public or do you want to move on? I think we need to move on. I you know. I'm David unfortunately has left us and we've got three other agenda items, but if she's willing or he's willing to speak for only two minutes, let them speak well. Okay, Lynn. You have to select unmuting at the bottom of your screen: okay, hi, I'm really sorry! I could not. I had to do some work and I missed the last meeting, because I did not see your little songs on the posts I live on, 167 next door. Please do not call my street a non- residential street. Okay, it is a residential street and I'm a resident of it and the building acrosss the street down the block that beautiful old building on the south side is on the residential building. So we are a residential street. Okay. Thank you. I walk my dog four times a day. I think design. They have now is sort of a disgrace on that this gorgeous building. But I have a few things to say one. I walk my dog four times a day past that building a random street that people walk down to say. Oh, this is what's happening at the synagogue I'll just I do not buy that it's going to get information or bring more people in. I do not buy it and what is on the 68th street side, which is where they're having people come in now, they're not having them coming on the 67th. Are they doing something? On the other side, which is a more modern side? That's number one number two. If they are going to have this sign, which I think it's kind of obscene, that it's led, okay, but it does look better than what they have now. Why does it have to be a blue bathroom? Why can't it be that over color background with the white type or the black type that was stand out that will match the building better? Why does it have to be a blue background? It makes no sense to me. Thank you, and this is a residential and I honestly I find it with fences, 167, East, 67Th, Street next door. That's where our awning is it's a residential street, I'm a restaurant! Thank you and I really think that the background should not be blue. It's not blue! It's black! It came out blue in the presentation for some reason, but it is a black background with white text and they can control it's customizable. They can do whatever they want with the colors David. Did you want to make another comment or not? No, I thought you summed it up extremely well and I'm very much in support of it. I agree with you. The churches and the synagogues need to be able to explain their programs and their mission to their members and to the public who may be interested okay. So where does anybody want to formulate a resolution we're here to vote on the context and appropriateness for this individual landmark? Yes, I would like to I think we I move that we approve this application as presented. Thank you, Anthony is there a second? Is there a second harrison raised his hand harrison? Is he seconding? Yes, thank you. Could we go to a vote? Yes, we can I'm going to put up the oh cheat and then how would you like to go through the role? Well, the way it is presented on the on the voting sheet? Wonderful, sorry. I just wanted to make sure I'm just unmuting everybody right now, so that they can speak up the moment that they are called on all right will I have one request: yeah, of course, if Jane could explain to me the wiring, otherwise I can't vote I mean, since I saw it all last time and since I'm in favor, but unless I understand how what they did and maybe it could just be described so I could visualize it and then I could feel comfortable voting. Also. You know the package, the applicants packages are included in the information tonight, so I'm hoping you can still do the couple of resolutions and one for the pre the next two coming up, but in any case it's basically oh steel, tube or an aluminum tube that will sit on the molding below the balustrade and contain the electrical wiring and there'll be two brackets that will hold it in place and it will be in a painted color from Benjamin and more that will match the existing paint on the individual landmark. So it will be minimally visible minimally. The applicant said that you really can't even see it from the street. Okay. Thank you. You're welcome. This is an approval all right, starting at the top Elizabeth Ashby. No, thank you! Gail Baron, no Michelle! No marco! Can you please stop speaking while other people are trying to vote sorry, I just wanted to say to Dan before I vote that what I had presented about the baking of the paint would apply to the brackets as well. You know to those clamps. There is a way to do this, I'm going to vote yes, but I really hope that the resolution incorporates the hours and does make a mention in the whereases while we're asking for paint that can be maintained. If it's regular paint, it's going to look awful, and I would rather that you do not put the words as presented if you are going to have as presented I'm going to vote. No, so can you let me know if you're incorporating whereases or not yes, we can do that. That's not a problem too! No jane has to let me know, I'm Glad Dan is amenable to it. So why would not we accommodate everybody for the pain? You mean right, yeah that, because it's going to be unsightly, I mean it's going to be Michelle. I would suggest that you vote. No, if your conscience dictates that, because I'm not going to dictate to the applicant the exact finish of the paint, you know he has to get approval from the Landmarks Commission for the cfa. The only thing I asked of you Jane is that you do not put in as presented that's what I'm putting in as presented. So, if you do not like that, then it's a no, then it's a no okay! Thank you know as a practical matter. Well, you changed me, you put the note you put the no on elites. You did not change. No, I got it. Thank you yeah! So take my yes off. I will thank you. Sorry, okay, David. What were you saying as a practical matter, they're going to use the right paint? There are plenty of paints designed for Exterior use. Okay, yes, thank you. Are you ready for me to keep going? Yes go ahead? Will aleda I'm going to say yes having listened to Sarah and may, but I hope that the synagogue exercises restraint as appropriate. Thank you Sarah. Oh I just muted, you sorry! Yes! Thank you! Sir Anthony! Yes, thank you David! Yes! Thank you! May yes! Thank you Jane! Yes! Thank you harrison! Yes! Thank you, marco! Yes, thank you Christina, maybe to mute her again, Christina! Yes, thank you and then Russell. I know I want to see better what it's really going to look like. I'm a now, no okay, all right! I do not think there are any other board members! Okay! Well, I'm going to ask if anthony can replace me at least on one or two well, that took two more that I would have to do sure. I'm happy to help. You did a very lovely resolution which I read a while ago. Oh thank you. So thank you for going forward in my place tonight. Of course, Elijah. You have your hand up. I do- and this is this is not related to the approval or not, but I'd ask if the synagogue could leave a contact person with the board office in case we do get a series of complaints or they're not complying with the dimming schedule just so that we have a specific contact. Thank you yeah. I could do that great okay, Jane you're, ready to proceed. No, I think David's going to take, I mean, excuse me, Anthony's, going to take the next two and I'm taking number six. Okay, all right! Let me let me look go back to this okay. This is 61 E 77th street and it is a neo- federal style building with bozart features designed by hardy and hasselman and built in 1916 applications for the addition of an access ramp and the reconstruction and alteration of the existing stoop. And hopefully someone is here to explain this project to us. Ah Christopher, stone yeah, so I'm the architect and my client reciprocation from the Human Rights Commission that they were required to provide handicap access. Would you like me how about if I share my screen, please, okay, the proposal is to add a handicap accessible ramp for first floor access to 61, East, 77th street. It's an attractive building built in 1916 by architects, hardy and catherine, and it's bozart's on the first two floors. Then it goes to a neo- federal style, it's 10 stories high and in the 1865. I believe the adjacent property which is part of this property now was built out to the front and that's considered a contemporary style by the Landmarks Commission. I I'll go to the current more currently. The existing stoop, which you can see here is actually under the paint is limestone. It's been painted over the years with a kind of a darker gray paint with a non- skid finish and then the entire first and second floor. All the limestone areas are painted currently, and so one of the problems I'll go to the let's see where the property is: here's our property, the Central Park 61 and 65 East 77th street in the Upper East Side historic district, we're very much in the north section right there and then on the block. You can see the yellow highlight we're in the middle of the block. As you see in the the drawing there go to the you see, our building is underlined in red, 61 and 65 and then the which shows the rest of the block to the East building, 61 and 65 underlined in red. As we look up at the top section on the corner: Madison Avenue White Brick. What was the prior comment? No style building at the corner, the 53 brick style, 55, gorgeous beautiful bozart style, building, 57 another somewhat contemporary style, 59 been redone. A number of times has someone attractive style, then and of course, there's our building and then dropping down to the lower part of the screen. You see our building here again with the component of 65 building at 67 and then 69 7173 apartment building, then 75.77, two very attractive buildings, romanesque style, quite nice and then at the corner, 7981 all limestone continuing on acrosss the street. This is the view acrosss. The street 80 to the east is not bad, and so it gives you an idea of the character of the the neighborhood as we continue down. This is an existing photo of 61 East 77th street, as it appears you can see, the limestone has all been painted. Originally this was the finch school, not certain. Why or when it was painted, but it over the years every old limestone has been painted, perhaps from graffiti or damage. I do not know this section to the right is 65. First, two stories are limestone and once again they are painted as well. This is a rendering of what we propose for the handicap ramp, there's an existing, a historic iron fence, left and right of the entry. The existing stoop has a little step in it, which you'll see in future slides that prevents us from having a lift in this area. Currently there is an access to the West. Upgrade goes into an elevator that goes down only I'll return to that discussion. The ramp very difficult grade wise to fit enough elevation in here. The ramp is approximately 27 feet long. This is an emergency egress from the apartment residential component. That is above the first floor. This is a picture of the existing stoop. You can see. We've got one two three risers up to a landing and then right at the door, there's a five inch step up to a narrow set of double doors, and you see left and right the historic iron fence also the lower sections here, which you'll see some closer up photos. This is all original limestone painted the piers. Due to this oil being torn up apparently numerous times. The piers currently are painted concrete, but the caps appear to be original limestone caps replaced onto the restructured piers. The right side here is where we propose to remove a section of fence, leaving the first part of the curve, but then removing this section, so we can allow the ramp to pass as we move down a close up of the left and then a straight on view of the right side where the ramp, you can see the column right here and the ramp would fit right between. There would require us to take a little section out about an inch and a half deep breath inches high for your hand to clear on the ramp railing as it passed by this right- hand, picture shows an existing gate, which is similar to the West side. The West side has no gate, and this has a gate, probably at one time used for refuse. This is another clean picture of the entire front of the building on the left. Here we have a historic tax photo of the building. This is an enlargement of the tax map, so you see our building shown more clearly. The round spheres on top of the piers have apparently vanished over the decades. We have another picture here in the center looking toward where the ramp would come up and a picture here showing the east exposure of the eastern Window area way through which the ramp would pass behind the existing columns. Here we have a picture of the existing entry door, double door below the minimum, a width required for access, and then you see there's a five inch step here, which has some bright tape attached to it, reflective because it is quite a tripping hazard for everyone in both inside of the entry here, you can see the set of doors, that is the access to the residential lobby for the building the picture on the right. You see the darker gray coating, the non- skid that was applied and has been applied for quite some time over the existing limestone. This soup is limestone under the paint limestone stoop and you can see the limestone which is showing, through here inside of the lobby, to the left. There's a doorway. It goes to the elevator, which only goes to the basement and they're three steps down straight ahead. There's the entry doors to the private residential lobby at elevator, lobby and mailboxes to the right is the first floor, entry to Atlantic, Hill Radiology and the first floor offices for that more views, residential entry inside of the residential entry. We have our mailboxes here residential elevator view from inside the elevator out to the lobby as a counter for a doorman. This is the entry elevator entry at grade level, which goes to the basement. The three steps up here, not enough room to add a lift to get a customers up there. Also, if we look back at the other side of that elevator, these are all the residential mailboxes which prevent us from putting an entry there, plus also we have to come into the residential lobby. Here we have a floor plan. This is existing the existing narrow, double doors, entry for Linux of radiology here, entry for residential private lobby: this is the elevator which goes to the lower level for handicap access. Three steps right here. If we look down this is our proposed plan. Handicap ramp would stop just short of this emergency egress for the residential component. We go up 27 feet to a reconstructed stoop. The reconstructed strip would project an extra 10 inches into the sidewalk, but would be configured in a very similar manner to the existing, which would give us our turning radius, and we would remove the small side lights, see to small side lights. Here. We remove those and install in large doors. Leftover would be actuated so that there would be handicap access to the first floor lobby and up to the first floor, radiology offices. This shows an overall egress plan, egress out of the first floor here from Langston Radiology this way and or down the ramp. This is an enlarged view of the proposed reconstructed stoop. The ramp extends a little bit past the end of the curve on the right, because we need that extra one inch. The this actually has been changed, so it's all hold over. We've got a actuator pad on the handrail to the right and the conduit. The wiring goes inside of the piping. It does not. It's not exposed out the back like that. Sorry for that over we overlooked that here's, a architectural line elevation of the existing building limestone, but all painted this is the proposed ramp, starting here coming up by the way those connections were temporary, they are being replaced back to here. They were temporary when all of this was taken apart, that was a temporary connection which will be removed, as is now been completely cut off, as non- active here are sections. This is the existing section at the entry you can see, we've got three steps up to a stoop and then a five inch step up to an existing door. This creates a real problem not only for ambulatory individuals, but certainly for people in wheelchairs. Our proposal is to make that stoop or one level have the four steps go down and we'll have to extend another 10 inches out into the sidewalk space. The ramp would pass between the back of the pier the existing and then we'd leave as much of the fence as we could getting as much of that curve. Remaining. The button would be on top of the Handicap rail finish, and the wiring would all be concealed within the tube and go down into the slab. This is the section acrosss. This goes over. An existing areaway would all be poured concrete. It's proposed that the replacement soup and the ramp would all have that same darker, textured coating, as opposed to a limestone which the only the existing stoop and the lower section which are back up. Let's see one more there we go so this lower section of the wall is limestone. These piers have over the years, been replaced with concrete, but the caps are limestone existing or appear to be original. As we go down, here's a large view of the proposed ramp coming up and the the soup. This is the existing entry to the down. Only elevator, the all the handrails would be stainless steel, but with a black painted finish to match the existing fencing, historic fencing, which, of course, would be replaced and reconditioned, and so that that is as the presentation currently there is a a certificate of no effect from landmarks relative to the removal and replacement of the peers to allow access to the seller for the install of Mri equipment. Is that it? I believe, that's it. Okay. I have a couple of questions and then you'll go to the public and then to the board members. So this was occasioned by the Human Rights Commission, basically for accessibility reasons, and this is largely because of the first floor, use landing xl that would be correct, okay and how wide is the ramp. I know it's 27 feet long, but how wide is it it's 48 inches wide? Oh okay, I did not realize there was enough space there, that's great, and so all right, that's the extent of my immediate questions. Oh you also mentioned that you were bringing these. I'm not sure. If this was true, are you bringing the stairs further into the sidewalk and, if so, by how much? Yes, the lowest step would extend an additional 10 inches into the sidewalk? Okay, do you know offhand how wide the sidewalk is right now? I do not know exactly I it's approximately 15 feet. I do not know exactly. Okay, all right will. Are there any members of the public who have their hands up, not that I've seen any. You have to turn your mic on glad to be able to say that there was a person from the public named Aravatu, and you want to say something so you raise it and lower it immediately. Oh, no! Sorry I can I'm here. Can you hear me yes, yep? Thank you. Sorry. My name is yen Liao, I'm actually the next door neighbor at 59, East 77Th street. Thank you for your time. Excuse me just one quick question. I believe there has been fixes for the last three years on this. I'm just curious from a landmarks or approvals perspective if the two things are linked and if that affects either of them, but I believe there's been other work. Fronts that's been going on for many years at this point and I'm just curious if this affects it or if that has all been resolved now. Thank you, okay. Yeah. Thank you, Chris, the the work that is occurring or has occurred at the building over the years. This final project would be a culmination of that work, so you know, as you've seen the sidewalk has been opened. The airways have been open, they've installed a lot of equipment they're. You know quite a significant amount of work over a protracted period of time, which, as the neighbor certainly has to be quite a distraction and inconvenience so yeah. The plan is to install this and be finished great. Thank you any other members of the public right now. I do not see any, but if anybody from the public has another question, please raise your hand through the participants, button or wave me down right now. Keep it open for another three or four seconds. Okay! Does not seem that way good. So now, if we can go to the members of the committee- and I think we did a to z before so tamayo to ashby this time- okay, great marco, first, oh thank you, my I mean you're asking to be in compliance with the law. I do not have a problem. Whatever you do is perfectly fine. You went all beyond your scope of work and you encroach the sidewalk of 10 inches. That is fine too, because you try to be in compliance with the law, so that is perfectly fine. The only part that I founded is talking about the law. Is you have the exit door that encroach the landing of that part? It is your problem is my problem. So the only thing is, I think, is you are knowing compliance, but in any event, we are no right here to analyze. If you are in compliance with the law, we are right. Here is of the properties of your application. In that direction, I will support your application. I think it's very thoughtful. You organize very well your ideas and I think it's fine. Thank you. Thank you. So next is Harrison hi. Yes, thank you very much for the presentation, it's very clear and and thoughtful, and I think you did a great job. I personally do not see any issue with this. It sounds completely completely solid yeah. The one thing is the encroachment on the sidewalk, but that seems all right. You know it does not seem like it causes an obstruction anyway. So it sounds good to me and thank you for the presentation. Thank you. Thank you. Harrison next will be may hi. Thank you again. Thank you for the presentation. I have no flag. This is an accessibility issue. I fully support this application. Thank you. Thank you. May David, do you want me to call on you now or do you want me to come back at the end? You can call on me now because it's such a well- organized presentation and it followed the drawings exactly and I was able to watch the drawings on my laptop. I can only be very supportive of the application. Thank you again. Thank you. David Anthony, I'm going to skip you and we'll go to Sarah too. If that's! Okay with you, Anthony, yes, Sarah had stepped away for a second, but I thought she was back, but perhaps she still working on a child to bed so we'll skip Sarah for a second and maybe she'll jump in Elita, thanks first, because you're intruding further into the sidewalk with the stairs you do know. You have to come to the transportation committee, because this was an issue just a couple of months ago, and we've been in contact with the DOT relative to obtaining a revocable letter of consent right, but you still have to come to the board's transportation Committee as a step in that process. Okay, because someone forgot- and it was a big or did not know- and it was a big problem- so I was asked to remind applicants. Second of all, you glossed over this the stairs, I'm concerned about a tripping hazard with going further 10 inches into the sidewalk. I do not know, even if we're supposed to be discussing that and having a rounded edge, normally the stairs going into the sidewalk have some kind of I do not know what the word is, but handrail and thing on the side of it to avoid pedestrians tripping over the stairs. So I do not really know what you intend the rest of it makes sense, but I have to say that handrail for the ramp is hideous and you could do it's a beautiful building with a lot of detail, those, I guess Bay Windows and the and the metal work, and then you have this really ordinary, looking handrail, which just points out the the industrial, not the right word, just the utilitarian nature of that ramp, and I think you could do a lot better with making it fit into the the beauty, the aesthetics of the building. Thank you, okay. Thank you. Okay, after that is Michelle. Yes, thank you. Two elitist points. I was sort of thinking. Some of that too number one with the handrails on the steps. Did you need that center? One for compliance was that part of what the compliance was yeah, the the center rail would be needed for compliance, and also we thought it was a just out and out of safety issue. The prior member mentioned about this coming out. The the rails do extend beyond the end of the this step, as is required by code there. They are to extend an additional 12 inches past the step, so they would be an additional warning. Perhaps if you will, and also the handrail in the center is a safety issue based on the width of the stair, you need to divide it up. Okay, what I was going to say is: I could see solving the tripping problem by extending the side banisters over that first step, so that you have a banister and it could be curved. It could follow the step, but that would prevent the tripping problem. If the center rail is necessary for compliance, that's fine! If it were not, I would recommend that it be removed, because it's a beautiful front and that really divides it up unnecessarily. I know people using canes or that might want to walk up, would be perfectly okay with using either of the side rails. You won't have multiple people walking up the steps at the same time, I'm sure it's not that heavily trafficked. So if it's a compliance where you're not compliant, if you do not, have it that's one issue, but if it can be removed, I would appreciate that, and also would like to see the design of the ramp, with the exception, of course, of the spikes on the top of the fencing, but to maybe give it a little more detail similar to the detail. I do not know if my this is I'm controlling this, so I do not know if you're seeing my mouse, no you're, not no okay, I mean under those spikes. You have those d that detail. I can't quite see them, but the square openings or whatever. If you can call incorporate that into both the banister and the and the rail. I think that would be terrific. Also, it's not part of the application, but it would be great if you can put those spheres back on those columns. That would be beautiful and, as a matter of curiosity, how are you accounting for the steps on the interior? Did I see three steps as soon as and the width of the front doors, the front doors are being replaced with fighter doors so that they meet the code and the three steps you saw inside they go down to an elevator which, if you look at the photo, that's up right now that doorway to the left that goes to an elevator which only goes down. It can not go up because there's a residential unit too close above it and also in order if it went up that those three steps it would have to exit into the private residential lobby and would eliminate all their mailboxes and then they'd have traffic through their private residential lobby. Okay. So in terms of the of the compliance, that's not part of this. That's not an issue, that's correct, with the design of the doors you're saying you're, making them wider, but are they going to look the same right now? They're metal doors, all glass, and there would be identical to that, except they would not have the narrow side lights on either side of the door. That would be the doors would go all the way to the existing limestone jambs and the jam at each side would be approximately five inches thick as opposed to two, but there was never a limestone in that little area, so we did not think it made sense to return the limestone for two inches and create something that never existed before. Where is your entry? Your automatic entry button? I know you have one at the is it at the ramp? Is that what controls the door yeah? If you let me switch for a second I'll, show you the there's a button here. It is right here. Okay, if you see the button on the right there, where the ramp comes up and turns, there's a button on top of that railing to the right of the door and that actuates the left hand door at the entryway, and you have one inside also for the interior doors. Yes, how is it mounted on the outside bring electricity to it right? Yes, it's mounted on top of the handrail and the wires go into the tube and down. That's where you meant the tube okay yeah see so they're not visible. I know you mentioned wiring in the tube and I could not see where it was okay. Great. Thank you. Okay, thank you! Thank you, Michelle and after Michelle we have gail Barron. Echoing my colleagues, I do think that the handrail does look rather utilitarian, because when you look at the other fencing which I assume is iron work- and I believe you said the handrail was going to be painted stainless steel. It would be wonderful if somehow or other you could create more compatibility and a more interesting design. Picking up some of the elements in the current fencing. Thank you gail. I appreciate the comments on that are our objective in making the railing simple was to not take away from the building. We did experiment with having it look the defense and it was very busy- and you know it, it's a it's a fine line to walk between, adding something that was not original and trying to respect what was original know, keep the two separated. So that was our objective. At least I can appreciate that what about the material because painted stainless steel will never really look the same as something that is iron? And you did you consider you know using the identical material. Even if you kept it more simplistic, we could utilize an iron rail or we could add a you know. Certainly we can make sure that the paint was not glossy. I think that would be very bad. You do not want it to be too smooth and too glossy, which I was just backing up for one second to the synagogue application there are. There are a couple products like Comproco makes mimic a matrix. You could add sand to the paint or cathedral stone, Yawn passing waters. They make some great stuff, but back to our presentation. Yeah. Definitely the railing needs to be a matte finish it absolutely. It would be terrible to be glossy and finished, and you know we were just trying to not introduce another element. That was not that was faking being authentic. That was our goal. I appreciate that. Thank you. Thank you and finally, we have Elizabeth Ashby yeah. I felt the same way as Gail and I understand trying to make it unobtrusive, but to me that looks like something that they've moved from the back entrances or getting to the fire estate at the back. It just. I think, if you could find some way to make it less of, I do not know if a glove fence or a Plexiglas fence would do the job, but that would be really unobtrusive. I would prefer one extreme, the really unobtrusive or the original to this kind of well Gail said it right utilitarian. Looking non- entity, that's going up there, so I'm not happy with that. I'm sorry! You have to do this because this is such a wonderful building. I would have rather found a way, perhaps to the I assume you can't do it or you would have done it using one of the side doors as the handicapped entrance. So I assume you're stuck with this, so I would prefer one way or the other, not this middle ground thing. Thank you. Thank you. I believe there was an additional I'm sorry. Well, no there's an additional neighbor comment that I think we can go ahead and allow and then we'll get to Jane and then I'll comment and David. Oh, I think David did I had a very I have. I would only like to, and I do not believe in getting into design issues, and I think if the architect would take a look at a Stanley, catalog he'd find a lot of steel and bronze that reads charcoal and black, so you do not have to do a painted finish, yeah, okay, so going back to the neighbor again. Oh! Thank you. Please sorry! Just thank you all, for this is an incredible process to watch by the way. Thank you for all of your service. Just a really quick question back to Christopher on estimated timeline for implementation of this. Can you just give us a quick sense of this, because, frankly, the neighborhood has obviously been dealing with this for multiple years and I'm just curious on. If this is approved? What is the timeline? I can't answer that immediately I mean first, we need to get the approvals. I think that the approval process, you know I'll say that the Community board has been very helpful and the LPC has been very helpful, but the department of the DOT that permitting for the sidewalk opening can take some time as far as putting the rest of the building back together. I do not know that this you know, is a roadblock to putting the piers back to putting the rest of the the building back, but you know I, since I'm not involved in the construction aspect of the kitchen. I can't completely. I can't really give you a good answer. I would say that certainly the building owner wants it done, and you know the the people at redneck and radiology one and done it's going on a long time and it, as you know, it's a it's a it's a drag on the neighborhood to have sidewalk covers and construction all the time. So certainly they all want it to be done and that's why we're here now we want to get through the process and get it done, got it just to be clear and sorry. My last question Christopher so would that be independent from the facade stuff? That's going on or all not. I'm sorry repeat that again, would this be independent from all the work? That's been done or not forward, or would that equipment still all be in place? I would think well, this would be independent. We would we would not need a a sidewalk cover for this project whatsoever. Thank you. That's fine! Sorry! I do not want to take up any more time. Thank you for your time. Thank you. Oh okay, Jane. I I'm going to move to James Sorry to Interrupt, Christina and Russell saw. I have not spoken. Oh I'm, sorry, no, it's okay! I just wanted to make sure we gave them their opportunity yeah. This is Christina. I was not on the presentation I had to remove myself, so I can't vote okay, thank you, Christina and then Russell squire thanks. So I you know, I think it's important to have the accessibility ramp. I think the solution is appropriate. I think it's pretty clear that the internal small staircase you know coming out of that entrance on the left. There's really no accessibility solution there. So I think you have to do it in the front. I think the way they've done it is good. I think you know I'm really not concerned about the extension of the step. I think there's plenty of sidewalk space there and you know to the extent, there's a tripping concern. I think it's mitigated and addressed by having those ballast rods on the edge and in terms of the decision about the ballast rods and the look of those. I think you know I like the choice that was made. I think I agree with the idea of saying that, if it's not going to be original, you know you want to sort of try and fade into the background essentially, and I think that's basically what what they've done and sort of struck that balance. While so, I think it's you know, I would certainly vote to approve. I think it's a good good plan. That's all! Okay! Thank you! Jane yeah, I'm going to support the application as presented. Thank you. Thank you. Okay and then I just have a couple of tiny comments of one of which is on the sort of general side of what new things should look like next to old things and on the one hand, I am extremely sympathetic with trying to replicate the feeling of the original metal work at this bill at the building, which is pretty nice, but on the other hand, there is certainly a school of preservation thought that in fact encourages making the interventions clearly interventions. Now this may not be the most beautiful railing in the world, but as David suggested, it's not necessarily our job to talk about design, but certainly this is an acceptable approach and I obviously will support this application. I think having a a building devoted to radiology that is inaccessible is unacceptable, and I think this is a reasonably elegant solution that does not do much harm to the existing fabric. That said, is there a motion, a move to approve, thank you Jane in a second. It also appears to have seconded it, and I see his thumb so will can we vote on this? Yes, of course, I'm going to put up the vote sheet and we'll get going. Everybody is able to see that yes, okay, great, all right, I'm going to mute everybody and we'll get going all right. That should be everyone and we'll start at the top Elizabeth Ashby. Yes, thank you gilbert! Yes, thank you Michelle! Yes, thank you elita, yes, and do not forget about the transportation committee. Please he nodded along Sarah had to leave anthony. Yes, thank you David yeah! Thank you! May yes, thank you. Jane! Yes, harrison, yes, Marco, yes, Christina missed the presentation, so I assume that she's not voting and then russell yes. Thank you excellent. So it looks unanimous and we can go on. I think Jane. I think you said this next one was mine. Yes, it is and no problem, no problem. I feel enormously prepared. This is an additional piece of the Fifth Avenue Synagogue 5E 62nd street. This is a modern style. Synagogue. Building designed by Percival Goodman built in 1956. application, is to alter the facade, replace an entry infill and install an illuminated, canopy and hopefully Arthur, Shaybon and or and or his team are present, and they can tell us why they've chosen to come back to Us Arthur. Okay, can you all hear me? Yes and I do anyway? Can you see my screen? Yes good, so we are off to the races. Let me just minimize you guys. How do I do I want to get you? Oh there we go all right so anthony you kind of introduced me, I'm Arthur, chabon, the building as as Anthony described, was designed in 1858 by the here and incredibly prolific mid- century architect. Percival Goodman, our synagogue is in the process of its first real, significant renovation, restoration in its 62-year history, and we approach this project with an understanding of the architectural, the uniqueness and the cultural significance of this mid- century, modernist landmark and also of its position, its placement in one of the finest historical districts in the city and with that sentiment, the congregation and I are fully committed to retaining and to enhancing its architectural and its cultural legacy through what we hope will be a sensitive renovation that responds to the programmatic and in this case, really the security needs of the congregation, while addressing the you know, basic maintenance and and also making the building code compliant and accessible, and this effort in its entirety. We hope, will make this building viable for well beyond the next years. So you can see the where the building is located. My little leisure phone, it's on the north, it's on the north side of 62nd street, about 190 or so feet from fifth Avenue just to the left of the building at one east 62nd. You have the home, designed by horace trumbauer and in 1903 with its rooftop edition, which you can see over here, which dates to 1938. on the right. You have a beautiful bozart style kind of reserved, mansion, 11, east 62nd and in general, it's a really wonderful block with this distinguished eclectic group of very fine homes from the late 18th 19th and early 20th century. So we came to you in June for approval of the elevator extension and that's being implemented to make the children's roof area the play yard and the top floor accessible. We come to you now to show you facade alterations that are generated from security requirements for the facility, we're. Sadly, all too aware of how vulnerable religious institutions are to security threats and the changes we're proposing are key to to making this building safe in developing our design. Areas that, where that were not code compliant were slightly impacted, so we were then compelled to modify them. Compliance and I'll show you the impact that these egress improvements they are actually improvements, have on the current facade and then finally, the changes that we proposed to the entrance rendered. The current canvas awning too small- it's obsolete now, it's too small to cover the enlarged entrance. So we are now seizing the opportunity to change this entry awning that is completely out of character with the building and propose a new marquee that relates far better to Percival Goodman's design intent. So, let's start by looking at the plans on the left here, you have the existing ground floor plan on the right on the far right, for your reference is a photograph of the building the area highlighted in red. These are the areas impacted by our proposed changes, so, let's quickly enter the building as it exists. You come in through these double doors, into a small vestibule to the left. You have a security office and then further to the left, you have the stairs that you'll see how they're done the let's look at what we're proposing in the middle here we're now changing the single entry vestibule into a into separate, dedicated, controlled access and egress vestibules. This is part of the security plans for the building controlling entrance and controlling exit from the building. We are also adding a small security station here, where a guard will be situated able to view people coming in view. People exiting the building at the same time, staying in close in close proximity to the people that they will be protecting. And, of course, you see here in comparing the two plans that the existing awning does not provide adequate coverage for the larger double vestibule. A larger scale plan now well, the top is the existing and you can be dotted in again. The areas that are impacted and below is the proposed. You can see to the left of the existing plan, a single door which provided egress from stair, a which is the secondary stair for the building, and you can see the single vestibule and then here in the larger plan, the double vestibule and then the issue encountered with stair number a is that it was not code compliant because it did not. The stairs egressing filler were not separated from the stairs that egressed from the building as a whole. We were compelled to install this wall marked with the red arrow to separate the two stairs. In turn, we had to add specific doors that related to each one of those means of egress. So from the cellar you have a door here and from the building as a whole, you have a separate door that describes the changes that are occurring in this portion of the building. You see the vestibule and you see the new marquee market in plan. So let's look at the Exterior elevations top is existing again bottom is proposed. The you see dotted in the top. The area is impacted by our design, and the bottom image shows you our new marquee over here. It shows you the double doors, the louvered panels, which are on this part of the facade and and the new doors for egress from the city and from the upper floors, the higher canopy introduction of glass doors rather than the bronze doors. These will be bullet and blast doors, though the glass gives you a much more welcoming entry experience, you'll be able to see in out. This is part of the security protocol as well, but it also serves to make the building just feel more part of its community, and I also want to point out how raising the canopy marquee exposes the glass transoms, and this also will serve to bring much more light into the building and to better express the entrance which you'll see in the upcoming images. These transoms were formally covered by that canvas awning, which was kind of stuffed under the the curtain of that facade. Also, the continuity of the louvers that you see here. That also helps to improve the composition of the facade. I want to point out also that the current door to the this door, which currently serves as the one means of egress and the access also to the mikva, the ritual bath, which is in the cellar that door, is currently recessed into the plane of the granite facade and it's a faux painted metal door. This was part of a alteration to the building done, I believe, about 10 or 15 years ago. This is not a historical portion of the facade. We will be proposing doors in that area that are going to finish flush with granite and they're, going to be clad with a thin granite veneer, making them essentially blind doors, and this we feel does significant cleanup with Assad and also brings it back to. We believe, the closer to the design intent of Percival Goodman so we'll quickly. Let's look at the whole plot again, but in color. So here you can see the again the left is the existing. The right is a proposed and you can see how our new design gives the entry a much more welcoming sensibility with the marquee being higher and thinner. It also gives less kind of disruption or obstruction of the sidewalk. Let's continue going in closer here. You see, you know kind of one of the things we've been discussing that I've been pointing out we're looking northwest. You have the higher the lighter, instead of that out of character, awning canvas awning and the increase of glass at the entry, allowing the building to feel less cloistered from the community and really more part of it. The new louvers that I pointed out before they give a kind of more rigorous, horizontal continuity to the facade, which is now no longer interrupted by that canvas morning. That was stuffed here under that facade Curtain. I want you to also notice how we subtly float the marquee. You can see here off of Goodman's facade, so his I guess what we described as sort of like a curtain of punched openings. His that screen that curtain is allowed to remain continuous. You you'll see that we're presenting two different options for the ceiling of the marquee, the underside here, the one that you're looking at now is a quadrance of backlit glass with a thin bronze mullion between them. The next one is you'll see later is a different design that proposes a perimeter of light, but we'll show you that here the view looking northeast and again, you know reiterate the same things: the continuity of the louvers, the opening, the more expansive opening and the lighter, more delicate, marquee notice, also the doors. Actually, I should say notice how you do not notice the doors, the cellar and the upper floors. Now that they're flush, I'm here, looking acrosss the you're looking northeast the existing on the left and the proposed on the right and then here looking the opposite direction. The existing on the left, the proposed on the right- and you can see again all the things that I already mentioned. As I said, we have two options that we're proposing the one you saw with the backlit glass and then the next one, which maintains a bronze ceiling panel with a perimeter of a perimeter trough of recessed light the perimeter cove, and this is looking northwest and then looking northeast the same idea. I should point out also that we very subtly incorporated the logo of the building and in the same material on the corner of the marquis and just also very subtly, the number five on the front. This is going to be extremely understated here. The same. The second option now looking northeast and here looking northwest I'm going to sort of conclude with some technical drawings that address aspects of the existing building and also address in more detail our design intent. I'm going to go through these fairly quickly because it's certainly very late- and I do not know if these details would be entirely wrong, though it would be certainly relevant when we present to landmarks. These sections show you the details of the marquee, and I want to point out again how it sits slightly away from the existing plot, and this is to ensure, as I said before, the Goodman's design concept of this screen or the curtain with the olive shaped perforations that it remains uninterrupted you'll, be able to see actually the continuity of the facade. When you look below the marquee and from the side as well I'll point out that seven above the sidewalk, it would project 15 feet from the building and as well 15 feet in plan so of square marquee. Here in a little bit more detail, we can go back to these if you think it's necessary, but this detail shows you, the backlit glass. You can see the delicate detailing at the corner of the marquee and this detail showing you the marquee design that has the the perimeter light and again, with the same, delicate detail at the corner and again showing you how it's slightly pulled away from the facade. These images are close- ups of the bronze louvers and we're presenting this to show you how, in our in our drawing here, how we replicate that detail to stay consistent with personal goodness design and then here the an important improvement we're making where the the giving this is not the historical portion of the thought, you're not going to get painted or recess into this rod, and you can see here in our detail how we're proposing that door be shifted to the front plate of the building and it has a thin veneer, that's mounted onto a core material and that thin veneer of granite would be coplanar with the granite facade. Here we have the streetscape view you can see above the existing below the proposed, and one of the things to notice is how the placement of our marquee its projection about 15 feet in plan kind of lands. It ends within a common denominator of projections along the street and for a building, that's recessed back. I think it's important to bring it back into the street plane not to project beyond that as well. So, as I kind of go brought a little closer on the presentation, I want to show you here. There are three: these are three generations of the development of the exterior from the original 1958 to the current and then to the proposed and we're very confident that our proposal, while we're providing for the security, needs the programmatic needs of the congregation. It's also an improvement to the current facade and arguably provide an element that when you look at the original building, it's missing and that's an articulated point of entry, a kind of proud articulated point of entry. Now you feel very much like you're walking into when you enter the building. On a final note, I show you here examples of Percival Goodman's work that I believe that they're somewhat similar in their planar sensibility with these planar covered entries and we could not find a building by person would be a direct precedent, but I feel like these. The images argue that even our current design parameters, the issues that we had to solve percival could may very well have come up with a solution. Finally, here I do not know if it's relevant for the presentation where we did our postings. So that's it. Thank you Arthur. All right we have do, we have will do we have any members of the public. I do not see any, but I'll give them a couple seconds to raise their hand or wave, and I do see one now that's caught up if anybody else wants to speak on this from the public. Please raise your hand at this point, but right now you have Keith Rubinstein, hi, hello, everybody, I'm a community member. I live directly acrosss the street and I think that the presentation is extremely beneficial to the community and I support it. Thank you Keith. Do we now, and so now we go to the committee there's one more: oh, there is sorry, yes that came up while Keith was speaking. It's the friends of it's somebody from friends of the Upper East side, okay! Well, it's Lara, hello, everyone! I'm sure this is a question that the community members are going to ask, but I just wanted to know how the marquee is being fixed to the facade. The marquee is cantilevered from. Actually, if you want me to go and show you in the detail here we go. There are steel beams which extend from here out to the end of the facade and the this area. Here is basically like a thicker sleeve, which runs the length of the vessage. You do not get water dripping in, but gives that sense of the marquee being separated. But it's supported by this steel, a series of steel columns that cantilever the marquee from the face of the building so the face the concrete face will be perforated the yes, they will be penetrated by these still columns, as will this a large support beam all right. Thank you good. Now, let's start with Elizabeth all right, Elizabeth Ashby, I think it's really quite a big change, but I like it and I think it goes well with the existing building and so I'll support it. Thank you. Elizabeth yeah who's. Next Gail, Barron, okay, I like the design as well. I do have a question as far as the illumination of the marquee. What kind of lighting are we talking about would be led lighting that is either in the one proposal recessed. As you see here, recessed in a perimeter trough, it runs around at the edge or in the other scheme we'll go to that. I'm assuming you can still see my screen right. Yes, definitely thank you. In this scheme. You can see that it is a series of backlit glass panels that will have an led panel behind them and it'll give just a very soft glow. You know we do not. Obviously we do not want a brightly lit condition. We want something that almost feels like moonlight at night marvelous. Thank you so much Michelle. I think it looks great and I like I, like the lighting I, like both choices. So I'd be happy with these open, but I think it's a it's a great job. My question is how many perforations, how many holes do you have to make in the facade to support the beams that will support the canopy? I believe there are four beams coming through. So that's four holes, yep four holes, yes into the facade. Okay, looks great. Thank you. Thank you Elita. Thank you. Thank you. I really like it. I think this is a vast improvement over what looks like the entrance to a nightclub and all those film noirs that I like to watch. So I think that this is really goes with the building. If you're interested, I would go with the perimeter lighting concept, but I think you did an excellent job, the doors, the glass. It really works with the facade for me. So thank you. Thank you. So skipping Anthony David. I also think it's extremely well done. I prefer the marquee that has the that has the bronze panel, it's thought of as a theme and variations. You have the floating of the canopy and then you have sort of that floating bronze plane within the canopy, but I could accept either and I think it's a very beautifully done project. I will support it. Thank you. Next is may you're unmuted, no question thanks. Man next would be harrison yeah, so I think that the only thing that was, or one of the main things that one's ability to enjoy the interesting architecture presents in the synagogue was the unsightly awning, and I think that you know this is a vast improvement. I think Elita said it well reminds her of new our film but yeah. I think this looks great. I think the perimeter lighting really does a great job of blending new. With old and yeah. I mean complete support thanks Harrison Marco One question. The thickness of the kind of the marquee. How many inches high is that it's 12 inches thick, so 12 inches and you're, going to make four penetrations and four penetrations you're going to go all the way from inside to outside. Yes, so how you're want to put the lights this, especially the light that I'm seeing right now, the led panels we would be using if we went with this scheme are no more than about a quarter of an inch thick. It's a it is an led panel. Maybe a company called New, York Digital and it comes in you know I do not like four by eight sheets, if not bigger and and it's it in and of itself has sort of a leds that I believe run around the perimeter and illuminate the light carried through that panel and becomes the source a personal myself. I have. I believe that the perimeter lights is better. The other one looks more like a theater or something like that, but the perimeter lights. I really like. Thank you. Thank you, Marco. Thank you to our public numbers, Christina Davis, Star, six! Thank you. No, I agree. This is a beautiful project. Then I can support it as presented. Thank you thank you, Christina and finally, russell squire thanks. So I think this is great. Like everybody else, I I have a slight preference for proposal b. I think that the you know the sort of opaque surface with the lighting around the edge is more consistent with the facade where you've got a lot of concrete and then sort of lighting kind of interspersed with it, but I would be in favor of both proposals and just as a procedural matter. I do not know what is you know whether we should express a preference or we can? I'm not sure. If you know, is it a situation where there's commissions, I think if we are inclined to pres to express a preference, I think we should. I think I think, there's a general preference for this scheme for the I'm sorry to Interrupt, but I do think there's a general preference for the perimeter scheme and I think if we do prefer it, we ought to why not. We should say we do okay, great well, so yeah. So that would be my. I would propose a resolution to say we approve both, but we prefer b ah, but we have to hear from Jane and myself as well. First, I'm teasing you yeah. That was all right, James Russell I'll, just echo what David said. Thank you. Okay. I arthur it's a lovely presentation, it's very clear. It's very well done. I have just a two comments that are sort of the a little bit on the grumpy old man comment. I know why the the co, I understand why the congregation would want to have a canopy, but the building never did have a canopy, or at least did not originally have a canopy, and there is something marvelous about the sort of plane of the facade and the then setback of the of the entrance plane and then, following up on that, although I think this is fine and then following up on that, the examples that you showed of other Percival Goodman buildings were distinctly non- urban examples, and so there is something different, I think about a building in the city from a building in the country, but I would support this. Do we have a resolution and do we want the resolution to speak to a preference for one canopy over another and if only if, we all think feel the same way, although I thought we did, that was sort of a question, even though it sounded like a statement muted me, so I did not raise my hand, but I do have a comment I like them. Both I'm perfectly happy if you put a preference in so that's fine with me David did you want to suggest a straw poll? Well, I suggested a stroke which could be done very quickly. I think that's a good idea. David could those who wish to express a preference for one or the other? Let's do it in two pieces raise their hands? Maybe it's hard to see anthony because could we put them, I think it's? How can we see how everyone's voting I can't see? I can't relate yes, bring it up, bring it up on the and your participants. Menu Jane will can tell us how many people raise their hands. He can see it pretty clearly for well I'd like to see the other option of the awning before I vote again. Okay and David. Is this the one you're in favor of well, I can't see anything, but the one I'm in favor of is the one that has the brass panel, not the glass panels. Oh, so that's the one that okay, I understand. Two, I think, is what we've called it. E yeah option two option: two, I sort of like the breath of the way the brass panel floats. Is this that one it adds some mysticism go ahead. I hear you thank you. Is there do not forget. We have one more resolution after this I know. Is there a general agreement that there is a ah here we go. Anyone who does not want to express a preference for the what we'll call Scheme, B or scheme two if they could raise their hands? Perhaps we could then just move quickly through this and vote. Thank you same on you gail. I do not have a preference. I like them both. Oh, that's all right! No preference is all right. Is it fair for us to I'm just asking the question? Is it fair for us to make a resolution that expresses a preference in your absence of a preference, or should we just not do it at all? I do not see why we have to do it at all, but that's my personal opinion. I agree. Okay, yeah, if I can say do we have a resolution to how do we write the all right, never mind we'll figure it out. How do we do? We have a resolution to approve disapprove yeah, we approve the application is presented. Okay, can I make a friend? Yes, okay, hang on a second gail and Elizabeth, we have a majority of the members of the board who have a preference on the marquee. So since there's no preference for the two of them Elizabeth and Gail, they would not object necessarily to having a preference. It's not like. They prefer either way you guys want to do it. Okay, let's say that we will craft it in such a way that we have a preference, but it is not an absolute necessity. How's. That sounds good. I see a nod okay now, so I have a resolution. Do I have a second thank you? Will let's call the roll all right? Nobody mute themselves, all right. Everybody sees it and this is item five approval and we're going to call the roll starting with Elizabeth. Yes, thank you gail. Yes, thank you Michelle. Yes, thank you elita! Yes, thank you. Sarah left Anthony. Yes, thank you David! Yes, thank you may yeah. Thank you Jane. Yes, thank you harrison. Yes, thank you. Marco, yes, Christina might be muted. Sorry, Christina! Yes, thank you and then russell yes, perfect. Thank you all unanimous. Thank you. Okay. We still have one more application. This is 1022 Lexington avenue. We heard it last month as well. We voted. It was a disapproval last month because we did not like the window treatment at all. We thought it was too contemporary, so I think the applicant has come back to us could if, but if we could, please be as brief as possible, it would be very nice and we appreciate your patience because it's now so late. So is the applicant here I am here. It's a theater or I am on. Thank you well. Thank you so much for waiting. That's quite all right! That's quite all right! We are happy that we have a chance to be able to come back. I know it's relatively short notice to get us back on, so we appreciate the Landmarks committee getting us back on for this presentation. I believe Olga is on the phone from my office and she'll be sharing the content for the presentation. We did go back based upon the committee's comments and we reduced the massiveness of these single pane glass panels from before we used them both in size and broke them up into smaller sections and smaller panels. We did try to retain the charm like elements that were mentioned, such as the transoms above the windows. We also reduced the width of the glass on the mat on the Lexington avenue side and thickened up the masonry Pile asterisk. So we have a nice masonry column going top to bottom on the project. There was a notation to us about retaining the historic, looking wrought iron into inside metal portion of the door. We have that we were taking away on the Alexander Avenue side. We are going to reincorporate that door at the interior of the residential entry on East 63Rd Street, so that door will be retained and will be seen. We also widened the Masonry Pile Esther's on the East 73Rd street side to reduce the width of the glass and those, I think, are all similar in width about two feet: approximately two feet to two and four two feet: four and a half inches in width. So it gives it more of kind of like a uniform element in terms of the masonry. It helps us organize the glass and fenestration a little bit better. We did raise the bulkheads of the glass at the first floor level on east 73rd and Lexington also to one foot eight inches, and that also gave us a reduction in the glass from the bottom, and you can tell on the top. We added the wood transoms that were in element on the second floor. We've incorporated them on the first floor also and that reduced the height of the glass panels. So as I quickly just to reiterate, we reduced the size of the glass, the massiveness of the glass broke. It down. Re- incorporated a bunch of the charm elements in terms of the transom above the windows, they're, breaking up the glass panels of the windows introduced more masonry back into the facade and reincorporated the historic looking wrought iron door onto East 73Rd street on the entry. Could you just go through those once more, you reduce the size of the glass overall correct. The glass was pretty fairly large. It was similar in size and appearance to what's on the Pharaoh and ball facade at the first floor. Under on the west side of our facade, do you reduce the size of the glass, the massiveness of the glass? Then what was number three broke it up in terms of his visual appearance. They were just single panels before at the second floor, and now we've broken them up into multi- panel windows, just as they were previous. If we go to the pre- existing elevation, drawing I'll go up yeah, you can tell see I'm destroying right here. Those were multi- panel windows and those will be now again multi- panel windows at the second floor level. Thank you and then okay. Then there was one more thing right, yeah. We thickened up the masonry pile esters to reduce the width of the amount of glass on the first and second floors, but we also introduced wood transoms above the windows because they were prevalent. Sorry, they were existing at the second floor level and we thought they produced a nice element and we were mentioned that was part of the charm of the building, so we reintroduced the transoms on the first floor level also and that shortens the height of the glass at the first floor level. I only wish I could write this right fast as you speak, you reintroduce it. I'm sorry first floor existing on second floor, correct, okay and the final element was there: we had a wrought iron interior portion of the door at the entry of the resident residential entry previously on Lexington had a wrought iron door, a historic looking door, even though it was not a landmark element. It was mentioned that would be nice to incorporate that element or feature into the or keep it at the building. We will be keeping that at the residential entry will be reincorporating it into the door at the residential entry on East 73Rd street, so that item will not be lost. Thank you. So much. Okay! Thank you! Oh gosh, it's nice that you know it's so funny because it's so important to retain that charm within the historic district. Okay, thank you. Are there any members of the public who wish to address this? If you would like to speak to this item, please raise your hand I'm going to give it a couple of seconds before we move on. I think that's good. I think we can go to the Community Board and I forget which direction we went in last time, but we can do the reverse. I think now it's the reverse, starting with marco, okay, marco. Thank you. I think there is a really improvement in the new proposal. He reduced the area of the grass maintaining in the same the second floor, multi- panel windows. They would transform on the first floor, match to this the second floor and relocate the main legs avenue door to the residential section. I think it makes it makes more residential than that, even though I'm not happy with the with the rest of the first floor. Thank you. Thank you. Marco is Harrison. Yeah sounds pretty good to me thus far. I like the fact that you're keeping the original door- I think that that's beautiful and it would be a damn shame if yeah that was replaced. So thank you for the presentation and that's good. Thank you. Oh thank you. Thank you. Harrison may no questions or comments. Thank you for the presentation. Thank you, mate David. I think the elevation drawings speak for themselves. I think they've created a very lovely composition. I think it's appropriate and it has my support. Thank you anthony. You want me to go to you now or come back. Oh, you can do me later or now either way go ahead, all right I'll talk. Now I think I this is much improved. I definitely prefer the scheme that re that is less uniform. That retains the two sort of narrow windows. I also have a question narrow windows on second floor. I also have which I think is option a correct. I also have a question: what happens? I see you're removing the existing cornice at the first floor second floor, I'm not sure which it is what's going on when you put it back. There is something very generally very appealing about having a having a cornice that returns on itself as the existing one does at the south edge of the building and it's sort of a sh. It looks as though you're going straight acrosss and then just ending it just cutting it off and I'm not sure if I'm not sure, if that's if that is what you were intending or if you were intending in fact to replace the existing with something that looks like it. I think it'll matter it'll depend on it'll depend on how damaged it is. I think that that's going to be that portion. Are you saying in terms of the ending where it runs into the Pharaoh and Ball Storefront yeah? I right now it's a straight finish and edge finish. There right now, if we uncover and notice something that can be done a little bit more gracefully, we can't do anything to damage their facade no, but I mean, if you're I mean I guess the point I'm trying to make is that the self- return that is there now that you are removing, and I understand that if it's deteriorated, you return you remove it, you throw it away, but the new piece that goes back to it, I think, would be you would be better served you and the neighborhood would be better served to retain the self- return. At that point, I think we I think, if we can, we definitely will be we'll be retaining that yeah, okay, yeah similar, similarly for the second floor by the way. Similarly, for the second order, okay, I think those are nice details on the building agreed. Thank you. Thank you Elita. Thank you. Thank you. So much for coming back. It really matters when people take our comments into consideration, revise their plans and then come to the landmarks committee again. So I really I'm grateful for that. Thank you. Can I just see what the Lexington avenue looks like? Thank you yeah. This is a big improvement over the last version of this, and it relates to the upper windows it had. You preserve the charm. Keeping them masonry adds to the charm. So I really like it yeah. I think I think it lent itself to the scale. It was better scale wise. Also we felt so yeah. You took something that was very modern and did not connect, and now it all connects. It makes much more intrinsic sense, and so it is relaxing to look at it rather than discordant and daring, and we need relaxing these days. So thank you agreed a fact, and next is Michelle yeah. Thank you. I'm the screen, I'm looking at now I heard you refer to a an a or a b. I never saw a b when we were looking at 73rd Street. I only saw an a no oh here's option b, so that's b, correct and that has all the windows uniform at the second floor, which will be the commercial space, but I think we prefer, as the architects the charm of having those two separate windows in a above the second floor. More than more than more than the uniform one below. Oh okay, I never saw the bee. It was not on my screen, so you're suggesting a correct. Okay, I'm very pleased that you came back to us and took all our comments into consideration. That was really very nice. As I look at the at this picture and I'm looking at the proposed brick, I'm assuming just for definition, it has sort of a darker grout than the one on the upper floors, or is that an intentional design? That's correct? No, that's simply to distinguish. What's the what the new brick is as opposed to the old brick. Okay, we're doing. I do not know if you can see on the third floor, there are several rectangles, I think three of them that show where air conditioners were removed. Those are simply to show the infill of the brick in those sections. Ah, okay, it'll blend in with the rest of the with the rest of the building. Thank you. This looks fine. Thank you very much all right. Thank you, gail. Well. I also want to thank you for coming back listening to the comments of the committee and incorporating them in your revised design. I think you did an excellent job. Thank you very much. Thank you. Elizabeth yeah. I agree, so I will support this, thank you and to our public member Christina, Davis Christina. Oh yes, I'm here and no. I agree. It's a big improvement by coming back and thank you very much and I can approve this. Thank you. Thank you and russell thanks. So I have a question. I guess- and you know I was not here the last time, so I do not have all the context, but it seems to me that changing the door from being on Lexington to being on the street is a big change and in terms of just considering appropriateness, you know looking at the other buildings on that block on Lexington. They all have the doors there, and this seems you know changing that, for this building seems like a big shift from that and the precedent that we have at the end of the presentation about you know taking the door off the avenue and putting on the side street those are on Madison. So I'm just wondering- and I gather that it's something that the rest of the committee has considered and is sort of satisfied with, but I would just I would appreciate if somebody could just explain what the thinking was russell. Actually, I can speak to that point a little bit just to let you know the historic door that's on Lexington is the entry itself is set back about four feet from the Lexington avenue side right now. Existing and the historic door is not on the outside of the door, it's actually on the inside of the door so to where we're relocating it. On the East 73Rd street side, it will be much more visible and seen right now than what it is in its current location. It's kind of like in a hidden, dark corner and now you'll be getting you'll. Be get a nice review of it. I understand that entry is recessed. Yeah, that's helpful. I still just in terms of my I guess my concern was not so much about the ornate door itself and I think that's good that it's going to be more visible. I guess it's just the you know in looking at the photos. There's you know entrances on that avenue throughout, and this would be would be different from that. But that's a you know. I take your point. So that's that's helpful. Okay, russell! If I may interject, I think that the if you can't look at the rest of the block, because this building is on the corner and in fact the functional reasons for moving the residential entrance around the corner are in fact pretty compelling. It helps separate the resident I mean functionally. It separates the residential entrance from the off of the Avenue and makes it a little more private, a little quieter and I think that that's an appropriate. I actually do think that that's an appropriate solution to the sort of typical problem of four- story- buildings with retail on the first and second floor, and how do you get to the your apartment above and I think that it's actually an appropriate solution to move it around the corner. If you can well anthony, you might add that it also allows the tenant to have more space for his retail business, correct. It did not yeah, that's right, yeah, so that's and actually I think it will look much better. I live right in that neighborhood myself, that's helpful! Thank you. Thank you. I David you spoke. Did you want to add anything else, David Halpern? No, I no! I think everybody covered the the issues. I just wanted to ask the applicant one question: you're going downtown with option a am I correct. That's correct! That's right! So option b is off the table totally correct. Okay, thank you so, and thank you for returning to us, so I think we're ready for a resolution. Most of you are unmuted. So, oh okay, I resolution to approve as presented. Do I need to put that in the resolution that it's scheme a if no I'm not going to put it in because I'm the other one's off the table? Okay? Is there a second I'll lead? A second did it? Okay, we can go to a vote now. Okay, let me put up the screen. Hopefully this time, you'll all be able to see it. I apologize for the last one. I may have not had the actual vote sheet up. I thought well, okay, good all right, I'm muting everyone, so you should all be able to speak whenever you're ready. This is an approval perfect starting at the top Elizabeth Ashby. Yes, thank you calvary. Yes, thank you. Michelle yeah, I my hand was up. I had a question on the Lexington avenue side. You have a vertical sign hanging. There are you proposing an assign with the new owner's name? We are not okay! Thank you. Yes, all right, elita! Yes, thank you. Sarah left Anthony! Yes, thank you David! Yes, thank you! May yes, thank you shane! Yes, thank you harrison! Yes, thank you, marco, oh marco you're! So muted! Yes, thank you christina. Yes, thank you and russell. Yes, thank you. Thank you all! It's unanimous. Thank you very much members. Thank you very much for doing all the back office stuff for our meeting. I do not know what happened. What happened I just took it down. Everybody should be able to okay, I'm hoping that I'm thank you Anthony for Stephen reach. Here we really appreciate it. I I'm sorry. The meeting ran so late. I'm hoping that next month, we'll have a shorter agenda so that we can address other issues like the window master plan and the letter we got from civitas or the responsibility sent to the LPC, which was really amazing. I did all of you see that letter the copy of the letter, the Civitas Elizabeth, I think, circulated it. Yes, so we did not get it. I was sending a copy by a board member. Well, that's wonderful that you got the copy and that we all saw- and hopefully we can add that if it's a shorter meeting to next month's agenda, because I think it's an important issue to discuss- and I think we should send some kind of a rebuttal to the landmarks commitment in response to the civitas letter- and I think there are other items- we've never even discussed when Elita had arranged the meeting in all at the beginning of September with Sarah Carroll. That's never been discussed, but let's hope for a shorter meeting next month, so that we can take up some of these items and have an open discussion about all of them. And with that I think we should adjourn yes, second, okay, thank you so much, and especially thank you to will and to anthony, thank you Jane, David and Anthony. Thank you, you're quite welcome and I'll get the the things you in the morning. I want you to get until Wednesday morning.",
            "summary": "Lexington I'm, not sure it's weird how many people are there, but this tonight is the October meeting of the Landmarks Committee of Community Board eight, and we have six applications before us.\nWe are here to listen to the applicant, hear from the public and then go into executive session, and our mission is to vote on the context and appropriateness of the application within the historic district, and we do have one individual landmark tonight as well.\nSo with that we're going to go right to 135 East 71st street, the eppery side, historic district.\nAre, are not energy efficient, so we need to replace all the existing windows and, let me just get my notes: The awnings are not LPC approved and they are all mismatched.\nRendering shows that originally the lower area was going to be a gray, clad granite and we are proposing to put the gray back right.\nIt is red and LPC actually calls it yellow brick, but it's not Apartment House, Yellow, brick facing above polished, stone, ground floor setbacks The building is listed as having no style and therefore does not contribute to the architectural character for which the Upper East Side historic district was designated.\nThe proposal for the storefronts, I'm just going to get to my notes, it's a bit of a tricky building, because it's on such a slant on Lexington avenue, Only about six inches above the sidewalk, where the window actually begins.\nThe granite, is such a small area that it has cracked and they've been having problems with the storefronts and holding the windows up the wall that holds the store fronts up right now is only four inches wide, so our construction of the new straw fronts will differ.\nAnyone from the public who wants to speak to the application right, now?\nThe only changes to the master plan is the color of the windows on the 71st street side.\nThe height, is, will be about 30 inches, but it varies because there's also a slope on the 71st street side, so it ranges between I'm going to say 30 and 36 inches, okay, Right, now, they're, and they and it runs the whole length of the building.\nYou know it's a metal piece that just fills in that 12-inch area above the windows All, the awnings that are on Lexington avenue now are non- retractable.\nBut, as you see there, the second storefront in which is the left most storefront on the 72nd street building, because they're two different buildings, you could see, there's a big height issue with that.\nThe entire lower elevation that you're looking at when it says Lexington avenue north that whole set is the 72nd street building, which, for reasons no one has been able to explain to me, are not in the landmark district.\nIs that when landmarks designated this as a no, style, building, Upper, East, Side historic district is one of the few districts.\nThink it's ironic that so many buildings on the Upper East side, which are these generically described as white brick.\nNo significant issues with it, the design seems sound, seems like it will come out without disrupting the general architectural Gym. Then we'll move to the public numbers.\nI think, is excessive, but still acceptable, and the second comment is: You are claiming the question about the existing windows.\nI do think the presentation was not as concise or as informative or as narrowly defined as it might have been, but I'm going to approve the application.\nProposing is a master plan for the two visible facades of 969 park avenue to be in the existing six over one mountain grid, pattern.\nThe, Landmarks Commission, has raised the issue that they think that possibly the original condition was six over six But I would like to and tell the committee that the building has, since the 80s a unified alteration agreement that requires a six over one month and grid pattern, and that is what all of the windows that we're proposing for the master plan have now.\nThis is very hard when there, when the building has been, has taken the trouble to alter their alteration agreement and require uniform, fenestration, and I respect that I like to stay with that recommendation, even though it appears as though it's going to create some little bit of patchwork over the years, because eventually the aim is to get the building back to where it was so to approve what was, I won't say, an error.\nDo think that the uniformity is a very strong argument in favor of approving the six over ones, because I can imagine what a mismatch it could be for years and this way, when you look at the building, it may not be perfect.\nIf my impression is that people seem to think that the the proposed aluminum version is going to look the same as the as the existing aluminum version, so I think, if that's the case, then it's probably fine.\nI. Do not think people who I do not think a building that has made an effort to do it right, since the 1980s should be penalized and have to change all their windows to a different to a to a different arrangement.\nNo, because I want that position represented in this vote, elita going to abstain, because I think we ought to have some more definite response from Landmarks Preservation Commission about what the history was.\nIf I could just interject before you move on sure, I would like to remind everybody, particularly the newer members and the public members and our board members, that an abstention is a no It would be nice to just vote yes or no.\nSo I, think that if there, if it were possible for more clarity, I, that would have been appreciated in any event, it passed, and I know it's not the applicant's issue.\nWe discussed this with landmarks and they agreed that this is the least intrusive option and the best solution to provide power to those proposed signs, and we just hope that this solves any questions that you might have about the electrical supply path and thank you again for giving us the opportunity to come back and present.\nThe synagogue which is a beautiful individual landmark just wants to change on the signage to led signage, and we had concerns about the electric how the electricity was going to get to the signage.\nI appreciate what the applicant did in terms of the conduit and and presenting us with a detailed plan of how this is going to work just with respect to the signage or the content.\nBut if we are going to design a resolution with regard to the sign, could it perhaps be limited to to aspects of the sign like the lumens and and kind of the physical constraints, or I do not know how you would say it, but rather than aspects that would impact the content.\nI just want to confirm that the the sort of base area that the conduit is going to run along is the same color throughout, because I think from the picture on page 15.\nAnd just on the pain, issue, I just think it's I think you know it's potentially going to look a little different, which is my my concern with that.\nImages can be wholly distracting from the surrounding building, which would be a shame because everything in New York ends up being a busy street and people do walk by and it is a So in the city, and so that's why I'm, just more conscious of the sign , You know on Park Avenue, so I think that's what our concern is.\nThey spent a lot of time on this and I want to support this application, as presented.\nWe get behind this and support this beautiful, landmark building really on a non- residential street, with a landmark in police.\nThe 19th police precinct headquarters is right, acrosss, the street, it's an individual landmark and that wonderful old firehouse, which is also an individual, landmark All on this block facing each other, and I think David can join us now Then we should just go to a vote.\nThe churches and the synagogues need to be able to explain their programs and their mission to their members and to the public who may be interested Where does anybody want to formulate a resolution we're here to vote on the context and appropriateness for this individual landmark?\nThis is 61 E 77th street and it is a neo- federal style building with bozart features designed by hardy and hasselman and built in 1916 applications.\nWould you like me how about if I share my screen, please, okay, the proposal is to add a handicap accessible ramp for first floor access to 61, East, 77th, street.\nRamp, there's an existing, a historic iron, fence, left and right of the entry.\nInches high for your hand to clear on the ramp railing as it passed by this right- hand, picture shows an existing gate, which is similar to the West side.\nWe have another picture here in the center, looking toward where the ramp would come up and a picture here showing the east exposure of the eastern Window area way through which the ramp would pass behind the existing columns.\nIn both inside of the entry here, you can see the set of doors, that is, the access to the residential lobby for the building, the picture on the right.\nWe overlooked that here's, a architectural line elevation of the existing building limestone, but all painted this is the proposed ramp, starting here.\nOnly elevator, the all the handrails would be stainless steel, but with a black painted finish to match the existing fencing, historic, fencing, which, of course, would be replaced and reconditioned, and so that that is as the presentation currently there is a a certificate of no effect from landmarks relative to the removal and replacement of the peers to allow access to the seller for the install of Mri, equipment.\nYou have to turn your mic on glad to be able to say that there was a person from the public named Aravatu, and you want to say something, I'm, actually, the next door, neighbor at 59, East, 77Th, street.\nYou know quite a significant amount of work over a protracted period of time, which, as the neighbor certainly has to be quite a distraction and inconvenience Thank you any other members of the public right.\nThe only thing is, I think, is you are knowing compliance, but in any event, we are no right here to analyze.\nSo I do not really know what you intend the rest of it makes sense, but I have to say that handrail for the ramp is hideous and you could do It's a beautiful building with a lot of detail, those, I, guess, Bay Windows and the and the metal work.\nThat's, not an issue, that's correct, with the design of the doors you're saying you're, making them wider, but are they going to look the same right?\nNo there's an additional neighbor comment that I think we can go ahead and allow I would only like to, and I do not believe in getting into design issues, and I.\nThink if the architect would take a look at a Stanley, Catalog he'd find a lot of steel and bronze that reads charcoal and black, so you do not have to do a painted finish, So, going back to the neighbor again.\nI think that the approval process, you know I'll say that the Community board has been very helpful and the LPC has been very helpful, but the department of the DOT that permitting for the sidewalk opening can take some time as far as putting the rest of the building back together.\nI would say that certainly the building owner wants it done, and you know the the people at redneck and radiology one and done it's going on a long time.\nIt's on the north, it's on the north side of 62nd street, about 190 or so feet from fifth Avenue just to the left of the building at one east, 62nd.\nWe are now seizing the opportunity to change this entry awning that is completely out of character with the building and propose a new marquee that relates far better to Percival Goodman's design, intent.\nThese images are close- ups of the bronze louvers and we're presenting this to show you how, in our in our drawing here, how we replicate that detail to stay consistent with personal goodness design and then here the an important improvement we're making where the the giving this is not the historical portion of the thought , you're not going to get painted or recess into this rod, and you can see here in our detail how we're proposing that door be shifted to the front plate of the building.\nDo, we now, and so now we go to the committee I'm sure this is a question that the community members are going to ask, but I just wanted to know how the marquee is being fixed to the facade.\nI know why the the co, I understand why the congregation would want to have a canopy, but the building never did have a canopy, or at least did not originally have a canopy, and there is something marvelous about the sort of plane of the facade and the then setback of the of the entrance plane and then, following up on that.\nWe are going to reincorporate that door at the interior of the residential entry on East 63Rd Street, so that door will be retained and will be seen.\nRe- incorporated a bunch of the charm elements in terms of the transom above the windows, they're, breaking up the glass panels of the windows introduced more masonry back into the facade and reincorporated the historic looking wrought iron door onto East 73Rd street on the entry.\nI'm sorry first floor existing on second floor, correct, And. The final element was there: We had a wrought iron interior portion of the door at the entry of the resident residential entry previously on Lexington had a wrought iron door, a historic, looking door, even though it was not a landmark element.\nSimilarly, for the second order, okay, I think those are nice details on the building, agreed.\nYou know, I was not here the last time, so I do not have all the context, but it seems to me that changing the door from being on Lexington to being on the street is a big change and in terms of just considering appropriateness, you know looking at the other buildings on that block on Lexington.\nChanging that, for this building seems like a big shift from that and the precedent that we have at the end of the presentation about you know taking the door off the avenue and putting on the side street.\nAnd I gather that it's something that the rest of the committee has considered and is sort of satisfied, with, But Actually, I can speak to that point a little bit just to let you know the historic door.\nI. Think that the if you can't look at the rest of the block, because this building is on the corner and in fact the functional reasons for moving the residential entrance around the corner are in fact pretty compelling.\nA little quieter I actually do think that that's an appropriate solution to the sort of typical problem of four- story- buildings, with retail, on the first and second floor."
        }
    }
}