{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB12",
            "channelId": "https://www.youtube.com/channel/UCyK6S3k-FTa3ATLF9GX4SJg",
            "title": "Business Development November Committee Meeting",
            "publishDate": "2020-11-11",
            "shortDescription": "",
            "lengthSeconds": "1:33:27"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB12",
            "normalizedName": "Manhattan Community Board 12",
            "twitterName": "Manhattan CB12",
            "youtubeChannelName": "CB12M NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVRLEz9wPxgc9PxMj31Zk4Q",
            "twitterHandle": "@MANCB12",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "f2nqFw0_4I0",
            "fillerWordCount": {
                "uh": 247,
                "um": 287
            },
            "readTimeFullTranscript": "55 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "businesses": 44,
                "business": 35,
                "information": 21,
                "partners": 18,
                "rent": 18,
                "force": 18,
                "task": 17,
                "terms": 15,
                "bill": 13,
                "spaces": 12
            },
            "wordCountSummary": {
                "businesses": 16,
                "business": 13,
                "terms": 7,
                "program": 6,
                "storefronts": 4,
                "month": 3,
                "challenges": 3,
                "concerns": 3,
                "individuals": 3,
                "guidance": 3
            },
            "fullTranscript": "Hey Ashley, I'm so sorry, I thought we were on zoom tonight, so I would no. They change, because you know, there's parks, meeting right now got it okay, so they put them on the zoom and we got the glorious webex. One of our speakers is trying to connect to the audio. Let's see Chanel, are you still on the on the line or is it ebenezer? Now? No me yeah, one of our people. He was having a problem connected to the audio David I said about you happen to know. Is that on his end or is it on our end? I believe that's on his head his end? Okay, because he does not know how to turn it on I said it was at the bottom of the screen. Yeah, it should be I do not know if you can't seem to find it, I'm going to call him real quick. So I'm going to mute myself for a minute, so I can kind of help him just hold on one. Second, everybody: okay, hi everybody. So we were just waiting. There was one of our speakers having a technical difficulty he's going to try to like he can't connect to the audio. For some reason it lets him connect to the video. So he does not see the buttons at the top, so Chanel I do not know what that means like we can see. File edit share I do not know why either yeah but he's going to try to come back in and we'll see if we can, if he's having that same problem, okay, hopefully he gets resolved yeah cause. I do not know why he would not be able to that's why I do not like using webex, because it's not as user friendly and as soon you know it's harder for people who are not really familiar with it to use it, but anyway we're going to get started and he said he'll keep trying and hopefully we can get him in, but I do not know if you can start recording because we're going to get started. Okay and ashley you taking minutes right awesome. Thank you so much Ashley, okay, so welcome everybody to the Business Development Committee meeting we're going to open up the meeting at 7:11 P.M, and we have a few exciting things to talk about. But first, as you know, is I'm not domingo. He was unable to be here due to an emergency, and so I'm just stepping in to help out with him for him with step in to share the meeting in his absence tonight. So first things we want to do. I do not have any particular opening remarks other than it's. You know check in with people. It's been a wild week, as everybody is pretty much aware. You know. Hopefully the change at the top. The very federal top will result in and more assistance for our local level for our businesses in New York in general, and hopefully that will make a difference. I do not know if anybody else has any other thoughts about that, but you know in my mind it can only go up from here, so anybody else have any thoughts on that before we approve the agenda. Look at the agenda and improve it. I could not agree more on putting humanity people, businesses, like smaller businesses, not large corporations over profits, so we'll see how the rest of the legal stuff plays out as trump contests. This win, but I am pretty. I'm just satisfied that he's gone yeah. Maybe we'll get some of that money that was subsistence to trickle down finally to the local, our local business community, as it should have instead of major corporations, I see David yeah. You have just have to unmute yourself, just unmute yourself at the bottom unmute, oh I, see down there, yeah you're with us Yay good job, awesome, so glad it worked out, so we are recording, and so what we're going to do now is if anybody, if no one else, has any comments or anything we're going to move into the approval of the agenda. So I'm going to share my screen, so everybody can see that so board members. You can tell me if it's cool okay, so our agenda today we do not have any small business testimonies today because of the you know. You know last minute switch so, but we'll be, you know, reaching out to some folks and I know. We talked about in our last meeting we're going to start reaching out to some retailers. You know from the retail side of our business community. To sort of you know, hear a little bit more from them in terms of what they've been experiencing and the challenges they're facing. So you know we can look out for that next month, but the committee business today we're going to hear from we have a prep a couple presentations from a New York, City Department of Health for about Covid-19 and small business. So we're really excited to have them to hear today, I'm just going to add their names. That was not really on the agenda. We have John Patmore and Pauline Ferranti Paronte right! Is that how you pronounce it yeah, okay and so we're going to hear from them first and then we're going to hear from Steven Eisenbach, who has been very active and we've been working with him for a while now actually on advocating for the small Business Job Survival Act of Sbjsa, which would you know if it were to pass, would provide some much needed protections for our small business owners and here. So we look forward to hearing his presentation. We I wanted to just open up the space for this new open storefronts program. Just to sort of you know, you know check in to everybody to wear this program. What this program is, what it's doing, hopefully next month, we'll be able to have someone from D.O.T to come and talk with us about that program and anything that our business needs to know and for us to better educate them and any potential you know challenges they may experience as a result of that. So we'll talk a little bit more about that and then we'll hear if there are any updates from our community partner, we have coffee or hi L'oreal, and it is so I'm going to add the names of the people from DOH. That's the only real change and we do not have any small business testimonies, so that'll be removed. I want, can I get a motion to approve the agenda. Okay, great! Thank you, Ashlyn, Juan, okay, so great so yeah. So I wanted to again thank you to the DOH for being here today and I wanted to just open up the space. I do not know who would go first, John or pauline, you all choose, and I'm going to prefer to have more for him to give for the update, because I believe he is doing a lot on the ground level with his with his action center. So have more feel free to share all that information that you're doing sure yeah good evening. Everyone. Thank you so much for allowing us to space to get on and there's a few corrections to the agenda that is officially going to be recorded. Yes, oh hello, can you hear me, can you hear me yeah I can hear you now your sound just went out. What were you saying before you said your direction? John yeah, the first name is Padma. Last name is John, but we can move on I also just want to. Let I'm sorry I'm having a hard time hearing you you're cutting out for me. Was he cutting out for other people yeah? So can you go back to your very beginning of your statement because I did not hear anything. You said I'm so sorry, okay, I'm sorry about that. I just wanted to give a quick correction to the name. My first name is Padma. The last name is John. Oh I'm! So sorry, okay, sorry about that I'll correct that okay, Dr Noah Maniendo is on he's the assistant commissioner for the East Harlem action. We are we're located in east Harlem. We are addressing and supporting across the whole of the upper Manhattan, so East central West, Harlem and Washington high slash in hood in inward, in terms of where we are providing support and resources. So before I go much further I'll. Let Dr Maninda go to give a broader overview of what some what's happening in terms of the Covid-19 update and then I'll just come in if a little bit more underground stuff that we're doing as well. Dr Maniendo. Can you spell the last name, I'm sorry, just for the record norm, you said Dr Norm, no hi everyone. This is Dr. Let me thank you all for having us join your meeting today. So my first name is spelled n-o-E-L as in Christmas, Noel, okay and then, and then my last name is spelled my nindo, so that when volatility is pronounced, Magendo and it's spelled Emma's and Mary A, as in Apple Anderson, Nancy Y, as in yes I, as in India N, as in Nancy D as in David O. So that's my ninja great. Thank you. Thank you so much for doing that. Well, we can have it accurate appreciate it. The most welcome most welcome again. Thank you so much for having us on. As as Padma mentioned, my colleague works with me in the upper Manhattan bureau, the Harlem bureau. You know the the action center is a part of that bureau, but we have another building and another location in central Harlem and then we've also been under the Covid-19 emergency response. We've been spearheading response work at the neighborhood level within in Washington Heights, as well for the for the emergency response group, of course, in collaboration with others within DOHMH, and so but we've been the lead team on that, and so just very quickly. You know just giving you a broad update on everything. That's been going on with with coved as you as you are all I'm sure very aware. The numbers and the rates the test, what we call the test positivity has been going up in several areas of the city and it seems to be increasing almost every day we're adding a new geographical area to the to the map of affected areas. Now not every area is an all-out hot spot, but when we say increasing, we just mean the percent of people that are getting tested that are coming back as positive. We were trying to keep that number below two percent and we're seeing a num a number of places up going above 2.2, and you know the signals come and go. Sometimes you know the place, might bubble up above 2.2 2 and maybe get to 2.2 2.3 and then come back down after that, but we're seeing a number of spaces. So initially in one zero. Three in in Washington Heights, there was a there was an a nonstick and a nonstick non-statistically significant increase, but it was enough to trigger the team a response from the team in which we reached out to 163 community partners. We reached out to pharmacies clinical providers, including the small clinical providers, the and the small community pharmacists, our pharmacies. We provided them with information, downloadable information that is in multiple languages, just regarding the key guidance, the key, what we call the core four things: the four the factors that are. You know that can prevent this: the transmission of Kovitz, of course, wearing a mask. You know thorough hand, washing keeping a physical distance and avoiding grooves and also staying home if you're sick. We also talk to them about tests and trace, so for all the folks that are testing positive. To expect these calls and to you know to we know folks feel a certain way about calls from the gut from government, but you know we wanted folks to know that these are calls that are important, because, if we're able to isolate the people, who are testing positive and trace their contacts, we're able to you know try to contain as much of this as possible, but you know so we did all of that. We also spoke to some of the partners and did joint webinars with them. We did presentations to their constituents. We also sent them for those that requested hard materials, so they wanted flyers palm cards. They wanted floor decals. We did all of that. We made sure that stuff was ordered and sent to them. We also came out on occasion and did mask distributions in the area. We did that in partnership with other community partners who are known in the in the neighborhood in the community, and so all of this helped. You know, together with all the efforts of everybody else, zero three sort of came back down again and then we saw neighboring, zip codes start to flare up a little bit, so one zero right now. The one that's on the map is one zero, three four and then, if you come a little south from there one zero three one and one zero, three nine are sort of the ones that are that are showing up on the map right now as having above two percent test positivity. So just so you know, if we hit, if we hit three percent, then the city and the state, the city, the city of New York, has said that as a as the threshold where decisions will be reviewed in terms of closing schools, closing businesses in certain areas where that is happening- and you know the you know- we have not hit that threshold as yet. You know there were other parts of the city that you may have heard of in the news a few weeks in the last few weeks. You know in specific areas of Brooklyn and Queens and in certain communities over there, where the percentage was hitting six percent eight percent in some instances, even above ten percent, and so you know that does not. That does not that's not to minimize the percentages that we were seeing here, but it's just to say that those were full-on hotspots they mo and there we mobilized. You know hundreds of city workers to go down on the ground and try to really get in the community, distribute flyers and sort of stay there every day and just sort of be there and providing information ready to answer questions so we have not had to. We have not escalated it to that level just because we're still responding to some of those other areas- and you know just we just we're trying to keep as many people mobilized for those areas and also the percentage has not. You know gone as high as that, but we just want you guys to know. We want you to know to be aware that the what we're calling we're called the Harlem neighborhood response team, but really we're part of the ohmh. The emergency response work, that's going on together with many other colleagues, we are sending information, we're providing information to partners we're making phone calls. We are also hearing we're also trying to get Intel. You know our folks. Seeing are they concerned about anything? You know. We heard from restaurant owners, for example, that it was a little challenging sometimes to be able to have patrons. You know, wear their masks all the time or you know the folks keeping a distance when they come into to eat and when the music is playing more people come out, and you know folks wanted to enjoy the weather and be together and there was that fatigue. We keep hearing about the Coronavirus fatigue where folks are just tired of keeping the doctor. That was. That was great. It really gave us some insight and we are concerned about the three you know getting to that three percent. You know that's a big concern. We do not want to have to get to the point where we're shutting down our businesses again. That could be really detrimental. So I'm just going to open up this. Let people ask you any questions they may have before we move into pad more, but one of the things I and I'll start and then I can open up to any questions. Anybody else on the committee or anyone else may have, but I wanted to find out. You know I, know you're, saying you're giving out. You know there are certain materials that you're distributing and you know and those sort of things. What is? Are you looking at different languages to talk to like business in terms of just like how to communicate to businesses, because the concerns that businesses may have my is very different from maybe you know the concerns or the challenges that individuals are having around distancing and things like that, because what's happening is obviously as you as you mentioned, you know. Businesses ultimately will pay a price right if people, if their patrons, are not. You know adhering to the social distancing rules and the mask wearing. So how do you? How is the oh, you know, doing special communication to the business community? Well, how are you doing that and if not do you know, do you think there's a need to sort of figure out a way to sort of you know center? You know how to communicate with them in a way that sort of addresses their particular unique challenges around this issue. That's a really great question and I'm sure patrol wanted to say something on that as well, but my first take on that is right from the very beginning of the of this pandemic. Unfortunately, I mean you guys all remember when we had the New York Pause and you know the hope. The whole place was shut down, except for essential services, including businesses and hospitals and other things like that. You know right, then we already we identified and understood that essential workers and essential businesses, you know, were going to be really critical in. However, we think of a response- and you know, at the neighborhood level we were very proactive in trying to engage with at that point. You know it was very a small number of supermarkets. It was Bodegas corner stores, it was. It was a handful of types of businesses that were even able to be open at the time, but we were reaching out to them even about their staff and how they're doing- and you know are they- you know just trying to make sure we get the latest information out to them. At that time there was a little bit of we did not. We did not know what we knew, what we knew more recently about masks, and things like that, so you know once that changed and we try to make sure we get that word out to people and so on and so forth, but I think so. The point you make is a really good one and I only say what I just said to say that the need we recognize that the need even is evolving with the different phases of this of this pandemic, and so you're right I think there has to be. They have their needs to continue to be a thoughtful and even tailored response to the needs of business people and businesses and I. Think our colleagues are, for example, at small Business services, New York, City SBS. You know they were, you know we reached out to them, and there was a great. There was a number of things they were working on and have continued to work on, and you know we just felt like there was no need to duplicate some of those things, but we do continue to have engagements with particularly the small retailers and the restaurants in particular, because that's where you know people end up getting coming together in smaller spaces and the risk of transmission tends to be a little bit a little bit higher, and so we've continued to do that, and actually we include businesses in a lot of our outreach and engagement and the language and materials that we're sharing are actually not. These are these are the ones that are used to share with partners so and so organizations less so and less so individuals. This is more the materials that you know you would see like I, I'm. You know every time when I go into some of the bodegas and I see the floor. Decals that they're using I see some of the posters in different languages up on their wall or outside on their on the on the on their on their on their window on their in their on their storefront on the sidewalk and that type of thing. You know it's gratifying to see some of those things and really hoping that you know people that are patronizing. Those spaces are seeing it and we know that that's not always the case, but you know. Hopefully some people are able to see that stuff, but I think so, just so, just to point out that I think the materials were crafted for organizational use and so I do not know. I can't really say to be honest with you that it was created for businesses. I, think it's the same language that maybe a community based organization might use, there's some language for faith-based organizations, there's language for different types of organizations, but I. You know if there, if there are insights that you have or anybody has where you feel and we can share those materials with you and you can you guys, can look at them. I think we have folks have been requesting them and using them. But if you, if they're things that you feel insights, that you would like to share with us about how to maybe tailor them more tightly to the needs of businesses, we're always listening, we're always understanding we, the Harlem team, the upper Manhattan team, will take your insights and share them with our colleagues in communications and so on, and try to try to see. If we can, you know if we can implement anything that you know that you know you guys are sending us sending our way. That makes sense would be happy to do that. We've tried to do that in the past, so yeah and I think I. Think a tailored message is specifically targeted to businesses would be very important and key I. Think yeah. We've done some of that. We we've definitely kind of specifically targeted towards restaurants, for example, speak specifically speaking about social distancing. How to even socialize responsibly or even if you go out together, how to be able to make sure that you are keeping your distance that type of stuff so we've there are some of there's some documentation, that's very specifically targeted towards businesses, small businesses, restaurants and the like, including some of the decals, but I think this is part of the reason why we wanted to be here today. One is to kind of give you the information, the update that Dr Manonda provided, but also to kind of create an opening between us and you that, when you do have ideas like what you have indicated that you want to be able to ensure that businesses, organizations that are in your in your catchment area, how they can best be provided information, support resources. How is the best way for us to be able to get it to them? I mean one of the things that we have been doing in some of the other spaces that we have been working with is to get with a business or trade organization, and we kind of make that connection with them. We provide them. Some of the information and then they pass it on to the other businesses they're business businesses that are part of that organization. We've also had this conversation with them, trying to talk target the messaging that we are getting out to them, so they have been helpful, but knowing that I know that a lot of different businesses in front of this committee and you're able to speak to some of their small businesses directly themselves- and you ha you're hearing some things on the ground that we may not necessarily be hearing being able to pass on that information to us and just have that relationship with you all that we are able to get that information from you will be very appreciative, and so definitely that's one of the reasons why I wanted to be here and to continue to be here going forward. Yes, any other! Thank you, pam, any other questions for the doctor or before we move on to what that's a pat moore's presentation. Anybody you can just you know, unmute yourselves and ask a question: if you have any questions, I have a question yeah right, so how much I was reading about some of the about the situation up here and they and apparently there was and I read another article that said most of the spread of the virus is being linked to gyms and supermarkets and big box stores, and things like that. Is that true, or is that for certain areas and not our area or you know, I was just wondering. Is there? Is there any sort of a pattern to the spread sure what we're seeing I think what we know is, regardless of the specific location or the specific setting, I, think what we're seeing now is it's a lot of the spread. That's happening is people gathering indoors, and so some of it may be. In fact, you know in businesses like what you mentioned gyms and other places, but some of it is also what they call super spreader events or just events where the virus is able to go from one person to another and to another to another in relatively short order, because people stay in crowded areas together. So if you look, if you look at New York one or any other news channels, you know you'll see that the police are busting up. You know an illegal gathering and 400 people in the warehouse in Brooklyn, somewhere dancing away dancing the night away whatever and those types of things. Something like that. You know, then those people just disperse and go to other or go home, and you know visit their relatives or you know then hang out with other people. You know go from one party to another and it's you know it just spreads like fire in some of those settings. I think what we're seeing is, as the temperatures start to cool and people start to move indoors. You know there is. There is a small degree of protection in being outdoors and being in an aerated environment. So if you're able to keep space and you're outdoors and you're wearing fast, the risk of spreading is lower than if you're indoors, and you know what still you're indoors and you're in close proximity to other people for lengthy periods of time. So it may be, and you know the gyms have specific regulations in order to be able to open. They have to have a certain ventilation, air ventilation capability in the gym. They have to be I think that they can be no more than 33 capacity. If I'm not mistaken, I think it's 25 or 33 capacity at any given time. Folks must wear masks, and you know sometimes folks are doing. Exercise do not want to wear the mask, but you know for them to be in the gym: they've got to wear the mask and they've got to be spaced, so it can't be like how it used to be when every single treadmill and every single you know piece of equipment right next to each other in tight spaces and everyone is and each one of them is being used and there's folks in the waiting area waiting to get in and all that kind of stuff. It has to be spaced a certain way, and so we're really encouraging- and we know it's not always easy, but encouraging the business community that you know, guidance has been provided in terms of the reopening and some of I knew we've done, presentations to businesses in, in particular in East and West Harlem around the reopening guidance and things like that. This was a couple of months ago, and that was that was really the hot topic at that time. But if folks are able to stay in keeping with those guidance and enforce that you know just from the business standpoint, I think you know that there may be. That might really be a useful key in helping to curb this, the transmission so I to answer your question. I think it's in the it's the indoor spaces now that are kind of concerning people get indoors. You know the mask, may drop down you know, and then they get close enough and if you stay in the in the vicinity of others long enough, if somebody there is, has this virus and it's spreading it. If somebody there is infectious in that space, you know, there's a great deal of risk for the other people in that space, and so it's really those indoor gatherings, and sometimes those are harder to even see, because you know it's behind closed doors. Most of the time you know, I think that's where the issue that we're seeing is it's really those indoor gatherings that we're seeing now so belief in those in the stores, albeit in you know, just as I've mentioned people coming together to have a you know, a party people coming together to celebrate whatever the case may be, you know, I think some of that is, that's I, think a bigger, a significant drive driver yeah quickly and then we're going to move on to pat moore okay. So how about outdoor gatherings where people are closed and not wearing masks is that is that? Can that spread it too? It potentially could but I think so. I'm thinking from the business standpoint, I'm thinking outdoor restaurant spaces, and you know if you know a family, you know decide to go out and have a meal together and you know they are wearing their mask. But when they get to the table and the food is served, you know they have to pull down the mask to eat right. So in those in that situation you know you know hopefully, and if the restaurant is doing the spacing and I think indoor there's also a cap I think it's a 25 cap in the indoor capacity, some restaurants, some restaurants are taking advantage of the open streets initiative, so they're able to bring some of that outdoors. So it's almost like in an enclosure, but it's outdoors you know. Even then they have to follow the guidance, the guidelines and then the restaurant employees must wear masks and continue to you know, even though they're serving the food, but it's just when folks get to eating. You know they have to take the mask down, so they can eat. But hopefully you know they're six feet away from the next table at least six feet away from the next table, and hopefully there's not a big group of them and hopefully that space is only a 25% capacity. I was just going to point out that in this neighborhood there is a unique situation in which a lot of people gather together very close outside no mass a lot of times. Yeah. That's not that's! Not that's not! That does not sound good at all. That sounds that sounds disturbing. It's true. It's true and I think pauline was very good in terms of telling us what we can do if we witness things like that, and she put that in the chat in response to Bernard's question about that that you know people can email her. She put her email in the chat and they can forward. They can also she will forward it to the mayor's office of special enforcement. So you know if we're. If people are witnessing these things, they should let people know, and there are there are resources out there that can address this, so I just wanted us to. You know that there are options for that. If people are witnessing that, you know it's just so you know you know any questions, other questions we can circle back to the doctor after we hear from Pat, Moore and pauline and see if we have any questions, we can ask after they've given their presentation, so I'm going to give it to give the baton to you, pat moore, and let you take it all right. Thank you very much, and I'm not going to take too long, because a lot of the stuff that Dr Manju spoke about was basically get across well, one of the key things I wanted to just speak about is just what are some of the things that we are looking to do with partners on the ground. At the moment we have identified partners in, as Dr many had said and indicated there was an email that had gone out. Just that's, alerting some of some of the partners across upper Manhattan to the fact that there are certain uptakes in certain zip codes. One of the things that we're looking to do at the moment is try and be able to have resources and materials that is available to distribute to partners, so they want they can pass it on to their own participants or residents or two. They can pass it on to other organizations that they work with. So one of the things just we wanted to just put out there is, you know how we might be able to get some of this information to the community board, whether it's this particular committee, if the committee might have connections to various businesses and how we might be able to get them out there to those to those locations as well we're in the process, hopefully by this Friday, we're getting some new material in some new flyers and posters that will be available speaking about social distancing wearing the mask decals. So these are some of the things that you're speaking about earlier being to get some of these items and they're in a variety of languages from English Spanish. Some of them are even in Mandarin, French friend any of the local businesses that may be speaking that deal in those particular languages. So it's really about how we might just be able to get connected and have an opportunity to continue to get information to you get resources to you. That may be helpful as you as you walk through your community and as you're, seeing so some of these things that you're talking about the other thing, of course, is for us to be able to get information about what's happening on the ground. Oftentimes I I'll go to various locations throughout upper Manhattan, just to kind of see, what's happening, ensure that things have been okay. I have been to the 168Th Street Express corbin testing site on right there, which is in the drh image building. Do you want to see whether or not there's a lot of individuals that you may know that are utilizing that space? If there are other spaces that may be better for a temporary pop-up type of testing site? There are certain places that we there's certain individuals that we have been working with in east Harlem and central Harlem that have been very helpful in terms of doing flu vaccinations as well as cova testing and so potentially that we might be able to bring some of those tests in there as well. So we just want to just want to warn just as I said before, be able to open up a means and method of communication between us and the committee Us and the abundant, but specifically that we are able to help as much as possible in terms of making sure that resources are going to the places that they are needed. So I'll put my email in the chat as well tanya. You can have it and then anyone that may wish to be able to reach out to me they can do so. Thank you, pat Moore. Thank you. So much we'll move on to pauline and we'll circle back for questions so pauline the floor is yours great. Thank you. So I just wanted to offer our support in terms of gathering together the agencies that deal with business reopening, because I know that we are often here at the DOHMH, often asked a lot of questions about business and restaurant reopening specifically and unfortunately, you know it's a lot of different agencies that are involved in different aspects of reopening, and so we might not always have all the answers which is very frustrating for people. We definitely understand that, and so my goal for tonight was to hear specifically from the business community as to what questions they had and then be able to be a resource to pull together. You know whether it's department of consumer and worker protection or small business services and the mayor's office of special enforcement. So we can all really talk together about what each of our roles are as it pertains to outdoor dining and indoor dining and then now, as the mayor extended outdoor dining, you know to be a permanent thing, as the weather gets colder and structures are coming up. You know we're hearing lots of questions about whether these structures are legal and how many people are allowed in there, and all of these questions are absolutely things that should be addressed and I think you know having the right agency representatives at these conversations is the most helpful. So what I would love to hear from your group tonight is sort of what your questions are and then to be able to be that conduit to pull together those other agency liaisons, so that we can all be useful to you at another meeting, yeah I think that would be. That would be awesome if we can have everybody here together. So we can, you know, revisit this conversation because you're correct there are things that DOT you know enforces and things that they do and they're things that you do in the office of special enforcement. You know we have so many people involved and you're correct. You know we need to talk to all of them. So definitely you know let the chair know about. You know that. That's something that you know you suggest and hopefully we'll be able to pull that together, and we definitely would love to have your support and getting those people before us helping us get the right people before us. So we can have a great substantive conversation, any questions for Pat, moore or pauline about any of what they presented tonight from any board members. First, questions from board members: any questions from the public for Pat, moore and pauline going once going twice: okay, I have a question, I'm sure I'm sorry Tanya! Oh okay, no, ask your question first and then I have one last thing to leave with everyone before I. You know before we all end the evening, because it's very important so just ask your question though. Oh no, my question was to pat more you mentioned. You mentioned local partners. Are there? Are you working with any local partners in Washington, Heights inward? If so, who are those partners? I'm just sort of curious in terms of you know the partner that we were able to work with previously was at, but one of the houses right there, Eagle, Avenue and 185Th I. Believe one of the NYCHA houses, and so we were able to partner with the the President, the Resident Renaissance Association President. There were able to do some giveaways with mass and some sanitizer some flyers, some information and to that extent, but we definitely want to be able to work with other partners and as Dr Manuel Maniendo had mentioned, there are a few and we expect some few of the partners, part of a grant that has been funded by the Department of Health in terms of getting information and messaging to very specific communities. We understand that it's not at all communities are not the same. That goes to one. They have to be targeted very specifically to the individuals within that community, so we were able to have grants of a variety of organizations in certain parts of the city, including upper Manhattan, including in the Washington Heights in Malaya, and so there are a few organizations that we have partnered just do not not calling the names at the moment, but it's also to let you know that we are looking to work with other partners as well, any of them that you would. You suggest, you know, have a pretty strong footing on the ground that they might be able to utilize. Some of the resources we need to bring it'd be very helpful. We can make those connections as well. Yeah I was going to I, mean I, I'm not volunteering. Anyone but I know one. We have cloth here tonight, so I do not know. If you know, maybe you all can have a conversation, that's they might be interested in doing you know so I do not know L'oreal. Do you think that you know something you would take back? You know I actually was hoping to reach out to pauline and also to padma just to get some ideas, particularly in Inwood. I'm seeing a lot more frequent, larger gatherings inside so it does not seem like there's. You know as much monitoring, but I would like to reach out to you, so we can also discuss you know. What's going on in Washington Heights one zero 360 in particular. Would you want to put? Would you put your email in the chat so they can have it yeah and then they can. You all can connect and see. I was another agency. I would like to suggest I do not know if you have not already made contact with them, but it's a northern Manhattan coalition for immigrant rights yeah and they do a lot of work with the community and also you know, can engage with the spanish speaking part of our community very well, and so it's just a suggestion of them as well. Thank you. Perhaps okay I think we had also sent. So in addition to what Padma had mentioned, we actually did call and speak with and send materials to. I think it's over a hundred organizations in the the Washington Heights in Washington Heights in wood, zip codes all together, I think it was over 165 different organizations. Some of them were faith-based organizations. Some of them were like the. Why you know some of them were. There was a variety of different community-based organizations and, and then some of them were businesses as well, but yeah another. You know in addition to what Padma mentioned I think we are. Definitely you know we did like a you know, a qualitative survey and we you know we were also trying to learn more about what folks were seeing and what they thought. Would you know what were the issues and how you know they thought we should go up, how solutions could be found, and you know we did a fairly. You know we really tried to listen and learn, and- and in that process we also, you know, heard from partners who wanted to receive materials, and so we did that I do not honestly do not remember the mufflers up my head, but I know all together. We've engaged with I think it's 163 organizations in Washington, Heights and inward awesome, yeah and I was going to say is any way possible. You could send me and I'll make sure that domingo gets this a pdf of what some of your materials, like just you know, so we could just see, or you know, because I know it's hard to kind of mail things out at this point and we won't be able to really get it. But if you could, is there a way to sort of send us a pdf of some of it? So we can get an idea of what's going on and we can offer any suggestions. Is that possible? Yes, I. Can yes, I can do that now tanya. So if you just check your email, when you can, you will be in there for the ones that we are looking to print out and yeah. If you suggest anything else, I'll we'll be happy to get those credit as well. Thank you and pauline. You wanted to say something else. So my last point is that we just came out with travel guidance for the holidays and gathering guidance, and so we strongly discourage against traveling as the holiday season approaches and also we are discouraging any gatherings, large or small, with people outside of your immediate family. So I'm going to put in the chat the link to our guidance, but you know we know that it's a really tough time and holidays people look forward to the holidays all year long and this year has just been. You know a it's just been a terrible year so, but we really just want to continue to put this messaging out there, that we all just need to do our part to keep ourselves and our neighbors safe, and you know to Mr Grub Grumman's point of people gathering I think we are looking at ways in which we can get this messaging out to folks who are really not paying attention. You know we have media campaigns, we have, you know ads and bus shelters like we're, trying our best to really reach folks where they are. But again it's really up to individuals to start taking this. Like more seriously and to understand that it's each of our individual, you know, like our choices, will benefit our community, and so we really need to not just think about ourselves but really think about our neighbors, especially our most vulnerable neighbors, and so that's. Our goal is to try to get that messaging out as best as we can and then should. Enforcement need to take place where we're hoping that you know that can occur as well, but again it's really about changing hearts right and about getting people to really understand why this guidance is so important. So that's all I wanted to leave with and have a good night. Okay. Thank you. Thank you so much and we look forward to having this expanded conversation with all of the agencies, any other questions before they go and we move on to yeah I just wanted to throw in something real, quick. This is Dr Million I just wanted to quickly also so when you ask for the materials and I'll see if pad more, if you're affording anything to them. If you could also forward, you know, I think, there's a and I mean you may have to wait until tomorrow, but the message that we included in some of the outreach we did that we sent by email so I'll circle with Pat Moore to make sure that we send you so that you can see that. That's like a it's like a curated list of different downloadable materials in different languages, about different aspects of the of what's available in terms of services, support services, around testing, there's information around the Express, the Covid-19 rapid testing lab the Ohm-Labs on 168Th and Broadway right there that busy intersection and there's lots of different information, including how to schedule an appointment and all that kind of stuff. So really practical, tangible information, so we'll make sure that we get you a copy of that. Maybe sometime tomorrow, that's great! Oh and I lied. I, realized, I had one more question and I promise I'll make it quick. This question I meant to ask you know the city started a new program about open storefronts, which is for retailers to be able to utilize space outside of their stores and I, wanted to ask if you know you know whether that you know could bring additional challenges or is it or is it something that you won't feel like? You may need to also do some outreach around that because we, you know, we do not know how that's going to shape up. You know it's only through December, 31st I believe that program is going to be in effect, but you know it could get really busy around Christmas and you know so around the holidays, especially like the Fri black Friday, that you know you could get really busy, and things like that. So I just want to know your thoughts if you're willing to offer them- and you know yeah if you're willing to say anything about that I won't say much. I I'll defer to Pauline I know she does a lot more of the Inter interagency. You know engagements, and so she may have some additional insights on that, but I mean I do think, as you know, as pauline had mentioned in Las, Vegas I think we've all earlier in the call. You know any of these things. You know if they are, if they're instituted and and effectuate, and they brought their practice the right way. Hopefully there's a way to limit the risk involved, but I think you know. As with anything, if you folks, the folks show up and crowd and do not keep the distances and not wearing the masks, I think even a well a well-intentioned initiative, a well-intentioned approach could have challenges. So hopefully that's not the case and I hear what you're saying about you know doing some messaging around that. So that's! So that's a that's an important, that's a good thought and I. Think maybe you know we can have other conversations around that or maybe with other colleagues from other agencies, but I do not know if pauline or Padma has anything else to say. I, do not I do not have any specific knowledge on that particular thing other than what I've just said. Thank you. Well would you have to add anything to that not at this moment, but can you please send me an email, so I can just make sure that I can follow up with the appropriate folks. Absolutely we'll do. Thank you. Thank you and any. Thank you so much for your time today. I appreciate your you know, so we got started a little late, so I do appreciate your patience and but you were very thorough. It was very informative for us, and so thank you and we look forward to continuing this partnership. It's going to be so crucial. You know, as we continue to navigate yeah. Absolutely. Thank you so much. We appreciate the invite. Thank you to domingo as well. We appreciate that and I'm looking forward to working with you all closely. Thank you. Thank you mom. Yes, thank you. Take care have a good evening and be safe. Okay. Thank you. Everyone good night! Thank you good night. Okay, so now on our agenda, we're going to talk to about the small Business Job Survival act. It's been a long time. I kind of feel like we're talking to an old friend like we have not seen for a while in the world has changed. Since we had that you're on me here, yes- and it is so good to see you tonya, oh old friend, this very old bill that was first introduced in 1986. and by the way I have to class at 8:30, so I might have to start, but I'll give you what this small business job Survival Act. It was originally introduced by Ruth Messenger back in the 1980s, when the phenomenon of high rent blight first hit the scene. It's what we see now, where, before Covid-19 with real estate prices, going up and more and more money floating around the city, we start seeing a horrific amount of empty storefronts blocks of you know: high-end neighborhoods, like Madison Avenue, empty storefronts everywhere, and it's all caused by real estate speculation and the problem that we have that the landlords have figured out how to make more money, not renting the storefront than renting it. And so the normal mechanism of the market, where a landlord is trying to bring in tenants trying to collect rent is willing sometimes to lower the rent. Ask in order to just get somebody in there in that space operating. So they can get rent that has been thrown off by real estate speculation. What the small Business Job Survival Act does is it puts into place a a system whereby every new lease that issued in New York City to small businesses requires a provision that, when the new lease the next lease comes up, either the landlord and the tenant figure it out and come up with some agreement. But if they can't they go in front of an arbitrator, and this is something that you know: high-end big businesses have, you know big corporate offices. Have they have this provision and what the arbiter will do is he'll get okay? What's the number that the tenant wants to pay? What is the landlord asking? What is the context of similar spaces in the neighborhood? What are they getting for those spaces and the arbiter rules on what is the fair rent? And so the rent still goes up? It just does not go up. You know, 200 percent increase right. On top of that it eliminates the pass-alongs right now you would sign a lease for a particular rent, but you would be charged with increases in the property taxes you could get charged with all these extra charges, which would not be in the original rent agreement but which are into the lease. So you can wind up getting surprised by. You know thirty thousand dollar water bill, as has happened in Manhattan, so that gets eliminated and it eliminates what we've seen, particularly with immigrant owned businesses, which is essentially under the table payments that are required by landlords even to get a lease offering. So we know stories of tenants you know being told by their landlord. You know in order for you to even get a lease offer, I want a hundred thousand dollars in cash under the table not repeated and like I said you know, this is particularly immigrant. Communities are particularly vulnerable and targeted by landlords to do that. So what this basically does? It kind of brings everybody above board. It allows for a kind of a public knowledge of what all of the rents are being paid. So this is all transparency, and through that we, the idea of the bill is that the landlords win, the tenant, wins and the city wins, because at the end of the day, the city is not served by having all these empty storefronts. This is not something that contributes to the economy; it does not provide jobs, it does not provide tax revenue and it certainly destroys the community fabric right. The very thing that makes New York New York. You know these small businesses and the diversity of neighborhoods that is all being destroyed. Now that was my pitch and that's what I was saying before Covid-19 hit and what did Covid-19 do it made the situation much worse, I like to think, of course, that every crisis offers an opportunity, and my hope is to get momentum pad before we get hit, get it back up and running again and get this bill passed once and for all, because now more than ever, New York City needs sbjs where's the bill at. Where are we at with it? What happened? Well, public hearing? This was back in 2018. This was the fall of 2018 almost two years about two years ago. Then, for the next year, my team and I were meeting regularly with Corey Johnson's legislative staff to tweak the bill to make it so that it was ready to go those discussions just suddenly froze I still have not gotten a real answer for where they were at. In their thoughts, the mayor came out strong against the bill. There was an alternative bill for rent stabilization, which is way more radical than the small business Job Survival Act, and so we were in a kind of holding pattern in anticipation of the fight coming up this spring and then, of course, Corona hit. I spoke a few weeks ago to Corey Johnson's chief of staff. He said you know, look right now. The city is just kind of hanging on by its fingernails we're, anticipating a major spike of copic cases. The thread of having to shut things down again is there and hanging over all this. Is this huge budget gap right? The fact of the matter is that the tax revenue in this city and the ability to cover New, York City's bills is largely dependent upon real estate money, and so you know he was in part saying this is a tough time for us to rock the boat on the real estate market, so I get it, but nonetheless we still need to keep on fighting and we got to put the pressure on them. They promises were made and promises should be kept, and if we do not do it with this set of city council members, then we're going to have to look at 2021 and galvanizing the political forces that we got going in 2017 for the next city council. What are the sticking points? What are the what's? What are some of the points of contention? The real Estate Board of New York is the point of contention. The fact of the matter is REBNY. The biggest most powerful lobbying force in city, government and state government for that matter, is totally against the bill and they have gotten the mayor to kind of step in line he repeats what they say about the bill and he's totally against it. What's for it is the fact that we city council remember: we got 50 city council members. We could easily pass this thing. All we have to do is get the speaker to put it to a vote, just bring it to a vote. That's all we ask and we have the votes to get it passed. So Corey Johnson is a sticking point. I'm like I said still uncertain exactly what is holding him up. He's never said, he's never explained it. So any pressure that can be brought on the speaker's office would certainly be appreciated. Did Francisco? Did you have a question? I thought. I saw your hand up Francisco, no Francisco. Do you have a question? I do not think he can hear me, okay, any so. The last question I have for you about this bill is why is it important now? What's? What is it? Is it because after Colby is there anything different in terms of this bill? Yes and here's the scary thing tanya? If you were watching the France right, you would expect. Oh, my gosh right, we've lost all these small businesses and there are more and more empty storefronts more than the city has ever seen. You'd expect to go down, but they have not right, and this is again. This is the part of this high rent blight situation. The landlords have no incentive at this point to bring their rents down and in fact they are locked in because of the real estate speculation. What a landlord can do is on paper, ask for a rent that is double triple what they could ever expect from a tenant, but it does not matter if they do not actually get the rent, because what they do is they get a reappraisal of their building based on this fictitious rent number, so all of a sudden on paper, the building is worth that much more. They then can get a mega loan from a bank based on the new appraisal of the building. Take that money use it to buy another Bl building, invest it. They can do a number of things with it to make a tremendous amount of money, so they're actually incentivized to not rent below what they put on the loan application and if they did, if they did actually lower the rent to bring in a tenant, the lane would be called in and they'd be forced to potentially sell the building so because of real estate speculation. All these landlords are locked in to an astronomical rent, which is why you have these storefronts that get left empty for years at a time, and you would wonder how could they possibly be? You know making any money off this and the answer is the money gains a real estate speculation, but once some of people, landlords cutting deals and I've heard read something in paper. These were like major chains, though, that they were giving them some breaks on the rent. That's not happening uptown up here, I! Look I'm like I'm just looking and seeing you know where the rents were and where the rents are I have the drop that you would expect and the very fact that it has not dropped. The rents have not dropped that much right means that they're kind of holding on hoping for the best and or along with that locked into rents that they set up before coping and they can't lower- and this is the problem right. So what sbjsa is hoping to do? What we're? What we're with the whole point of it, is to keep tenants in their spaces right. It does not protect it's not going to lower rents in empty storefronts, but what it will do is it will keep the rents reasonable in with for the current tenants right that should have an effect on the market right dropping in a little bit. It's not particularly radical, like I said, rent is still going to go up. Rent is still going to be astronomical, but it's not going to be at the absurd levels that we're seeing now that is causing this high rent blight situation. Great point: I know you have to go so I, I'm trying to any questions or anything. Anybody have any questions for him so that we can get them out. Anybody on the board. Any questions, oh we're good tonight again. I really appreciate this time, and so many other times you've invited me up to talk about Sbjsa. I just would urge you guys are influential. You are influential on Corey Johnson. All right, you know reach out. Let his office know that you need some action, whether it is the levin bill, whether it is the small Business, Job, Survival Act. Something needs to be done about this right activists. Like me, you know screaming. We can only do so much right for to get this message from community boards goes a very long way, so, whatever you can do, please urge you to do it yeah and I. Just so people know who are new to the committee we did do we did a resolution in support of this. So you know we. You know I appreciate your asking us to really. You know get out there and push a little bit harder because it is I think we need to look at this again. I think my personal opinion is. We just need to look at Spj Sbjsa, again post covent at this point. You know this is a different world right now and- and maybe this crisis could be the wake up, call that they need to hear but anytime, you want me to come and speak to this group or other groups. You just let me know Tommy someone has a filter in the chat that says. Does that work with residential as well? No, this is just commercial and it's just small businesses. That was a very major sticking point: we're not looking to protect Goldman Sachs right, we're not looking to protect chase banks, we're looking to make sure that this is for small businesses. Thank you. Thank you. So much I look forward to continuing to partner with you this year to see you I, I'm sorry to see until then you know just let me know whenever you need me to talk to you guys. Absolutely thank you so much David. We appreciate it. Thank you. Everybody take care, bye, okay, so I wanted to I mean we do not have to you know because I know time is going, but I just wanted us to sort of just be aware that of this program in case people on the committee were not aware of the open storefronts program, so I just wanted to throw that out there. We can have a little discussion. I am working on getting DOT to come before us to answer any questions about that and any implications or any anything that we need to know to educate our businesses. We can do that, so I'm working on that, hopefully, for you know obviously for the next meeting in December. But you know the open store for Us program basically exists. It assists existing ground floor storefront businesses who want to use outdoor areas on a temporary basis. It allows them to conduct activity on sidewalks on roadways, and you know so. You know we're talking. Businesses engaged in retail trade, repair stores, personal care services, dry, cleaning and laundry services can also use these outdoor spaces for seating queuing up. You know people wait in line or displaying of their goods. Now this program is available started on October 30th and it's continued to through December 31st, so I know we already have open restaurants and people utilizing the streets for that and there's already, of course, some concern from people about you know gathering people, not you know patrons not adhering to the rules. Things like that, so I just wanted to see what people thought about you know is this something we want to engage and address in terms of what the addition of this open storefront will mean, and I'm thinking of I am thinking about black Friday, I'm thinking about the day after thanksgiving and the heavy we're about to enter this shopping season. What this is going to mean any thoughts? Nobody can jump right in if you have any thoughts, everybody's good with it. No questions about what this will mean have anybody has have any of you seen anybody set this up yet this is also going to be enforced through DOT. So this is also a DOT thing, just like open restaurants, so I have not personally seen anyone set up. Has anyone else seen anybody set up? I have not seen anybody shut up like that yeah? Well, it's anticipated that they will, especially as we get to the you know, start approaching. You know the heavy shopping season. You know so it's just you know. This is something I thought we should think about. You know because now we're looking at retailers and others who might be impacted if there's no distancing, right and there's some mass wearing, if there's large gatherings, so it could impact that segment of the community. If we do not have any other thoughts, we can just move on, but you know I just started something that we could. You know talk you know, think about. I was when I first heard about I was initially a little concerned about noise from businesses, in other words, I'm putting out speakers to bring people over towards the things, but I've seen none of it I think they have to make an application to the city in order to even do it. So it's just like open restaurants, they just basically they sell, they sell a permit. You know they basically fill out this form. Just like they did with the open restaurants, and they just basically sell certified and agree to abide by certain rules. It's the same similar to open restaurants, so they do not have to be approved or anything they just you know, apply they just self-certify and go and then proceed well yeah. My only concern was about the noise and I have not seen anything happen like that. Well, that's good! That's a good sign! Well, I! Think it's something our committee just keep an eye out for you know in case you know there are any concerns or we have businesses being impacted from enforcement of it as well. So it's just something to keep an eye on any other questions or comments on that all right. You are good today, all right, so we can move on to getting towards the end of the agenda and any we have any updates from our community partners in the club. You're with us. Do you have anything you'd like to share anything coming up anything you know, I know the gala is coming up and other things, okay, all right! Yeah! Oh well! Thank you. This is l'oreal from cloth. I am the small Business development program director. So thank you for giving me a moment to speak. Yes, we cloth has their 68th annual gala tomorrow and we have tickets starting at 25. So we hope that folks will be interested in joining us. We're also honoring three folks, individuals, groups within New York, which includes Mr Nieto from New, York, Presbyterian and then, of course, Melba Wilson. So, additionally, we'll also have some broadway performances. So if you can join, please do what we are working with. Working on at cloth is focusing on the November 28th, which is small business day. So we are partnering with Amex to try to garner some interest with our small businesses and then, additionally, we will be having our community tree lighting events and we'll get those dates out to folks and I believe that is all that I can think of on the top of my head. So thank you for allowing me to speak, Yo and I, really thank you for bringing up the small business Saturday on November 28th, because I think we should knowledge that I was talking. I mean also in the health and Environment Committee and I was saying that we should start having proclamations as a community board to acknowledge some of these things that are important, even events and things that are happening in our community to recognize, like maybe have a proclamation to recognize small businesses for November. You know, because we have our general meeting coming up on the 24th, so small business, that is the 28th. It might be a good idea for if you know, I, won't see what the committee thinks about that to do a little proclamation. It's not anything involved, just a statement recognizing all of our businesses and recognition in advance of small business Saturday. So what do you think? Gloria I love the idea, I'm tickled yeah, absolutely whatever cloths can do to assist? Yes, absolutely! Let's do it, I mean I. Think we I think we should partner on that and do a proclamation. What do people think we do not do proclamations that much I think there's some you know like there are major things that come up, whether it's women's history month or whatever you know things that come up. That I think maybe might be a good idea for us to just do proclamations and just kind of you know. You know just state that we acknowledge that this is what do people think any thoughts. Anybody have any strong feelings against the proclamation, acknowledging small businesses in our community in advance of small business Saturday, all right. So can we I guess what we should do, then is maybe we need to vote or something I guess to say if you know to create this proclamation that we're going to do a proclamation just acknowledging appreciation for our small businesses, especially in this time of this current challenge, that we appreciate them and we acknowledge them and on behalf of the Business Development Committee and committee boards. Well, should we vote on that or how does that go yeah? We can vote on it, okay, all right so yeah, so all in favor of Ashley, yes or no in favor of the proclamation. Yes, okay, Francisco, Lopez. Okay, we have oh one, yes, okay, awesome and Rafael. You are you're a public member, correct, yeah, Raphael, that's correct, okay, yes or no! Yes, okay! Any community members that have any strong thoughts on want to vote community members. We can we'll just call them Nancy, Preston Proclamation. Can she hear me tara? Can you hear me? Yes, I can okay, it's a yes or no. Thank you. You're welcome and Rob Rob I do not know how to pronounce your last name. Is it balti? Can you hear us? Yes, thank you? Okay, so you yes or no to a proclamation recognizing our businesses in advance of small business. Saturday. Yes, 100, okay, Joseph, barely let barela Joseph. Can you hear us? Okay, guess we're having a little problem reaching there and we can't reach Nancy Preston? No! Yes, this is nancy. I, say yes, okay, great, awesome, okay, so Ashley! You can record that you know from the board. Members are here. It was a yes all! Yeses and then we had the public members who I mean the attendees who said yes, so l'oreal, we'll talk about that and I'll also circle back with domingo, though you know, obviously, in his absence well we'll circle back I look forward to working with you fantastic! Thank you, okay! So now we move into any old business. Anybody has anybody of any old business. I only have one thing for old business and I just wanted to announce and I did this in the health and Environment Committee we back in August 4th. We had a hearing, a public hearing on noise in our community and that that public hearing, of course, you know some of you attended, it was hosted by the health and Environment Committee and at that committee, I mentioned that there should be a task force to you know form the committee to address that and community members wanted a community-based task force. That's coming out of the community, and so you know a lot of there's. There were several community members who worked really hard over the last six weeks of doing outreach to various members of our commit community, and we have formed this task force. We have 22 people that have are going to be part of this task force and it's extremely diverse group of people we have 12 of those people are identified as well. Actually, I'm sorry 13 identifies people of color, eight identify as hispanic or latino. Four is black or african American and one is middle eastern and we have a nine who identify as as white or caucasian. It's also pretty evenly split between Washington Heights and Inwood. So we have 10 members of the task force from Inwood and 12 from Washington Heights and the most of the people. The vast majority of the people in the task force either live and work or live in this in either washingtonwood. So there are local people and we have people who've been in this community, all of their lives. Some said, 52 years, 32 years, 40 years, 42, the first there's only there was one person that was here two years, so it gives us a little fresher perspective, but we people have been here a long time. They know this community and we have representation from all at all walks of life. The reason I think this is you know: I want to bring this up in business to me, because we have a strong business, small business representation on this task force to you know, because they have been heavily impacted by the noise issue and it's good to have their perspective and also yes, one moment of Francisco, and we also have representation from the elderly young people. You know, youth schools, we are it's an extremely representative group that I think will bring important perspectives from all aspects of our community to this issue. Yes, Francisco, I'm sorry go ahead. No I've been meaning to ask about this task force and what exactly? What's the goal? Considering that it's getting colder and noise is going to naturally go down, but also what are the? How can I say it like? Is it a reporting thing like if you see something reported like how what's the mechanism of how this works out, how it gets dulled out? Thank you, Francisco really great question. Yes, the goal of the task force is actually not about enforcing. That's, not what we're doing we're really. As a community, people are coming together to figure out where the key. What are the problems we, you know, looking back at, what's been happening, and especially what happened this summer? Where were the major areas of concern? How did this impact, because we're looking at as a public health issue, we do have members of Columbia, University or part of our task force who are joining us to talk about that. But the task force is just here really to come up with priority areas and ways in which this has impacted our community and come up with recommendations for solutions and with that we're going to class. What's going to be hearing from to the agencies, other community members other people to kind of gather if you know feedback to, and they will come up with some solutions that they and also who would be accountable for enacting whatever you know, recommendations they come up with. Who will be accountable for ensuring those things actually happen? So it's about you know really coming up with some community-based solutions that are not based in you know not just based in necessarily one area, but a very holistic list of recommendations, but also about accountability. Because, what's happened is that you know people have been you know reaching out. You know seeking you know, assistance with the issue, but they've gotten very little assistance and help in response, so the task force will be looking at who accountability? Who can who can and who can do something about this, and in what ways can they engage and making sure that they do so? This is not you know about. You know NYPD. This is about all other ways that people you know what the problems that we endure and it's not over I will say, beg to differ ever I. Do not get sleep right now because of dirt bikes and motorcycles, just spinning around my neighborhood all night, all night, so yeah. So this is the perfect time to do it. This is the perfect time to do this concentrated work while it is cold because it's going to get warm summer of 2021 is going to be here very soon. So this is a perfect time for us to kind of go. You know, take that time out and really look at this issue and have the ability to just you know. Take that moment. While it is cold to sort of do this, because you know we want these, we, the goal is to have these recommendations, of course, before the summer of 2021. so the task force work will be done before then, and hopefully we'll get some responses and some action any questions about that. Any questions from the board or from the public and like I, said everybody is not a part or like we. The task force itself had to be kept small and we also had to make sure different segments of the community were represented. So obviously not everybody is going to be able to be in that, but we are definitely going to have a community advisory component where we're going to just have meetings and like be able to share back with each other get feedback from others in the community about you know what challenge they're facing what solutions they think we should enact and, as a you know, the task force itself rather should enact and other task force. Can you know we can share some of the what's coming out of the task force, and so this opportunity we'll be sending more information about that once we meet we're going to meet this month for the first time and so we'll be I'll, be sharing out. You know progress on that and we'll definitely be engaging with the community board as well continuously about this, because I think it's important. You know we are partners in all of this. Any other questions. Okay, all right! Any new business going once going twice sold. Okay, all right! So can I it's 8:46. Can I get a motion to adjourn all right, Francisco, Second, Ashley. Second, okay, we are adjourned at 8:46 P.M. Thank you, everybody for you know. I know it's a last-minute change, but thank you for your patience as we go through this and you know we'll see each other next month, all right bye-bye. Thank you. Tanya bye! You.",
            "summary": "And, he said he'll keep trying and hopefully we can get him in, but I do not know if you can start recording because we're going to get started.\nYou know we can look out for that next month, but the committee business today we're going to hear from we.\nThen we're going to hear from Steven Eisenbach, who has been very active and we've been working with him for a while now actually on advocating for the small Business Job Survival Act of Sbjsa, which would you know if it were to pass, would provide some much needed protections for our small business owners and here.\nWhat this program is, what it's doing, hopefully next month, we'll be able to have someone from D.O.T to come and talk with us about that program and anything that our business needs to know and for us to better educate them and any potential you know challenges they may experience as a result of that.\nI do not know who would go first, John or pauline, you all choose, and I'm going to prefer to have more for him to give for the update, because I believe he is doing a lot on the ground level.\nSo just so you know, if we hit, if we hit three percent, then the city and the state, the city, the city of New York, has said that as a as the threshold where decisions will be reviewed in terms of closing schools, closing businesses in certain areas where that is happening.\nYou know hundreds of city workers to go down on the ground and try to really get in the community, distribute flyers and sort of stay there every day and just sort of be there and providing information ready to answer questions.\nAre you looking at different languages to talk to like business in terms of just like how to communicate to businesses, because the concerns that businesses may have my is very different from maybe you know the concerns or the challenges that individuals are having around distancing and things like that, because what's happening is obviously as you as you mentioned, you know.\nYou know how to communicate with them in a way that sort of addresses their particular unique challenges around this issue.\nThen we already we identified and understood that essential workers and essential businesses, you know, were going to be really critical.\nWhat we knew more recently about masks, and things like that, so you know once that changed and we try to make sure we get that word out to people and so on and so forth, but I think so.\nI. Think, our colleagues are, for example, at small Business, services, New York, City SBS.\nThere are some of there's some documentation, that's very specifically targeted towards businesses, small businesses, restaurants and the like, including some of the decals, but I think this is part of the reason why we wanted to be here.\nOne is to kind of give you the information, the update that Dr Manonda provided, but also to kind of create an opening between us and you that, when you do have ideas like what you have indicated, that you want to be able to ensure that businesses, organizations that are in your in your catchment area, how they can best be provided.\nI mean one of the things that we have been doing in some of the other spaces that we have been working with is to get with a business or trade organization, and we kind of make that connection with them.\nWe've also had this conversation with them, trying to talk target the messaging that we are getting out to them, so they have been helpful, but knowing that I know that a lot of different businesses in front of this committee and you're able to speak to some of their small businesses directly themselves.\nYou know in businesses like what you mentioned gyms and other places, but some of it is also what they call super spreader events or just events where the virus is able to go from one person to another and to another to another in relatively short order, because people stay in crowded areas, together.\nExercise do not want to wear the mask, but you know for them to be in the gym.\nIt can't be like how it used to be when every single treadmill and every single you know piece of equipment right next to each other in tight spaces and everyone is and each one of them is being used.\nWe know it's not always easy, but encouraging the business community that you know, guidance, has been provided in terms of the reopening and some of I knew we've done, presentations to businesses in, in particular in East and West Harlem around the reopening guidance and things like that.\nIf folks are able to stay in keeping with those guidance and enforce that you know just from the business standpoint, I think you know that there may be.\nMost of the time you know, I, think that's where the issue that we're seeing is.\nYou want to see whether or not there's a lot of individuals that you may know that are utilizing that space.\nWe just want to just want to warn just as I said, before, be able to open up a means and method of communication between us and the committee Us and the abundant, but specifically that we are able to help as much as possible in terms of making sure that resources are going to the places that they are needed.\nSo I just wanted to offer our support in terms of gathering together the agencies that deal with business reopening, because I know that we are often here at the DOHMH, often asked a lot of questions about business and restaurant reopening specifically and unfortunately.\nYou know whether it's department of consumer and worker protection or small business services and the mayor's office of special enforcement.\nYou know we're hearing lots of questions about whether these structures are legal and how many people are allowed in there, and all of these questions are absolutely things that should be addressed.\nI'm, just sort of curious in terms of you know the partner that we were able to work with.\nThey have to be targeted very specifically to the individuals within that community, so we were able to have grants of a variety of organizations in certain parts of the city, including upper Manhattan, including in the Washington Heights in Malaya, and so there are a few organizations that we have partnered just do not not calling the names at the moment, but it's also to let you know that we are looking to work with other partners.\nThis question I meant to ask you know the city started a new program about open storefronts, which is for retailers to be able to utilize space outside of their stores.\nI, wanted to ask if you know.\nI believe that program is going to be in effect, but you know it could get really busy around Christmas.\nSo now on our agenda, we're going to talk to about the small Business, Job, Survival, act.\nWe start seeing a horrific amount of empty storefronts blocks of you, know: high-end neighborhoods, like Madison Avenue, empty storefronts, everywhere, and it's all caused by real estate speculation and the problem that we have that the landlords have figured out how to make more money, not renting the storefront than renting it.\nUnder the table not repeated and, like I said you know.\nYou know these small businesses and the diversity of neighborhoods that is all being destroyed.\nIt made the situation much worse, I like to think, of course, that every crisis offers an opportunity, and my hope is to get momentum pad before we get hit, get it back up and running again and get this bill passed once and for all, because now more than ever, New York City needs sbjs.\nLet his office know that you need some action, whether it is the levin bill, whether it is the small Business, Job, Survival, Act. So people know who are new to the committee.\nI know time is going, but I just wanted us to sort of just be aware that of this program.\nIn case people on the committee were not aware of the open, storefronts program, so I just wanted to throw that out.\nI am working on getting DOT to come before us to answer any questions about that and any implications or any anything that we need to know to educate our businesses.\nSo I know we already have open restaurants and people utilizing the streets for that.\nThings like that, so I just wanted to see what people thought about.\nYou know is this something we want to engage and address in terms of what the addition of this open storefront will mean.\nI was initially a little concerned about noise from businesses, in other words, I'm, putting out speakers to bring people over towards the things, but I've seen none of it.\nYou know there are any concerns or we have businesses being impacted from enforcement of it as well.\nIt might be a good idea for if you know, I, won't see what the committee thinks about that.\nYou know like there are major things that come up, whether it's women's history month or whatever.\nYou, know just state that we acknowledge that this is what do people think any thoughts.\nMaybe we need to vote or something I guess to say if you know to create this proclamation that we're going to do a proclamation just acknowledging appreciation for our small businesses, especially in this time of this current challenge, that we appreciate them and we acknowledge them and on behalf of the Business Development Committee and committee boards.\nI want to bring this up in business to me, because we have a strong business, small business representation on this task force to you, know, because they have been heavily impacted by the noise issue and it's good to have their perspective, and."
        }
    }
}