{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCupvZG-5ko_eiXAupbDfxWw",
            "title": "The Exonerated Five Central Park Exhibit Public Panel Discussion #2",
            "publishDate": "2020-07-22",
            "shortDescription": "",
            "lengthSeconds": "1:51:54"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Fc9h8XcrHWs",
            "fillerWordCount": {
                "uh": 1,
                "um": 8
            },
            "readTimeFullTranscript": "51 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "women": 41,
                "project": 41,
                "park": 32,
                "monument": 24,
                "approval": 19,
                "years": 19,
                "statue": 16,
                "history": 16,
                "video": 16,
                "design": 15
            },
            "wordCountSummary": {
                "women": 18,
                "monument": 11,
                "project": 9,
                "approval": 6,
                "park": 6,
                "years": 5,
                "history": 5,
                "terms": 5,
                "exhibit": 4,
                "organization": 4
            },
            "fullTranscript": "Things are good, no, but Karen's not going to have a picture up is that Oh suit come off of this yeah soon as I come off of this no problem, how many people do we have in and he's trying to get on and it's keep not letting him get on, but he has to make prayer right, quick and he'll be on here at the trying again in four minutes. Okay, so Carrington to your question, we've got us: we've got five panelists and twelve attendees, okay, so friendly reminder only panelists have their videos enabled and attendees. If you scroll to the bottom of your I guess screen, you should be able to see a section that says Q&A and then another section for chat, so I'm sure Karen will explain it later on. But if you have any questions for the panelists that go into the Q&A and then the chat, they're just messages for everyone to just to be aware of thing is all messed up. It said 18 participants, so I must be Mr.. No, it's a so when it says that in the bottom it's compiling the attendees and panelists together. So, okay, all right so are we on Mm-. Hmm, okay! Well, welcome everyone good evening. This is discussion, number two of the Central Park PD I'm, sorry, just a second! This is part 2 of the discussion for the installation of an exhibit in Central Park commemorating the exonerated five and I'd like to welcome everyone this evening and just share with you our panelists for this evening, and we have retired captain Brendan Berkman she's with monumental women. We have Mrs. Sharon Salaam. She is with the justice for the wrongful wrongfully incarcerated and we have Isaiah, who is the borough director from Manhattan with the mayor's office, and we have Reuben our technician, who's, fun and we're expecting dr. Yusef Salaam he's running a little late, but we're going to begin so we'd like to first open up with, and the objective of this evenings discussion is on around development and funding for the exhibit or permanent, whatever that the permanency of the of the commemoration develops into so we're going to be talking about how we can direct that development and how we can do fundraising for that project. So I'd like to begin with Brenda, if you could just explain to us the process that the monumental women organization went through for the women's suffrage, monument which is opening and I'm sorry being unveiled on August 26th of this year. Thank you thanks for having me I'm, really glad to be meeting with this group, because when we started our process or really was not anyone around to give us a whole lot of guidance for our project because they, the last time a statue was put into Central Park prior to the approval of our monument was 40 years ago. So that's a long time and most of people who were involved in those earlier monuments and statues were long gone. So we were kind of reinventing the wheel I'm going to try and give you the benefit of our experience, because that's one of the three objectives that we have for our organizations for our organization monumental. Women is not about one and done when we, you know yes putting a monument to the women's rights pioneers of Sojourner, Truth, Elizabeth, Cady, Stanton and Susan. B Anthony is one of our objectives, but the other two are our education campaign and I know that you're very interested, and you know what people can do, what your group can do to educate the public in a park about your issues and your event, your history and then the third thing is to challenge to municipalities, not just New York, although we would challenge New York to do more than they have but challenge two municipalities all around the country to honor more women and people of color and their public spaces, because I, probably this group will not disagree with me that we believe that women and people of color have been left out of being recognized in our public spaces. So maybe I'm just going to shoot too quickly just to guide our discussion here, I want to show our and I have to go back now and screen share just a couple of quick things: oops wrong thing. That is the wrong thing. Okay, let's go back I'm, sorry, so, once I get that I should have. Why do they working practice? Guys? It's that one? It's not working! Oh there! It is. Thank you, Thanks, okay, so there are 23 statues of historical figures in Central Park and not one honors, a woman, also not one within the park. Honors a black person, so Sojourner Truth will be the first black person honored in Central inside of the park with a monument. Let's see, if I can do this next thing here, so our key objectives were to pay tribute to truth, Stanton and Anthony as women's rights pioneers break, and we are breaking the bronze ceiling here by putting the first statue of real women in Central Park's 167 year history into the park, and we will be dedicating it. This August 26th and you are all invited to join us in our virtual press conference unveiling ceremony for the reveal of the monument on August 26. We're going to be streaming. We're going to be, we've had to really shrink the footprint of the live event. Needless to say, for our concerns about health, but also because of you know, state and local mandates. So our ceremony is going to be largely for virtual, and then you go down to the next part in it, and we talk about our ongoing educational campaign about women's rights that we are sharing in New, York, City and acrosss the country. You know some of our future projects include 5boro, walking women's history, walking tour and we also, as you can see, as I mentioned, you know we're asking communities to reimagine their public spaces. So what are the accomplishments that we've had today? Well, we were received approval from the parks Department when we first started this process seven years ago, kind of by happenstance one of the women who is now that one of the early board, members of our organization, Colleen jenkins, ran into Mitchell silver at a event and said you realize that there are no statues of real women in Central Park and he said what yeah and that was. You know, sort of the beginning of the process of getting Parks approval. Now we had to raise entirely private funds and one of the things that we had to assure Central Park, both the parks and the Conservancy, the Central Park Conservancy, was that we would be able to fund a maintenance, a maintenance fund for our monument, quite large maintenance fund, as it turns out, and so that was part of our the 1.5 million dollars in private and foundation. Funds that we have that we have raised I would strongly encourage your group to incorporate as a 501 C 3 non- profit it, and it really helps with being you know, getting organized, especially in your fundraising and development, and there are. There are groups in the city that do that kind of work as volunteers, so I do not have the lawyers Alliance I think might be one of them. You know they will help you get incorporated and then a lot of the what we call White shoe law firms. You know the big, the big law firms do this kind of work for nonprofits as pro bono work. So you could start to think about which firm you might want to approach to help you out with your legal issues, of which there will be many, and then you know, you're going to want to come a jury design. Competition now Karen had sent me some questions about the design. Competition hang on, I got a I'll bring those up later, we've been working with the parks and the Central Park Conservancy, but they're, not the only group within the city that you're going to be working with to gain approval for your project and a lot of how you gain approval for your project, which groups you have to gain that approval from Karen's, where a lot of the stuff working with Community, Board 10 depends on what you end up, defining your project. As so, you know, if you have a monument you're going to have one set of city agencies that you're going to have to deal with if you're putting up like Cynthia Copeland talked last week about the Seneca Village educational temporary, exhibit that's in the park right now and that that's a different set of agencies that you might have to approach. So a lot of the boxes that you're going to have to tick off depend on how you define your project. We got our monument received the unanimous approval from the Landmarks Preservation Committee, and we receive the strong support of all the community boards that surrounded the park. Now again, how many community boards you have to go before is going to depend a lot on where in the park you know you play you want to place your statue monument educational project. However, you define the project so we're on literary, walk and I. Do not know if you all know where literary walk: here's literary a map of literary walk. This is a southern roadway that goes down and then the walk goes up towards Bethesda found up at the north here and yeah I. Are you comfortable with making your slides full screen? I just want to make sure people on mobile devices. If you, if you go down to the very bottom, you see comments on the bottom right hand: side, oh I have to go back to zoom, no, not soon. Okay, sticking within PowerPoint, obviously yeah just go over to what looks like a slide. Yeah, that's the! And now what happens? There's a good did a go fullscreen! No, not for us. You chargon! There. We go okay, I'm! So sorry, okay, so literary walk. It was a particular challenge for us. We got the space. We got this space right here down here they. You know, you know enough about the history of the park, that you know that Olmstead and Vaugh did not want any statuary in the park zero. And then there was a period of time where I do not know, did they die? Cynthia might know better than I, but there was a sudden influx of statuary and then there was and then there was a reaction against that. So then they did not want to put it anymore and that's why we had that 60-year gap with no statues at all. But what happened was while they were doing this, so they put up the statue of Robert Burns. They put up a statue of Walter Scott. They were right, acrosss from each other on the walk and they were facing each other and they put up this statue of Fitz green Halleck. Of course you all know who sits. Green Halleck is I'm being facetious, but 30,000 people, it's green hallux statue, dedication, including the President, the United States, and they had this blank space right here, acrosss from Fitz green Halleck and that's what we were presented with, but they but the but the park and the Conservancy. You know really were quite adamant that this that our Monument had to fit into the aesthetic of the 19th century. When these other monuments were put up, so when you, when you go to look at our design, you'll see that it looks you know it's very 19th century. Let me see if I can go back to this other anything. So this is what I'm talking about here. That's we had to conform to the dictates of the Central Park designers, VAW and Olmsted, and we had to make it had to make it look like it fit in. So this the way that we handle this is we say this is a statue that should have been there along with these guys in the 19th century and we're now just getting around to doing it and there's just a picture. You can. If you really strain your eyes, you can see acrosss the pathway. There is Fitz green Halleck and we're going to be in this foreground here, and this is our design, so the one in the center there shows the piece of stone. That's going to be granted, that's going to be sitting on top of with the carved names. Everything has to go through the approval process. I mean the way that the carving looks you know all the different aspects of the of the design and if we get around to it, Karen has a really good video of the sculptor talking about her design. So, let's see I think I might be, and we had to prove that all three women were connected not only to New York, but they also were connected to the park. So this is just a list of some of the ways that both all three truths, Stanton and Anthony- were all connected to New, York City, and then we had to show that they were connected to the park as well, and this is our budget funds for all these different things. It's amazing how many different contractors you have to work with yeah I know I keep saying Cynthia Copeland, but you know we had to get. We had to get somebody to come in and evaluate the tree roots. Central Park is the hardest place, I believe in New York City to put up any kind of a monument or exhibit you know, even an exhibit, and that's our board of directors, so I'm going to I'm going to go off the screen sharing now and try and figure out. If I, you know what other kinds of specific things I can say. That would really help. You know I, we can give you advice about how to go about doing a jury process. There's really no reason to reinvent the wheel. I did want to really highlight something that we're rolling out tomorrow, so be looking for it on our website, social media or Facebook page everything else. As part of our efforts to educate the public, we did not want it. Central Park's, very picky, about what kinds of signs you can put up, and so we wanted to use technology to educate the public about the lives of these three women and the suffrage movement in general were unveiling it on 100th anniversary of women, winning the right to vote with the night. The passage the enactment of the 19th amendment, so it's the monument is closely tied to suffrage, but what we did was we were doing an app called talking statues and tomorrow we're going to just do a tease, a snippet of the talking statues, app where we have our actors, our actresses reading, from the script, the words of these three women in dialogue with each other talking about their lives talking about their work, talking about their work together- and you know it's short- it has to be short because the people are only going to stand there with a device for so long. Then we have also on the on the app will be very brief, documentaries and an interview with the sculptor, because we have the benefit of having a live sculptor. None of the other statues in the park have a sculptor who's still alive and she will be explaining the details of her vision. You know for the monument, so that's part of our education campaign, there'll be New. York City schoolchildren are going to be able to access us they're, going to be able to do reports on this. Using that app and like I said it's very, it's very simple, it's very short, but it's a beginning, and so we're excited about that and I think I think you know for now. I'll stop because I'm sure I'd talk past my 10 minutes, Karen! Oh, it was well worth it. You got to do that. You gave us some fantastic. You gave us some fantastic information. This is just wonderful and thank you for being so forthcoming and so generous and sharing so I'm going to switch over now to the video while I'm doing that. Maybe we could take one question sure: okay, Ruben, can you help us out with the questions sure? Yes, okay, Thank, You Ruby, so Stephanie asks? How long did it take you the bugs seven years and we're still raising money because we had to pivot on our on our availing ceremony, because we have you know some unanticipated costs. We've, you know had to raise more money, so seven, but seven years so far, and we're continuing to raise money for our education campaign and for our challenge to municipalities, okay, so great Karen D there, a couple of others: do you want to wait to answer them or if we could do two more that'd, be fine, okay, sure. As a reminder, please enter your questions into the question and answer box and not the General zoom chat. So Cynthia asks how can we access the tease that you are referring to? Do you have a URL to share with us now yet do not jump the gun everything's getting rolled up tomorrow morning. So if you know, if you hashtag monumental women or you go to monumental women, NYC, that's our that's our Facebook and Instagram account. You know we're going to post we're going to post the press release and the little snippets so just be patient as we get that all done tomorrow. But it's going to be an exciting roll out. I! Think! Well, just that you know you're welcome to go to our web site into our Facebook page in advance and find out more about the organization. So Marvin asks. How long did it take to get approval from the mark? Seven years, I mean we've finished, with the approvals in 2019. So six and a half years yeah, it's a long process and they're like Cynthia mentioned, there's a lot of gatekeepers involved in Central Park because it's you know it has an aesthetic that is fixed in a lot of people's minds because of the design you know and the intent when the thing was built and there's they're very cautious about anything that they think alters that aesthetic at all and it and just the rules about putting things into the public. Art collection are pretty stringent, so there's a lot of rules and sometimes the rules seem to get changed or made up like never heard. When we started the process, we never heard that we would have to convince them that the people we were honoring it's kind of a connection to the park, but we in their lives. You know, but we found it. We found it so the thing is that you're going to need you're going to need people who are your supporters and you're working we're an all- volunteer organization. We have no paid staff and you need people that are passionate about this project and they are going to persist no matter what I do not think that you're going to have trouble finding those people for your group, but I just warn you that it could be a long process. There's you may have the wind at your back right now and it's just impossible to predict really what kinds of things the park will be interested in. I do not know if you any of you are old enough to remember the gates, those orange pieces of cloth that were an art project that we're throughout the park that took that artist a really long time to get approval for that. So even temporary exhibits can they a lot of opposition when they're trying to get approval? Okay, kara, there's still a couple questions. What do you do? We can come back to the questions and we'll just start the video now and if I have difficulty, Reuben I may need to ask you to share the video. Let me see if I can do this. The sound is very low. Reuben I do not know what to do about that. Are you sharing your screen because, right now, it's long me. Are you seeing it now? Yes and now I just tap the video on the on the bottom right corner and Nrj. Is your volume on it's on, but it's very low I mean you may have to do this sharing? Would you like to share it Reuben? Thank you. Okay, can everyone see that still trying to come out of I can I think that's you yes, I can see. Shion's are not completely accurate. Do not know why wait I'm being told that people can't hear the video is that correct, yeah and you're can't hear it in the captions are really pretty awful. I do not know why but likes they're, not they're, not getting just a bit. Let me see what my options were once I think please. Well, while we're waiting, Karen I could give you a few moments here, let me just find them okay, and we could ask we can answer a couple of more questions. Well, let me just say a couple of things that in direct response to some questions you sent me so one of them was what was the case that can be made to substantiate the exceptional importance for the commemoration of the exonerated five in Central Park, so is the Parks Department Asking Community, Board tents tended to do that? Is that memory? No. This was just an anticipated question. Oh okay, what would be needed to organize and implement an artist selection process, so the best way is to find an arts organization or a firm- that's done this before so you do not have to reinvent the wheel. I mean the details that are involved are really overwhelming. If you've not done this and we hired a firm buyer vendor because we only use BBB, we hired BBB- and this is this- is what they do. They do. Monument stuff and historical preservation and they've been invaluable in terms of you know the process and how to walk it through the various city agencies. You know it's, you need somebody like that to help you out, so the recommended guidelines are criteria for the artists selection process. You need to know exactly what you're aiming to create hang on a second somehow I got a shared screen again: yeah, that's mine, I'm, just while you're talking Brenda simply a Cynthia just said beer, bender and bail, no, not bail. This is you got ta. Excuse me, I'm, really terrible with names, and but it's firebender fire blender. Oh I'm, sorry they're going to be really mad at me. That I did not get this right. Oh all, right I got it Oh bell ringing the bells yeah Bell, those from Cynthia. Let me go back to the guidelines for the our selection process. So if you define exactly what the goal of the artwork is and the purpose of the project I mean you're, getting artists can still do what they're going to do they're free to express, but if they know what's expected of them, then they're going to you know, provide you with something to choose from and so you'll. You know you get out the word about the outreach you put it out to sculptor organizations, the Art Students League, the sculpture college, the university and college sculpture departments. I mean there's we're in New York, there's a million options in terms of artists, and then you, then you know we recommend that you take. You pick a diverse jury and you members on that jury from different artistic backgrounds. So we had like an art historian. We had. One of our jurors was one of the curators at the Museum of african- american history in the Smithsonian and I'm trying to think who. Well we had a member, we had members of our board and we had the Parks Commissioner of course, and that might have been it. There might have been one or two more people, but to get people from different backgrounds can be very helpful and then and the same thing for the judges. You know that you define the project and its goals and then you're going to start thinking of people that could be judges for your competition. We had to go through the parks department, the Central Park Conservancy, the public design, Commission, the Landmarks Preservation Commission, and every Community Board surrounding Central Park, so I keep talking or I'm almost done, but I do not know if you're ready to do something else. Well, I can show the video, though, if that's okay, Susan B Anthony will be not I'm feet tall, so this head would be 14 feet up in the air. Can you all hear, though? Yes Sojourner Truth me it's a little more Aging in her face. I am the sculptor of the women's rights pioneers monument for Central Park, today, I'm working on hands and I'm building out the fingers to show the pressure of the pen. These kinds of details really make the sculpture vivid. This began over six years ago with a group called monumental women that formed to shame English, the lack of representation of women in public statuary and monuments, and they petitioned the city to give them a site. In Central Park for statues of women's rights pioneers the women depicted in the monument are Sojourner Truth Susan B Anthony, an Elizabeth Cady Stanton. These three women were very important to the stature, the rights, the citizenship that we as women enjoy. Today, Susan B Anthony is traveling back. She would arrive at Stanton's house with her bag crammed with in justices. A lot of statuary just shows a figure standing, and that has never interested me. I want to tell a story. I want to show a moment so they're sitting at a table, maybe hammering out a speech, maybe working on a piece of legislation, maybe having an argument. I want it to be up to the viewer to decide so you're, never going to see her like this you're, going to see her from below tilted down more like that. I want the piece to be in depth so that, as you pass it day after day or as you visited once a year, there's more to see there's more to discover. So there is detail hidden everywhere in the sculpture and a lot of it has meaning. Sojourner Truth often had herself photographed with her knitting in her lap, because knitting was a patriotic occupation during the Civil War, it was actually necessary to provide clothing, but it was also a skill. I have read that was not taught to slaves and she wanted to work among the newly freed slaves and the escaped slaves and show them herself as an example of what they could become skilled involved with rights and hopefully, eventually citizenship. The statues would be unveiled on Wednesday August, 26 2020, which is the 100th anniversary of the red occasion of the 19th amendment. When it actually became law that women could vote and it'll be right in the park on the site on the Central Park Mall, where the statue will go, I can't even begin to say what it means to me. But I've lived in New York City for over 40 years, I love the city. I spent a great deal of time in Central Park, with my son as a baby as a child, it's been a refuge and an inspiration to see the statuary there and I've been a professional sculptor for 40 years. So it's quite a wonderful thing to be doing this project yeah and I know Karen. You sent me a second video, but I'm, assuming you want to wait to show that later. Oh, yes, very shortly, no but I just wanted to say that's a beautiful promotional piece, I'm just looking at what goes into coming up with the concept, then putting that concept into a medium that actually conveys the message and the feeling that you want to get from your audience and I also noticed Brenda that the statute was created well before the park approval was given. So could you speak to that a little bit? Well, yeah I mean it's a little bit of a dice roll when you're, when you have a concept, and now you go before city agencies and their ideas may not align completely with you with your with yours, so you know you. There has to be a certain amount of flexibility. In terms of you know what you end up with and that's hard on. Artists I speak as somebody who makes art myself, not sculpture, but other things, and you know, artists really do not like people telling them what to do, but in order to get city approval, lots of things have to be taken into account. So even things in Central Park, like tree roots I mean if you want to pick the hardest place in the city, to put up a monument or a display of any kind you've picked it it's much easier on the outside of the park. It really is, you know, Frederick Douglass statue, the Duke Ellington statue, not as much of a problem in terms of you know how fast the process moved Karen, you're, muted. Thank you. As a button Ruben said, there were a couple of other questions for for Brenda, muted yeah. One person asks: did you bring on a fundraiser person to do the work, so we're lucky on our board that we have people who are, you know, have bring. Particular skill sets to the board. So we very early on one of our board members, Heather Nestle, who is a foundation person for New York Life, the company New York Life who's, Susan, B, Anthony's family worked for that life, Insurance company and Susan B Anthony cashed in her life insurance policy, I'm sure her brothers and Father did not like that in order to pay for sending women to school at the University of Rochester, but to get back to Heather, she had an enormous amount of knowledge about fundraising and what foundations and corporations and how to approach them and she's able to put together with what's called a deck which it you know explains. Your project explains the needs explains in a way that is going to draw people into wanting to support your you know your endeavor. We also have an accountant on our board. We have people with various connections. We have a plumber on our board. You know we wanted to have a very diverse group of people who were involved in this project to get different perspectives. You know how to go about it and what our end result would be. So we you know we have. We have former city officials on our board and it's you know those that level of experience is really helpful in terms of navigating the process. Yes, you're going to need some pro bono work, maybe from an accountant, accounting, firm or a law firm or two, but also you need a board that, hopefully, is not only passionate but can figure out some ways to move the project forward. Another person asks: can you share with us the establishment of your organization, mission, staffing, etc? This is how many staff we have zero and you know, as I said we have. We have a three- part mission. One is to on to put the first statue of real women into Central Park and then the second thing is to do this education campaign around women's history, and the third thing is to you within the city of New York and then also to challenge municipalities to honor, more women and people of color in their public spaces. So that's our that's our mission. Those are admissions and you know everyone's pulling towards the same end on that, but obviously, at various points in the process, one thing will take precedence over another. So great thing about the Central Park statue is that it really combines all three, because it's not only the physical presence of that Monument, but also, as I said, the talking statues and other education initiatives around that Monument coming to the park and then the fact that it's going to get. We believe it's going to get an enormous amount of national attention despite the pandemic and all the kind of challenges that we've had from our original vision for the unveiling. It's on the hundredth anniversary, three of suffrage, and we wanted to tie that into voting and encouraging people to vote and registration and the importance of having a voice in your government. You know in your civic affairs, which women did not have at the time of Susan B, anthony, Elizabeth, Cady, Stanton and said Journeyer truths. You know, Sojourner Truth starts her life as a slave, but even after she is freed by, she still faces all these challenges of institutional racism and limitations on women's roles. All those women fought not only for suffrage, but also for emancipation, the slaves and women's rights to have their own children if they were divorced women's rights to have control over their own property and finances all those different kinds of things. So we are trying to show people that for all the challenges that our country faces today, people in the past have overcome even greater challenges or as great challenges, and that we can not lose hope. But you know working together as these three women did. We can, you know, move towards a more just and equitable Society. These are all the messages that you know. We see as being reflected in our statute now we know that one statue can not satisfy the hopes and dreams of all the people to have their. You know concerns and their history honored in our faces, but this is a start. We feel this is a start, just as your project will be a start in justice. Reform in prison reform in policing, you know, will be a start of the discussion in that in your project. You know we're very excited about how this is going to amplify other kinds of social justice issues. Okay, there are five more questions: yeah people very interested. Okay, one person asks: how long did the approval take? Did it take to get this rolled out? I think you said seven years yeah. What were some of the issues account you encountered. I know you alluded to them throughout, but maybe top three sort of most frustrating or challenging issues you encountered might be helpful. One was the site, and initially we were not going to be actually in the park. We were going to be acrosss the street from the New York Historical Society, really, with these women facing Frederick Douglass and Abraham Lincoln, the statues that are over there, but that site had a lot of problems structurally and the park came up with this alternative site on literary walk. So the advantage of that was had a lot fewer problems with the actual construction that we would have to have done, but it had a lot more restrictions because of where it was in the park in terms of what kind of a look they wanted for the monument we you know, we've evolved as an organization also along with every along with a lot of people in terms of what do we do to not only take statues down but to try and have discussions around the history behind these people, and so we've been. You know. We've been working on our education campaign to be more to address those issues of the time that we are in now we're at very different times as statute people than we were seven years ago, and so you know, we've had to evolve with the rest of the country on trying to address all the issues that are being raised in terms of honoring people in public spaces. Right now, what's the third thing raising a lot of money yeah? So you know navigating all those city agencies raising a lot of money. Those are those have been very challenging. Another question is the first task to identify the arts object prior to approaching the agency for approvals well, I'm, trying to think I. You know I think you have to have a strong vision because otherwise you're just going to be bounced around it does not hurt to do what it seems that you're doing I watched your zoom from last week that you have a discussion with the community about what ideas you know percolate to the surface and then also when you're having this discussion, you're going to find out, find the people that are highly motivated to support your project to everybody. It's not going to get exactly what they want. I hate to break the news to you, but as you as you start to work through these issues, you know people will see common ground and so to try and find that common ground before you go to the agencies- and you know be, but have a really clear vision, you might not have exactly the exact thing. That's going to end up on the exact space that you start out with, but otherwise I feel like they won't. Take you seriously. Okay, how large is your board? Twelve I do not know why we did not go with an odd number, because we ever had at I'd be a problem, but we have never had a tie so yeah and that's pretty big. It's a working board. You know there's a difference between, say some of these foundations or you know corporate corporations they have, they might not necessarily have a working board, they might have like an honorary board, they might have an advisory board, but we're a working board. We do the work and fortunately we have one person in particular who has made this her. This is this is her job and even though she's not paid, none of us are paid. So you need that you need that kind of dedication. People have different people have different parameters, so you know not. Everybody is going to be able to devote a lot of time to it. You have to recognize that this is a question and I think it's directed to you Brenda, but it might be to just all the panelists. What are we going to have to deal with beyond Central Park Conservancy for our project, since we have the Conservancy, since the current Conservancy has given their approval, what did they give their approval to yeah the idea? What did they approve Karen? We do not have any approval from Central Park Conservancy at this time. I could not imagine yeah, you need a proposal and they have been. They have been listening and they are. They have an open ear at this point, but yeah, you know a lots going to depend on what you come up to present come up with to present to them and the same with the public design. Commission I go back to what I said earlier, and that is the who you have to gain approval from is going to depend a lot on what your project looks like and because we were donating public art to the city. You know we had to get Landmarks Preservation public design, Commission, and so you might not have to do all that depending on what your final vision is. You know what it looks like okay, so another question is: did you incorporate in Delaware I? Do not think so. I did not incorporate us, so I'm pretty sure we're in New York State. Okay, are you planning to donate your marquee to a museum if so, which one or what Marquette? No oh, I'm Matt kept the maquette, which I did not know until I got involved. That's the little model of the of the monument I. Do not know what we're doing with that yet, but to figure that out I mean there's different sizes that Meredith has created. So you know it started little and it got bigger and you saw some of the giant things that she was sculpting there. That then became a mold and then the bronze gets poured into it, and then it gets all connected and patinaed and off it goes. So it's this very long involved process which fortunately Co Vyd. It slows us down, but we're going to still manage to get it done. Amazingly, even though the foundry was shut down and everything so the maquette I do not know. What's going to happen to the maquette. Yes, the maquettes, yet okay and the last question we have is I thought they I thought the Conservancy was in agreement and at the idea of a project was an agreement about the idea of a project, but just not a specific one, maybe Karen. Maybe people could benefit from just clarification on where the conservative Conservancy stands well, the Conservancy again police say they have a position at this point. We would have to bring something to them and as Brenda and expressed a proposal, so I think that they are open to what we what we have to bring to them, but we have to bring something to them, which we do not have at this point. So this is all exploratory right now, so that we can bring the abstract to the concrete and but I I'm, very optimistic about getting the project done and perhaps even in Central. Park I feel really good about that. Just being optimistic, but that's my personal thinking. We do not have any approval at this point, we'll try and help him. Thank you and you know our help. Seneca village people may have a different kind of help. That they can offer based on the fact that their project has evolved differently than then ours did so you know, once you can define what your you want, your project to look like, then, even the help that you can get from other people who've been involved in public art projects will vary because of the process. Like I said the process changes depending on what the project is defined, as I just wanted to say in terms of incorporation. Another organization which is excellent is the New York lawyers for the Public Interest, so they're great at albi, incorporation and legal assistance, there's a bunch of different groups and some of them run workshops for nonprofits that help you learn about how to get organized and then there's some other things. I've been seeing a lot of stuff online and it's free from and I've attended. A few of these you know attended by Zumba these things. So right now is the time to be looking around the internet for free workshops on to try and answer some of your questions. You know, because people can't meet in person a lot of organizations offering free stuff Yay. We like free another question, just popped: what does the Conservatives conservancy being open mean? Well, oh, is that for Karen I hope? Yes, what I can say that this project initiated at a community board meeting where we were voting on a resolution to support the renovate reconstruction of the new Alaska and the pole there, and so we, someone voiced the desire to have this, exhibit installed in Central Park, and it was kind of associated with the fact that Trump's name is on the side of the pool right now, but it's coming off so and he came up that we need to do something to commemorate the exonerated five, so Central Park Conservancy was at that meeting. They presented some information for the full board in order to for them to make the vote. So, as a result of that, we took it up in committee, Central Park Conservancy joined in on some of those meetings. They were there for other agenda items, but they were listening and they did express interest in what we were doing. So that's why I say they have been. They have been supportive, I would say, but they really can't take a position because you know, as Brenda said, there's a process that has to be going through. So hope that was clear. Someone is stating that volunteer lawyers of the Arts gives free workshops on the on profit, incorporation, so FYI out to everyone. Okay, different questions: okay, well, we'll just and Thank You Brenda. This was just I mean this meeting was invaluable up until this point, and one of our other questions was how do we get an exhibit installed in Central Park? If exhibits or monuments are only done posthumously so that that's going to be a hurdle to overcome so I just wanted to share a video Dolores Weis, the mother of Korey, wise to sort of evoke the emotion that is involved around the damage that is done to communities when, when we have this mass incarceration, we have people being taken away from their homes and just and not getting their education should be just so many traumas that people go through so I just like to share that video. Is that Yusef? Did you have any comment on that? Charan? No I'm, actually good can y' all hear me: okay, yes, okay, my computer seems like is acting very Wonk. Everybody's frozen audio is jacked up, I'm, not sure if it's mere nice raining over here, so it could be that it's just the location, Mm- Hmm Mr. Salam shrug. Would you have any comments on the videos? A very short video? Oh, not yet I do not have a comment on the video okay, the other one was fine, but with the people in the park and I did see a need to have more women and particularly more women of color, because but we're moving forward. We have three women, we have one of color, and so now we just have to throw more in the pot. Mm-, hmm, yeah and III think this video just speaks to how we make the case for why this does not need to be posthumous that the you know the that the exonerated father with us- and that is a statement in itself. That's a monument I'm saying this correctly. It's a monument to reach to the resiliency of the human will so moving. Could you just show us that the second video it's the one entitled 30 frames a second yes from the beginning? Yes- and this is a YouTube video people should be able to see and everyone here[ Applause]. We heard it all right. Take your time. You're right, that's, he was not fight, say they use of my husband come to his house. Never my husband said yes Venus and it was totally being courted. He had been invited to come, so we can squat you something[, Applause] and I'll, be his mom for a few hours by the heart before the machine is set up this table. Let's say my grease: keep it got hotter than he's still alive, cuz, a goodness immature, so I was grateful, but it do not. Ef is because they said. Could you know why this is justice[ Applause]? How great someone when it never used that my son was in violet? We never knew McRae son. He must only use them and you left with an invitation with you, sir. How could this happen? I'm sure it's raitis they would have sent, but you know what everybody needs to be up and grateful, because it was not my car that went to this to tell the truth: yeah, it was 13 years later he came and I thank God, but just working it out, let's go y' all beat them today. You see I can't can do this man, but there's no beat sitting on my mom. We all have come[ Applause] you that is really a very powerful and moving and disturbing video, and so when we are asked to contend with the issue of whether this monument can be installed because it's not being done posthumously, I think that we certainly can make the case for the devastation and the need for it to be in place now, because, as Yusuf said at the last discussion, this is not an anomaly, but rather a pattern, and this is it's time for it to end and I think that this is something that we can definitely make the case for that. This should not. We do not have to have a posthumous, but we need to have something done now to in order to and I just like to ask someone else who would like to just to add to that to speak, to speak to the making the case for it not being posthumous. Well, I do not think it needs to be posthumous, because so many of the family members have died already and from then listening to Brenda I get a feeling that we might many more of us might be gone before it's finished, but there needs to be a record of what happened and there needs to be some sort of living proof that it happened and pumped in such a way that it moves people, because we do not want people to walk by and see a statue there that does not vibrate in energy. That relates to the justice that we all feel that we all need and is all deserving in our community. So many statues that you see in the park and other places you bought by them every day and they're just a statue. They have no meaning. We want something that has meaning that can bring the emotional expression of what happened during that time into a reality, and when people see and feel this reality, it makes you move in a certain way and act in a certain way that you want to see change happen and become part of that change and in some ways you want to cry because it happened, because what she said, Dolores Weis was moving and in each one of the families that went through this experience. We all experienced it in different ways and we lived through it in what kind of ways we could. There was some of us who were preyas. There was some of us who were crying. That was some of us who was shouting out and so forth and so on, but it was thing that we did in a way together, blended within this energy that brought us together and made us stand hold in our defense of our children and of our families and in their protection. Nothing can be given back to us, but we can impact on our community and in Central Park a place where many of our children have gone to play and rest and talk and commune and do all kinds of things make it a reality for others, because the reality is. We really do not want this to happen again, but it has happened so many times and maybe if there is something that speaks to it, something that educates about it, something that educates about the community in general. These things would be less of happening with the interaction of the sculptors and the interaction of the learning experience, and we can move forward to understand what needs to happen for us to move forward. What needs to happen for us to come together. What needs to happen for us to be able to lay down the trauma of post-, traumatic, stress syndrome that penetrates within our communities and in the souls of many peoples of color throughout whether they have this experience or not. This is an identifying piece that says we were here and we made an impact and a change, and something happened to us, and this is what it was, and this is how you can learn forward. This is how you can move forward. I look forward to it. I look forward to it and one of those people from the Conservancy reached out to us and knit with us I, look forward to having more conversations with them and bringing this project to its flourishing. Hmm I would not want nobody to go through this I won't go through it. Myself. Hmm I would be crying now after hearing all of this- oh I'm, sorry, yes, I sure would. But each one of us was touched in many ways: I developed stage, 4 cancer and after the chemo I had cried anymore innocence. This has an effect or an effect on real people in real life in real time it affected us all. It still affects us if I could just say one thing: it's you know, I'm know I'm moved. So it's hard to say this, but you know you: your project does not just encompass five individuals that were wrongfully incarcerated. No, it does miss. Alumnus has said so clearly the impact goes so far out and it and some of those people are no longer with us as families and the friends and supporters one possible, and so it's not just people. You know not everybody's alive in a lot of ways. This is a posthumous project, mm- Hmm, for those people. The other thing is that there are other projects around the city. Recent projects that honor both living in and dead involved with the 9/11 Memorial- and you know we just unveiled the what's called the Glade, which is dedicated to people who have died, but also people who are still suffering from 9/11 related illnesses, and so those of us who are in that category is suffering from 9/11 related illnesses, we're not dead. Yet you know- and that is a very meaningful place for us, and we advocated for that. We did not want to have to wait till we died to have our service recognized, and so you know, I think you could use that as an analogy that there's a lot of teaching that goes on, even when the project is related to people who are still alive. Oh yes, most definitely I do not know if that will sway the Central Park Conservancy, but give it a shot. Oh, it's do not move them right out of here. I thought I thought you might speak to the posthumous requirement, because sometimes the requirements seem to shift yeah I've I connected with Parks about the posthumous requirement, and they say that in their in their history they said that they've only broken in once, and that was for a Diana, Ross playground. I mean that they firmly to the poem is requirement, but one thing: I did see that maybe worth exploring more I'm looking through some of their guidelines from parks and the public design Commission and trying to find where it said. Okay, the public design Commission discourages memorials for people places and events that have been recognized as significant for a period of less than twenty years. I have to ask: when was the Central Park five incident originally if the monument was to be if the monument was or whatever was erected, if it was to if it was to be linked to the event and not the people that maybe a way that you can get around the posthumous apartment, because you know the exonerated five or so living but I believe the Central Park Fire. That case happened in the 90s correct. It happened in nineteen, eighty, nine, eighty nine got it so yeah I think there may be a way to go about it if the, if, whatever the item is going to be, is more so linked to the event and not so much to the people. Well, I think that that's something that we need to and we have addressed it before. It comes up as an issue, so we can be prepared I just like to ask if there are any other questions or comments from the public. There are not any questions, but people are commenting in the chat and everyone should be able to see. What's in the chat, Cynthia's is saying the events and people are not usually exclusive when I think that's to the point I say it just raised, but okay there's a question that just popped up, I'm going to read it out because it's kind of long thank you. Sister, Salaam I think it's crucial that at every stage this of this that black people of color be involved from board members to jury members to artists to lawyers, as we must celebrate our qualified people in our community, and this should not duplicate the systemic racism that exists on every level. We must break the chains. I can't make out this word of the project, so it was more of a comment than a question. I. Think that just my commentary, we are trying to make this community outreach as diverse as possible. Central Park is utilized by groups from all over the city and I believe there are 22 million people that visit Central Park on a yearly basis. So this is not only a local issue is also national and global. So I think we need to keep that in mind as well, but yeah. There are no other questions or comments. Okay, I think that really kind of threw everybody for a loop. That was extremely moving and I'm. Sorry to me to start with people, but I think that we need to impress upon the decision makers how serious this is and how deeply it cuts into the community and how there's just a need for the social reform, the criminal justice reform and we need it now and there's a whole movement. There's a national movement, a global movement. That's going on now, you know, and me too, as Brenda said, we have the wind at our backs right now, so you know we need to use this opportunity to move this project forward. Are there any other comments or questions not from the public? All right, we did speak with the director of arts and antiquities at New, York City parks, and they did give us some guidelines for the that are provided by the public design. Commission I'm. Sorry Isaiah! Can you speak to that I apologize I'm, trying to do too much at one time? What are we talking about? I'm? Sorry, oh the conversation with them. The arts and antiquities division of New York City Parks. Specifically what about the art which agencies did they mention that we need to? You know that we would need to be involved in Brenda, did not mention this, but just to reiterate: okay, yeah the agencies and entities involved in erecting something in Central Park would be, of course, the parks, department, Central, Park Conservancy, the public design, Commission landmarks and preservation, I believe I, pretty sure those are the main ones there may be others. I know. Parks is very particular about any applications for works in Central Park, so there may be other entities within parks that are those like additional layers of scrutiny and bureaucracy that you'll have to go through, but I think those are the big four parks, the Conservancy public design and landmarks and preservation. Are there any questions or comments, not from attendees? No well, I think that we made the ending a little early. There are no questions or comments. Actually, Terrance Terry just asked one in the general chat, as would you like me to read it out? Oh, yes, please sure, as people of color the city budget for businesses is forty is forty. Three billion do tease, I'm sorry I'm having a hard time making this up do tease business of color received and at point zero. Three percent of what city budget do in this project. We must be mindful of the systemic racism, which is what helped to arrest the Central Park exonerated five. Lest we not forget, the tables are unbalanced, so I think it's similar to the one of the prior comments about ensuring that it's not just people of color, but specifically black lawyers, sculptors and it can. You know, contractors are the ones who are most involved in this project. If I'm interpreting this correctly. Anyone want to comment on Terry's statement. I know I'm very much interested in having people of color brought to the table as well, but I would imagine a lot is going to depend on the jury process so who's, putting their information in who jumps in once the proposal, a request for artists and others comes out who really wants to be involved? Who fulfills the concept, because when you look at this situation in terms of the Central Park five to the exonerated five, it's a piece of history that can be traced through the history of the United States of America. This is not a happening that has only happened, or here it is happened in so many places throughout the United States. It's a long story and in many cases it's a long story. That's gone underground because nobody speaks about it. Nobody learns about it and soon it's all forgotten. But with this we have an opportunity to say yes, this happened. We have an opportunity to speak about it and we have an opportunity to under analyze it and to move forward from it. It's almost like looking at the issue of racism, and you say well: what is racism and people give you what their definition is for the other person to be the racism person, and when you talk about it, not one of them is over the racist and not one of them is inviting racism, but here you have something that you can show what it is, and you can talk about what this is. What this particular system is what you talk about injustice. This is how injustice looks now. We must not forget it. How can we make it so that injustice does not happen anymore? We can slow it down. We can stop it. How do we get that conversation moving, so we moved to a point where we are on the heels of justice. You know, I was looking at the news earlier and they said they had arrested three people who had in the drive- by shooting of the father that was shot I, believe in Brooklyn when he turned his back and he was killed with someone putting a gun out of the car and just firing and killing him. I would not say at random because it was a deliberate situation and after something like this happens to you sit down and you say: wow you're glad they caught somebody, but your hope is the right one. Your hope is not another Central Park five, in this case a Brooklyn three or whatever you hope. It's the right people you're always questioning. Are they the right people? How do we get to that point in our discussion of what is happening in our society today, where we are comfortable, knowing that we have the right people and that's what this exhibit is all about? The injustice was done. The injustice was righted and now we're moving on. How are we moving on? Are we moving on in a way where changes are made to impact a system that will improve from what has happened years ago, because actually, this happened is over 30 years it's over 30 years. This happened when this happened. My son was just 15 years old. I do not want to say how old he is now because I do not want you all to know how old I am, but it was not. Yesterday and it's still a memory and I'm still hoping like ID wise was able to say you know she forgives all those people and the reality is some days I, forgive them some days. I do not I'm not as forgiving as she but I'm working towards forgiveness, just like those people who are working not to be racist, who do not see any racism in them and in their actions, but it's a happening that goes on. That's not discussed, and maybe, if we started does it we could get beyond it to the other side and see a new beginning on one side that does not encompass us in this space, where we are going back and forward air for so many years, every so many years. There's another group of people that are caught up in this trap. We need to move forward and get beyond it and the only way we're going to do. That is if we acknowledge it, we talk about it, analyze it and move on. Otherwise, we're going to live it over and over again over and over and I do not want to be back here with the over I want to go on. Well, thank you for that powerful words and Mrs. Salaam I do not know I'm just kind of this just so moving so I. You know if this is. There is a case to be made and we have had some suggestions as to how that particular hurdle can be circumvented. So you know in terms of the posthumous recognition I just like to say that this evening has been a very powerful discourse, there's a Brenda shared so much with us in terms of the process of the monumental women and how we can begin to apply that to our to this project and our next. Yes, there are two more questions that Park, okay, alright I just want to say our next panel just discussion will deal with implementation so that we can go to the questions now. Okay, one is a comment and then a question I had some trouble. Locating the zoom link for this meeting finally went on to the community board 10 Facebook page is that where I should go for the weekly meeting link for next week's meeting, if it was on there this week, it should be on for next week. We will I'll just make a request that be the case, if just to make sure that it's available okay, another question and comments duo is I'm optimistic about getting this through and having the Memorial in Central. Park. However, is there a plan for placing the monument in an alternative location? Should our goals be denied youssef? Would you like to I'm sorry for me? I have not thought of an alternative situation because we live right here in the park. We are our kids played in the park. The incident occurred in the park. I think that the that whole thing about the park speaks volumes, but we must keep our options open, because maybe there is a mindset out there that would like to have a some other place so that the park could be cleansed of its association to what happened in the park at 1869. I'll. Excuse me 1989, see I'm going all the way back to bring in some more issues that were around and happening during that time. Mm- hmm I told you this I was not. This was not the only one, but we open to all types of suggestions is what I'm trying to, although to take this downstairs a downtown and put it in Washington, Square Park, where the incident did not occur would be different, but at least it would be in place and I do not know what it would do to heighten the expression of the Central Park Center Clark says now: people have to go all the way downtown to see it. I do not know. What do you think you said? I definitely think that it should be in Central, Park, I, think that the impact for that would be would be the reasoning why, as you're saying to in terms of this, you know we do not want to in the words of Dr. Angela Davis, be the people who have historical amnesia, because we have not socialized ourselves, I've been socializing correctly, you know, and so this is a this is a great opportunity now I think also to plant the seed of the dream right, as opposed to the seed of the nightmare right. We've all been awakened to the American Nightmare, but that dream that Dr. King spoke about so eloquently. You know really was also a seed that should have been planted in the hearts of the people so that, as they begin to grow up in their futures and participate in what the dream could be. This right here becomes a part of that. This becomes that piece where, as we're looking to make sure that we, on the heels of justice, seek out people that are going to be true to what justice is about, not just rounding up any like in our case, any Negro could have done. You know so much so that people begin to spew out all kinds of hatred on their platforms right. They had social media platforms back then like Pat Buchanan, on the hills of what Donald Trump did but Pat Buchanan and then wrote in the papers that Cori wise should be hung in a tree or from a tree in Central Park, and that we are the others of us should be horsewhipped, and he said that this should happen by June 1st 1989 mind you, Donald Trump's ad ran two weeks after we were accused. So it was a sign, sealed and delivered and deliberate in justice that they had hoped would never get any light of day and I. Think when you look at what would miss wise has said, I think when you look at and listen to what my mom is saying when you think about the ancestors through Linda McCrae, through Bobbie McCrae, all right, Antron lost both his family, both his mother and father. You know Cory lost his father, you know I mean you look at all that stuff and I. Think the important part is that we need to begin the healing on a corner on a citywide level, because it can't be individual. Some of us have been able to work it out to try to put one foot in front of the other and throw the history of what we've come through behind our backs, but that history is still there and that history shows his head every once in a while, and so for this to go forward in a way that's meaningful. I say the important part is to put it in Central Park and the reason why it's important for it to go in Central Park is because it would be a disservice for it to go in a history book. It would be a disservice for it to be. You know somewhere that people are, you know, can't make any connection with it, but the fact that people visit the park, the fact the fact that people you know it in my own travels I just want to say this part. The my own travels I would go sometimes in front of audiences and before we were known as The Exonerated, five I remember, sometimes I'll be in front of high- school students, sometimes in front of junior high school students and the people. Bringing me in would say: hey we got a member of the Central Park five here and because history is the best teacher, but they also mislead us. Some of those young individuals said. Are you a member of a rap group? The connection had been lost, and so now is a great time to fix that. You know and I think that these meetings that we're having speaks to that it talks about the truth and the justice of it all, but it also revisits the pain, as you saw my mother speak about and this why I speak about? These are very real things that we've all dealt with. You know the whole family is going through hell, the whole family has gone through hell. You know nobody left anybody behind. They were going through lock, step and key with their loved ones. While we were going through that hell, you know and I would always say in many ways the hell that the families were going through on the outside might have been worse because they had to deal with society, and still it's almost like what with what our good friend, James Baldwin said, he said to be a person of color and relatively conscious is to be in a state of rage, all the time, I think mom. My mom said to me once she said when we think about what we've gone through and she's, something like the whole I think you were talking about. The whole thing not just be the case, but the whole experience of what it is to be in America and how we got here. Many of us the whole transatlantic slave trade, the fact that Jim Crow has gone on by another name, the fact that they're still oppression the fact that there was redlining the fact that there's projects and experiments and all of that stuff I think you said Ma- is a one that any one of us are still saying and I. Think part of this project went with the with the beauty of this project speaks about. Is the marathon that Nipsey Hussle talked about and alluded to as well, but the marathon has to continue and in this in this project in this monument is the seed of Hope is the seed of change, and all we got to do is water it but better place to water it in a place called Center Park. One more question: yeah there is a there is another question: would Cynthia be open to tying the permanent Seneca Village project to The Exonerated 5, basically weaving a thread from Dental now I guess there'd be difficult to answer, given that Cynthia is currently joining this meeting as an attendee? Well, I, guess: that's a question we can pose to Cynthia and come back with an answer on well I just like to say this has been a powerful discussion, a well needed one and I think it's been extremely informative and we're coming to the end of this panel discussion. We have one more which is open to the public and will be held next Thursday from 6:30 to 8:30. So we welcome everyone to come back and join us. We try to get the message out of it as quickly as we possibly can that the zoom link out as quickly as we possibly can so with that I'd just like to say thank you to all of our panelists and to Ruben for providing this your excellent technical support and just to and again I just I'm, just so overwhelmed by the The Exonerated 5 by the Salam family. Thank you so much for what you do and what you would you continue to do: choices the movement towards social justice and reform. So again, we hope to see everyone next Thursday evening, it's from 6:30 to 8:00, where we will continue this discussion. Well, how we can help? Thank you so much for inviting me tonight. It's been very powerful. Yes, thanks for inviting us all! Yes, thank you. Thank you. Well with that same time, next week alright see well, they will. Thank you. I'll, take care of that. Oh good night. Everyone did.",
            "summary": "She is with the justice for the wrongful wrongfully incarcerated and we have Isaiah, who is the borough director from Manhattan with the mayor's office, and we have Reuben our technician, who's, fun, So we'd like to first open up with, and the objective of this evenings discussion is on around development and funding for the exhibit or permanent, whatever that the permanency of the of the commemoration develops into So. If you could just explain to us the process that the monumental women organization went through for the women's suffrage, monument, which is opening I'm, really glad to be meeting with this group, because when we started our process or really was not anyone around to give us a whole lot of guidance for our project because they, the last time a statue was put into Central Park prior to the approval of our monument was 40 years, ago.\nIf I can do this next thing here, so our key objectives were to pay tribute to truth, Stanton and Anthony, as women's rights pioneers break, and we are breaking the bronze ceiling here by putting the first statue of real women in Central Park's 167 year, history into the park, and we will be dedicating it.\nOur ceremony is going to be largely for virtual, and then you go down to the next part in it, and we talk about our ongoing educational campaign about women's rights that we are sharing in New, York, City and acrosss.\nWe were received approval from the parks Department when we first started this process, seven years, ago, kind of by happenstance one of the women who is now that one of the early board, members of our organization, Colleen jenkins, ran into Mitchell silver at a event and said you realize that there are no statues of real women in Central Park and he said what Now we had to raise entirely private funds and one of the things that we had to assure Central Park.\nLater, we've been working with the parks and the Central Park Conservancy, but they're, not the only group within the city that you're going to be working with to gain approval for your project and a lot of how you gain approval for your project, which groups you have to gain that approval from Karen's, where a lot of the stuff working with Community, Board 10 depends on what you end.\nIf you have a monument you're going to have one set of city agencies that you're going to have to deal with, if you're putting up like Cynthia Copeland talked last week about the Seneca Village educational temporary, exhibit that's in the park right now and that that's a different set of agencies that you might have to approach.\nThis is just a list of some of the ways that both all three truths, Stanton and Anthony- were all connected to New, York City, and then we had to show that they were connected to the park as well, and this is our budget funds for all these different things.\nCentral Park is the hardest place, I believe in New York City to put up any kind of a monument or exhibit you know, even an exhibit, and that's our board of directors.\nCentral, Park's, very picky, about what kinds of signs you can put up, and so we wanted to use technology to educate the public about the lives of these three women and the suffrage movement in general were unveiling it on 100th anniversary of women, winning the right to vote with the night.\nYou know for the monument, so that's part of our education, campaign York City schoolchildren are going to be able to access us How long.\nWe have no paid staff and you need people that are passionate about this project and they are going to persist no matter what I do not think that you're going to have trouble finding those people for your group You may have the wind at your back right now, And, it's just impossible to predict really what kinds of things the park will be interested.\nI'm being told that people can't hear the video is that correct, What would be needed to organize and implement an artist selection process, so the best way is to find an arts organization or a firm, Monument stuff and historical preservation In terms of you know the process and how to walk it through the various city.\nI am the sculptor of the women's rights pioneers monument for Central, Park, today, I'm, working on hands This began over six years ago with a group called monumental women that formed to shame English, the lack of representation of women in public statuary and monuments, and they petitioned the city to give them a site.\nIn Central Park for statues of women's rights pioneers the women depicted in the monument are Sojourner Truth Susan B Anthony, an Elizabeth Cady Stanton.\nIt actually became law that women could vote and it'll be right in the park on the site on the Central Park Mall, where the statue will go But I've lived in New York City for over 40 years, I love.\nWhen you have a concept, and now you go before city agencies and their ideas may not align completely with you with your with yours, Artists I speak as somebody who makes art myself, not sculpture, but other things, and you know, artists really do not like people telling them what to do.\nEven things in Central Park, like tree roots I mean if you want to pick the hardest place in the city, to put up a monument or a display of any kind.\nYour project explains the needs explains in a way that is going to draw people into wanting to support your you know.\nYou know we wanted to have a very diverse group of people who were involved in this project to get different.\nOne is to on to put the first statue of real women into Central Park and then the second thing is to do this education campaign around women's history, and the third thing is to you within the city of New York and then also to challenge municipalities to honor, more women and people of color in their public spaces.\nThe advantage of that was had a lot fewer problems with the actual construction that we would have to have done, but it had a lot more restrictions because of where it was in the park in terms of what kind of a look they wanted for the monument we you know, we've evolved as an organization, also along with every along with a lot of people in terms of what do we do to not only take statues down but to try and have discussions around the history behind these people, and so we've been.\nWe've been working on our education campaign to be more to address those issues of the time that we are in now, We're at very different times as statute people than we were seven years ago, and so you know, we've had to evolve with the rest of the country on trying to address all the issues that are being raised in terms of honoring people in public spaces.\nAre we going to have to deal with beyond Central Park Conservancy for our project, Did they approve Karen?\nCommission I go back to what I said earlier, and that is the who you have to gain approval from is going to depend a lot on what your project looks like and because we were donating public art to the city.\nI've been seeing a lot of stuff online You know, because people can't meet in person a lot of organizations offering free stuff, Yay. We like free another question, just popped: What does the Conservatives conservancy being open What I can say that this project initiated at a community board meeting where we were voting on a resolution to support the renovate reconstruction of the new Alaska and the pole, there, and so we?\nI have to ask: When was the Central Park five incident originally, if the monument was to be if the monument was or whatever was erected, if it was to if it was to be linked to the event and not the people that maybe a way that you can get around the posthumous apartment, because you know the exonerated five or so living I think there may be a way to go about it if the, if, whatever the item is going to be, is more so linked to the event and not so much to the people.\nI know I'm very much interested in having people of color brought to the table as well, but Who fulfills the concept, because when you look at this situation in terms of the Central Park five to the exonerated five, it's a piece of history that can be traced through the history of the United States of America."
        }
    }
}