{
    "data": {
        "YoutubeMetadata": {
            "author": "BCB8",
            "channelId": "https://www.youtube.com/channel/UCf_u5jxmnZhv3DaNswhPoVA",
            "title": "Brooklyn Community Board 8 Live Stream",
            "publishDate": "2020-09-10",
            "shortDescription": "",
            "lengthSeconds": "2:01:57"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BCB8",
            "normalizedName": "Brooklyn Community Board 8",
            "twitterName": null,
            "youtubeChannelName": "Brooklyn Community Board 8",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCPsRKFds5RmAx05fqHLE66g",
            "twitterHandle": null,
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "FcOgBPCKIPo",
            "fillerWordCount": {
                "uh": 182,
                "um": 367
            },
            "readTimeFullTranscript": "61 min read",
            "readTimeSummary": "7 min read",
            "wordCountFullTranscript": {
                "census": 33,
                "chat": 30,
                "information": 26,
                "ballot": 23,
                "state": 20,
                "elections": 16,
                "person": 16,
                "address": 15,
                "seniors": 13,
                "chairs": 13
            },
            "wordCountSummary": {
                "state": 11,
                "elections": 8,
                "census": 6,
                "voting": 5,
                "legislature": 4,
                "ballots": 4,
                "ballot": 4,
                "mail": 4,
                "laws": 3,
                "28th": 3
            },
            "fullTranscript": "The meeting and we could see it starts at 6:30, so we got 10 minutes 6:30, okay, yeah! We got a little bit of time. Thank you for clarifying that yeah. I just put six 6:15 for board members. Okay, so James Ellis. I can't make James Ellis a panelist. I do not know he did not light up. I can't make James a panelist. I can't make Matthew pitts a panelist when he's here he can speak Matthew. Can you hear us can't make Miss Jordan Matthew? Can you hear us? Okay? I can make James a family matthew. Maybe he could text. Maybe he could use the chat to get to okay. He just[ _ _] up, maybe he'll log back on yeah. You think you go. Yay is Jennifer Jordan Miss Jordan. What happened that would be that would be for Sarah Zima Jennifer Jordan. Okay, I can't I can't. Can you call them and tell them to log out and log back in sure we're going to get started in 10 minutes got 24 people on okay. There we go. I just heard a news report this evening that the new form of Graffiti- that's supporting all of these shootings is social media. The gangs go online and they write songs and perform songs, taunting each other, and then they run out and shoot each other so that this is. This is the new Graffiti okay Foreign, oh Sarah Lazar. How was your outreach to the tenant? Who was having a problem with the roommate? Oh gosh, so it's kind of not it's kind of bad, his neighbors who were concerned about him. They saw him leave the building and he has not come back and they do not know. What's happened, probably some place safer. I hope so it's it. I just call you after the last meeting I left a message I did not hear back, so I just thought I'd bring that up. Oh okay, I'm sorry. I've been getting a lot of message for some reason. It was not telling me that it was you, even though your phone number is in my phone, so yeah, okay, so the advice I got from Miss Granville was that you get a better response. If you talk to the NCO for the address at issue- oh ncl from the police department, correct hello, Ms, young, hello, everybody, hello- did I say hello. Can you all hear me hello? Yes, oh my computer holding a charge. Why? So we are up to 27 people, which is good and it's 6 24. I'd like to open the meeting, okay and welcome everyone. Thank you all for coming calling this meeting to order now and we'll have a roll call. If we have the role available to the interim secretary Mr Robert Witherwax, would you proceed with the vote? All right hold on this program is opening okay. So, while he's pulling up the webex to open, I see Mr Ellis. How are you Mr Ellis thumbs up? We have shared the minutes from the Festival Board meeting in June. Are there any here's Mr wither Wax? Let's do the roll call right here, many allison, oh, and just as we go through this I'm going to go through an alphabetical order of your last name. Please mute because I won't be watching the screen to unmute and say present when I get to your name. Allison President President Desmond Atkins Lisa Atkinson, here Wayne Bailey, Princess, Ben, James, Julia, Boyd, Dale, Branch, Muhammad, John, Buckholz, Robert, Callahan, Angie, Charles, Helen, Coley, Norman, Daniel, James, Ellis, President, Kevin, Farley, Andrea Ferris. I'm sorry was that a yes or miss Ferris, yes, drew Gabriel Johnny Granville she's on. I saw her she's on yeah. I have Miss Granville. I Jeannie Harris Glenman Marva Henry President Zerzima Jordan Virginia, Kinsey, Sarah, Laszer, present Calvis mickelsteins present Roberta Meredith, Staton, Karmisha, Superville, Audrey, Tate, Hall, Mark, thirteen Greg, Todd Okay Mark Thurton is awesome. Mark is here. Thank you. Mr Thurman, Mr Todd, yes, Mr Todd is here: Tyus President, Mr, Bocconi, President, eves, Villas, Kimberly, Watson, Irisa, Weatherspoon present, I'm sorry Rob yeah! This has been James is on. Thank you. Sharon Wetterburn president with the Wax President Debra, Young, President, Velma Zuniga, add princess. We have oh did you hear drew babrow's on as well. He was on I'm just going to Norah Daniel Miss Daniel, one Moment Miss Daniel. Thank you. Mr Gabriel Angie Charles's present Miss Charles. Thank you just looking at the list of names. Nobody else. I have not got all right. We're still a few short we'll give people time. Okay, we have 33 count on the call and based on your account of 22 okay. So from my past two or three months of watching CBS news in the mornings from six to nine, I have to suggest that we talk slower and wait. What is it 20 seconds to hear the response from the people we are communicating with? So we do not have that collision of responses where we think we might have missed something, but we did not so it may be counterintuitive. But if we slow down a little bit, it'll make the communications a little bit clearer, Miss George. We have minutes that went out from our last full board meeting in June, yes and also listed on our website. Are there any comments from members on those minutes? Corrections not that I recall receiving at the office now? Thank you. Excuse me. I'm sorry go ahead! I'm sorry! I just wanted to note that Kim Robinson from Council member alika, Ampy Samuel, is present excellent. Thank you. We also have Darryl white from the New York State Attorney General's office on and two additional board members Kevin Farley and Gail Branson Muhammad, Excellent, okay, so we're up to 24 and we'll call those names again that is a quorum. We have 47 members, okay, we're good, yes, Mr Gabriel you're counted. Thank you so much. Thank you! Alrighty, okay! So moving down the agenda, everyone's had a chance to look at the minutes. We have not received any comments or corrections. I ask for a motion to accept the minute says if this is presented so moved. Second, who was that a second who was that I came here that was bocconi? I think I ate the motion. Mr saunders seconded okay, and shall we take a vote on that? No thank you appreciate it all right. Moving on, we would we'll come back to the census. Count, that's very important, and since we do not have ms warrell with us at this point in time, I do not think from the census. No, we have Matthew Pitts, though okay, so Mr Pitt. Do you want to make your presentation? Do you need to use to show your screen? Yes, I like to make my presentation- and yes I'd like to share my screen. Okay, so I am going to give you the ball Matthew one second Mr P, who are you with now? Who are you working with on this campaign? Finance board? I'm sorry speak a little louder. Oh sorry, Campaign Finance, Board Matthew! You can share your screen. Okay, can everyone say? Yes, okay, all right, so my name is Matthew Kidd, as most of you already know, I'm with the New York City campaign, Finance Board, specifically with the voter engagement arm. That's also known as NYC votes, NYC votes, which I said was the voter engagement arm is the non- partisan initiative. That's spearheaded by the New York City campaign, Finance Board, and what we do is we more or less. We engage and inform new yorkers about elections and voting in New York City. I was invited by Community Board, eight just to go over a few things, most importantly registering to vote updates to election and voting laws that have just been passed recently and also mail- in voting as well as a few other things that are also voting related during this time. So for those who are not registered to vote here on the screen, you'll see the requirements for anyone who would like to register to vote requirements are very simple. Just you know, you have to be a U.S citizen to register to vote in New York state. You have to be 18 years of age or older to register, to vote and vote if you're, six, if you know someone who is 16 or 17 years old, they can pre- register to vote. All they have to do is just fill out. The same voter registration form that everyone else fills out once it's being sent to the board of elections, it'll be placed on a pending list, and once that person turns 18, they will be a fully registered voter. Additionally, you also have to have a mailing address. The board of elections mails out post site locations as well as absentee ballots and absentee ballot applications to folks as well. So that's very important that you must have, and additionally, if you've had any changes to your address, your name or you want to change your political party. You could do the same thing as well, with the form there's roughly two ways you can register to vote in New York state. You can do it via paper application or it can be done online at with the dmv. You have to be a customer of the dmv in order to register to vote online using their portal. Additionally, oh I'm sorry, yes, you're, correct, Julia folks who are homeless can register to vote. They just need to make sure that they have an address, a mailing address and also a place where they can stay, whether that's a shelter. I've also seen a school address, being used family member's home, so on and so forth. When it comes to registering the vote. As I said, there are two different ways to do it: paper, application or online. The New York state legislature has just passed the law that also now requires certain state agencies to also automatically register people to vote as well, and if you know someone who is not registered to vote, please let them know that they have to register to vote by October 9th in order to be eligible to vote in November. Now, as I said before, there's been a whole suite of legislation that was passed and the three that I'm going to mention are pretty much the most important as it directly relates to the 2020 election. So right now, voters can request an absentee ballot due to risk of illness. Of course, as you know, we're still, the pandemic is still ongoing and this will allow people to obtain a mail- in ballot. Additionally, you can also request a mail- in ballot, and it will come to you immediately instead of 30 days before an election prior to this 32 days before an election. The board of elections will send out ballots to folks who put in an absentee request, that's only because by that time they should already know who will be on the ballot on the state. Legislature has relaxed that requirement also ballots that are, or rather I should say, there's a new legislation that allows ballots to be counted in postmarked on or before election day, November third and received by the board of elections, seven days after the elections with or without a postmark. That was a very contentious issue that occurred during the last election as well, but the board of elections will count it if it is received in the seven days that came after the election, so by November 10th. If they have received it, they will count it now. For folks who are a bit more curious about absent city voting, remember you can always. You know, fill out an application this time, it's now been made easy there. You can do it online at www.nycabsentee.com. You know just make sure that you check the box for temporary illness on the application and starting, I believe yesterday for folks who did not make the request. It can also now be tracked on the board of a lecture. The website and just to remind you all October 27th, is the deadline to request an absentee ballot by mail. Now, once you put in the request, we always ask voters to check your mailbox frequently for the ballot. You never really know when it's going to come. Unfortunately, they do not track it. When it's going when it's going to you, however, once you do receive it, please follow the instructions carefully. Please make sure to fill it out with a blue or black ink pen. The instructions are very serious. If you deviate from the instructions, they have a tendency to throw out your ballot or invalidate. So, please follow the instructions very carefully. They say fill it out in blue or black ink. Please do that make sure it's mailed back in the posted page paid Envelope it came with and additionally, please make sure to sign the back of the envelope as instructed, and if you are going to send it back in the mail, please make sure you do it by November 2nd and that's it any questions. I have a question. Sorry, let me try to okay, so we're back to yeah. I have a question. I've heard mixed things about taking in the mallet mail- in ballots, for maybe the elderly, you know who might not be able to take it in and with people's concerns around the mail. So I wanted to know what is the ruling around that? Can you take someone else's seal after they've, completed and sealed the envelope and take it down to the board of elections? Or can you not do that? That's a question we've posed to the board of elections ourselves and quite honestly, we've got some mixed responses to that. It seems as if they're not too sure as well on their end on whether or not that's okay. If that is the case, I would suggest that you there is a provision for emergency balance. In the case where you know you do have folks who are in the hospital and can not turn in a ballot. So what some hospital workers or some nurses do, is they when we also tell them that they should also have the person write down on a piece of paper that the person who's turning in the ballot is a representative of that person and also have that person's the voter sign it as well just to make sure everything is good? I am really familiar with that process. I guess I'm concerned about those who want to vote and want to make sure that their voters can't counted but can not get out and how we can be up helpful to the handicapped and elderly in the community with making sure that their ballot is in. So maybe that's something that could be pushed a little further to get a answer for those in the community who want to be helpful, just a thought. Okay, thank you hi. This is Tara Lazar. I had a question, I put it in the chat as well, but I had heard from some people that part of the that part of the issues with the primary election and that postmarking issue was some confusion about whether post offices needed to place whether they needed to postmark these ballots, because there were a lot of ballots. That did indeed go through the post office in order to arrive at the destination, but they did not have post marks, and I think there might have been some confusion at the post office about what they were supposed to how they were supposed to handle. These ballots has: has the board of elections maybe reached out to the post office, or am I am? I did I mishear what the issue was back then that was part of the issue I as to whether or not the board of elections actually spoke with the Post office. I do not know, I'm not sure the state legislature has asked the Post office to come in for a hearing to explain some of the issues, but of course they declined. So the state legislature, as I mentioned earlier, passed a provision to sort of relax that problem when it comes to posted postage, page envelopes, because that was the real issue like some folks were they got it? They got the envelope, but they were not sure if they had to put the postage on it or not. So it sort of like just became this huge issue that sort of spiraled out of control, so hopefully with the new laws passed by the state legislature. It somewhat you know, addresses the problem, but oh hopefully it does, but we won't know until November. Unfortunately, oh boy, okay, thank you. Mr Ellis had a question: hey Matt good, to see you again, it's been a bit question about the announcement of the barclays center being a polling location. I do not know if you have much information about that, but is that going to be a general polling location or is that going to be specific to our community districts and those that are voting nearby? As far as I've heard? That is supposed to be a general poll site, and that's all that we've heard. I do know that the folks at the working with the Brooklyn nets are working outside of that to make sure that they, you know, engage with voters in any kind of way possible. But for now, as far as I know, Barclay Center is a general pulsar. It's just a general location, I'm going to ask everyone to put all of their questions in the chat, because we have someone that was just completely skipped over. So if you could do that would be greatly appreciated. Stephanie Zimmerman, all right, you're, so wonderful to me before you get sorry. So just a couple other points on that I mean there's a Q&A section, there's a chat section and there's also the raise your hand function. So if you want to clarify which way you would like for people to put in their questions, in which section that way, you're able to follow along the chat section. Thank you any of the questions. I have a question in the chat. Okay, so right now, Stephanie Zinnerman has asked. If you are the proxy for the person, you can turn it in on their behalf. So that's something she mentioned on the bottom of the absentee ballot application. They can designate a proxy who will be authorized to turn in their ballot. That's right! Yeah! Okay, are we going down the list? You said you had a question. Yeah I put it in the chat. Then we go back. Is there? Are I heard on the news that there would be drop boxes at the polling places to receive mail- in ballots? Is that accurate I've heard the same thing too? Okay, that's all I can say. Okay when I voted in the primary, I use the mailing ballot and I wrote it back a couple of weeks later and asked. If it had been received. I never got anything back. Should I expect to ever get anything back? Can you repeat that to confirm that my mailing ballot was received, do not expect to so prior to them instituting a agency ballot tracking system. The only way you knew that they had your ballot is. If you made a mistake on the ballot they'll, send you back a letter saying you made a mistake. We could not count. You did not count. Your vote. That was the only way to do it. That's something good yeah, so you did not make a mistake, or at least you thought you did not make a mistake and you did not hear back from them. Then you assumed that they had your ballot okay. Lastly, I would like to, though you're taking on President Trump's request to have or suggested everybody vote twice. Please do not do that is illegal. Thank you. Okay, Mr Pitt. We have a question from Gail. Mohammed has the mail- in ballot signature on the envelope been highlighted, signature been highlighted. Yes, oh you mean, like the actual box itself, where it says to sign. Is that like visible? Yes, thank you. Anyone have any more questions. I do not see any questions registered. Well. If we do not have any more questions, I have to thank Mr Pitt for bringing this information forward. Do you have a website address? You could share in the chat for people to get any additional information or to get other information to get a re- information. You know deeper explanation of what you've explained this evening yep. I will put it into that right now. Okay, thank you! So much, and I we really appreciate you doing this. It's very important for people to exercise the vote, so I hope everyone here will tell their neighbors and their voting age children relatives to do that thanks again and hope to see you at our next meeting or regular meetings. Come on back, okay, we'll move on to miss shelly Warrell from the Census Bureau. I believe she's going to give us an update on Census 2020. hi everyone. Can you hear me I can hear you perfect. I had called in earlier from a phone, and I was trying to check in I've, been on the call since 6:15, so I just wanted to make sure that everyone was able to hear me clearly. So thank you so much to Michelle and Community Board 8 for inviting us. We are literally just a few weeks out from wrapping up the entire operation. So I just wanted to start with the metrics. I wanted to start with the numbers of where we are and just give you a snapshot of not only Brooklyn but New York, City, New, York, State and national. So I'll start with the national numbers. As of yesterday, we were at 65 percent. New York state was at 62 percent New York City is at 62 percent in Brooklyn. I am really sad to report as someone who is a Brooklyn native, I was born, raised and still reside in Brooklyn and we're at 55 percent, so it's very low compared to the rest of the city as well as the state and the country. The last date to complete the census is September 30th. The timeline was moved forward a few months ago, and I just want to remind everyone of why the census is important number one. It determines the number of seats in the House of Representatives. It defines congressional and state legislative districts, school districts and voting precincts. So we just had a presentation on voting, so the two most important things I think, as persons residing in the United States, can do right now our vote and do their census. The great the difference, the big difference about the census and voting is you: do not have to be a Us citizen to complete your census and in fact the census is an exercise of counting every living person in the United States, regardless of their immigrant status. And of course, we, you may remember from previous presentations that I made that the census there are two populations that are amongst the the most under counted number one are children under the age of five, so we think about our schools not having the appropriate resources. It's often because those children were not counted and the second most undercounted community is black men 18 to 29, and that includes african- american Afro-, Caribbean, afro-, latino and african, so very important to just understand how critically important it is to count everyone in your household, regardless of their immigrant status. And this is unlike the election, you do not have to be a United, States, Citizen and, of course, we're not only counting people that are 18 and above we're counting everyone. It also determines the allocation of hundreds of billions of dollars in federal funding. There are critical programs, especially in times like now, we're in the middle of a pandemic. Medicaid Snap, section, 8 housing, special Ed, Grants, Title, 1 grant so title 1 grants are our schools. Our parks are funded by that National School, Lunch program, wic head start foster care and health care programs, as well as senior programs as well. I do not want to leave out the the seniors, but then, of course, it provides insights to government business and community planning groups for planning purposes and then the other thing it does. It provides benchmarks for all of the other surveys that we conduct, including the census of small businesses, and there are a number of other surveys that we conduct when we're not doing the decennial. The other thing to know is that the census is easy, safe and important. We have been very actively engaged in mobile units around the entire country. So yesterday I was at one at the Flatbush notion junction, where we were on site enumerating the community. So if you all know of any sites that are highly trafficked, like the flapless junction, like Barclay Center, a community center mobile food units or pantries and those kinds of things, please feel free to reach out to me, I can drop my email again in the chat and we can actually send census staff there. We most of us, I would say, 99 of census. Employees, including myself, are wrapping up on September 25th. So you have us from now until then so that people, especially in immigrant communities, hard to count communities, we're not collecting this data to track people right, it's really more. How can we allocate the appropriate resources in the community? Another thing that I talk about very often in my presentations- I've been doing this for two years now is that the census has been conducted every 10 years since 1790. So when you put it in historical context, then I think that it starts to sort of like break down the barriers a bit, because a lot of people are. You know really concerned about us sharing information with other government agencies or courts and we're not that's really not what the exercise is about and we, as census employees everyone from the enumerators up until the most senior person. We are all sworn to oath for life, so in violating that we'll be subject to either prison sentence and or a very hefty five fine of two hundred and fifty thousand dollars, I did earlier drop the the url in the chat. So it's my twenty Census.Gov, please everyone share with your neighbors on your social media. Your newsletter is just far and wide. We just need everyone to know that they can respond in four ways online by phone paper, or I mean, of course, the last resort and we're in that operation. Right now is that you may, if you do not complete your form, then you'll receive a visit from a Census bureau employee we're not asking for social security numbers we're not asking for money. This is also a nonpartisan operation, so this has nothing to do with politics or the election, and we also do not ask for any financial institution information. So I am going to leave it there, but I'm here. If anyone has any questions, I have a question: if that's all right, yeah for sure yeah I'm. So I'm aware that census takers, you know, are not allowed to divulge information. To you know to government agencies, Et cetera, so, for example, being undocumented does not have to be a concern. I was wondering you know I'm guessing yes, but maybe you can just confirm so, for example, if somebody were living in public housing and they maybe had somebody living in the apartment who technically was not supposed to, would they be risking anything by reporting that person as living with them to the census? No, they would not, and they should be because eventually, that person may be looking for other resources, so they may be looking for snap or health care resources right. They may have a child or a become a senior. So it's really important that we capture this information so that we can so that we can make sure that community has the appropriate resources. Thank you all right go ahead. I I've noticed. I first commend you guys. Census workers read quite a bit in the area, but what I did notice is that the information that they have may not be accurate at the locations where that may have on two apartments or three and then they their records is identified as four or five that's. What I did notice that they're having their database is not up to date to what's going on in a specific building that that's what I did notice when they did come through. My block got it, and you know that happened to me. So the thing about the census, the very first exercise that we undertake is called. Oh, my gosh, it's been so long now it's called it's something. It's called like ad can address, canvas address canvassing and what that is. We have a team of geographers. I actually was very fortunate, where I trained with one of the census geographers who have their degrees in geography, and I love maps and travel. So I was actually really intrigued by that whole piece of it, but we do receive their whole job is to try to identify every household in the United States. We know you know as people who live in Brooklyn. As I mentioned, I'm a Brooklyn native, and we know that you know the housing is changing. You know by the minute, if not by the nanosecond, so it could be that sometimes those addresses have not been updated. I myself live in a private home. That has a second unit, and I was enumerated even though I one of my neighbors came to my house to enumerate me- and I was very like surprised, because I was like oh I've completed this like on the first or second day of that we were able to self- respond, but it was just the way my house was set up in the system, so it could just be that there's some kind of sort of not perfect way. There are many private homes that have multiple apartments or they have been converted from two to four or we know about. You know like town homes, let's say and how you know they were once one or two family homes and now they're, maybe eight family homes or four family homes. So it could just be that those- and there are a lot of sros as well in New, York City, so it just could be that those addresses were not updated accordingly or we know as well that there are a lot of homes that are coming down. That may be one to like, let's say three family homes that are becoming 80 unit buildings right or you know, multiple apartments. So it's not perfect, but we are gathering that information from a number of places and one of the big challenges that we have right now is accessing some of the buildings. Thank you. We have some questions in the chat. Excuse me, excuse me please. This is irsa. I ask again for everyone to please not blurt out, there's 40 people online. Here at least please put your question in the chat box. The people are being looked over so please I adhere to that request. We have a question the first question here: does this there's several one can? Would it be possible to send a census stat to sterling place between Brooklyn New York, this Saturday between 11 and 5.? Can? If someone can send me the email, I can certainly try to ask. I know that there are a number of things going. I myself have at least four events happening on Saturday and we are already challenged with meeting some of the needs of those staff, but if you have other dates and times like alternatives, if we for some reason can not get there at that day and time, that could be very helpful, but I would need the address. I would need a contact person if there's an affiliated organization and then all of the possible dates that we can come out. So I can also drop my email in the chat, but I personally know that I've requested a number of mobile census takers, they're called Crr's for events on Saturday and in some cases I've requested four and we're receiving less, because there's just not enough people- and you know, there's a part of the operation that is understaffed, which is the field so we're still actively recruiting. As you can imagine with Corona, you know, a lot of things have shifted people. You know things are just moving around yes understood. If you could drop your email in the chat, that would be awesome absolutely also. Thank you also. Shelley seniors and legacy homeowners are receiving repeat visits from the enumerators. Will the Census department send a reminder to homeowners to report these units as vacant, so that those units do not remain underreported? Vacant units should be counted as zero, so if they're just vacant, you know someone if it's like a private home and you have like an empty apartment or you're a landlord, and you know those units should be marked as zero. Otherwise they will be enumerated. So a great example of that are people who have second homes right, so they live in New York, but they are quarantined in the skills or in down by the Jersey Shore or wherever in the hamptons. If they have not enumerated in their New York City residence, that property will be enumerated. Census papers will continue to come to that property. So I know that it's sort of like an edge case, but I'm just trying to give you the best illustrative example so vacant units, where people who are not live if they have multiple homes. You need to mark that as zero, if you can right otherwise, they'll be enumerated until because the assumption is that people are living in every unit in the United States. Okay, thank you for that. I have another question here. How many representatives will Brooklyn lose if our count is? Is not correct, that's hard to say, but I can say that for in 2010 and in 2000 we lost two congressional seats. So four in total to each and also you know, lines were reached wrong. Okay d: do you do you know approximately honey? How many, how much money our communities are missing out by not filling out the census? Well, right now, it's 45 percent! So let's make this that it's a hundred million dollars a year. Okay, this that's not the number, but I'm just going to give you a very basic exercise. So if we were going to get a 100 million dollars a year 100, let's say: let's make it bigger people from New York Love money. So let's make it 100 billion dollars per year. Right and Brooklyn's share of that was 10 billion right. We would only receive 55 of that, because we would only receive the resources based on the count and, of course my understanding is expert, I'm not as I'm not a professional in statistics, but you know they have people who are experts in statistics who will make some other. You know assumptions about a community about attract about a city, but still I mean you want to be closest to 100 right like we do not want any trial and error like people making assumptions about who lives where what the needs of the community are. That's how we end up with schools that are under resource senior centers that are under resource like the lack of hospital beds, which is a real issue and has been a real issue in Brooklyn right, particularly in central Brooklyn, especially and east Brooklyn. I mean all of New York effectively, but all of that data is determined by census data. Thank you, Ms Zinnerman, I'm going to ask you to mute yourself and follow up with your question on the vacant unit good evening, everyone hi shelly. How are you this is Stephanie Zinnerman, so we're based on? Are you doing so? We've been getting a number of calls from seniors and other legacy homeowners who did not realize that when they received three separate census forms they should have completed them all to say that those units was zero. So that's the reason why they're getting the repeat visits from the enumerators, because they're still looking for people in those units they assumed like a lot of people, did because they filled out the form that they were done, and there was no reason why the innovators were returning. So my question was: is the Census Department going to put out a notification to them or maybe even put something on the website? I know we've been doing our due diligence, I giving them that information, but I think if you guys put something out to just remind people that is something that they need to do so that those units do not affect impact our greater numbers and go unreported yeah. I mean you could certainly send me the request, or I know you work very closely with James Tillman, my colleague, so you can send it to myself or James, and then we can see if we can share that with national, but right now we're in peak field operations. So of course, there are no guarantees miss Tyus. I think we have one last question from Miss Mohammed. She wants to know which areas in Brooklyn have been under counted. I mean there are a number of hearts account communities. They tend to be black and brown communities. There is a fantastic map. You I mean Census.Gov has one but there's another one called heart to count. I was just talking about it. I'm working with lyft, who is one of my partners, lyft the car service, and we were just talking about this map today hold on one. Second, I'm going to see if I can find it, so I can share it with you. I really like this one a lot. This is one of my favorite census maps. It's going to share your screen, no I'm going to drop the link in the chat. So you can have it I'm on mobile right now, because I was in transit from another email got it I'm sorry another meeting. I just sent it to you all. Did you see it? Yes, so from here you can not you see the national response rate you can see you can just hone in you can put in Brooklyn right and then from there. The very dark burgundy are the hardest account. So if you put in your, you could put it in a zip code or you could put in the county. I usually do it by county to zoom in everyone. Yes, we'll send we'll send the email out tomorrow with this information, okay and then yeah. I just think it's very user friendly and it gives you like a very like sort of in your face in the moment. But of course we at the census also have a a resource, any more questions in the chat. There are no questions registered this time. I had one that was in the chat, but I think it just got lost. But my question was that so since April 1st, which is you know the day, that the census question is asking about, a lot of tenants have moved either just temporarily or permanently since then, and I was wondering if landlords are under any sort of obligation to forward the census request to their former tenants who are no longer present in the unit, no they're, not no, that makes sense, but no they're, not I mean, and they should regardle. If they moved, I mean technically, they would have maybe put in a change of address, form or forwarding by usps and as well as in their new home. They should have received some type of mailer right by now, because every household would have received an hour right if that makes sense right yeah. I think if I move from apartment, you know like from, I do not know park place to Zappos Avenue like at you know one Flatbush avenue that one Flatbush avenue unit, whether it's a house or a apartment, every apartment in the United states. The assumption is everyone's receiving some type of mailer right by now and reminder notifications, and while I mean up in that person's name, I guess, but if they get a mailer at their new place, are they able to respond on behalf of their previous home, where they actually were on April 1st, for example? If well, if they it's, where you live right, so I thought that people were supposed to answer based on where they are on April 1st sorry, I must have just completely misheard and I'm so sorry about this right completed that enumerate or complete your thing. Then you complete it based on where you live now, oh interesting! Okay, thank you, you're! Welcome, because you I mean that's where you're living for the next 10 years right. So why would you want to be somewhere? You lived before if you live in a totally different state like if you move from New York from Brooklyn to lebron when you're family, where you live now right, yeah? Theoretically, it's just so many people left temporarily and I want all that money to come here. Yeah. Thank you very much. In those cases they should be enumerated. You know if you're just doing that temporarily and that's your get home, then I would say that you should have enumerated in her and the thing is like where you live most of the time like that's really the directional guidance, it's not where, as of April 1st, it's where you live most of the time. So if you have moved and you're going to be living mostly I'm responding from earlier to have more than one property, then you should, you know, send the resources to where you're going to live most of the time. So, if you're upstate that you live mostly downstate, then you should be enumerating here and marking the upstate property is zero. Thank you very much. You're welcome, Mrs weatherspoon. Any anybody else waiting, no one else, Ms Tyus. Thank you. Thank you very much, ms Warrell. This census is going to close on September 30th, any late filings or late submissions accepted no, and I talked about that in a presentation I did earlier this week, where I moved very early on during my tenure at the census and I've started it very early. I started 2018, so I saw the entire operation. It was a meeting for adjacent Community, Board 9, where I was like well, can we query government, or can we like do late submissions? No late submissions allow once it wraps up. The numbers are rolled up whatever. That date is which right now is September 30th. The numbers are all aggregated and then the first apportionment goes to the president and then the redistricting happening happens and then, after that it goes to the american people. Okay, my recollection is that the deadline to close was pushed up. It was, it was October 30th and it was pushed up to September 30th. Okay, because of it would seem as though an extension would be warranted because of the current virus pandemic, the clover 19 pandemic. Do you know why the account the account the census period is going to close early? No, I'm sorry! Well, thank you for your presentation this evening. It's been very informative and helpful. I do not know the case that we hear you're welcome, you're, welcome and it's, as I mentioned. Thank you. Thank you, okay, so we have any reports next on our full board meeting agenda and we'll try to take them in order, starting with the bylaws committee all right good evening. Everybody guess what we have some revisions to the bylaws that are going to be coming up in the next couple months. So I want to say a few words about process. Then I'm going to say a few words about what the changes are so process to amend our bylaws is a fairly onerous process. We have to present the changes to two consecutive regular meetings of the full board. We have to present them, so we're going to present them in October we're going to present them again in November, and then we have to vote at the third consecutive meeting so we'll vote in December. We will include the full text the proposed amendments in the notice of each of those meetings, so September October, November and December we'll discuss them during the meetings we'll discuss them between the meetings, but when December runs around we're, going to put a motion on the floor to accept or reject either the changes as a whole, or we may choose to divide them up and accept them piece by piece. We will see what happens so. Keep your ears peeled for more words on that. So what are the changes? Well, roughly we're making we're making lots of little housekeeping changes. Nothing huge! Nothing! That's going to rework the way we do. Businesses aboard the things that kind of either reflect how we actually do business that may have deviated from the bylaws or things that kind of clean up some some errors of confusion or some areas of conflict. So five rough areas- membership we're including language default languages for leaves of absence if you're a member of the board- and you need to say, take a class for a semester that meets on the second thursday of every month, and you have an irredeemable conflict. We're going to put language in there that sets a standard for when leaves of absence, are granted or withheld notice requirements. If you can not make a given meeting- and you tell somebody a given period of time ahead of time- you'll be marked excused from that meeting and it will not count as an absence when we tally up our attendance statistics at the end of a given year. We look to see how well our members did with attendance at their obligations. Presences and excuses will count in your favor absences will not so have the good grace to say. I can't make it and we'll have some language in there about that. If we do need to remove members, we have language in the bylaws that discusses the removal proceeding. One of the elements of that is that there's a 30-day notice conversion we have to give the member 30 days warning that we're going to be serving hearing charges at the next meeting. Since our meeting schedule sometimes is they're 28 days apart or 29 is apart between monthly meetings, we're actually shortening that notice provision to 21, so it will always be from first meeting to the next meeting. We never have to go over to the third lead. Another area, we're making some changes in elections, this one's very pertinent, because we're going to have elections coming this upcoming may of 2021 elections for the officers of the board. What if we can not meet in person right now, our bylaws require signed paper, ballots and immediate runoffs, so we're putting an escape clause in the elections, provisions that permit the Nominating committee and the district manager to set alternative rules should they be called we're actually also bringing the elections provisions to the conformity of what we've done actually with my job. How I should have been elected to be the substitute secretary, but we did not do that because of coving, so we're actually formalizing a procedure for filling vacancies when officers either leave the board or are removed from office. On that note, officers making three minor tweaks we're clarifying the fact that the chair of the board is a non- voting, ex- officio member of all committees. So the chair is entitled to sit in any committee meeting to participate in any committee meeting, but can only vote in those committee meetings that the chair is a member of those committees. Emeritus. We have established criteria for awarding past board chairs emeritus status when a retiring board chair who has served at least two terms retires, they will be awarded emeritus status for the next four year and that will entitle them to continue sitting on the executive committee in the next official. We also have put in more specific definitions for the duties of the vice chairs, the secretary and the sergeant of arms. It was really vague. We've added a few declining characteristics for those committees: vice chairs will be the criteria for choosing them is changed. We are saying that the vice chairs previously were just chosen by the board chair. The committee chairs and the committee vice chairs were chosen by the board. Now we're saying that the vice chairs of any given committee must be chosen by the board chair in consultation with collaboration with the committee chair. We do not want committee chairs and committee vice chairs to not be on the same page. We have language in the bylaws right now that says, committees must meet quarterly. People have been a little confused by that, so we're changing it to say four times a year at a schedule to be determined and approved by the executive committee right at least four times a year. Many of our committees meet 10, possibly even 11 times a year. So that's the floor, we're changing the composition of the executive committee, currently it's officers of the board chairs of committees and vice chairs and committees, and that's pretty much half the board right there. So we are slowing it down by saying officers and chairs only no more vice chairs as members of the executive committee, and then we have a few miscellaneous provisions. I'm going to clarify the fact that the district manager has authority over the personnel of the board office. Could the district manager need to make personnel decisions? The district manager does not need to consult with the board. The board only has the power over the choice of the district manager. We are making some tie- ins to the bylaws of the friends of Community board, 8, our non- profit wing. We're saying that any changes we make to these bylaws will automatically be incorporated into those problems, and there is some confusion that came up with our most recent meeting about the way the bylaws refer to the board term or the board year we're going to put some language in there. That makes it clear that a term refers to a two year slot. Every one of us is appointed for two years. Officers are elected for two years, but a board year runs from September 1 to August 31st and certain matters are keyed to each of those. So those are that's a lot but they're all very small cumulatively. They will help us run meetings a little smoothly a little more smoothly and help us run the board procedures a little more smoothly and again set expectations. So I will come back to you in October. I will say pretty much the same thing, but you'll have something in front of you that you have at that point and we'll do that again in November and in December we will vote on these things. So thank you all very much. I would take questions if the chair wants me to, but I would prefer that we just do them offline between now and the next meeting. I agree with you Mr Witherwax, and I thank you for your very summarizing presentation. So we're going to move on through the other committee reports and I understand Mr Ellis is going to be next for the SLA and sidewalk cafe. Review Community Mr Ellis just passed the ball over to me by text because he was not at that meeting and I was actually cheering that, even though I had absolutely forgotten that so going quickly to the I know it was just circulated the action items from tonight's meeting. We had them items, all of which were renewals bar ghost 71 6th avenue for a full liquor, license a beer in Delhi's 340 sterling place for a beer insider license. That's the corner of Berlin underhill Chipotle at 347, Flatbush plumber park took her Alley Washington Avenue, just off of Lincoln and Soda Bar Vanderbilt Avenue in Saint Mark's bergen. All five were renewals. All five have been around for a long time. Four of the proprietors showed and spoke and all five were recruited, no reason not to because the meeting was held during our summer hiatus. We technically have authority to pass that all into the SLA on the clock that each of these applicants were on and we did so, but now tonight we need to ratify those approvals. Thank you, Mr Witherwax. I ask our members to put a motion on the floor. In support of the committee's recommendation, oh can I do it. I move that we support the committee's recommendation. I second it thank you miss Louser. Thank you, Mr French Muhammad. Did I hear that correctly correct great any questions? Hearing none. I will call the role again. Please know when you're coming in the role and try to mute yourself ahead of time. I have incorporated a lot of people who came in subsequent to the initial roll call. If you can not be heard, and you need to have your vote registered text, it put it in the chat, communicate it somehow we'll chat it all up afterwards. Mr Willow, please note that Mr Bailey has joined us. Yes, I do and I will go through everyone's name just in case. Thank you, Germany Allison Yay. Thank you! Linda Andrews, yes, Desmond Atkins, Lisa Atkinson! Yes, thank you! Wayne Bailey, Princess, Ben James. Yes, thank you. Julia Boyd, Gail, Brandon Muhammad. Yes, thank you! John Buckholz, Robert Callahan! Yes, thank you! Angie Charles! Yes, thank you. Helen Coley, Norah, Daniel she's on. I know James Ellis. Yes, thank you. Mr Ellis Kevin Farley Andrea, Faris, Fred, frazier Gabriel. Yes, thank you. Miss Tamika, gibbs, Johnny, Granville, Hi, Jeannie, Harris, Blendman, Marva Henry. Yes, thank you. There's Eva Jordan Gina Kinsey, Sarah Laser, yes, Lorraine Lemaine! Yes, thank you! Elaine Mahoney, Ellis mickelsteins! Yes, thank you! Robert Puka, Yaya Raji! Yes, thank you Adam sacks! Yes, thank you! Brian Saunders, Canola Soccer. Thank you! Todd ethel Tyus. Yes, thank you for coney. Yes, thank you leaves Willis Kimberly Watson, here's a weatherspoon, yes robin also Nora Daniel said yes, thank you and thank you. Sweater burn. Yes, Robert wither Wax, yes, Deborah young! Yes, the motion passes 23 in favor. Excuse me Rob, I'm sorry, you can't believe Watson. Okay, thanks kimberly, Watson and Tamika gibbs voted yes as well. So that means the present as well Watson Miss Branville. I did not get your vote she's still with us. You did not hear me. Yes, no thank you miss Granville. I know Mr Atkins Mr Bailey Miss Boyd Mr Farley. If they can communicate their votes as well, I knew they were present. That would be appreciated. I saw him all right. Ah, the motion passes we'll have a tally later Mr Farley. Thank you, Mr Witherwax. As you say, we can revisit the tally by looking at the record after the meeting, there seems to be a delay of some sort with any problems with the audio yeah. Some people can't abuse, but I thank those who voted in the chat. Okay, moving right along. Thank you again. Mr wither, wax you've been most helpful. Next up at that is the education and Youth Committee. I think that's Ms letterburn. Would you care to give your report please absolutely good evening on today should have been the first, not we to allow the department of education to be able to enable it. If I were queried, as I was doing it was the preparedness were on return to school. I would say it's mixed results, and this is also reflected levels of preparedness in the three districts that we overlay, which are 13:16 and 17.. Some people will say that you know we have old schools, and that would be to our disadvantage and I would tell people it is indeed to our advantage. Given the recent complaints about ventilation. It's the newer schools that are really having issues with ventilation, giving that we have old schools. We can open our windows also. I was aware of two schools that had an interest in having outdoor classrooms and both schools have elected. Not to do so. One school in particular was concerned about safety issues, given that there continued to be any number of safety surrounding the school they've had a number of shelter in place in the past. So I'll tell you that the committee will be working on policy this year, rather than having an event. Last year we were all geared up to have our first annual spelling bee and then Covid-19. So we will make decisions about policy and that's what we're looking at acute and long term acute. We need to render a decision right now or in the near term to help inform other stakeholders of what we, what the Community board thinks long- term policy in terms of development. So I'm going to close with one very interesting thing: that's happened have remote learning, so I hope you guys can see this book. Everybody remember this book right the snowy day and when you were a child I know oftentimes people were like put on their pajamas backwards, flush, eyes, pray to the school calendar, guys that they could have a school day. Well, one of the things that has come to one's notice is that snow days may have gone the way of the dinosaur, because now that we're all equipped for remote learning, we do not have to stop instruction because of inclement weather. I hope they understand that you know play time is necessary too, but, as we said, we'll weigh in on these decisions when it becomes acute and consult with our stakeholders about such matters when, in terms of long- term policy. So at this juncture we are undetermined as to what our next meeting is going to be, because there is some flexibility about setting up meetings meeting times and we respond to what's going on. I am other members of my committee can not participate in an update in district 16 because we're on this call tonight and we'll keep everyone informed via the board office. Thank you. Thank you very much, ms wetterburn. Any questions from the members any questions in the chat that I have not seen: okay, well, we'll move on to the next committee report, that would be environment, sanitation, transportation. Here I am again hello. Everybody Robert with your wax the chair of the environment, sanitation and transportation committee. Now we've had a very busy summer for streets in Community board eight. I know I spoke about this once or twice, but we've had several very successful examples of open streets where the City Department of transportation, the NYPD, in partnership with local block associations and other groups, have closed off streets to through traffic and gave the community, especially during the early part of the summer, when playgrounds and parks were still closed, gave the community more elbow room to get out and about and stretch their legs. And it's been great. It was a wonderful success that I feel is probably coming to the end of its rope as to miss Wetterburn's comments as school goes back and kids are going to have more focus to their daytime, but I've loved being in Brooklyn. During this time, we also have on the open streets, front, vanderbilt Avenue, at least in our district, for open streets, restaurants, and this will sort of cast ahead to what Mr Ellis may be talking about in a few about Mr saunders about economic development and the livelihood. But I bring it all up because it's all very intertwined right. The way we use our streets the way we use our parks, the way we use our businesses, it's all of a network. We want to keep it all healthy and all working together, we're up in the air. At the moment as to whether the Esd Committee is going to have a September meeting, we will let the board office know shortly. My inclination is to do it, probably in October, and let the dust settle a little bit, but we will we'll let you guys know- and we do not anticipate it being face to face either. It would be one of the arrays that we'll all join in, but we'll look forward to setting a good agenda for planning for the winter and the spring and dealing with what comes our way. So thank you. Thank you, Mr Witherwax. Are there any questions on the report? Mrs Wettaber is with us willing any questions on that report. I do not believe there are any questions on the report for environment, sanitation and transportation. We'll move on to housing. Is there a report from the housing committee? Can you hear me now? I can hear you, okay, you went off again put your microphone on okay. There you go. I just want to let you know you can still hear me. Yes, okay. I am going to be speaking to my committee because we are going to try and do an October meeting and I'm not sure if we would be able to actually do the workshop that we had wanted to do last year. It would be something different look using an online platform, so I'm not sure how doable it will be, but we will discuss it and we definitely will be meeting in October, probably the second Wednesday of the month, and I will set that up with Miss George and with Julia. So I look forward to some very stimulating discussions and I hope that the new board members will consider coming out because our committee will be dealing with the rights of tenants and that's a very important thing right now, and I understand I'm not sure if the council person and the mayor were able to delay the lien sale. I had heard that they did, but I'm not sure about that. There was some talk about them doing that because of the pandemic Hi Miss Greendale. This is Arnold Lipkin. I just want to say. As far as I mean, the lien sale has been delayed since July and from at this point the lean snail, I believe, is somewhere at the end of September. Sorry, I do not know the exact date someone else may know, but as far as I know, it's been delayed till the end of September. So far, okay has been delayed until September 25th. Okay, thank you. I'm dylan you're done. Thank you very much. Miss granville. Any questions for Ms Granville on housing is weatherspoon. Any housing questions. No okay! Well I'll! Do a report before sorry go ahead here since power failed, but there was a just a correction on education, so the eighth was the first day for the staff, not the student, okay for land groups. I'm sorry, are you done Ms, Granville? Yes, okay! Thank you very much for your report. Okay, moving on to land use, the meeting for the land use committee in July was problematic. A major proposal for a proposal for major development in the crown Heights North historic district was on the calendar, but the proponent did not submit the information for the presentation until two hours, two and a half hours before the meeting. So we asked them to come back in September and this project is called 959 sterling partners llc and they are scheduled to come back in October. We originally had them laid over to September and they have they asked to come back in October to land use and then to the full board meeting in August. The land Use Committee worked with the Department of City planning to revisit for the third or fourth time the concept of public realm improvements for for the M crown neighborhood rezoning, and so we will do that again in November and for the September meeting of land use. It was sort of a celebratory short session to point out that CB8 has done a landmark achievement of using a community benefits agreement to work with a developer, to add aspects to its planned construction of a building in the proposed rezoning area. That would serve the community's vision of what should be happening there until such time as we can get gcp to complete the neighborhood rezoning. So that was for the grand Pacific euler action which passed the council earlier this month and I believe the mayor is signing off on it. So that's a done deal and we'll go forward with that concept of using community benefits agreements to tailor construction and projects in this community district. So we have to ask we do not ask we won't get so that's a short report for land use. We normally meet as a committee over the summer because of the fact that we see landmarks items which landmarks Preservation Commission will not hold their agenda because we're off over the summer, so the landers committee will meet during July and August regularly and that's what we'll do from that point forward? We have the next committee coming up. Are there questions on land use anything in the chat on land use? There's one question from Sarah Lazar: have we heard anything further from DCP the city about funding the immigrant zoning, no they're, expecting budget cuts and they're saying they're saying? Definitely they do not have the million and a half to do the environmental impact study that it would. It would require to move ahead with the neighborhood rezoning. So the back the back part of that the back half of that statement is that they will entertain private rezoning applications. So we will have to stand up to that and bring pressure on any applicants that want to come through during this time they may. The applicants may be under the same kinds of financial pressures that everybody else is. The revenue streams have dried up nobody's working. This is sort of like a citywide susu. Nobody has money to be passing over to the next person. So yes, there's no funding for the M crown rezoning, but we need to take this time to look at public realm improvements that we would want to happen there and I will be recirculating a nice powerpoint summary that was done by Brian Paul from the council's land, Use Committee, with the help of chief of staff, Tasha Young for majority leader Combo's office and take a closer look at that I've done one give it give. Kony has done one. We can recirculate all of those again to try to Jiggle everybody's thought processes and what they would like to see. If we can get this done and the reason why we revisit it, because the concept of public realm improvements for neighborhood rezoning encompasses a half a mile circumference around the study area, so you'll see that mapping again over the next week, we'll send that out again any other questions, I'm missing, no more! That's it! Okay, we send okay. Next one up is parks. Yes, this is going to andrews. We did not have a meeting in September. Our first meeting will be October 6th, the first Tuesday of the month on the you know on the virtual meeting, but I just wanted to mention that miss ties and myself and maybe a few other members of the Community Board, will be meeting with the Ralph Lincoln Community Garden representative on September the 19th. They want to restore that guarding. If you can remember, Mr Robert Matthews is the one who originally started that guarding along with the community. So they want to have a conversation to see what they can do to restore the garden and they want to eventually have honor Mr Matthews during the restoration of the garden. So that's going to be on the 19th at 1654, Cent, John's place and at 11 o'clock, and that's it. Thank you, ms andrews any questions, any questions so far. Okay, thank you! Mrs. Okay. We have two more public Safety committee report. Please good day this is Mark Thornton from public safety. We are going to be having meetings for every month for from September into June we're not going to have a meeting for the month of December. Our next meeting will be done on Monday September, the 28th, that's Monday, September 28th it'll be at 6:00 6,30, but we'll verify the time we'll have the community board send out the invite to everyone to participate? As you guys know, we've had a rough summer with all increased gun, violence and, unfortunately, our community, our 77 precinct, had an increase in shootings and in murders. So that's something that you know we'll see how we can address that with our with our deputy inspector and also during the summer, we had quite a bit of changes in the laws. That's going on so we'll have him review the changes that was done and the impact with the community and with the with the police department. Over the summer we had NCO, they re- established the summer meetings. It was done for the month of August each sector had this their sector meetings. It was done outdoors as of right. Now we did not get any. I did not receive any notification how they're going to proceed due to the Covid-19. If it's going to be done outdoors or if they're going to be able to do an indoor location. So once we get that information, we'll definitely send it out to the new members. Thank you guys to who wants to participate in public safety. We definitely need more members, so we're my my thanks go out to you and hopefully you'll participate, and since it's virtual, we have more flexibility, we can have more people participate. We can have more people address their concerns or listen to the actions, that's being done for our community and well voice. Our concerns voice, our concerns with the with the 77 precinct and also to our elected officials, to see. What's needed to be done to make our community safer? As I mentioned again, the next meeting will be on Monday September, the 28th, and that's I'm going to be at 6:30, and the community board will send out the Invites and I think that's about it. Thank you guys. Thank you. Mr Spartan Ms Weatherspoon. Any questions in the chat in the chat for Mr Thurton, no question. Okay, I think we lost our incoming state Senator Mr Brisport! Are you still with us? We have the Seniors Committee First Seniors Committee's up next okay. We can do that, I'm just checking no. He said he can hold on okay all right good evening. This is Gail Mohammed, the chair of the Seniors Committee Seniors Committee met on September, 2nd again, it's very different because we're not able to meet in person. So we I spoke with Michelle and we talked about conference call and it worked out very well. I think, for the first meeting we had approximately 10 seniors that came on board. We talked about Covid-19 and it was really like a wellness check- in to see how the seniors were doing and how they made out over the time of the pandemic and being in homes alone and make sure that they were not completely isolated. We talked about the crime they were concerned about the crime. One of the seniors wanted to talk about black lives matter and the importance of it and again they also were concerned about black lives matter. However, they were concerned about the black on black crime in our in our communities. We talked about our future meetings. The next meeting is scheduled for Wednesday October, 2nd. We will do the phone, we will have our meeting over the telephone. We will continue to invite guest speakers if anybody on the committee has any ideas of something that we can do to help make our meetings meaningful to the seniors. We welcome your input so again. Thank you. We look forward to your participation. We did have one of the new Community board members that participated in our last meeting. So thank you. Thank you. Mr Mohammed. Are there any questions for Ms Mohammed on the Seniors committee? Work, no questions, okay! That was very helpful. I thank you and Mr Thurton and for announcing your dates for upcoming committee meetings and I hope that the office will get a schedule from those committees that have not announced their meeting schedule. Now we have with us just checking my list here. We have with us Stephanie Zinnerman, I believe, elected reps. What let me start with Daryl White from the Ag's office Mr, please come in and make a statement Miss tyson we're going to go to Mr Jafari bridgeport, because he has an eight o'clock really quickly. Okay, we could do that, not a problem, I'm just looking at the numbers of the people in the list that I got. Thank you Mr Brisport, please, okay, so I'm just seeing everybody can hear me. Okay, so I just want to say hello: everybody community board a thank you all for being on the call tonight. I appreciate the updates and I appreciate you taking time for your civic engagement. I want to introduce myself and say: oh quick, hi hello. My name is Jabari Brisport. I'm the incoming state senator starting in January in Senator 25, I'm taking over after development montgomery retires at the end of this year. I'm a public school teacher in Crown, Heights right now, and I'm still teaching through December, but as we get our office set up and everything and office infrastructure I'm set up, I still want to make sure that I'm available as a community resource and help anybody with what they need in the time being. So I put my contact information in the chat. It's a generic campaign contact at Jabari for state Senate, DOT com- that is for the word for not the number four contact at Jabari for state Senate, DOT com, any and all things that you need help with we'll do our best to put you with the appropriate resources, and if you get, I want to get involved with the campaign. You know we are helping out with census stuff throughout the rest of the month. You know it's very important and let's go Brooklyn. I want to be number one in New, York, City and you'll be working on helping out with some upstate Senate campaigns in October to you know, fight for a veto, proof majority in the New York State Senate. I want to thank you all again any questions reach out to that email address and have a great night everyone. Thank you so much thank you. So we have your email address in the chat and so on. Okay, I see that. Thank you. Thank you. This is good. Okay, all right! Next up at that is who's next Ms George, I sent you the list. Okay, I have Daryl White next. Is that okay Mr White? Are you with us Mr Daryl White from the state Ag's office? Yes, I am Madam Chair, but I can yield to the Democratic Assembly Designee and the 56 stephanie Zimmerman. If that's okay, absolutely cinnamon, please let us know your thoughts this evening, what okay, she's on muted, okay! Thank you daryl for, yielding the floor good evening. Everyone I want to first say that my name is Stephanie Zinnerman and I am the democratic nominee for the 56th assembly district. Currently held by assemblymember tremaine Wright, who will be in office until December 31st. However, I am available to support community events and certainly support the initiatives that the community board is moving forward with. I am wanting to as always. Thank you all. I do not think that people understand the commitment that members of the Community board put in the time and the effort to ensure that our local government is run efficiently, and this has certainly always been one of those meetings that you enjoy coming to because it is run efficiently. You get the information, you need, you find out how you can get involved and you do good working community. So just thank you all for your service. I will be for those of you who have not been on my website. It's Zinnerman for 56 A.D. I will put that information in, but for those of you who know me, the my top priorities, of course, are housing, education, health care, economic development and, of course, our seniors. So I look forward to this time over the next couple of months being able to visit your committees, I'm sure, as of January, I will not have the time to visit the committees and the general meetings, but I am looking forward to I'm having my staff, hopefully from recommendations from some of you, as we do some hiring post November to be a part of these meetings and work together to help enhance and improve our community. So thank you very much for this time and I look forward to meeting those of you who I have not and working with you all as we move towards recovering from this global pandemic. Hi Miss Zinnerman. Can you give us your email address? Can you share that in the chat? I will share it in the chat now. Yes, thank you so much. That was very helpful, inspirational and I guess the flip side of this coin. We're hiding under now is that we're putting everything on our calendar and in our minutes on our website. So people can go back and actually see the video and hear the audio from our meetings, and we also will be doing summaries of those meetings. So you can get to the pertinent information easily. So we have some other elected representatives, representatives here and again, a call for Mr Daryl White from the state Ag's office. Thank you, Madam Chair, to miss George, who I want to publicly apologize. The last time I've seen her might have been a year ago, and I had promised her that we were going to deliver this booklet here, which is called smart seniors, which is my segue to speak to your senior chair, Gail Mohammed, and would like to invite myself to speak to the seniors in regards to being a smart senior as a booklet to keep the procedures, consumer savvy and so gail. I'm inviting myself to your to your no October, 2nd meeting. If I can madam chair and so that I can talk a little bit about the smart senior booklet that I promised Miss George over a year ago, that I would deliver to her office. So I'm trying to kill two birds with one stone, I'm sorry for the analogy, but this way I can deliver these to her and then talk to these seniors in G E board, eight about being a savvy consumer. The other thing is that we're still in a pandemic and there's still fraud going on in the pandemic, and so we still need to find out if people are getting frauded out of or out of certain items. You know I know at one point: the clorox and the all the ppps were at a rate or the amount that people were selling them was, you know a little a little crazy. So we need to know that so that we can stop and decease the companies or even the stores for price gouging. You guys right. Some of the fraud that's going on is on the computer on your desktop laptops. You know it's a security issue and the office of the attorney general can help in that respects. Landlord tenant disputes. The attorney general's office can't help with that. We have a consumer fraud and protection unit. That's bar none at the Brooklyn queen regional office. In downtown Brooklyn at 55 hanson place, I think Michelle. If I can you have, you still have my garden number. Yes, I do okay. So if you need to give that out to anybody after the meeting, please do we have no, we still are at we're still taking calls we're not at the office. Not yet my estimation or the estimation of the attorney general is October, I think, sixth or seventh, that we will be in the office on a rotating basis, not all not every day but some days, but you have the number you can reach us at that number also, and the other thing is of course. After all this is over. You know: New York state's rent laws has changed and the and the assertive things in the new rent Lord that you guys should know, and we have that on our website- a g DOT N, Y, DOT gov, and so I think I've taken up. You know enough time, I'm hoping that Gail will invite me to the senior committee meeting and I'm I thank you for your time, appreciate it thanks there I'll reach out to you later this week. Thank you very much. Mr White. Do you know offhand whether or not that booklet is born the Ag's website as a resource it is. It is yeah. Yes, thank you. Thank you, so we'll make sure that link gets in one up on our website as well, and people can access it from there as well. So that's a good thing. Miss Tyus! Yes, excuse me sorry to Interrupt, but I just wanted to mention to Miss Mohammed that Jack Robinson, who Jack Robinson, who volunteers with invisible hands as well as other similar organizations, would like to know. If the seniors need assistance with grocery shopping, he has dropped his contact info in the chat. So I just want everyone to be aware and that question directly to you gail Muhammad, thank you Ms Weatherspoon, so we do have more information coming in from our elected representatives. Kim Robinson is with us from council member Samuel's office and then we'll also have Mizana Lipkin from majority leader Combo's office. So Ms Robinson is going to bring us some information now Ms Robinson. Are you with us? Can you hear me? Yes, okay, good night, everyone, I brought greetings on behalf of Christina and I just have two quick announcements on sat on: Saturday September, 19, the council, member and Assemblywoman Walker. In conjunction with the farm and the Brooklyn children, museum and bright light. Greater baptist church will be hosting a census, registration, food and school supply. Giveaway that will be at 1676 park place, that's between Ralph and Howard 12 P.M, and I will send that information to the board, so you can send out and on fridays we're actually going to be having for the next few fridays we're going to do a sensor starting tomorrow, 12 to two office again with the farm and again the senses. I know someone talked about it early, but we can not stress the importance of getting on the word out and having everyone complete the center centers. So again, on behalf of the council member, I bring greetings and look forward to amazing, 2020 and looking forward to 2021. Thank you. Thank you. Ms Robinson Much appreciated any questions for Ms. Robinson is what ms weatherspoon any questions for Ms Robinson that I missed. There are no more questions for her, but I just I just wanted to acknowledge that Ms Zinnerman wants to remind us all of something. Give me one. Second, I just had it. Where are we hold on? I'm sorry, okay, Miss Zimmerman wants to remind us that today is request your ballot day for those who are planning to vote by mail. Please request your ballot today at vote. Dot NYC, and it would be great if you could reach out to at least five people in your networks after this call and encourage them to request a ballot as well. Excellent reminder excellent suggestion. Thank you. So we have more information coming in from council member combo's office by way of representative Arnold Lipkind Ms Lipkin. Are you with us Arnold Lipkin? Are you on the line? I can't see her. I do not see her. I think she's gone. Okay, so we have any old business that we need to cover is George. Can you think of anything that we're skipping over? I just welcome the new board members. Thank you, yeah! That's where the new business, I think orientation welcome New board members. Thank you all can we have someone say: have each one of them say a couple of things, whoever missed the orientation, something like that? Well, whoever missed the June meeting where they got a chance to introduce themselves right, yeah, great that'll, be great because the names slip away from me at the moment. Well, the new board members know where they are Mario Lemaine is the only one that I do not recall being at the June board meeting, I'm not sure if Kimberly Watson was there. Let me just double check the minutes really quickly and Blue. Watson was there then just Miss Lemayne, hi Julie. Yes, I was not. I was. I did attend one of the orientations I did miss the last one, but I've been to a number of the meetings over the years, so I do recognize a lot of your faces now. We know who you are hi there, hello, everyone. I hope you've had a chance to pick a committee or two or three or four excellent, very good. Very great. Thank you. Thank you. Thank you for attending tonight. Absolutely I do not think Mr Mickelstein was there? Yes, hi. My name is Carlos mickelsteins yeah. He was right great to be part of this board. I was at the meeting but yeah say hi to everyone. I'm really pleased to be joining the housing committee and the seniors Committee excellent. So we will be looking for a schedule to be published by the different committees as Mr Witherwax mentioned earlier. They won't be needing monthly, as we've been doing over the past several years, but the schedule will be published. It'll be available on the board website, usually in the board calendar so and the calendar has been upgraded to be searchable. So you'll have that as a resource to plan your time and plan to attend and contribute your ideas and suggestions for improvements in this community because we are, we have a target on our back. We have too many trains too many buses. Everybody wants to live here, so we want to make sure that all of the incoming new people can come here comfortably and we're all going to be comfortable together. So I'm not sure what else we need to cover this evening. Any public comments, any public comments, announcements! Oh super briefly, this is Sarah. I just wanted to share. I mentioned this and miss George and Miss Tyus also put out this information earlier, but I just wanted to also bring it up. A lot of there have been a lot of illegal evictions happening in the entire borough, despite the fact that there's an eviction moratorium, so I just wanted to share the information about the new Brooklyn eviction defense network. In case you hear about an illegal eviction and want to share this resource with people or if you want to help, if you want to help out with that with that network, it's a lot of different groups coming together. The right to council coalition was at the origin of it and yeah. I just wanted to make sure everybody has access to that info. Thank you. Thank you. Do you have a contact website? You can put in the chat for everybody yeah. I put the email address for it in the web in the chat and we're still working on having a website for it, because it's so new, but the email address is definitely working. Thank you very much. Thank you. Mr White has a question or comment. Oh sure, it's more of a comment. Sarah. If that's the case, then please, if you know of those people, please send them to the or have them make contact with the state attorney general's office, because that's truly one of the issues that we have in regards to people and attending landlord issues and that's key and if they're doing that the attorney general's office needs to know about that, so that we can get on top of that yeah. Absolutely I guess as a question. What would be the best way to convey that information, because you know there are several every week. What would be the best way to convey? Would it be to you specifically or so the number to call is seven one, eight, five, six zero. Twenty, I mean sorry, twenty forty, twenty forty, okay, five, six, zero. Twenty forty at some point, you'll have to you know, do a complaint form on our website, but at least, if you call the office and let us and inform us of what's going on in whatever area it is, then we can actually start the ball rolling and you can have those people leave a call or they can do a whole joint thing if it's a whole block different blocks, different people, whatever the case may be, but it's obviously something that the Ag's office should know about, so that we can be all over the landlords that know the law. They know what they're doing see that they know it, and so, since they know it and we do not need to find out so we can. Let them know that we know about you now, thanks Mr White. Thank you. Ms Lazar, most appreciate it well we're drawing to the end of this meeting. Unless there are other issues or questions we need to explore while we're together. There are no other questions or comments registered at this time. Well then, I am going to suggest that we close the meeting and I thank you all for coming. Thank you good night, good night. Thank you. Good night have a good day. Everyone so meeting adjourned good night. You.",
            "summary": "We also have Darryl white from the New York State Attorney General's office on and two additional board members Kevin Farley and Gail Branson Muhammad, Excellent So moving down the agenda, everyone's had a chance to look at the minutes.\nMost of you already know, I'm with the New York City campaign, Finance Board, specifically with the voter engagement arm.\nI was invited by Community Board, eight just to go over a few things, most importantly, registering to vote updates to election and voting laws that have just been passed recently and also mail- in voting as well as a few other things that are also voting related during this time.\nYou know, you have to be a U.S citizen to register to vote in New York state.\nYou could do the same thing as well, with the form there's roughly two ways you can register to vote in New York state.\nThe, New York state legislature has just passed the law that also now requires certain state agencies to also automatically register people to vote as well.\nThe board of elections will send out ballots to folks who put in an absentee request, that's only because by that time they should already know who will be on the ballot on the state.\nI, should say, there's a new legislation that allows ballots to be counted in postmarked on or before election day, November third and received by the board of elections, seven days after the elections, with or without a postmark.\nYou know just make sure that you check the box for temporary illness on the application and starting Just to remind you all October 27th, is the deadline to request an absentee ballot by mail.\nIt came with and additionally, please make sure to sign the back of the envelope as instructed, and if you are going to send it back in the mail, please make sure you do it by November, 2nd I've heard mixed things about taking in the mallet mail- in ballots, for maybe the elderly, you know who might not be able to take it in and with people's concerns around the mail.\nI, guess, I'm concerned about those who want to vote and want to make sure that their voters can't counted but can not get out and how we can be up helpful to the handicapped and elderly in the community with making sure that their ballot is in.\nI do not know, I'm, not sure the state legislature has asked the Post office to come in for a hearing to explain some of the issues, The state legislature, as I mentioned, earlier, passed a provision to sort of relax that problem when it comes to posted postage, page envelopes, because that was the real issue like some folks It sort of like just became this huge issue that sort of spiraled out of control, so hopefully with the new laws passed by the state, legislature.\nI do not know if you have much information about that, but is that going to be a general polling location or is that going to be specific to our community districts and those that are voting?\nIf you want to clarify which way you would like for people to put in their questions, in which section that way, you're able to follow along the chat, section.\nI wanted to start with the numbers of where we are and just give you a snapshot of not only Brooklyn but New York, City, New, York, State and national.\nWe just had a presentation on voting, so the two most important things I think, as persons residing in the United States- can do right now our vote and do their census.\nThe big difference about the census and voting is you: Do not have to be a Us citizen to complete your census and in fact the census is an exercise of counting every living person in the United States, regardless of their immigrant status.\nYou may remember from previous presentations that I made that the census there are two populations that are amongst the the most under counted number one are children under the age of five, so we think about our schools not having the appropriate resources.\nSo I can also drop my email in the chat, but I personally know that I've requested a number of mobile census.\nVacant units should be counted as zero, so if they're just vacant, you know someone if it's like a private home And, you have like an empty apartment: Or you're, a landlord, and So. A great example of that are people who have second homes right.\nIf we were going to get a 100 million dollars a year, 100, let's say: Let's, make it bigger people from New, York, Love, money.\nYou know assumptions about a community about attract about a city, but still I mean you want to be closest to We do not want any trial and error like people making assumptions about who lives where what the needs of the community are.\nThat is something that they need to do so that those units do not affect impact our greater numbers and go unreported I know you work very closely with James Tillman, my colleague, so you can send it to myself or James, and then we can see if we can share that with national, But right now, we're in peak field, operations.\nSo we have any reports next on our full board meeting agenda and we'll try to take them in order, starting with the bylaws committee.\nAnother area, we're making some changes in elections, this one's very pertinent, because we're going to have elections coming this upcoming may of 2021 elections for the officers of the board.\nIf we can not meet in person right now, our bylaws require signed, paper, ballots and immediate runoffs, so we're putting an escape clause in the elections, provisions that permit the Nominating committee and the district manager to set alternative rules should they be called we're actually also bringing the elections provisions to the conformity of what we've done actually with my job.\nOn that note, officers making three minor tweaks we're clarifying the fact that the chair of the board is a non- voting, ex- officio member of all committees.\nWe need to render a decision right now or in the near term to help inform other stakeholders of what we, what the Community board thinks long- term policy.\nLook forward to some very stimulating discussions and I hope that the new board members will consider coming out, because our committee will be dealing with the rights of tenants and that's a very important thing right.\nWe originally had them laid over to September They asked to come back in October to land use and then to the full board meeting in August.\nThe land Use Committee worked with the Department of City planning to revisit for the third or fourth time the concept of public realm improvements for for the M crown neighborhood rezoning, and so we will do that again in November and for the September meeting of land.\nJust wanted to mention that miss ties and myself and maybe a few other members of the Community Board, will be meeting with the Ralph Lincoln Community Garden representative on September, the 19th.\nOur next meeting will be done on Monday September, the 28th, that's Monday, September 28th it'll be at 6:00 6,30, but we'll verify the time we'll have the community board send out the invite to everyone to participate?\nThe next meeting will be on Monday September, the 28th, and that's I'm, going to be at 6:30, and the community board will send out the Invites Okay, I think we lost our incoming state.\nOkay, so I just want to say, hello, everybody community board a thank you all for being on the call.\nI'm, a public school teacher in Crown, Heights, right, now, and I'm still teaching through December, but as we get our office set up and everything and office infrastructure I'm set up, I still want to make sure that I'm available as a community resource and help anybody with what they need.\nThat is for the word, for not the number four contact at Jabari for state Senate, DOT com, any and all things that you need help with we'll do our best to put you with the appropriate resources, and if you get, I, want to get involved with the campaign.\n'll be working on helping out with some upstate Senate campaigns in October to you, know, fight for a veto, proof majority in the New York State Senate.\nI do not think that people understand the commitment that members of the Community board put in the time and the effort to ensure that our local government is run efficiently, and this has certainly always been one of those meetings that you enjoy coming to because it is run efficiently.\nYou know: New York state's rent laws has changed and the and the assertive things in the new rent Lord that you guys should know, and we have that on our website- A g, DOT, N, Y, DOT, gov, You, know enough time, I'm hoping that Gail will invite me to the senior committee meeting Thank you, so we'll make sure that link gets in one up on our website as well, and people can access it from there as well.\nOkay, Miss Zimmerman wants to remind us that today is request your ballot day for those who are planning to vote by mail."
        }
    }
}