{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB10",
            "channelId": "https://www.youtube.com/channel/UCeY0bbntWzzVIaj2z3QigXg",
            "title": "October 2020 Housing Committee Meeting",
            "publishDate": "2020-11-10",
            "shortDescription": "",
            "lengthSeconds": "1:49:30"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB10",
            "normalizedName": "Manhattan Community Board 10",
            "twitterName": "Manhattan CB 10",
            "youtubeChannelName": "Manhattan CB10",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC6iJ0o5r5RrqBzoBemzRH_Q/videos",
            "twitterHandle": "@mancb10",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "FDs8IkuW2tU",
            "fillerWordCount": {
                "uh": 180,
                "um": 342
            },
            "readTimeFullTranscript": "62 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "section": 46,
                "housing": 41,
                "rent": 27,
                "increase": 26,
                "project": 24,
                "work": 24,
                "building": 23,
                "years": 21,
                "agenda": 18,
                "fact": 18
            },
            "wordCountSummary": {
                "rent": 8,
                "section": 8,
                "housing": 7,
                "increases": 7,
                "apartments": 5,
                "building": 5,
                "increase": 5,
                "agenda": 4,
                "rents": 4,
                "representatives": 3
            },
            "fullTranscript": "You Juanita are you there, so when we get started, why do not we just put the agenda up on the shared screen? Sure no problem, and when we go into the introductions I'll do a quick, you know run through what the agenda would be and then folks would introduce themselves. So you want me to put the agenda before you start talking or no I'm going to I'll. Introduce it in this ass that you put the agenda up all right, I just wanted you to be prepared for that, and also I've already spoken with Marinata about sharing the screen with some documents from espionage gardens those two pieces right. You know and hey shawna, hey Charles. How are you and everyone else good? How are you good craig? How do you pronounce your last name? Is it Sita, etc and you're here on behalf of Jericho Project? Okay, so thanks for everyone for joining early, you know we're just going to probably wait until others join and and we'll get started, and craig you're just giving us some updates on Jericho correct we're going to introduce project tonight. Oh it's a new project. That's right! Okay, so shati, so we'll probably cover that under new business when we get there, you know to that section because I was not advised, I'm aware of the fact that you've been interfacing with our district office, but I was not aware that you needed to do a presentation this evening. Okay, so we'll just hear from you when we get to new business, okay sure sounds good. Okay, Charles the Facebook live is set up. Okay, thank you. So we're going to give this. Thank you all for being on I'm jumping back and forth from my screen to my name. You know we're going to probably give it about five minutes and you know then we're going to get started. Del Senia. How are you you're? Muted? Oh good, thank you. How are you I was I'll. Tell you who I am I was on the voting line at like 6:45 this morning, I'm exhausted and thank you for your service, so I see a couple of folks that are on the call with telephone numbers. So do you want to just say who you are I, think I see your 19173, so we can give you a caption to take yeah I, do not see. Give me one. Second, one yeah, one, nine seven three I do not know who that is. We can ask to a new see it's avery seavy joining, but I. Think you see me I do see you Avery. Thank you for joining. Oh I, see 19173. There's a man there waving his hand, I got it yeah. Are you one of the residents of 95 linux or I'm a resident of espionage? Gardens? Oh espionage! Welcome! Thank you. Yes, okay I just wanted to make sure we knew everyone who was on the you know who's on the call who had I see a galaxy note. 8. Can you identify who you are? They may not be hearing craig just before we get started. Have you sent us something on the new project that you're looking to present for tonight? Do we have anything, I have not I consider I know. I was going to share my screen if that's okay or if that's possible. Okay, so we're not going to you know: I try to manage these meetings. You know with time sensitivity. So what, unless there's some absolute necessity to do a full presentation tonight, I do not mind you sharing the screen, but I'm going to ask you to keep it brief. Sure relatively great, and you know, give us an opportunity, then to have conversations with you. You know following you know even this evening: okay, so it is 6:34. You know, I see a number of others have joy and I want to thank each and every one of you for actually getting on this call in a very timely fashion. My name is Charles Powell, I'm the chair of the housing committee, Manhattan Community, board, 10 and just want to welcome each of you. I have a list of board members that I'm going to be. You know, checking off I, see that you know Delsenia Glover, you know is in attendance from my committee. Our committee and I do not really see any other community I mean Housing Committee Board members of the Oic taryn Dixon has joined us from the board and there may be others who have joined so welcome to everyone and satique. Now, just so, I can review it. Real quick share the screen for the agenda. So for those who have not had the opportunity to receive one as board members, we can, you know just have them, you know see it. So, as you can see, the agenda is the welcome by myself, which I've done. I've introduced the only housing committee member that I see on the screen and that is Delsenia Glover who's. Also, a member of our land use committee I see Karen Dixon, who is the chair of our land, Use committee, who I'm very happy that Karen is joining us tonight and we'll introduce other board members as they you know, appear on the call, so we're going to move right to comments by elected officials. So let me just explain what that is. As our you know, housing Committee continues to progress and identify issues that we should be very proactive about, or at least aware of and taking some interest in or taking some action on behalf of I thought it was a good idea to have some of our representatives of elected officials to join the call for some brief comments to offer guidance later on in the meeting you're going to hear from Delsenia Glover as to the work that you know, community Board 10 is doing on district needs which will help. You know also give our elected officials some feedback from us on things that we've been addressing, especially on housing and also on land use and economic. You know development so without further ado, I believe you know satique and by the way presentations as you can see, we're going to have. We have Avery Seabee and Lisa Harris from the 95 Lenox Avenue. You know, development Lisa is the you know the president of the Tennis Association and Mr Seavey is the owner. We already talked about the district needs statement, we're very happy that we're going to be talking about the you know: the espionage gardens. You know, tennis associations concerns about maintenance increase and then we're going to have a conversation about a brief one, just identifying some future subjects and topics under NYCHA, and then we've also heard under new business, we're going to hear from the Jericho project on a new project that they'll be presenting so Shatik. You can take this off the screen for now. Okay, so I'm going to call upon I, see Shauna harmongoff from the you know, Office of State Senator, Brian, Benjamin and happy that you've joined us for some remarks. Thank you so much charles and hi everyone. So I'm shawna, Harman Golf, representing New York, State, Senator, Brian Benjamin's office. Our office we're still working remotely, but you can still call our office at 212-222-7315 and leave a message and we'll get back to you within 24 hours with any constituent issues or any requests that you may have. We still have a bunch of mass and we have a few hand sanitizers. So, if you're in need of that, please reach out to me and I'll put my contact information in the chat. Also, this summer Senator Benjamin conducted a rent relief, a Covid-19 rent relief forum for Hcr that we did and we had help people pretty much apply for or give them the requirements for applying for this sprint relief program, and so far we had about two or three people reached back to us and said they were approved for it. So that's that and I'll be here Charles for the remainder of the call. So if anybody has any issues or concerns about the espionage issues, you know I'll be on so for Del, senia and I just want to introduce Donna Gill. You know my vice chair of the House Committee has joined the call Donna, Del Senia. I've asked shawna and I know we're going to hear from Mina White from Assemblyman Al Taylor's office, whether or not between now and next meeting. We can get some data relating to the number of persons who have applied for that relief and the number of individuals who have been approved so that we can have a better understanding as to how that's functioning my you know, experience has been China that folks have said they've yet to hear so I'd like to hear you know from anyone else as this as this meeting progresses as to whether there are any other comments, but we will have that on our agenda for our November meeting and you know expect to you know, get your help in identifying some data and some statistics as to just how beneficial that program has been in providing much needed, rent relief, you know for residents, so thank you Sean and I'm glad that you're going to stay because we want you and others to be part of this esplanade. Gardens conversation absolutely and we'll make sure we get the numbers for you too, like you requested it. Thank you. I appreciate that so I see Mina White from the Office of Assemblyman Al Taylomina. Do you want to say anything to us before? As we continue this? You know this agenda is mina, they I see you but I, think you're, satika I think she is. Oh no I think hear me now. I can hear you now Mina. Thank you. Sorry, Nina White again from Assemblyman Taylor's office, William still here in the office we are operating in person. We do have a limited schedule, but we're Monday, Wednesday Friday, 11 A.M to 4:00 P.M I mean 10 A.M to 4 P.M, just to speak briefly regarding the esplanade gardens increase. Is that and I'm sorry for the music? We got some folks out there, but just be briefly about the increase Hpd's Commissioner Miss Luis Carroll did reach out to the assembly member regarding the increase in espionage, because originally that you know that was alerted to the shareholders as well as the elected officials. This is supposed to happen last year, I believe, and it's only now taking into effect. So you know it was very short notice. Folks were reaching out to our office because of you know that fear, and just like what do you mean it's going to happen in 30 days or less than 30 days, so we reached out to HPD and Hp Swisher reached out to us just to discuss. You know what the assembly member to discuss. You know what would better outreach look like because of you know this was a short notice. Originally they were going to reach out to esplanade, gardens and ensuring you know that they are going to have staff there to complete. You know: scree forms, free applications and section 8 applications towards the end of October, but we push them to. You know make sure that they're ramping up outreach prior to that, which is why they started reaching out last week. I did get some data from Hb on how many people they did outreach to so they've been in esplanade from on from 10:15 to 10:17. They were also there from 10:19 to 10:24 they received in total 168 applications. The majority are scary and then the others are section 8. So let me just have you pause for a moment, because I just want to make sure that everyone on the call knows we do have that as an agenda item so help helpful information, but I think everyone needs to hear. You know context you know as to why this is on our agenda and what, in fact, this housing committee and our district office has been asked to achieve. So I'm going to just ask that you hold that and when we get to that item on the agenda, I will reintroduce it and then ask you to come back as shauna. You know as well with that information, but before we do that, I see that we have a representative from the office of our public advocate Germany Williams. Yes, my name is evie and I'm the community organizer for housing, equity Belsinia is my manager she's on the line. So I can also this evening in order to participate and listen. Okay, we're great something's, echoing I. Do not I do not know what's happening. Is that on my end or ivy's on it so I be you know, Del Senia, you know. Obviously, you know is a valued member, you know of your team, but also an incredibly valued member of our team. So you know we'll be hearing from her a little later in and Del Senia always gives us guidance as to what we need to hear from of the public advocate. So let's get right to it. For those of you who know me I like to get through agendas, you know, so I'm very grateful that we have the opportunity for persons. You know relating to 95 Lenox Avenue development. We have the president of the Tennis Association Lisa Harris, so Lisa, I'm sure you'll weigh in on this, and then we have the representative from the CB organization, Avery CBS as owner. Since our last meeting it was raised. As you know, there was a notification that was given to each of the residents regarding some, you know, requested increases in the maximum rents that could be charged within the development. Shatique Mitchell has done a really good job of doing some investigating with Lisa Harris and was able to get a call between myself himself and Mr Seavey, and the concerns, of course, by the residents was whether or not since this is a completely I, think I'm correct, Lisa and Avery in saying this is a 100 section, 8 building, you know all of the residents of section 8. So the concern was whether or not there would be any increases in portions of the rent that section eight residents will have to pay and then there's a second item that we're hoping you can address because you presented to us previously. You know regarding some development plans for 95 linux and some other buildings, but, most importantly, a complete. You know internal renovation of kitchens and bathrooms, and there was a concern as to whether or not this letter that they received from HUD had anything to do with any of that. So Lisa, I'm going to start with you before Mr Seavery speaks to see if there's anything that I did not cover that expressed your concern to this committee. You can unmute yourself or shatique. You can unmute Lisa Harris, okay, good evening, everyone. The other concern was the problem with of the tenants also have having gotten their leases signed since January since July, okay, I thank you, and that was that Mr cv. That was the third. You know item so talk to us a little bit about this notice that the tenants received from HUD relating to you know some efforts on your behalf and the reasons for that, for you know, increases in the maximum rents for the units there at 95 linux. We can then talk about the renovations and the third item. You know the lease renewal scenario: okay, thank you, Charles, Miss, Harris and everyone else who's in attendance. Let me see where to believe to begin. I'm we there is a rent increase, a foot with HUD. The rent increase will allow us in fact requires us and I think Charles. This is responsive to make improvements to apartments, specifically kitchens and bathrooms and, as I said, to Charles Robert Horsford Apex, a local company of a fellow I know for many years is going to do the work. We're not going to begin the work until we have an approved contract from HUD, which, as we can all imagine, is with Covid-19 plaguing us. Hud is taking a while to approve to review and approve once the contract is approved, we will begin the process of beginning and what do I mean by that folks are going to continue to live in their apartments. Robert's company has done this before we will cv and Horsford will work with folks in the apartments to make it feasible for folks to continue to live and for Robert to do his work. Charles did that respond to your initial question. Charles, I'm looking forward to well I think the initial question was, and that was helpful to explain. But the initial question is: how does that impact? The current rental status or rental payments of the residents, good I, forgot and I had promised Charles and Shaddique and I failed to do and I'll I will make good on the promise to send a letter explaining the letter will explain the following. The rules that exist today will continue to exist, that is to say, folks, will pay 30 of their income period. If the rents increase, which again I'm hoping they do, those increases will come on top of whatever a given tenant pays based upon their 30 percent, and the federal government will be making that will pay that differential. That's the rule today. That will be the rule in the future. So if a person continues to keep the job or the source of income they have today and that income does not change their rent will not change the that is this as I say, the rent out of their pocket will not change, but the building will collect more from the government, and the purpose of those collections is to fulfill that you did a physical needs assessment in all of the units and is that to fulfill the upgrades to kitchens and bathrooms that I believe the tenants are very desirous of yes, absolutely 100, okay. So let's go just to the third point, then I'm going to open it up to committee members and board members and community with any further questions. Lisa Harrison mentioned a concern about lease renewals. Can you comment on that? Yes, I feel very miss Harris I feel very bad about that. I have to say, I do not believe in saying it's not my problem, not my job, but the truth is I'm not that's, not something. I am directly familiar with now that and I think Charles had called my attention to this. Also now that you've called my attention to this, I'm going to call my sister, I'm not going to yell at her, but I'm going to ask her what on earth is happening and if you want Miss Harris, if you, if you chat with me or something give me your phone number I'll call you tomorrow, it okay, but my explanation would be, which is the obvious one. Covid-19 has made life very problematic in all sorts of ways for people all sorts of ways, including administrative ways, which is least important, but you ask- and so that's my answer, but if you can chat with me or someone can email me, I will call you tomorrow with an answer and shachika and I will follow up with you on that as well. You can understand you know just the timing of that. You know when folks are not getting lease renewals and they see a letter from HUD to say that you're looking to you know, get overall increases and the maximum rents to be charged. Then you can understand what you know happens with them. You know the fear that this is going to represent some kind of displacement. I understand, I, understand I've been in this business, a bit I know: peop people have fears, often justified, sometimes not justified, so I get it and we're going to rectify this. So, okay, let me before we go to our first, our committee members, to welcome Housing Committee member Terry Wisdom. You know who's joined us and also Housing Committee member Marie Mars. Okay, thank you so much. Thank you. So much apologies for the latest, then questions so I'm going to open it up. I mean everybody understands that this is not something where you know our housing committee or our district office is being asked for a position but certainly being asked for our assistance. I appreciate. You know the fact that we've had Mr Cv, who asked to be on this call this evening. You know to come and offer some explanation. So let me just see if any of our committee members first or board members in that community have any questions or concerns they'd like to express at this time, so we're good Miss house. Are you going to email me or chat or chat with me? Your phone number? Yes, I! Will? Okay, please Lisa. Can you are you able to put the number into the chat or do you want me to put it for you can put it in for me great okay, so baby, let me go ahead where my phone is I, will I'll put it into the chat so moving right along? We can then now turn to I'd like to have Delsinia glover. You know give us a presentation on the group: oh go ahead: oh Donna go ahead! I'm sorry, hello! Good afternoon, Mr good night, Missy TV, I'm happy to have you on the call. I spoke to Lisa and I was privy to the letter, and it seems to me that the amounts that are of the increase is a substantial amount. I understand that the tenants are not going to have to pay that amount. Most of that money is going to be coming from section 8. however, going forward with a 4,000 a month rent if section 8 is not going to pay. If per say, the person gets off of section 8, there's no way that these people are going to be able to afford that amount of rent, so I need to know those rental increases. I need a breakdown if that is what HUD has suggested or if that is what is allowed, because it seems to me that for 95 linux, that's an awful lot of money to be paying, even if the tenants should not have to worry, because if their income does not change the amount that they're paying is not increase. However, the amount of the federal government is paying is increased substantially. So that is my concern and I would like to get a detailed breakdown of how you came to these amounts, because I'm thinking when Lisa is no longer there, I'm sorry Lisa I do not mean to pick on you as a tenant to pay four thousand dollars a month for a two-bedroom apartment. That seems to me market rate right. So I'm concerned with that and I know a lot of the tenants, though you know you have assured them that their rents will not be increased, but I'm thinking about the community and our people getting into those apartments at those prices which seems to me to be exorbitant. You know I only sort of understand your question. My concern I am concerned about the community for sure my obligations are to the building. The building requires these rent increases to improve the building. I understand what you're saying I guess another way of talking about it may be the word gentrification, which I do not think applies, but to improve the building which we want to do. We need rent increases, it's as simple as that, it's really no more complicated rent increases. Yes, no one is saying it does not need rent increases to improve the building, we're just talking about the amounts. Where did you come up with that those amounts? And could you give us a breakdown of you know these numbers were developed in connection with HUD, okay in concert with HUD. This is not something you can imagine. You know the even and I'm going to say something. I hope it does not offend people. Even with that madman trump running the government. The government still knows what it's doing and they do not they're not looking to squander money or to be wasteful, and we've developed. This number in concert with HUD, to price out what can be done to improve apartments. Okay, I just want to get a breakdown, so if I can get something concrete or I'm not sure what you mean, what would the breakdown be? Well, the breakdown would be I mean if you're going to fix my kitchen, the cost. You know x number of dollars, my rent has, it should increase, but your rent is not, but the rent is not increasing. I do not even see is it done, who's speaking Donna Gill, yes, gil, because I can't see yeah. No look, I hear what you're saying but there's a process. We followed the process, I've explained to the councilman perkins and to to Charles and to anyone. Who's asked and now explain to you. This is how the numbers are developed, so Avery in response to what I get I think you know what Lisa is referring to. I'm sorry Donna is referring to. Are we able to get you know at any point? I'm sure the residents would like to know the value of the you know of the work that's being done in the respective units, so I know. You said that you were going with apex and entering into an agreement on that. Maybe that information would be helpful, but I do understand what you're saying this is not you know any sort of you know of pass along if I understand correctly, for whatever the level of improvements it's not going to change. You said the formula the tenants will still pay 30 percent, but donna you and I will talk further and let's just see, if there's any way, we can frame the question and get it to Mr Seavey's to get more data and information about the value of the work being performed. Okay, thanks Charles. So are there any other questions from board yeah yeah? This is cherry wisdom, and this is a very critical thing, because a lot of buildings have done this improvements in the apartments and in many instances the improvements that have happened have been like really inflated. You know I'm not saying that you're going to do that, but four thousand dollars for a two bedroom apartment, whether it's renovated or not, is even above market value, and this is a problem you know and I get it you're. Trying to you know renovate, but I think that there should be like breakdowns and ceilings, because in many instances you know whatever is being done to improve is a bit inflated, not a bit, but in some instances a lot inflated and the courts are filled with that. So I think that's something to look at, but in this environment in Harlem, making any apartments that are renovated, where people actually have been living and have been in a community for many years, four thousand dollars I think it's outrageous, I think it's unconscionable and I do not know who we can turn to and I mean I get it if you're trying to improve a building. But this is not right, and this is a part of what we're trying to miss wisdom, I'm confused. This is not. This is only a benefit to the tenants. It's a complete cost-free benefit to tenants. What would be the complaint? I just I? Okay, am I missing something because, and obviously I came in a little bit late, but you said something about it's four thousand DOT. It's going to be four thousand dollars and well I'll. Repeat it. Maybe you did miss Okay as section 810 and pays 30 percent of his or her income. That is the rule. It's a rule that we've all known since time immemorial that will continue to be the rule. The rent, the additional rent, we're asking in order to improve the apartments comes from the federal government. We are not asking people, it would be the last thing we want to do to ask people to give us more money. If a person's income remains the same, their rent will remain the same. You know what, if their income goes down, their rent will go down. The differential comes from the government and, as I said earlier, maybe you missed it. The government as crazy as the government is in so many ways, they're not giving away money until they get value okay. So if they're gone, if they're off section eight altogether, because that was the question- then what happens to them? What happens? The only reason a person would be off section? 8 is if they do not certify their income yeah, but maybe their income changes that does happen to people what happens if their income changes. You know if they're working and they you know like they no longer and they no longer qualify for section eight right, that's a good question. I do not I do not have the answer to I could only guess at the answer. I do not have an answer, but I'll share that with girls, and he can share that. Okay are other people's rent going to go up to or it's just the section. Eight it's a hundred the building is it's a hundred percent section, eight building? Okay, so that's it! That's a different question: I can only guess I'd rather not guess and I will find out and tell Charles yeah, because that's critical because that means like, if someone you know like, gets out of section eight and they have a job, but their job can't pay. Four thousand dollars, then: what are they going to do? I understood a thousand percent I guess I have a question just so: I understand it. If, but if someone vacates the apartment, are the new tenants only going to be section 8 recipients or the answers? Yeah? Oh okay, thank you. Let me add now I do not know I'm willing to guess at this, but I think the guess is right. We have article 5, which is a tax benefit from the city of New York. My guess is that we can't charge a non-section 8 tenant more than some measure. I know that's a little vague but I'll repeat it, but we're bound by a variety of rules that are imposed by the city, for example, to take only folks who qualify for section 8. That does not answer the question of what happens when the person who's arrived in the building makes more, but my guesstimate is even if I were a slob and a dreadful human being and wanted to charge people more. My suspicion is that my covenants with the city do not permit that. But that part is a guess and I will confirm it with Charles, so Avery I believe that your building is project-based, section 8, meaning that there's continuity. You know from one you know resident to the other I think that's what you're you you're referring to in terms of your agreements versus you know that what so section 810 it leaves in other situations. You know they leave with their section a benefits to go. You know elsewhere, it is project-based. This is project based, so I just want folks to know the distinction between a project based section, a which is 95 Lenox Avenue, which means Karen that apartment will still stay section, a regulated. You know, even if that tenant becomes ineligible, another tenant would come in to be eligible, because this is a hundred percent project-based section. Eight development, yeah I, think that that's part of the that's the distinction between what happens, sometimes in other rent, stabilized scenarios, where you will have tenants who will bring their section eight eligibility into the you know to the particular you know project, but not necessarily have that unit right. You know section eight projects, okay, hello, I've heard that I say can I just say one more thing: I just this is Donna gill. What ha? How long is the project base? What are the dates and when does it end? I think it's I think understand that I think we have to enter into a 20. Tell you a couple of things. The legality of it is I think we're entering into a 20-year contract to get the new rents. That's number one number two: this building can't operate with to be handed without section, 8 assistance, but again legally, it's a 20-year contract from here on out there'll be a new contract and we have no reason to run it other than as a section 8 building. It works for me to be honest, financially and we're happy to contribute whatever it is to the community, I'm and well. It works now. Mr, Stevis and I appreciate that and I appreciate you saying that, but 20 years from now it may not work. So are you going to sign a new contract for 20 more years you see. I would think that, if that's the case, it should go into paternity or for a 99-year lease or 99-year project lease, because I would feel more comfortable, knowing that it goes because 10 years has just gone by and nobody even realized that 10 years has gone by so 20 years is not a very long time. So that's my concern with when the time is up what happens to these four thousand dollar apartments or these people that are on section eight well I. What we need to do is just stay vigilant and make sure that when we have Lisa may not be there, but let's just you know, say none of us will probably be on a community board. You know 20 years from now, I know I won't, but at the same time I think your point is noted. You know and that's a different conversation. Maybe we can talk to our elected officials about conversations with you know, HPD in the city of New York and in their negotiations with the federal government as to some of these things becoming in perpetuity versus from term to term in terms of those project-based vouchers. But unless there's any other pertinent questions, this is Marie Moss I have one quick question: I just want to know is the building completely filled like 100 filled as of right now, or are there units that are available Lisa right now? It's not 100 percent full, but they're. There is still the question of signing of leases. So that's what do you have she's asking? If you have vacancies right, you know in the building right now we do, but I do not know the number right now, but we also, but that still goes back to there's a lot of tenants in here that the leases are not signed. Miss Harris, let me say this again that whether it was Covid-19 or an oversight, we will get you. The leases I can guarantee you and Charles I would like to think he can guarantee my guarantee that we will get leases. I will stay on top of that with Shatek Mitchell and also I did send you Lisa Harris's number in the chat. So hopefully you have that I do not have the answer. It's in it's in the owner's interest to continue to keep the building rented, so I we can get back to you. I can share with Charles or Miss Harris. The exact number I do not know the answer, but it's within our interest, as you can imagine, to keep the building rented all right. Thank you. Everybody we're going to move the agenda as I know. A couple of folks who are part of this espionage gardens conversation is have some time considerations. So I'm going to move to the espionage, gardens, maintenance, question, they'll senior I know you asked you know when we were going to get to that and I also know that is Mina White still. You know with us yeah some months, okay, so Mina! You had started talking about something, but let me just give a little bit of a background in context as to how this guy get this got to our agenda. We received from a resident of Esplanade Garden satique did who shared it with me, an expression of concern regarding the fact that they got a notification very recently and Shatik I believe you are able now to share the screen. I had asked that notification and then Mina for you and shauna. You both received some fact sheets. You know relating to conversations with Commissioner Carroll Shatik. Do you want to put up the the notification to the residents you know of that development? That's the the fact sheet. You know shetty it's that letter, that we would that I believe that the resident shared with us all right give me one second, while we're waiting on that sheet to come up man, please ask a question: just general information are all of the buildings in Esplanade gardens, considered section eight project based or just specific buildings, they're Mitchell, Llama co-ops I do not believe that they are similar to 95 linux, I'll, defer to Del Cenia on that I believe that these are no they're. Not it's mitchell, no they're, not yes, no they're, not it's mitchell! So we'll get to that, because there is an aspect of that reflects an effort now and you'll see that in some of the the next document that comes up. So this is what we received. We received. You know a notice that came on October, the 1st from the board of directors to the espionage shareholders, and in that it actually indicates. You know that you know commencing. You know. Just to summarize. You know this letter. You know that there would be a 17 increase in year, one scheduled to commence on November 1st 2020, you know, and that you know would then be an additional. You know series of increases over the next. You know three, you know over in 17 in year, one eight percent in year two and five percent in year three, but the 17 percent would go into effect on November, the first, so a tenant sent that to us. We indicated that we would, you know, look into it and and put it on this particular meeting agenda. So I know that there are representatives of espionage, gardens and we'll hear from you, but shati can you put up the other fact sheet, which I did not want to go to meena white, because I think that mina, that's what you were referring to when you started your presentation a little earlier as to what was sent to you from HPD commissioner louise carroll, so Shitty, can you put that other one up that you had the the fact sheet, the one you had up first and Charles. The fact sheet that Shatik had put up first was the fact sheet that Senator Benjamin's office got from HPD, Commissioner, Carol, Correct and I. Think I heard you know referred to the same thing so as you can see that this you know talks about some of the same thing. The letters reflected it talks about some of the reasons why you know this particular increase is moving forward and it also then talks about what you know. Why is the maintenance increasing now how much will I have to pay? What if I can't afford this maintenance increase, and it then refers to scree, which we heard Mina referred to in terms of people who have applied for it and then section 8 rental, housing assistance. So I thought it would just be a good idea to have espionage guns on and representatives from Brian Benjamin's office and Assemblyman Al Taylor to just talk about this issue. So I'm going to open it back up to you mina to continue with what you started with earlier and if you want to keep this on the screen or you or shawna, and we can do so hello hi, so just like I was mentioned so just like I was mentioning earlier. The assembly member did have a conversation with HPD. Commissioner Carol again, this increase was supposed to take place last year and it's only taking place now, and you know it I believe that first letter was sent out to shareholders on October 1st, so literally like a 30-day notice. So again, our office received calls. Hpd did originally plan to reach out towards the end of October, but our office did push that they reached out to shareholders. Sooner because we were getting calls and we knew that was going to be- you know a big. You know scare reasonably so so in speaking to the intergovernmental team at HPD, they've been outreaching since October, 15th and they've been in s1 for about nine days now, and they got about 168 applications. Thus far our office I know I do not have the exact numbers, but we've definitely done over, like 10 applications for spree. Again, we are in person on a limited schedule: Monday Wednesday, Friday, 10 A.M to 4. but yeah. That's all that I have so far, but I'll be on this call. Shawna. Do you want to add anything to that? Because it was actually your document that way? Yes, so Senator Benjamin was in conversation with Commissioner Carol I was on that call too, and she provided us with the documentation that you're looking at now. I think the biggest thing is because we were supposed to get the increase last year, but a lot of the issues that we've been seeing and I live in. Esplanade too, is that a lot of the shareholders complaint is that it's Covid-19 time now and does the do. Does the maintenance increase have to take place starting November? The first? Can it be pushed back so I think that was something that we were trying or in discussion to see, if that's something that maybe can be done, because a lot of people have lost their jobs and are trying to figure out where money is going to come from. So this increase right now seems to be a lot of people have issues with these, with the rent increase going right now we do know that the rent increase needs to take place. However, at this point in time, the rent increase, maybe should be held off. So that's where we are trying to see how things can be worked out. Regarding that. Okay, thank you can unshare the screen and then we can then go to board members for any comments or questions you know and then to the community, and we certainly want to hear from representatives of you know: Espernard Gardens has anyone raised their hand, don I see you unmuted? Do you have a comment? Are we're going to go to board members first and then Miss Reddick we'll come to you so any board members, they'll senior, Doc Anna's, raise sorry all right, god going to go ahead and then marry Moss after you, okay, so my question is section 8 and scree are rental subsidies from the federal government. These people in Mitchell Llamas are homeowners because that's a co-op. So how does the city or the HPD able to finagle the federal guidelines to include these people and when someone figures out that something's wrong or something is amiss? How and it changes back what happens to these individuals? That's my question: may I speak may I speak I. Am a community person I live in esplanade? My name is millicent. First of all donna we are not homeowners. We only own the shares of stock attached to our unit. We must live in the unit in order to be a shareholder. Mitchell Llamas were built for low to middle income individuals. So we were never homeowners. We were always shareholders with the agreements that we would have to occupy the unit in order to be involved in this process, we were probably the first or the only totally 100 percent african-american shareholders back in 1967 and 68. So that's a little about history. Moving forward, we in May of eight of 2018 had the first hearing ever held by HPD around this potential increase. In doing so, it was based upon the fact that the failure of HPD with all Mitchell llamas throughout the city, not having done their job of that, is to maintain our units in a way where would become livable. It is now astronomical to repair. Having said that, my concern are a few things. One, the capital improvement project is indeed needed. There's no question about the need for the work. What is my concern is that the capital improvement work has not even started on half of these six buildings. There's 1872 units here, maybe 600 of them, are close to completion in the process. I must state that our units are being destroyed in this process. That's a whole another discussion. We at that time said to HPD: how is it before the work is being done, that you will impose increased increase on Us capital? Improvement generally means a pro. How do I want to say a not a mortgage loan, but a construction loan and construction loans are never converted to mortgages until after all, work has been done. Having said that, we know it would be three to five years before the work would be done. A punch list needs to be created, a walkthrough must be created and a sea of oh must be obtained once all that is done, then you would convert to a mortgage. We are nowheres near that having that in case and the work not being done, there are other mortgages that are being held by us, but Shauna and others shawna. You can respond to this as members of the board. What my concern is, how is it the board never applied for PPE monies during this period of time of Colvin when units down on Avenue, D and 80Th Street and other places have indeed applied for these monies in order to maintain the facility, we also need to understand. Why is this progressive, because this is more than 30 when you take 17 based upon the maintenance and the utility, and you put 17 on that and then come back a year later? You then add eight percent on the new rate. Okay and then you add five percent. It then becomes a 33 increase, so it's never truly a 30 percent 65 of us a senior citizen. Many of them who are work who have worked are above the screen level and can not obtain section 8. Those are our concerns and the last concern that I have is that when you apply section 8 to these types of development and more and more section 8 becomes available, we lose our status as a Mitchell Rama co-op. We will no longer be a Mitchell llama Koa, so it is as though, while we were here, I've been here 53 years. Well, we've been here when no one else wanted to be in this community and we made this a viable community and we have watched HPD to this very day failed to do its job, including not providing us with a 30-day notice. We were not given 30 days. We were giving roughly 27 or 26 days notice in advance. So how do you impose this before the work is completed? How do you impose this during Covid-19? And how do you impose this when we look at Midtown in downtown where people's rents are going well, rsa and them are losing money because they can't rent up these units. Yet up in Harlem. You want to give us market rates when you know downtown, they have to reduce the market rates for the mere fact that many people are saying hey, I'm a work from home I do not need that apartment, so you're losing rents everywhere. It says, though, at the other end below 96th street you're losing rent, but above 96th street you want to impose us to take care of the needs of where those realtors have lost money at the lower end of the town and coming up this end last thing I want to say to everybody is that Gary Swellman is no longer there. Therefore, we have no idea who will be coming in and when you look at 2 to 11 conversion, which they started this in Brooklyn. This is not in our best interest period, so Mrs Reddick. Thank you so much for that. Before we go back to either shauna or Mina I see Marie Marsh, you have your hand raised and then I have a couple of questions so mari Miss reddick. That was amazing. Thank you for that entire breakdown and historical knowledge. Background of this entire situation. My question: you really touched upon what my question was going to be, which is why do these capital improvements have to come from increases from the co-op shareholders? I do not understand why there are not government subsidies that are available when there are capital- and maybe shawna can answer this. There are capital dollars that are available for capital improvements on buildings and developers get those subsidies all the time. So why could not those apply to esplanade gardens and then? My second question goes to my bigger concern longer term, which Donna gill brought up earlier in the previous discussion is the number of apartments which are basically empty. You know, I know, esplanade, has a number of apartments that have been empty for years as a wait list. Over 55 units are presently empty, which means that's a sign of warehousing right yeah, because so full disclosure I live in Linux terrace, but my name came I did put in the HUD program to go to esplanade and my name came up now. That's a whole nother story. I do not feel like getting into the process which you well know, but I just want to know. We I think we have to think long term as Don and Gil was saying we got to think 10:20 years, even though we're you know, some of us may not be on the board anymore, serve on the board and so forth. We have to think that way, because we have to protect the future of Harlem and we have to protect the future generations that will inhabit, because this is still a very good program for people to be able to live. You know their lives. My aunt owns her co-op in Jackson Heights. You know they paid for the whole building, so you know she does not have to pay anything but a maintenance fee, but that's not the case on any on a lot of other co-ops that are throughout the city, so again, number one. Why are there any capital budget? Are there subsidies available through the government that can cover this cost instead of imposing it upon the residents and to what can we do in regards to you know protecting the co-op situation going forward? Thank you, murray I. Actually, you raised in one of your questions the same question that I had which I had invited actually and representatives from Bill perkins office to be on this call, because that city, government and HPD a city government I, concur with you, ms reddick, you did a great job of summarizing it as Shauna indicated. You know, the concern would seem to be. Why now, especially you know, I mean given the fact that we're in the midst of Covid-19 and I certainly know as a housing developer myself. I know that Mari is correct, that there's all kinds of you know, programs relating to capital and I. Think you accurately summarize the fact that, generally, it is post-construction that things then convert into those long-term mortgage obligations that you have to then begin to start amortizing. So I guess my question for Miss Reddick and others from aspen on gardens and I see Daryl senior you you know, and I certainly want to hear your comments on this. What can Manhattan community board 10 do in support of you. I asked Jonah, Hamangoff and Mina White to be on here, because I want their representatives to hear our voices hear your voices. What can we do now? I agree with Mari I agree with Donna that we all have to think long term. But what can we do for you right now? I would say the most significant thing I would agree with shawna slow it down. I do not believe we should do this until the economy is in better shape right now the economy is dead for most part, so it's senseless to bring about an increase when the majority of the people who have no jobs, look like most of us in this zoom conference, which means we'll become homeless. If this absolutely happens now, I agree, I know myself and others do qualify for screen, but this is bigger than me. There are many people here who do not qualify for screen degree or section eight and they've been shareholders, and my neighbors for well over 30 plus. This is to me, a format to displace us in a way that many of us are not even thinking about and using section 8 as one example section 8 is not in the best interest of most people who are in Michelangelo co-ops or in co-ops, because in the long run then- and let me just say this, even if I do not talk about the long run, what we do know is that section 8 has the ability to cut back, and so what happens. This is not going to be a building based. It's going to be individually based right, that's very important right. What is going to happen to these residents and, what's going to happen to alcoa that was controlled for well over 50 years by african Americans, we're the only ones who are totally african or were totally african-american, and it's like guys, you're not going to have this status much longer. If we keep going at the rate we're going so they'll see, you know, I saw that you had unmuted yourself. Do you have a comment? No I have a question. I do not need to add anything to what Miss Reddick said. She broke it down all of the details. She was preaching the truth and I have nothing to add to that. My question: is there anyone on this call who was a part of the conversation with HPD? Are there any board members any of the Esplanade board members on this call? Well, Sean: are you still a board member, so I used to be a board member, I'm no longer a board member when I was a part of the board and thank you so much millicent for that history. So millicent came in years ago into espnr. At the same time, my parents came into espnr, so they were one of the original people to move into esplanade. So if anybody knows the history of esplanade is definitely midlisting. So thank you so much for that history. So when we were a part of the board they were supposed to, when I was a part of the board, they were supposed, we were supposed to only get an increase of no more than 25 percent, and so immediately, once I got off the board. I'm seeing new things saying that it's now 30 percent, so I'm a little confused as to where the increase came about, and so so I was on the board. Originally, when we needed the increase because, like we said, we took out some loans and that's when our needed capital improvement work now like millicent said this could be slowed down, I think and so I think we're just trying to figure out how this could still take place to increase during Covid-19. So we're just trying to see if anything could be done so that way, tenants are not displaced from their apartments and like I'm, not one of the ones who qualify for like spree because I'm not of age or jury or section 8. So you know there are people that fall as shareholders that fall into that line of we do not qualify for any of those things. So we're then trying to see how could this be at a standstill right now until this whole hover thing has you know, gone away so I see that I mean that did not really answer my question because I'm still concerned about the fact that none of the board members are in this are in this call because they're the ones who made this deal with HPD. They are the ones who know what the capital improvement costs are, and we can't ask them those questions. Josina, I'm sorry for interrupting one of the questions I have had from the beginning of this process. Even when we spoke with Gary Sloman is as a shareholder. We are entitled to see the Aia. The Aia is indeed the budget that tells us about their spending, their drawdown Charles, you understand where I'm coming from. We have not seen the Aia. The Aia is important because it allows us to understand actual spending and then waste. We also get an opportunity to see where change orders come in and the biggest concern I have is that when you open a wall to do capital work, you have no idea. What's going on behind them, walls, therefore change orders and everything else can come along our apartments by the plumber alone. Our apartments are being destroyed. We have walls that are being left open for 15 and 20 days. We have asbestos issues, we have rat infestation, all we have rodent, I mean roaches and all of it as a result of all of this- and it's like overwhelming 65 of us- are senior citizens they're, not taking us out of our units. While this work is going on. So imagine in the daytime. You have no place to go during the day and you've got your drilling. I mean it gets so bad. You feel like a crazy person, because you can't control you can't talk. You find no place to go in your unit to avoid the noise that's going on and everything else. So there is health issues attached to all of this and we are going to pay at every level, not only the increase, but because our health will be compromised by all of this. We are going to have increases in health bills, and so all of this is of concern to us and if we could look at the Aia, the Aia would tell us a lot. We know without a doubt that there is some real serious problems around pop people's pockets being filled with kickback money. It's obvious, you can see it and all of that, I'm just throwing it all out. No I think Miss reddick you're, giving us all of the things that we need to address and the fact of the matter is I do not know if shauna and Mina, but you know we I'd like to you- know I'll put my number in I like to schedule something with you. It is clear that this issue is not going to wait until the November housing committee. You know meeting the latter part of November that we need to be in contact with each other, so I'm going to recommend if there's any other board members that want to join- and I'm saying later this week no later than this week, I certainly like to be able to present this matter to our I, see. I know cecily Harris is on the call to our executive committee meeting on Wednesday I know this is not a voting item for housing Committee, but it is not. You know it's a matter of urgency. I think you just gave you know even the best reason, by the way my father passed away in October of you know 2018, and he was there in 67 with 700 Lenox Avenue apartment 19i. Until the day he passed. So I am well aware of that incredible history. So I'm just saying Del, Senior and others I know. Gregory Baggett has a comment, but I think we need to schedule something this week, I'm willing to gather together anybody else. Who's willing, shatik and I will obviously be on that call Miss Reddick anyone that you can bring in and I think their seniors point as well taken. You know, fine, let's find a way to get someone from that board from Esmenard gardens on these calls and let them know what we're thinking Shaun and I'd like for you I think we always just got to say something. I'm sorry I think we need to get someone from HPD and you know and I agree Delsinia that we need to speak. I do not have any problems I. Actually you know reaching out directly to you know, commissioner carroll or someone else on the commissioner level. I'm not looking for us to have a conversation. I know enough about HPD to know we do not need a mid-level messenger. You know we need a policy maker. So I do not. You know. I know enough about that. You know the hierarchy at HPD. If it's not, commissioner Carol, then you know give us. Your deputy commissioner of development, give us your destiny asset management. You know, commissioner, you know let's bring in the people that can give us the answer. So what I'm saying is that I'll put my number in the chat? Please call me tomorrow and let's just schedule a follow-up call this week. I do not think it can wait and then I'm going to turn to Shatique. You can unmute Gregory Baggett had a question yeah, I'm sorry one le I just want to clarify something we want to. We want to have them come to the executive committee meeting. We want to have the. When do we want to do this job, I'm going to have a call tomorrow with Miss Reddick and I'm going to see what we can bring. You know we, as a committee chair to the executive committee, I mean obviously Miss reddick you're welcome to come to the Ec, just make sure that Miss Reddick and anyone else will mess with our gardens. It's an open meeting, our executive committee meeting, I'm just saying that it'll take us a minute. I do not think they'll see you that by Wednesday we'll have the you know the agenda or meeting schedule we're doing whatever we're just going to update the Ec on this conversation this evening and the urgency of this matter. Okay, but the urgency is to get to is to have a conversation with someone from HPD. This November 1st is Sunday yeah. So if we can get that together by Wednesday I know, we have two representatives, you know I know, you're wearing a housing committee had but I believe we have another person from the public advocacy office, and so let's make this happen. Okay, all right, miss reddick! You have been amazing. You know we are very grateful gregory before we turn, and we know we have our marching orders, you know, did you still want to ask a question or make a comment? I mean as much great information as was shared tonight. I mean I, really am kind of full, but I did have one question. I wanted to ask. Miss, Reddick and I was curious if the shareholders in Mitchell Llama buildings have any vote over assessments or maintenance increases, or do those things happen from the board without shareholder, but this is from the board without shareholder involvement. The problem that I have is that there should have been assessments in the past. They were not because assessments will run for a period of time and then removed. That has never been the case here. We have no idea as to what is the actual reasons other than words. There should be numbers, for instance, if Con Edison has gone up by 3, then I should know that's being passed on to me. Something of that nature should tell us as to how they came up with this 30 percent and makes sense for all of Us numbers. Do not lie that's clear, but do not give me an air of thought. I want to see facts and that this board fails to do over and over again in the past, using co-op city, which is also one of the largest mitchell llamas. What co-op, what they did was they evaluated and asked the shareholders which one in the long run would benefit us an assessment or an increase. This board and I believe this from my heart does not even understand because most of them have no financial backgrounds whatsoever, and so therefore, whatever is presented to them both by management and the legal team, they eat it and keep moving. It's not the way to do business. It's not the way to do. Business numbers tell us something. We have no numbers. All we know is we're continuously being slapped with an increase of some nature. It needs to end so we know thank you again got to move the agenda. Gregory. Thank you for that. You know comment, I, think that's an important point you know have to I want to turn to because I know she has a time frame on our agenda just for Delsenia Glover to give the housing committee and board members in the community a quick update on what we're doing with our district needs statement, because I know, Del Senia has a time frame and miss Reddick. I did put my number in the chat for you. Okay, thank you. Okay del seen, yeah you're muted should take that we need to unmute her yeah. No, I'm unmuted. Sorry about that. So let me go back to my sheet, so we representatives from over the past several weeks, representatives from several of the community board committees, have been meeting weekly on sundays to prepare our yearly district needs statement and which includes budget budgetary items this year and I do not know if we did it last year, because I was not here, but we also did a community survey for what folks in the community and on the board, thinks are important things for us to be asking for, and we got about 50 responses and we included those recommendations were feasible. So the a final draft will be presented at the executive committee meeting on Wednesday and then to the full committee at the November 4th meeting, so the areas that we included in the district needs. We did not go to every single thing that we work on, but we went with the idea of choosing the things that most reflect. What we think are what we in the community think are important. Bear with me, because I have a I pulled, I'm having some technical, different difficulties, so the type is very small and our pressing needs include public health, which includes gun violence, Covid-19, mental health, substance abuse and domestic violence, education, including remote learning, resources, capital improvement, staffing shortages and access to Wi-fi. We also looked, we also included, let me scroll down to the next section, I'm going. We did. We have really substances, it's a really long document and we have substantive pieces in each of the categories, but I'm only going to go into detail on the housing, I'm just giving you the out the outlines of the others. We also looked at multi-generational technology, then we included transportation issues, parks and recreation, economic development and housing and land use for the housing and land use section. Our priorities include I'll, give you some bullets, but our overarching sort of view of what the community needs is more affordable housing. That's the most. We consider one of the most pressing needs in the community. We want one of the things that we were asking for is income targeted housing rather than MIH, because MIH has not been necessarily the best thing for our community because it builds in the MIH includes more more luxury housing than it does affordable in the affordable levels. Affordability levels are not deep enough, so specifics are section 8 vouchers and also project based how affordable project-based section 8 housing. We also include it. I'm really sorry this time, I'm having technical difficulties and I can't bring up. I can't make my type bigger, more supportive housing for seniors and handicap community income based AMI as the way the manner in which we determine what is affordable and what is not use of existing housing vacancies for priority permanent housing for homeless families, currently living in living in shelters or temporary housing. I do not know how many people are aware of this, but 40 of the students in the new in the public school system in central Harlem are living in shelter or housing. Insecure, that's a huge number. We also are looking at greater tenant protections against displacement, including, but not limited, to immediate expansion of right to council, as you probably know, right to council is something that was passed back in 2016 I think it was which means for people who people renters at a certain income level, which is very low somewhere in the 20s, are eligible for to have an attorney if they go to if their landlord takes them to court for eviction, and we would like to see it's currently in certain zip codes and we want it immediately expanded permanently, not it's already expanded due to Covid-19, but we want it permanently expanded to all of the zip codes and also with an increase in the in the level of income that a person can have to in order to take advantage of right to counsel a moratorium on Hdfc foreclosures and lean enforcement, more green spaces for affordable housing developments and a central Harlem rezoning study and creation. There are we we've detailed, a lot of these pieces out in the narrative which will be shared with the community and the community board on November. The 4th after we take it to the executive committee on this Wednesday are there any questions. That's thorough, dulcinea, very thorough. This is mari. It's just saying, I think I was listening intently, for whatever loopholes I could find. I can't find anything that really encompasses very excellently what needs to be done in our community, so thank you. Del Senia I want to also acknowledge Karen Dixon's involvement, since we were doing a lot of our things. Joint land use, housing and economic development and terry wisdom has been the representative that has also supported matters not just relating to housing, but has been a great input. You know on other matters, so every committee had been asked to provide information and you'll begin to start seeing the manifestations you know of that. But you know we also want to acknowledge Joshua Clinton, who presented at our last meeting and all the work that he's been doing and gathering folks together on Sunday afternoon, meetings at 1, pm and folks have been very intentional. Sisley Harris has been involved, Shatek Mitchell has been involved, so I think it's a and Kevin Bitterman and I do not know. If I forgot any other key persons, you know, but it has been a really good team effort and Del Senior has represented. You know: land use and housing as well as Terry and I think you know we have some good stuff for you to say mari that you do not see any loopholes. That means a lot because you are a discerning individual donna. You have your hand up, yes, can I just throw in one last thing, just one last thing, my my intrepid staffer here, evb enemy, who's, just who's sort of like my go-to for HPD stuff. She just reminded me that we did not include a racial impact study for any land use decisions or rezonings, and that will definitely be in the document. Thank you for that evie great. Thank you for that. That's. Why that's why? Yes, so that was my point. Part of that racial impact statement was actually I think is extremely necessary. Additionally, I did not hear anything about elevators in the subways for the elderly. That's actually in the transportation section. That's on the list in transportation. She was just really given a snapshot of the other. You know so when you see the document and it will be discussed at the Ec Donna you'll see you know all of the details. She was here to give me a snapshot of some of the other things that other committees have covered and focusing specifically on house no child like. Thank you. I appreciate that I was just concerned because being a member of the senior task force and I know speaking to seniors, that's an issue with them and I'm happy to hear that it's in the transportation- let me just say, I should have mentioned her Donna Deborah gilliard has been really a major contributor to the district needs pieces and yes, she's spoken about everything that you can think of. That involves seniors in education, seniors in healthcare, seniors in housing, seniors in transportation, I mean even to the extent of talking about the issues of seniors crossing streets. You know with bike lanes and other you know other things there and the cars speeding up and down no police enforcement. You know the number of seniors who have been being hit by you know bikes and cars and other things don. You know Deborah has been on it am I, correct, Del, Senia and Karen she's been all on top of that, so you're going to see a lot of stuff in there for seniors. Okay, I'm happy to hear that. Thank you, Charles. Thank you. Delcinia. That was great I just want to move things along. Excuse me, yeah I just wanted to add one other thing and that may be in there and I know we talked about it in some other meetings, but there are a lot of uneven sidewalks, particularly in Harlem and many seniors, and other people have fallen and been seriously hurt. So that is like an extreme, an extreme situation. It's not one person, I! Think. If you did a study, many people have fallen and really had a rough time because make a note of that and just make sure that we are referencing that point in our final versions. Okay, so again want to move the you know the agenda along I put in something about NYCHA, because I believe that this committee has not- and you know, really paid as close attention to NYCHA as we need to so I. Do not want to lengthy conversation, you know today, but I'd like for committee members and board members and I've spoken to Sicily and others. You know about this that we really consider the necessity of being more intentional about what's happening in Niger, what's happening with Brad and what's happening with pact and what's happening with, you know the articles that we read every day about lead paint. You know and other you know poor conditions, and you know we know that. That's if the essence of multi-generational living you know or in nature. You know developments which leads to domestic violence and leads to all kinds of you know other kinds of things. Any of us who live in close proximity to our housing developments, also known pejoratively, I think as projects. You know that we know that many people are just spending most of their time outside I mean I, know in my developments near me. It's 24 7, because you know it's just probably difficult in Colbert 19 for them to really deal with it. So I'm going to say for next month's meeting. I'd really like for committee members to really think about how we can be a little bit more attentive and intentional about NYCHA, I'm even thinking that we may want to consider a subcommittee. You know just on you know, NYCHA alone, because it's that broad and it's that involved and so I really just wanted to throw that out there not to have any conversation about it, but just to say, let's be on the alert and let's bring some ideas to next month's meeting. Any comments from board members on that I did put a paragraph in the in the district needs state statement about NYCHA I did not re I did not read through it here, but that's very much on the radar in my in my professional job. We're doing a lot of work with NYCHA right now, particularly with the information that just came out a few days ago about the lead. It's in the it's triple the number that they certified back in 2018 and we know that any levels of lead are unhealthy and unsafe, and this is in apartments where children, six and under live and we're doing some work on that right now at the public advocates office, because it's criminal but yeah I will definitely be a part of that conversation yeah. We need to really just you know, I just you know, just in thinking I know, we've done we used to have an Hdfc subcommittee and I'm just thinking with everything that's happening with NYCHA, so many moving parts. You know, let's bring our you, know our ideas to next month's meeting and how we can be a little bit more attentive, a lot more attentive and more intentional about what's happening within NYCHA, so we actually have one person who's been very patient. Who would like to make a presentation you know to us I'm going to move to by the way before we go. Anybody want to share the old business before we get to his presentation, which craig said it will be part of new business, any old business, so craig introduce yourself. Let them know why you're here tonight, you've been you presented to us previously, but let us know you said you have a new project that you wanted to. You know prize the committee on that's right and I'd like to introduce our geographer Project CEO tori Lyon she's, on the call welcome to Ari hi so yeah. Thank you so much for inviting us. I've really enjoyed the meeting Mr Powell, you run a really good meeting and I've really been interested to hear all of the comments. So we have just. We do not even need to do the powerpoint, because I realized it's only just at eight o'clock Jericho has been in the central Harlem community for almost 30 years we operate a permanent, supportive housing residence at 2013, Adam, Clayton Powell on the corner of 121St Street. That project is 30 years old we've, it's undergone a number of renovations over the year into 56, formerly homeless, individuals, and we are doing a major renovation and we are looking. We we've already we're well along in our plans and we're looking at a various financing sources. Before Covid-19 we were planning to just go to HPD and, as you know, their budget was that some of it has been restored, so we're hopeful that we can still be in their pipeline and but we're also going to New York state. That's it yeah we're also going to New York City to apply for some capital funding as well. So you know this building has been a part of the city for a really long time. It's been through many changes over the years. The neighborhood has been through many changes, as you know, and so we're looking for a measure of government and private funding to to keep it as supportive housing and as part of the you know, renovation, we will be signing a new 30-year regulatory agreement so that you know guarantees that the that the project will be affordable for another 30 years and, like the other project you were talking about earlier, we do have project based section, 8 vouchers there through NYCHA and craig I, need to add anything that I might have missed. Just to echo, you know what tori was saying: the proposed work is going to be a moderate rehabilitation, so all new kitchens bathrooms replacement windows and the storefronts maintenance work to the facades into the existing fire escapes new common spaces, laundry facilities and an exercise room so really improving the quality of life of the existing tenants. And if you have any questions, we're happy to answer so we're not increasing the the number of units, we're just we're just reconfiguring, and can you guys just tell us a little bit about your? You know your supportive housing who are you targeting? Well, this is about what's considered in New York City, like a general population, supportive housing residents. So you know supportive housing, as you know, is targeted to individuals in the individual or families in the shelter system who have an identified need for social services. So this building only serves a single individuals, because it's a single room occupancy. We have folks who have histories of mental illness, substance use disorders primarily sometimes both and we have 24-hour on-site staff. We have case managers, we have our counselors, we have a health care coordinator. We provide a number of holistic services to really wrap around and wrap around services to meet any need that our clients have. We do benefits counseling, so you know we really provide like full service on-site services and we've been doing it for almost 30 years. At that same location, any questions from and by the way, tori and we'd like to have you back I knew that time would probably not allow us to do a full presentation, but I just want to open it up to see. If there are any questions from housing committee members or board members or community, you know members and again the time permits for you guys that would come back and do a more detailed presentation in our November meeting we would love to express. Is that we, this is going to be a renovation with tenants in place. So we won't be. You know, relocating anybody hi. This is Mari. Moss I had a couple questions. You said you had 56 that you're serving right now, how many units do you have total so right now we have 48 units and because we have some double rooms, but what we're doing with the renovation is we're going to we're going to get rid of the double rooms and add some units to the ground floor. So it's still going to be 56. You know like people, but it's going to right now. It's 48 units, but it's going to be 56 separate units going forward. So we do not. We won't have any like shared situations: yeah we're getting rid of the current double units- yeah, okay and then how do people find out about your program or how do they get notifications, or how does the word get out about how to get your services? So we get all we get all of our referrals from the Department of Social Services Department of Homeless services. It's like a coordinated assessment program or process. It's called caps, coordinated assessment. I can't remember what it's for sorry, but so we, you know they're we're working with people who are in the shelter who qualify for supportive housing, so they have to go undergo like a psychological evaluation and and be determined to to be to qualify for supportive housing. Thank you. Any other questions. Miss redding, you had a question. Yeah is this: is on 7Th Avenue this building? Yes and 121st it! Okay! Is this the I guess supportive housing that has been there all of these years that you're now renovating, again and you're, going to hold the same type of population as you had before. Is that the idea that's correct, so the majority of them would be men if I'm not mistaken, or is it a mixed combination within this? No, it's actually 50 men and women. Men and women are single, no children, no children, no children, okay, so I think craig and tory what would be helpful going to one of Mari's points. You know it's helpful for you guys to share with us. You know and come and report back to us on the progress of things but I you know to get to everyone's. You know concerns and points we always like to know you know. Is there a resource that's available to us in this district that we might be able to? You know we get constituents. You know who are in need, so we're hoping that this could be an informational pipeline and also a referral pipeline. So please send us all of your information to our district officer, Shatek Mitchell, so that we can stay. You know a prize as to how things are going and how the community responds. So, for example, you know we're always sensitive to the fact that, with any form of housing and with renovations, you know taking place. You know, what's the community impact, so please share with us by the time you come back next month, your outreach to your neighbors and to others, and you know as to what you're, contemplating and planning and what your you know, what your construction will be and we're always concerned about Noise Miss Reddick was just talking about what are you know what some of the issues are when you begin to start doing these renovations with tenants in place? You know it sometimes can be a you know, a horrendous experience. You know for them just rodent infestation and things of that sort. You know noise dust, we're a community that deals with lots of asthma, so I do not know if there'll be any anything that we need to be concerned about, but certainly noise pollution. You know air pollution and anything even with internal renovations, we're concerned. So please share that information with us when you come back in November, we'll do yeah, okay and one last thing. If I can add, Charles we're really committed to using minority-owned businesses from the local community, so if you know any contractors subcontractors, we already have a a black-owned architecture firm that we're working with who they're they've been amazing to work with. So we're really looking to you know, leverage local resources. No, that is very important for you to say that it's all about employment and it's certainly about making sure that many of our minority businesses are eligible and being considered. You know for these things, so yes, I'm going to ask that you give any information about that from shatek and will absolutely help facilitate identifying. You know what we think of some of our eligible candidates. You know that we'd love to see if they can participate in this accountable for that as well. So, okay, yes, absolutely I have a question. My question is: can you give us also a what percentage of the people that are currently living? There were previously bought 10 residents, because you are getting this in the clientele from the Department of Homeland no department of homelessness and HRA. So I'm thinking that I, though it's a wonderful service and it's actually in our community and I, really appreciate that I also want to know what percentage of people that will prior living in this community are currently returning to this community that that's the question. I have okay, so if you can provide that I will do my best to answer that. You know I can check in our in our health care records if we have their like their the zip code where they're coming from, but this was a project that is like 30 years old, but I think I can I can try to get you a snapshot. At least that's okay, thanks! Thank you. That would be wonderful. I appreciate that Donna's an excellent point. What we find all times and that's a land use issue, and it's also a housing issue, and certainly you know Don, is pointing out a very good point. We are asked sometimes to support projects and programs. You know which, unfortunately, does not benefit people from our district. So thank you for that donna, that's a great point and tori. You know we look forward to getting that information. Any final comments on this before we actually adjourn this wonderful meeting, so I just want to thank just putting my email address in the chat and, if you know anybody who's homeless and need supportive housing, please feel free to call me if we can't have them on Adam Clayton Powell. We may have other ways to help them. I'm going to call, you know, put your number in there or even if it's in the private chat thing, because I have someone I need to call you. So yes, thank you for that. So I just wanted to thank someone. Everyone who's been on this. You know on this call I think it's been a great call I, so appreciate you taking the time out of your busy schedules to everyone. You know we thank you. Shauna Harman Goff. You know we thank you. Mina White, you know we thank, you know, certainly miss verdict. You gave us, you know our marching orders and extremely inspiring gregory Baggett you're, always on the calls. Thank you so much and for those you know who, on my you know, committee, you know thanks for this. We got some work to do, and that means this week and, of course, I'll be presenting an outline of what we're thinking about doing already. Delsenia, Glover and I have exchanged. You know you know in the chat who we're reaching out to at HPD on the commissioner level and we'll be on that tomorrow. So unless there is something further craig and tory, thank you so much for presenting this evening as well and I see your information in the in the chat. So unless there's something else, I'm going to ask for a motion for us to Adjourn, so moved motion to Adjourn. Is there a second okay? So you know without further ado. The meeting is formally adjourned. Everyone have a wonderful evening. Sheryl Douglas I, always see you on these meetings. Cheryl and I have known each other for a very long time. You know they're so glad to see you, though you do not look like you've aged the day. You know. Thank you all right, love you all and God bless you and have a wonderful evening. Okay, you too, bye-bye! Thank you. Thank you. Bye! Everyone good evening have a nice night. Thank you.",
            "summary": "I'm the chair of the housing committee, Manhattan, Community, board, 10 and just want to welcome each of you.\nAs, our you know, housing Committee, continues to progress and identify issues that we should be very proactive, about, or at least aware of and taking some interest in or taking some action on behalf of.\nI thought it was a good idea to have some of our representatives of elected officials to join the call for some brief comments to offer guidance later on in the meeting you're going to hear from Delsenia Glover as to the work that you know, community, Board 10 is doing on district needs, which will help.\nYou know also give our elected officials some feedback from us on things that we've been addressing, especially on housing and also on land use and economic.\nSo without further ado, I believe you know satique and by the way presentations as you can see, we're going to have.\nWe already talked about the district needs statement, we're very happy that we're going to be talking about the you know, the espionage, gardens.\nOkay, so I'm going to call upon I, see Shauna harmongoff from the you know, Office of State Senator, Brian, Benjamin and happy that you've joined us for some remarks.\nAnd I know we're going to hear from Mina White from Assemblyman Al Taylor's office, whether or not between now and next.\nThat folks have said they've yet to hear so I'd like to hear you know from anyone else as this as this meeting progresses as to whether there are any other comments.\nKnow, get your help in identifying some data and some statistics as to just how beneficial that program has been in providing much needed, rent relief.\nBecause of you know that fear, and just like what do you mean it's going to happen in 30 days or less than 30 days.\nLet me just have you pause for a moment, because I just want to make sure that everyone on the call knows we do have that as an agenda item.\nYou know, requested increases in the maximum rents that could be charged within the development.\nThe concern was whether or not there would be any increases in portions of the rent that section eight residents will have to pay.\nKnow, increases in the maximum rents for the units there at 95, linux.\nThis is responsive to make improvements to apartments, specifically kitchens and bathrooms and, as I said, to Charles Robert Horsford Apex, a local company of a fellow I know for many years is going to do the work.\nHud is taking a while to approve to review and approve once the contract is approved, we will begin the process of beginning and what do I mean by that folks are going to continue to live in their apartments.\nThe that is this as I say, the rent out of their pocket will not change, but the building will collect more from the government, and the purpose of those collections is to fulfill that you did a physical needs assessment in all of the units and is that to fulfill the upgrades to kitchens and bathrooms that I believe the tenants are very desirous of yes, absolutely 100, okay.\nLet's go just to the third point, then I'm, going to open it up to committee members and board members and community with any further questions.\nYou know, when folks are not getting lease renewals and they see a letter from HUD to say that you're looking to you, know, get overall increases and the maximum rents to be charged.\nI mean everybody understands that this is not something where you know our housing committee or our district office is being asked for a position but certainly being asked for our assistance.\nLet me just see if any of our committee members first or board members in that community have any questions or concerns they'd like to express at this time, so we're good Miss, house.\nIf per say, the person gets off of section 8, there's no way that these people are going to be able to afford that amount of rent, so I need to know those rental.\nThough you know you have assured them that their rents will not be increased, but I'm thinking about the community and our people getting into those apartments at those prices which seems to me to be exorbitant.\nI understand what you're saying I guess another way of talking about it may be the word gentrification, which I do not think applies, but to improve the building which we want to do.\nNo one is saying it does not need rent increases to improve the building, we're just talking about the amounts.\nMaybe, that information would be helpful, but I do understand what you're saying this is not you know any sort of you know of pass along if I understand correctly, for whatever the level of improvements it's not going to change.\nYou know I'm not saying that you're going to do that, but four thousand dollars for a two bedroom apartment, whether it's renovated or not, is even above market value.\nTrying to you, know renovate, but I think that there should be like breakdowns and ceilings, because in many instances you know whatever is being done to improve is a bit inflated, not a bit, but in some instances a lot inflated and the courts are filled with that.\nSo I think that's something to look at, but in this environment in Harlem, making any apartments that are renovated, where people actually have been living and have been in a community for many years, four thousand dollars, I think it's outrageous.\nSo I just want folks to know the distinction between a project based section, a which is 95 Lenox Avenue, which means Karen that apartment will still stay section, a regulated.\nThat's, the distinction between what happens, sometimes in other rent, stabilized scenarios, where you will have tenants who will bring their section eight eligibility into the you know to the particular you know project, but not necessarily have that unit.\nYou know section eight projects, okay, hello, I've heard that I say can I just say one more thing: I just this is Donna gill.\nSo, that's my concern with when the time is up what happens to these four thousand dollar apartments or these people that are on section, eight.\nWe need to do is just stay vigilant and make sure that when we have Lisa may not be there, but let's just you know, say, none of us will probably be on a community.\nWe can talk to our elected officials about conversations with you, know, HPD, in the city of New York and in their negotiations with the federal government.\nI just want to know is the building completely filled like 100 filled as of right now, or are there units that are available.\nNow we do, but I do not know the number right now, but we also, but that still goes back to there's a lot of tenants in here that the leases are not signed.\nThe exact number I do not know the answer, but it's within our interest, as you can imagine, to keep the building rented all right.\nEverybody we're going to move the agenda as I know.\nSo I know that there are representatives of espionage, gardens and we'll hear from you, but shati can you put up the other fact sheet, which I did not want to go to meena white, because I think that mina.\nIf I can't afford this maintenance increase, and it then refers to scree, which we heard Mina referred to in terms of people who have applied for it and then section 8, rental, housing, assistance.\nI think the biggest thing is because we were supposed to get the increase last year, but a lot of the issues that we've been seeing.\nIf that's something that maybe can be done, because a lot of people have lost their jobs and are trying to figure out where money is going to come.\nSo, this increase right now seems to be a lot of people have issues with these, with the rent increase, going.\nNow we do know that the rent increase needs to take place.\nAre we're going to go to board members first and then Miss Reddick we'll come to you.\nMy question: You really touched upon what my question was going to be, which is why do these capital improvements have to come from increases from the co-op shareholders.\nThe economy is dead for most part, so it's senseless to bring about an increase when the majority of the people who have no jobs, look like most of us in this zoom conference, which means we'll become homeless.\nThey are the ones who know what the capital improvement costs are, and we can't ask them those questions.\nWe are going to have increases in health bills, and so all of this is of concern to us, and if we could look at the Aia, the Aia would tell us a lot.\nNo I think Miss reddick you're, giving us all of the things that we need to address and the fact of the matter.\nIt is clear that this issue is not going to wait until the November housing committee.\nYou, know meeting the latter part of November that we need to be in contact with each other, so I'm going to recommend if there's any other board members that want to join.\nI know this is not a voting item for housing Committee, but it is not.\nYou know comment, I, think that's an important point.\nBecause I know she has a time frame on our agenda just for Delsenia Glover to give the housing committee and board members in the community a quick update on what we're doing with our district needs.\nLet me go back to my sheet, so we representatives from over the past several weeks, representatives from several of the community board committees, have been meeting weekly on sundays to prepare our yearly district needs statement and which includes budget budgetary items.\nWe also did a community survey for what folks in the community and on the board, thinks, are important things for us to be asking for, and we got about 50 responses and we included those recommendations were feasible.\nYou know we also want to acknowledge Joshua Clinton, who presented at our last meeting and all the work that he's been doing and gathering folks together on Sunday afternoon.\nYou know the agenda along I put in something about NYCHA, because I believe that this committee has not.\nI'd really like for committee members to really think about how we can be a little bit more attentive and intentional about NYCHA.\nThere are any questions from housing committee members or board members or community.\nYou know members and again the time permits for you guys that would come back and do a more detailed presentation in our November meeting.\nYou know for these things, so yes, I'm, going to ask that you give any information about that from shatek and will absolutely help facilitate identifying.\nI also want to know what percentage of people that will prior living in this community are currently returning to this community that that's, the question.\nYou know, put your number in there or even if it's in the private chat thing, because I have someone I need to call you."
        }
    }
}