{
    "data": {
        "YoutubeMetadata": {
            "author": "BXCB11",
            "channelId": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "title": "Equity Committee 11/2020",
            "publishDate": "2020-11-12",
            "shortDescription": "",
            "lengthSeconds": "1:22:53"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "BXCB11",
            "normalizedName": "Bronx Community Board 11",
            "twitterName": null,
            "youtubeChannelName": "Bronx Community Board 11",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCG-BOeUcviapIkDFQfxLuiA",
            "twitterHandle": null,
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "FENj7F1nISU",
            "fillerWordCount": {
                "uh": 177,
                "um": 190
            },
            "readTimeFullTranscript": "52 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "equity": 17,
                "years": 16,
                "website": 16,
                "information": 16,
                "gender": 14,
                "terms": 12,
                "public": 11,
                "age": 10,
                "health": 9,
                "agenda": 9
            },
            "wordCountSummary": {
                "equity": 7,
                "gender": 6,
                "parity": 3,
                "distribution": 3,
                "membership": 3,
                "census": 3,
                "age": 3,
                "conversation": 2,
                "head": 2,
                "inequity": 2
            },
            "fullTranscript": "Yeah you do so I started recording at 7:15, it's November 10th 2020. This is the Equity Committee of Community World 11. Darrell all right good evening. Everybody first I wanted to take a silence to remember those we lost due to cover 19. all right. My name is Darrell Bowen, I'm the chairman of this committee, I'm also a member of the economic committee and I have been on the board over a year. Now, I look forward to doing some good things with this committee in the best interest of the community we serve tonight, we'll have a range of things we'll be discussing in our meeting and look forward to a robust conversation being that said, other members will be joining me tonight who are part of this committee, which is Paula Christian, Lisa and Edith, and now I want to give I want them to give a brief introduction about themselves and what's some of the expectations of the committee, we'll start with paula hey, so I'm paula, I'm also like fairly new to the Community Board Darrell reached out to me in regards to joining this committee and like with like the little like overview and stuff that we had of it like I, was very like interested, and this is something that like speaks up my alley. So I was very interested in being a part of this. I'm not really sure what I would say about myself. I feel kind of like on the spot. I usually do not know well. Is there anything else? I'm missing, yeah, you're, being modest, should I just give like a background. I do not know what else to say: you're good you're, good boys, I'm just playing with you all right. Thank you all right. We can go to anybody next. Anybody Christian sure thanks a lot darrell for one chairing this committee and guiding us to this. To this point, my name is Christian Amato I've been a member of CB11 for a year as a board member I've lived in this community board district, my entire life and over the last five years, I've been very focused on organizing in this community. My first efforts at organizing in this community were around daca recipients and making sure that immigrant families were able to gain access to all of the different. All of the different benefits that a daca recipient could have I then organized this community on health care and I've been a part of this community as an organizer for the last few years, and I'm excited to see what comes out of this committee I think that it's an important step in ensuring that us as a board is focused on just representation and I leave it up to you. Thank you. Christian! Let's go to edit all right, I had to mute myself, I'm sorry yeah, my name is and or edit yeah like same like dural contact. We need to join the equity committee and I think that there is like definitely work to be done and I'm just interested to see how we can help. Thank you, Eddie! Do we have Lisa Lisa's not on right? No yeah, she looks it looks like she's on I see a Lisa S, I'm assuming it's lisa. How are you hi, good sorry I think, like a minute trying to figure out how to do that. Give me a second, no problem. You sound sorry yeah, oh I did not even do anything. Maybe you just needed to warm up, probably we're doing this introductions. If you have not heard us, oh okay, yeah no I, just I just joined so I was not sure what was going on okay. So that's fine! I'm Lisa soto on been on the board for like four years now, I think three or four years I live in Morris Park and I'm really excited to be on this committee. I. Think, in light of you know everything that's happening in this country and the divisions that have kind of taken over this country and have you know we're now seeing it within our own community and even on our own board, I think it's important that we, you know kind of deal with this head-on and work to try to to become more unified and just really listen to each other and understand where everybody's coming from and trying to make things more, equitable and fair for everybody, and just you know and I, think it's important for us as a community board to send example for the rest of the community by being a representative of those who we're here to represent. So I'm excited to get to work and that's it was there anything else you need to know. Is that good? Thank you, lisa. That was good. Thank you awesome and, last but not least, we're going to ask out just to say a few words I want to I'll. Still thank you, for you know allowing this committee to even start up he's, probably looking for the unmute button. I got you out, hey, I'm sorry, I lost myself there for a while I just want to I just want to thank you Darrell for chairing this committee and for the participants for taking part in it. I think it's something that hopefully we'll find nothing. If we do find something it needs to be justified, and you know I look forward to working with you and seeing what we can do to make this board one happy family. Thank you so much. Thank you, Al all right, so we're going to dive right into today's meeting. That was our introduction. We're going to talk a little bit about the overview. I do have it right here. Everybody did not get email of the agenda. Correct, yeah, perfect! All right so we're going to start off with the Community Committee Overview and Christian, I'm actually chiming down here too, just to on some of the bullet points as well short thing all right. So description of the committee, the rate, the racial gender and other Inequalities Committee is committed to addressing racial and gender-based disparities and improving equity out equitable outcomes in the community right there, because you're limiting it only to racial and religious. I'm sorry, a gender, so I think that alone is like an issue who's this. Oh it's the deep sorry! Oh it's not limited! It's going to be it's very broad in scope, so Darrell, actually just to chime in looking at this description here, this might have been an edit before we moved towards the equity committee, because then we changed remember the racial, gender and other inequities committee. We then made it the equity committee to remove any of these. Do you have pull it up for me? Please, let me see if I can find it. I'll have to go through my email. Give me a second sorry about that. No do not worry here we go. Would you like me to just forward it perfect I guess I can just pull it up. Perfect. Sorry about that. I was looking at multiple emails today. Do not worry there's there were plenty of iterations of this, so it was bound to happen today's the best day for it to happen. Thank you all right. Everyone on the email should receive should have received it. You just want to share it. Since we have people from the public that may not have been on email, Jane sure at the bottom of the screen, you should have a share option. No, you should've got it. Okay, all right I! Have it all right, perfect, all right christian, while I'm bringing it up. Can you begin the description for me? Please I would be happy to. Thank you, sir. All right great, so description of committee, the equity Committee is committed to addressing racial and gender-based disparities and improving equitable outcomes in the community. The responsibility of the equity committee- I'm sorry I, was taught I. Do not think you guys are addressing what I'm saying you're, limiting it to racial and gender there's ethnic. There is religious. There are other, you know, disparities right, absolutely. So, let's what is the best way for us to work on a document together should I make a Google document and we can share on it or should I just like make a document make a document at edit these notes and from there share it with the committee. So I'm sorry I was wondering Christian. Is there any way you can share the document with everyone and then, if people make it, oh I can't see it. I do not see it, yeah, I'm putting it on there, okay and then we can and we can make edits, meaning, like notes saying you know, there's an issue with this point: correct, that's the whole purpose, that's the whole purpose of this meeting, so we was going to read it as is and the whole purpose of this meeting. So we could further discuss what we're going to change and to make it better. So that's why we have it the way we have it and we can edit on it. So thanks for bringing it up we're going to read it as how it is we will make changes to it. This is not the final thing. This is the. This is the reason why we're having this first meeting, so we can actually go over some of these key points that we can actually make better. Okay sounds good all right, Kristen, please continue sure I'll continue reading, so the responsibility of the equity committee will focus on identifying discrimination or harassment, raising awareness of implicit bias and eliminating or mitigating racial and gender inequity or its effects across our district. The equity committee will make recommendations to the board on aspects related to racial and gender equity and the equity policies within all programs and select community-based activities and entities. The committee will foster a commitment to racial and gender equity, social and environmental justice, diversity and inclusion, the ability to work collaboratively with people of diverse perspectives and experiences connections with local, historically marginalized communities, the ability to represent the geographic and demographic diversity of the region. The equity committee will be responsible for maintaining a reconciliation commission- oh great yeah I. Can the equity committee will be responsible for maintaining a reconciliation commission that is responsible for delivering a yearly assessment of budget parity, ensuring that all the that the budget requests our board puts forward our balance, seeking to establish even distribution of funds, equality and equity of our board, ensuring that the current board and future boards accurately represent the racial, gender and other demographics of our community by ensuring that Overton embedded racism, sexism and other inequities are not included in our bylaws website. Budget requests and unified or individual comments, posts and or statements to the public, bylaw and website review ensures that codified racism and gender inequities are not inadvertently included in our bylaws or website news. Social media and other comment review. Ensuring that overt or embedded racism and gender inequities are not included in our comments, posts or statements to the public I think that's all of it. Yes, so you're, absolutely right, it could be broader and it most likely would be. It will be, but based on initial proposals, of what everybody talked about, as well as what me and Christian and others have talked about. Is you know broadening what we you know as the framework? This is a framework, so this meeting, we're going to you know enhance some of these item points to make sure it's going to work for the board. It's going to work for the community. You know stuff of that nature. I just have a I. Just have a comment: oh okay, hello, yeah I did not mean to sing to everyone. Okay, it's okay, I, have a comment because I understand the equity. You know for making it broader, but can we think of it more from a human rights perspective, just treating everyone as human? You know with that in mind. You know that everyone's human, because sometimes it's not about race. Sometimes it's not about religion, sometimes just you're you feel like yesterday we went to orientation and they were talking about people feeling more important than other people. You know and I want to make sure that we address that or make you know either the public understand that no one's more important than anyone else right. You know we're all equally contributing to society all right, we're going to all right we're going to save a section in the end we're going to you could be able to ask further questions, we'll address what you just said, but I want to move forward on some of the agenda agenda items. Okay, so, but thank you I appreciate that is very important to consider now. The next item that we're going to discuss also is like Chris just discussed, was the role of the committee and the purpose and the scope and some of the expectations. So some of the expectations, as you do know, is that you know right here right now. We are having this discussion and where we can make these items better and again Christian. Thank you for creating the framework, because we would not have even known where what direction we're going to look at and how we're going to build this thing- and you know to me that's very important so as per my discussion without this ad hoc committee is going to be at least three months all right, starting now it's going to be December and January, and then you know the board ultimately makes a decision further if we're going to continue going, and so it's pretty much three months to start out with in ad hoc capacity and our expectations is that you know we're going to work on two fronts. You know we're going to work on. You know the board front and the community front, and you know we're going to identify inequities in that aspect. But, ultimately you know everything is pretty much to ensure that you know we're all working in continuity in the best interests of the community, all right so being I said I'm going to go to item level number three, any everybody has the agenda right. Yes, I can share it. If that helps for anybody who does not, if you want sure please I, can see that right? Yes, all right. So that brings us to our next point, since I identify inequities so within the community board, what we mean by that is, you know ultimately and analyzing the membership and the community distribution and social media profiles we're referring to the board jeremy, as we discussed there's about three different profiles for the board right. What do you mean social media profiles? Oh yeah I mean that's yeah well in Facebook, yes, there's three distinct ones: okay and there's a fourth one. That's not! We do not have control over but yeah perfect. Thank you darrell, just to be clear. We're talking about CB, 11's, social media, we're not talking about individual member social media profiles correct so, and this is another thing we're going to I want to discuss with everybody right now: analyzing membership, let's start off with analyzing membership and community distribution. Analyzing membership in that sense is what I sent you in the email. Jeremy stop! Sharing I'm going to load up perfect everybody see my screen so right now the demographics right. We have about I think it's about 50 members of this point right, jeremy, this information. We have 48 members. Currently, okay, I'm not saying I'm only seeing your launch for hda office suite though I do not know. If anybody else can see anything else, no I can only see that launching do you want me to pull it up? Darrell? Yes, sir! So you're talking about the demographics page of our website right, correct, I, just go there almost there, so, okay, sure great! So right now we have totally have 48 members. As you can see, the age bracket from 16 to 17 is 0 18 to 24 00. So we have no real. You know: engagement from like Gen X and Gen Z and 25 to 44 is 27 percent. One thing I just wanted to zoom in to focus on is some of the one second jeremy you scroll down, yeah have fun all right here we go so african Americans or black, made up 27 percent of our commun community Board Caribbean and West India made 13 caucasian made 48 latino and spanish, weighed 23 middle Eastern, four percent native American Zero South Asian One, that's two percent other one, which is two percent as well so right now, collectively our board is ver is diverse but, like I said, there's so many of up incoming people that moved into our location that we can add, we can look to seek to have more board members. You know on the board community Board as a whole to represent the community. I'm sorry I, just wanna, I'm so sorry. I do not need to pay you after all, but whoever came up with the percentages. They do not total 100 more than 100 I just want to throw that out there. Thank you and that's just for a point of order. That's because there are people who identify as black and hispanic. So that's the only way to do that and also bottom here. You can see it's Al, followed by Veronica. We got to update that this is up to date outside of the order, because we have the officers first, so I stopped David there, because he was secretary that will be updated, can I also say it will I do not think that I do not know how quickly census results will be available, probably not in time, but I think it would be helpful to get the census numbers to see how this is reflective of our community. I agree, I, agree and that's what I want to bring up, and now we can open up discussion we're already talking about it now, but that's another thing: when those sensors numbers come out and we'll be able to update it. I talk to a lot of people on the ground and you know there's a lot of people that I feel like we can engage more to get on the board and you know to further represent. You know the communities we live in and anybody can add to that. I'm just sure will be released. I, do not think it'll be for a few months still, but I think I. Think, because you have a short timeline with this committee. You're better off looking at 2010. yeah I might as well, and then we can update it later. Yeah, you're, right, Jeremy, so yeah. So another thing I just want to you know I just feel the board can definitely go ahead. Is anyone talking it seems like we've frozen? Do you hear I can hear you Jerrell, but yeah. Let me stop sharing my screen. I do not have anything to do with it. Probably Christian. Are you still there he might have to sign back in it looked like he dropped out yeah. It might have been his connection. Let me share again because so 2010 census, you know obviously I think that would be a model, but some other things to point out here with the we have. No, we have one lgbq but yeah, like you said earlier, there's zero percentages of those younger populations, I'm sure we have a decent size of that in the district yeah. We do and you know a lot of people are. You know getting civically involved, so I think our outreach to the younger generation too, would be great to get their opinions on the board. You know this is a full scope. You know it's not just racial identity, it's definitely aged. You know gender identity. Everything- and this is one thing say that again christian. No, absolutely please finish. I have a comment, but I'll wait till you're no problem. This is one thing we can start working on, and this is this is something that is, you know, inclusive of all of us. You know this represents all of us. You know our communities and what we're seeing right now a lot of people are engaged, especially in this last election. The younger population is the most engaged we've ever seen it, and you know we definitely should want to have more of that on the community board as well. Christian go ahead, I agree, I mean looking at these numbers, you know at just from the jump. You know we see that what is it 73 of our board is between the ages of 45 and 65 plus, you know, so the board is top heavy right. Now there is a larger concentration of a older population on our board and a real gap for the younger community members, so over there I think that we definitely identify a priority which is to engage younger members of the board. I would say that if that is one of the first priorities of this committee is to, you know ensure that we bring age parity to our board, then the next thing should be that should be dictated off of our racial identity and sexual orientation, and so, if we're looking to find a way to bring the most equity while also bringing the most community representation onto our board, I'd say that you know the place is where we want to be looking for folks between the ages of 16 and 30, who are who are part of these demographics that are not that are not represented, so we do not have, and of course you know, you want to be wary of recruitment. From the perspective of tokenization, that's not where we're coming from. We want to recruit people to ensure that there is someone on the board to represent that voice for like-minded folks in the community. So I'm seeing you know we do not have an. Obviously we do not have a transgender member of our community board or someone from a gender binary. I think that that's definitely includes not just inclusive but important. Conversations around gender are becoming increasingly nuanced and having someone who can speak to those issues on our board is an asset to all of us and to our community, then I, look and I see that you know we have very little middle eastern representation you'll. You may look and say: okay, we have our. We have zero native american representation that might be because no native Americans live in our in our district. That does not mean we should not look for them, but you know I, think that younger middle eastern members of our community clearly make one of our top priorities for recruitment. If we're basing this off of, you know where we're seeing gaps right now off of this data, you know Christian. Actually, that brings up a good point like I think we need to decide- or at least discuss like what is our is our focus more on equitable representation from various demographic figures here, or are we looking for an equal representation from the community because those could be two different things: yeah you're right? You know, because to your point about native Americans, if we want, if we're looking for equal representation among, let's just say, races, even though, if that can get a little complicated in terms of Latinos, just for the sake of example, if we're saying that we're looking for equal representation among races, you know that can be I think like officially, for instance, there's like what like five races or four or five races overall, so like does it really make sense that we want to have that distribution of races, or should it or sure goal really be to look at what the community makeup is and have it represent? The community I think it has to be representative of the community, but also you know that's what this discussion is for. I. Think to your point. You know these conversations are not always going to be easy right, because I think I think problems if I could jump in for one second, one of the problems you're going to have getting younger people. Those are the people that are starting to raise their family, those that are trying to get settled in their job. It's very difficult to get young people that are community minded. You see it with our associations in the community. Most of them are top heavy as far as age goes because people are settled into their jobs and now have time to time to give their children are either out of school, and now they have more time to give. So it's going to be very difficult to do that. I. Think it's a great idea and I think we should reach out to people our elected officials. If they know anybody within that age group to appoint them to our board. Yeah I definitely agree with you. Al I think I think it's twofold, though. If they do not feel welcome in these spaces, then they're not going to come, and what are we necessarily doing to make a young person feel welcome or interested in going to their community board? I think plays a big part in that right. You know we did. We did bring on a 16 year old yeah and she was very good, but she just then she got busy with her schoolwork and busy with her friends, and you know, but she was. She was very good and you know she was overwhelmed by the old guys. You know what I mean and you're right I do not know if she felt like she was included in this or that she was just there for for show realistically I. Think 16 to 17 is a tough age bracket to try to gain support from but 18 to 24. You know, I was 18 to 24 and passionate about my community. I did not know about the board at that point in my life to want to be a part of it. So I think that demographic might be easier than 16 or 17. Absolutely, but I hear your points too. It is hard to you know. We've seen this firsthand, it's very hard to get young people involved in general, but there is a national sort of awakening of young people, so maybe we could capitalize on that too. Yeah and I was I. Have a recommendation also, you may want to open it up to as an internship I know when I was, though, that age I was looking for internships to to help me with my job search or to get recommendations so you'll, be surprisingly, a lot of teenagers would be able to want to do that and it's into public service to intern on the board and not to mention just being also being a member of the board. How do we? How do we attract somebody? You know Gen Y, Gen Z, you know, I'm I always make a joke say: I'm a senior millennial I mean so like I'm already civically. You know inclined I understand you know things civically. So, let's not make me darrell do not answer. No, I'm not going to answer, I'm not going to put you out there. Man, but yeah man so like I, feel I feel that you know there are young people that are very engaged, perhaps maybe after 21 they just graduated. Maybe they found a job already and I think we still have a big opportunity because, based on, like all the kids that were started to vote this year, it's a big is a big thing that we can tap into. So I'm glad we had the opportunity to discuss that and we can utilize our social media profiles, because you know a lot of a lot of kids are not into social media. So you know we got to figure out ways to attract them to understand what the people, how important community board is for their community. How can they actively get involved or if they want, you know if they ever thought about getting doing something politically or whatever? It is yeah and I was just thinking like I'm just having like flashbacks to like when I was in high school, how we had like the student government or and stuff like that and like in, like maybe there's a way we could like reach out to schools like via email or something like that yeah and try to set something up with like hey we're in your, like. The schools are within our community board and we're interested to hear like from your students and like maybe like. Maybe it's something like I can do or like someone from the committee can go, or this could all be done through email or through, like a zoom chat like just discussing like oh, what do the students want to see better in their community or what are they curious about or hear some information about like what we do so kind of like a suggestion, box kind of I love that I think we absolutely need to be engaging with schools. We need to be showing students the role a community board plays. This is not a light role we play as members of a community board. You know and I think that if students were to see how passionate we all were about our community, the time we put into it these efforts, they would have a much different opinion on the importance, whether that's them being able to sit in on inviting schools to sit in on a committee to watch what we're talking about, inviting you know going to a school via zoom I. Think that's great I, definitely think that's necessary yeah and, like maybe there's something we could work out with the schools where, like. If their students come, they can get like service hours. If that's like a thing, students still do or whatever, so that it makes them more like enticed like. Oh, let me just check this out and like that, could like be the seed that sprouts until like Bro like a you know like a way for them to get involved specifically I think it would also help if we, because I noticed- and I've heard this- that there are other community boards that do do a lot more proactive things for the community. I feel, like our board in a sense, is very reactive to the things that affect like our members personally versus just kind of being proactive and doing things for the community so like. If we did things you know like I, do not know like resume writing workshops or like mock interviews like things that people of that age group would find useful, even maybe mentorship, maybe like a mentorship program where we can help. You know we can mentor college students or high school students and kind of help them get into whatever career track might align with some of the career experience that we have on our board, just so that they can get a different kind of connection to see that we're here and then we have services that appeal to them and then that can also serve as a as an introduction to what we're doing yeah. That's definitely a great idea too and I know like from my time on the education committee group I like one of our last meetings before like covered like started like picked up. There was someone who worked at the Morris Park library, who was just like everything you were basically saying like they were offering things like that like resume, writing filling out like college applications, and things like that so like we could also provide that, but we could also direct them to, like others, places that give that those services as well I agree. We can. We can definitely engage our community in a different capacity like we. You know we meet, we do meet on. You know on a monthly basis, but we can also do things actively or proactively in the confines of the community. You know I try to do that. Personally. I try to do book bag drives, for whatever politicians in the area or whatever it is I mean. Sometimes I try to join and just do proactive things. Remember we we're part of the board is a very selfless act. You know so I just wanted to act, so somebody has their hand up. Is yeah hey, go ahead, hey how you folks doing just three quick points by Christian so good evening, like Christian said we have a an important role and I believe. Sometimes we lose sight of that and we could play a bigger role, just use caution. We do not want to take any more responsibility than we can handle. We also have limited resources. Keep that in mind. The other two things I wanted to mention was the age gap yeah it's top heavy, but I. Think it's going to get adjusted in the next few years, especially with term limits term limits. We do not know what the outcome and what it's going to look like in six years. You know so I think I would not worry about that too much I think it might fix itself, and the last thing I wanted to mention was the 2010 census. It might not be as reflective of the community that it should that it could I know the war in Yemen in 2013, 2014 and 2015. A large influx of refugees came into the Bronx like it was huge and it changed the entire neighborhood right. So just use caution with that. That's all I got ta say thank you. Everyone, you guys are doing a great job. You it's actually important, and you know we want more members that are from the muslim community. That is, that is jewish. That is what's another young gentleman that I met the other day he's a filipino community. You know, so we have a lot. This is yeah exactly we have a lot of that. So we have, to you, know, put our outreach because remember some people do not know what a community role is. You know when I go to work. I work in the bank- and you know you know in lower Manhattan and Wall Street when I you know, have conversations with clients and like community bro. What the hell is that they do not know what a community board is so like it's part of that educational aspect, where we're actually talking to a lot of your community members just to actively you know, just ask them and talk, engage them a little bit more yeah all right. So, let's move forward because I know I, know I know a lot of people want to go back to watching some TV or something but yes recording what we're discussing here and how we move forward and utilize it do. We have someone who so notes for this meeting, for example, I'm taking them. Oh great, okay, I already got that. Well, actually, I was going to say because remember dural like maybe it was I, think it was. It may have been early this year. I do not remember honestly, and we were talking about being involved with, like the younger generation in our community. Oh yes, mentoring, yes, yeah I mean I, think it is important and I think it should be available, like let's see like students can reach out to us because, like most of us are professionals I think all of us honestly but anyways thanks for bringing that up. Thank you, but I think that would be helpful and I do agree with paula that, like I, think reaching out to the schools and knowing that we are like a resource that could be helpful. I do not know. I can definitely place. Students on you know like, and you know internships with me, for instance, at work. You know what I mean like and I'm sure there are other people on the community board who could probably do the same, even if it's not necessarily within the community Board itself, but you know it's through our jobs that we hold I. Think that could be helpful. I do not know like that's an option. I think it's great yeah. Absolutely. Definitely look at that. Thank you for bringing us so much so many good ideas that we were talking about. So my mentorship we're talking about community engagement. Talking about you know, actually you know you know looking into some of the other. You know communities and trying to get people onto the board. So this is a good thing. The one other thing that we need to focus on is within the community district. I'm a christian I'm going to leave, I'm going to leave it up to you. I want you to bring up what you mean by public spaces, not in compliance with ADA standards. That's I want to go over. These bullet points, yeah, okay. So in that regard, let's say a train station. For example, you know Bronx park the Bronx park, east train station or the Pelham Parkway, Train, Station or Morris park. You know palum parkway, the escalators, always busted, always Morris Park I believe had been given money to put in an elevator, never did Bronx park. East does not have an elevator at least I. Do not believe it does up until the last time I drove by there. You know we have train stations that are highly inaccessible. Beyond that. We also have you know sidewalks that are inaccessible. Let's say a sidewalk that has a sign. That's been posted slap Dab right in the middle of that sidewalk. That becomes an ADA issue immediately because how's that wheelchair get around that pole in the middle of the sidewalk, I've noticed a couple of those that's sort of what had driven that discussion was that some elements of our community have been designed with that. As an afterthought, you know now it's very nuanced. It's very particular I want to put that out there as well, but you know that's an issue that to me is a bit inequitable if you're a handicapped person and can't make it down a sidewalk to the next curb cut to be able to cross. You know that's limited and unsafe, and that's an inequity that someone who is not handicapped does not have to deal with. So that's one thing off the top of my head: I think that in that I'm not looking at those bullets right now, I think there was also something related to public health. There, correct public hazards in human health and safety. We've got a couple areas that are prone to illegal dumping in our district. I. Think that that's something we could be vigilant for, but then in terms of public health, I think about other scenarios, how our parks are left and the effective cleaning that we have I think our community has not received street sweeping in a month or two. That's a that to me is a health issue. I think that every underpass and trestle we've been working for over a year to try to gain some attention to these areas that have been feces collectors. You know that can be really unhealthy for people. These are things that you know our community are under our community board's purview that we can be solving that can create a better quality of life, while also acknowledging the role that we play in our public health. Christian I agree totally with everything you're saying, but I'm not clear on how that falls under the purview of this committee in terms of in terms of equity, well, I mean I would present that, from the perspective of you know, all the train trestles tend to be on the side of the district. That you know has a higher population of people of color and has a higher pop. You know higher probability of being forgotten in overall district matters, so I think that points out and points towards inequity. You know most obvious to me is like, if you have a pole in the middle of the sidewalk, and you can't and you're a handicapped person and get it oh yeah, I'm sorry I should have clarified, not that the state, not the ADA compliance stuff, I'm talking about the health stuff, I think I think the inequity like this is why this is nuanced right. The inequity comes in where this is happening in the district and where we pay the most attention as a community board, no I totally agree with the sidewalks. I've actually seen it as an issue too, whether honestly, whether it's people with you, know disabilities, you know parents with strollers, like whatever the case is like I, do not know how people honestly are able to walk around here and also with the elevator. I've wondered the exact same thing: how people get around in the Bronx I can agree more and the other stuff I really do not yeah the other stuff comes. The train. Trestle thing has been an issue on the transportation committee for a while, and we can't seem to get anything done with it. It certainly is a public health issue, in my opinion, if you've ever been to one of these underpasses and if not I'm happy to collect pictures and share them with you for the next meeting, I've seen the underpass under more spark yeah they're terrible. You know, they're really they're, really bad, and you know that side of town does. The neighborhood does tend to get a little bit less love. But you know what I want to be careful about using the word inequity for everything, because then I think that devalues our purpose too. So I, I'm totally willing to you, know back off on that as well. You know and I also wonder like do. We know like without having any data, to support that like how can we say that those particular locations are in communities that have a higher percentage of you know of people who are considered ethnic minorities or racial minorities like we just do not know, because we do not have that data. So you know that was just kind of speculation on our part and I think we should stick to you know the issue. I think we have enough on our plate right now, I think the Ap compliance is definitely something good to add, but I think health concerns I think that kind of just it gets a little fuzzy without any actual data lisa. Thanks for bringing that up so you're right, we can I agree well. Other members can talk about this too Paul and edda. What do you think but I think personally, that you know she's I think she's writing a sentence. I, do not I do not know if there's enough information about that particular situation that we can actually tackle effectively, but the ADA thing for sure I know that we can look into that and see where we can help and make some recommendations to make that better. You know yeah, so at least I agree. I. Think one of the things the committee could do is, as a committee take one thing at a time and zero in on that one thing at a time, go after the politicians go after the the businesses or the city agencies that deal with this and stay on until it gets done. Because what happens is we lodge a complaint? We put a complaint then, if we do not follow it through constantly, it goes by the wayside. They'll give you a little lip service and nothing gets done. Al I agree with you. We can tackle the 88 to the through the politicians and locals for sure that is a fact. I know we can do that. I think I think we have to be focused. I agree with you out too often. I think what's happening with us. Is we see a cavalcade of issues we want to tackle them all and then that ends up? You know, I think it's from a movie right. You do not half-ass two things. Whole ass, one thing right, and so you, let's focus on moving the needle towards progress on an issue before we dive into the next thing. We could have an agenda for the committee, but each issue should be tackled. Christian, I, agree, I, think we should definitely look put some feelers out about that ADA situation. I think that's something very tangible that we can try to accomplish within you know within this next month before we do our next meeting. We also so just to go over some of the other things we talked about. We talked about again. We talked about you know trying to get. You know, members of our community to join our board so more of a better recruitment process. We can definitely focus on that to see put some failures out there and who we can actually get onto the board in terms of the age, parity and stuff, like that, it's complex, but we can definitely work on those things. These are tangible things that I think we could work on in the next couple weeks. The next thing I wanted to bring to attention is point number four top spoken. Second languages within the district I wanted to ask Jeremy. Do we have information directly in regards to that? Besides just the demographic stuff? It's a good question. So I can tell you that I had a meeting this morning. It's related. It may not seem like it, but we are going. The controller's office is auditing. All the community boards and one of the things that their websites basically are their their websites and their notices, and one of the things that came up today is that there are seven primary languages that our website needs to be translated into. Supposedly I will try to get more information on that I mean. Basically, all my colleagues were like well, you know. If we have a city website is not the city's responsibility to make sure stuff is translated. Right, I mean like because I do not know about you, but if I mean I, my chinese is very minimal. There's nothing there, there's I can I can find out more information for you, but I know from my job. We dealt with this for the Isle of New York website and there's something with Google that you kind of attach it's like a widget or something that you attach to the website and people click on that and then that will translate it into whatever language they want essentially or whatever is available, but I can find out more information from our from our digital, our digital, lead and and I just want to. Let everybody know that the Civic Engagement Commission, which was created a couple of years ago when we all voted on it, was on the back of the ballot. They did a study, I'm on their advisory board and they have the top seven languages and I think they did a study and they did some research. So if you go into their website the Civic Engagement Commission, this is the first election season that they were. You know in action, so that might be a good resource. Thank you guys. So if you look at the the screen, I'm sharing you can see that you know it says italiano espanol and you got russian there apparently, and maybe that's or do oh yeah, that's what I was talking about so I. Do not you can't click on that, though, like there's, so you can change the text. Size I, do not know. I mean I have to work with the city on that stuff. So I yeah I mean I. Do not I do not really know. I can tell you anecdotally, you know the languages we have in our district Albanian Arabic. We do suppose they have a large pakistani contingent and they speak urdu generally yeah, but and then and supposedly have the sizable filipino. In fact, you know another we were talking about reaching out to schools and or libraries I can tell you I. Remember the Morris Park library once informed me that the primary foreign language materials that was coming out of the Morris Park branch was chinese. So I do not think about our district as being a large chinese population, but maybe that some people thought it had to do with Einstein. But that's another way we can get. Information is materials when the library's back open back up, because I do not think Morris. Park is open currently, but I guess even prior to Covid-19 we cut. We could probably get that information in terms of what's circulating. We have three library, branches, Alex and Morris Park and Tom Parkway, Van, ness, yeah, I think those are good sources, I think our city, Council representatives, also are mandated to record this information and we might be able to reach out to you, know: council members, Jonah and torres and ask them. You know for our account for our Community Board district. What are the you know? What constituent when it comes to constituent cases? What are the languages, the foreign languages, the top foreign languages that are coming and making constituent cases and I so I said, or do albanian spanish of course, and even early on when I first became district manager, a lot of italian in fact, yeah one reason one reason I propose hiring Chris is because he speaks spanish, Albanian and italian and he's he was used quite often, I do not know about it anymore, because maybe they're dying off out some of the italian folks, but we used to have a large italian contingent yeah, I'm seeing also big Bengali population. Oh interesting, yeah that yeah that and westchester square area was bangladeshi. Maybe or was it bengali I do not remember so I do not know if people are coming from that area yeah or from bangladesh. I do not remember what so they're muslim, it's westchester square area. Yahei might actually know because I think a larger bangladesh community yeah that's right. Okay, that's probably what it is, but in terms of, but in terms of yeah in terms of your community over by the Muslim Center, the primarily palestinian in yemeni, right, where they're coming from or I would say. Probably 70 percent from Yemen I would say a small percentage, very small percentage of Palestinians some Egyptians. Some moroccans probably are outnumber the Egyptians and Palestinians, but we have a large african community. I would say: 15 of the congregation is actually african and the majority of them speak french, interesting and but the yemeni speak arabic right, yeah, that's correct and they're, primarily sunni okay. So that's the other angles to look at religion. I. Think 80 mentioned that. Did everybody get this link I shared with them too about the profile. So if you go to the city plannings website, yes yeah, you can see. Let me just share it real quick. So it's helpful, so you got foreign born population. This is based on the 2010 census. We're estimated 129,000 residents 47 hispanic, I'm always surprised by how small of a you know. So, that's speaking of hispanic, that's another thing, I think education. This committee should maybe focus on because I know elise and I talked about the word hispanic and that's not always kosher for some people. So we should also keep that stuff in mind and maybe discuss what it means to be a hispanic albanian muslim. You know there's very dynamics what they actually mean, because you know some of these groups are not exactly friendly with each other, even though maybe they all speak arabic, you know or something like that, quick question: when do we? When do we know when the census comes, the new census info comes out again. When did we say that I would not hold your breath? I do not think the data is available until June Jesus yeah. Well, they just they just finished it yeah like a month ago, I think and they actually stop it early because of the court piece. I think it was supposed to go to the end of the year. That's what they said: yeah they had. There was a court order. If you remember the there was a court of the court case to stop the census, collection and that took effect, and basically the administration was proposing to stop the census collection, and so the court decided in favor of that, and it was like three days basically three days to get the word out for everyone to hurry up and respond to their senses before they ended. It I think it was like mid. Let's say it was Mid-October, but I could I. Do not remember the exact date because it happened really fast, but I think it was supposed to go to the end of the year and it got cut short, but just because things are not on our demographics page, which is modeled off the borough president's demographics report, things like renters versus homeowners right, forty, nine percent of our district proposing renters, we should maybe look at I- mean I used to keep stats. As some of you know, because I would ask you these questions. Are you a renter? Are you married I used to keep that those type of stats? So we can also resurrect that, if somebody's willing to help me with that, because I have limited time, sometimes I think it might make sense, for you know, like I, think we have a lot of stuff here that we're talking about a lot of people want to do so. It might make sense, to kind of you know, maybe assign things to certain people or have people volunteer for like certain things that they want to do to kind of take this. You know to further hone in on like recommendations and ideas, and then that can kind of be our homework for the next meeting to bring in whether you know whether it's looking at this data and proposing certain things- or you know some of the other stuff that we talked about. You know so that we're not spending so much time in working on this stuff in a meeting but like we can kind of all work on our own offline to kind of collect data and recommendations, then bring it to the meeting to discuss next time and see which ones kind of have the most meat on the bones and then choose how we're going to move from there. I agree, I agree with that. We have a lot of work to do and that's what this whole first meeting was going to be about anyway, just to figure out what we're going to focus on yes offline. We're definitely going to have some work to do and we're going to try to prioritize what we should do first. Second, third, even without we do not want to take like I'll say we do not take too many things at one time, and then we do not get any results. You want to want to be realistic and tangible. We do have a lot on our on our list and our agenda already, but I think we can definitely get things done for sure and I'm glad we were able to. We were able to have this type of conversation to you know, figure out where we can move forward and make some good changes to the community and the board that would be best for everyone all right. I know we did not put on there, but anybody has any we're going to build a point number five, which is all business. Well, what I want to ask- and maybe it's maybe it is old business actually at this point is I know, we've known noticed some changes. We want to make to our committee's description. So how would you like us to do that? Moving forward? Would do you want to rewrite it based on the noise you've received I know we only sort of gave notes up until a certain section. What works for you well, why do not you guys put it I think that Google Doc might be correct. I think we should do that: yeah, okay and piggyback off each other. So that way we can make it more inclusive. You know that it covers the broad spectrum of what we're trying to accomplish. That's a great idea: Christian. Thank you for bringing it up. Yes, we can definitely mold. You know our description and our agenda to fit what we want to do at this point. So yeah we're going to do a lot of conversation, offline and okay figure. This thing out sounds good yeah. You have a question. Oh no I do not unless I hit something by accident, I'm working out your hands raised. You just made me laugh my hand is really tired. It should not be raised. Yeah I, just put it down all right, all right, so new business I have a question like this is something in regards to like district managers. Salaries like I like there was information like given like I, can't pinpoint exactly when, but I was just curious because there's such a like differences within ranges of how much one district manager gets versus another one and like who sets it like. Where can who should I reach out to like just to like inquire, more information regardless to like that, because I'm just it's just interesting, you know because I see Jeremy, like he's our district manager, he keeps us like well informed and like is there like any way like I, do not know just to get a better understanding as to why, like a district manager whose Community Board website that barely has any information on who's involved, I do not know if anybody's understanding, yeah I raised that issue a couple of years ago, and it turns out really it's when you first get the job. It's like. How much do you negotiate and it's how you enter the job? I guess, but when I looked at the numbers, I looked at it and it seemed like Jeremy was the most senior and one of the most experienced, but he was the least paid yeah match. It was it's kind of like backwards and I personally experienced it with my job, and it was totally unfair for years for me and I. You know and I bit my tongue for all those years, but something's wrong with it. I think it's the Bp's office initially going forward for the future, but I think it might be too late to take any action right now other than the annual increases is there. Is it related to budget like how is the money allocated to the different districts? Good question? I do not know yeah exactly I could answer this. Obviously, because that knowledge of this I mean each community board, each community board is gets the same money. Some community boards only have one or two staff members right. We have three and I think they're you take care of them. Pretty well, I mean that's. So you know I'm one story, but remember we have three staff members, so we should consider everybody not just me it'll, be interesting to see how this audit goes with the country's office on websites, because hopefully I mean I'm speaking to a colleague today about it. Hopefully, other people realize how important something like a website is yeah because, like echoing back to like what we were talking about in the beginning, because like I'm, not that much on the younger side, like I'm like early 30s I, did not really know what community board was or how to get involved with it and prior to even like attempting to apply for this board. It was the website, like the community, our website that would just made it a lot easier for me to navigate and figure out where to find the application and all this other stuff, and things like that. But if I was like with community Board like whatever other ones that do not have as much information I would not be able to get that guidance, I feel and I can't really say. That's definite because maybe like, if I make a phone call, they could help. But you never know you know interesting. What I understand is that if they do get the same amount, okay, so you're saying because wait, but our district can't be the only one that has three employees right. Yeah no I mean some I mean I. Can I can get your breakdown at some point, I mean yeah I mean some places they I do not know. It's there's a great disparity throughout the city right that should be rectified at some point. So is it due to audit process where the from the controller, where they make decisions on merit, increases? No, that's just purely about the website. I mean I, just because paula mentioned that and the disparities there, that's what's going to be, I mean look in some ways. You know in some ways it's you know like I. Do not know. I do not know like I look at it in the sense of like if this was like you're a doctor like if you're a doctor- and you do your job well, like you help like your patients correctly and stuff like that, you should get paid like that matches that versus like, but I do not. I do not even know if that's right to use this thing yeah. My brain is just like going all over the place, but I think yeah was right when he talked about. Let's try to narrow the scope right. Let's I mean we can we can look at where we're lacking in terms of maybe membership. We currently have 48 members, so there's not much. We can do there, but well, you know you know. Luckily doral you worked out something with the secretary well, so to speak, Paul's going to do notes tonight, but I recommend rotating right, not just one person all the time unless they're totally fine with that and maybe looking at committees from that perspective, too who's actually taking minutes. Unfortunately, the burden falls upon the chair people a lot of the time. I mean I, do not want to pick on Yah, but generally for public safety. It's him I mean I, think Veronica, maybe once last year, but usually it's always him doing the minutes. So that's another. Is that really equal, especially since he's the chair, and he has to coordinate with me with a guest speaker and all this other stuff? The agenda got you all right now and yeah we're going to never just go for sure we're going to have further conversation on what we can do. This is very helpful that we were able to have this conversation in the first place, so that way we figure out how we can move forward in the future and have more you know, have good meetings in the future continue to have good meetings going forward. So at that point we do not have it on the actual agenda, but Jeremy you and I discuss. That is some people from the public that wants to speak a little bit. No I was able to get that published. You know, even though yeah, even though my reliance on the city is frustrating sometimes so. Yes, there's members of the public who they can unmute themselves. I do not see anybody, that's called in. So if there's anybody from the public, whether you're going to scope to how many, how many minutes were eliminating they're, there's they're called two minutes outside two all right. So, let's begin, hopefully you probably do not need that hello, not listening. Well, I just like to say that I think the public should have more time to speak. It just says you said just earlier. That is not more important in the community, but when it comes to community, we limit it to such short time to explain our input right. I'm sorry, I do not mean to step on your time, but, like I'm having difficulty hearing you I do not know if anybody else is experiencing that, like you sound like oh, like I, do not know if the phone is the. Can you okay one? Second. Can you hear me now because yeah you sound better yeah, that's better! I'm saying I find it very disappointing that whenever is the time for the public to speak, we sit and we listen to the board. Members speak at length sometimes over an hour, but when it's public input right away, it's like two minutes. That's it for you. I do not understand. That's not really public engagement or public input. That's just my opinion! Well now they yes appreciate you bringing it up, but do you have a question? I actually had a statement to make, but considering I'm limited to two minutes, I'm going to make it sure my quest, might you know I actually had to testify and was very active with two city charters, the mayors and City Council regarding Community board issues and many of the issues that I have and do still have was shared by other members of other community board members of other public members of community boards, and one of the issues was that the district manager is not electable and he basically is at the whim of the 49 plus members and basically they do not address public concerns. Now, regarding the what was what was after, we testified and were very actively involved in reforms that we wanted for community boards. One of the issues was put in the ballot was the term limits for two-year term limits. Unfortunately, they grandfathered the existing Committee Board members, which was my major complaint, but they said they could not do anything about it. But my issue is not the age of committment members. Some of them have been there for too long. I refer to them as hoarders, because they've been there 20 years, plus give someone else new, a chance to be involved, because when you're involved in the community board, you become involved with different agencies, how to maneuver and navigate again with different city agencies, and then you bring that back to your community to become provide those resources. Those board members have been there for too long. I do not care if that 10 years, old or they're 100 years old. My issue is they've, been there for too long and they're going to be there for another six years, making their tenure close to three decades. I mean I mean that I find that so offensive and I mentioned that regarding the demographic reports that was also mandated by the city charter referendum, the problem I have with the demographic report is that it does not break it down into city councils, because CB11 is broken down to CD 12 CD, 13, CD, 14. CD 12 was, must help Andy king, that is actually very diverse. Cd 14 help is held by Taurus, which is also diverse. The lack of diversity is in CD 13, Jonah's district, which is where I reside in. This is the main issue where we lack diversity and if I could, if you ever interested 30 seconds right there, you see you're, not interested what I have to say already have been shut down. You know it's what it is. There's many issues going with ADA compliance. The community board is not in ADA compliance because they do not provide the calling option since March to provide people who do not have access to technology or have impairment issue to able to participate while going through internet I mentioned that for years for months now. Finally, a calling option was sent for this month, but this is an ongoing issue, but again you're not interested darrell could I answer some of those or react. Yes, Christian go ahead and I just wanted to say before you do I just want to say Roxanne we do care. This is the reason why we this board, has been. This committee has been created to address some of those concerns. Kristin go ahead, yeah I think first I think most definitely. You know in terms of ADA compliance you're spot on Roxanne. That's why this issue is brought up here and in terms of you know, digital meetings, absolutely you know, obviously I do not want to I, am not at privilege to speak for the whole board, but in witnessing this entire year it's been very hard for a lot of people to you know ramp up. Technologically, a lot of us are savvy, but not everyone is, and unfortunately that, coupled with other you know, issues has led definitely to some poor communication I think. But we do have the call-in feature now, it's something that we should have all the time and that every meeting should have, and these are issues that we want to be focused on through this committee, so I, I'm glad that you brought them here on ADA compliance, whether it's digital or in the community, definitely something we have to tackle. Another issue that I heard you bring was the length of time people serve on the boards. You know I think that is something that we definitely want to be looking at on this committee. As you know, at some point we do not want to bite off more than we can chew, but you're absolutely right. You know, and Yahay had mentioned earlier about term limits, we're going to have to see how that works. That could be. The remedy that you are looking for. I do not know how it works. Yet I've only been on this sport a year, but the notion of term limits for any position is absolutely is absolutely important. As for electing a district manager, I have no clue how a process like that would work. Sometimes it's hard for this board to even agree. If we should go into executive session, let alone pick a district manager. I think that could be really contentious for all 48 of us. But then again, you know. I, think that this committee can have can have a lot of insight, and you know, do a lot of research on a lot of these things that you're bringing up, and so you should always feel welcome to bring those claims here. Actually, I have done all the research and I have been involved with two city charters and I have all the information, but it seems like I, do not have two minutes to provide you without all information and regarding the term limits. I know how that worked. It would have been better if the bp will phase it in, as opposed to wait for the six years to end and then have to change the whole board at once, as opposed to phasing in new board members. Now so by the sixth year. You won't have to change the board makeup rapidly, but he does not do that. He has like I, say: there's many board members that have been there for too long. Nothing stops them from getting involved in the community or you could be. They could still attend the board meetings and provide mentoring inside feedback, but no, they want to be on the board and they want to hoard that space. Meanwhile, many people out in the district who are more involved in their community, more reflective of the demographics of the ideology of the district, are prevented from being involved because those guys or those females are there for two to two to too long. I have all the research I have all the breakdowns. The demographic, that's posted on cba 11 website is inaccurate and I have a better one that reflects the accurate numbers and based on Board City, Council Districts Roxanne. Thank you so much, and we appreciate your concerns. We're going to work very diligently on working on things that we can do in our control of things with the Bronx borough president's office is some of the things that we can not control until the next election, where you can probably vote for who you feel is going to be in your best interest all right. Thank you. So much thank you. I could propriety with information if you would be willing to call me another day and we can go up more at length, but if you do not you're, not interested you're, not interested. I'm interested but I do not call constituents on private lines, unfortunately, but we can go through other channels in which we can. We can actually look at what you're talking about and work from there all right. Thank you. So much is there other members that other people from the public that would like to speak? Yes, terrell, yes, I could have saved you a lot of time in the beginning on board membership, because 50 percent of the board membership is recommended by council members proportionally according to their population of the board by the you know, to the bronze borough president, the other 15 are recommended and then appointed by the borough president, and it is up to the borough president and only the borough president to appoint people to community boards. One example of something where the whole community Board was dismissed was Community board 4 with the Yankee stadium issue, where the board voted against the Yankee Stadium proposal and borough. President, then carrion dismissed the whole community board and put a new board on now I hate, to say this Al, but chairman D'angelo you're, going to have to tell your community chairmanships that the public is allowed to speak during the meetings they have to speak, though within limits they can't keep. You know interrupting they could say once or twice during the meeting all right and that I'm telling you this as a vice chair of two committees and chair of a committee on Community, Board, eight all right and we were the leading board in the Bronx, because we had a special nature area and a historic district, and we had land use matters. Many times a month. Okay, we led the board on MIH cqa, which I guarantee you half of boy. 11 does not know what it is: that's mandatory, inclusionary housing and zoning for quality and insurance, which this board has to watch out for, because Blondell Ave commons has just broke the Dyke open and you're going to get more buildings like Blondell Ave commons, because I will tell you that Blondell Ave commons has now set the pace and another building like Blondell Ave commons will not be out of context 30 seconds drama, I'm almost done now, so you do not have to worry and darrell. I was also Andy, King's representative to this board this past year. In case, you did not remember so I there's things that I know more about community boards. That, probably all of you know most of your members do all right and I will help. You and I said this to yahay, because I was on the ethics Committee of Community Board 8. Also I was on almost every committee and I will give my this community boy all the help I can, as I have working for Andy King. Thank you thanks Robert. Thank you, Robert. Anybody else all right going once going twice all right, terrell I just want to thank you in the committee. You cut out a lot for yourself again. Hopefully we can narrow down one thing at a time and get something done. I'm sure you will I agree with you. I agree with you. Thank you. So much for that I do. Thank you so much. We do have a lot of work to do and we will get it done. We'll talk. Definitely offline to you know, try to meet some of these tangible goals and get things done and make things better. Being that said, I would like to do a motion to adjourn anybody can suck in that. Second, all right on favor all discussion, hi all right adjourned, thanks meeting officially ends at 8:37. P.M perfect have a good night. Everybody and you know, take care good night have a good night good night.",
            "summary": "In the best interest of the community, we serve tonight, we'll have a range of things we'll be discussing in our meeting and look forward to a robust conversation being that said.\nOther members will be joining me tonight who are part of this committee, which is Paula, Christian, Lisa and Edith, and now I want to give.\nI'm, also like fairly new to the Community Board Darrell reached out to me in regards to joining this committee and like with like the little like overview and stuff that we had of it.\nAnd I think that there is like definitely work to be done.\nAre you hi, good sorry, I think, like a minute trying to figure out how to do that.\nI think it's important that we, you know kind of deal with this head-on and work to try to to become more unified, and.\nWe do find something it needs to be justified, and you know I look forward to working with you and seeing what we can do to make this board one happy family.\nI'm sorry, a gender, so I think that alone is like an issue: who's this.\nAll, right, great, so description of committee, the equity Committee is committed to addressing racial and gender-based disparities and improving equitable outcomes in the community.\nOkay sounds good all right, Kristen, please continue sure I'll continue reading, so the responsibility of the equity committee will focus on identifying discrimination or harassment, raising awareness of implicit bias and eliminating or mitigating racial and gender inequity or its effects across our district.\nThe equity committee will make recommendations to the board on aspects related to racial and gender equity and the equity policies within all programs and select community-based activities and entities.\nCan the equity committee will be responsible for maintaining a reconciliation commission that is responsible for delivering a yearly assessment of budget parity, ensuring that all the that the budget requests our board puts forward our balance, seeking to establish even distribution of funds, equality and equity of our board, ensuring that the current board and future boards accurately represent the racial, gender and other demographics of our community by ensuring that Overton, embedded racism, sexism and other inequities are not included in our bylaws website.\nThis is a framework, so this meeting, we're going to you know enhance some of these item points to make sure it's going to work for the board.\nYou know for making it broader, but can we think of it more from a human rights perspective, just treating everyone as human.\nWhat we mean by that is, you know ultimately and analyzing the membership and the community distribution and social media profiles we're referring to the board jeremy.\nI want to discuss with everybody right: now, analyzing membership, let's start off with analyzing membership and community distribution.\nI, do not think that I do not know how quickly census results will be available, probably not in time, but I think it would be helpful to get the census numbers to see how this is reflective of our community.\nYou know, there's a lot of people that I feel like we can engage more to get on.\nLet me share again because so 2010 census, you know obviously I think that would be a model.\nYou know getting civically involved, so I think our outreach to the younger generation too, would be great to get their opinions on the board.\nYou, know our communities and what we're seeing right now a lot of people are engaged, especially in this last election.\nThere I think that we definitely identify a priority which is to engage younger members of the board.\nI would say that if that is one of the first priorities of this committee is to, you know ensure that we bring age parity to our board.\nI'd say that you know the place is where we want to be looking for folks between the ages of 16 and 30, who are who are part of these demographics that are not that are not represented.\nConversations around gender are becoming increasingly nuanced and having someone who can speak to those issues on our board is an asset to all of us and to our community, then I, look.\nThat does not mean we should not look for them, but you know I, think that younger middle eastern members of our community clearly make one of our top priorities for recruitment.\nYou know these conversations are not always going to be easy, right, because I think I think problems if I could jump in for one second.\nI did not know about the board at that point in my life to want to be a part of it.\nYou may want to open it up to as an internship I know when I was, though, that age I was looking for internships to to help me with my job search or to get recommendations, so you'll, be surprisingly.\nSo, like I, feel I feel that you know there are young people that are very engaged, perhaps maybe after 21 they just graduated.\nYou know we got to figure out ways to attract them to understand what the people, how important community board is for their community.\nAnd I, think that if students were to see how passionate we all were about our community, the time we put into it these efforts, they would have a much different opinion on the importance, whether that's them being able to sit in on inviting schools to sit in on a committee to watch what we're talking.\nAnd I know like from my time on the education committee group.\nYou know we want more members that are from the muslim community.\nThe hell is that they do not know what a community board is so like it's part of that educational aspect, where we're actually talking to a lot of your community members just to actively you know, just ask them and talk, engage them a little bit.\nI know a lot of people want to go back to watching some TV or something.\nAnd I do agree with paula that, like I, think reaching out to the schools and knowing that we are like a resource that could be helpful.\nYou know what I mean like.\nThat's one thing off: the top of my head: I think that in that I'm, not looking at those bullets right, now.\nYou know what I want to be careful about using the word inequity for everything, because then I think that devalues our purpose.\nAnd I think we should stick to you know the issue.\nYou know, I think it's from a movie right.\nI think that's something very tangible that we can try to accomplish within you know within this next month before we do our next meeting.\nWe can definitely focus on that to see put some failures out there and who we can actually get onto the board in terms of the age, parity and stuff, like that, it's complex, but we can definitely work on those things.\nRight, I mean like because I do not know about you, but if I mean I, my chinese is very minimal.\nYahei might actually know because I think a larger bangladesh, community.\nWe can also resurrect that, if somebody's willing to help me with that, because I have limited time, sometimes I think it might make sense, for you, know.\nLike I, think we have a lot of stuff here that we're talking about a lot of people want to do.\nWe do have a lot on our on our list and our agenda already, but I think we can definitely get things done for sure.\nWe were able to have this type of conversation to you, know, figure out where we can move forward and make some good changes to the community and the board that would be best for everyone all right.\nMy brain is just like going all over the place, but I think yeah was right.\nYou worked out something with the secretary well, so to speak, Paul's going to do notes, tonight, but I recommend rotating right, not just one person all the time unless they're totally fine with that, and maybe looking at committees from that perspective, too who's actually taking minutes.\nWell, I just like to say that I think the public should have more time to speak.\nA lot of us are savvy, but not everyone, is, and unfortunately, that, coupled with other you know, issues has led definitely to some poor communication, I think.\nYou know, I, think.\nI, think that this committee can have can have a lot of insight, and you know, do a lot of research on a lot of these things that you're bringing up, and so you should always feel welcome to bring those claims.\nWe can actually look at what you're talking about and work from there all right.\nSo I, there's things that I know more about community boards."
        }
    }
}