{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UCb2Nm8pgBpcnuoh_bMuKtjQ",
            "title": "November 2020 CB8M Housing Committee Meeting",
            "publishDate": "2020-11-25",
            "shortDescription": "",
            "lengthSeconds": "1:24:45"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Fl7m8RlNeg4",
            "fillerWordCount": {
                "uh": 178,
                "um": 123
            },
            "readTimeFullTranscript": "53 min read",
            "readTimeSummary": "9 min read",
            "wordCountFullTranscript": {
                "housing": 128,
                "rent": 38,
                "state": 30,
                "land": 26,
                "income": 20,
                "money": 19,
                "problem": 17,
                "program": 15,
                "tenants": 15,
                "building": 15
            },
            "wordCountSummary": {
                "housing": 52,
                "state": 10,
                "land": 9,
                "program": 7,
                "rent": 6,
                "income": 5,
                "building": 5,
                "profit": 5,
                "landlord": 4,
                "market": 4
            },
            "fullTranscript": "And see me by the way will when we do, the minutes can do I need to go through the participants and write it down. Or do you have a list of them or can I do have a list copy your homework yeah you can copy my homework I'll. Send you the list of people who sign in for the meeting it's like being on the bus at eight in the morning. Hey? What did you get for number four I'd like to take this opportunity to wish everyone, a happy thanksgiving. You could send me. The emails and safe, yes be well be safe. All of that for everyone here, I think to you, Ed and Barbara I. Think this committee has done enormous work. I know, there's a lot more to be done. There always is, but I haven't yet recovered that you told me that 30 people were running for the mayor, I more to come, you're right but more to come boy. A lot of people have money, yeah, I, don't know what time but New York One's, having a tribute to David Dinkins tonight, so I want to say: I saw that you know. I took a picture with him. I have it in my phone at the opening of the Second Avenue Subway. He worked very closely with him because he always talked about it. He was the first male member of the women's political caucus. So we worked very closely together during those days very nice man, very decent man. Very you, I'm sorry. I never got a chance to meet him, but I was surprised. The New York Post of all had a very nice obituary on him. Yeah I didn't read the times, but I saw the New York Post one. No, the times didn't have it because he they, you know they don't print three editions anymore, so they had printed or he died. Oh because it was last night at 9:30 or something I know even a little later, because I got an email from Gail Brewer. That was the first I knew about it and that was emailed to this morning. I think it was like 12:30 last night, very sad, but his wife passed away I guess a month ago. Yeah isn't that the way it always goes sometimes I think it sometimes in life like couples that have been married. A very long period of time like that I think it's the sense of loss and you're alone. I, don't know I, just I haven't even noticed that, but they had their own independent lives too. So I don't think that was it okay. Well, okay, I, don't know: hi Peggy, hi, Sandra I lost you on my thing: hi man I! Don't there, you are I only see your photo, hey Sam. How are you you're still muted, I'm good thanks for having me hey there. You are thanks for coming a pleasure yeah. Thank you. We're really excited Sam and I looked great on TV last week. Oh thanks for watching I'm Barbara, I'm here, but you can't see me because, okay, my video's, not working good to hear from you I can see everybody, so we I can't wait to show you here. Can I just do a quick plug for the committee and everybody is here right now we're like 20 people can I just say. Thank you to everybody. We've been averaging about 20 people at our meetings, the last couple of years and I. Just can't tell you I remember when it was like three of us and my son had to boost the attendance when he was like four years old, just to kind of get the numbers up and I'm very happy to see everybody here. This is great. Well, it's good to be home because people can't go anyplace. Barbara I was kind of hoping they would say. The topic was so exciting. We couldn't miss. It well, I think we're not seeing a whole lot of other people joining right now. So, if you guys are ready to kick it off, I think you're good to go. I think we should start. You know, okay, you want me to start Barbara. A couple of people called me and said that they're not tuning in tonight, okay, okay, I, guess then we'll start will go for it. Okay, are we recording? Oh yeah? Oh we're already streaming and recording. Okay welcome everybody. Yes welcome to the November community board, eight Housing Committee Meeting Ahmed Hartzog that was Barbara Chockey. We're co-chairs of the committee we're very happy that you're here tonight with us. We are very pleased to have back after popular demand. I might say: I know he will be embarrassed by it. I can see a little embarrassed turning a little red, but he was very well received in July Sam Stein from the community service society of New York. They do great work. I will plug Vic Bach, one of our long time, Committee members Rita Popper Close friend of vikbach, and that is how we were very fortunate to have samcom I'll stop. Bloviating Sam is here to give us an update on what has happened since July on rent and eviction and foreclosure moratoriums, or, as he and I discussed earlier. What may not have been going on since then and as an added bonus, he is going to tell us about this report that just came out last week about really important stuff that could be happening to housing in New, York City. So without further ado, I'm going to turn it over to Sam Stein Sam. It is all yours. Thank you. So much for that generous introduction. It's nice to be back with you all and thank you for rescheduling this meeting for Tuesday. Instead of the Wednesday before Thanksgiving I, appreciate that as well, I forgot, Sam's, cooking tomorrow. That's right are we all invited anybody? You know outside social distance, so today is November 24th 2020. The last time I was here, was July 22nd, so almost exactly four months ago, and when I was here last time, I talked about three things: I talked about the status of executive orders, halting evictions coming from the governor. What I said was that they were really important, but they were incomplete. They didn't cover everybody, so people could fall through the cracks and just the fact that their executive orders mean that they expire and that there's always a little bit of uncertainty, which is not what you want as a tenant or as a landlord for that matter. The second thing is that I talked about was the state of rent relief. The state legislator had recently passed a program that program basically helped people. In theory, it was supposed to help cover the difference between what you used to be able to pay and what you can be able to pay now if your income went down as a result, that program was almost universally understood to be too small, too difficult to access and therefore likely to leave out many people who needed it. Then. The third thing I talked about was three bills: that the housing movement- broadly, not every organization, not even always mine, the three bills that the housing movement was rallying behind and those were first an eviction moratorium, which is to say putting it into law rather than just an executive order covering everybody, residential and commercial and saying it's going to last for the duration of the pandemic, plus time to recover to take out that uncertainty and to make sure everybody is covered at this time when staying in your home is the number one key to staying healthy. The second was something called the housing access voucher program, which would be a new state level, rental voucher. That would operate something like a state run section 8 program and would be meant to both keep people from becoming homeless and to get the homeless into permanent housing rather than relying on are extensive and very expensive and underwhelming from the client experience, shelter system and then the final was the call to cancel rent, which could probably be better described as cancelling debt, as in people haven't been able to pay rent because of job loss, they shouldn't then be put into probably permanently crippling debt, as a result of that. So, four months later, where are we now? We've had successive executive orders since the ones that I talked about four months ago, some from the governor and one from the president executed by the health, the CDC, which say that people shouldn't be evicted, but each one of them has its problems. They leave certain kinds of people out. They make certain kinds of people vulnerable and, as a result, we are starting to see evictions picking up especially upstate and people whose cases were in the works before the pandemic are seeing them now. There's a lot of confusion where people are getting eviction, orders or eviction notices, and they don't know what to do. People who have limited access to the internet where the courts are happening right now, people whose jobs don't have the kind of documentation they need to get the CDC protection, all sorts of ways that people are falling through the cracks and so it's incomplete. There's a new op-ed, just posted on city limits that kind of goes through the scenarios where people could still be evicted because of these executive orders are not really doing everything we need and then, finally, in terms of those bills, nothing has happened. The state legislator was in session when I or was about to go into session. When I was here last they went into session. They took no action on of any significance on housing at this time when we're in the greatest housing crisis in a long time greater by many measures than the 2008 foreclosure crisis, and yet the state legislature is not taking it seriously enough to pass important legislation, they're waiting for the federal government to take action at a time when the federal government has said pretty explicitly they're, not acting at least for a while. So that's a major problem like I said, people are at risk of eviction. The rent relief program that we have has really been a disaster exactly as people expected we've seen 57,000 tenants who applied be denied. There was a hundred million dollars allocated to this from the federal government. Of that 23 million has been distributed. Another 17 million has been promised but not delivered, and that means that the majority of the money has not been spent and the Treasury Department is saying. If you don't spend this you're going to have to send it back, which itself is atrocious, but the state government has not figured out a way to to spend that money on rent relief. This is and should be, a scandal and, like I, said, they've taken no major action on the legislation that we talked about either those bills or any others to supplement them. Sam. Just a quick question. Sorry to interrupt. What's the deadline on that money? Sorry just to you know to but I believe it's January 1st holy cow, okay, yeah very soon and in the meantime, we've had federal aid drastically cut back since the last time I spoke with you all unemployment and underemployment are persisting, and our July survey called the unheard third. We're reporting out the findings from that week by week, but we're finding that low-income workers were hit far higher than anybody else by job loss. Younger workers were hit more than older workers. Communities of color were hit especially hard and there's very little relief. Some people simply can't pay rent and are falling into debt and will be subject to future eviction unless some other action is taken. Some people are paying rent, really a surprising number, given how many people are unemployed, but that means that they're missing other things, they're, not paying bills and going into I'm sorry like food, exactly there's a kind of perverse saying in the housing movement the rent eats. First, people are skipping meals and paying the rent they're missing medicine. At a time when you know health is really a top order, priority they're not paying other bills which leads them into credit card debt, which usually has us interest fees. So this is a crisis. It can't go on forever and that leads me to our most recent publication of the community service society, which came out last week, which is called corporate windfalls or social housing, conversions looming mortgage crisis and the challenges or choices facing New York. So this report lays out a scenario, and it starts with what I just said: tenants lost income and can't pay rent. What does that mean for the housing system as a whole, as opposed to individual tenants? Well, one thing it means is: it could be the straw that breaks the camel's back for a lot of landlords who have mortgage bills coming up or tax bills coming up that they were counting on that rent to pay. But we should problematize this a little bit. Why were they so close to that margin? We did research and we found that many landlords in New York City, have over leveraged their buildings. They've taken out far more debt than the rent rolls themselves could sustain under the premise that they could sell their buildings for more in the future that they could get higher rents in the future or that they could cut back on maintenance. We don't really, you know two of those things aren't happening and we don't want the third to happen right now and that puts landlords in a bind. In the meantime, investors, some of the biggest private equity firms, hedge funds, also smaller New York based funds- are lining up to buy distressed buildings that are in financial trouble or to buy the debt from them and now they're the new bank, essentially that the landlords owe, and they can then foreclose on the property. So we argue that the city and state governments need to step in and stepping in means not just helping the tenants pay their rent to the landlord who over leverage their building but creating opportunities to transform over leveraged buildings into what we call social housing, which is a common phrase in Europe and Latin America and other places. That basically means housing that is deeply affordable to those who need it and permanently so housing, where the residents have some form of control over decision making, how the building is run and housing. That is decommodified as and it doesn't go up and down in value just because the market is going up and down, which is something that the current you know. Recession really shows is important. We need housing that can not just go tremendously up in value. Every spike and then tremendously down in value every depression, and so we lay out a number of city and state policies that could help intervene in this crucial moment and help tenants, take control of their housing. There's a bill in Albany right now, called Topa tenant opportunity to purchase act and there's a corollary bill in the City council called the community opportunity to purchase act they're slightly different in ways that will probably get realigned, but the idea is the city should basically and the state should give tenants the right of first refusal when their building goes up for sale and should provide support to buy the building at market value if they can keep it permanently affordable, which means something like a limited equity, co-op model or a community land trust, or they can select a non-profit to be the purchaser and operate it through section, 8 vouchers, project base, section 8, some other form, low-income housing, tax credit, some other form of financing permanently or long-term, affordable housing. So those are important interventions, they're, also programs that we call first look programs which get banks to offer non-profits. The first look at distressed debt before they look to offload it to speculators. They offer non-profits the chance to buy it at written down value and they would buy it based on what the rent rolls can. Actually, you know provide rather than the future returns, that a speculator would hope to get. We also talk about not you know, rolling back the rent protections, but expanding them doing things like good cause eviction, protection which says that whether or not your rent stabilized, you should have the right of first refusal on your rent and that the rent shouldn't be able to you know double triple just to get a tenant out, which is one way that tenants can evict or landlords can evict tenants right now, even with the governor's executive orders just saying okay. Well, now your rent is insanely high and then they can't pay that and then the next tenant comes in and they're actually offered a more reasonable rent increase, but it was just a way to get the old tenant out. So we have a number, probably 10 or 15 policies that we think would be useful. Many of them are at the state level. Just because that's how housing policy is done in New York, but plenty of them are at the city level as well. You can check it out on our website cssny.org it's right at the top and maybe it'll provide some ideas for how to move forward in cd8. That's all I've got to say for now. I'd be happy to take any questions that folks have. Okay, everybody is muted, except for Sam and Barbara and I, and for the I said, Rita I see your hand up, but for those who are new to zoom in case you haven't been on zoom meeting last nine months. If you're looking to find the raise your hand button, you go to participants it's at the bottom of the screen. It's the left one with the people icons there it'll have a number next to it. Right now, I see 33 it's to the left of the chat and if you go there, click on it there'll be a raise your hand icon on the far left side hit that and we will call on you in order. So Rita you are, will be unmuted and where you go, and thank you for everything it really I wish the pixel was brighter other than as bleak as it is, but only because and I know this is my mantra. But do you think that a program like section 8, like Mr Llama again, would help everybody I mean I was talking to my landlord, who built out bought out rather and I looked at him and we have for the first time about 30 empty apartments. We used to have a waiting list that was five years long and he brought out of the program and I said to him. I bet you wish you were still in the program and he just walked and just smiled, but maybe something good can come out of this, and maybe it is Michelle. Llama too completely agree. This is the time politicians have been saying. We need a second Mitchell Llama program for a long time. It's hard to do at a moment when you know our budgets are strained, but it's also hard to do at a time when land values are high and so there's a real argument to be made that it's actually in the down market that we need the intervention. That's when we built the public housing. That's when we did the Hdfc programs, and that can be the case for a new Mitchell Llama, I'm about to put in the chat a publication that my beloved but departed colleague, Tom Waters and Vic Bach. We talked about earlier co-wrote, I, think in 2014 or 2015 outlying outlaying. What a new Mitchell Llama program could look like what we need at the city, state and federal level to achieve it. So I really do think that now is the time for that I think we should be pressing. You know candidates. What do they think about this? How would they do it and yeah? The other thing to note is the developers are getting into affordable housing again. So one of the biggest recent real estate transactions in Manhattan was the related company, which you know recently developed. Hudson yards is continuing to develop. Hudson yards bought a pair of project-based section. 8 buildings in the lower east side and related actually started out in that mixed for-profit, affordable housing model, and they seem to be returning to it now because they know that that's housing that continues to be that you know the rent rolls continue. The demand continues in a down market, whereas Hudson yards is, you know seeing vacancy at a tremendous rate, and so you know the speculators know this. The for-profits know this it's time for the city and state to take action to make sure that they're not you know the future beneficiaries of the up market that follows this downturn. Instead, we have, you know stable social housing. This is proper, but we need to make sure when we talk to candidates that we get some like on the Upper East side, not just in certain neighborhoods, because you know I can see. Very I can see that happening, lands always they're going to think land will come back and they're not going to build it on the Upper East side, which we don't do have some old butcher llamas, but we need new ones and well, it's very important that they hear from the community board that you would want genuinely affordable housing in your neighborhoods, because the assumption is always that you don't, and so, if you need to you know as I know, you have then speak up and speak out and make sure your elected officials know that no you want this so-called in your backyard. Yeah, no question Sam by the way Peggy you're up next but I was gonna, say I subscribed to this thing, yimby it's the real estate. You know yes in my backyard, but they had something on there. Sam I was going to send it to the group, but got too busy to forgot about it, but there was a hundred percent affordable building that was just open. Where was that I forgotten where it was I? Was it in Harlem? Was it in Harlem? Was it east Harlem? It was all it was 100, allegedly affordable, housing I think there was one in the Upper East side. Actually yeah I just saw reported on no, not the one that Ben was talking about on York Avenue with the ten units. This was a different one, or maybe it was that housing is still built, and you know it's. The De Blasio administration has in fact builds more affordable housing than previous mayors, but it's not always targeted at the lowest incomes. Well, that's the problem to define what affordable housing is. That's right, otherwise, really crazy, because what they say is affordable to who exactly and all for all housing is affordable to somebody. So it's a very slippery terrain and they keep citing it, as you said before, in low-income neighborhoods, and so they put this. What is essentially moderate income housing in low-income, neighborhoods, low-income neighbors, then see that as like a slower form of gentrification. Meanwhile, the same housing in the Upper East side would be more affordable than what the market provides right. Okay, Peggy you're! Next, are you one? Are you unmuted? Yes, Sam? Thank you. You brought up some actually some urgent problems, among them the 17 million in rent relief that we all might be losing another and other issues that seem to be facing us immediately. Is there anything that we should be doing right away or any resolution that we should be passing to do something about these? These immediate problems, yeah thanks for asking I, think so. First to clarify the 17 million dollars was promised, but not yet sent out, there's an additional something like 60 million dollars that hasn't even been promised to anybody that is just unspent. So if I was to give advice- and you can you know- take this or leave this- the urgent thing is to call on the state legislature to get back in session now not to wait until 2021, but to get back in session now to figure out a way to spend that money and to prioritize. You know making a new and more expansive program that really will help those in need. You know to pay out the money that we have from the federal government and then to figure out a better strategy. Moving forward: okay, cars, you're, yeah I- think you mentioned something about the tenants have first refusal if the building is sold, if which tenants are you talking about there? If I can't pay rent, how am I going to buy a building sure so, first of all, not every tenant organization is going to be able to do this, but also, if you don't have the money you can designate a non-profit to buy it. So you know for a lot of affordable housing or you know low rent housing, that's not in an affordable housing program. You're right, the tenants don't have the money to buy it so either they can will provide public money for these sorts of acquisitions. There's a bill being proposed at the federal level that would be a federal acquisition fund. I think we could use a state version of that as well, but even without that they can just designate. You know a non-profit that does affordable housing in their neighborhood and say we want them to buy it and we want them to preserve it as affordable housing. I live in. You know, Hell's kitchen I happen to live in Hdfc we've already been through this, but if we weren't our right of first refusal, if we couldn't afford to buy it or didn't have public money, we'd probably say we want. You know housing conservation coordinators to be the sponsor now also some time ago. There was something mentioned that if the commercial landlord reduces the rent and they will get a tax, whatever happened with that, it's a good question- I mean if it was at the state level, then it has gone to the same fate as every other state level rent bill and it was enacted. If it was at the city level, then there you know that can be taken up more readily, but I think it was at the state level. So there's a few proposals like that one was specific to commercial. There was also I think a city proposal that would basically give a city tax property break to landlords who voluntarily lowered the rent. There is a proposal, that's being talked about for anti-warehousing, saying that, basically, if you don't put your property on the market, it's going to be taxed at a much higher rate, that's being talked about by city candidates, but would require state legislation and I. Think some of the new legislators are looking into how to do that constitutionally. So I assume they're in the round round file on the floor. I'm sorry they're what they're in the right round of foul bin on the floor, I'm not sure if, oh yes, right got it the last question, so the tenant gets a rent abatement, he doesn't pay the rent. The landlord has a mortgage. He can't pay the rent, isn't that a snowballing effect, yeah I mean it is and I think that that's part of how we're looking at a looming foreclosure crisis. The question is: what are we going to do about it, and so we could bail out the tenants to pay the landlords to pay the bank. We could bail out the landlords to pay the bank. We could bail out the banks. Another option is we step into this system, keep the tenants in their home and provide some a long-term non-speculative tenure. Agreement to you know, keep the housing affordable in the long term that can be through the existing landlord if they voluntarily enter into it or it can be through a non-profit if they can't afford the building at the rents that are set right now. Okay, thank you sure. Thanks cause Marco you're next, oh thank you. I think we are facing one of the most serious problem in the structural of the housing situation. The problem is what is affordable some of them. You have to cover everybody else, but the money will be coming from the money. I did an exercise, so I understand very well what I'm talking about, because if you said oh I just want to put those people that are very loyal where the money coming from, because the lending all the affordable housing has to be subsidized but has to be subsidizing. One limit, because you kind of give you just only a group of people they hold benefits, while the rest can make a lot of efforts or a in a much better situation, because they kind of afford to do that. It's a very complex problem. It's not I'm not saying that you can not. You forget one section and you give another section. One two always is better to have a mix of income. You can not have extremely low or extremely or middle height. So this is a serious problem that not even the decision making they understand the issue. I'm sitting in the meetings with the in the hearings of the state that one of the politicians went over. There said no I don't want to have affordable housing in my community. That's it! So it's because they don't understand how important it is to legislate not only in our community but in the whole entire city, because at the time when we create affordable housing, we have to create an a an inclusive neighborhood. That means all the neighborhood has to allow to cover the work housing and now, what's going on with the last year, is most of the vehicle lots that have in the declining neighborhood. They push the money over there and they are claiming that they have 130,000, affordable units. If you compare with what is the demand for affordable housing that by itself in the lottery problem, you're talking about 1.1 billion of applications, this information from the HPD is for HPD, there's, no, my information, so that means the city resolved 12 percent 88. Who is going to resolve that so with 88 of the demand of housing? Basically, is an issue that you have to see as a concept of supply and demand the less the supply. The higher is the demand and the more expensive is the housing. It's very simple the question, but that isn't the point of view of money, but the situation is not only that the situation is going beyond that people. They think oh, affordable housing, just put it nice, beautiful housing, and that's it you resolve this- is the affordable housing, no affordable housing. It has to be a social housing. You mentioned that in Latin, America and Europe, but that's what we face in different directions and we fail by the way. So we face in different with different concept: affordable causes, because when people move into one of apartment is not to moving well and it's a physical space, but it has to understand the social integration that happened. The social engagement with that section because people they when they move like it is another word that they leave and then they have the integration of the children to go in and draw the direction and that create that try to create affordable housing. They create a destruction of affordable housing, and that, probably you can see this is the nature problem that not only is a huge, a huge institution, one of the largest one, but they also is they misunderstand: what is affordable housing not only when you provide affordable housing, you have to provide future for those residents, not the future, to have a consistent tradition. They, the family, leads to another family within the same house household, so the children they believe that is the way to live in affordable housing. This is the way to live in the world so rather to teach those children to have good education. Yesterday, I was talking a little about those children that is better to have outside of the affordable care act, because you have much better future. You have more future financially and economically. So this is a serious problem. Now we have a, we will have a combination between misunderstanding, affordable housing, give affordable, give create affordable housing with the limited terms, just only 25 30 years, and then evaporate the whole concept of affordable housing wrong. This is when you, the government will create affordable housing. It has to be in perpetuity, but this perpetuity has to can not be just only for the same family. It has to encourage those families to move forward in the society, because the society offers better choices, better housing, very conditional living, no encourage that those children have more children in those affordable housing and then become a problem. So the concept by instead of holding my house is something very serious, and one of the major problems is before we start and do anything we need to educate. First, we have to have a good political representation that understand. Affordable housing. I was very impressed. One of the politicians on the state. He understand this issue very well, but he's alone he's like one crazy token, in the middle of all people that are reluctant to do something. They are a very good person that understand this issue. So my point in this case is just wait for January February, that's gonna be a nightmare. People is gonna, be in the streets. Why? Because the longer he can not hold, they can not paid the rent if they, if the government do not step in and cover the expenses of the landlord. Even that will be a nightmare. The courts will be fooled, the judge it has to rule in the fabled world because they do not have the obligation to resolve the a social issue. Is that the role of the government? So we have to be careful with in what direction we are going. So, in conclusion, I find that housing has to inter understand that this situation, it has to be as a main problem of the society. This is the core of the society without affordable housing in each neighborhood. We create a disparity of income, especially segregation by income. So this is the concept that we have to discuss. It is sad that, seeing that we have money- and we have to send back- this is very sad completely. Thank you. Thoughts on that Sam or thank you. Marco I mean there's a lot on the table. There I agree that you know housing is a complex social field. It's not just about you, know, unit counts and and little boxes in the sky. But it's about understanding the relationship between housing, social Life, Education, Neighborhood, Diversity, commerce and everything else and I guess. I would agree that a lot of politicians tend to think of it in these narrow ways, but I think a lot of real estate developers do too and that's part of the problem of the profit driven model of housing that we have. I'm not sure I agree on the intergenerational aspect. I think a lot of people live in the same kinds of housing for all their lives and can pass that on to their children, and so I would expect the same right to affordable housing residents, but I respect the difference, but either way I completely agree that if we don't take action now, things are going to look worse and worse into the future and even just from a fiscal perspective. If it seems expensive to intervene in the housing market. Now imagine the costs of not acting, whether that's in terms of growing homelessness, in terms of having to supply rental vouchers to a tremendous number of people without doing anything about the rent problem in the first place is all much more expensive than taking action. No question: Greg, Morris, Greg, hi good evening Sam. Thank you for this time on kind of giving us the intel and really appreciate the thoughts you've made a lot of you shared some of the recommendations. You shared some of your thinking and it's really appreciated. I guess. My question is: what is it that a community board this group of dynamic smart people can do at this moment to move a needle in some way? We all agree. This is a significant housing. Is these are considerable issues they're complicated issues, they're hard ones? You flagged some city legislation, state legislation, there's I, think some common sense. We probably share about what would make the most sense. I don't want to go off on a tangent about the way in which sometimes we talk about those folks in an affordable, housing. I think that's a conversation. We need to be more thoughtful about, but, let's just be very specific in this moment: where's the low-hanging fruit. What is it that this body could do to create some movement, some momentum or move a needle in any of the directions that you've proposed or shared during the course of this good question? And you all know much more about what community boards do and don't do than I do. But I will say first of all signal your intentions call on the state legislature to get back in session asap and take on these issues. Call on the federal government to you know: do a new stimulus bill or take housing as part of an infrastructure package or some other way of intervening. A state bailout is certainly necessary so that the city and state don't end up in bankruptcy, which would be a disaster. You know calling on city representatives to maintain the budgets for housing and not let them fall into the austerity trap. So that's all important I think you know, support legislation that will encourage these kinds of social housing. Conversions, if you agree with the model that Css is putting forward. I think, in terms of low-hanging fruit, one thing I didn't mention is certain kinds of real estate will probably be in trouble before multi-family housing. So you know, as a result of what I talked about with people, making really tough choices and still paying the rent shortfalls are not nearly to the percentage that income shortfalls are so people are, some people aren't paying rent plenty of people still are. A lot of businesses are going out, particularly hotel and retail. So if we put retail aside for a moment because it doesn't really work as a housing conversion program, hotels are a different story, there's good ways and there's bad ways to turn hotels into housing, but we're going to have to do it fast if we're going to do it in this moment where occupancy is way down. It's prop. Tourism is probably not coming up for years, and so these businesses will be needing some relief and it doesn't really make sense to bail out the hotel owners at a time when they'll just be empty, and so we should be thinking about affordable, sustainable, safe ways of transforming hotels into housing and the places that this is going to work best are in residential neighborhoods. Not you know the hotels that are out by Laguardia and Jfk, and that are you know, not really great places to live, especially if you're coming out of a homeless shelter, but in the neighborhoods where people can find work where they can get supports, there's different models. It could be supportive housing where there's in-house services and hotels are actually kind of set up for that kind of thing. They have conference rooms, they have dining services like they have laundry services that it's actually not that big a transformation, but it also could be more permanent housing aimed at people coming out of the shelter system. If you combine two rooms into one put a kitchen into one of them, you suddenly have one a large number of one bedroom, one or two bedroom apartments, without going through the entire process of acquiring land building new housing- and you know all the expenses that go along with it. So if this is something that you're interested I would encourage you to signal it to say you know, other communities are rejecting homeless people in hotels. We feel differently or we don't want to continue the failing shelter system. We want to build permanent, affordable housing that will help people transition out of the shelters and into something long term. I really think hotels are probably the if not the lowest hanging fruit, the most immediate piece of the real estate market on the chain to fall away from its old business model and therefore the biggest opportunity for house and conversions. You know if I jump in real quick, you know going the other way, Sam, there's a and I can't think of it. It's on 64th street between second and third in our community district. It's across from the eye near hospital on 64th. It was an apartment, building, they've turned it into a hotel, so reconverting those kind of places can be a priority, I mean, and even some of the hotels that we've seen already transition into temporary shelters. That really should be invested in and turned into permanent housing. In my opinion, some of those are former Sros, so they were a permanent residential model. Then they became these tourist hotels now they're, essentially Sros again, which is more of a return to form than a new development. I think we can go one step further and turn them into decent housing and make sure that we don't have the return of the old welfare hotel model, which is really not good for anybody. Okay, that's interesting and Sam. I do hope. You'll stick around with us, because I've I have the feeling that a resolution is brewing here in this group here. So I'd love your to stick around to, as you said, get the most effective resolution that we can, where we're gonna direct it Greg. Thank you, Rita you're up again or I'll. Tell you what Rita I know you I know you're next on the list, but Tyler I, don't know your last name, but Tyler hasn't spoken, so Rita, I'm gonna, take Tyler. First and I come back to you because you've already had one question: if that's: okay, good, okay, Tyler I, don't know your last name. So my apology but Tyler Welcome and you're up. Thank you so much so this is my first time here and I have to I appreciate everything that everyone's been saying. I know that a lot of people are very passionate about this issue and I noticed that we've been focusing a lot on the issue of converting units, which is obviously a very important one because, as you said, a lot of those you know units are already basically ready to go, but I guess I'm trying to understand how we can move beyond just conversion and really expand our housing stock and in light of that, what we could do to reduce the input or building costs of this new, affordable housing or market rate housing in general. Just to ensure that we can help the most people possible and we can ensure that housing is as affordable as it can be sure. There's certainly some there's unnecessary red tape, that's involved in housing, development and then there's very important democratic input. That's involved in housing and we don't want to mix up the two, but I think that there is plenty of room to cut back on some of the things that make housing unnecessarily expensive to build and I would say we should probably prioritize non-profits in getting through the system to make it essentially easier or faster and cheaper to build non-profit housing than anything else, because as we as we've seen, you know what you can make the argument that we need housing at all income levels, but the market is really only building to one of them. So we need changes to the regulatory system that make it more economically feasible to build housing at the rates that people really need. I think we're going to be seeing proposals from some of the non-for-profit developers around this in the next within a month, I, say I, think I know we are going to see proposals about that in about a month. What are those going to look like exam I? Don't want to I, don't want to get ahead of my coalition partners who are still in development on this, but ideas for the next mayor and the next city council on how we can reform some of these systems. Is this something that we could talk about? Maybe in January or is what I'm getting at interesting topic to follow up the there'll probably be a platform that comes out sometime in earlier Mid-January, great okay, that's great! Thank you Tyler and welcome thanks for coming. We hope to see you again at our next meetings. Thank you hope to be here. Yeah Rita, you're back up again, Tyler make sure you get on the mailing list. So you know when the next meeting is yes please. Yes, you know one of my I have so many pet peeves with housing that we don't have enough time to stand up, but I just want to give you a few facts that I know that are factual. The most amount of hotels and motel rooms for homeless people capped at 3,900. and the city pays the motel hotel 200 a week per room last year. They only used I believe and this I'm bad with I. Think something like 18 of that. Where does the rest of the money go because 39 times 200 per week is put aside. So what happens to the part? That's not used over the years. That's number one number two I am so against this. Affordable housing brings down a neighborhood that I just want to show everybody it didn't. We have the examples I'm going to take Independence Plaza down on Greenwich Avenue. Nobody wanted to live there. Nobody, the owner, put up the building the developer. Thinking he's going to it's near the financial district. Nobody wanted to move into it. There was nothing there, so he then converted it to a Misha Lama. Do I have to tell you what that property is worth right now he would wishes everybody would move out and so that he could have everybody come in, meanwhile, that affordable housing brought small businesses like shoemakers libraries, schools, but that's the way it was throughout the city, whether it was in Brooklyn whether it was in the Upper, East, Side, West side, East, Harlem, West, Hall, affordable housing is you know when you think that they're going to bring in the great unwashed of the world and we are going to have to go over every night and wash their children? Nobody wants it, but that's not what it's about and that's what we have to fight I don't want to hear about. We have people who are working in hospitals who can't afford the rent they are, and we now know are essential workers. So we have to change. We have to change a mindset and Sam. If you say the elected officials have to go back to Albany, that's what they have to do and there's no. If ands and buts about it and if I was making a resolution. That would be the resolution to have the elected officials go back to all be on an emergency basis to help solve what is going on because there's a domino effect. There is from businesses to banks to any client to hospitals, to schools to whatever, so we can't sit back. We can't sit back not that this group has ever set back, but now we have to be vehement in our community board. We have I believe and don't go in three full blocks of empty space that have already been laid leveled, three full blocks. There is nothing that every single developer, who bought into Mitchell Llama, ended up to be a very rich person, so we need a better selling. Do we need advertising? Do we need whatever it is? Okay, I'm going to be quiet. No thanks! Rita and Marco. I know you're up next, but give me a second and so I think we're getting to that point. In terms of like a resolution, it seems to me that you know doing a resolution to call on any type of federal. You know I know where we are in the food chain. The long members of the community board I mean we're advisory. We know that I think the biggest bang for the buck. If you will, is either doing a resolution, I think either towards the city council, but I think Sam. You I think you would might suggest that any resolution or any effort we could have to move the ball forward- would be best directed towards our state representatives. At this time, if I listen to you correctly tonight, I think it may have to be more specific than Rita's idea. I think we have to really just to say, go back, I'm not sure we have to attach I think something else. To that. Do we ask them to pass what Sam was talking about with the maybe, in fact, if I can suggest, I think the topo bill is important. The eviction moratorium is kind of urgent, okay, a real eviction moratorium, that's legislated and not just an executive order, and we need that from the state. Okay, that from the state is there a bill or any? Are there any bill numbers? And if could you give me those and then we can put them in the resolution, I'll find them and I'll put them in the chat. Just now, I think that's important. Yeah I mean we'll. We can clean up the resolution later. So if you supply them to me, I'll put them in for our for the full board on in December anyway, I didn't mean to cut everybody off Marco. You have gone already once so. I'm gonna do what I did with Rita and Tyler, and I'm gonna skip over to Elita you're up thanks for coming thanks very much Ed Sam. Thank you. So much for coming, affordable housing is really an issue for CBA, as is it should be for communities around the city, and it's such a desperate need. So I had a couple of questions. What is the difference between the effectiveness of an eviction moratorium signed by the governor as an executive order and one passed by a legislative body, and also are you in conversation with any of the many people running for office about their positions on affordable housing and what they could do and what the city should should be doing sure. So, first question I think the benefits of legislation is that it's clear: it's not going to change it's long-term. You know these executive orders have all been short-term, they've lasted about a month and then they've been extended and often they've been changed with every extension. So nobody knows what's happening. They come the night before the last executive order expired and so I think that the legislation can be comprehensive and can be long lasting in terms of elected officials. My organization is a 501c3, so we don't make endorsements. We do limited political lobbying, but not electioneering, and so we haven't done that, but anytime basically we'll provide our opinion to any elected official who comes to us and says either. What do you think of my plan or what should I be prioritizing, and we do that on an equal basis? Anybody who comes to us, we advise, we are holding two mayoral forums, I think one in February and one in March, or maybe it's one in January and one in March. The first one is on healthcare issues and the second one is on housing and economic stability, and so we will be grilling all of the mayoral candidates on their positions on these issues: fantastic yeah, housing. Now what we're saying is we want to do something now right, I was going to say Sam the difference on those executive orders, all of those executive orders. The governor has been signing. They will expire once the declared emergency that gives them the authority to do those executive orders ends or whenever that they decide not only that they all have a. They all have an end date. So it's for the next four months, four weeks. This is the rule right and then, on the you know, last day before that marker we get a new one right. Well, I was used to saying all of them, though. The entire of the whole environment structure disappears when the pandemic is over right and the legislation is structured to give people time to recover. As you know, jobs come back as life comes back, and so it's not the pandemic ends, and suddenly everybody pay all your back rent. Well, the legislation goes on forever until we change it right. Well that too, but this one is I believe it's until the end of the crisis plus a year. Oh okay, it has its own ending. Could I just ask one more thing: ed, I'm sorry sure and thank you I know that we're trying to do something immediately, but it's useful to know what the candidates positions are, because we have all of these elections coming up. I, affordable housing is a crisis around the country, as we've seen gentrification pushing people out all over the place. Are you aware of any jurisdictions that are have and I know that New York is unique that have tackled the issue of affordable housing in a way? That's been really successful because we hear from this administration that we need tall buildings and we need fancy buildings and they'll bring in affordable housing. We don't see any of that. There's no city that I point to that. I would say you know this is the city on hill I. Think a lot of cities are doing a lot of interesting things that can be combined in different ways. Now the city of Philadelphia, basically just passed over a lot of affordable housing that was at risk of expiring to a community land trust which exists in perpetuity, and that's one way of getting out of that model of housing that just like is created, is affordable and then disappears, and then the next generation doesn't get to benefit from it. My mic got very quiet, I'm told I'll come a little closer to it. Washington DC has had this tenant opportunity to purchase acts since the 1970s and, as a result, has a whole network of limited equity co-ops throughout the city, and they have a fund where basically, a portion of tax revenue from new development goes into this fund, which then helps the tenants who otherwise couldn't afford to buy their building to buy it and they keep it affordable. So I think a lot of people look to the Washington DC model for that. So there are all these pockets of interesting ideas. I would love for New York to be the city that becomes the one that combines them all into something. That's really transformative. Okay, I would agree. Thank you so much for your time and thank you. Ed and Barbara thanks Elena Marco I hate. To do this to you. I'm sorry, but I do see Billy's hand. I will come back to you, but Billy hasn't had an opportunity yet so we'll give every first shot here. So Billy Welcome thanks and apologies for being off camera, I'm a little under the weather, but thanks for being back with us again, Sam I have two questions. One is what is your perspective on rezonings in wealthier neighborhoods, like the recently proposed Soho Noho rezoning, I've heard compelling arguments on both sides which I'll spare folks my interpretation of, and then my other question is: do you have a view on the efficacy of something like a land value tax to tax vacant land? And what I have in mind is we have you know a few locations in our district community district where it's, the buildings have been torn down and the land has been vacant for a long time? And you know perhaps the developer is waiting for one last tenement building to be torn down before they put up a super tall, perhaps they've given up on their project. But it seems to me that we have this very a system of perverse incentives where developers right now can keep lots vacant and warehoused, essentially until they're ready to build up, and I'm wondering whether you think a land value tax would be effective at addressing that thanks Sam. So, on the first question about rezonings in high income, neighborhoods I certainly think it makes a lot more sense than the approach that the city has taken so far, which is to basically only do these rezonings in areas where the median income is lower than the target range of the affordable housing, and so it ends up adding expensive housing and then affordable housing. That's still unaffordable, that's a bad model in a place like Soho. You know whether or not this is the best way to produce affordable, housing and I think we have better models. At least it creates a net increase in affordable housing, and so it is fundamentally a different thing. The city's studies, initially around MIH showed that it works better in high-income neighborhoods than low-income neighborhoods, but for political reasons, they re-zoned the way that they did. Basically, all the analyses left right and center come to that conclusion, and so you know, is it better to do it in a place like Soho than in a place like east Harlem? Yes, it just makes more sense. It has better effects. I still think we can do better, but if it's just a yes, no, my organization has come down. Yes and we generally don't weigh in on neighborhood rezonings. But the Soho question represents a change in policy, and so we weighed in on that I agree, though there are compelling arguments on the other side. I think we can all do better, but if it's just yes, no, we wake. We end up on. Yes, the second question about the land value tax, I think that's an old and important idea that we should be looking at now again. As you said, there's vacant land that landlords banks see as more profitable to leave empty than to fill with housing if they don't think they're going to get the full market potential of you know two years ago on it, and so yes, we should be using the mostly the state's powered attacks, but the city does have the property tax as well and can do interesting things on this for any New York City history buffs. This idea was promoted by Henry George over 100 years ago. Who was an economist who ran for mayor and very nearly won on the proposal that basically land is not a thing that the owner created and therefore shouldn't be something that they can profit from? They can profit from the building that they, you know, finance, but they can't profit from the land. The land's value is socially produced. It's valuable because it's because of public investment in infrastructure, in the cultural activity of the neighbors and the economic activity of other people. So there's a whole body of theory around this. That folks can check out if they're interested wow on some of those sites, we lost affordable, rent, regulated housing and now it's vacant because it was they were torn down. So we've lost it's a double loss for the community. That's by the way. That's an interesting idea about the the land boy that would really undo a lot of property law here in America boy that would anyway Marco you want you, oh or Billy. Do you have any more? Are you had the two? So Marco you're? Not no! That's it thanks! Dad thanks, Billy sorry Marco Sorry for making you awake but you're up again. Oh thank you. Ed I think you did the right thing to give first choice to those that didn't speak. Okay, so the problem is that this topic, one time, lead to another one and right now you raised another issue: oh that I. Don't want to touch that issue that you just touch because I have an idea. I have a plan because it's true what you describe about land but in that direction. One of the examples that I believe is the value of I and that's you're, absolutely right. The value of the land in Manhattan that versus the land of the La of land in up in on outside of New York City one it could cost sixty six dollars versus the other one cost six hundred dollars. It's not because it's outside it's location, plus the infrastructure that was put in that part that's made valuable and that is in that direction. I believe that we have to create like a tax for those properties that profit the Second Avenue Subway, so they demolish affordable housing. They marketing with the somewhat, is a couple of or a couple of feet from the entrance to the subway, so they profit of that, and that has to be taxed and the only way that I believe is to at least return back the dwelling units that the affordable unis that was demolished, but this is I, don't want to go in the direction, because this is another topic that I love to discuss. But the issue is I would like to raise. Is the empty hotels? Yes, it sounds great, but seeing what happened on the Upper West side, the Lucerne hotel- that tell me a lot. The community is now is outrage. They don't want to see the those people over there why the first of all they put just only one type of income in those kind of housing. Secondly, the type of affordable, the type of housing is targeted. People that do not cook do not leave people; they are just only a tourist that are coming to our city, and then you want to convert in a permanent residential area. Does it run even that is in conflict with the building code? Clearly established that you can not have a permanent housing over there, so it's no easier just only oh, let's go to all the hotels change, no, it's very complicated issue and the complication is shown right now on the Upper West side that the after inside they don't want to see them. Why? Because the residents they don't have any space to have as a permanent housing they had to go outside on the street, and that is the complaint of the community, so the best way obviously is always to partner with a not for profit organization. Why? Because they have a mission statement. While they call right now, those people they call, they have a special name. I forgot these people, they are not for profit, but the goal is the mission. Statement of them is to don't look for profits. Look for a develop, affordable, housing versus the regular developer. This developer, they think, had to make more money every single time, so they don't have a there's their goal and they have. They are nothing wrong by the way this is, the capital is working at its best. So what is wrong? Is our decision makers they allow to step in this kind of housing people these kind, the developers that they are money hungry, and this is where we had to stop. We had to think more as a social housing and the mission statement of this law for property almost match with the needs of affordable housing, because if you create the hvfc program, this is a failure too. There are good examples, but there are a lot of failures. I've been in this kind of housing they're, seeing that those people didn't want to pay nothing, they want to live free owners, they pay very well. They maintain very well even though that they bought the properties in 500 these apartments, but the issue of others. They sold the apartments and hundreds of thousand dollars, and they left they took the cash in so I think the best way is, any decision has to start. Thinking is working with a no-for-profit organization with these people that understand their mission statement is to stay right here to enforce the law to enforce the housing has to. It has to be maintained by the residents, not by the government. No every time the governor can not support any negligence of their residence. Almost they leave them free, that's wrong. It has to be they're responsible and it has to be a percentage of their income has to pay. So I think it's. This is a very complicated issue. Regrettably, I have to cut my comments because I don't want to take more of the time. Thank you thanks. Marco say how many thoughts on that or well yeah. That I should be clear that the model for the hotel conversions is to have mission-driven non-profits, doing it and a lot of them we hope, would be for a range of income so that it's not you know a warehousing of people out of shelters into a new model that something much better cars I see you're up again, yeah I see we have sea rides rap here. Do they have any comments? Oh very good question Sam gets a breather for some water. I saw the robin I think he was Madison, I'm sorry Madison, Apologies Madison. Yes, sorry, no, that's! Okay! There! You are hi. What was your question? I'm sorry, I think we were just I. Think Cos was just wondering if the assembly woman has any thoughts on this Topa right, Sam, the Topa actor, that's up there in Albany any thoughts of where we are on that thoughts on passage. I believe she supports it at the moment. I don't want to speak on her behalf at this time, because she, but she does support it, and that's all I can really say about that. Okay, I, don't think we need you know, for you know anybody to tell us that they support it. I think at this stage, the way things are going, I think we need action. We need somebody to start the ball rolling I mean this has been going on forever and ever I'd like to make a suggestion. We move to a resolution I I'm on board with that. I was like about to say the same thing: Barbara okay, because we want something to come out of this and I Sam. You have to help us with the wording of it, but I think we want the state legislature to convene immediately to pass, and then you can give us the language of the bills. That would the first avoid. We need a legislative moratorium, because an executive moratorium is not effective enough and then we want the Topa. What else we want and if you have the bill numbers we can put that in there and I don't know if somebody wants to second it. Oh I, don't know if the actual Americans should be seconding it, but we'll throw it out there. We have a lot of our board members here. Anybody that can't okay, thanks Elita thanks Kim I, saw the hand go up there. Everybody's now on one screen, so I can see you thanks. Peggy I see your thumb thumbs up that is okay, see we can work on. We can work on the language, we'll clean up the language like we did after the last meeting for the minutes, but does that capture the resolution bar, but we want to have I think yes, the legislature convening. We want them to come back immediately because can is going to come soon right, we're not waiting for the new members to get up that we have enough. Now we don't need a super majority. We have enough already, as it is, to get this through and get through the Senate in the assembly right. So we wanted to convene immediately past Topa anything else you want to add in there and the more it's well, the more. It's definitely the more. The moratorium legislate past legislation for the moratorium, okay and maybe Sam- can help us with the language anything else. Folks, Anybody board members public can I make a quick suggestion. Ed yep Elita. So instead of immediately have a date like no later than November, 30th or December, 1st I think immediately. Let them define immediately. That's the problem is defining immediately. Okay, you want to say by November 30th, okay November 30th. What do you suggest? I? I'm not sure I have a good strategic vision on this. I mean practically. We won't be back by the 30th so and you won't vote on this until December 16th. We want to vote on it now and but what the oh right horde will not be voting on this. So again, Sam is right and look practically bear with me. I might lose you all cause. I'm gonna go to my calendar, but I mean practically speaking. Let's come on, I mean we moved. We have thanksgiving in two days and I. Don't think much is happening between Thanksgiving and Monday and then we're into December and then our next meeting for the full board is not till the. We can't do this at land use on the ninth I. Don't think we can do it. We could do anything in lane. Could we do it in land use? No, we need it. Can we do it in man use it's an emergency. We've had street life at land use when we had a very full board meeting the following week. The problem is that land use is likely to be a long meeting. So maybe you don't want to combine it. I, don't know what else we have, but it will go before the board either the 9th or the 16th so either way. My feeling on the ninth is we're really in a pickle right. We've got thanksgiving in the sense of you know. That's in two days, the 30th that we are in celebrating Thanksgiving. Well, no. What I'm saying Barbara is: we need the full board behind this I know. But what I'm saying is we wait till the 16th that we bump up into the same issue again, because the holidays in terms of the christian holidays are a week away? I think it's I would like to do it on land use, that's up to a leader, yeah I'd like to do it on land uses where I'm driving at that's. What I would like to do I would then we'll do it on land use, because there definitely is an immediate urgent need for this. So I'm not I think that we need to make our intentions known as quickly as possible. So I jumped the gun a little with next week, but we could do it the week after. So then in the resolution, then, to the very good point of let's have a date certain then we could have an earlier date, certain of say, December 10th, because then you start running into Christmas and new year's and right. So we have. We give them some time right and then, if it's too close they'll say well, let's just wait for the new members to come, so they don't need the new members for this. No, they don't but an urgent, a rapidly approaching date as soon as we could make it has an impact right impact they're going to do it virtually they're, not having me that could have it in Albany they'll do a virtual meeting. So then I I'm going to presume from this conversation that we want to put December 10th at least that's one, definitive date that we will agree with tonight. The tenth is fine. Okay, then, we'll have that in the resolution, any more debate or suggestions additions. Anybody want to call the question Rita. Would a letter be faster than a resolution? I think we need something stronger than a letter. Yeah. Okay, I'm just asking questions. Let it be immediate, I know, but I think unleaded is not I think we still have to wait for the full board, so it it's not just a committee recommendation. Just asking I usually would go with a letter, but I'm concerned that we get something done strongly. We can start talking to the legislature tours about it right and we have and Madison is here, so you know she's going to go back and talk to Assemblywoman to see right, not tomorrow talk to Liz about it. So that's so as you'll know, does it make sense to have a letter to the governor's office asking for some kind of extension, pending legislative action on this or something so that, because the governor's been signing all of those executive orders well I mean. The thing is that the resolution, though, that we're looking for asks for a legislative solution, so he can't I think we should no I know he can't act on the list. He may not like the fact that we're asking for a legislative solution so I think we should I, don't know. Okay, I just was thinking that you have the ability to sign something: I, don't want to jump the gun and do it without a legislative solution as much okay, that's fine I was just throwing something out there, but thank you it's my concern. Okay. Thank you, though yeah. No thanks, Alita anybody! Well nothing. Anybody want to call the question from here. So I you know I'm reluctant to do so. No one wants to call the question. Well, I lowered everybody's hand back down, so all you did now. You can see somebody's calling the question. Oh sorry, I just rolled up Marco, you call it Marco. Well, I wasn't planning to call the question, but the issue right here is I absolutely agree with the moratorium, but at the same time we had to put that Delano has to have some relief because the landlord can not hold the all the expenses of what I just don't know the wording for that. So I think this. That's the next step, Marco I think that's the next step. First, you have to get the tenants relief and then the next step you can get yeah sure we need to look, but that's another step, but I have no idea how you do that one issue, because I think it will be unfair for one part, because in any event who is responsible housing is the government is not the landlord and we have to respect the money. Thank you. Okay, cause reader, yeah I was going to call the question, but at the same time I have a question. Why can't we write a letter and write the resolution? So we get, we start the ball rolling, much quicker we're still. We can still do both write the ladder and pass the resolution at the full board. Okay, I have no problem with that except okay. I, anyway, call the question. Okay, is anybody? Will you have this? Will? Are you still here yeah I'm here? What do you need we're calling the question on the motion? So should we just yeah we'll avoid anybody who wants to know, vote no or abstain or not vote for cause? Let you know yes, so raise your hand right now, virtually in the participants menu. If you would like to vote, no abstain or not vote for cause on this issue. It looks like we have one two, three, four, five, six, seven, eight nine ten eleven 13 members of the board here this is great and I would ed. Would you read out all of their names so that, if you I'm sorry so it's Barbara and myself, along with Elita Camp, Anthony, Cohen, Cospagnalani, Gail, Barron, Gregory, Morris, Kim, Selway, Marco, Tamayo, Peggy, Price, Rebecca, Lamorte, Rita, Popper, Sandra, Coleman and that's all I see right now. Did he get any did I get everybody Billy was everyone he was under the weather. He might have taken off. I just wanted to read into the public record. Oh Billy are you here, I know he had to leave okay, I! Guess then that passes and anybody have anything else: jokes tips for turkey. No, nothing! Zip! Okay! Well, then, I guess we'll entertain a motion well before that Sam. Just for me and I. Think from everybody here and the folks who were here and had to leave or whatever but great to have you we look forward to having you back and I know you'll, be getting a call for me early next year for January or February to hear about this project you're working on. But thanks for having me, we need language from him before January right, we'll get that of course, but you know other than that before we adjourned, though just from us, you know happy. Thank you so much stay safe out there, folks and I would say, don't have too much pumpkin pie, but I would be telling you to do something that I, probably won't. You know, be able to hold up on my end so enjoy and we'll entertain motions for adjournment. Stay safe, everybody! Yes, any motion to return thanks, everybody have a great holiday, we'll see you in December. Hopefully thanks and ed. Your December date is December. 23Rd I think it is okay yeah for those who are still here and hanging around I, don't know if we'll do it before Christmas Eve, but but we'll let you know what do we do on Christmas Eve, Great? Well, okay! Well, your regularly scheduled date is December 23rd, so, okay, all right and if you want to send me an agenda because I'm going to send out the notice today. So all right thanks will thank.",
            "summary": "What may not have been going on since then, and as an added bonus, He is going to tell us about this report that just came out last week about really important stuff that could be happening to housing in New, York, City.\nThey didn't cover everybody, so people could fall through the cracks and just the fact that their executive orders mean that they expire and that there's always a little bit of uncertainty, which is not what you want as a tenant or as a landlord for that matter.\nIn theory, It was supposed to help cover the difference between what you used to be able to pay and what you can be able to pay now if your income went down as a result, that program was almost universally understood to be too small, too difficult to access and therefore likely to leave out many people who needed it.\nBroadly, not every organization, not even always mine, the three bills that the housing movement was rallying behind and those were first an eviction moratorium, which is to say putting it into law, rather than just an executive order covering everybody, residential and commercial and saying it's going to last for the duration of the pandemic, plus time to recover to take out that uncertainty and to make sure everybody is covered at this time when staying in your home is the number one key to staying.\nThe second was something called the housing access, voucher, program, which would be a new state, level, rental voucher.\nThat would operate something like a state run section 8 program and would be meant to both keep people from becoming homeless and to get the homeless into permanent housing rather than relying on are extensive and very expensive and underwhelming from the client experience, shelter system and.\nYou're going to have to send it back, which itself is atrocious, but the state government has not figured out a way to to spend that money on rent relief.\nIt can't go on forever, and that leads me to our most recent publication of the community service society, which came out last week, which is called corporate, windfalls or social housing, conversions looming mortgage crisis and the challenges or choices facing New York.\nWe argue that the city and state governments need to step in and stepping in means not just helping the tenants pay their rent to the landlord who over leverage their building but creating opportunities to transform over leveraged buildings into what we call social housing, which is a common phrase in Europe and Latin America and other places.\nThat basically means housing that is deeply affordable to those who need it and permanently so housing, where the residents have some form of control over decision making, how the building is run and housing.\nThey're slightly different in ways that will probably get realigned, but the idea is the city should basically and the state should give tenants the right of first refusal when their building goes up for sale and should provide support to buy the building at market value if they can keep it permanently affordable, which means something like a limited equity, co-op model or a community land trust, or they can select a non-profit to be the purchaser and operate it through section, 8, vouchers, project, base, section 8, some other form, low-income housing, tax, credit, some other form of financing permanently or long-term, affordable, housing.\nNot you know, rolling, back the rent, protections, but expanding them doing things like good cause.\nIt's hard to do at a moment when you know our budgets are strained, but it's also hard to do at a time when land values are high and so there's a real argument to be made that it's actually in the down market that we need the intervention.\nA new Mitchell Llama program could look like what we need at the city, state and federal level to achieve it.\n8 buildings in the lower east side and related actually started out in that mixed for-profit, affordable, housing, model, and they seem to be returning to it now because they know that that's housing.\nThe for-profits, know this it's time for the city and state to take action to make sure that they're, not you know, The, future beneficiaries of the up market.\nThis is proper, but we need to make sure when we talk to candidates that we get some like on the Upper East side, not just in certain neighborhoods, because you know I can see.\nThey're, going to think land will come back and they're not going to build it on the Upper East side, which we don't do have some old butcher.\nLlamas, but we need new ones and well, it's very important that they hear from the community board that you would want genuinely affordable housing in your neighborhoods, because the assumption is always that you don't, and.\nSo, you know for a lot of affordable housing.\nYou know low rent housing, that's not in an affordable housing, program.\nYou, know a non-profit that does affordable housing in their neighborhood and say we want them to buy it.\nWe've already been through this, but if we weren't our right of first refusal, if we couldn't afford to buy it or didn't have public money, we'd probably say we want.\nIt was at the city level, Then there you know that can be taken up more readily, but I think it was at the state.\nThere is a proposal, that's being talked about for anti-warehousing, saying that, basically, If you don't put your property on the market, it's going to be taxed at a much higher rate, that's being talked about by city candidates, but would require state legislation and I.\nAgreement to you, know, keep the housing affordable in the long term that can be through the existing landlord if they voluntarily enter into it or it can be through a non-profit if they can't afford the building at the rents that are set right.\nI did an exercise, so I understand very well what I'm talking about, because if you said oh I just want to put those people that are very loyal where the money coming from, because the lending all the affordable housing has to be subsidized but has to be subsidizing.\nThere said no I don't want to have affordable housing in my community.\nIt's because they don't understand how important it is to legislate not only in our community but in the whole entire city, because at the time when we create affordable housing, we have to create an a an inclusive, neighborhood.\nI. Think a lot of people live in the same kinds of housing for all their lives and can pass that on to their children, and so I would expect the same right to affordable housing, residents, but I respect the difference, but either way I completely agree that if we don't take action, now, things are going to look worse and worse into the future and even just from a fiscal perspective.\nI don't want to go off on a tangent about the way in which sometimes we talk about those folks in an affordable, housing.\nSupport legislation that will encourage these kinds of social housing, I think, in terms of low-hanging fruit, One thing I didn't mention is certain kinds of real estate will probably be in trouble before multi-family housing.\nSo, you know, as a result of what I talked about with people, making, really tough choices and still paying the rent shortfalls are not nearly to the percentage that income shortfalls are.\nIf we put retail aside for a moment because it doesn't really work as a housing conversion, program, hotels are a different story, There's good ways.\nWe should be thinking about affordable, sustainable, safe ways of transforming hotels into housing and the places that this is going to work, best.\nYou know the hotels that are out by Laguardia and Jfk, and that are you, know, not really great places to live, especially if you're coming out of a homeless shelter, but in the neighborhoods where people can find work where they can get supports, There's different models.\nThey have conference rooms, They have dining services like they have laundry services that it's actually not that big a transformation, but it also could be more permanent housing aimed at people coming out of the shelter system.\nYou combine two rooms into one put a kitchen into one of them, You suddenly have one a large number of one bedroom, one or two bedroom apartments, without going through the entire process of acquiring land building new housing.\nWe want to build permanent, affordable housing that will help people transition out of the shelters and into something long.\nI think we can go one step further and turn them into decent housing and make sure that we don't have the return of the old welfare hotel model, which is really not good for anybody.\nThat's involved in housing, and we don't want to mix up the two, but I think that there is plenty of room to cut back on some of the things that make housing unnecessarily expensive to build.\nAffordable housing brings down a neighborhood that I just want to show everybody.\nSo that he could have everybody come in, meanwhile, that affordable housing brought small businesses like shoemakers, libraries, schools, but.\nAffordable housing is you know when you think that they're going to bring in the great unwashed of the world.\nWe have people who are working in hospitals who can't afford the rent they are, and we now know are essential.\nSo much for coming, Affordable housing is really an issue for CBA, as is it should be for communities around the city, and it's such a desperate, need.\nWhat is the difference between the effectiveness of an eviction moratorium signed by the governor as an executive order and one passed by a legislative body, and also are you in conversation with any of the many people running for office about their positions on affordable housing and what they could do and what the city should should be doing.\nI know that we're trying to do something immediately, but, I, affordable housing, is a crisis around the country, as we've seen gentrification pushing people out all over the place.\nAnd I know that New York is unique that have tackled the issue of affordable housing in a way.\nNow, the city of Philadelphia, basically just passed over a lot of affordable housing that was at risk of expiring to a community land trust which exists in perpetuity, and that's one way of getting out of that model of housing that just like is created, is affordable and then disappears, and then the next generation doesn't get to benefit from it.\nWe have you know a few locations in our district community district where it's, the buildings have been torn down and the land has been vacant for a long, time.\nIt seems to me that we have this very a system of perverse incentives where developers right now can keep lots vacant and warehoused, essentially until they're ready to build up, and I'm wondering whether you think a land value tax would be effective at addressing that thanks, Sam. So, on the first question about rezonings in high income, neighborhoods I, certainly think it makes a lot more sense than the approach that the city has taken so far, which is to basically only do these rezonings in areas where the median income is lower than the target range of the affordable housing, and so it ends up adding expensive housing and then affordable, housing.\nYou know whether or not this is the best way to produce affordable, housing, And I think we have better models.\nYes, The second question about the land value, tax, I think that's an old and important idea that we should be looking at now.\nI believe that we have to create like a tax for those properties that profit the Second Avenue Subway, so they demolish affordable, housing.\nWe- had to think more as a social housing and the mission statement of this law for property almost match with the needs of affordable housing, because if you create the hvfc program, this is a failure.\nThinking is working with a no-for-profit organization with these people that understand their mission statement is to stay right here to enforce the law to enforce the housing has to.\nOkay, because we want something to come out of this and I Sam. You have to help us with the wording of it, but I think we want the state legislature to convene immediately to pass, and then you can give us the language of the bills.\nI think it's I would like to do it on land use.\nOh sorry, I just rolled up Marco, you call it Marco, Well, I wasn't planning to call the question, but the issue right here is I absolutely agree with the moratorium, But at the same time we had to put that Delano has to have some relief because the landlord can not hold the all the expenses of what I just don't know."
        }
    }
}