{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB1",
            "channelId": "https://www.youtube.com/channel/UCs28KnPXNjSczQAek-w2vOg",
            "title": "10/13 Youth \\u0026 Education Committee 2020",
            "publishDate": "2020-10-14",
            "shortDescription": "10/13 Youth \\u0026 Education Committee – 6:00 PM \\nLocation: Live Remote Meetings - https://live.mcb1.nyc\\n\\n• Senator Kavanagh Town Hall on Young People’s Civic Engagement - Discussion\\n\\n• DOE review of ventilation requirements in school buildings - Discussion*\\nUpdates on remote learning and planning for 2020-2021 academic year by Katherine Maro, Program Manager, NYC DOE \\u0026 Stephanie Barreto-Lastra, Community Affairs Borough Manager, NYC DOE - Discussion \\u0026 Possible Resolution\\n\\n• Study on Effectiveness of Synchronous Online Instruction - Discussion \\nSCA/Mayor’s Office construction of Trinity School - Update\\n\\n• Capital and Expense Budget Items for FY 2022 - Discussion\\n* Environmental Protection Committee invited for item #2",
            "lengthSeconds": "2:18:09"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB1",
            "normalizedName": "Manhattan Community Board 1",
            "twitterName": "Manhattan Community Board 1",
            "youtubeChannelName": "Manhattan Community Board 1",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCem-EVlcjv8dPUETrVMt2yQ",
            "twitterHandle": "@CommunityBoard1",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "fPMSfCPXU7w",
            "fillerWordCount": {
                "uh": 215,
                "um": 526
            },
            "readTimeFullTranscript": "83 min read",
            "readTimeSummary": "10 min read",
            "wordCountFullTranscript": {
                "school": 118,
                "schools": 73,
                "teachers": 54,
                "kids": 49,
                "students": 39,
                "millennium": 38,
                "parents": 34,
                "week": 32,
                "day": 32,
                "learning": 26
            },
            "wordCountSummary": {
                "school": 20,
                "week": 12,
                "teachers": 12,
                "kids": 11,
                "schools": 11,
                "parents": 8,
                "days": 7,
                "learning": 7,
                "students": 7,
                "building": 5
            },
            "fullTranscript": "As we heard last week, they are, they have released the construction team to start working again on trinity play school, which is great. The big question was: are they on schedule? I heard back from her today that they think they are so that's great news they're just waiting for they have the contractor they've gotten to go ahead now they have to go to OMB with the up charges that they're going to have to absorb because of the overtime. So that's the last hurrah so as soon as that's approved, they will then have the schedule delivered. So we'll be able to have a look at the schedule, but there is going to be overtime involved as we suspected to be able to make up for the time that they lost since it stopped in March and just started again now, but we'll keep in touch with them, with updates we're happy that they're beginning again and that their only obstacle left is the additional funding they do expect that that'll be approved. So I wanted to share that see if anybody had any other questions on that item just want to say. Thank you very much, amazing news. This is rosa by the way. Yeah, it's great news. I'm really excited trish. Could you also? Is there any way to also ask what's happening with millennium, because I know that construction has been on hold for quite a while too, if there's any way to find it has, and I asked them that they did not know, but that you know I do not think that would fall into the same category, because it's not you know. So I would imagine that's more of a you know: Covid-19 related situation where they have to go through some hoops to be able to work on that, while kids are in the building so, but I will find out- and I will get back to you- I did want to talk to you about one of the parts of the remote instruction discussion tonight was seeing that we have parents at a lot of different schools. I was actually really interested in opening up the discussion of how that's going at everybody's school. I've received tons of mail about different experiences. People are having at different schools, I'm seeing a wide variety of experience like wide variety of what it looks like at different schools. So many schools apply for the variances from the Chancellor's initial plan. In fact, almost all of the schools in lower Manhattan did the millennium was the last one to receive the approval on that. So I'm really interested to hear from the people on our committee. I will then share with you that I've heard from schools in other districts and acrosss the country I spent some time reaching out people. I know in other cities as well just to sort of help get some perspective on how things are going and then, if Katie's here, I guess what we could start by doing is just share some experiences and then maybe direct some questions to her and see if she's able to answer some of them for us if they are doing based, you know answers all right. Well, that's okay! I mean we can start a discussion if everybody wants and just you know, weigh in- and you know everybody just try to look at hands here and you know just share what your experiences have been thus far since the beginning of this whole year, see if we're going to need, you know, resolutions or whatever else, but I thought that would be a good place to start in a few weeks. Anybody nobody well, I could. I could definitely start so I'll. Tell you exactly what happened with nest and then, therefore, what ended up happening because of nest in millennium, okay, so nest. Their strategy was a very interesting strategy which was freaked out all the parents saying if we are going to do hybrid, you are not going to get nest teachers you are going to get other teachers. The chancellor said it so the best way to guarantee getting your teachers is. We do this model of basically a couple of hours once a week for the kids to go, who chose hybrid, to go for social, emotional and for advisory, so parents freaked out and everyone went behind it, based only because we were told we are not going to get our next teachers, which I mean what's their reasoning. They said the chancellor said it in one of the calls- and I said I have not heard that and I've been on plenty of calls, and so that happened at nest and also the other thing was some of the parents who are outside of New York City, who, whether they're on the slt or on the PTA they were like hey. We do not want a hybrid. We want to sit out in the country. Do this remote life is good. So this is what happened the same time. I was involved in a return to school committee with millennium and we're just like at that point. This was back in the summer and everybody was honest. A lot of us wanted the kids to go at least two to three times a week, and there was so much uncertainty. The teachers do not want it. I shared, I said hey. I do not know what happened, but I could just share what nest is doing, so they took nest model, but without giving so the nest. For example, the after the hybrid model, with the kids go to school for those two hours, it starts from 1:50 to 3 50.. So it's even after, like they're a lot of contractual time, the interesting thing about millennium. They took everything with the nest model without the 150 to 350, because they can not keep teachers during that until 3 50.. So then, and it was literally a week before or a few days before, school started- I remember it was like yeah guys we're taking. We got the exception, but if you want to do the after school, you know those two hours you can. I think it starts at like one o'clock or like a time that most kids can't get there anyway, because the millennium kids are all over the city and some of them are in whether in Brooklyn they can not make it at that time. So when and we ask, can you do it at 150 to 350? We were told no, because you know contractually. We can't keep the teachers over there now. What is starting to make parents unhappy is seeing the Brooklyn tech model, which is their two full days from 8:30 to like 2:45 in schools like one week and salt and they're going in there full time, they're nobody's getting different teachers, they're all their own teachers, whether it's in Brooklyn tech or salt and they're, not getting any new teachers and what the teachers what happened ends up happening is they're just having the remote and the hybrid kids are getting the same teachers but very different schedules, but they're getting the same teachers. So when there's a teacher in school and now you are you're in school, getting your lesson as soon as they finish that they go and give the same lesson to the hot to the remote kids. And so now parents are saying why and Brooklyn it's a huge school. It has a huge number of kids. Why could not that not be implemented in other schools? They have this. Everybody has the same problems this space. There is not a school a public school in Manhattan that does not have a space problem. So now the question which is now I'm on all these different groups, it's like parents are asking why it like if the city's so big on like equity. This is definitely not the case. So can you tell me just a little bit of a hard time following the amount of time in the building at nest, millennium and Brooklyn tech, so nest and millennium? It's two hours two hours a week once a week, two hours, okay, Brooklyn tech. It's two full days from two full days a week: okay, and is the two days a week, a hundred percent synchronous learning or are they in the school remoting into classes somewhere else? No, the remoting, the folks that are remoting are not the same time. So what the teachers are doing is they're, giving a class now to the kids in school. The kids in school finish that class. That same teacher will go and do the exact same class afterwards for the remote kids, interesting okay, so that's craziness. It is craziness and what's really cool, I'm not sure. If that's true, I was told that millennium had Brooklyn has the same all that we have at millennium. No, they might have Brooklyn. No, they do not because I'm on a group now with all the all the Brooklyn tech parents and maybe they're talking about millennium Brooklyn, which is different than millennium Manhattan, but I do not say millennium Britain has the same plan that we have is that what you're saying you're not saying I'm talking about Brooklyn tech, not millennium, Brooklyn, yeah? No! But but I'm talking about Brooklyn tech. Not me not millennium, not millennium Brooklyn, but soro also has the same model that we have elro nest, Brooklyn, millennium and millennium. As far as I know, all have the same model that we have well. We at millennium Manhattan got the model from nest with the only Adele row and the only difference is nest has their 150 to 350 the after school program, where net, where millennium could not do that yeah I mean I would not call an after- school program, it's still it's a school program and we the way we work on that is the kids have class until 12:20 and if they can't get there by one the one day a week, they come that one day of the week, they're allowed to miss or all or some of their last period class and leave their house at 10 of noon. So they have an hour and 10 minutes to get to the school. Well, the issue is with the feedback from the parents and some of the kids, some of those classes the last period. It's not like that. As one kid said it it's not like art or theater. This is math and physics, and I'm not going to miss. You know miss that. So again, it's only one day a week, bear in mind that so yeah, but they're missing advisory, which they could be potentially late to advisory. Be there for support after that. But again, I think like what I'm getting there again. Kids were very happy. At least I'll speak from my own personal opinion. The experience kids were very happy to go back to school. They were excited. They were excited to see their teachers they're very happy and again from the Brooklyn tech parents. They said now the kids have a proper schedule. They have now more focus going in two days a week, and that has made a lot of difference for the parents and the kids for having kids from like it's a full. It's a full day. It's giving them a sense of normality in this abnormal times, but Sarah, I'm hearing you say it's two hours when you say full day: no: two hours for nest and millennium Brooklyn tech, it's a full hour, 8:30 to 2, 45., okay and they're in class, with their teacher that whole time not on a computer, vlogging somewhere else yeah. So this is. Can I ask where we are in the if we're I'm kind of concerned about where we are in the agenda? If we're talking about item four okay about the effectiveness of synchronous online instruction- and I feel like this- is outside of the confines of this committee- and I do not see millennium or any schools changing their model one more time. So I'm wondering if this is just for us not really evaluates of our time, because we're not really talking about synchronous online instruction, we're talking about not having enough time in the building. There's two things happening here: Jeff, and it is the number one concern of at least the people that are reaching out to me in terms of youth and ed issues in our community board. Right now. So again, as we talk about you know serving the community, this is like the number one topic and parents are very concerned some so much that they're considering leaving here. So I very much do see this as something in our purview and it's something that you know I thought was really worthy of a discussion seeing that there are inconsistencies, acrosss, the schools and, while I'm just saying it's not on our agenda, our agenda says effectiveness of synchronous online instruction. That's not what we're talking about we're talking about, not liking the schedule the kids are on. So that was just that's an admin problem. The way that it reads on the agenda is what we're discussing right now. We're not the study is something that is also something that was just a discussion item, but this potential resolution was our agenda and this discussion on and we planned it actually in July to come back in October and talk about so now that we're here, what does that look like? And so whether or not it's reading that way on this agenda, which I I'm saying that it's not so we're on item three then, yes, it is more like item three, but it's still not described exactly the way I would but it's okay. I think we all know what it means and Catherine was Kate was willing to come and talk to us. You can hi. How are you good? We were just discussing and we've just heard from Sarah, thus far about the different experiences our families are having acrosss the schools in terms of remote versus blended learning, also, the amount of synchronous learning both of those are topics for discussion and I'm sorry, okay, so so it's a little bit of both, because some parents concerns are more the amount of synchronous learning their children are getting, whether it's remote or in person. Other families are more concerned about the lack of time in the building, and I think most of it was that they're trying to adjust from what they were told by the chancellor in his communication in July about the fact that our children would be going back to alternating three days a week and what especially our high school students are finding is that has turned into as little as two hours a week, literally like a half day, they're going in for two classes. Some schools are staying in the afternoon and working on laptops remoting into other classes, which then keep them in the building. Other schools are releasing their children, so this is very different than what they were expecting, and so they just have questions about why this happened. What they can do about it where they go to, you know, talk about it. You know a lot of them also were concerned about the fact that if they chose blended learning they found out after they got there that they do not have the school teachers that it at beacon, for instance, where my daughter goes. There is more synchronous learning time. If you are learning remotely than there is, if you chose blended and go into the building, that was a surprise too. So it would be good to just you know, share our stories and then ask some questions to catherine that she may or may not be able to answer. Some of these are school- based because you know, as we just heard, we got variances at our schools, which allowed us to not do what the plan the city provided was going to do, but at least we'll start a discussion, because I'm getting massive amounts of questions and emails from parents having a lot of concerns. So with that said, if anybody else would like to share their experience after going back and send questions to she's here I would like to. I would like to share my experience. Thank you. Sorry brought in thank you so basically that the entire system was told come up with a plan for your school, with the parameters going to be accepted and schools did and we did, and then we learned of what we thought was a much more effective plan, which is what we have and that's the plan that we have. It was approved by the chance, but it was approved by this superintendent of our school and it was made with you know, with other schools, doing a similar plan and where educational professionals doing the best we can schools are understaffed. People have to understand that they may want something they just can't have schools have many faculty members, not there. You can't make them come in the city accommodated the terrible time of living in which is simply just being ignored right now, in this conversation and we're living in an intense terrible time with spikes starting to happen all around the country, including the northeast just written about this weekend in the New, York Times and so an abundance of caution, schools have made plans to make everyone safer and that's where we're at it can't. There's literally, it's no way to go back on it, because the uft and the city agreed to provisions where faculty members could file paperwork to be off- site and the average school is well in the 20 percent, if not above 30 percent of faculty, not on site. So you simply do not have the people there. Those of us I'm in I'm in school every day. Those of us that are there, are doing much more work just in the two- hour afternoons moving kids around just to have kids be there, and we have a very small population of kids coming to our building each day. So there's just realities here that are just counter to what families might be calling and complaining about. This is the reality of there's just so many humans in a building that can do the job safely and that's where we're at, and so it's to me very frustrating as a teacher, to hear this because we're working very hard to learn new platforms, new technologies to do things better, we're offering from 8:30 to 12:20 straight synchronous instruction with a one half hour break everyone's, had to learn how to do that, and we did that so that when the schools start closing- which I think is the win, we can pivot directly and lose nothing all of a sudden. We'll go right to you. Just do not come in the afternoons and if that does not happen, that's going to be great. But if that happens, we're all set and the old model that many schools are laboring under right now, they're going to have a hell of a time moving to full online synchronous instruction, which is what we offer all of my classes, are online synchronous instruction every single day and that's what kids at William are experiencing. So that's where I'm at professionally- and I guess a little bit personally bleeding into that- and that's I just want to share that. Okay Dennis, I could probably add on to what Jeff is saying. I mean I'm up in Washington Heights. It's a lot different up there just really quickly. Sixty percent of my staff is currently on medical, accommodations and seventy-. Two percent of my students are remote, which is also meaning that we're still having to go into the building. I'm currently I'm a fifth year teacher, but I'm being treated as a babysitter, because I'm currently just sitting in classrooms right now watching over kids as they zoom in to their classes, while their teachers are teaching them a lesson. So I am right now, basically, in my in my opinion, I'm completely being disrespected as a professional and being just treated as a babysitter, so there's that happening. I think that this entire thing, our mayor and our chancellor, have lied to everyone and have lied to not only the teachers but have lied to the parents. Most importantly, the parents were the ones told that they were going to be given a lot of time of synchronous, learning or in- person learning, and that did not happen and all of a sudden they turned around and they said never mind when it comes to the blended learning you're not going to be getting synchronous, learning you're going to be just given assignments. So I think that a lot of people have been lied to here, and I think a lot of people are obviously frustrated. What I would want, I mean that's just coming from my point of view. I'd want to know is what are the numbers for the different schools in our area, of how many kids are blended and how many kids are remote and I'd really like to know then like have a discussion from there of what is exactly happening, and I know it's probably different between millennium to urban assembly of emergency management. I'm sure it's a lot different from all different schools, but I just really want to know what exactly is happening and what we can do moving forward, because I know that this administration does not want to go fully remote, but at the same time parents who are very concerned about having babies having people that watch their children or to have a schedule or something like that. They already that's already been something. That's been taken back from the chancellor and De Blasio. So I think it would be really good for us to at least maybe hear from the different. I do not know the numbers of the schools but to hear from like what is what are the numbers from Stuyvesant millennium of their teachers and their students that are fully remote to be able to kind of make a more sound decision based on the community, because I can give my opinion, but I think we have to we obviously we're here to advocate for the community. So I I'd want to hear about that. Thanks, Dennis important feedback from my experience. If now is a good time, yeah Judith, I think you're frozen or maybe I'm frozen. I think it's her we'll wait, Judith see if you can move around to a better spot. My point is very quick nope who wants? Who wants to make a quick point was that you Sarah yeah just very quickly. There are two families on my hallway with multiple kids. They started school here and then they went back to their country homes. It did not work for their children, their the group was both groups were in elementary school and they were so it so did not work for their children that they departed. I do not know if they're learning remotely or if they are indeed and they're, both in New Jersey or, if they're, going to school out there. I have no idea, but I see parents, you know like every two weeks. One of them will come say hi and I'll go all right. Are you kids, okay and they'll? Go oh yeah, so much better. I do not want to pry, so I have not asked more anyway. That's my input! Judith! Are you with us? Yes, can you hear me now yeah, it's better okay hold on okay, how's, that good all right, I'm moving away from my other computer okay, so I have three kids at three different high schools and, first off. I think that there's been improvement. I had well one of my kids is at HSMSC and they did like really well in the spring and they're still doing really well, and then I have one child at millennium and one at elro and just want to say thank you to Jeff, because I think millennium is doing really well. I am having the same experience in terms of the amount of in- school learning that's being offered, and I you have to pardon me because with three kids at three different schools, I may get it mixed up a little bit, but it's basically like the one at Hsn goes in one afternoon a week just for like advisory. You know it's what you said. It's like the two hours for advisory and millennium is what is that my two of mine are freshmen, so at millennium, the freshmen go in mondays and fridays, which is great, because I mean I'd really like my kids to meet people. The one that goes to millennium knows a bunch of people, but the one that goes to El room knows one kid. So it's a tough way to start out freshman year and then the one that goes to elrod was kind of a crazy story, because the teachers like kept getting like exceptions or whatever it's called like up to the last minute. So part of the reason why, like my husband and I got really confused- is because every school changed their model so many times like so you got an email in July and then and it's not their fault but like circumstances changed and they had to adapt so like elro at the like at the last minute, like 50 of the teachers, got exemptions to be home so like then, they sent around an email saying it was like the day before school. We're not going to have blended learning, because we have too many teachers that are home and we can't accommodate blended learning. So then you know, of course you know my husband and I like said what will we ask for transparency because- and I think you know that's something that we should talk about- is transparency and if we're going to do a resolution, you know maybe it's what are the rules, because I think you know when I got that email from Elro. I was like really, you can just say we're not doing any blended learning anyway. They worked it out and now my son is going two of every eight days, so he goes two days in a row and it's like 10:30 to 12. But if I'm not mistaken, all three kids are not going for substantive classes, they're going for like advisory or something which I'm happy they're, at least going and they're. Seeing other kids and that's really important and the other thing that I'm happy about is that school is starting at 8:30 or 9 A.M, and it's on structure like that has made all the difference in the world, and I know that you know that sort of continuous structure is like not what some of the elementary skills kids are getting as I'm hearing. So I think that you know is another thing that we need to think about, and then the last thing I would say is that in terms of clubs and psal so like I have a couple of athletes in my family and there's been like very little transparency on what's going on in sports, you know like we got the permits, but the mayor has not allowed it and like the one at Elro is at least having clubs which, again you know, I've got two freshmen, so that is important, so Elro is doing clubs. I do not think the other two schools are doing clubs and you know that would be. That would be great, so you know again, I think, we're all sort of having different experiences. You know things are changing quickly. I think you know. Transparency is probably what we should be looking for, so that you know we can. We can make sure that our schools are sort of living up to what they're required to be doing. We, I do not think we know what they're required to be doing well. I think we just have a different. You know situation in that the schools that I think a lot of referring to that maybe are not in the New York City Public school system that are 100 in the building have a different situation with their teachers, and I know my sister's family. Those teachers are told to go to school. There was no option not to which you know they have a worse situation than we do with Covid-19, and I think that's obviously not where we want to be either. So I think that I think you're right Judith in talking about transparency, which is why I wanted to have katie here, and maybe this is a good time to break and let her speak and after hearing some of these things, katie that you've heard just sort of you know give us an idea of what it's like to be at the DOE right now, and maybe you know, help us understand why we're here and you know to some of the parents concerns about you know one thing and then learning once they got there, it was. It was really quite different. Oh trisha, I'm sorry can I just add one more thing: uh- huh, so the you know. Obviously, as Jeff mentioned, it's certainly possible, or maybe probable that at some point you know, blended learning will get canceled all together and we'll go fully remote like. I think that it would be great if the schools had some plan in place for that to happen. So in other words, if the entire schedule has been created around having two hours of advisory, you know whatever from 1:30 to 3:30 in person. You know to me like I want to make sure that, like if that's canceled like that does not mean now that the day is only half day because in person learning is over, you know, so I think that the schools really need to plan for that eventuality. I think that's probably why, like to Jeff said that it probably is why it's so little is that they were looking down, and my hope is that anyway, katie, would you like to share something on that sure? Can you guys hear me yes I'll? Take that as yes, okay, sorry, my video is not working. It's saying that my bandwidth is too low. I can oh man the controversy. Yes there, you are it's a bit choppy! Okay, so I sorry go ahead. We can hear you okay, so I appreciate getting to your what your experiences have been. It's really important to us, as we continue to make improvements and as we continue to make updates that we're hearing from the field, it's paramount for the work that we do appreciate, having the chance to come and speak to you in these in these forums and we're it's things like this, that we kept hearing from the spring that there needs to be more peace, as me came to figuring things out with the unions over the summer and that included all of the health and safety negotiations that included what the changes and we were making to our school schedule would look like. But then one of the other pieces that we knew had to be part of this was the synchronous instruction by great band and with minutes that are, will continue to increase from September through January February. As we know that, as you know, we get acclimated to what it will be, the normal for the school year. So we started out for our younger students that we have time built in and we got some. We have heard feedback for. You know for our pre- k, students that it's up to 30 minutes a day, but what our pre- k instructional teams have come up with, is you know, building a schedule for students so that they are having this time with their teachers either through zoom or through teams? But then what are they doing during other parts of the day? But then, as we, you know, go for our elementary school students that it's for kindergarten between 65 and 70 minutes. First, oh we're in October now so it's between seven 20 and for second grade between 90 and 100 minutes and then for third through fifth graders 100 to 120 minutes, sixth or eighth grade 90 to 120 minutes and for high school 120 up 230 minutes, and then this will continue to build on each month for our students. Okay, anybody questions for Katie, sorry, just for a little quick backfire millennium. So we knew the guidelines that katie offered and we heard the guidelines that the DOE the DOE was giving for times that Katie just went through and thanks for being here, katie thanks for having me, we thought early on 20 minutes. Just for us at millennium was just not enough time, so we immediately went to half hour, so there are some schools doing with our model doing 20 minutes. So we went to half an hour right away and that's still tight, but we're we can get a lot more done a half hour than 20 minutes. That's not a critique of the DOE or anything Katie just said, but just a point of information about millennium. We could have been at 20 minutes. We went to half an hour, so Katie help us understand. I mean the teachers understand this better and again this is not about. This is not about criticism. This is just about it's a combination of transparency, consistency and information and expectations. I think that oftentimes, when you get the feedback from the parents, that the feedback is devoid of that teacher administrator experience, that's a given okay. So what this is about is really clarification of some things because they are hearing about schools that have a hundred percent synchronous and so their questions are. Why can't new York City deliver more synchronous learning? What is the problem? Would it be better? This is what I heard the other day. Would it be better if we just got rid of blended learning? If it's really the thing, that's creating the problem, we now see that they've improved on synchronous learning since March right, our experience being remote is better than it was there. By far I am getting that, but would not it be? Would we get more if we gave up on going to the building, because we still are hearing that we terms of engagement? Children are sleeping better they're, getting up at the right hour, they're having to sign in and be face to face. All these things are making a huge difference to a lot of these families. Now I mean the fact that they can go to the building also is huge for them, but I think it could be good to at that question whether or not they would be able to have more learning and get a realistic answer of synchronous learning. If that the schools decide to go remote, I think it was a big surprise and it's the last thing I'll say that some of the students who chose blended learning ended up getting less synchronous learning than those who were remote. That is exactly the opposite of what they thought was going to happen. So I'd love to continue on that. So can I just say one quick thing that katie can maybe clarify which is in our community, which is who we represent. I think you might be right that there's a better experience of synchronous learning. I know that we've all gotten better at millennium at it and worked hard at it and we have a student population that is extremely dedicated like when I get to when I go into my waiting room on zoom calls within one minute of my class starting every single kid is in the classroom like I have 100 attendance every day and I count my blessings for that. I'm sure I'm sure that katie knows a lot more about the whole system and I would think that the system has incredible inequities. Acrosss, the city where kids do not have access to reliable, Wi- fi. I have some of my students who do not have the same means, as others definitely do not have the same: Wi-, fi and they're, much more stymied by beatings, even in the world of millennium. So I think the whole system is trying to make choices, and I think that we live in a very privileged community and there are many communities that do not have the access to the internet that we do and computers, and I think that they would be less excited about going to a fully synchronous learning online. I'm just throwing that out there, but katie would probably know more well why you say that Jeff. I just want to point to our resolution. That said, that was one of the points that was made really last June is the DOE themselves said that they were going to make sure that Wi-, fi and issue was handled by public or private partners that apparently everyone was willing to help get these kids. There were even office buildings that had you know, offered to provide space and Wi- fi for kids, who did not have it so the question I get a lot on the heels of that on the heels of that observation Jeff. The question I get a lot is, if we know synchronous learning to be best practices. What is the DOE doing to provide that equity? You know because we can't just we can't play to bet less than best practices pursuing equality, because you can see what's going to happen there. If this lasts a long time and we're saying we can't do it because we can't do it for everybody, then why are not we doing it for everybody? You know when we have the resources to do that. Apple and Microsoft have said on many occasions. They would be willing and they already have given us. You know hundreds of thousands of devices I could jump in, or did I freeze? Okay, in the spring of last year, we we distributed another- I believe 150, 000, plus chromebooks, and we then made an announcement last week that we distributing another 100 000 ipads by the end of the month. But we there are, there are supply chain issues and we and we are getting the lion's share of the supply acrosss the country right now there are our not getting devices and we are getting close to half a million devices, but we are, we are waiting on those. It is almost impossible right now to get a chromebook to order those, but so we have we've. We had intended to shift some devices to schools, have their optional support for that, so families and students that are still in need of devices are able to log on, and I can I'm happy to share the link if you know, families that are in native devices, but that we will still be providing those. As for the connectivity issues, we were very grateful to our partners and internet companies that supported us through the spring leadership land, because we have asked community. We've asked elected officials to lobby on our behalf, because not all of that was not continued by everyone through the fall, and so we know that we do have students and families that are having connectivity issues at this point in the year. That may not have had them in the spring, and that's you know what we are. We are working diligently on all of our ipads that we do have that we are connecting for our students, Lt and Lte, enabled so that they do not have to work off of a Wi- fi, but we're, like, I said, we're still working to distribute those to students, as we've been trying to close that need gap. So I think one of the biggest things that we've come up against working on is that so much of our work prior to this is about compromise and finding a middle ground where it's a bureaucracy and one of the things just to be like we said this is transparent and to be transparent with one another, and I appreciate your feedback, but to give the same courtesy to you, it's been tricky, because what we have found is that there is not always a middle ground with a lot of these issues. It's that people are on one side or the other. I think about our grading policy that people were saying- and this is not the time for grades- that students are coming, that they are showing up. It should be pass fail. Then, on the other side, there are people saying students have continued to work hard. A pass fail does not that that's not going to show all the work that they've done and we tried to find a policy that was in the middle. That was a little bit for our high school students did still provide grades to ensure that they're how they are applying for post- secondary opportunities that there's, that would not become an issue. But if there were students who said hey, you know what I did my best, but this was not where I had been previously. We gave an opportunity for students to have a credit, and that would show up on their report card, and we made no one happy, and I think what we've seen you know with the remote and the blended is something similar that we want to give people an opportunity by people. We want to give our students and families an opportunity to come back to their schools if we were in a place that the that are positive were low enough, that we could do this in a way that was safe, that we could do this in a way that would ensure our staff and our students remain healthy, because we have populations in our that our students are temporary housing that are students with special needs. Who we had concerns about that about regression taking place over the past seven months, and so I come back to you and so to come back to the original question. What if we just all moved to remote or got rid of blended learning, I in a system as large as ours and in a system is decentralized as ours, where we really trust our principles, and I do not think decentralization's a bad thing that we have great, really talented principles. We said you know your school community, you know your students, you know your staff, that you know what would be best for you in a 1600 school district. I do not think a one-, size- fits- all would be best. So we that's where we are right now. I appreciate- and I am the ingenuity and the thoughtfulness that has gone on to the programming. That's happened. I can empathize and I'm sorry as that, the number of times that we've gone back to the drawing board and I apprecia, but I think what we've heard and the feedback you know when we've been in school and seeing students happy to take action, and we appreciate that you know still going with the when we are remote. The changes in the adapting the teachers have done to make that a success as well. Okay to that point, who's talking rosa, of course my son is actually at Ps 150 and we are enrolled in the blended learning where we go for you know, alternating between two and three days a week and he's in second grade, and I have to it's been really great. I guess may be the only one having a positive experience here, but I think that all the parents that I have spoken to from a socially distant point of view said that they are so grateful for you know we do not know any of us how long this period will last, but we are grateful for the opportunity for the kids to go into class and see each other and interact with each other. You know, as they may have some regularity to their schedule, and so it's actually worked out really well for our class, at least that I'm aware of and for the for the other parents in the school that I've spoken with. We do have you know, or at least I know, I have significant concerns about what happens in the school. When, because there's been no communication about the planning of, let's say two bodies within our you know: 200 body school building do get Coronavirus which, to me frankly seems an inevitability. How you know, how does the switch to remote happen or how does the quarantining happen? How nobody's explained that to us- and I do not know if they're literally just sort of like cobbling this together as we as we go along, because it's just so complicated, which you know you know I sort of get that sense. But I think that the parents, I think from a parent point of view, we're going to just go along with whatever you give us, because we do not have any choice frankly, but the more planning that we are able to do around it. The more information you are able to share with us in advance like when school in- person school instruction got delayed. We were not pissed because it happened. I think a lot of us were frankly relieved because it gave the schools more time and the administrators more time to get ready in something that you know is a dangerous situation, but it was the lack of notice and having it just drop on us. So the more planning that we're able to do the more information that you can share would just be so helpful to all of us, especially as we have to find emergency child care options and deal with that. And obviously, if it's a quarantine issue and whatever, then we recognize that there's no there's no advance notice, it is what it is, but for things so that we can just try to plan for the unplannable, then that would be great and then the second thing I just want to say is: I feel, like the teachers are really the heroes here. They've worked so hard and given so much and I and I feel like already they're frankly starting to fray at the edges and I'm you know, I do not know how it's possible or how it works logistically, but they just need more support. I really feel that, and I feel like that. Unfortunately, I do not know if it's just the way it's played out in the media, but it seems like the DOE is sort of like tossing. You know, burden after burden on top of them. With you know, guesses of what's going to happen and not happen, and then them just having to roll with the punches, and I guess I'm looking for the DOE to frankly be more of a supportive agency than a than a top- down agency, because these guys are all in the trenches and you can feel their struggle and their pain. That's it for me, but thank you because we, the parents that I know are all just so relieved and for you know the five hours a day that we're able to get some sanity time we'll take it thanks. Rosa you're welcome. Thank you very much rosa. Are you welcome yeah? So I thank you. I appreciate that and I will definitely I'll pass all this feedback back, but I will definitely pass that because I think you know I and I get it we're here to hear concerns we're here to hear what need what improvements can be made. What can we do better, but I happy story is always nice now and then so a couple things that to respond to so I'm trying to my poor, my poor little computer is a little bit sore, so we do have on the school website with action about health and safety. I can when the next person's talking. I can drop that in the chat, so we actually do have a pretty robust problem program. Sorry, not problem. We have a pretty robust program for what to do and how school building closures will take place, that we had that had been part of the negotiations and part of what we worked on really closely with our union partners over the summer. So first off, if we, if the city- wide averages, go above three percent, then that's when a system closure would take place so, as opposed to the spring, when there was all I mean closing that there there's a planet place now. I think well with at this point what happened last week, where you know what we were seeing was what happens when there are areas where we're seeing that are that are hot spots, and so that's we've worked with the state, and so we have that a system now where it's, the color- coded Red, Orange, Yellow and based on the color and then it's kind of like a bull's- eye in the map. So the idea being that you would be in a yellow zone before you would be in a red and orange zone and Red and Orange would be when your zone or sorry your school would close. Does that make sense for larger scale closures? Actually that I think maybe I was not cooler enough in terms of sure I guess I was asking. Are you talking about school any school so, but let's use our school as an example. So if ps150 suddenly has two cases of confirmed, coronavirus and school immediately shuts down right and we go to fully remote right now. You know we're in blender so cohort a cohort b and Cohort d chord, D, being the fully remote option and a and b being the two versions of the remote or sorry the blended. And so then, how does that work in terms of schedule? Who's teaching? Does it all then transfer to cohort or you know, or what? If one of the teachers gets sick, because you know like the art teachers teaching the entire school? Not just you know our are going remote, so she's got exposure to everybody or you know like all of this stuff. I guess the details of like who's going to teach in what situation, and so that the parents figure out, because the coordination aspect is like mind-, blowingly, difficult and- and you know it's just- it is so comp as you're talking about it's funny because that's laughing in the background, because it is so complicated and so specific, I guess, as a parent, it would be nice to have some discussion and upfront sort of warning of okay. This is what's going to happen in situation. A this is what's going to happen in situation b, so that you can sort of prepare again for that and sort of smooth the transition for your kids, so for also this trisha. You should be sure that I'm not stepping on toes here, so let me know, but I feel like that question with all due respect for us and obviously I really appreciate the compliment you gave. Teachers is a little bit out of the preview of what we're trying to discuss. We have a pretty huge agenda, but I can say what I know that no school there's definitely not a system- wide plan for what would happen if half a staff got covered. I do not think there's a real plan for that. Schools have been given a lot of freedom as Katie was talking about which we definitely appreciate, and you know it's a big fear. Everyone always has. I have it literally on a personal level, each day being like I've been healthy and I've been tested multiple times and I'm good but like if I did get really sick. I do not I'm like many teachers. I have not planned out. I do not. I have lesson plans for my curriculum for years, going back today, every year, update fix and get better, but I have not turned off into 30 minute lessons with 20 minute homeworks, which is the new model we have this year. Previously millennium model was 50, minute classes and maybe 30 minutes of homework, so we're trying to cut 80 minutes of learning experience down to about 50, and that means every day I make I adjust a powerpoint that I use and put into something called a mirror pod and fix that thing up, and that's not done for like much past this week. So if I got sick all of a sudden there's going to be issues, so I guess the short answer is no one really knows this is an unknown that I do not think we can really answer right now. I just want to say that from my point- I'm sorry if that's I do not need to be rude at all. I'm just saying I feel like that's, not something we can totally answer or really have much of a discussion about fruitfully right now. That's just my opinion. Throwing it out there, I think I think that you're absolutely right to bring that up Jeff, and I think it is part of the discussion, it's a very legitimate part of it, and I I'm so happy for you Rosa that you're having that experience, I think you know 150 is a one class for grade School and you know that's one of the things that I wanted to bring up is that you know why I wanted to have this discussion today is that people are having a lot of different experiences. It's important to talk about the good, the bad and the ugly. I think it's really. We should all be just open again, not criticism, but we just want to have these important discussions and Jeff shows us how tenuous the situation is and how much the teachers have put on the line, how much faith they've just thrown into this situation, as has the DOE so everyone's doing their best, and we hear that I think the parents concern you know they just want some understanding about it and again. I think it was to do this point about transparency. They want to know that core standards are going to be met. Focus has not been on that in a long time and we've been in the state of just survival since March, but now we're talking about six months, eight months, a half a year as a junior in high school are we you know, is that also on the school level to make sure core standards are met, especially at the tough schools where they're not they do not have great attendance. They do not have that connectivity, you know. Are we graduating kids? Are there going to be? You know what is the DOE doing to make sure these things are happening and that also I'd love to hear at that same time, if you would katie Dennis's point about how teachers are not teaching and they're sitting in those cohorts, I'd love to have an answer to that too. I meant to ask earlier sure. Yes, so I'll start with, I just want to finish up. We lost you there. You are katie you're muted. Can you help me I'm both dialed into my phone? So I can hear you on my computer. I mean so, I can hear you on my phone, but I'm really choppy. The audio is really choppy through my computer, so I'm going back and forth, but then, when I talk was talking, I could hear her the echo of my own voice and that would haunt my prunes tonight so just to go back to the original question about just closing specific schools really quickly. So what that policy is when there's one the classroom remains closed for 14 days, and students and staff with close contact with the positive case will also self quarantine for 14 days then same thing: if there are two cases linked within the classroom, but then if there are two at least two cases linked together in a school but in different classrooms, each of the classrooms will be closed and then additional students and staff would be quarantined. But if there are two cases not linked an exposure confirmed for each side, we close the school and then we would open the school investigation. So this we would not be closing the school for two weeks. We would close the school while we work with test and trace where we work with the Department of Health and then after the investigation we reopen the school and then the classrooms remain closed for 14 days we have a what's called the situation, and so principals are able to. It is open Monday through Fridays, 5:30, A.M to 10 P.M and then on sundays, from eight am eight and so of a positive case in their school are able to call it in and then we work with the department work with test and trace. We have access to those databases in order to see if there are cases of it and close based on that. So there's could you repeat the times again you caught up you're already caught up there, a bit sure the stitch room is Monday through Fridays, 5:30, A.M to 10, P.M and then sundays. I believe I have to double check, but I believe it's 8 A.M to 8:30 P.M, but I would need to double check it, but it's just it's just principals who call into the situation. I think something, and then I also dropped the link in the chat that shares additional information about school closures, testing and tracing Et cetera. Could you click that link again? I do not see on the chat for some reason. Oh I'm sorry. I sent it to all attendees at 705.. I can try again. Do you see it? I do not see links if you whenever you can, you could just send it to me, and I can just have that on Hand Jennifer. I do not see anything in the chat. Am I not in is the right thing? Am I supposed to be anything show up or should it be sent to all panelists? Oh all, panelists there we go. If you send it to everyone, katie everyone will be able to see all panelists as well as sure I sent it to all attorneys. Should I just send it to all panelists, because if you see it, you can just add it. I do not see it yet either. Oh so I think the other question about teachers who are supporting while other well students are participating on in online instruction was that Jenna said he was in the building sitting in the room and being used as a proctor instead of teaching. Can you explain why that would be happening like in instead of having a proctor and dennis teaching? And I and I have that's just not a case for my school- I have heard from various other chapter leaders acrosss the city that that's going on. So it's just not a it's, not a one- off. It's broadly happening. I mean I mean Dennis, I think, is being really his situation sounds a lot worse than what we at millennium have to do, but at millennium I have to sit in for an advisory that I'm not the advisor for because that advisor is remote. So in effect I am with them, but I'm not with them all day as Dennis is it's for a couple of hours? So that's just because there's so many c teachers, not in schools, so my daughter, for example, goes to lab. So she goes into lab twice a week because she wants to get out of the house and go to lab. She goes to lab and sits in a room with a teacher. That's not her teacher on a computer that is her teacher. She could do exactly what she's doing in lab at our house, but because we're so far comfortable with her leaving we're letting her go out a couple days a week to go to school for roughly a half of the day, but that's happening in many schools where you do not necessarily have your teacher in your classroom. Obviously I do not love that as a teacher as a parent, but if their staff is so depleted, then that's all they can do. That's part of the problem for a higher teacher I mean higher proctors, I mean if they are teaching the argument could be. Is it possible to hire proctors for that so that we can use our teachers, especially if we need the teachers, because I'm hearing that we have a shortage of teachers so that I'm just trying to resolve that? So I think you hit the nail on the head: it's a it's a multi- faceted issue, we're also in the middle, besides being in a health crisis where we're also in a fiscal crisis. So I think it depends on how schools are utilizing their budgets at this time, so some schools are hiring substitutes. To do to do that. Work. Part of the issue is that we can't the way the contracts work you we can't have a para sit and sit in the room, so a para could not cover that, but we were able to. We have renegotiated in a memorandum of agreement that just came out with the uft. We have created a new position for paraprofessionals. That's almost like a career pathway that they that there's going to be additional pay and they're with additional responsibilities that if sophapara had this position that's been created, they could oversee the classroom in the classroom management of it. While there was a teacher doing remote instruction, but right now with the in a current carer role, I could not, you know, oversee a U.S history class, while the U.S history teacher is teaching remotely, and so I think it's once you come back to the schools have autonomy in this, and it may be how they are programming but Dennis. I'd love to follow up with you offline, I'm happy to connect over email and discuss this more because we definitely want to make sure that our really utilized and getting a chance to do their fact. So I'm happy to follow up about that. That'd be great! Thank you so much my pleasure, but it's I for principles. It has what they have done has been to get your school's program during this time with the moving pieces of principles having not principals, I'm sorry, teachers being able to request accommodations in the pool of teachers who are able to opt into accommodations being more than initially anticipated right trish. I have a question the core standards. What is the DOE doing? Yes, to ensure the course standards are still being met in a time like this. What so and what we been doing, though I thank you so much for all the work that's going into it. I hear you talking about like changing your just when you got to the career when you're like I have all my powerpoints. I have all my lessons and taking the time and the thoughtfulness and grace to do this, I it's greatly appreciated. We have been for our teachers, sorry say it again. Sorry I thought you had said something Tricia. I thought you had said something. No. I was just I was telling you. I could not hear you, oh I'm, sorry. So for our core standards prior to Covid-19, we had been working with our unioners to come out with our new core curriculum initiative and we're still we're still plugging away at that we've come out with our core standards. Students should be at different parts of the year and we've also creating what we're calling model mob Google classrooms. So one of the pieces of feedback that we got that we received last year from our staff was when we had been putting up pdfs of lessons that they said these are good. But how do I? How do I use them? We're not because we're so used to paper and pencil and what, if you know, we do not want students just printing things out, so we put them into Google, slides, which our teachers have said are better for putting them putting into your Google classroom. And so all of these are all these awesome. Standards aligned, follow core curriculum and we've been trying to put out other additional resources for that for staff so that they can focus on the how they're teaching and we hopefully can provide resources and supports that- are the what you're teaching okay great and is there a mechanism in place to make sure the kids are meeting them? I know that a lot of parents were saying Clinton Andrew told me is having monthly check- ins with parents. I thought that would be a great idea if they're able to do such a thing just to make sure the kids are meeting those standards. You know, regardless of the grading policy, that the schools have yep. So we one of the one of the pieces that came one of the pieces that we negotiated over the summer was a regular parent engagement time of the schedule every day. So every schedule should have a half a family engagement and there's really a ton of flexibility with how teachers can use it. We we're meeting with some recently that we heard I you know I mean some were using it for troubleshooting for tech issues to how do we get up and running, but we heard some teachers say that you can't speak over this hump, and this has become our normal, that I can utilize either for a student or I can use it, for you know: progress, check- ins for parents that it's really flexible to for how staff can use it and we're glad that they have that time. Okay, who else has hands up here? Lisa there's two members of the public who wish to speak. Firstly, Hernandez, followed by lauren, okay, great hello, thank you for all your guys's time and energy. It's really appreciated first and foremost, and I do want to there's a few things one. I would like to piggyback on some of the progress that my son has made being in a smaller classroom. Just he is a child on the autism spectrum, but we are in our local public school in an ict classroom. So having nine kids in his class, I think has helped him a lot. Socializing is one of those things that is very difficult for him to socialize with his peers. This predicament, should, you say, is actually working in his favor being that he only has to interact with the two adults in his 100 para and that actually has benefited him in some way. However, even with the winds I'm taking them as they come believe me, these are strong wins for us in our family, but I am a bit concerned because he is on a blended in person, so he goes on tuesdays and thursdays. On the days he's home. We get zero live instruction, I'm not sure how it's kind of come to the conclusion that each school and each principal has kind of had to make shift what it is and how their teachers are doing. The remote side of blended learning- and I commend everyone in this process, because it is not an easy task by any means- and I do completely understand that, but is I just do not see you know children? I think children with special needs were kind of left very last minute when this planning began and to expect a second grader on the autism spectrum to kind of work independently. Throughout the day with, I think his teachers and one teacher, mind you it's an ict class, so iep regulates that he should be having a special education and a general education teacher with him in those teaching times. Yet we just get a check- in for about 5- 10 minutes before the in- person school started starts while he is at home because his same teachers are teaching in person and they are also they split. The class up and one teacher is taking a group of kids for a check- in literally five minutes hello good morning how this take a look at your Google classroom. These are the assignments, do what you can and I'll check in with you again for 5- 10 minutes during this teacher's lunch period, which is also quite sad. If you ask me- and his para is not even available to him at all throughout the day, during these remote learning times, she's only available for five ten minutes for check- in because the school is utilizing her at whatever capacity they need. Her we've had scheduled meetings with her and she's had to reschedule because she says she has to do P.E with a class. I just do not think this is fair. At least I mean- and I can speak for my son as advocate it's not fair to him, but I mean it's just not fair for these teachers as well. I I'm also very concerned that the protocol for testing, because even in two weeks my sons Pera was not in school on Thursday and I just thought maybe she was doing a training, because they've done that last year they had a sub for him, which was great, but she was not in school at all on Friday and so today, when she was not in school. I was a bit concerned and I was finally at I told you know, I was told that they were awaiting test results and I do not think our school has not decided to do. They have not started the random testing at our school, so this is obviously an isolated incident, and when I asked the principal it was not, it did not seem like they were too concerned, which I just do not think that why I do not know why they were not concerned. But it's been a week since he's been with her, and I just do not know what is the protocol for a family to quarantine with somebody? That's been in contact with somebody else. That's possibly been in contact with a possible Covid-19 case and how this is going to be handled. Sure. Sorry, I took myself a video, be a chat. There was a hopeful comment from someone that said, I was breaking up a good bit and it may be easier to hear if I was not on video. Is this? Is this better yeah? Definitely! Oh! Yes, I'm sorry about that guys! My apologies! So it's Miss Hernandez, correct! Yes, okay, hi, Mr, Hernandez! So a couple of things. So I thank you so much for sharing and I am so happy that there are wins that you can celebrate. In my past life I was a teacher and I taught in a special education, ict class, and I had students who are on the spectrum, and I think one thing that we think about- and we we've discussed at Central- is that yes, many of us have been teachers, but none of us have taught through this, and I I appreciate you for that. You and your family are sticking through this with us and that you are. You know thank you for sharing your experience, because that's going to help us so I, and so that, hopefully we can continue to help you and your family. So I do want to assure you that I know it has been tricky, but I can assure you that our students with ieps have been at the forefront of all this when our planning first started. One of the first meetings that we had related to moving to remote instruction was the creation of remote learning plans for our students to ensure that students were going to continue to re, receive research services and that remote evaluations would continue to take place for our students and for our families. When they were there. Sorry, when we had moved to remote learning, we also wanted to make sure you know over the summer that we were able to start to provide services in person, because we know that especially, and especially for our students on the autism spectrum, how important continuity and routine is for them, and I'm. I am sorry that it has been frustrating at times, but I we are we're really trying. I promise you that you are at the forefront of our thoughts and that we are and in our planning, because we this needs to be for everyone, if it's, if we're going to make this work, and so for your, I would love to I'm happy to speak with Jennifer with Trisha for us to connect offline about this. Just because I do not want to. I want to be aware of privacy concerns. I really want to make sure that we can follow up about this instance, specifically what you shared about the program, because I it's part of your child's iep and I want to make sure that they are getting the services that they are, that they are by law entitled to and that we can also follow up so that we can support the school one of the pieces of planning. That partners just for transparency was that no, how do we make an ict class work in this experience that none of us have ever done before? And so you know- and I think sometimes it takes a little bit additional support and we'd be happy to offer that to make sure that we're all clear on what the expectations are. Yeah that'd be great. I would really appreciate that would be my pleasure, so we can. I can make sure that we share information Offline so that we can follow up about that. Thank you. Thank you. My pleasure see anyone else. We had someone else Jen did we not. I had a question well one more about Sarah. Can I give the second person from the public effect? That's okay, I'm lauren from Ps234, so I'll think I'll sync up with what loop I said so Sarah. If you have a question for Lupe, it's probably better. If you go ahead and ask her now, okay, but thank you lauren, do you have anything you want to add? I know lupe are also doing dual duty with the Cec D2 meeting. This happening right now. So thank you guys and I appreciate Luffy who's being who's. Such an awesome parent advocate at Ps234 really thankful for her. I will say that our blended, our blended approach, has gone. I think fairly smoothly. Some classes are getting about an hour and a half of live instruction on remote days, but, as you can hear, not all of them are for our school's been able to hire, who, I believe, full- time subs, to work around the hiring space in order to have remote coverage for our grades. But a couple of our grades have the same grade teachers having to cover both remote and lives. So those teachers are having to you know, leave their live classroom for an increment of time to make sure that the remote learners are getting some kind of live instruction. So that's I'm thankful that they agreed to do that. I know that they are not contractually obligated to do that, but it's challenging they're literally having to run on the wall. To do that. So I really think I'd agree, they're really pushing over backwards to make do with what is available and with what they can. I will agree with Lupe that having a small class size with the drop- off that we saw in our enrollment has been, you know a mixed blessing for those of us who are there, because we are having only eight kids in our kids cohort. So we are getting a lot of attention when our kids are their lives, and I think that the remote learning folks have had a positive experience so far as well. So we'll just appreciate stay in touch with you guys and let you know how it continues to go thanks. Lauren. Thank you. I see hands up that were up before. If someone wants to speak again, is it Sarah? Did you want to say something else? All right? Is it just still up? I might I'll call on you and you guys can let me know Sarah E. I thank thanks. Trish Katie. Thank you so much for being here, but I'm just curious because during all of this process as parents, we were not clear what were the DOE decisions versus principles, decisions and it became very confusing and it's still very confusing, and I think what ended up happening is some of the things parents were not happy with. They think it's the school or the teachers. It has nothing to do with the school of the teachers and it was due. So the question I have is: how are like grading? It seems it's a due decision, not a per school decision, but then the agendas and like the remote learning hybrid, those were left to the school. So I'm just curious how those decisions are made. What is ca? What does the DOE, you know, make the decisions on and versus the school and the other questions I have? Is there a proactive plan, not a reactive, proactive saying you know as a parent if from the beginning, hey, if it's, if the, if the cases are above one percent everybody's going to go remote and if it goes below one percent, it's going to be hybrid everybody's equal if it goes, if there's just a plan and by the spring, if there's you know a vaccine, you'll go back to school, just some sort of a plan because it seems from March, we've been just playing catch up and there has not been any type of planning. It does not have to be perfect, but just some sort of a skeleton plan that we can just like have as parents sure. So let me start with the plan for closing schools, because that's a little bit easier. So we have two so the original plan for from. If you had asked me this two weeks ago, I would have said if the city- wide positive average for a week, so not just one day but over the course of the week. If the city- wide positive average was three percent over three percent, there would be a system- wide closure, but then what we saw was that was not you know it did not. As of last week. That was not making sense because city- wide, we were still a little bit above one percent, but we did have these other pockets that were significantly above there, so that was when we've been working with the state so that we have the policy that came out last week about the Red, Orange and yellow areas, and so based on that, if your school is in a red or an orange vicinity- and it looks almost like a bull's- eye, if your school's in a red or orange location, that those schools will be closed for two weeks and then it will be reassessed to see where the positive rate is after that and if they're in a yellow, then they would be at risk of closing. So you would, you would know if you were in a yellow rate, if it was possible, if you're, if your school would close sorry. But what about? If kids live in a red zone, but they go to a school in a green zone, how does that work? Great, do not have any green zones, but it is. It is only if so, if you live in a red zone, but your school is your if you live in graves end, but you are commuting to a school, that's in Manhattan you would still be able to go to school, but that's you know and that's why we're having the random testing that's going to be taking place? That's why we're taking temperatures? That's why there is an attestation at the start of each day about symptoms. To that. There's, multiple checks on this right now. Does that answer your question? The second part of your question- yeah? Yes, and no. I I'm talking about as six click. I know it's like this is always changing, but again like just a plan. We've had now we've been in this since March and it just seems to be some plans are left per school. Some plans are left to the dui, but they're so a whole full. You know plan that I could say bye. You know again, plans can't change, but at least have a long- term plan it could change. I do not need it like an exact, but at least hey. This is what we are thinking. So what do you mean by school? I'm sorry. I mean I mean there's some decisions that again, okay, so to go back to the first question. So what decisions? Sorry so as far as what's left up to schools so like we were talking about earlier, it's tricky because the DOE is a decentralized school district. I think, as one of the largest school districts and Nope has the largest school district in the country. You know it makes sense. We can't do everything all the same way, but for instance, but that's why what we try to do is make policy that is applicable. But then there are specifics that schools get to pick. So, for instance, we said that schools had programs, so every school needed to pick up a program that was blended or that offered that option to families, but they could choose based on the number of students that were opting in what that would look like, so that could either be and every other day or every couple of days or for our district 75 schools it could be by week so that there were options that schools could choose. There were menu of options that schools could choose from what Central had laid out. I heard you mentioned grading, so our grading policy has not come out yet, but it'll be for final grades. But then again, schools are able to choose their grading scale, so schools would have you know if you're in a high school, that it can be a one through five, an a b c d over a hundred that there are options within our policies. For that does that make sense? Does that answer the question somewhat? It does. Okay. Is there anything else that I can clarify? I do not know if it's too early or not, because the other thing that has been coming up, how private schools and charter schools are doing psat, where the public schools, it seems, are not having them. So I do not know if this would be for this conversation, but if we can get clarity later on, that would be. That would be good. I definitely think that is part of this conversation. Sarah, I'm glad you brought it up. There was this elephant in the room that was happening in October, and I would love to hear Katie's response to that sure so hold on one second, so the psat we are not centrally funding, so the psat were not centrally funding it this school year and the the spring Svt School day for the spring has not yet we have not canceled that yet, but we we won't be doing this in the fall. Just because of a myriad of reasons, the social distancing, the school students are coming into school. We won't be doing it for the fall now. Can you clarify what you mean districtly funded if a school is rich enough to fund it itself, are you saying they can do it? We? I can double check that one for you, but we are not. So is it a funding issue or because that's I do not underst I'm. I do not understand what that means. So, historically we have. We have funded the Sat School day and the psat for our 10th graders and we are we're not doing that for the fall. So, but if a school can self- fund, if one school says the p, the PTA now is going to self- fund, the psat or the or the sat. Are you saying those schools can hold it? I want to go back and double check. We could share that information. Thank you. No problem. Andrew. Can you your hands up on the chat? Can you talk? Do you want to talk? You can send me a text or a chat. If you want, I might have hit the wrong button. My hands does not need to be up. That's okay. I asked most of your questions. I think, but if I have not just you know, shoot them to me anybody else. Looking here, Sarah c your hand is still up. Did you have something else you want to ask Nope? Okay, great anybody else have anything else for katie, nothing from Katie, sorry, Katie! Thank you so much. I really appreciate you joining us. It was incredibly helpful. It's my pleasure, thank you so much for having me. I really do appreciate the feedback and please know I'm going to be my boss, the chief academic officer into our first deputy chancellor, who oversees all our exec superintendents and superintendents issues that are more school- based, and I know there is a a teacher I'm following up with offline and a a parent, so trisha, maybe if you or Jennifer, can help me coordinate with that would be my pleasure just shared our emails and we will connect with you with about them as well, and thank you for being open to hearing from us super helpful. It's my pleasure to join, and I can I can bring a couple more friends with me next time. Wonderful! Thank you! So much again, I really appreciate it. Thank you and thank you to the teachers and the that are on the call and the parents, and thank you for all that you are all doing because it's this is. This. Is a group effort that we're all we're all figuring out and we're you know, met together and we're doing what's at the end of the day like at the end of the day, it's for students and that's why we're doing this? That's what drives us- and I appreciate- and I truly appreciate your partnership in this work and I'm sorry. My video did not work, but I am next time I will. I will head out the office where I have better internet at home did just fine. Thank you. So much again, my pleasure, thank you. So much everybody have a great night. Please be well take care bye. So I do not. You know I'm not seeing that a resolution of any sort is needed at this stage, but I'm happy to hear from any committee members that so do they disagree and if so, just you know, put something in the chat box or throw your hands up, but but I think what we have here more than anything is you know we asked a lot of questions. We got a lot of answers, but I'm thinking that what makes the most sense is to keep in touch with katie as we go. If there are major concerns about what's happening at school, please freak out and we'll maybe put this on. I think we will put this on the agenda again Jen for next month, just to see how things are going. I know there were some chat concerns and other email concerns. I just received about parent engagement, core standards, some schools falling behind because of the lack of equity acrosss, the schools so we'll keep it I'm just. I do not think it's worthy of a resolution just yet but, as I said, feel free as I move on to the next item. To throw your hand up, if you have any comments on that, we have a couple of changes on the agenda because I did not actually make Senator Cavanaugh's town Hall. I was hoping to get there, but I did not if somebody else was able to make it on the committee and would like to share on that love to hear from you. Did anybody go? No, all right, I'm going to see if I can get a download on that and we can put that one on the agenda as well for next month. In case there was something important that we missed we'd hope to get someone here from the FDA with a DOE review. It was an fca review of ventilation requirements. We had started with the department of buildings, they've been able to help us at all Jen. We do not have anybody from EPA here. Do we do not? It was Michael from SCA, yes, Summon of ice Bob as well, because that was something that was formally an agenda item for the Environmental Protection Committee. But it was you know they. The chairs thought it was better to move that item to you know for this committee and that made sense, but Joshua adams from DOB responded and got back to me and then just told me that it's more of a DOE topic. Yes, I talked to Mike Marisol, it's actually their topic and they did not. They did not have anything specific that they could share. So I'm going to ask for more clarification on that because they talked about it would be in a very general way. I know people are interested in your specifics absolutely here from the name of John Shaya. I just need the surprise right now. He'd be able to speak for the second agenda. Item say that again: where is he from yes hello good evening and thank you for letting me attend tonight, I'm here to speak on ventilation. I heard from SCA that you needed somebody from the d.o.e to discuss it. So thank you for coming. We did not accept anyone and I really appreciate you logging on with short notice. Thank you. No problem, we'd love to just hear about one of the questions we've added to them was: what are the requirements? What percentage of buildings he's still working on to bring them to on the accessible success? You know acceptable levels. You know what is our situation right now sure. So let me give you some backgrounds and then, if we have more specific questions, I'm happy to answer those I'll start by saying that ventilation was something that we were always very concerned about at school facilities. So this is not something new. We've been working on indoor equality and HVAC for many years. Of course, now in a covent environment, the ventilation and Hpc has taken a number of steps up in the importance. So we put a renewed focus on that back in the spring, when the CDC and the EPA came out with additional guidance for what we needed to do, what we needed to inspect and what we needed to do inflation. We did a pretty comprehensive survey with all of our custodian engineers about things that they felt needed to be repaired and we started doing that work in early June. In response to the overwhelming amount of work that we were faced with, as well as making sure that we did everything we could to to get into the details of that, the school construction Authority contracted with professional engineers to put another set of eyes on all this and went through and inspected every single one of our buildings in every single one of the occupied spaces and did an analysis of what ventilation was working and what was not and gave us that data over the it was towards the end of the summer back in August, and that gave us the opportunity to do more work for us work with the SCA on bigger projects and and provide some data that we're continuing to update and make public as we get it on the status of the repairs working with the Department of Health. They were very much involved, as I will also mention. The uft was very much involved with how we set this up and the inspections and the work that we did. We've been sharing with them with regularity, but the Department of Health describes it as ventilation is very important. But it's like your car and there are many levels of many different things that you need to do in order to make sure that you're safe, you have airbags, you have seat belts, you have anti- lock brakes and you take defensive driving forces. All those things are important to make sure that you're safe, it's the same thing buildings, so wearing a mask, is shown to be the most important thing that you can do closely followed by social distancing and ventilation is on that list. But again it's just one of the things that we need to make sure is working. So talk about the buildings themselves. We've got the average age of our buildings is 68 years, which means that we have a lot of old buildings. More than half of those buildings were actually designed and formed by the 1918 flu pandemic. That's why you see in a lot of these older buildings, where you have very large and many windows in classrooms. That's because that was the primary ventilation back then, and that is still the way those buildings operate and having open windows and fresh air coming directly into the classrooms. Is the best means of ventilator that you're going to have even in a Covid-19 environment as time went on and we had the buildings designed with central HVAC systems? That's a different set of requirements that we need for those you've probably heard things in the news about Merv ratings on filters and 13s, as opposed to mervates, and those are things that we're looking to replace in our buildings, upgrading the filtration level to filters that can filter out particles as small as covalent viruses. But in the meantime, one of the things that we're doing is making sure that the systems we have are operating at what we call 100 percent outside there, which means that you're providing 100 fresh air into the spaces and exhausting 100 fresh air into the spaces. So the filtration really is not important because we're not recirculating the air through the filters. We can do that now and as the winter goes on, and it gets a little colder we're going to have to reevaluate that. But it's something that we're working on. We've ordered over 100 000 merv filters, acrosss the city for the need for those, and they are starting to come in and we're pretty comfortable. We have a plan in place to deal with that different set of buildings. We continue to have mitigating measures on things where we have concerns the ufc brings us the concern or if a principal or a parent brings us a concern. We've also ordered 30 000 hepatitis for our classrooms to provide an additional level of prediction. We might not have all the ventilation we want, but we can provide air filters that can filter the air, that's being circulated in the classroom and feel safe there again working with the health department everybody's on board with that plan as well. So that's big picture on HVAC and ventilation. If anybody has any specific questions, I'm happy to talk. Nobody, quick question. Sorry, this is Rosa. I was wondering so I I'm in a school or my son's in a school where we are absolutely relying on the windows for ventilation. What happens in the winter time right great question and I'll go back to what I said about the buildings being designed in the in the wake of the 1918 flute. You probably realize and hear from your children that the biggest complaint over the years has been the classrooms are too hot, and that's because those buildings were designed with very large radiators to offset the fact that the windows were designed to be open in the winter. They do not have to be fully open, but a couple of inches on the bottom and a couple of inches on the top is enough to provide the airflow and the fresh air that we need to do that and those heaters are designed to offset the cold air coming in. So we feel pretty comfortable. We should be okay. Thank you very much hi. This is wendy. How does it determine who are the where the thirty thousand hepa filters? How do they get distributed? Another great question, so every building got at least two. We put one in the nurse's office, one in the isolation rooms, because those spaces had to have their ventilation blocked off from the rest of the building. Everybody was safe, but who would possibly have cove that was in those spaces. The rest of them are working with the schools themselves and if we, if we lose ventilation into space- and we can't fix it right away, it's a candidate for getting a an air filter to to provide a mitigating measure. While we make the repair, if it's a system problem where, as we get further in along in the winter- and we find central systems that we can't provide 100 outside air, we might throttle back on that outside air and put in an air filter in that classroom as well, no hard and fast rules, but we're doing it a lot by exception. If people have concerns or questions, we're going to look at that and using an air filter as a mitigating measure can help out. In those circumstances. The other thing that I want to point out and we've done a lot of walkthrough uft over the past couple of weeks- is we've. Provided every custodian with an indoor air quality monitor and the health department has confirmed that in a co2 level in any room is an indicator of adequate articulation. So we take readings outside of. If there's a question in a space, a classroom teacher says my classroom feels puffy. I do not think I'm getting enough airflow. We take a reading outside the building and we take a reading inside the classroom with people in it, and we compare the two to see what the co2 readings are and if it's within an acceptable range, we can confirm that the ventilation is working. As designed. Sorry, I had another question school, which is located directly acrosss from 250 water, where they are doing some remediation work and eventually we'll do some construction work. I'm sure they probably are relying very heavily on their windows for ventilation. Since the school build buildings were not originally, their systems were not originally take the merv 13 filters in situations where buildings are not able to open their windows because of either noise construction pollution. Whatever. How do we make sure that the buildings are safe? So if it's did you see it was the peck slip school that you mentioned. You were breaking up there. I did not hear which school specifically flip school yeah, so that's a relatively new building and that has a central HVAC system. I do not know if the window's open or not, but I'm going to guess- maybe not, but in any case, if there's a central system and it's working and we're providing either 100 outside air or we've put in merv 13 filters on the return side that makes that ventilation system acceptable if it's in a different building and we've had this conversation with the SCA in a number of buildings where they're doing construction outside they've changed their schedule. They've done some cleaning on the scaffolding and moved equipment to another side of the building, so that they're not getting as much. They do not work during the day anyway, but we've asked their contractors to do more cleaning so that any dust that's generated as they work overnight, does not get sucked into the classroom in the morning and again. That would be a prime case for a potential air filter solution where, if we could not abso, if there's no way that we could open the windows and we were not getting sufficient ventilation for whatever reason we can put air purifiers in there and that would probably also be acceptable. Okay, thank you. Anyone else. Thank you. So much for coming great thanks for having me anybody has any follow- ups. I believe people have my email, you can reach out and I'll be more than happy to get answers. Okay, great! Thank you. Thank you very much, and actually I have one more random question: do you interact at all with these with any of the cities? You know the after school. You know this when the students are not in class, if they, if they have essential workers or going to or is that a separate team? That's going to those buildings like if essential workers have. I forget they call them. Can you remind me the daycare centers, but they're, not daycare, centers they're, you know, I know what you're I know. What you're thinking are you referring to the wrecks, the regional enrichment centers? They have not done no flame, but it's basically, if you're an essential worker or if you know, if you're, if the city will provide city bridge. Thank you, Learning Bridges, yes, Learning Bridges! I got you. Yes, are you helping them? Is it the same standard? Do you would you know? So if I, if I understand it correctly- and I do not do Learning Bridges, specifically that's Mr Wallach, but I believe that they are not always in DOE buildings and in either case, whether it's a leased facility or a CBO facility. We have a number of facilities, especially d75 and d79, that have programs in regular buildings acrosss the city that have nothing to do with the DOE we have communicated through either the programs or through the SCA as the leaseholder for the landlords, and sent them letters and information about cleaning and disinfecting and about ventilation. What the DOE does, what our expectations are for ourselves and what we expect from them. So they for the Learning Bridges sites that are not in DOE buildings. They should have that information, and that would be my expectation they should be providing what we provide our own people. Thank you great question. Wendy thanks all right. Thank you again. John we'll definitely stay in touch great. Thank you thanks. So really that is pretty much it for tonight, because the study on effectiveness of synchronous online instruction was actually a piece I found it was sent to me actually in education week. I do not know if any of you saw it. I have since needed to retract that, because I think there was a provider associated with it was a study, but there was a for- profit provider that was tied to the study, so I need to analyze it a little bit more before I bring it back to the to the committee. So I think that is all that we have for tonight. If there's anybody else that has anything else they want to share or add to next month's committee agenda. Let me know Patricia did you want to go over the last agenda item which is just to follow up from the? If there's anyone from the committee that wants to add on to or brainstorm any budget ideas I have to, I was planning on following up with you Jen, because I did not put that on the agenda and I'm not prepared for it. I do not really understand what it is that the yearly thing that I'm supposed to wait on right yeah. So I think, if I can do that, if I can start that conversation with you Offline and then bring it to the committee next month, when I have a little bit more underbelly for that could be helpful. I think it's just it's so I mean I can envision that being an hour and a half just on that without narrowing it down before the rest of the Community board landed on priorities. Can you remind us? Is it November or December, when each committee is meant to submit their requests to recommendations? I think it's December. I thought it was true yeah, so it would just help me. This is the not just well so for me, I usually get like the email, and then I you know we discuss it at the Executive board and then I bring the committee. So if you guys are okay with me doing that it makes for a shorter discussion and a much more refined one. Okay, Trish quick question: has anybody reached out to you or anyone else in the committee regarding what's happening at 50:52 volume, because it was the whole discussion with the removal of the homeless, shelter from the upper West side to that locations? All the schools and the preschools that are you know around. There has anyone, because that has been the biggest fight. It's like the schools, the schools around there. No I'm letting I am letting that a school discussion per se and I think it's better. If families have one place to go with that, so she's, you know created a really nice and important place for that. For that and I to tell you the truth, I have not heard from anyone, though a lot of our preschools are private. They do not always know about us. You know. I still have some outreach to do there and if we have any parents of preschoolers on our committee, that can help me with. That would be great because there have been new ones that have popped up, there's new directors, so I really could use some reconnecting with our preschools actually yeah sorry. This is Andrew. Hi I've been on a series of calls that Tammy's organized with health and human services and the operator I can give a 60-second summary or, as you say, people can go to Tammy and get it directly if easier, yeah. Thank you. Okay, sorry, is that you I was going to say I I'd like I'd like to hear it andrew. So there's an awful lot to this and it's a complex issue. I will share where this left off. As of a week ago tonight, which was the last call, there have been two calls and there will be 235 men who will be relocated from the Lucerne on the upper West side to the Radisson Hotel at 52 williams. That decision has been taken. The community was advised at the 11th and a half hour and there were calls to understand the decision making and why this was happening and there's been very strong pushback. But I do not believe that there's a scenario at least at the moment where this is going to change. It is meant to happen that the move is meant to happen by the end of the week of October 19th. I think they'll be moving these individuals down in shifts proximity to schools and density of the immediate area and the infrastructure such as sidewalks and places to gather and others. Other things were cited and expressed as concerns and they've heard them repeatedly. But again I the ship clearly seems to have sailed the one comment that was made that I think gave some people. Some comfort was that the operator has a 24:7 security detail that I think is 25 people strong, and they have been working with this population of men for quite some time, so they know each other. They know the good neighbor behavior policy and what happens if, as a resident, you violate that they did mention the head of that security. Detail mentioned that they have gone around to neighboring buildings, schools and businesses, to sort of understand the neighborhood a bit better and to be able to know where there are potential hot spots and areas of potential concern, and that's the broad strokes of it again. There's much more to this, and we could spend two hours. We've spent probably a total of six hours over two calls on this. There's just there's a lot to process, but that's my take. As of our last conversation last week, that's helpful Andrew. Thank you for sharing that sure anybody have any questions. Thank you andrew. That's, it's very complex and still puzzling. Thank you, though. Sorry, the one last thing I will mention- and I do not want to well- I'm not sure how I would characterize it- it's going to say silver lining, but that might not be the best term to use. But there was a group up in the upper West side called open heart that really came together as a neighborhood to provide community support to this population of men, and they had things such as spiritual walks. They had movie nights. They really embraced the situation and tried to make the best of it for all of the stakeholders, and obviously there was a lot of noise in the media about what was happening, but community one has community board. One has engaged with open heart, we're trying to replicate and develop something down here where again, as a community, we can make the best of the situation and engage and provide support. They had one of the gentlemen who's within the population of the 235 speak about their experiences. Interestingly enough, he did not want to move in part because of what open heart had done for them in the upper West side. So I put that out there because I know there are a number of folks on this call who are quite involved with aside from community Board one other community activities, and I think this is something that's going to get a bit more air time over the next few weeks. That's super helpful. I did think this is rosa that I wanted to say was that Tammy has mentioned in the past, how we, you know, have a very large population of existing homeless within our community that, I think, obviously we need to address and support, and the priority would prefer, preferably have been to start with the existing community down here and, as we discussed earlier on, the call there is a lot of there are a lot of unstable families and children who are trying to Juggle homelessness or home instability with education, which is exceedingly difficult. One of the reasons why this building is being used to house adult males and in this particular instance, it's males with substance, abuse and mental health issues, but the sort of permanent goal, I think they said, is adult families, as they do not have kitchens in them, which to me, is sort of like just fitting the population to whatever real estate you have, instead of fitting the real estate to the population. That has the need- and I feel like a lot of us, especially obviously in this committee- have a strong interest in supporting families, and I think that the open hearts initiative is amazing and that whatever happens, we should be working to expand those kinds of services here. But I think that it would also be amazing, because we have put so much work and effort into building our youth and ed community and resources here if we could try to share those with those who have had less opportunity or are currently with everything going on falling on difficult times. So I just wanted to put that out there, since I do feel it is related to the Ethernet committee. You know it's funny that you bring that up rosa because they closed our homeless shelter. I do not know how many of you were around here at that time, but we had a men's shelter in Fidei and I did not want to say it was right when De Blasio was first elected that they closed it because they could not have that Beaver Street yeah. I think it was Beaver street wendy yeah and it was a crisis a lot and it was. It was affiliated with trinity church as well. Yes, well, that's an important point. That's been made because again they're supposed to be. I forget what the term is fairness, some kind of fairness test in a community that you're not creating an undue burden on one particular community to deal with this issue, and the point had been made repeatedly that we do have homeless facilities or homeless shelters, and the point that was made is some of those are operated either privately or outside of the scope of the city. So you might be referring to shelters that were not part again. We can argue whether we think that's relevant or not. If they're, private or run by the city, but the city was making the point, they have a responsibility, they have a program and when they look at downtown, they do not see a DHS sponsored facility in our community. At the moment right, I want to say it was because it was it was De, Blasio's decision I can't recall. Well, I mean times change and needs change, but I would agree with Rosa in that we do have families sometimes they're harder to identify, because it's not as obvious, and they do not tend to go for help. I've heard this from trinity and a lot of our homeless families come through trinity, because they're comfortable approaching a church and there's a lot of outreach on the part of trinity by the way in terms of reaching out literally by walking the streets reaching out to homeless people and families to loop them in so I'm going to you know. This would be a great thing that, since we represent, you know families and youth that it would be a good idea to reach out to them at this time and just connect with them about what's happening and what they can tell us in terms of increased homelessness during Covid-19, because I think it should be part of this discussion. I'd like to know more about that facility and, of course, as the youth committee, you know, find our place in that discussion for right now. I felt it was best to let that discussion stay where it is because it's been well organized, but certainly you know there could be a time when it's important for us to you know, become involved in a in a way with that and two just very quick comments. So I could wholeheartedly agree with that. I will just say to everyone on this call and I think Sarah has been a participant and Rosa has as well, so they can weigh in on this. The point about this being in close proximity to schools has been mentioned repeatedly. It has not had much influence, but it's certainly been made and the other point that I did not realize- maybe you all did. Apparently the city asks each community board for ideas on locations that might be considered for city-, run facilities, shelters, homeless facilities, etc. So I do not know how we've responded in the past. You know, maybe that's something we want to consider going forward if we know they're going to be considering our neighborhood beyond this one facility. That may be something we again as a youth in that proximity to schools, and such things may be a factor here. You may identify, as in France, very identify what identify some places. This whole scenario has been triggered by Covid-19. They needed to move people out of the shelter facilities that they had because they were not deemed to be safe from a social distancing perspective and they've largely worked with the New York Hotel Association, to identify hotels that perhaps can be used as safer temporary facilities, as Rosa pointed out, 52 williams, while it's being used for this purpose as a temporary facility for these 235 men, it's also been identified as a permanent facility at some point in time for what they refer to as adult families. That means more than one family member living together under the same roof. This could not be for families with younger children because it does not have kitchens yeah. I was going to say how could it be considered families without a kitchen at all experience that was, that was their place. That was their claim as to why it could not be used for families with children. I think Andrew, that is the frustrating part that they did not include the community when identifying the space. Everything was done so quickly in secrecy, and I think that's where everybody was like it just does not. None of this makes sense of how quickly they want to move and the secrecy, and the other thing they have not answered, which I did not even think about- is the smoking where these men are allowed to smoke. With such close proximity to smaller schools, to all the schools and the daycares and the pre- K's is, I think what would be useful Sarah is, if someone happens to know what preschools are in the proximity of this location. If somebody can get these to me, so I know what they are, I can reach out to them and it could be good so much security, that's coming with this facility. It could be good just to really connect with them, so they could put back to us I'll reach out and because I think there was a list that was going around with the school so I'll track that down for you, okay, great, thank you and then we can decide whether to put this on our agenda. If it starts to, you know, be something that people want to talk about here in that context, but thank you Andrew for sharing. You know what happened at the meeting and for bringing that to us and with that I think we are finished for the evening. Thank you all so much for your honest, helpful comments of all kinds on this challenging situation we find ourselves in and we like, I said we're going to keep this on the agenda. At some point we may have a resolution, but you know let us keep on this discussion and if there are concerns, please have them reach out to the office. I am going to be discussing this situation at the Executive board. If any of you have things you want to send towards that end, that can prepare for the next meeting. Please do it as well the next meeting, because it's going to be after the elections. If we have news, I would like a drink in everybody's house for the next meeting. Otherwise you might find me in the next meeting. I would have moved back home to Egypt, which is apparently better than what we might have so anyways I'll either see you with a drink or I will be in Jfk getting out of the country. Just love everybody just vote, please I'm! Actually I'm even going to be a poll worker. I have volunteered to do and it's ten days here guys ten whole days, you can go in person right. True, it's pretty good tricia! Just before everyone leaves us there will be a resolution coming not from executives for the expense budget items. So I believe that if in November no for this month there is a resolution for budget items in October- yes, that's that'll be coming out from executive committee, so would it be helpful there was an email from Lucian. I believe he forwarded that to all the committee chairs as to how exactly to input those items on the budget. It's on a crm, it's on a database yeah. I did speak to him about this. We're just not prepared to have this discussion at the committee level. Tonight. Okay, it usually goes the other way around. I'm going to talk to lucian about it and it's never this early in the fall. So I'm sorry if I missed that they were pushing this up, but with all the other things that we had going on, knowing that this is usually in December, I did not. I did not think that this is usually a really lengthy conversation with the resolution. Okay, so if we can, you know if we have a resolution on the executive board level that I have to give budget items for instead of keeping everybody here at 8:23. If you guys want to send me if something's on your mind that you think is worthy of adding to our budget asks if I am asked to submit it at this meeting in October, and if you want to send it to me, I will bring it up at that meeting and but I do not think any of us are prepared to do a deep dive into a budget resolution right now, yeah Trisha, the only thing I can really think of is making sure that ps150 actually gets built. The money is the I do not know if you were on the call. It was the first thing I said tonight. The contract is signed. The only thing left to do and the original money has been reinstated to meet the deadline. There are overtime charges that will be accrued and that has to be approved yet by OMB. That is the last thing. That's the last thing they have to check off their list, but Michael Mirasola said he felt it was imminent. I can certainly write that in as the budget request to ensure that happens, but I just want to let you know what he told me today and Lorraine wrote me today too and said the same thing. Okay, thank you! Oh yes, I do need to find out about millennium. I will make sure and do that will be something I would take to that meeting. I guess the hard part is balancing how many people are we going to be losing through this through this pandemic, that you know schools are going to be under enrolled as people move out of the city of if this goes on longer and longer. So this is this is not a difficult or this is not an easy decision for the city to move forward. If schools are going to be underenrolled, so I'm sure that they have another plan for that building. If something happens, fair enough, I do thank you, but yes, so if you do have any ideas to send me, please do, and I will take them in my hopes- are that we'll have a chance to talk about this in more in November, okay, all right, all right, bye, good night, everybody good night! Thank you.",
            "summary": "We do this model of basically a couple of hours once a week for the kids to go, who chose hybrid, to go for social, emotional and for advisory, so parents freaked out and everyone went behind it, based only because we were told we are not going to get our next teachers, which They said the chancellor said it in one of the calls- The other thing was some of the parents who are outside of New York City, who, whether they're on the slt or on the PTA.\nWhat is starting to make parents unhappy is seeing the Brooklyn tech model, which is their two full days from 8:30 to like 2:45 in schools like one week and salt and they're going in there, Full time, they're Nobody's, getting different teachers, they're, all their own teachers, whether it's in Brooklyn tech or salt, And they're, not getting any new teachers and what the teachers what happened ends up happening Is they're just having the remote and the hybrid kids are getting the same teachers, but very different schedules, but they're getting the same teachers.\nIt's, two full days from two full days, a week: okay, and is the two days a week, a hundred percent synchronous learning, or are they in the school remoting into classes somewhere, else?\nIt's a school program And we the way we work on that is The kids have class until 12:20 and if they can't get there by one the one day, a week, they come that one day of the week, they're allowed to miss or all or some of their last period class and leave their house at 10 of noon.\nThey have now more focus going in two days, a week, and that has made a lot of difference for the parents and the kids for having kids from, like it's a full.\nWe're talking about item four okay about the effectiveness of synchronous, online instruction, And I do not see millennium or any schools changing their model.\nThere's two things happening, here: Jeff, and it is the number one concern of at least the people that are reaching out to me in terms of youth and ed issues in our community board.\nSo, whether or not it's reading that way on this agenda, which I I'm saying that it's not And we've just heard from Sarah, thus far about the different experiences our families are having acrosss the schools in terms of remote versus blended, learning, also.\nFamilies are more concerned about the lack of time in the building, and I think most of it was that they're trying to adjust from what they were told by the chancellor in his communication in July about the fact that our children would be going back to alternating three days a week and what especially our high school students are finding is that has turned into as little as two hours a week, literally like a half day, they're, going in for two classes.\nSome schools are staying in the afternoon and working on laptops remoting into other classes, which then keep them in the building.\nYou know a lot of them also were concerned about the fact that if they chose blended learning they found out after they got there that they do not have the school teachers that it at beacon, for instance, where my daughter goes.\nSome of these are school- based because you know, as we just heard, we got variances at our schools, which allowed us to not do what the plan the city provided was going to do, but at least we'll start a discussion, because I'm getting massive amounts of questions and emails from parents having a lot of concerns.\nYou can't make them come in the city accommodated the terrible time of living in which is simply just being ignored, right now, in this conversation It's no way to go back on it, because the uft and the city agreed to provisions where faculty members could file paperwork to be off- site and the average school is well in the 20 percent.\nThis is the reality of there's just so many humans in a building that can do the job safely and that's where we're at, So it's to me very frustrating as a teacher, to hear this because we're working very hard to learn new platforms, new technologies to do things.\nIf that happens, we're all set and the old model that many schools are laboring under right, now, they're going to have a hell of a time moving to full online synchronous instruction, which is what we offer all of my classes, are online synchronous instruction every single day and that's what kids at William are experiencing.\nWhat are the numbers for the different schools in our area, of how many kids are blended and how many kids are remote, And I know it's probably different between millennium to urban assembly of emergency management.\nI'm sure it's a lot different from all different schools, but I just really want to know what exactly is happening and what we can do moving forward, because I know that this administration does not want to go fully remote, but at the same time parents who are very concerned about having babies having people that watch their children or to have a schedule or something like that.\nWhat is what are the numbers from Stuyvesant millennium of their teachers and their students that are fully remote to be able to kind of make a more sound decision based on the community, because I can give my opinion, But I think we have to.\nI, do not know if they're learning remotely or if they are indeed If they're, going to school out, there.\nYou have to pardon me, because, with three kids at three different schools, I may get it mixed up a little bit, but it's basically like the one at Hsn goes in one afternoon a week.\nAnd, that's really important and The. Other thing that I'm happy about is that school is starting at 8:30 or 9 A.M, and it's on structure like that has made all the difference in the world, and I know that you know that sort of continuous structure is like not what some of the elementary skills kids are getting as I'm hearing.\nYou know situation in that the schools that I think a lot of referring to that maybe are not in the New York City Public school system that are 100 in the building have a different situation.\nSo I think that I think you're right Judith in talking about transparency, which is why I wanted to have katie here, and maybe this is a good time to break and let her speak and after hearing some of these things, katie that you've heard just sort of you know, give us an idea of what it's like to be at the DOE right now, and maybe you know, help us understand why we're here Obviously, That at some point you know, blended learning will get canceled all together and We'll go fully remote, like.\nIt's really important to us, as we continue to make improvements and as we continue to make updates that we're hearing from the field, it's paramount for the work that we do appreciate, having the chance to come and speak to you in these in these forums, It's things like this, that we kept hearing from the spring that there needs to be more peace, as me came to figuring things out with the unions over the summer and that included all of the health and safety negotiations that included what the changes and we were making to our school schedule.\nIs you know, building a schedule for students so that they are having this time with their teachers, either through zoom or through teams?\nWe've asked elected officials to lobby on our behalf, because not all of that was not continued by everyone through the fall, and so we know that we do have students and families that are having connectivity issues at this point in the year.\nWe, gave an opportunity for students to have a credit, and that would show up on their report card, and we made no one happy, and I think what we've seen you know with the remote and the blended is something similar that we want to give people an opportunity by people.\nIf we just all moved to remote or got rid of blended learning, I in a system as large as ours and in a system is decentralized as ours, where we really trust our principles , We said you know your school community.\nYou know when we've been in school and seeing students happy to take action, and we appreciate that you know still going with the when we are remote.\nOf course, my son is actually at Ps 150 and we are enrolled in the blended learning where we go for you, know, alternating between two and three days a week, And he's in second grade, and I guess may be the only one having a positive experience.\nYou know, as they may have some regularity to their schedule, So it's actually worked out really well for our class, At least, that I'm, aware of and for the for the other parents in the school that I've spoken, with.\nI. Think a lot of us were frankly relieved because it gave the schools more time and the administrators more time to get ready in something that you know is a dangerous situation, but it was the lack of notice and having it just drop on us.\nWhat happened last week, where you know what we were seeing was what happens when there are areas where we're seeing that are that are hot spots, and so that's we've worked with the state, So, the idea being that you would be in a yellow zone before you would be in a red and orange zone and Red and Orange would be when your zone or sorry your school would close.\nWe have a pretty huge agenda, but I can say what I know that no school there's definitely not a system- wide plan for what would happen if half a staff got covered.\nIf I got sick, all of a sudden there's going to be issues, so Is a one class for grade School Is that people are having a lot of different experiences.\nAgain, not criticism, but we just want to have these important discussions and Jeff shows us how tenuous the situation is and how much the teachers have put on the line, how much faith they've just thrown into this situation, as has the DOE, so everyone's doing their best, and we hear that I think the parents concern I, think it was to do this point about transparency.\nYou know what is the DOE doing to make sure these things are happening and that also I'd love to hear at that same time?\nIf you know, we do not want students just printing things out, so we put them into Google, slides, which our teachers have said are better for putting them putting into your Google classroom.\nDuring these remote learning, times, she's only available for five ten minutes for Check- in because the school is utilizing her at whatever capacity they need.\nThey have not started the random testing at our school, so this is obviously an isolated incident, and when I asked the principal it was not, it did not seem like they were too concerned, which I just do not think that why I do not know why they were not concerned.\nNot all of them are, for our school's, been able to hire, who, I believe, full- time subs, to work around the hiring space in order to have remote coverage for our grades.\nWe are getting a lot of attention when our kids are their lives, and I think that the remote learning folks have had a positive experience so far as well.\nI really do appreciate the feedback, and please know I'm going to be my boss, the chief academic officer into our first deputy chancellor, who oversees all our exec superintendents and superintendents issues that are more school, based, And I know there is a a teacher I'm following up with offline and a a parent, Would be my pleasure just shared our emails and we will connect with you with about them as well, and thank you for being open to hearing from us super helpful.\nYou know I'm, not seeing that a resolution of any sort is needed at this stage, but I'm happy to hear from any committee members that so do they disagree and if so If there are major concerns about what's happening at school.\nWe might not have all the ventilation we want, but we can provide air filters that can filter the air, that's being circulated in the classroom and feel safe there again working with the health department everybody's on board with that plan, as well.\nI do not know if the window's open or not, but I'm, going to guess- If there's a central system and it's working And we're providing either 100 outside air or And we've had this conversation with the SCA in a number of buildings, where they're doing construction outside They've done some cleaning on the scaffolding and moved equipment to another side of the building, so that they're not getting as much.\nThink this is something that's going to get a bit more air time over the next few weeks.\nThat, since we represent, you know families and youth that it would be a good idea to reach out to them at this time and just connect with them about what's happening and what they can tell us in terms of increased homelessness during Covid-19, because I think it should be part of this discussion.\nBecause I think there was a list that was going around with the school Then we can decide whether to put this on our agenda."
        }
    }
}