{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB2",
            "channelId": "https://www.youtube.com/channel/UC6-HQNahRKlbfjY5hze0I1Q",
            "title": "October Monthly Meeting",
            "publishDate": "2020-10-23",
            "shortDescription": "Community Board 2 Manhattan\\nOctober Meeting\\nThursday, October 22, 2020",
            "lengthSeconds": "2:22:36"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB2",
            "normalizedName": "Manhattan Community Board 2",
            "twitterName": "Community Board 2M",
            "youtubeChannelName": "Community Board 2",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC3kEY0n-RPRYE6rOlfstFDQ",
            "twitterHandle": "@CB2_Manhattan",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "Ftq9Z4DFmE4",
            "fillerWordCount": {
                "uh": 400,
                "um": 286
            },
            "readTimeFullTranscript": "73 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "restaurants": 25,
                "dining": 20,
                "vote": 19,
                "information": 18,
                "plan": 18,
                "restaurant": 17,
                "objection": 16,
                "nominations": 15,
                "program": 14,
                "week": 13
            },
            "wordCountSummary": {
                "planning": 6,
                "dining": 5,
                "plan": 4,
                "restaurant": 4,
                "residents": 4,
                "restaurants": 4,
                "vote": 4,
                "voting": 3,
                "chair": 3,
                "legislation": 3
            },
            "fullTranscript": "Okay, we're going to get started welcome tonight is community board two's October full board meeting October 2020 full board meeting we're going to start with attendance, Valerie De, La Rosa. Our secretary will take attendance. Thank you. Susannah Aaron, here Akilah as Queen William Banesh here Burger here, Carter booth here, Katie bordenaro. She on the phone, possibly if not Amy, Brenna. Here sorry rich cacapullo, here ritu chauchary valerie, it's katie! I'm can you hear me. I can hear you katie and I see ritu just joined I'm here right here: John Paul, De, Verna, here great Doris Dieter here. Thank you. Doris Bob Ely, yes, Mark, Fitzgerald, Cormac Flynn, here Joseph Gallagher, here, Susan Gammy, David Gruber, here Wayne Kawadler, Susan, Kent, Here, Janine Kylie, here Betty, Kaboby Weiss, here Patricia Aleria, here, Michael Levine, here Janet left here, Matt Metzger, here, Daniel Miller, here, Brian Pape. Yes, I'm here Donna, Rafferty raftery, I'm here! Thank you! Lois rancoff, I'm here Bo Riccobono, I'm here, I'm actually lying on the tracks. All right, Robin Rothstein here Sandy Russo, yeah, Rosie, Rocio sans here, okay, Shirley Secunda, here Kristen Shay, Rodriguez, Seagull, Georgia, Silvera, siemens, you're, Dr, Shirley Smith, it's fredrika! I'm here sorry, thank you. I got you Chanel Spence here, Kathy Sullivan Eugene, you here thanks Susan Wittenberg yeah, Anthony Wong, but when we have elected officials in attendance, we generally give deference to them to present their report to the community first. So today we're going to start with Assemblymember Glick. I see that you're on with us. Would you like to provide us with your report? Welcome there we go. I talk on my things happening tonight, including another wwe debate. So let me just say three quick things. One. Let me be the 18th person this week to remind you that early voting starts on Saturday and that, if you do not know where your early voting location is, you can check on the board of election site. You should have already received the detailed information with a little voting card. So hacka, you know some maybe a purview, but, as you all know, I frequently opine on things that are not directly in my purview but affect the community. The City Council correctly extended the open outdoor dining through next September. I think we all know that this has been a very tough time and the size of the plows, so even though they have some smaller equipment, I think that lower Manhattan is could have problems if, in fact, there is a snowstorm that being said, and I'm not sure who wants to sit outside even with a heater at 30 degrees, but that's people's choice. What I am deeply distressed about is the fact that it was made permanent. It would have been appropriate, I think, to say that it would be reviewed at the end of September of next year and give the community an opportunity to weigh in this is an enormous giveaway of public space to one industry. I do not know that there are not other retail operations that might want to have some space on the street to be more visible. I just think this was sort of a rather shocking thing to do when I think a lot of people were not around and two- thirds of the council will be term limited. We have many issues we have heard from people. Some streets are nice and quiet. The restaurants are more laid back. Other streets, people send me videos of the noise at 11 o'clock at night, and so I think that this was precipitous and totally inappropriate. But let me reiterate: I understand that during the emergency, this is a way to assist are very important. Restaurants. The other issue that is coming up is a Noho Soho, scoping and rezoning proposal. There was the envisioning Soho Noho we inquired about that. Over the summer we were told specifically that there was tremendous concerns raised out of the community and it was not going anywhere. Lo and behold, within a matter of several weeks, we see that there is actually going to be a presentation and a scoping. I have not seen a tremendous to get a briefing next week on revenues. I'm sure it will be devastating. We will be back to you when we have more information, but industry after industry sector after sector have come to me and my colleagues to say how they can not sustain any more cuts, certainly higher education. The committee I chair. We are deeply concerned about many of our colleges and universities, especially the private institutions, many of which are quite small and have very little flexibility, and obviously I care about SUNY and CUNY. Those are our public institutions, but ithaca college laid off furloughed, but over 130 full- time faculty that is cutting to the bone and several other campuses have called me to say that they are not sure they can survive and if we're going to recover, if we're going to have an educated workforce, we are trying to engage the large business community organizations who speak up we've written to the governor along with 40 of my colleagues, in order to say that we can not sustain more than a ten percent cut. Higher ed in many places is the employer, but it's also where we're going to get the next generation educated. So- and the only other thing I will say is that we've heard from parents locally about their concerns about the quality of remote learning and those who are sending their youngsters to school have some issues about the very rigid way in which the city has your an a group or b group. They feel parents and perhaps educators, feel that they would be better positioned and would like to have greater flexibility in order to ensure that we have 41, it could have been three and we'll meet with them in the coming week, or so I would say, probably after election day and to figure out I mean the Department of education is impossible to deal with as anyone who has kids in the schools now. So that being said, I again remind people we do not want to be outshone by other states that have had enormous response to early voting and it's new for New York. So let's demonstrate that we asked for it. We got it and we're going to use it. Thank you very much and everybody stay safe and you know be well thanks. Deborah Assembly member Deborah Glick always great that you can join us. We really appreciate it. I think that that's carter can some of us ask the questions. Oh sure, go ahead. Deborah. Thank you so much for coming to this and thank you so much for your attention to this question about the open streets program. I agree with you that it's really important for us to be flexible during this crisis time and I'm also very happy to hear you agree with my feelings that this is an enormous policy decision to suddenly decide on a whim to make permanent. There have been no studies on impact on traffic or sanitation, or parking or snow removal or noise or quality of life. So I guess my question is so what happens I mean: what role should the community board play in trying to get this re reviewed next year? Well, I think I think it would be appropriate to do a resolution saying that no, you lerp no eis, no, nothing and hearings that were held by the council at a time when many residents have many other concerns, I mean I was not even aware that they were having these hearings. I do not know who went who was notified it just I I'm not an attorney, I think, probably down the road. There would be grounds for a a lawsuit, but I would rather that the government just be responsive. I think the city Council, as I said, two- thirds, are going to be term-, limited and half of them are running for other offices, and I think that you know they did not. They wanted to demonstrate how supportive they were of small business, but it's not all business. It's just restaurants, and I find it I mean I was delivering hand sanitizer around to different groups the other day, Mulberry Street, is both sides of the street for the entire stretch for like two blocks. I do not know where they would put the snow. That street would be completely snowed up with it. For this year, and as a way of helping, I just think that it is insane not to have had a broader discussion, so I think community boards that share our concerns should all be doing. Resolutions and and individuals should be writing to the mayor and to local newspapers. Thank you, yeah. I have a question for you guys. I've got a yeah. I see everybody's got their hands up, we'll call on you in order- and I just wanted to before. We move forward Deborah great points that you bring up. Our reopening working group did meet this month and the plan was to pass a resolution, but Valerie De, La Rosa, the chair of the committee. Let me know that the we did not actually have the actual legislation at the time of the hearing, and so the committee would like have another opportunity to meet and further discuss some of the other details so that we can more appropriately comment on the legislation. We have a number of public speakers, so I just wanted to share this with everybody before we get too far down that road and so from with that Michael we'll jump to you. Yes, hi Deborah. Thank you for your report. It's always great to see you here, quick question about the open, dining we're all very concerned about it, and we agree with everything you have said. One thing we're not clear of has a feven associated with the making of the outdoor dining permanent, either on sidewalks or roadways. None of us are clear as to whether or not the city will be charging a fee to the restaurant owners. Do you have that information, or is that not yet known? I did not see that in the legislation there could be. Sometimes those things are developed in regulation, but regardless you know there are many. The only thing I do know was that they would have to have a permit from the fire department relative to their use of propane, but I still think that they also talked about it being secured outside of the city where the propane is stored in a locked box. I mean I, the whole thing seemed to be done without what I like to think of as thoughtful reflection. So I do not know that there's a I do not want to say that there is not a fee. I did not see that, but I can't swear that there is not contemplated okay. Thank you thanks, Michael William will be nash thanks and thanks Debra for your presentation, my question's, pretty quick, so assembly bill. I think it was a10,936. The recovery lease act for small businesses got a lot of press couple of months ago, but there were very few details on kind of what it might look like. I have not seen much since then, so I was just wondering if there's been any progress made in the updates and if it's something that's still being considered well we're when we're never out of session, but we're not actually called to session yet, and I so there is some thought that we might be called back. We will definitely have an assembly retreat in early December that is frequently associated with some time in session and what gets you know? What bubbles up is hard to know, so I do not have a solid answer for you, but I will say that I think it is more than likely that we will be in session before the end of the year and prior to the holidays, even if nobody's traveling. Thank you all right, thanks and Scott. Before you start, I just want to congratulate you on your and your opening. It looks like you're sitting inside somewhere yeah, I'm in a basement, but thank you yeah. It's been a long time coming and thank you assembly, member glick yeah. I guess my only question is the restaurant owners. Obviously I listen to all the the issues and there are a lot of issues. I do not necessarily disagree with, but I guess my question to you is pretty much knowing that at 25 occupancy, almost no restaurant can survive and all over the country most places have higher than 25 percent. Where do you stand on adding to the occupancy indoors at restaurants? You know, I think there are two issues there one. I believe that the that we should be driven by science and I am not opposed to there being an increase in that occupancy. I think that in most places at this point in the city, except for some hot spots, we have maintained a very positive low, positivity rate, a very reasonable low, positivity rate and so the safety you know this is about safety, and we understand that you can survive with 25. So I'm hopeful that will increase the flip side of that is people have to be comfortable. You can say the state can and the city can agree that we will move the number to 50, but if people do not feel safe, then it's irrelevant. I think that there are places, as many of you know, I have a place in the country they've been at 50 for a while, and some of the restaurants just have not themselves felt comfortable doing more than 25 and that may have to do with whether they have a high ceiling or how large you know how easily they can separate people. So I'm not opposed to the to moving it to 50. There's discussion now around outside of the city opening movie theaters, we have been you know, Broadway has said they're not coming back till earliest may, but we have a lot of small theaters and we've been advocating with the governor to look at these smaller venues that frequently do not have more than 25. You know they'd like to be they'd like to have a full house, but many of them do not have more than 25 on a regular basis. So you know we're trying to push the governor gyms are open, pool halls are not you know. Some of it is a little bit strange, so we're trying to push the Envelope, and I would be supportive if the data shows that being at 50 occupancy in restaurants is safe. I'm fine with that great thanks. That's all the questions that I see at this point. We only take questions from board members for the elected officials. So I see Martina, you have your hand up, but we're not going to entertain your questions just like when we're meeting regularly in person now we're going to go back. I do not see that we have any other elected officials with us at the moment. So let me know if that's not the case, I'm just taking a quick look. Okay, I do not see anybody we're going to go to the public session now, as I mentioned before, we're not going to be considering the reopening working groups resolution on outdoor dining. That's we're going to continue to meet on that. Given the new legislation that's come out, so Dan Miller is going to our first vice chair is going to run the public session Dan thanks very much carter, just to repeat the rules, no more than two minutes, we'll cut you off in two minutes, just because there are some things that we all want to listen to later this evening and if you are going to be speaking about outdoor dining, just know that you're going to have another chance down the line, the valerie who's, our chair of the reopening working group, is holding potentially another meeting on November 9th. So your testimony might be better served at that point. So to kick off public session Jane Carey from the Whitney. You have the floor. Let's see all right hold on. We've got ta just carter, so you know we're going to do Jane and then Adam Kushner. Next, you know what I'm going to I'm going to just make you a co- host. So you can you can line up the on unmuting too, because it's a little easier than both of us talking about val was going to help me out with people. Okay, sorry, I got it so ballot, maybe yeah! You can help us out too. I'm on a very small computer. Today, hi Carter, hey Dan, hi Everybody Jane Carey with the Whitney museum. I will keep it super brief today, I'm here to talk about two events that are coming up next week at the museum. The first is coming up on Tuesday the 27th from 6:30 to 7:30 P.M, we're thrilled to co- host an event with the community board with Hudson River park, trust in the meatpacking bid. It's a conversation with our curators who put together the around days in exhibition, which is right now on view in our free lobby, gallery until November 1st, and so our curators are going to talk through the exhibition, which includes many works that were made or feature lower Manhattan in the 70s and the 80s, and this is an anticipation and excitement for the completion of the days and sculpture for gainsborough peninsula, which right now is on track to be complete in early December. So I'm going to include a link in the chat to the event page and hope that you can join us for this online free public event and if you know anybody that would be interested, please spread the word. The other event I want to mention we do a halloween team night. Every year it's usually a free event to bring in teens to do something safe and fun and artistic that is also online too this year. So I'll include a link to that. That's coming up next Friday from 4 to 6 pm. That's it for me! 50 seconds left there you go have a great night! Everybody! Thank you very much, jane looking forward to I plan to attend. Adam Kushner are you with us? He said he may or may not be with us. If he's not, I do not yeah, I can he sent in a letter. It was about Panchito's, Minetta lane looks like you're, starting with the the outdoor dining, but there's one person on that list. Parry Deluck, who has a different agenda item. I do not know if you want to put her before the rest of the group. Okay, why do not we start with Pete Davey's next thing, because he's not an agenda item. Does that sound good with you, Bob, okay, great so balor? If you could get this is the most complicated one if you can get the pdfs up and then pete is going to refer to some of these bullet points as well as this diagram? Okay, thank you and Deborah. Thank you very much for putting spotlight on solo. No, that's what I'm here to speak about I'm here, representing Broadway Residence coalition. I was also on the advisory group for the planning study last year. I was surprised as everyone when the mayor suddenly announced after telling everyone last January that this was not going forward, but all of a sudden he was moving it forward. Despite information on the city planning website that says that the city planning has prepared a draft scope of work for environmental review. Apparently we are not going to get that before the meeting on Monday. So I would just like to put forward these two items from the Soho Noho recommendations which folks might want to hear about next Monday. One of them is the potential jlwqa pathways to legalization. If anyone can make sense of this congratulations, maybe this will be clarified on Monday, also pointing to page 85 this, which is the suggested areas for further analysis and study. It's eight bullet points of information and items that needed attention before we could do a scoping, so maybe city planning has done all this work and we'll present that to us on Monday do not forget to register for the DCP presentation Monday evening at six o'clock. I'll put the link in the chat, and I will also put in the chat the link to the envision Soho Noho recommendations where these beautiful diagrams and bullet points can be found. Thank you very much thanks very much pete. Does any anyone have any questions from the the board, seeing none Bob? Who was it that you said is not agenda item that we had left, because I may not have gotten that information parity, lock? Okay, I have perry deluck as a panchita's liquor license. Yes, let's go ahead, Harry or Christopher. I think you need to unmute your microphone on your phone or on your computer and that there you go. You hear me. Yes, we can hear you. Thank you you're good. Yes, we're good, all right! Okay, it's about time, cheetos! It's too big issue! I have with that place. One is we constantly stay to exit door? It's only one exit the last four years. They do not have no plan from building department. They say you have to have to exit, though it is nothing, that's what they say, but a building department, no record of such of thing. If they want they say to exit record, should they show you something to prove that they came from building department number two, oh in the back in Minnetoy Street, is a very old thin glass window and landmark never ever let that change. If they have music with 200,250 people every night, I suggest that they should from inside they put sun proof wall. This way the noise does not come to miniaturize it because many times it's very narrow. Even people talk. The voice gets echo. Somehow I'm not engineer, but I live there. I know it's happened and they should. We should really go through that with them more they never. They showed the plant Bob did 30 years ago, and then it's not working and they say that building department, nobody working, how come they approve their plan and they told them what they have to do matter of week. I really like you guy check it out, see what building departments say if they have on writing, because I mean there is nothing there and they have to prove that it is one door, obviously one door. Now they say to exit or it's not possible, there's no record of it and they if they have the music. Okay, that's going to be all I'm going to give you tonight. Okay, I absolutely see it thanks. Very thank much if Adam Kushner is not here he's actually speaking on the same topic, if Adam's not there, I can just kind of quickly summarize he agrees with perry. He's a member of the Minnesota Association he's lived in the neighborhood in mineta lane for eight years. Ultimately, the rear door he says, will likely be used to allow guests to sufficiently enter and exit. Thus increasing the use of ubers and taxis he's worried about more loss of trees. He's has less concern about the mcdougall facing bar and he is also concerned about the request for live music on the north side. Ultimately, he agrees and wants to support outdoor dining, and he says that none of the residents dislike the idea or intent of the restaurant. However they're hoping they put all the egress on the current Northside vestibule, rather than go through the efforts of opening up another one on the south side. I hope you did your justice there Adam that's his testimony. The next would be Richard Weigel and then after Richard, it's going to be Eric, Galliland Carter you're on Mute. I think I do not see Richard on the list. Okay, so let's go to Eric. Do we have an eric galerland? If, yes, okay, great and then after Eric is going to be Marna, Lawrence, hi Eric, you see me, we can hear you you're better, actually go now. Yes, great! Thank you. Thanks. I've lived in the West village for over 20 years. I used to live in L.A for 18 years, took a job out here that was supposed to last eight months. Fluctuatingly wound up renting on Bank Street and never went back to La. I fell in love with the West village and why? I think we all know why it's so damn quaint, it's just ridiculously quaint af and a big part of that quaintness. If that's a word, is our restaurants. Restaurant people are a big part of our community. Restaurant workers keep us going, especially during the pandemic, from old school sevilla, to Lartussi, to corner Bistro, to tavern on Jane, where everybody knows your name so Quaint. I personally officiated two different weddings of West Village restaurant employees. They are family and they are probably also to you when they got shut down in March. It was devastating to everybody. Many of my restaurant family members were literally destitute. One of them had to leave his apartment and crash in my spare room for months. Another couple had to move out and are currently living in a van with no income. What are they to do? Moving with their parents in their 40s, we need year- round outdoor seating. We need to keep our restaurant friends employed and yes, elsa outside in 30 degree weathers a deborah question to save businesses and jobs. Hell and all the people in the hospitality business just want to make you happy and content. They also want to make be able to pay rent. Please keep out there done permanent, it's important to my friends and to keep in our neighborhood quaint the end great yeah. Thank you for leaving 15 seconds. Next is going to be Marna and Thereafter Cynthia Chapin Verna. Can you hear us Marna had texted that she may have an issue with her microphone. She is unmuted. I'm going to move to her other marta you're allowed to speak on both your devices. So if you unmute on the other one, we should okay. I do not know what's wrong with my imac. All of a sudden, I can't get zoom anyway. Can you hear me hello, you're there? Okay, so I wanted to. First of all, I want to thank Deborah Glick for understanding the extraordinary challenges that my neighborhood in little Italy is experiencing. I want to talk about the mayor's upcoming Soho Noho neighborhood plan meeting on October 26th. The community was promised that this process was to include feedback from residents and small business owners. Yet it looks like the Soho naho envision planning process is being fast- tracked, and the promises made by some elected officials that community input was essential have been broken. For example, the Soho and Noho communities that put so much work into these workshops made it clear that there should be no upzoning. Yet it looks like the mayor and other officials are intent on ignoring the community's wishes. This is personal. Full, charming retail stores began to be replaced by corporate oversized box stores. Now today, those who live and work in Soho and Noho are being told that decisions are being made behind the scenes to destroy our artistically bent and architecturally beautiful neighborhoods, and the worst part is that to some extent, these decisions are often based on this information. Let's get rid of the myth spread by some dishonest developers and make- believe organizations that claim to be proponents of affordable housing. That Soho was filled with only the wealthy class. While there are some expensive lofts in these communities, there are also many residents who live in apartments and loss that they struggle to afford. The fact is that our city agencies refused to enforce zoning laws, and some of our elected officials refused to make these agencies accountable, so corporate developers infiltrated the previously quaint neighborhood lined with architecturally beautiful buildings to make it appear that all the residents in Soho were entitled and wealthy, and let's look at what these corporate developers in the city of New York want to do, instead of the city working to find already existing, truly affordable residential units and working to support the small one, I'm afraid that's your time, but thank you very much. Let me just can I just end now: it's a land grab. It's a land grab, it's a land grab another land grab. Thank you. Thank you. Marna. We have gail Brewer here with us and we're going to give Gail the floor. Thank you very much board too a couple of issues. I believe, and I could be wrong to answer the question about the restaurants, because I totally agree at least for now. I believe that it is year round. So, who knows what happens in the future, but my understanding is the mayor has said be around what does that mean exactly, and we all have feeding issues so it's complicated, but at least something small that we certainly advocated for the biggest issue is Soho Noho and there's a couple of issues. I know November we're going to plan a couple of our task force meetings to go through what we put down in terms of the planning, the booklet that pete just showed you and we will go through whatever we can, because I know there's a scoping session planned for December 3rd. This is a huge challenge and I just second issues very quickly is we're pushing some of community board. 5 has already passed a resolution just something to think about for the future. What is a public realm? Czar? Look like it's something that the Times Square Alliance is pushing everywhere I go. Even the police department is asking that somebody look at like some 20 agencies that work with our streets. We love the restaurant. We like to figure out how pedestrian bicycles drop off homeless, Scaffolding Department of Health, SLA, etc. How is all this going to work in our streets and our sidewalks and in our park, so an idea that you might want to think about for the future in terms of census very quickly, I think new rocks Manhattan came in around 63 percent. I looked at the map today to see in your area it's everything from 53 to 65. So it's a it's a mixture. As you know, we did mail to 35,000 new yorkers who left because we had their addresses from absentee ballot of the prime minister. We got a pretty good response thanks to the league, women voters, but we did what we could. I also know that there's a meeting coming up Hudson river park, my understanding is the governor is very much in control of these decisions. Just so you are aware and pier 40 and pr 76. So two community boards are going to be on the agenda to start planning for those two sections: we're trying hard to find a place for the pound police pound to go and, of course, pier 40. You know the issues as well as I do. I think it's October 30th. You may have already discussed this where the governor told the mayor find a way to have police community relations, and so there's a 28th of October uptown and October 30th in southern part of New York. To talk about that issue, and you may already have had that information, but people should definitely sign up in Queens. They might have 150 people. I'd love to have a lot more in the borough, Manhattan we're working on a task force on affordable housing, that's probably for the next administration, but you hear the challenges you know them well and I do not think we're producing half as much, I'm obviously not in your area, but dealing with the homeless and seem like every other community board. We've been working with the tech devices in the schools. It's a tech issue in terms of the devices, the connection to the internet, the language, the tech desk at the DOE for help the list is long and then just finally, you know we have given out- and I think quite a bit in your area. Obviously, capital money, NYC and company gives us what they call cultural money, which is really a lot for the arts. We give out two pots for the census, both those who came from the governor had some money for each office. My concerns that department of City planning who had led the envision Soho Noho process last year. I was a co- sponsor, along with with Gail and Council member Chin, collected all the email addresses of everybody who was interested in the process and informed us yesterday that they were not going to be sending an email out to everybody that had already participated in the process, which is mind- boggling. So it's just it's hard to understand that that's the first foot forward in this process. So thank you Gail. Thank you we'll change that tomorrow, but we still need more discussion, Cynthia, Chapman or Capen. Is she ready be able to locate her another question? Oh you have a question. Sorry, I did not see your hand up Georgia, yeah hi. This question is for the borough president. You mentioned eptec and homelessness and I'm curious what the respective departments are doing about. Wi- fi and homeless, shelters for school- aged children. I think what Georgia I when I find out I'll, let you know I mean that is the issue there are. We have discovered because you know I have I appoint people to the cec, and so I have a constant dialogue and parents and principal- and I am finding that in, for instance, district, not the single adults, and so we are in the process now of calling, I think we've done about half everything, every single provider and asking what you just asked me and what we're finding, although I'm going to finish it is the following: people have devices generally in the shelters, but guess what your device does not work. You call the help line at the Department of education. You might get a call back in three days that does not help for homework. Second, language is a big issue in general, but particularly when you're trying to get assistance, it's not necessarily there. Third, when I talk to the principals as I did today, often the issue is the person who, in the school is kind of random who's, helping because they have other things. But it's often the parent coordinator parent coordinator, is not a tech expert, and then you have the problem, of course, of just Wi- fi in the shelters. Now it's not great. So how are you going to be able to do the homework and be online and do the video and so on when you have really bad bandwidth? So that gives you a little sense and this has to be fixed, so I'm not giving you all the problems. I have about six pages of problems to be honest and I'm very frustrated by it. Thank you very much for that answer. Seeing no other hands raised in the participant chat, I'm going to call on Carlos Suarez and then after Carlos will be David, Rabin Carlos. You want to give a hello to us, so we could make sure we can hear you star six. If you're on a phone- hey carlos, you have to hit the down at the bottom or at the top, there should be a microphone there. You go hey good evening, guys, sorry about that. I'm not just driving! Apologies thanks for making time and for having me on. As some of you know, my name is Carlos. Suarez I've lived in the in the village for about 14 years own and operate four restaurants started with bobo back in 2007. opened Rosemary's in 2012 claudette in 2014, and our little pizzeria on Perry and Greenwich called Rowie's back in 2018., no surprise to anyone, I'm a huge fan of, and very grateful for outdoor dining. I think it's the tremendous action by local city government, especially at a time when obviously federal government continues to fail us through this crisis. So thank you know to the local officials, for you know this creative problem solving. I would like to add that you know the restaurant industry pre- covet was. You know in a lot of trouble, as we saw you know, much of retail is in a lot of trouble. Pre- covet. We do not expect in the restaurant community, you know business to bounce back and all our problems to be solved just when the pandemic passes, and I do think that outdoor dining provides a phenomenal benefit. That can you cut out there, carlos restaurants and as a believe that this is very important kind of is ultimately threatened. You see so many, whether it's on Bleecker, Street or Seventh Avenue, where I live so many empty storefronts, pre- coded. I think we need to do whatever we can to protect that vibrancy. That first Speaker spoke about the village. Being you know one of the greatest neighborhoods in the country, if not the world, I think it's very special what we have and we need to protect it. So you know obviously an advocate for outdoor dining. I think that's all you got we're going to move on now, Carlos! Thank you! So much yes, hi! This is David Raven, no problem. Thank you for allowing me the time, and I just want to echo a lot of what Carlos just said. I'm a partner at cafe, Clover American, Bar Jimmy at the James, soon to be a new restaurant. Also at the James come this spring. I know this issue's been tabled, I think till November night, but just as you're thinking about it till then you know I just want to try and dissuade people from thinking that restaurateurs are driving around the city in chauffeur- driven limousines. You know this is not an easy business. I do not know what I was thinking when I left law to become a restaurant guy, but such it is, as you know it is that what it is, but you know I've already heard earlier in this call a question of you know, certainly what Assemblyman Glick mentioned about plowing. I had not really thought of that issue yet in mid- winter, I'm not sure that people are really going to stick around and eat outside when it's 20 degrees and snowing out, and but you know I already heard in this call mentioned- you know what fees are going to be paid, and I just want to kind of remind you guys that this business is literally on the border. Going away you know, places are barely surviving. 25 is a joke. I mean it is what it is, and I agree about following the science, but I mean it's, you can not survive. So the idea that you know if it's continued and all of a sudden, it will be as if restaurants are now a cash cow to you know, pound with fees because they have more outdoor space. It's just not realistic. Restaurants will be lucky to survive and continue to provide streets with safety. I do not live down there. I live on the up west side, but my entire area is filled with restaurants, and I quite like the fact that when I walk home from the subway at 11 o'clock at night or 10:30 that there's people outside and there's activity, it makes me feel a lot safer than if all the storefronts, which many of them are empty. At least the restaurants have still got something going on at 10 o'clock and thank you for your time be happy to speak again when this is more appropriate yeah. Please do think about coming to our next reopening working group meeting we'd love to hear it aside from the restaurants, Serge becker and then mark Gibson. I do not know. Does he serge Mark or Joe Dimandi? He said it was you. What was the last stream Serge Becker Mark Gibson yeah I've got Mark Gibson in here Lo. Can you hear me? Yes, we can thanks mark no problem, so my name is Mark Gibson. Thank you guys for your time and I own and operate two bar restaurants in our community, the spaniard on West, Fourth and barrow, and will finale and West fourth and Seventh Avenue South and I've lived and worked in our neighborhood for over 12 years. I love it and I want to speak strongly in favor of the outdoor dining first year as a resident and a member of the community. I think the outdoor dining has been a big part of bringing life and safety back to the streets. I can certainly attest to the days and weeks right after March 16th when we shut down and before outdoor dining. It was pretty scary on the spaniards, block of West, 4Th and barrow, a lot of homeless and mentally ill and violent people on the block. The police were pretty low on numbers and we had numerous incidents of verbal, serious verbal and physical assaults. Once we started outdoor dining, we were able to control the corner, adding we added security to deal with these people. We gave them mass, we moved them on where possible and I think between us and the police. We've managed to get on top of the issue on and the block, I think, is now a safer place to be. Secondly, as a business owner, outdoor dining has simply been the difference between our business surviving and closing indoor dining at 25, and even at 50 percent is not enough to keep our businesses alive. We, unfortunately can't rely on the city state or the Fed to bail us out, so we have to make it work somehow and on scrappy new yorkers outdoor dining is the key to that. When we're up to full speed, we employ like 50 people between our two places, with outdoor dining we're able to bring 25 of them back. These are new yorkers like us. Many of them are immigrants like me, and all of them would be unable to get a job anywhere else, so outdoor dining has given these people the job. Like anything, it's not perfect and I actually agree with a lot of the concerns and issues that were raised specifically by Councilwoman Click, and I think these need to be addressed and I think they will be everything's coming fast at us we're as restaurant owners adapting to these rules every week they throw different rules at us, so I hope they also throw a little bit more oversight on it as we go forward, but as a whole, I think it's been an overwhelming positive impact on the life and I've got to cut you off right there, but thank you very much. Thank you. Thank you for support. Okay and Joe De Monde, I'm going to I located you, I'm allowing you to speak. I've made you active great. Can you hear me? Okay? Yes, okay, I'll be pretty quick, so my name is Joe Domundi. I live on Crosby Street, near Howard, in southeast Soho, in a co- op where we both are residents, and we also own our retail spaces, so we're both residents and landlords, and we have a lot of concerns about this up. Zoning push for Soho Noho. I think. First, it's completely unnecessary. From our standpoint I mean we saw the mondrian Soho go up in 2011., it's a 27-story building. You could rim Center in Lafayette Street with 27-story buildings and dramatically increase the housing stock without changing zoning at all. So what we do not understand at all why there would be a push to increase from those levels. There are one two and three story buildings all up and down these streets to build on. I think the second concern is around the map that came around with this plan, which looked like to us. It was pretty heavily gerrymandered by the real estate industry. I mean, I think you saw streets like my own, which is a cobblestone dead- end street highlighted as an area where you should be putting skyscrapers, and the only sense that makes is. If you know our street has been effectively bought up by reits over the past 10 years and is now largely controlled by wreaths and not and not the residents, and I think my biggest concern is the area. This specific area is very diverse. It's majority minority, it's a lot of small businesses and if you put up 75 luxury towers, it will be overwhelmingly wide and it will be overwhelmingly luxury. It's not diversifying in the lease. So I just hope this does not get rushed through and residents who actually know the area can have their voices heard. Thank you thanks very much joe. I do not see surge here. I look for him. So that concludes our public session and appreciate everyone's participation and I'm going to hand it back to Carter Booth Chair thanks Dan. So now we're going to move into our move back over to our to move, to adopt the agenda and then we're going to move into reports from the public, our elected officials. Is there a motion to adopt the agenda as presented before you? This is distributed by the board, so moved so move second. Also Valerie. Could you put a link into the board package or Bob to have the full board package? Yes, okay! So now we're going to move on to a report from the from the elected officials. Reports. If you guys could all raise your hands- and I will said I see Brad is that is that- are you with us? That's me with you, oh well, we're going to start with you, then okay carter. I just always fondly remember that map behind you. It's a great piece of iconic, CB2 history. I just a few things. I'm going to be very brief because it's a busy night. Needless to say, our fate of our democracy might be hanging in the back into that rather violent policing of protests, and I wanted to say also that I support the passage of legislation that would limit the ability of localities across the state, including New York City, to encourage them to provide independent oversight of police also. Secondly, I I've called on the state recently to exercise its clawback power with its contract with Phoenix graphics. That's the ham- handed operation that sent out around 100,000 absentee ballots to incorrect recipients. This could return, I hope, 4.6 million dollars from their no bid contract to the board of elections. They certainly need it. Third, in response to the Broadway League's announcement that Broadway productions are going to remain suspended until at least may 30th, I'm urging you know support for Senator, Schumer's legislation on immediate federal relief and in the absence of that state funding, nearly 100,000 new yorkers rely on Broadway for their incomes, a lot of those good labor jobs and, of course the industry contributes something like 15 billion to the economy of New York City annually. So we need to support our our Broadway family and all those workers that range from set designers to electricians and beyond. I've released a fourth I released with an assembly member. Thank you and just for clarification. I do not believe any elected official other than the mayor's office has this information, because I've spoken to representatives from all the offices and nobody has seen any of the, but I will say it would be great if the council member could attend the meeting. Okay Susan, you had a question as well: yes, hi anthony. Yes, how are you hi, Susan good, to see you? I just want to kind of a recap, question of what I've been hearing from many people in our community, which is we're not sure why we're having the meeting actually on Monday, with so little information or new information available to people. I mean our community members attended every community meeting last year or a year and a half ago with envision, Soho Noho, and so this is has been met with reactions ranging from anger to frustration. And why, and so it's we'd like an answer to really what is the exact purpose of the meeting on Monday night, and why are people attending what is your and what is the intent of this meeting exactly even though you're not releasing any information? No well one. This meeting is being organized and by city planning and from what they have put out that they're going to do at least from the agenda that I've seen, and I think others have seen that city planning is putting together this with one. Yes, do: sort of the recap of the envision Soho no home to talk about the next steps going forward with the plan and I'm so they will outline that in detail in terms of their next steps and also two and three. The mostly is to get the community feedback from this from the from the meeting in regards to moving this forward. So from what I'm reading from this is sorry that feels like a rush you know so that we understand Susan. This is like kind of city planning that is doing this, not the council member's office. So that's really where we need to direct right, but one might hope our council member might have more interaction with that office. So I'm encouraging that effective, but no definitely susan. If we I def, we're taking it on to make and council member Chin is very aware and one and we're going to have those interaction, conversations with them, but appreciate your response. Thanks, Susan, okay, we're going to go back to Luke from Controller Scott Stringer's office, hi, everyone Luke from the comptroller's office. Here I want to spend my two minutes today talking about the economy in the city, so it is increasingly clear that we are not having the v- shaped recovery. Many of us had hoped for at the start of the pandemic. Our unemployment rate right now is about 13.9 percent in the city. As of September, which is about six points above the national average, we still also lag in terms of job recovery. We have had about a third of our jobs lost since the pandemic regained, which compared to 54 nationally, which is why, with that in mind, the comptroller this week announced a comprehensive overhaul of our Workforce development plan for New York City, and the goal is to upskill, millions of new Yorkers dramatically, diversify high- wage industries and generate career opportunities to spur New York's recovery. So the plan has 12 recommendations. I will drop in the chat and highlight a few, so the premier one is make CUNY community college free again like it was for generations of new Yorkers as that pathway to the middle class and skills. Another one is to create a SUNY tech core. Excuse me, a CUNY tech core to help small businesses adopt digital technologies, which we know they need right now during the pandemic, and another recommendation is to expand career and technical education in public schools, which is actually decreased since 2013.. So I invite you to check out the entire plan, those just some of the highlights and recommendations. We make once again with the goal of overhauling our workforce development in the city as a way to build a stronger city for the future, but also make sure we can recover from the pandemic and the economic devastation. That's resulted in right now. In that vein, we've recently announced a cohort of 20 recent CUNY graduates who participate in a six- month, fellowship in our program as a way to kick off and hopefully provide some job placements around that I'll use the rest of my time to share a few pieces of good news from the office one. We were able to return over two million dollars in stolen wages to workers throughout the city across the pandemic, and also 34 new companies from the S P 100 will now announce a publicly disclosed workforce, demographics and diversity statistics that is, after a push from the comptroller's office in my last second, I will give what what is the standard disclosure now that I too will be at the Monday meeting, certainly looking forward to seeing the mayor's plan and what he has in store as this process unfolds and look forward to joining future conversations around that as well, thanks, Luke and now moving on to Matt Green from Speaker, Johnson's, Office and Matt's here with us tonight, because today is Pat Comerford's birthday, so I hope she's having fun somewhere else and is doing fun things so Matt yeah hi thanks Carter hi, everyone, Matt green here with Corey Johnson's office. It is her birthday, so I'm going to do my best to fill in her shoes. We told her she could join via zoom, but you know I think she wants to celebrate her birthday this evening, but just a couple, quick updates from our office. First we're still since the start of the pandemic. Our office has been offering a monthly virtual housing clinic, it's always the second Tuesday of every month, beginning at four o'clock, and so the next one will be on Tuesday November 10th. And if you would like to make an appointment, you can email us at Speaker Johnson at Council period, NYC period Gov next week. We are also for the second year in a row partnering with aid for AIDS we're collecting unused and unexpired medicine for people who lack access to them, and this is going to be taking place on Wednesday October 28th from 12 P.M to 3 P.M at the New York City AIDS memorial park at St Vincent's triangle. So please do come out. We're also going to be giving out some face coverings as well, and it's been a great event over the last two years that we've done this with them. And then I just wanted to touch upon. You know outdoor dining, you know we really appreciate the input and feedback we've gotten so far from both this community board and residents about the legislation. The council did pass legislation last week to extend the current temporary outdoor dining program to September of next year and then beginning in October 2021. The city will begin operating a permanent program to allow restaurants to utilize to utilize the roadway for outdoor dining. So I just want to say this is this is still a work in progress and cory, and our council colleagues want to make sure that moving forward there are procedures in place and we're going to be examining places where businesses are not invited by the regulations and there's going to be a number of city agencies. Studying this current program to design what the permit the permanent program will look like, and the council will continue to look at ways to make sure the city is being responsive to the needs of the restaurants and nearby residents. And you know I do hear questions about the fee and the concern around the propane, storage and I'll try to get some answers back to the board about those questions that were raised earlier. But really you know our goal is to ensure that this is being done in a thoughtful community- minded way that addresses you know legitimate concerns. So you know it is a critically important program to small businesses and restaurants, and we want to make sure that it continues successfully and we're committed to working with the board. To do that. I just wanted to say that and we'll continue this work together and we look forward to doing that and then, as everyone else has said, you know the Soho Noho meeting on Monday. We will be there. We look forward to learning more about this plan. We also have not seen anything yet, but I'm encouraged to hear everyone else who will be participating in that and so with that. Thank you thanks for giving our office the opportunity to give this update thanks. Everyone thanks Matt we've got a couple of questions. The first question is from Susanna Aaron Hey Matt. Thank you so much for being here. I agree with you 100 that our businesses and restaurants need this kind of support right now for open streets, but, as we said to state to Assembly woman, Deborah glick, it's kind of crazy to make a decision now that this program could be permanent. We know that the restaurants need it now. We have no idea what they need in five years and so, in addition to just making the instead of just making the program work better, we feel like, I feel like it needs a huge step in terms of every kind of impact, economic quality of life, environmental, the whole thing: it's not just a question of propane gas tanks. It's not just a question of snow plowing, it's a question! It is a it's a significant policy change for the city and it's not appropriate to just decide that it's permanent before we decide if it's appropriate for it to be permanent, we're all in agreement that this is now a time of uncertainty and we all want to help our businesses, and so it's great that it's extended till next September, but going after that is a much more problematic and completely different argument. Thank you thanks. Susanna thanks. I just want to remind everybody that this is questions not comments. Just so everybody wants to get out and watch the debate tonight. I've gotten a lot of comments from board members, so just want to remind everybody of that Joe thanks and Matt. Thanks for being here, I just had a procedural question, so the legislation that was just passed last week extends it to the end of September. Will it require new city legislation to make it permanent, or is that somehow baked into the legislation that was just passed? I do not know the answer to that so, but I can check and get back to you thanks. So much thanks, Joe Cormac, we lost Cormac. No. My question was that my question was asked so I'll. Just listen great thanks, ritu hi. My question is with regards to the 15 surcharge that is allowed for takeout and delivery from restaurants. It was meant to be helping restaurants, and what I seem to see is that a bulk of that funding is going to delivery companies such as caviar and doordash and grubhub. Do you know anything about how that money is being collected and disbursed? So I have not heard specifically about how that money is being collected and dispersed. I know you know the City Council did pass a delivery cap fee, but that's not about necessarily how that money is being dispersed. So again, three two. If I could I'm happy to check into that as well and see if I can find more information for you, yeah I'd like some confirmation that money is actually making its way to the restaurants yeah. Absolutely. I have not heard. I have not heard this so, but it is an important thing to to find out. So I will thank you great thanks, Matt and thanks for too and now moving on from Senator Kavanaugh's office, Eliana Cohen hi everyone. I will be very quick. The I want to quickly just talk about housing, the eviction moratorium and its status has become a bit less certain recently, with the governor's recent executive order that he issued on the 28th the there was an extension to protect tenants who might otherwise be subject to eviction orders that predate Covid-19, but it seems that it leaves open the possibility that evictions could resume in cases where tenants do not appear in court and prove that they've been unable to pay their rent because of a Covid-19 hardship, so that, in our view, is definitely concerning and we're working hard to figure out what the best next step should be related to ensuring that folks are able to stay in their houses and in their homes same with everyone else related to Monday's meeting with department of City planning. I will be there feel free to reach out. If you have thoughts or questions. I know there's a lot of uncertainty about that and we're definitely concerning ourselves with what's going on with that, we encourage everyone to vote early and that's all for me right now, great thanks Eliana. I do not see any questions. Bob, Gormley district manager informed me. We missed one person. Lois has a question: Lois go ahead before we move on thanks lianna. We have one question from Lois. Can you hear me? Yes, I was just curious why I live on Thompson and my and Bleecker, and my friends in the West Washington Square Village usually would be doing early voting at Saint Anthony's on Houston and Sullivan, and now we have to go to Madison Park, but people in Washington Street. They go to Saint Anthony's to do early voting. Could you explain that please yeah? I know that is something that we've been speaking with the board of elections about and it is because of the Covid-19 pandemic and just space restrictions since Madison Square Garden is a much larger space. They've just shifted some of the boundaries of the districts where folks are going. To be honest, I'm not sure this was raised. Very recently to our office, and so we're not sure if it's possible to make a change this late, but we're aware of that being frustrating, and certainly we encourage folks to drop their ballots off where it's most convenient for them. You know with or mail them in, if that's more comfortable for you- and I do understand that reason and it's very good to be able to drop off your ballot at any point, as you just expressed that it does not have to be where your site is for early voting, but in my neighborhood, particularly in Washington, Square, village and so on. There are quite another number of elderly with good health. Thank goodness, but to go to Madison. Park is a big effort and it would probably take taxi- or I do not even know how you get to the bus through public transportation from here, and I think it's a great imposition- and I just want to mention that to everyone in the community and get it on record and yeah. That's certainly no yeah. We definitely know, and hopefully in the future, we'll be able to avoid this type of problem. So like determining voting, I just wanted you know. Lois raises a great question. I checked for early voting on Google Maps and it's a 28-minute walk for me to go vote which is kind of hard to understand in New, York, City and Saint Anthony's. Is you know, yeah thanks lois welcome! Thank you, okay and so Bob I was. I was starting to say. Oh I've got another question from rich. It was just to you know just to follow up on what Lois was saying. Just correct me if I'm wrong, but the early voting is really just filling out an absentee ballot right. Is that right or wrong right, because I've heard that when people go to the early voting, they're being handed an absentee ballot which they put in a box, no a lot of people are shaking their heads now. Is it more like voting on the actual day? Yes, okay, good, just clarifying thanks, rich all right. So now, as I was saying, Bob had, let me know that we had missed one public speaker earlier that had submitted everything on time, and so I'm going to allow her to speak and that's Nancy. Paisley Nancy you'll have two minutes to address us. Thank you carter and thank you Bob. I was going to speak on the restaurant situation and I understand that's been more or less laid over. I do not know if Matt green is still on the call. Okay. My concern, I have a lot of concerns and the reopening working group allowed me to express them and I'll do that again. Do not worry, but I want the community board to realize that we are talking about a serious epidemic which is going coming into its second wave and maybe they'll be third and fourth. The restaurants need help. Yes, but the ones that are ignoring the rules, which are meant to keep the epidemic under control are the ones that are going for are crying that they need more money. You can't have both, and I think I think public health is more important, particularly just this. Last week, with the shacks they've been putting up the enclosures of tents that are no longer tents, but are rooms that seem to have 100 occupancy and we'll take this up again when, when we meet again thank you for letting me speak great thanks, Nancy and all right now we're going to move on to the chairs report. Unfortunately, most of my thunder on all these items has been addressed, as is often the case. The first. The first item obviously, is the Soho Noho neighborhood plan. We sent out an email today you heard Gail talk about some of the frustrations. We've had I've heard a lot of frustrations from all the elected officials offices and, frankly, there is no plan because we have not seen it. We've seen one announcement from the mayor, which is a portion of what this plan. Presumably is it's just one small portion, so it's very difficult and I think it's very frustrating for everybody in talking about it, because we do not even know what we're talking about. So you know frankly, nobody even knows if we're supporting something if we're opposing something or if we're trying to you know, modify something. So it's very complicated, and I really I just want to remind people that the meeting on Monday really should be focusing in on city planning and talking to them is this plan is coming from city planning, and you know from what I've heard and from what you guys heard tonight, there's been very little input from our other elected officials. That's been actively solicited by the mayor and we had heard, as you saw Peter put up earlier, there were a lot of steps that they were supposed to take and we're not aware nobody's aware of those steps being taken, and we have not heard any answers yet so we'll as we go forward. We'll hear more on that, I'm going to put just a link to this in the chat. Just so people are, you can link to the plan and the information there. So it's one number two: this month, a number of us were able to meet with captain Spataro who's. The new captain in the sixth Precinct Patricia myself, Joe Bob, Gormley and Mar by video, met with the new captain, and we discussed some of the concerns that we discussed as a board one of the things that came out of that and I think that they were working on it already was that the six Precinct Community council meetings have been restarted and and also the NCO meetings are being are moving forward again, and I believe that they're, taking into consideration trying to have those meetings in outdoor places that are more appropriate. We shared a lot of the concerns. One of the biggest issues that we had was they need to come and let the public know what they're doing and we had invited the captain to our meeting tonight and he had heard he was unable to attend because they were assigned to protest detail. And then we were supposed to have one of the community affairs officers. I was going to come in his place and I do not I'm just checking to make sure I'm not speaking out of turn. I did not see that they had joined us. They had another protest which was occurring in our precinct and so that those were there, but I'm hoping going forward that we'll have representatives from each of the precincts give a brief update during our elected officials report. So just so we're more informed as to what activities are going should also give us an opportunity to ask questions. We used to do that. Our the heads of the four different precincts in our community board have started rotating more frequently than they have in the past. It's every two or three years, and so somewhere it seems that practice had had dropped off and so we're looking to looking to restart it and the age of zoom. That should should not be too complicated. I do not know if it'll work too well, but I wanted to put in details on how to join specifically the sixth Precinct Community Council I'll put that in the chat just if people would like to. If you send an email to this email address, you should be added to your mailing list, so you'll be informed going forward, and then I do not know how this will come out. But I'm going to try and put this in this is a link to all the different precincts and on a map in our community board. So people want to look up the specific precincts where they live actually looks like it came out all right, okay and third thing. Next week on Wednesday, there is going to be a see what time it is here from six to eight there's going to be a meeting which we're co- sponsoring eight years after Sandy community- wide discussion on the progress of the big U. Many other community boards have been very active as people know and sort of the Waterfront resiliency efforts. Our community board is bounded entirely on the west side by 9A or West Street and the Hudson river park, and so the issues for us is less of a city issue and more of a state issue. So we have not actually had very much discussions on that, whereas the city has been moving along and so we're hoping that this is going to be the beginning of discussions that we can start having moving forward with the state and the city about looking at resiliency. In our own community board like in the past, the those discussions are going to take place in the in the quality of life committee, as that was combined some time ago with the Environment Committee and those were those discussions traditionally have taken place. So I'm going to put a link to that as well. People look for more information and we should be sending out an email as well about this, and then it's also as Gail had mentioned. The Hudson River Park Trust is going to be restarting the conversations that they were hosting pre- covered with their task force with regards to pier 76 and Pier 40.. So we're looking forward to to hearing more information with that and continuing the discussion and then covered everything and then, last but not least, on Halloween. We have the community board 2 and Nyu children's Halloween parade, that's going to be at 1 o'clock Bob, and I were both going to talk about that. So I'll just leave it at that. I'm going to put a link in the chat that people can share and presumably we're going to be sending out an email at some point with more information about that, and I think that's it. I know we all have things we want to do tonight. So thank you, Bob District, manager's report. Thank you carter. You know, there's a line at the end of a there's, a Richard Linklater movie called before sunrise and there's a line at the end of the movie, where Judy Julie Delby turns to Ethan Hawk and says baby you're going to miss that plane. I think some of us are going to miss the debate tonight, picking up on the children's Halloween parade. So it's going to be done. Virtually we have already sent out a link to it or a flyer we're going to do more of that leading up to it. It's there's going to be a costume contest, musical performances, a magician and all there's, usually about 1300 children who participate when it's live. I do not know how many they'll be on this virtual virtual parade, but they're going to be getting a special greeting from carter. Booth CB2 chair, so that's that's worth attending a few more things I think I mentioned last month, but I want to mention again the sanitation department's Adopt, a basket program and we've gotten a lot of complaints about about baskets, not being overflowing baskets throughout the district and a lot more trash on the street. So we've just I've just barely started kind of reaching out to some of the local businesses, but you're going to start seeing a more aggressive outreach by us to try to enlist some of our businesses, food establishments and other businesses to maybe adopt their corner baskets, to try to help the sanitation department and keep our keep our district cleaner. If anyone lives near West, 3Rd Street, I know lois you're, probably getting these emails, the water main project should just about be done. If it's not interesting, what's that I do? Yes, I'm told that it should be over. It should be totally done by next week. So that's good news and also Lois I'll, just mention to you quickly. I do not know if this is the answer, but as far as those two blocks being asked to do early voting up at Madison, Square Garden, I was talking to someone who's pretty active politically around here, and it was her opinion that she told me a few years ago that electoral district, the number was changed. It's now 90 something and it kind of lumped them in with electoral districts uptown, and it may just be a computer, that's kind of lump lumped in those two blocks with with another portion of Manhattan. It was an era but but an honest one. I guess- and lastly, I just want to refer back to an assembly member glick and Susanna bolt touched on Oprah restaurants and some of the some of the issues there there's another one that I do not think either one of them mentioned, but that the fire department has mentioned in some of my meetings. They have great concerns about them. You know navigating some of the narrower streets. You know that have build outs on them, either turning onto the blocks or just driving down the street. So that's another issue that the city really needs to consider sooner rather than later. That's all I've got. Thank you any questions, great thanks, Bob I cormack. I see. You've got your hand up. Yes, I just in the form of a question Bob. I wanted to ask you if what you're implying is that your idea of a properly spooky and disturbing Halloween is a personal greeting from Committee Board to Chair Carter booth read into it, read into it what you will thanks, cormac, all right, so moving on carter is your costume, a surprise? It's going to be a surprise, so now we're going to move on to our business session and we're going to start at some point. I we should start with with attendance. I believe, since we do not take our first vote so Valerie, do we want to do a quick attendance great thanks, great thanks Carter, let's go Susannah Aaron here Akilah as Queen. I saw her on the call earlier. Thank you. I also realized people may have dropped off for the debate. Thank you. I got you William Banesh here Keane Burger, here Carter Booth Katie Bordenaro here. Did you hear me Amy Brenna here rich cacapullo, here, ritu Chauchi, Dear, Coral Dawson. Here thanks, I'm here: John Paul, De Verna, here Doris Ether, Air, Robert, Ealy, Zillier, Mark Fitzgerald here for Max play here: Joseph Gallagher, here, Susan Gammy, here David Gruber, here Wayne Cawadler, here who's intent here, janine Kylie, here, Betty Kobovi Weiss, here Patricia Laria, here Michael Levine, Peter, Janet Leff. She left early, remember and Matt Metzger here, Daniel Miller, here, Brian Pape, I'm here Donna Raftery, yeah, Lois rakoff, I'm here Bo Riccobono, here Robin Rostin, here, Sandy Russo, here Rocio sands, here Godzartiano yeah, Shirley, Secunda, yeah, Kristen Shea, here Rodrika Seagull, ew, Georgia, Silvera Siemens, here Dr Shirley, Smith, Chanel Spence, here Kathy Sullivan. I saw her earlier eugene you here: Susan Wittenberg, yeah, Anthony, Wong here and Adam Zelda. Thank you thanks Valerie and now, as you guys remember from last month or if not we're now moving into the nomination of officers. So after last month's full board meeting, there was three weeks that people could self- nominate and make their submissions to to district manager gormley for all positions, and then after that was closed, there'd be nominations from the floor, so I'm going to start off with a report from Bob. As far as self nominations: Bob, you're, muted Bob, my apologies- there were five self nominations: carter booth nominated himself for Chair, Susan, Kent, the second Vice Chair Valerie De, La, Rosa, Secretary, Amy, Brenner assistant Secretary and Anthony Wong Treasurer. That's it okay, great! So now we're going to move on to nominations from the floor. So I'm going to open up the nominations for for all the positions, I'm going to go through each position and and then at the end, we'll close the nomination. So the first position is for chair there, any other additional nominations. Okay, I do not see any hands that are raised for first vice chair. Are there any nominations from the floor issues? The first last year I nominated okay Dan. Do you accept the nomination? Okay? Are there any other nominations for first vice chair? Okay, seeing none we're going to move on to second vice chair: are there any additional nominations? Susan Kent's currently nominated self- nominated okay. I do not see any additional nominations for second vice chair moving on to secretary, we have one self nomination from Valerie De La Rosa. Are there any additional nominations from the floor? Okay, seeing none we're going to move on to assistant secretary. We have one self nomination from Amy Brenna. Are there any additional nominations? Okay, seeing none moving on to treasure. We have one self nomination from Anthony Wong. Are there any additional nominations? Okay, and before I close the nominations, there's nobody else who wants to make any nominations: correct, okay, so the we're going to close the nomination. So currently the positions that for chairs Carter booth myself. First vice chair is Dan Miller, Second, Vice, Chair, Susan, Kent, Secretaries, Valerie, De, La, Rosa, Assistant, secretaries, Amy, Brenna and treasurer's Anthony Wong. Those are the people. Who've been nominated, okay, so moving on, so the election will be next month and moving on now we have the approval of the September minutes, which I believe Bob you had distributed via email to the board members. Yes, is there a motion to approve the September minutes? I see emotion. Susan has her hand up janine. Second, okay, I'm going to do this as a quick voice vote, since we just did attendance and- and we will count the opposing votes, so all those in favor, aye, okay, so we're done with the eyes opposed okay. I do not hear anybody opposed abstentions, recusals, okay, do not hear anything all right, so the September minutes are approved. Now. Moving on to the standing committee reports, First committee is Landmarks public aesthetics. We have four the first one of which was withdrawn by the Landmarks Commission, because it was for a sign painted on a wall that the applicant does not own. It's the next door, building 81 Horatio Street, the application replaced all one of the front facade. We recommended denial because the windows are not historic, even an appearance and especially their tilt in windows to open, and they destroy the look of the facade when they're in the open position. There are other solutions, one owned on Bank Street to construct a rooftop edition of rear yards. You will see that the vote was evenly divided. We just happened to have eight people on the meeting and the opposit it's written as the application was submitted and the opposition is to the the resolution solely on an objection to the modification of the rear facade second floor. That is the floor above the extension which was recommended for approval. That's on the poller floor and the English basement below. So you want to make a motion to I mean we do not have a position on that so well. I can't because I was one of the votes. It's the flow of the chair, of an existing rooftop structure with an adjacent terrace. We recommend approval of the application. I would say that we normally are more are cognizant, we're always cognizant of the neighboring comments and they were numerous, but in this case there's not any material change so far as it affects them and we recommended approval card. If you made a ruling about the tied vote, I did not hear it well hold on a second, so wait. So that was item number three. Did I get that right? It's number four, because the one all right so currently on the floor. Well, yes, number three is the one with the tie. Okay, so currently we have that have been properly introduced. Are items resolutions two four and five, so I think that we should consider those first and then we'll move. We will go back to addressing number three. Does anybody want to call out any items, two, four or five? Okay, as we've done previously? I guess I probably should have started off saying this I'd like to do this as a block vote, so that we can just start moving items into an omnibus vote that we can vote on at the end, people can vote differently on individual items. Should the need arise and if anybody would like to vote on a specific item out just individually on the item, anybody can call that out and we can do that. But right now is there any objection to moving items two four and five into the omnibus vote. Okay, I do not see any objections to doing that. So now we'll go back. We have an item that was presented at the committee meeting, but we do not have a resolution. There is a draft of language. That's before us. I believe that it needs a conclusion. Is there anybody who'd like to put forward a resolution using that language with a conclusion if we want, if we want to take a position here, okay, Sandy, you have your hand up, you're, muted, Sandy yeah. I do I'm just concerned about the time it's 8:33 and I intend to watch the debate. So I think this meeting will if we follow our usual course we'll go beyond that. So, rather than do something at the last minute, maybe we should have a plan to hear just a few of the committee reports vote on those, and I do not know do the others or something you know you raise a really good point. I mean it's, it would take longer if we do the individual votes, because we need to record each of the votes and to know how each member has voted on them. So I understood I I'm not three minutes to nine, but by not being able to see anybody, I mean I think we can move through this pretty quickly. Okay, to do this, we need somebody to introduce a yes or no on item number three in the Landmarks committee. I guess it's written here as it's that it's approved is that is that what does anybody want to recommend that? That's that that's what we consider Susanna. I think that we should consider the resolution as written and we can turn it down it's written improperly because it's a tie vote, but I do not have an answer. Do you have a motion? To put you put it? You want to put that on the floor. I'm sorry, yes, I'll! Put that on the floor. Is there a second to put that on the floor I'll? Second, it okay, so is any oppo and do a quick voice. Was anybody opposed to considering this favor everybody assumes in favor? Okay? So we're going to consider this women I'd. Excuse me sadie, yes, katie. Would you like to discuss just in one sentence, explain his objection again, I'm trying to look at the pictures, I'm trying to understand his objection. Okay, the objection is to for two reasons. The first objection is our precedent is to, above any extension, preserve the original facade in this case it was long ago rebuilt, but in the original historic configuration the the second objection is much the same, that the existing condition would be altered, yeah and, in our view incorrectly- and this has been almost invariably the view of the commission. Okay, so you it should not. Your objection is in line with the historic with the pattern of the commission with preserving the historic configuration of the rear facade. Thank you. Thank you enough landmarks. President. Thank you. Okay, is there any objection to moving the resolution into the omnibus bill as it is written? Okay? Seeing no objection we'll move that in well, I want to vote against it carter, so I'll mention the number again. Okay. Thank you. Do that all right now we're moving next, the SLA licensing committee for the first report. Okay, I'll take the first one 14 applications. Five of them were heard. All the decisions were unanimous. The first one Cato wine, temperance wine, Bar 3840 Carmine Street- was a new tavern wine. That was a denial unanimous primarily because there was a backyard area associated with it that we did not have a permit for such use. They were given the opportunity to remove the rear yard and chose not to do so. The second one was management crop Circle, 126, Mcdougall, Street, new restaurant wine, and that was a deny unless unanimous third one up 51 upside pizza, 51, Spring, Street, tavern wine. That also was a deny unless unanimous steam, Shanghai 476Th Avenue restaurant wine Deny. Unless unanimous and la Passong Rouge was a op corporate change. The majority interest Holder purchased the outstanding the minority interest. No change in method of operation deny, unless unanimous just want to say we were all happy to see them. That's it and then you had items six through 14 layover withdrawals, great okay. Does anybody want to call out any of these items? I do not I'm not seeing anybody hutter. I just have a quick question. Can you please describe what you mean the definition of a playful modern wine bar? What does playful modern wine bar mean? It was a modern design that was their description of it. So modern design wines by the glass fancy wines by the glass playful. I'm talking about playful. What does that mean? Who knows who knows who knows it means not stuffy up title I mean it was not like. It was designed very modern and light and fun as opposed to old school dark. I'll just say they had some sort of design boards with sort of 50s 60s sort of looked like swinging sinatra mood. That's all say playful thanks katie any other issues. Does anybody want to call out any of these items? Is there any objections to moving from the first SLA licensing meeting moving items, one through 14 into the omnibus bill? Okay, seeing no objections, we're going to move all those into the omnibus vote, SLA committee meeting number two sure we had 11 applications that we heard I'll just go through the first. The ones that actually were decisions on everything was unanimous. The first one is Mm-130 bowery restaurant dba, capital, 130 bowery. This is a large catering facility. It was a a corporate change type of application. A deny unless, with the consistent stipulations that are currently in place, number two is Corp can be formed by Salima Hadiya 1995, 7Th Avenue. This was a new on- premise, slicker license. The recommendation from the committee was to deny the application number three is papa's Og Dba, Pappas 103,105 mcdougall street. This is the location where a few people submitted and also spoke regarding the rear entrance on mineta street. That was a deny less with extensive stipulations, including stipulations involving Mineta street denying less again unanimous, and that was a an on- premise. Liquor license number four is 178 bleecker cafe a 178 Bleecker street. This is a new on- premise license it's not ever been licensed before the recommendation. The committee was to deny that particular application, and it was unanimous number five, David, Seawell and Michael Ryan knew it would be formed at 131, seventh Avenue south again. This is another location that had not been never had an on- premise license before the recommendation from the committee was to deny the application number six again unanimous number six is Gotham restaurants. This is a new on- premise license. This place has been around for quite a bit. There's a new owner. The stipulations were in place and it was a nine less and then seven through 11 were withdrawals layovers and such thanks Bob Great. Does anybody want to call out any of the items numbers one through eleven wow? Okay, any objection to moving items, one through eleven into the omnibus vote? Okay, we'll move items one through eleven into the omnibus vote: Joe quality of life committee? Yes, this will be so fast. We have two resolutions. The first is for the MOCA workshop and window exhibits that already happened: October 16th, the 18th. The committee recommended approval of the application adopted unanimously and won fyi renewal from 11 on November 23rd 2020 to December 24th 2020, the south village farmers market at sixth avenue between Carmen Carmine, Street and West 3Rd Street, and the committee recommends approval of this renewal application and that's adopted unanimously. That's it okay! Great! Does anybody want to call out either of those two items? Okay, seeing nobody? Is there any objection to moving items, one and two from quality of life into on the bus vote? Saying no objections we'll do that and now moving on to the traffic and Transportation Committee Shirley? Okay, so we had two resolutions. There was one abstention in each case. The only reason we had the extension was because one of our members was unable to show up earlier, so you can vote on what they did not understand. The first resolution was in responsible requests to remove the temporary bus stop inside of 260 Hudson street, and we have no objection. That's really, basically it and we're simply asking that they put back the permanent bus, stop in front of 350 Hudson street as soon as they are finished. With the construction there, which is the disney campus and but I think, there's no, it's just oh yeah and we're asking also do you put a loading zone in 2250.? That's the street because there's an awful lot of taxi Hv activity. Maybe so that's one and then the second reason in response to rebels is it rebel, yeah, Israel, rebels, Presentation on their new safety plan, which they've been working out with Vo2. I just want to tell you that ritu has suggested a couple of changes, just friendly amendments which just tighten this up a little bit. I think that we were a little jovial about the whole thing. I think that now that there has been another killing by rebel uptown, we're just tightening up the language a little bit, and let me just see if I can just summarize it's just in the first, therefore be it resolved. It removes is encouraged to learn that and replaces it with strongly encourages Revel to further develop a multi- faceted program and then a program to promote safety of both rebel users and the public, as well as protocols to further rebel user understanding and compliance, and continue to work with DOT and monitoring the program and exploring further enhancements, and I will send that language off to Valerie. Thank you great yeah and then the other one is we're asking them to extend their training program to have a mandatory supplemental in- person, lessons which they do not have now, so the drivers really are not prepared, and I think that's about it and they're asking them also to incorporate state- of-, the-, art, computer vision, ai technology, the crack riders use of helmets throughout the entire road as quickly as possible, and that's really the basic. I actually would like to call that one out. Okay or maybe I should ask a question before before Suzanne: do you want to just ask the question quickly, I'm just curious, and especially in light of the killing, why you did not also have a result. Have a therefore that says that they should cease operations until they have a better track record. Well, if you would like to offer a family when you have to go down the bus, because that had not happened when we had our meeting, I would. I would like to offer an amendment that says that, in addition to all of the safety recommendations, you make that they once again cease operations until they can develop a strong track record of safety right. How are they going to just as a question is a question: how are they going to develop a track record of safety if they're not operating? I'm sorry, I should specify that they can't that their track record should be examined, but they did cease operations because of because of it was they're dangerous, and I think that they should cease operations until they can find a mechanism that ensures that they can be safe. You know that's a really difficult one. I think we like to see that happen and if you look at the resolution, basically was talking about how they have to improve that whole safety agenda, and I think that if you could suggest something to make it safer or to add to that safety agenda, that might experience it more explain from the message more than just saying, go back to the drawing board, because what we are saying is maybe you could add an additional. Therefore, given given the recent death of a pedestrian by a Revel rider, we also suggest- and if you could just put in any kind of language that you would want to add as an additional, therefore yeah. But what would you want to suggest we all? We also suggest that you examine further approaches to ensuring safety. I do not want to take up a lot of time here. I just think that they are dangerous and it's really nice for them to say that they're going to do all these nice things but they're dangerous, and I kind of feel that message needs to be very I mean they have had to just to seize their operations because they were dangerous and they are still dangerous. So I do not know why we should be okay with them. You know continuing their operations. Okay, I've got a lot of comments here, so I just the interest of time. If people can be expedient, I mean this not that I want to have the conversation, but just let's move along coral. My comment would just be this. I mean it does not seem like the actual scooter is dangerous. It's that people are not being licensed or are not equipped to well ride them or not in the right capacity. So I think, as an operator, the only way they could do that we could recommend would be say, and I would imagine that they already have this, and please tell me Shirley if you reviewed this already have some sort of writer saying you can die using this and they have to sign that when they actually get the bike. Yeah I mean there's I mean they literally there's nothing that they can do to make sure a drunk person does not take the bike Carl, it does say in there that we recommend the training, which is where that that's it. I do not think there's anything else. You can do it's not. The vehicle is not dangerous, it's the writer being impaired or not managing it. Well, that is the risk. That's like saying a bike rider by the way that it was Revel was the one it was not that they were made to seize operation. They chose to seize operations so that they could. No, I agree, that's why I'm saying just to Susanna's comment like a bike rider can get killed too. It's you know the things happen. You can't say you have to cease operations, because you know somebody is it's not the. If the bike blows up, it's a different thing. Okay, I just do not think that we need to do an over level of I I'm comfortable with what you've done as a committee. So just as a thank you carl, this is a point, so you did not accept that amendment Correct Shirley, right, okay, so that should answer Cormac. That should answer your question and I do not hear any other motion about putting that forward is unfriendly, so Bob ely yeah, my only suggestion I'm going to have trouble with this resolution myself, but it does even though it is for safety, there's a there's, a concern that perhaps we're anyway. I have a hard I'm going to have a hard time with this one, but my suggestion is that maybe go back to committee since we had such an incident occur. I do not know if there's a rush to get this done. It's just my suggestion. You can take it or leave it. Thank you thanks Bob Frederica yeah. What if we have them, cease operations until they've implemented all the suggestions in the reza? Oh, that's kind of a thought. That's I like that yeah I mean. I think that that's a that's a significant change, so I it's all substantively altering the existing resolution, so I just put that out there. I would like to second Bob's recommendation, bring it back to committee. I am on the committee. I think it does need further investigation yeah. I was going to say that I have no objections to having you come back to committee, so let me know just a little more okay, so we're going to we're going to vote on sending this back to the committee is that is that correct, okay and I- and I also think you know Shirley just so everybody knows there were questions about the person who's killed and why it was not reported until three weeks after the fact you know- and I think that that's a really important thing- that they were supposed to be so transparent this time out, yeah. So that's right, that's exactly right! So I think there's more information before we take a possession. All right, so is there any objection to having a substitute position on that to send it back to the committee? Okay, I do not see any objections to that, so that was item number two in traffic and transportation, just from my notes and then last but not least, we're moving on to from the executive committee, I'm actually going to have Bob quickly, intro. This is on our capital, budget requests and and our expense budget requests for fiscal year. 2022 and Bob. I see it says 2021 on the expense side which I'm assuming is an error. That is an error, so I'll just say quickly. The so the city asks community boards to select up to 25 capital budget project requests. We only have 15, so we're not going to we'll have no problem fitting under the cap. The order that was selected, the first ten anyway, were selected by the after some debate with by the executive committee. I'm sorry, I made a mistake, the capital budget we can do up to 40, but we only have 15. it's the expense budgets where we're limited to 25.. We actually have over 50.. So so there was, there was some difficulty getting, I guess, selecting the first 20 or 25. What I will say, though, is when I submit them to this every year to the city I can I'm allowed to enter as many as we have last year. They left they. We had 40 something and they included all of them the year before they just cut it off at 25. So that's just I'm just telling you that if you know once we get to the point where we post them on the website, if you only see 25 it's because they just locked it off after 25, but there's not much more. For me to say carter except you know, discuss yeah. No, I just wanted you to explain that as we discussed all right. So what we're going to put forward is first, we can discuss. Is the capital budget requests for fiscal year 2022? As you can see in the report, I'm not going to read through them. There's items 1 through 15, and then we have a positions on continuing support for a number of different items. Is there anybody who'd like to discuss any of those items? We spent a lot of time discussing them at exec, okay, I do not see any anybody's hands up, so I'm going to take it that we're okay with this is as it's presented for the capital budget requests for fiscal year 2022 and then we're going to move on to the expense budget request for, and this needs to be corrected to be fiscal year 2022 and there we have items one through 52.. So anybody who'd like to raise any issues with items 1 through 52 in the ordering or me- oh, surely yeah, but the simple ones they're traffic ones. I just realized looking at a couple of them that things that were priorities before on are not as much priorities as other ones now, so I would just like to switch number 16 with number 38 and then number 32 with number 44.. They would be the same request, but I think okay, I think that I think that these we had ordered these from each committee going in so that it was not lumped committee and the ordering after the top ones does not really make much difference, and so they were just rotated through by the committee's number one choice: the committee's number two choice: three choice for each committee, so just to disperse them evenly through there, so that can. I would like to see if you wanted this for me, the other ones make more presidents, you wanted to move switch 38 with 16, yes, 38 16, and then what was the second one and 32 with 44.? That's all 32 with 44. yeah, okay, Valerie did you? Do you have those yep? I got that and I also got the FY 21 versus 22. I'll fix. That was me. Okay. Is there anybody else like to call out any other items? Okay, I do not see any any hands. Is there any objection to moving the budget priority of the two items into the omnibus vote? I do not see any objection. Okay, so now we're going to move on to the omnibus vote, I'm going to call out the we're doing pretty good here right, I'm going to just call those out. So first we have the Landmarks committee meeting so we're going to be voting on items. Two three four and five item number three: if you, if that was the one that had questions katie, just so we'll note when you're voting, you can just reference the landmarks item and Valerie will know which one it is for the SLA licensing items. We have items 1 through 14 on the first committee meeting and items 1 through 11 on the second. So for those resolutions are included the quality of life, we have items one and two for traffic and transportation. We have items one and two which was substituted to send back to the committee and then for the executive committee. We have the budget priorities which are for both the capital and the expense capital and the expense priorities to everybody. Okay, I'm voting. Everybody understands what we're voting on okay, so we're going to start with the roll call vote, Valerie Sure, Susannah Aaron. I yes Carter booth, yes Katie, bordenaro, yes, but no on number three of landmarks. Thank you! Amy brenna, Rich cacapullo! Yes, ritu chauchi! Yes, coral dawson! Yes, I'm a yes John, Paul, De Verna, yes, Doris Dieser; yes, Bob ely; yes, Mark, Fitzgerald, Cormac Flynn; yes, Joseph Gallagher; yes, Susan Gammy; yes, David, Gruber, Yes, Wayne, Kawadler; yes, Susan Kent, yes, Janine, Kylie, Yes, Betty Kaboby weiss; yes, Patricia, Laria! Yes, okay! Mar! I see you as a yes. I just saw the chat come through Michael Levine, yes and Matt Metzger, yes, Daniel Miller; yes, Brian Pape; yes, Donna Raftery; yes, Lois Rackhoff; yes, Bo, Riccobono, Robin, Rothstein, okay, yes, Sandy, Russo, Rocio sans, yes, except I like to object to SLA number two, the language in some of the language. So therefore I will abstain from that vote. Okay, you're going to have staying on number two on 95, seventh Avenue Salima Dia. I object to the language in it and I do not want to have my name associated with that resolution. Sorry, it's! Okay! What's the name of it again: Salima Hadiya, 95, 7th avenue south SLA number. Two! Thank you! You're welcome! Godzertiano! Yes, Shirley Secunda, yes, Kristen shay, yes to all Frederica Siegel yep, that's a yes; okay, yes Georgia Silvera Siemens, yes, Chanel Spence, yes, on all except landmarks: three, a no on landmarks: three Okay Kathy Sullivan, yes, Store eugene, you, yes, Susan, Whittenburn, Anthony, Wong, Adam, Zeldin, yes, Sir, yes, Sir is that Anthony and Adam? Yes, okay, just making sure, because the pictures sometimes do not show up okay, so that is 40 42, oh Susan! Yes, Susan did you have you. I said I made a mistake. I had said yes, okay, thank you, okay! So that's for the Omnibus vote, 43 4, with the exception of a no or Ag and against on landmarks number: three by Katie Bordenaro, a abstention on number resolution number two on SLA number, two 95 7th avenue by Rocio sands and a no on landmarks by Chanel, Spence, Landmarks number: three: okay did everybody? Everybody had their vote, counted, there's! No, no issues with that. I got married and I got Mar and Susan. So I think I think the others that did not answer probably had left for the debate. Great, I think Sandy Susan. I think we're in good shape right. We it's 904, so hopefully we did not miss too much. Thank you, everybody and we'll look forward to seeing you. Thank you thanks. Everybody. Thank you. Thank you. Everyone Buddy, I do want to say very good. You.",
            "summary": "They feel parents and perhaps educators, feel that they would be better positioned and would like to have greater flexibility in order to ensure that we have 41, it could have been three and we'll meet with them in the coming week, or so I would say, probably after election day and to figure out I mean the Department of education is impossible to deal with.\nSo that being said, I again remind people, we do not want to be outshone by other states that have had enormous response to early voting Thank you very much and everybody stay safe, Thank.\nI, think the city Council, as I said, two- thirds, are going to be term, limited and half of them are running for other offices, and I.\nReopening working group did meet this month and the plan was to pass a resolution, but Valerie De, La Rosa, the chair of the committee.\nLet me know that the we did not actually have the actual legislation at the time of the hearing, and so the committee would like have another opportunity to meet and further discuss some of the other details so that we can more appropriately comment on the legislation.\nThe only thing I do know was that they would have to have a permit from the fire department relative to their use of propane, but I still think that they also talked about it being secured outside of the city where the propane is stored in a locked box.\nMy question to you is pretty much knowing that at 25 occupancy, almost no restaurant can survive and all over the country I believe that the that we should be driven by science I think that in most places at this point in the city, except for some hot spots, we have maintained a very positive low, positivity rate, a very reasonable low, positivity rate, and so the safety You know.\nSo I see Martina, you have your hand up, but we're not going to entertain your questions just like when we're meeting regularly in person, As I mentioned before, we're not going to be considering the reopening working groups resolution on outdoor dining.\nThat's come out, so Dan Miller is going to our first vice chair is going to run the public session If you are going to be speaking about outdoor dining, just know that you're going to have another chance down the line, the valerie who's, our chair of the reopening working group, is holding potentially another meeting on November 9th.\nSo I would just like to put forward these two items from the Soho Noho recommendations which folks might want to hear about next Monday.\nIt's, eight bullet points of information and items that needed attention before we could do a scoping, so maybe city planning has done all this work.\nHe agrees and wants to support outdoor dining, and he says that none of the residents dislike the idea or intent of the restaurant.\nRestaurant workers keep us going, especially during the pandemic, from old school sevilla, to Lartussi, to corner Bistro, to tavern on Jane, where everybody knows your name I personally, officiated two different weddings of West Village restaurant employees.\nI want to talk about the mayor's upcoming Soho Noho neighborhood plan meeting on October 26th.\nIt looks like the Soho naho envision planning process is being fast- tracked, and the promises made by some elected officials that community input was essential, have been broken.\nSo corporate developers infiltrated the previously quaint neighborhood lined with architecturally beautiful buildings to make it appear that all the residents in Soho were entitled and wealthy, and let's look at what these corporate developers in the city of New York want to do, instead of the city working to find already existing, truly affordable residential units and working to support the small one, I'm afraid.\nSo it's complicated, but at least something small that we certainly advocated for the biggest issue, is Soho Noho I know: November we're going to plan a couple of our task force meetings to go through what we put down in terms of the planning, the booklet , that pete just showed you and we will go through whatever we can, because I know, there's a scoping session planned for December, 3rd.\nThe police department is asking that somebody look at like some 20 agencies that work with our streets.\nSo two community boards are going to be on the agenda to start planning for those two sections: we're trying hard to find a place for the pound police pound to go and, of course, pier 40.\nBut you hear the challenges you know them, I'm, obviously not in your area, but dealing with the homeless and seem like every other community.\nAnd I am finding that in, for instance, district, not the single adults,, I think we've done about half everything, every single provider and asking what you just asked me and what we're finding, although I'm going to finish it Is the following: People have devices generally in the shelters, but guess what your device does not work.\nYou know business to bounce back and all our problems to be solved just when the pandemic, passes, and I do think that outdoor dining provides a phenomenal benefit.\nI live on the up west side, but my entire area is filled with restaurants, and I, quite like the fact that when I walk home from the subway at 11 o'clock at night or 10:30 that there's people outside and there's activity, Please do think about.\nAnd I own and operate two bar restaurants in our community, the spaniard on West, Fourth and barrow, and will finale and West fourth and Seventh Avenue South And I've lived and worked in our neighborhood for over 12 years.\nI love it and I want to speak strongly in favor of the outdoor dining first year as a resident and a member of the community.\nI think the outdoor dining has been a big part of bringing life and safety back to the streets.\nWe're as restaurant owners adapting to these rules every week they throw different rules at us, so I hope they also throw a little bit more oversight on it as we go forward, but as a whole, I think it's been an overwhelming positive impact on the life Thank.\nI think the second concern is around the map that came around with this plan, which looked like to us.\nYou know our street has been effectively bought up by reits over the past 10 years and is now largely controlled by wreaths and not, and not the residents, and I think my biggest concern is the area.\nIn response to the Broadway League's announcement that Broadway productions are going to remain suspended until at least may 30th, I'm urging you know, support for Senator, Schumer's legislation on immediate federal relief and in the absence of that state funding, nearly 100,000 new yorkers rely on Broadway for their incomes, a lot of those good labor jobs and.\nThis is like kind of city planning that is doing this, not the council member's office.\nExcuse me, a CUNY tech core to help small businesses adopt digital technologies, which we know they need right now during the pandemic, and another recommendation is to expand career and technical education in public schools, which is actually decreased.\nStatistics that is, after a push from the comptroller's office in my last second, I, will give what what is the standard disclosure now that I too will be at the Monday meeting, certainly looking forward to seeing the mayor's plan and what he has in store as this process unfolds and look forward to joining future conversations around that as well, thanks, Luke and now moving on to Matt Green from Speaker, Johnson's, Office and Matt's here with us tonight, because today is Pat, Comerford's, birthday, so Matt green here with Corey Johnson's office.\nWe are also for the second year in a row partnering with aid for AIDS we're collecting unused and unexpired medicine for people who lack access to them, and this is going to be taking place on Wednesday October 28th from 12 P.M to 3 P.M at the New York City AIDS memorial park at St, Vincent's triangle.\nLike, and the council will continue to look at ways to make sure the city is being responsive to the needs of the restaurants and nearby residents.\nYou know, I do hear questions about the fee and the concern around the propane, storage and You know it is a critically important program to small businesses and restaurants, and we want to make sure that it continues successfully And we're committed to working with the board.\nSo that, in our view, is definitely concerning and we're working hard to figure out what the best next step should be related to ensuring that folks are able to stay in their houses and in their homes same with everyone else related to Monday's meeting with department of City planning.\nWhat's going on with that, we encourage everyone to vote early and that's all for me right, now, great thanks, Eliana.\nWhy I live on Thompson and my and Bleecker, and my friends in the West Washington Square Village, usually would be doing early voting at Saint Anthony's on Houston and Sullivan, and now we have to go to Madison Park, but people in Washington Street.\nOr I do not even know how you get to the bus through public transportation from here, So like determining voting, I just wanted you know.\nDo, not worry, but I want the community board to realize that we are talking about a serious epidemic which is going coming into its second wave.\nSo, it's very complicated, and I, really I just want to remind people that the meeting on Monday really should be focusing in on city planning and talking to them.\nSpecifically the sixth Precinct Community Council Actually looks like it came out all right, okay and third thing.\nI wanted to ask you if what you're implying is that your idea of a properly spooky and disturbing Halloween is a personal greeting from Committee Board to Chair Carter booth read into it, read into it what you will thanks, cormac, all right, I believe, since we do not take our first vote so Valerie.\nJohn Paul, De Verna, here, Doris Ether, Air, Robert, Ealy, Zillier, Mark Fitzgerald here for Max play here: After last month's full board meeting, there was three weeks that people could self- nominate and make their submissions to to district manager gormley for all positions, and then after that was closed, there'd be nominations from the floor, so I'm going to start off with a report from Bob. My apologies, there were five self nominations: carter booth nominated himself for Chair, Susan, Kent, the second Vice Chair Valerie De, La, Rosa, Secretary, Amy, Brenner assistant Secretary and Anthony Wong, Treasurer.\nSo I think that we should consider those first I probably should have started off saying this I'd like to do this as a block vote, so that we can just start moving items into an omnibus vote that we can vote on at the end.\nOkay, seeing no objections, we're going to move all those into the omnibus vote.\nSLA committee meeting number two sure we had 11 applications that we heard I'll just go through the first.\nSo let me know We're going to vote on sending this back to the committee."
        }
    }
}