{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "title": "Small Business Committee Meeting",
            "publishDate": "2020-12-11",
            "shortDescription": "",
            "lengthSeconds": "1:30:20"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "FvAOhNg1mJM",
            "fillerWordCount": {
                "uh": 196,
                "um": 215
            },
            "readTimeFullTranscript": "58 min read",
            "readTimeSummary": "8 min read",
            "wordCountFullTranscript": {
                "businesses": 58,
                "stores": 44,
                "business": 38,
                "store": 31,
                "food": 26,
                "idea": 23,
                "neighborhood": 21,
                "website": 21,
                "holiday": 15,
                "ideas": 15
            },
            "wordCountSummary": {
                "businesses": 26,
                "stores": 14,
                "idea": 8,
                "neighborhood": 6,
                "business": 5,
                "staff": 5,
                "holiday": 4,
                "opportunities": 4,
                "hospital": 4,
                "pandemic": 3
            },
            "fullTranscript": "Thanks for muting me, it's too late, it is 6:30, I, don't know if you and Alita want to wait a couple more moments or yeah. Let's the numbers started going up, it's like being playing in a jackpot game. If they like roll up Julie, you do not look like you're in your car. Let's see if we hit 20 in the next 15 seconds and then we'll speed off and in the meantime, I just want to say: hi Matt, Bauer, Hey, Matt how's it going. No, it's going all right. It's going all right! Thank you. No had a big event on Saturday, which one which, when as well as could be considering it bad weather, but no all. Okay! Thank you. This is so nice I, finally get to put faces to so many names that I've been talking to over the phone over the last couple weeks. Good, oh two away from our let's see put it put us on the timer will put us on I will just tell you that it looks like everybody who has signed up on the sign-in sheet. Has hello signed in okay, then 18 is our lucky number tonight. So I want to welcome you good evening. I'm Valerie Mason I want to welcome you to the December meeting of the small Business committee. I guess I want to start off first with an apology, because when I traded dates with another member of the community board, I did not realize that tonight was a religious holiday. So I wanted to apologize, for that. Can I interrupt Valerie to say that 18 is I. Think as a symbolic has symbolic significance in the gym: okay, good, it's the high right, yeah, yes or multiples of eight. Yes, exactly so I appreciate everyone joining in. As everyone knows, small business is a very hot issue in our community all over the country. Small businesses are struggling everywhere, and this community especially, has always been interested in preserving and growing our small business, and so we didn't want to miss a meeting in December and it was. This was the only other date. The second thing I want to do is introduce my new co-chair, who is Elita, Camp and well known to everyone, as the current president of the community board, soon to be at the end of her term, and she has graciously I would say very enthusiastically volunteered to be a co-chair of this committee. She, too is very interested in small business in the community and growing it and I also wanted to say in that regard, a special thank you to our retiring, co-chair, Sarah, Chu, who's done an amazing job over these last years and I know Sarah is going to participate, but due to all the balls that she has in the air she really as much as she didn't really want to resign and retire. She had to so I really appreciate her holding down the fort for so many years on this committee. So without further ado, I want to go to tonight's featured speaker, who is Julie Blenbaum, Mark Beachy and a member of our community who started a an effort, called save our stores and I'm not going to say anything more than that I think it's a great idea and I want her to talk about her own idea. What she's doing in our community go ahead? Julie I'll, throw it open to you. Thank you, Valerie! Well, I want to thank both you and Elita for having me here today. For this meeting and I know. This is an issue that is near and dear to all of your hearts. I can tell you personally, I was born and raised on the Upper East side went to school here, you know, went to college elsewhere and disappeared for a few years and then made it back and have started a family here and I know that this pandemic has, you know, hit New, York, City quite hard and small businesses as well. For me, I was here throughout the pandemic, and so we watched the evolution as it went on from the closures and everything else, but believe it or not when it hit home the most. For me after was when everything started reopening and that was after labor day and in early November I found myself driving up. Third Avenue with my family in the car and I was just looking to the left and looking to the right and just empty storefront after empty storefront, and it really broke my heart, and you know one of the things that really made me think twice was you know you look at the pandemic and you look how hard it's hit the community, but also the incentives it's created for us to rely on Amazon and I know. If you look at my personal credit card bill, it's literally just Amazon and driving up Third Avenue and seeing all those empty store fronts I had to ask myself, you know, am I personally responsible for this in a certain way. Are people like me responsible who have you know really come to rely on online purchases, especially in a time of pandemic when we're so averse to actually going into stores, and so I said, someone's got to do something about this, and basically, what came out of it was an idea to really start initiative to change, hearts and minds around the neighborhood and to really make people aware of not just the closures but of the fact that we have an obligation as a community and an opportunity to really support our neighbors, especially as the holiday season and all the shopping that comes along with it begins, and so the way this idea manifested itself we've called it shop, Ues, Shop, Upper, East, side save our stores is really in a couple ways. First off I decided to put together a website shop ues.com because me personally, I've grown up in this neighborhood. I've lived in most of my life and to tell you the truth when it comes to where I might get housewares. Okay, so I know the places that are within a five block radius of me, but I've never heard of S Feldman Housewares on 92nd Street and they deliver, and there are so many amazing stores- and so many amazing- it's not just the stores. But it's the fact that these retailers have gone so far out of their way to create opportunities for us to shop and so both the opportunity, the obligation, but also the idea that there are safe ways to shop. These stores was an imperative to really communicate to people so in building out the website. It's both a directory for Upper, East, side, small businesses and we list everything from jewelry stores to housewares to clothing children's toys. Everything you can imagine, and the idea is both to be a resource both to give people an opportunity to peruse, what's actually here in the neighborhood, to provide phone numbers for them to provide links, because a lot of these stores actually provide online opportunities as well and to really give them the inspiration as they head into the holiday shopping season and the access. Now. That was a very big project under in and of itself building the website I actually bought a list, so straw had some place to start, at least in terms of the research, but what I found in actually going through that list was that so many of the stores have closed, and that was a ton of the research it wasn't finding the stores it was actually going through the list of stores that existed on the Upper East side and seeing what was still around believe it or not. I mean it's not a scientific number, but I'd say almost 30 percent of the stores on the list that I purchased in November had closed, and so the website I think, is a very important component. You know providing that resource for people to actually see what's available and see just the tremendous variety of stores in our neighborhood, but I also thought that we needed a mechanism to really showcase a lot of the items, give people gift ideas, and so we launched a presence on Instagram, which is also mirrored on Facebook, to highlight a lot of these shopping ideas. So, whether it's going store by store and highlighting some of the great gifts that they have, we did a piece on secret, Santa gifts under 25. We did a piece on Hanukkah different places where you can go to get your lot cause you're, catering, your holiday decor, all that stuff we've done pieces on the toy guide, there's so many phenomenal toy stores in our neighborhood, so not just a guide to where the toy stores are, but also different, toy ideas suggested by these stores for different age groups, and all of that was really meant to again. You know, inspire our neighbors and give them ideas of holiday shopping opportunities in the neighborhood and places to actually buy their toys and also have them delivered. You know one of the things that I think people don't realize today is again how far stores have come and how they've adapted to this environment. That is Covid-19. So many of us don't want to go into stores, especially as the transmission rate increases. So you know part of the inspiration, for this was a store called promises fulfilled I needed a personalized gift. I called up the store and said this is what I had in mind. The owner Karen picked up the phone. She was phenomenal. She said. I have some great ideas. Why don't I text you? Some pictures and you'll get back to me. 90 seconds later she sent me 10 pictures. I said I'll take number one number three numbers and number five I it monogrammed with the name Ava. It was ready in three hours and she asked me if I wanted curbside, pickup or delivery and asked me for my credit card via text. Literally within four minutes, I had completed the entire transaction, the owner could not have been lovelier and I was able to help and to support a neighborhood store and I. Think people don't realize that. Similarly, Mary Arnold toys, a phenomenal toy store, that's been in the neighborhood for decades, I think it's the set it's the oldest toy store now in New, York City. Now that far sports has closed, and you know the people there are phenomenal and they're happy to work with you via phone text or anything else, so I, texted, Kathy and Mary Arnold Toys I, said I'm buying toys for these seven kids. In my family, these ages, these interests she literally sent me 40 pictures of toys, I told her all the ones that I wanted and the next day I have literally bags and bags of toys for every member of our family wrapped and ready to go. And so people need to know that not just online are there opportunities, but there are also store owners and staff members who are delighted to help. So we have the website. We have the social media piece, pushing out different gift ideas and giving us giving our neighbors some inspiration as well, and that's created some momentum. And then it's been a question of how we really spread the message to the community. We've done that a number of ways we have partnered with a number of other instagrammers on the Upper East side you'd be shocked. How many followers people like Upper East side eats, have they have literally 7,000 people on the Upper East side following all their pictures of food, and they they've been phenomenal in helping to spread the word and encourage Support New York One did a piece on Us patch did a piece I'm talking to a reporter. Now from the New York Post synagogues churches, schools from Ps6, Ms, 167, Ramaz Kj have been phenomenal, putting the information in their newsletters and their PTA pieces on their social media sites as well. We've had some phenomenal guest curators and have a couple more coming on board to pick their favorite stores. So we've done a couple. Local social media celebrities and actually Congresswoman Maloney is gonna, be our next guest curator and so for us. It's really a question right now of spreading the word and I. Really, you know trying to make this a priority for all of our friends and neighbors. One more thing, I should add, is we'll see how successful this is, but we actually to I, together with some high schoolers at Ramaz, has started distributing decals for stores to put on their doors or windows for the holiday season, so I know for those of us who've been in the neighborhood for since the early 90s we're familiar with the safe haven decals. That was the inspiration for this. But, to put this, you know, save our stores, shop, ues.com decals in their windows, to really start a campaign and to really create some visibility for it as well. So that's been a key component and we've just started distributing those and speaking to store owners too. So what I would really love to do? Valerie- and this is up to you I- would love to open it up. I would love to take suggestions, ideas, see if the committee has any input. I don't have the corner on wisdom. I. It's been a little bit of on-the-job training, especially learning Instagram marketing. There is a true art to it and I, while I do believe. We have really been able to crack the 20s and 30s seen on social media and Instagram I. Think that there's an entire generation of upper eastsiders that we haven't really broken through with and I think that there are a lot of opportunities for partnership and I would love to open it up to suggestions and questions to the group. If that's okay, before we do that, I didn't know if Lindsay wanted to speak to just see how the interaction has been going with your advocacy and what's been going on so Lindsay. Do you want to introduce yourself and tell us how you came to know Julie and what's been going on, yeah, absolutely hi everybody? My name is Lindsay Pierce and I am the owner of the craft? Studio has been around since the 1994. I did not start it, but I stumbled upon it as a college student looking for another job and I fell in love with it and I pitched to the owner of classes program, and she said I don't want to do this anymore, so at 21, I signed off to buy a business and I had student loans, and it was crazy, but I'm now 36 with three children of my own and the craft studio has been in my life since I was a teenager and I'm so proud that it's an upper East side business, that's still serving the community, and already it was tough to run a small business, but the pandemic has made it so difficult. So what Julie has built has been such a vital kind of emphasis and kind of a wake-up call that, like these stores, are probably not I mean there's 30 percent, roughly I'd say that there's tons more. That probably won't make it going into this final push with the potential of further restrictions. It's really scary and everybody's, like you're. Almost there there's light at the end of the tunnel, but it's going to be a long hard winter and many small businesses like myself I. You know my landlord says they're going to work with us continue to work with us, but I. Don't know what that means, and it's very scary and so I think just having the community rally behind us because, like as a mom I, don't want it to be barren of all these beautiful treasure trove of stores that make the Upper East side. So special I love raising my kids in a neighborhood where they can walk into. You know a shoe store, that's family-owned, Little, Eric or you know, I love going into Feldman's, I love walking by their window and picking up our soda stream from there versus getting the refills from I. Don't know a big box store and I'm just as guilty. I have Amazon charges on my credit cards, but I think it's just a wake-up call. What you've done Julie- and it's really I think brought to people's attention that this isn't over and it's gonna be a long road and it's gonna be a long road of recovery after the pandemic. So it's certainly something that needs to be in everybody's forefront of their minds and I think that the Instagram has definitely been amazing at grasping, I, think moms and parents, and young and I think you've just done an amazing job and I think that the content is so great. I have found resources in stores and shops that I didn't even know, existed or I. Hadn't thought: oh yeah, why don't I buy this from this place? So, from my perspective, both as a resident of the Upper East side and a business owner I think this program, and this you know this whole idea has definitely I already see momentum if you post something that I am so lucky enough to be featured in like, for example, the local toy shops I see that I get an order. You know like so many of us, like I've. I didn't really have an online store before this and I quickly. Pivoted and you know, I had all these classes and camps and birthday parties and walking crafts that I had supplies and purchased. I just went to the toy fair and spent thousands of dollars on retail that was literally shipped to me. The day it was shut down box it, like total, like you, go from having a successful business to literally being like, oh, my goodness, like it's crazy, but so now we have an online shop. We do craft kits. We came up with our own line, so instead of sitting and doing a walk-in, you can order slippers to make at home and it gets delivered and or shipped. We have free, Manhattan delivery. You know we do curbside as well, so I think Julie's right. It's highlighting how these businesses have adapted and we're just as convenient as an Amazon. You know it might take a minute to you know we might not all have our own apps like Amazon on our phone. It might be, you know, adding you us in your phone book and then boom, then it's just as easy better. Yet you subscribe for a toy a month and it's perfect exactly so: we've got craft kits coming every month, so my daughter is in Heaven so cute. Thank you for letting me speak and well. This is great, so I, don't people have questions will do we want to open up for questions and ideas. We can just make it more of a brainstorming. I, don't want to ask all the questions in the beginning. People have if I could enter. Oh, you know what I'll wait. I see Billy Valerie as his handwriting really quickly. We haven't gone over the protocol of the meeting. So if it's anybody's first time I see a few new faces, the way you'll participate in the conversation you'll be you're all muted right now, if you go down to the bottom of your screen, you'll see a participants. Button, it'll, open, a box that says everybody's names at the bottom of that box will be a button. That says raise hand if you click the raise hand. Button I will call on you in the order that you raise your hand. So Billy Freeland is actually raised his hand right now and if you want to mute him and if you're on the phone, it's star nine, to raise your hand, would you like to go to Billy or yep? Yes, please, okay, hi Julie! Thank you for putting all this together. This is the website's terrific I was just looking at it and apologies, because I got frozen and kind of kicked out while Lindsay was speaking, but you know like yeah I can't say enough about how great this is and I hope to see it grow and continue. I hope to get involved. I just have a question that ties into something this committee has talked about in the past, which is trying to find ways to support women and minority owned businesses in our community. Look, we, you know and I want to support all small businesses, but I think we recognize. We should also try to do what we can to help in the Mwbs. So I'm curious, whether that is something you all have thought about: integrating either into the website or identifying women and minority owned businesses in the Upper East side. Who can be highlighted in any way and if not, if that's something you might be interested in the future or working with us? As a committee on? Thank you Billy, that's an excellent suggestion. It's actually something we haven't given thought to, since all of these businesses are really truly struggling and so we're just trying to bring everyone. We can in this big, bear hug and see what we can do, but I love the idea, and there are actually two ways that I would begin to approach it. First, I will tell you that we one of the places we launched and made a big announcement that really helped us gain. Some traction was in the Facebook Group Upper, East, side Mamas. It's got 40,000 moms, half of whom used to live on the Upper East side, half of whom still live on the emperor's side, but we found that, in addition to the minority and women-owned businesses that actually have store fronts, which is where we have really focused our efforts over the last month since we've. Since we started this initiative, we found that there are a lot of people who are I. Don't know if you call them local artisans, but people who have businesses that they've started in their homes on the Upper East side, making everything from jewelry to mass change, which masked chains which are all the rage these days, and so a couple things that I would actually love to do a of course help you, with whatever the committee pursues b as we go forward with social media. We have different campaigns, so one is guest curators another one has been holiday guides, we're gonna, do a series of oldest storefronts and businesses on the Upper East side, but I love. That idea and I would love to pursue a feature on women and minority owned businesses as well, so I think that's a fantastic idea, so I think part of it's going to be that series, and part of it is probably going to be a little further into the pandemic because they haven't been hit as hard as storefronts necessarily have because they don't have the obligations of storefront and commercial rent would be to create a category on the website as well to showcase local artisans based on that brewery side. So I think it's a phenomenal idea and I love it and Lindsay. If you have any ideas I, we really welcome your input and help on it as well, because I know it's actually a very small world of local business owners in the neighborhood and you all know each other and get to work together and I've heard so many stories as I've been working through this everything from Lester's that bought. You know everything and anything for camp, or you know little Eric. That was ready for all of the Holidays Easter. With all these fancy shoes, and now all anybody needs are sneakers and boots, because it's just kids running around outside and nobody's you know going to church or synagogue or to birthday parties. So it's a different world than they planned for sure. Should we try Samantha Myers hi, guys, I'm Samantha, I co-own, let's dress up I've been on calls with some of you before it's a princess party and play space on 85th between first and second avenue. It's been there for over 10 years and I came on board two and a half years ago and partnered with Judy Famaletti who's, the original owner. So I am happy to be here and Julie. I think the campaign is great, I actually read about it in an east Midtown newsletter and started following you on social media I think you had a post the other day that was like, if you order from a small business, there's an actual person doing an actual happy dance behind every order and like that is just factually true and people. Don't really think about that like if someone is like. Hey can I book a private play date. I am literally like, oh, my god. Yes, please do and like actually excited about it. So I think what you're doing is great I mean. Obviously there was small business Saturday and all that stuff, but businesses, like mine kind of we, can promote it on social media. We can like play along with the Amex big huge game across the country, but like we get lost in the shuffle of that, so having something super localized to actual storefronts in the actual place that we live and work is so much more meaningful to us, because I don't need followers in California I need someone that actually wants to bring their kid in to dress up like a princess and have tea. So what you're doing is much more meaningful to me. I'm a mom as well, so all of those circles of you know just kind of being more aware of it. Listen we do what's easy, it's been hard to be a mom and to be a business owner. So Amazon is your friend for sure and comes through in the clutch, but you know we just we don't want to be forgotten in the kind of daily chaos that goes on so I think other instagram accounts or other people kind of tagging and highlighting goes a long way to me. Just blasting my customers for the 800th time. So I really appreciate it. I think the women angle is always interesting, but I think, first and foremost keeping it storefronts is important. Maybe you could have like a little asterisk or a little like w, buy something eventually that would just kind of add to it being women, don't I know some other. Like the Stacy's Rise Stacy's, Pita chips, they had just done a huge push about a female founder directory, not specific to New York. Obviously, but I think you know, maybe just adding a some kind of marker would be nice or just dedicating a special social post that says hey in addition to all the great businesses we've already mentioned, you know, did you know these are mom owned or women-owned, or you know something like that, but I think at this point, small businesses will take all the help and all the extra posts we can get so I really appreciate it. Okay, you touched on something. That's in that vein. Why don't you say the name of your business again and you're, where you're located and what your, where your address is. It's called: let's dress up it's on east 85th between first and second, and it is a princess themed play and party space for kids age like three to seven, great and Samantha I. Think you touched on something. That's important and I think that it's part of the obligation that I have as well and that I mentioned to you in our email exchange. Is that and I think that we saw this with Lindsay's business as well. You know part of what we're doing is just re-educating people on the at the covet-friendly access to the stores- and you know direct retail, that they're accustomed to. So if it's buying a bracelet or a sweater, you know you don't have to go into the store. You can go online or you can. You know, arrange for curbside picket. You can text, you can go on facetime, you know they're, you know. Staff in the stores are helpful to come up with any way they can to communicate with you and to place that order and they'll do it. It'll do their best. What I experienced with Lindsay and the craft studio very early on and then that led to our conversation, also is this shift? You know with the craft studio. For me, I've been there with my daughter for play dates. I've brought my niece for playdates for birthday parties. I've brought my niece there, and so I'm accustomed to going into the store and doing an activity same thing with let's dress up when you find yourself in the midst of Covid-19, where you know there's so many restrictions in place, you know normally I would think. Oh craft studio not a thing anymore. We can't go there and so re-educating, the consumer to what these stores are actually offering and how they've adapted and what you know, services and activities they offer. You know to keep your kids busy, while they're at home, you know and while you're trying to get your work done and they're running around somewhere, and so that's a big part of the conversation too, and something that we have to really find a way to address better both in our marketing on social media and on the website. Well and I. Think true. It's just it's: it has to hit someone at the moment that they need that thing right, so I could have put it in my mailer a hundred times over that we do privates. You can come in by yourself and dress like a princess. If you have two daughters, bring them in we'll shut down the whole place, we'll clean it before you get there, but if, on that day, you're overwhelmed and you're like dealing with a meltdown or home school or whatever you're, not looking for that, so the more places and trusted places and sources that can be goes a long way to making somebody remember or keep it on their yeah and my new hobby late at night, which Lindsay can attest to is trolling upper East side mamas on Facebook, because every a mom every other minute has another question of what should I get my you know five-year-old niece who loves you know sewing and arts and crafts. You know for Hanukkah for Christmas, and so then I'm like, oh, you should check out x twister for this toy for the store for that Lindsay. You know link to Lindsay Pierce for the craft studio, and so you know making those connections and that Facebook Group is not for the faint of heart. Let me tell you goodness: okay, that's great Matt. Did you have a question you wanted to ask or topic just one more to say thank you to Julie as well, for helping to promote the miracle on Madison event. Last Saturday was really appreciated. Appreciate your postings. It really helped a lot so to say thank you. It was it's the least we can do it was our pleasure seriously Matt. Let me ask you this I mean what are your members doing in terms of adapting to being more available? You know via the internet and services like that. Are they are you actively? Is there some kind of? Is everybody instagramming I am not an instagrammer, so that's I'm just curious how it wasn't before this either well. I mean in terms of you know, Madison Avenue, it's a long street 57th to 86th street. You know, certainly, for you know many of the internationally known fashion brands. You know. Certainly, social media is a big part of what they do. We have also lots and lots of small, independent businesses and they're. Certainly getting the word out, and you know, let me just say: love Shaq. Fancy opened up on Madison Avenue on 80th street. Just last week, they're promoted in vogue. The vogue did a big piece upon them, which was really great. So, but you know in terms of stores, you know they certainly all do local delivery without a fee. So that's something that they've been doing actually for a while, but you know, certainly it's a big part of what they do. They can sign as well locally. So you know that's a big part of their. You know their work, so you know that outreach is something that's significant and you know, even when the time when the stores were all closed before June, you know many of them. They were allowing one person to come into a store at a time and they were delivering individually to you know to residents here in the Upper East side. So yeah there's definitely a tremendous amount of Inc outreach and one thing it's a very big business, but you know Ralph Lauren. They have their flagship on Madison 72nd Street internationally, you can go on to the Ralph Lauren website and you can actually take an interactive tour of the store and actually physically be there, and it really is something that we're trying to tell all the brands that are Madison. Avenue is that you know there is a cachet, that's there, and even if you have locations around the world around this country, you know do things from your Madison Avenue store, because that means a lot to someone who you know may be internet surfing from you know out West, you know to interact with the New York or Madison Avenue Sales associate means so much so to actually utilize the staff that they have and the you know to do direct. You know facetime videos and to really connect individually, because there really is a cachet that I think some of the folks take for granted, but really which is very significant around the country. Math, that's a very interesting point and we can touch base afterwards, but one of the vendors who actually does those videos or does that 3D Photography reached out to me and was very happy to work with Upper East side stores and give them a very significant discount in doing that. If you have anybody that you want to line up for at all yeah so he's on this yeah, but the other noteworthy story that I thought was really interesting. To mention in terms of creativity and dealing with Covid-19 was little Eric. The passenger family has been phenomenal through all of us. A lot of stores are opening hours by appointment. Only so if you want to be the only one in the store, you don't want. Other customers there they're doing hours by appointment before the beginning and end of the day for parents and kids who do not want to enter the store at all. They will actually bring a chair outside of the store to the sidewalk roll out a red carpet, and so you can actually try on your shoes, walk down up and down the red carpet to see if they're comfortable and whether they work for you and conduct the entire transaction out of doors. So I thought that was really creative and an interesting way of adapting Valerie excuse me can I mention a couple of things to Julie. So are you also having small grocery stores, small local food shops on your listing? So basically I am happy to add anyone in any category. Until now, it's I have a couple. High schoolers are helping, but it's literally just been me. Juggling and I have a full-time job and two kids. So it's me between the hours of 8 p.m and 3 a.m. So I'm delighted to do and add anything, it's just a question of juggling and what I you know and prioritizing, but I'm very curious to hear what you have to say about the smaller food purveyors because they were around the potential workers. We did. The community board did a program, three of them in with Matt and with the other bid, the Eastman and Carnegie Hill neighbors and some of the street associations, and we had a few local businesses on one was a small food store and he talked about how he was an essential business during the time when only essential businesses could be open and how much effort he made to make sure that things were safe and clean and hygienic and germ free. A lot of his business were people who chose to spend the most of the pandemic at their country, houses or vacation homes he's really struggling through it. So I'm thinking of that place and other places just without mentioning names that are not the chains that really look after customers in a different way and because they're so small and we're open they're, not necessarily recognized. That's one thing. The other thing I'm wondering if this was something you might have an interest in for the upcoming holidays for people who don't have children, maybe the idea of supporting a store buying a toy for a not-for-profit like toys for tots or some of those. You could have a list of the kinds of places that donate and another thing that I was working on. This was a few years ago, I think when I first became chair before I got really busy with it was working with the hospitals who are willing to give discounts that we were talking a lot about food places, but also for things like home, decoration or clothing stores that were up near the hospitals for the staff, the families of patients or faculty members that if and they were willing to promote them in a way so that they give information to and I guess it depends on the kind of business they had. Packets, like welcome packets, for people who are going to be patients there and their families, but they also have the doctors, certainly I think have a healthy income and the staff, and so the idea of providing a discount for places in the neighborhood and promoting them would work for the hospital, because staff would have an easy place and it would bed and they want to be good neighbors. They wanted to be they expressed that they wanted I mean this is obviously way before Kobet. So the idea of interacting between the businesses and the hospital it's kind of a built-in market, and also it provides a benefit to the stores and to the people shopping there. I just didn't. It was just me and I didn't, have the manpower on my own two feet to go around from storefront to storefront, but I did go into a number of them on Lexington and third and they were very interested in participating in that program. So something like that might be worth working on. Absolutely and that's. Those are all amazing ideas. I will tell you the idea of doing a toy drive and finding a recipient, but then spreading out those toy purchases at our local toy stores. I think would be phenomenal and I said: I love that idea, even if it's just you know financial contributions to the effort for toys to be purchased from our local stores, so I love. That idea also in terms of local food purveyors. One of the things that I did for Thanksgiving was provide a list of Thanksgiving Catering Opportu catering services, so everything from the Butterfields, Agata and Valentina. You know all of you know a long list of local businesses providing catering. We did that for Hanukkah we'll do it again for Christmas as well also some smaller food purveyors that provide specialty items, whether it's greenbergs or you know, bakeries and different other different holiday items, so hopefully we'll be able to at least scoop up some of those smaller food preparers in that project. Great because I, like mine, fits into that fits into any of those categories. Let me know and we'll make sure to slip them in yeah. I had that little place was very helpful for its neighbors, but also I had started talking to some because it worked up in community board 11, which is just to the north, where some people put money together and were able to get small businesses to provide food to the hospital workers, and so that was something that I was also working on and the smaller businesses I know. I had talked to Yura and the woman who owns Euro was very happy to try and get involved in delivering food to mount Sinai. By that time, though, the numbers had really dropped and they had I think enough food to feed an army. As the saying goes, so they it was hard to find a hospital that coordinated with the food, but I'm sure that now his numbers are ratcheting up or just opportunities for people who want to do some good and help small businesses at the same time. So thank you for listening. Thank you, so Julie I just wanted to ask you I know that you on the website ask for ambassadors to sign up. So maybe you could talk a little bit more about that and what the ambassadors could help. You do sure. That's a great question. Valerie! Thank you. So we've asked people to serve as ambassadors that can take any form one would like. So there are a number of things we ask our ambassadors to do and again it's a pick and choose all you know do all do. One is very simple talk to your friends and neighbors tell them. You have no idea how easy it was. I just bought all my toys at Mary, Arnold I, called them up. I had a five minute conversation. They you know, did all this stuff took my credit card and poof. They were at my door, big bag of rap toys. Just telling your friends about that experience. I mean I, now have Kathy from Mary Arnold and Judy. The owner there in my phone and literally I, have sent their contact info to a dozen different friends. Who've now ordered all their toys for Mary Arnold. So you know that word of mouth is the easiest and really important. Secondly, we encourage people to help spread the word on social media, so whether you're on Facebook or on Instagram, encouraging both your friends and family to help our local businesses that are struggling in the pandemic. Also asking them to follow us on Instagram and Facebook is helpful again. They'll get that inspiration and everything else sharing the website shopues.com, which I'm actually happy to show you. If we have a second to do that beyond that, we're reaching out to your local institutions, clubs any affiliation that you have any organization that you're affiliated with or have access to that puts out any weekly newsletter, email, etc. We've had again PTA synagogue, churches, schools, putting out just a quick blurb with you know our logo, the website, you know our stores are struggling pandemic. As you go about your holiday, you know give purchasing. You know, please remember our small businesses and do your best to shop local, so those constant reminders. You know I talked to my friends and I, pitched this to a bunch of them. They're like no I've seen it everywhere. I saw the logo. I saw this. It keeps popping up in my news feed, and so this idea that people are getting that constant reminder really makes a difference. So I would point to those three things as being the most important in helping us get out. The word yes and Valerie were so gracious. I know that I know even the CB8 I know. The community board has even a lister. So you know an email to them goes a long way as well. Okay, lindsay I was actually gonna, come back to you because you didn't the location of your store or anything I, don't know. If anything else you wanted to say. Oh yes, I was just chiming on to say, Samantha, my daughters, loved, let's dress up I have two daughters, so we love that and I'm so happy to know that you're doing private play dates. I'll share that with them number two, I'm so sorry that I have to run. We have an adult craft night where we've shipped craft supplies, I thought it started at eight Julie, but it starts at 7:30. So I'm so sorry I have to run and get my art supplies ready, but the craft studio is on Third Ave and it's between 92nd and 93rd, and our website is craftstudionyc.com and I just want to thank all of you because, honestly, without the support, I think that we would be closed a long time ago. In all seriousness, it's I know and Samantha. The experiential side of it, too, is very difficult, because you know no one is doing it that thing, but we thank you so much and Julie are incredible and I'm so honored to have been able to a part of this and I'm sorry to have to leave. No, please do good luck. Thank you! So much everybody. It's so great! Thanks have you if you for anybody who hasn't done one of these in-home craft parties, they're really super fun and the first time I? Did it I thought it was like this was going to be the worst experience of my life? I went got invited to a cocktail painting party and they shipped all the things to your house and actually you're on, like a zoom and you're doing the craft. So now that I know that there's a local company in the neighborhood that can do it, it's really super fun. So, if you're looking for something to do to get together with your friends who you can't see, it's a really fabulous way to do it, and you know you make your own mess and people can't really see it. So it's all good, okay, I, don't know if we have any more questions for Julie, if I show them the wraps up website really quickly. I just want to familiarize everyone with it. For you know, 20 seconds, can we put that up? You can share your screen. Oh there we go okay. Here we go so this is the website really simple. Our ues retailers need you to save our stores, commit to safely support our neighborhood stores this holiday season. If you are trying to track us down on either Instagram on Facebook, you can click either these two little icons here and what you'll see here is just a reminder of all the opportunities for shopping, different ways to do it and then you'll have you know a section for toys, books, jewelry, home decor, clothing, museum shops have phenomenal holiday shopping and we thought that was a great way to support our local institutions. That may be closed right now. Up to 25 of their revenue comes from their gift, shops, activities, holidays, florist, catering, etc, and then this is what our instagram looks like: Hanukkah guide, different guest curators, some beautiful holiday decorations and different stores that we're featuring. So you can click through there as well and then you'll just see as you go to any of the individual pages. You'll see a list of each of the individual stores in that category, which you can scroll through. Each of these are links, so you can go to their website and then you'll see a map as well. So if you're, if you say I live on 69th street, what's the closest toy store to me? Well, that's right here! That's modern state! So great, that's helpful! Hopefully it's a helpful resource for the neighborhood for the season. Well, it's truly inspiring to know that we have such motivated and caring people on the Upper East side and they're, not all on the community board they're everywhere. So that's even more inspiring and I'm so happy that you could come here tonight and I hope that this is the beginning of a beautiful relationship and you'll come back and we'll keep in touch and we'll cross-pollinate and help you and you can help us and hopefully we get through this together and it just. It starts a new way of not a new way of thinking, but just you know, shop local first and keep and make that you know the shopping. The whole neighborhood is a mix of residential and store ownership of long time and people that's one of the reasons people want to live on the Upper East side. So we really appreciate all your efforts and wish you a happy holiday. This committee is absolutely amazing and the fact that you've committed so much of your time to supporting our local businesses and keeping our community as beautiful and as wonderful as it is. It's doing amazing work. Oh hi toss did you have a question: yeah I do with the city or state wanting to impose a three dollar delivery fee on any item non-food item, but rather than the funds go to the bottomless pit. Could they somehow go to help the small stores advertise or promoting the advertising in the city or somehow go to help them rather than a bottomless pit? That's a great point, I wonder if the Manhattan chamber of Commerce could lobby or do something to make that work, because that's a real impediment. It seems to these businesses and I. Don't understand so well, thanks again Julie you can do it have fun tonight. At your event, before you go, can I just add one thing Julie. This is so important. What you're doing, because a big box store is moving into the former Barnes and noble space on East 86th street so and we're very concerned about that. Because of impact, of course, on small businesses- and we were concerned even before Covid-19, so this is essential. What you're doing and also the community board prepared some signage for restaurants and stores in terms of what's good behavior from customers, so will could send you a link to that and if you're interested you could download it or we could deliver bigger sized posters. I have a whole bunch in my apartment so that, if store when I went around, they were and I gave them out. They were receptive to it, so it sometimes just helps it's from the community board. Thank you for having me our pleasure. Take care. Okay! Well, I guess! Are we on old business new business, I'm open to discussion? We don't really have anything else on the agenda. I see, Lou Martens has is waving his regular hand, so Valerie, okay, Lou, okay, hi! Thank you all great work. We are not exactly in eight, but I was asked to sit in on this call to try to maybe coordinate with community board 11 we're up here in east Harlem. I'm the manager of Bistro Casaul, invite everyone up and mention you were on this call. I got a margarita for you because we all need a drink at this point, but the reason I wanted to unmute real quick and throw a suggestion out for you guys to maybe start lobbying. It seems like the city's you know very eager for us to reduce capacity and close in some cases, etc. Yadda and that's great I, understand the mindset, but I think that we should ask for and get a little help in the form of any of the following or smattering of them all the city and the state could easily allow us to collect sales tax and keep it as a grant or some kind of assistance. That's one idea for revenue, fees and expenses that the city is now collecting 100 of in the state as well. For example, we just renewed our liquor license 5,000 to have you know, nobody at the bar and have to close at 10. doesn't seem fair, we're not getting the full. You know until 2 a.m, et cetera, so things like this that, if we all ask for it together in unison, maybe who knows maybe somebody in the city will see the wisdom and actually helping us instead of just looking to get their taxes and fees. You know these are things we're happy to work with community board eight and the people on this call to try to you know, make happen and I offer myself as a contact person, if there's anything that we could work on together to let the city know that you know it's not just you guys by yourselves, and it's not just us by ourselves. It's a city-wide, statewide problem that you know something has to really be done. We're the only country in this world, the only industrialized country in the world that isn't offering a standard set of support funding. While this closed, all these shutdowns happen we're the richest country in the world. Why on earth are we forgetting about all the people who are working in all the businesses that are trying to survive? You know we've seen a lot of businesses close up here in east Harlem. I know you guys have a lot of empty store fronts as well, and you know where is this going to end at what point does the city say it's more valuable to protect attack base than it is to just turn their back on it? Thank you all. Thank you. Lou that was very well said. I mean I know we have some representatives of some of the electeds on this in this meeting tonight. So I hope, they're listening to you, what you're saying, and maybe we can invite back at the next meeting, some of the electeds to talk about what they're, possibly thinking about for some relief, and maybe your proposals are being heard and maybe can be talked about between now and then I mean I. Think those are great ideas. It is disheartening at this point in time that there really is an effective relief program for small business in the United States zero I mean the PPE, the ppp and all that stuff flew right by us. A few people got they sent us, I'm pretty sure they said this three thousand dollars. I still don't have anyone to tell me what it was, what the terms are and three thousand dollars. You know it. It's almost a joke. It's almost a joke, but thank you all again, I make myself available. I, don't is there a chat. I can put my info on. Yes, please do and we'll keep it at the board office and be in touch. I know Nilsa well, and it's good when neighbors can work together. Thank you very much. I know it is very disconcerting and disheartening to be faced with the kinds of economic issues that are facing small businesses now and they're the hard blood or the heart of the city yeah all right. Well, thanks again and I'm putting my info in there feel free anyone on the call can feel free to reach out. Thank you, Lou. Good luck! Thank you. Anybody have anything else want to discuss or put on the agenda or topics for I mean our next meeting. I mean it is the hardest thing that we're still sitting here, waiting for a relief package out of Washington, because essentially that's where a lot of this money has to come from, but there's still even after the lobbying from even the restaurant association Colicchio all those people that there really is an effective plan to help people just more this cause and charge more fees. I, don't understand the logic, but I'm not sure I mean I'm Elita and I are open to ideas of what we could possibly do to help out. But, like I said, maybe we'll invite some of the electeds to come to the next meeting and see if they can talk about what's being discussed at either the city and or state level, to jumpstart a recovery and hopefully, in view of a vaccine. That's going to be out there soon, but you know we all have to realize. I mean I. Think the governor said the next couple of weeks. Things could change rapidly and not for the better. So it's going to be tough for everybody and that's all the more reason, I think to really think about Julie's program and how we can you know, support these businesses without walking into the stores as best we can, and that goes to even with the restaurants trying to order direct without going through a service that takes more money off the top try to fi when you're looking on the internet. Try to find the actual number of the store, not the service number, if you're going to call and make an order, so they can get the full and even when they list a delivery, app company on their website to just call the restaurant directly and, if possible, to pick up the food from the restaurant because the amount of the fees are astonishing. There was just an article that we included or I included, I, don't know if we've sent it out yet in the update on how big a chunk delivery, apps take out of restaurant revenues. I know in New, York they've, the city Council has limited it, but it still is a significant amount and I don't know if there was a cap on the amount of time either and if they shut down indoor dining and consider some of the outdoor structures to be like indoor dining, so those are shut as well. It becomes even more essential to help restaurants by ordering in or getting takeout and then going directly to the restaurant. I, see Kaz, says his hand up, I, don't know if it's new Valerie no go ahead. Yeah. While you mentioned the delivery, the third party deliveries I can't see why City Council can't restrict, because at the moment they're charging, you know 15 20 25, which is a hell of a lot of you, know: I've cut into the restaurant's business. Yes, it's a huge amount, I think it was even up to 40 percent and I. Think they're, almost a trillion dollar industry Doordash just had an ipo where the price, more than doubled, I think in a day from the initial offering until the close of business. That day, it's phenomenal the for success for them. For the business that they do, Lou do I see you waving in the distance. Did you want to add something? Your will? Would you a mute him? I got him thanks. Yeah I, just wanted to the city did in fact limit the fees they were allowed to charge and they're just belong they're, just basically ignoring some of that, which I think is just shows you the hubris. These companies have in some cases it could be more than half we don't use. We stopped using them when we first got when they started playing around. We encourage all our customers to call us direct. It's not really that much more work than being on the app I mean I, guess it's very convenient to just click buttons on your phone not have to talk to a person, but that minute that extra minute you spend makes a big difference on the bottom line, because the and not only that in some cases your food is being marked up by the delivery service, you're being charged extra fees and or the food that's being offered to. You has been marked up by the restaurant or before you ever saw their what's been promoted on those third parties. You know it's a simple disintermediation of a greedy middleman and, like you said all that money leaves the state, leaves our economy and goes to mountain view, California or the northern part of California, creating concentrations of wealth that do not benefit New, York, City or New York state or any of us in any way. Unless you happen to be a shareholder in one of those companies but and I think that even shareholders in those companies are going to start to see a change, because this is an abusive kind of you know they don't treat their drivers right. They don't treat the restaurants right and they're making the line share of. What's you know profit, so it's a big cost for a restaurant. Well, let me ask you Lou I mean: can you tell do those orders come in a different way, or does the restaurant really not have any way of knowing no? They yeah? You know where they're coming from? Oh okay, in fact, sometimes there's multiple terminals for multiple different companies. I see so you know it becomes a problem just in keeping all of it flowing properly and yeah, but you do know where they come from. Generally speaking, unless there are some newer applications that will blend them all in and give you one printer and one sheet, but even then you are able to code for which service it's coming through. So let me help you I'm sorry. Let me interrupt you also another thing: what some of the third party deliveries they also charge extra service fee to the customer, so the restaurant's paying and the customer is paying extra and they keep it. They keep the lion's share of that, because those drivers are working for I, mean they're running like crazy for a couple bucks an hour. It's really sad! Well, we need to be prepared because their success with legislation in California to treat all of the employees and keep them as independent contractors there. They said that they're going to start spreading that around the country because they are emboldened by the success I, don't know if I cut you off Valerie, but one of the thing and if I did I'm sorry about just one quick point, is that the delivery apps justify their fees because they're able to if someone wants chinese food. Now you get a whole bunch of chinese restaurants or Thai food or any of pizza, and it's all in one place. And so how are you dealing? You must have a loyal base of customers. Do you market? Do you advertise yourself to get new customers? Was that directed to me? Yes, yeah! Well we're open about going on almost three years now so before the pandemic, we kind of started to get our a bit of you know loyal base. We have a lot of referrals a lot of word of mouth. We started to do some advertising with yelp when we first opened, but Yelp and Google both, and we found similar attitudes as the delivery companies. For example, we had yelp charging us, it was sold to me. I agreed to it. Had a dollar a call directly from their website, when someone saw us they could push a button. Call us directly and Google had a similar service. I would get all these calls and there was nobody there. So I was being charged for fake calls. I was being charged, Google charged me six dollars and thirty more than six dollars for one of those calls and I explained, I tried to get an explanation and the explanation was basically well you're bidding. So this is an auction, so it can go anywhere. You know. Could this can go up to 15 a phone call? And again we didn't even get customers from this. So I just canceled that if Google has to rob a little restaurant like ours, then there's something wrong with this world. You know, but there they are. You know, overcharging. Double billing I saw a breakdown from one of a merchant in this neighborhood thirteen hundred dollars of food delivered through Grubhub and they ended up netting, something like 450. That's insane that now you're working for them, because your food cost is more than that, and then you figure in your overhead. Your insurance, all the other expenses just to be there, you're, literally paying for them to take the food. It's silly is that a contract- that's like a is that, a month by month, contract that you enter in with you could cancel whenever there's really no, oh okay, at least the ones I've dealt with were you know, will cancelable at just at odd discretion, but yeah I get into it. It's very simple, for me, I mean I, understand the convenience end from the consumer's point of view. As far as the businesses go and I understand, they bring you, they put your name out there in certain circumstances, but I can't see paying someone to you know to paying them a profit to lose money to have people come and eat my food, it's so I'm gonna get going. I've gotta run off the call. Thank you all very much come on up to east Harlem. It's a beautiful place, don't be afraid and we're here to work with you guys. However, we can okay, I, really appreciate it. Thanks for dropping by. Thank you have a good holiday. You as well. Good luck! Thank you. This is like a you know: these services are I, don't I mean you know. I all I can say is from my point of view. We discovered that when we started doing the bike surveys and that when we were having trouble with delivery people, none of them were being employed by the actual local restaurants that more than 40 to 50 percent of them are employed by the servicers. So you know they don't even have any control of whether they're coming up and down the street or going the wrong way up the bike lane, because they don't even know these guys. They just come in and pick up the food and they never see them again and the other thing is I mean you know: the these company service companies don't really they're abusive to these people who are doing the deliveries. I mean there's. No, they have nowhere to go. You see them they're parked on the benches because or they're parked in you know the public plazas, because there's no they're waiting for the next call. So it's a completely he's right, they're, just really making money off the middle man for no. You know it's just it's out of hand and they're not really taxed I mean I was just going to ask him. I forgot to cause this point. Who would pay that three dollars? Would it be? I think that's applies to food too, so who would be paying? No, it doesn't apply to food, it does not only yeah, it's only other things, they're trying to get to the non-local deliveries. I see like what do you mean caused by non-local deliveries well for local deliveries? You normally would pick up. Food deliveries are excluded, essentials are excluded, it depends on the bill, how it's written and how it's going to be enforced any online, which that's what they're going to be taxing I, think it's three dollars a delivery from online orders, yep, excluding essentials and food and that probably included pre-tap pre-the sales tax, yeah I bet. It is because that's the same thing with the bag it gets rooted, and then they charge you the tax on the back anyway, but they had a good point as far as sales tax and any other thing and little license renewal that the state could really help small businesses. If people, if it had the equivalent of a think tank of consumers and of the businesses and was creative, it could help small businesses, but I'm not sure that it thinks that way and taxes and fees are what they charge, but I think Valerie, as you pointed out so many times at the taxis that fee that automatic service charge below 96th street is certainly an obstacle to my taking a taxi and the same thing with delivery fees. I wonder if people are just going to reach for local stores or call Amazon get I mean, go online and click on Amazon, because you're not paying any of that stuff, and it sometimes feels like the government works for the big companies and not the ones that really matter to the jurisdiction. Well, who is that was that a governor proposal cause I, didn't see it? I've been I, I'm not sure will would have a better New York Assembly proposed legislation by Brooklyn assembly, Robert Carroll I can put a gothamous article on the chat for everybody. Yeah I think it was more with all the boxes that have been in sanitation, picking up a hell of a lot more boxes and papers and stuff like this double parking and all the delivery, trucks double parking and that's where it all comes from I think maybe sanitation had something to do with it too. Well, looking at the gothAMI'st article that will included in as a link in the chat, the photo is of Amazon of what looks like a hundred boxes being done. Photos not really representative I mean that's just one like journalists and or editors put into it I. Wouldn't. This is a pretty regressive tax against your everyday New Yorker. So what else is new yeah? Sorry, that's my editorial. It says that the justification for the proposal is to as a check on Amazon's dominance of the retail landscape, but what might end up happening? It sounds like is that it's going to really have an impact on small businesses. It would I mean in terms of size. Amazon would be a lot easier. You know more able to pass that along to their customer than these small businesses that are struggling for every dollar. I mean I, don't know all right. Well, on that happy note, does anybody have anything additional or I mean we're I? Guess we're looking for topics for the you know the next couple of months is there anything that anybody wants us to explore or bring in I actually want to? Thank you Baron for alerting us to Julie, and we were able to get her to come in quickly. So thank you. Gail I, appreciate that and I mean we're, I'm happy to and Elita as well any topics that people want to discuss and try to put small businesses together, and you know Matt, don't be afraid to call us if you want to try to do something together. Valerie one of the things I had wanted to do in the fall, but just kind of have run out of time, but we could do it through. The committee is a program on attracting and retaining small businesses. If there are things if there are any synergies on the Upper East side or any reason particular reasons that businesses would want to be on the Upper East side and to try and explore that somehow and I know that the Madison Avenue bid Carnegie hall neighbors the usual suspects, as we did in the other ones. The east Midtown partnership and the street associations have been interested in working on that too. So, maybe that's something we could explore for the future. Well, I mean I'm not really familiar. Maybe causes I mean I, don't understand the. If, with the trade group for restaurants in New York, if there is actually one there's a hospitality alliance and the head of that is on CB7 across the park, but that's more than just small. Isn't that included? There's not like a local one is what I'm saying that I know of and I think Mick would have introduced it, because he was really involved in the programs that we did in the spring. Yeah I just don't have a few hands that came up. I, don't know if you wanna Sarah Michelle and cause yeah go in that order. It's fine! Sorry I was just gonna say I've I haven't been on one of these in a while, but I was on several wendy. You know what was hitting the fan and found them very helpful. Nick was on a couple of those as well and I. Actually he introduced me to his girlfriend or fiance, and so she and I had kind of collaborated and tried to do some things together, because she has a literacy, business and I work with young kids, but I think sometimes it's a little bit isolating and I've kind of reached out to other small businesses that I know or that I've been to with my daughter or that serve a like demographic, but I, think networking or sharing ideas or any way, even maybe working. Now that Julie's kind of creating a list of sorts I think any way to kind of put people in touch with each other, whether it's that they happen to be on a call like this. I've been into the craft studio many times, but I had not ever met Lindsay and we serve a very similar demographic. So it might be useful if there's any way. You know power in numbers and collaborating and ideas and all of that stuff that, if the more people that are out talking about each other, the better and the more personal relationships, the better which kind of goes to what you were saying about, you know make it desirable to be a small business on the Upper East side. A sense of community is really important to that and knowing the people behind the businesses that you spend money at or that you really like so I, think any way that you guys think of as you're having these conversations with all different pieces. I mean I, read your newsletter and all of that stuff, but any way that you think of kind of connecting the dots or putting people in touch with each other or I don't know anything along those lines. That kind of comes to mind. I think there are certainly there are people that are too busy and too stressed out at the moment, but there are also people like me and probably Lindsay and probably you know many other people that are kind of desperate to say. Oh, we could do something together. Oh we could cross promote, oh you'll, send to your list and say that you're, a customer oh come into my business or buy this at my business and the more small businesses doing that to each other, the better. So that's my two cents, just about kind of networking and well I mean do you think that should be like. We create, like a in each meeting like a 15-minute clearing house for small businesses to come on and maybe come introduce your business to the community board. Maybe, okay, that's a good idea. Just something to think about, as you guys are in many more of these conversations than I am probably but just something to kind of have in the back of your mind as you're having these meetings and talking to various people, I mean that's the hardest part I mean you know, like you, said, you're completely stressed out trying to keep your business open and these events that we have at unite. You know the last thing you want to do is come and spend an hour with us, so we really appreciate you doing it and we're trying to figure out how to make this useful for the small businesses as well I mean one of the things I was thinking about, is changing the time of the meeting like small businesses, usually open at 10 or whatever, maybe switching up the meeting times to make it like 8:30 or you know if we had like if we had tried to do this chat and bring you all together. That would be more of maybe a morning meeting but I mean, as opposed to an evening meeting I, don't know the small Business Committee Valerie a couple of years ago. When did this, they met at Ronald, Mcdonald House at 8:30 in the morning, I think Mick and Sarah were co-chairing at the time and a number of small businesses came, and it was just a round table to talk about the kinds of issues that Samantha's raised. Okay, I mean I. Think we can try that you know see. If we can. You know maybe use Julie as a resource to get do an invitation out and then see if we can pull people together and just brainstorm as to how we can be effective, helping you and I think the cross-pollination thing is great too. So, let's we'll put that out there as an idea. Does anybody have anything else? Well, can you see anybody else, Michelle and cause have their hands raised? Okay, Michelle, then she hasn't spoken yeah. What I was going to say when you were talking about small local, small business networks? That's a function that the bids play, and so what you might think of is maybe bringing the bids to a meeting. You know you've got the you've got many in our area, but that doesn't mean that's. It doesn't have to preclude the bids from other areas, but you've got Madison Avenue. As you know, Matt is here. You've got the Mid East Midtown partnership, but there's no reason you can't bring in also Andrew Riggy, who is the one who represents the entertainment and restaurant industry, but there are many, I'm sure you know the adjoining community boards have bids and all of the boards around central park have bids and to the extent that those businesses may or may not deliver. You know to the east side from the West side or the west side to the east side or whatever, but if you're looking to make contact with local representation, I think the bids and the block associations would be a good idea to bring them into a meeting. I, don't know how an early morning 8:30 meeting would be for businesses. That's for them to really decide these days. I, don't think the kinds of aside from the restaurants I, don't think the kinds of local businesses we're talking about necessarily can't make a meeting at say seven o'clock at night, but that's up to you, I, I'm being mindful of keeping it within the community Board calendar you know so that it makes sense so that community board members, because these are open meetings for us. You know the community board has some rules and regulations so I, don't know how that would play out. Yeah I do know that they did have. This committee had some meetings early in the day for a while, so I mean yeah, so we can see well I mean you can explore that. But I'm just saying the block associations and the bids are your most local representatives of local business and she was terrific tonight. Julie I never heard of that website. I'm glad I heard about it. Her presentation was fabulous. Her hard work, very much appreciated, and the website looks very inviting and terrific so good for her for able to pull all that together, all right. Okay. So anyway, we still have Samantha, Myers and cars. Have their hands raised, yeah I think a leader mentioned the hospitality group. That's Bookman the SLA lawyer that normally comes to street life. You could also classify your small businesses, as the hospitality may pay to get in touch with him and see what you know. They've I know I've been to many meetings that they've been at. They explain a lot of things, so they could be good to have also yeah I. Just think that some of it is just us being able to get people to come in to Encoura. That would make the small businesses join. The meeting I mean some of the a lot of the information is good. I'm just not sure that they see us as a resource for that. So that's what I'm trying to do! I'm Gail! Oh sorry, I was just going to say that maybe, if there are new or a reversion to the rules that we had in the spring, that could be confusing or detailed for small businesses that having someone like the hospitality alliance or other people with an expertise come in, could bring in small businesses who might be craving the information. So I guess you called on Gail and Samantha has her hand raised as well. Actually, in the past, the hospitality alliance has come to one of the small business meetings and I think that they are very helpful. They have a very large network, also having run a bid. I can tell you that morning, meetings usually work the best for small business owners before they open their stores, and whenever we had breakfast meetings, we got a much larger turnout. So I think that, even though most of the community board meetings are at night, particularly under Covid-19 scenarios, where people are working from home and they don't have to spend an hour getting to or from I think we'd be more successful in getting a more robust representation. There's also the New York City Bid Association, which is the association of all the business improvement districts in the city and they're, broken down by borough by neighborhood. Certainly Matt or Rob. Burns could be helpful in that sense and where I would think that inviting some of the bid managers would be useful is for best practices because they're all putting together different types of programs to deal with their local businesses. So if we found out two or three different possible approaches that would be helpful to our small businesses, then I would certainly recommend that we do that great. That's it and Samantha Myers I just wanted sorry. I just wanted to add one more thing and I may not be the norm, because I can be a little I. Don't know during all this I just wanted more resources, but I will say that you guys have been a better resource than a lot of other places. I would also say that neighborhood associations slippery sorts that sometimes respond, and sometimes don't I've reached out to tons and tons of places like I've been to the councilman first Friday meeting to introduce my business and see what else we could do. I've reached out to neighborhood associations, Manhattan chamber of commerce, you name it. I've been trying to kind of take in all of the resources and educational items and networking available to me and I think you guys have far and away done the best job of kind of aggregating information when it was totally insane and putting resources together. So I do think that everyone may not know it, but you probably are best positioned for some of these things or to know who's active in what industry or who's active in what neighborhood and kind of the dynamic players of it. The Chamber of Commerce has been pretty good with some resources, but you know it can feel a little bit overwhelming to not know you know this cuts off at this district. East Midtown is great, but you know the East 86th street one when I'm on 85th street I can't I mean I, couldn't get someone if I paid a million dollars, I couldn't get someone to answer an email, so it feels very hit or miss. So any you guys have more insight than the general kind of layman business person out. There is my only we appreciate. Well. We appreciate that. I'm not going to take any credit for it, but we appreciate you. Thank you. Okay, well, I think, there's a lot of food for thought here and a lot of planning we can do to try to be as helpful as we can I think. We heard a lot of good things tonight, a lot of interesting ideas to follow up on, and so we will so I'll, let Elita close out the meeting. Thank you Valerie. Thank you. Everyone for coming and participating in this. We all know how important small businesses are so and we're all working to keep them afloat and keep the Upper East side alive and thriving, so stay tuned, we'll send out an agenda for the next meeting. We don't is there a date, Valerie I don't know, I have to rely on. Will for that I? Don't you guys you're gonna keep your first Monday of the month right, yeah, I! Think that's what we had talked about yeah. Yes, so January 4th, 6:30 p.m. Wow! So stay tuned, see you there we'll talk about starting earlier, we'll talk about guests. Thank you all! Have a happy and safe holiday tradition! Well, I guess it's not traditional anymore, but happy and safe holidays until things do get better, and maybe there is a light at the end of the tunnel, but in the meantime we'll be supporting you and working to keep you in business. So thank you. Buy local good night.",
            "summary": "I want to welcome you to the December meeting of the small Business committee.\nYes, Exactly so, I appreciate everyone joining in, As everyone, knows, small business, is a very hot issue in our community.\nSecond thing I want to do is introduce my new co-chair, who is Elita, Camp and well known to everyone, as the current president of the community board, soon to be at the end of her term, and she has graciously.\nSo without further ado, I want to go to tonight's featured speaker, who is Julie, Blenbaum, Mark Beachy and a member of our community who started a an effort, called save our stores.\nAnd I know that this pandemic has, you know, hit New, York, City quite hard and small businesses.\nAnd I was just looking to the left and looking to the right and just empty storefront after empty storefront, and it really broke my heart, and you know one of the things that really made me think twice.\nAre people, like me, responsible who have you know, really come to rely on online purchases, especially in a time of pandemic, when we're so averse to actually going into stores, and.\nSo I said, someone's got to do something about this, and basically, What came out of it was an idea to really start initiative to change, hearts and minds around the neighborhood and to really make people aware of not just the closures but of the fact that we have an obligation as a community and an opportunity to really support our neighbors, especially as the holiday season and all the shopping that comes along with it begins, and so the way this idea manifested itself we've called it shop, Ues, Shop, Upper, East, side save our stores is really in a couple.\nIt's, both a directory for Upper, East, side, small businesses, and we list everything from jewelry stores to housewares to clothing.\nYou can imagine, and the idea is both to be a resource both to give people an opportunity to peruse, What's actually here in the neighborhood, to provide phone numbers for them to provide links, because a lot of these stores actually provide online opportunities as well and to really give them the inspiration as they head into the holiday shopping season and the access.\nYou know providing that resource for people to actually see what's available and see just the tremendous variety of stores in our neighborhood.\nYou know, inspire our neighbors and give them ideas of holiday shopping opportunities in the neighborhood and places to actually buy their toys and also have them.\nYou know one of the things that I think people don't realize.\nThat far sports has closed, and you know the people there are phenomenal and they're happy to work with you via phone text or anything else, So I, texted, Kathy and Mary Arnold, Toys.\nSo people need to know that not just online are there opportunities, but there are also store owners and staff members who are delighted to help.\nOne, more thing, I should add, is we'll see how successful this is, but we actually to I, together with some high schoolers at Ramaz, has started distributing decals for stores to put on their doors or windows for the holiday season.\nAlmost there there's light at the end of the tunnel, but it's going to be a long hard winter and many small businesses like myself.\nI just have a question that ties into something this committee has talked about in the past, which is trying to find ways to support women and minority owned businesses in our community.\nLook, we, You know and I want to support all small businesses, but I think we recognize.\nIt's got 40,000 moms, half of whom used to live on the Upper, East side, half of whom still live on the emperor's side, but we found that, in addition to the minority and women-owned businesses that actually have store fronts, which is where we have really focused our efforts over the last month since we've.\nDon't know, if you call them local artisans, but people who have businesses that they've started in their homes on the Upper East side, making everything from jewelry to mass change, which masked chains which are all the rage, these days, and so a couple things that I would actually love to do a of course help you, with whatever the committee pursues b.\nI, We really welcome your input and help on it as well, because I know it's actually a very small world of local business owners in the neighborhood.\nI think the campaign is great, I actually read about it in an east Midtown newsletter and started following you on social media.\nObviously, but I think you know, maybe just adding a some kind of marker would be nice or just dedicating a special social post that says hey in addition to all the great businesses we've already mentioned, you know, did you know these are mom owned or women-owned, or you know something like that, but.\nI. Think at this point, small businesses will take all the help and all the extra posts we can get so I really appreciate it.\nYou know to interact with the New York or Madison Avenue Sales associate means so much so to actually utilize the staff that they have.\nMath, That's a very interesting point and we can touch base afterwards, but one of the vendors who actually does those videos or does that 3D Photography reached out to me and was very happy to work with Upper East side stores and give them a very significant discount in doing that.\nOther thing, I'm wondering if this was something you might have an interest in for the upcoming holidays for people who don't have children, Maybe the idea of supporting a store buying a toy for a not-for-profit like toys for tots or some of those.\nThis was a few years, ago, I think when I first became chair before I got really busy with it was working with the hospitals who are willing to give discounts that we were talking.\nA lot about food places, but also for things like home, decoration or clothing stores that were up near the hospitals for the staff, the families of patients or faculty members that if and they were willing to promote them in a way so that they give information, to.\nPackets, like welcome packets, for people who are going to be patients there and their families, but they also have the doctors, certainly I, think have a healthy income and the staff, And so the idea of providing a discount for places in the neighborhood and promoting them would work for the hospital, because staff would have an easy place and it would bed.\nSo, the idea of interacting between the businesses and the hospital it's kind of a built-in market, and also it provides a benefit to the stores and to the people.\nAnd, I, said: I love that idea, Even if it's just you know financial contributions to the effort for toys to be purchased from our local stores, so I love.\nAlso I had started talking to some because it worked up in community board 11, which is just to the north, where some people put money together and were able to get small businesses to provide food to the hospital workers, and so that was something that I was also working on and the smaller businesses I know.\nAs, the saying goes, so they it was hard to find a hospital that coordinated with the food, but I'm sure that now his numbers are ratcheting up or just opportunities for people who want to do some good and help small businesses at the same time.\nSecondly, We encourage people to help spread the word on social media, so whether you're on Facebook or on Instagram, encouraging both your friends and family to help our local businesses that are struggling in the pandemic.\nYou know, please remember our small businesses and do your best to shop local.\nYou know these are things we're happy to work with community board eight and the people on this call to try to you know, make happen and I offer myself as a contact person, if there's anything that we could work on together to let the city know that you know it's not just you guys by yourselves, and it's not just us by ourselves.\nYou know, we've seen a lot of businesses close up here in east Harlem.\nThat's all the more reason, I think to really think about Julie's program and how we can you know, support these businesses without walking into the stores as best we can, and that goes to even with the restaurants trying to order direct without going through a service that takes more money off the top try to fi when you're looking on the internet.\nI mean: Can you tell do those orders come in a different way, or does the restaurant really not have any way of knowing no.\nIt gets rooted, and then they charge you the tax on the back anyway, but they had a good point as far as sales tax and any other thing and little license renewal that the state could really help small businesses.\nI wonder if people are just going to reach for local stores or call Amazon get.\nYou know more able to pass that along to their customer than these small businesses that are struggling for every dollar.\nI'm, happy to and Elita as well any topics that people want to discuss and try to put small businesses.\nAnd I've kind of reached out to other small businesses that I know or that I've been to with my daughter or that serve a like demographic, but I, think networking or sharing ideas or any way, even maybe working.\nNow, that Julie's kind of creating a list of sorts I think any way to kind of put people in touch with each other, whether it's that they happen to be on a call like this.\nAbout, you know make it desirable to be a small business on the Upper East side.\nA sense of community is really important to that and knowing the people behind the businesses that you spend money at or that you really like.\nI mean I, read your newsletter and all of that stuff, but any way that you think of kind of connecting the dots or putting people in touch with each other, Or I, don't know anything along those lines.\nAnd well I mean do you think that should be like.\nI mean you know, like you, said, you're, completely stressed out trying to keep your business open and these events that we have at unite.\nAnd we're trying to figure out how to make this useful for the small businesses as well I mean one of the things I was thinking.\nBut, I mean, as opposed to an evening meeting I, don't know the small Business Committee Valerie.\nBut if you're looking to make contact with local representation, I think the bids and the block associations would be a good idea to bring them into a meeting.\nI, Don't know how an early morning 8:30 meeting would be for businesses.\nI, don't think the kinds of local businesses we're talking about necessarily can't make a meeting at say seven o'clock at night, but that's up to you, I.\nI can tell you that morning, meetings usually work the best for small business owners before they open their stores, and whenever we had breakfast meetings, we got a much larger turnout.\nSo, I, think that, Even though most of the community board meetings are at night, particularly under Covid-19 scenarios, where people are working from home.\nWe all know how important small businesses are."
        }
    }
}