{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB4",
            "channelId": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "title": "MCB4 September 2020 Budget Task Force",
            "publishDate": "2020-10-14",
            "shortDescription": "Tuesday, September 22th, 2020\\n6:30p.m.\\n\\nAGENDA\\n\\n1. Discussion/Vote: MCB4’s Statement of District Needs and Budget Request for the 2022 fiscal year.",
            "lengthSeconds": "1:28:59"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB4",
            "normalizedName": "Manhattan Community Board 4",
            "twitterName": "Community Board 4",
            "youtubeChannelName": "Manhattan Community Board 4",
            "youtubeChannelURL": "https://www.youtube.com/channel/UCVuHwITcFASNggyVX847NNg",
            "twitterHandle": "@ManhattanBoard4",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "fyVrqYJgfmk",
            "fillerWordCount": {
                "uh": 117,
                "um": 209
            },
            "readTimeFullTranscript": "58 min read",
            "readTimeSummary": "6 min read",
            "wordCountFullTranscript": {
                "budget": 46,
                "survey": 30,
                "document": 30,
                "list": 29,
                "priority": 18,
                "section": 17,
                "task": 15,
                "christine": 15,
                "terms": 15,
                "week": 14
            },
            "wordCountSummary": {
                "budget": 14,
                "task": 5,
                "force": 5,
                "homelessness": 4,
                "section": 4,
                "neighborhood": 3,
                "needs": 3,
                "request": 3,
                "requests": 3,
                "priority": 3
            },
            "fullTranscript": "And then we're going to you're going to stream before we have a quorum yeah, let's just get going all right. I was very disappointed. He was not a world famous writer, my husband, yes he's world famous many things, but I picked that up and I happen to notice the name, and I said I always wanted to ask her that I never knew because I've never met your husband. Everyone can know, I'm not related to the writer Jonathan Shape. Okay, oh okay, I know bummer well, it's like my husband's pretty great but yeah. I was just going to ask you know: how do you compare the writer to your husband? I happen to notice the name, and I said I always wanted to ask her that I never knew all right now, I'm getting it now, I'm getting me played back to me. I know I know it's over. It's all over everything is back to normal. Now. The cover story I happen to read was that after trump is not re- elected, he needs to go to prison written by Jonathan. So I wanted to give your family credit for that. I would say that every night, my husband not to be political, but every night he writes that like in hopes in a journal that he hopes that will happen hopes. So we are live and we are streaming and we have a member of the public and there's Jeffrey. I'm not saying anything. That's not on my twitter feed Jesse. I understand I'm just saying reminding everybody you do not want me saying. What's on my twitter feed, what's on your twitter feed? Well, you know just horrible wait: Jesse watch I'm going to make Jeffrey's head explode! No! Okay! Guess! What's coming to 43rd and 8th Jeffrey, I'm nervous Chick- Fil-, a oh gee! You know! No, we comment talk, Offline, Hi, Christine, wait where on like on our side of the block? Yes, so the new development that's being built through the 1199 project, there, no homophobic! Let me retract that that's not the one! It's a 303, West 43Rd street project that the old Times square, theater, the oh on the north side, the showroom, theater building and then they've reached out to Jesse because they want to get to know the neighborhood so tell them they need to support GMHC. Did you get a response on that? I have not met with them, yet they just now. Okay, Jesse! Should we wait for a few more people or get started? I think you have a quorum, so I mean, I think, the only person we're missing is Maria, dolores and Maria, yeah and Marie, and I had spent a bunch of time talking before the meeting last week, but I know she's been thinking about this, so just to remind everyone and also hopefully Jesse you can help remind me. The what we've set out is that we've asked each committee to go ahead and review their past submissions and look to reprioritize or affirm the prioritization of them. We've also asked that committees have the opportunity to identify two to three other things that you know are like revealed by Covid-19, so recognizing that this is a budget. This is to inform a budget that is still many months away, so it should not be something like masks for today, because that's not going to happen as a result of this budget, but there are things like, for example. Possibly the need for widespread internet access is something that Covid-19 has we may have known about, but Covid-19 has certainly put an exclamation point on that. We would want to elevate and highlight sort of as revealed by Covid-19- and I would say the same is true for I'm sure a whole host of economic factors as well, and so we've asked committees to do that. Many committees have begun working or requested feedback already, I know HHHS. I unfortunately could not join on Thursday, but that this was a part of their agenda. Welcome dolores, and so we will await their responses with the goal of taking that feedback, as well as what I hope will be a survey, which is what I think we had thought we'd spend time today discussing to then have. I do not have to kind of work backwards on the timeline, but with the goal of having something reviewed and prepared and vetted in preparation for a November board meeting that Jesse is that right. Is it just timeline? Yeah? Yes, so I mean, I would say a little bit shorter than that, just because you we should we'll get it to exactly allow ourselves to meet in late October to hopefully before exec to you know, you know, come up with the final product to then deliver or to summarize to exec and then prepare for full board sure, of course, but okay. So with that I mean if there are any questions or any comments about what people are seeing at committee. I think I certainly would love to take a few minutes and hear from folks if there have been any substantive discussions about this as of yet and then after that, I'm hoping we can move to talk about what a survey, what an approach to a survey might look like Jessica. Do you mind if I just jump in real quick? Second, just because we have two members from the public. Sally knows how we run our meetings, but I always just want to make sure everybody is aware that this is a public meeting. So if you would like to have, if you'd like to speak you're more than able to do that, you just need to press the participant tab on the bottom of your screen and press the raised hand, function, it'll, show up on our screens and we'll call on you after our the committee has had their intern their discussion and obviously, if you would rather oh, no I'm sorry. We took that off, never mind mine, forget about that, and then the members here are all the members of the budget. Task Force, Jessica Chad is the second vice chair and she is the chair of the budget task force for our bylaws and Lowell. Kern is the chair of the board and if everybody can just make sure that their name is listed, perfect Jeffrey, thank you and that's, I think that's about it. Great, thank you so for the member like. Has this been discussed at meetings that have happened so far or concerns about how you may address this at any upcoming meetings for yeah last night at Chelsea lannis, we looked at what our priorities were last year and we were overwhelmed well. One of our priorities was at least as of the budget passed was net and the other one still remains out there, but we were overwhelmed by the budgetary overall budgetary issues and how our priority sort of fit in or got lost, then the expectation of at least right now, a 9 billion dollar deficit over the next 18 months this year and next year, yeah. So just to recap on that and then I'll get to you allen. You know one of the things that I think a lot of us had discussed in some conversations and then in our last email communication was the idea that this is a very challenging. We can anticipate that this will be a very challenging budget cycle, and so you know some could say that like why even produce this of a long document of so many requests. But the feeling is that this represents. You know a decade of not longer's worth of work and advocacy and that we want to continue this format, but that we really do want to see about calling out a small handful of things that we think you know either can impact the most number of people or have the greatest likelihood of getting done, or we just see as the absolute most critical and that we want to call those out in some form of a letter recognizing that. Sadly, the economic realities are that this fix these two thick stacks are not likely. You know this that this is just an even more challenging environment and it sounds like you all were well aware of that. I do also just I had forgotten to mention one other thing that I want to say before we get to Allen, which is that some of you may remember that Senator Hoyleman actually came to us last year and asked us to identify some projects that could use state funding, and we looked back at this very document to see what those might be and made recommendations accordingly, and he has gone ahead and made a recommendation for two of our projects in Cv4. One is if you're looking at the list, the capital priority number 13, which was to renovate, which was the sump pumps that we spoke about, and while NYCHA reflects that as a bigger budget item on our list, he did not go ahead and approve 125,000 for those sump pumps to be installed as well, as is it number the building of two science labs at Manhattan bridges. So again, a hundred and twenty- five thousand dollars there something that the d.o.e had not given priority to. But he has gone ahead and made possible and I think to echo something that I know Lol had shared in his statement. That is both like these are great projects, they're priorities of our district, we're very grateful, but I think also that he came and utilized the function of the community board is really like. That's just a that's what we want and- and I think, a reflection of the knowledge- that's been shared here and nurtured here in the role that this board plays. So I think everyone should feel really good about that Jesse or will do you have anything to say about this like the senator's process or anything I may have missed. He took our recommendations and he's funding them, and you know they put out a press release, and I thanked him for that and for listening to the community boards, as Jessica said and made the point that he's funding NYCHA when no one else is so yeah, so we may actually be able to. I assume, remove number 10 number 13. I do not know that it's fully funded, so we may need to explore that a little bit more, whether or not that means it needs to stay on the list or if it can also come off, but certainly we should celebrate that as a success. When there is going to be a challenging year for wins, I'm Alan, sorry, you were going to share so at our last ACES meeting. We had Matt come by to give us a an update as to what the councilman's office had done. And surprisingly, a number of our schools were funded with various projects. Some were somewhat on what we were looking to do and it was encouraging that at least a number of these schools did get some funding for a number of projects. We'll probably try to have more funding done through the councilman's office going forward, because you know what we get back from does. Basically, you know we have to do a study blah, so we do not get too much from them. So I think encouraging thing is: maybe the councilman's office can do some of these things that maybe the city is not going to be able to do so. That's a plus, that's great dolores! I do not know if Maria is going to be able to join us, but Jesse. Do you know if any of the comments from HHHS were received by the office? I mean from the most recent meeting. No, so they deferred to next month's meeting. They basically asked the members to review the documents to send in their thoughts and to Maria and Joe and Joe. Maria would then put that together for for October's, meaning just because the other topic on the agenda was took up. You know. No. I just thought I remembered the request to send things to both you and nelly as well yeah, so just in general. Obviously we all know that the most pressing issue right now is homelessness in all of its forms, whether it's street homelessness or shelter, homelessness, it's the most visible throughout the entire district. We've had a long history of advocating for many things over the years that could have helped to reduce some of the reasons why people are actually homeless. I do think that, regardless of how challenging the budget is or regardless of how challenging it will be for New York to find revenue, it's not the time to be shy or quiet about the things that we need and the things that are most pressing. I think this is the time where you ask for the things that bring the solutions, and I- and I you know not- that education in schools are not a priority. They certainly are, but things are evolving in such a way that I do not think we can predict as easily for something like schools and their needs. But I do think that we have a very clear understanding of what the needs are around homelessness and issues that create the situation where people lose their housing, and I think that we need to be very loud and very strong and really advocate, not only for the things that we have on the list, but update it to what we're seeing right now and how it's impacting the district Leslie and then allen. No one can use the racing function. I would definitely agree with dolores, except the one thing is that we actually we do have a an idea of what the biggest thing education is and it's staffing in this day and age, and it's going to be staffing for the next for the foreseeable future. There are groups of students that have no teachers right now and anyway, we can get into it later on, but I think out of and that's not capital, obviously that's expense. So I'd like to throw something out there somewhat outside of the ACES. I think what what's come. Acrosss in this city- wide through this pandemic is health issues, access to health clinics, access to health. For folks who number one do not have insurance do not have doctors, so I do not know if there's something that we can put into the budget as a priority to maybe try to get the city to establish health care clinics around the city. I think some of the hospitals like Bellevue, that take anybody and everybody through their clinics is something that maybe can be expanded. Somehow we can connect somehow with some of these hospitals to maybe try to put these clinics. I think the like the medic clinics that you have popping up all over the place. If you do not have insurance, you can't get in there. You know if you have only medicaid a lot of them do not take Medicaid. So I think, besides the homeless situation, that is, that is running. You know all over the city, I think providing health for people who, otherwise you know, do not have access to it. I think that's an important aspect for our for our community. Can I give a brief, I have my hand praised. Oh, I apologize christine sorry for the system. I did it. No, you did. I was looking at the screen and then I wanted to talk so I apologize go. Please yeah! I do not have a very large statement about. I mean, except about homelessness, related to Covid-19 from a process standpoint. One of the things we did last year was to go through all the lists and remove the things that we are continuing support. So I hope we get to do that at a point of time, so we have a smaller list that we take care of. I'm sorry. I have to take care of that. Okay, we'll come back to Christine Jesse. You were going to say something yeah. I just wanted to give a couple updates just because I just wanted to and a couple things to add on to our to- do list tonight in terms of just decision making right. So I think, just for to do's, as we always normally do, is we sort of should make sure we divvy up the statement of district needs portion of the document, which is not the budget request, but is the you know the summary of each of the ideas and issues and like last year and the years prior we just you know people take on the reviewing of that doc that portion of the document to make sure it is it is, you know, up to date and if it's got any new information or anything like that or old numbers, or anything like that. I think we need to make sure we do that and then I wanted to touch on two things. One was the survey, so we can easily send out a survey to the public, and so we can get that input that we would normally try to get at our regular full board meetings which we can attempt to do as well, but I think we know it'll be somewhat more difficult. You normally have these sheets of paper in the back of the room. People write whatever they want, and so it's a little more free form, and so this would be a way of doing something like that. So I just want to make sure we end and end up with some action items in terms of whoever it is. You know we'll do our office will clearly put the survey together. I just do not know I think it'd be. I do not think it's appropriate for me, or you know my staff to come up with the questions necessarily unless you want us to and then we can send it back out to the group, but I think it'd be better. If we could have someone sort of take the lead and put together the questions and then we'll put it we'll send it around as a draft where people can make whatever changes they want, and then the last thing is that something that Jeffrey had an idea about and we're still working on, which is to make the the the co- chairs process of submitting their revised budget requests. Digital virtual basically, and so I'm working with our part- timer katya on a platform whether it be Google, docs or something or our own vertical response survey. Proce has a vertical response, as a survey function that we can create. That will allow the co- chairs to go on per committee, see the existing requests. Re- prioritize them. However, they think. However, the committee chose them to be reprioritized, add in new requests and then it shows up on our end as an Excel spreadsheet, which will make it easier for us to then input into the final document, and so I am working on that. I was hoping to have a sort of an example tonight of that, but I I'm not. I do not, but I hope to have one very shortly, and so that's the only thing I want to say the only other thing. I want to mention that about clue last night, which I it was not, we did not really end in a final decision about, but if you for, if you remember right, there was a lot of discussion about this idea of of a study or asking the city for a study or or asking the city to really. Basically, you know work with their the private sector as much as they can, which it's clear that they're, seemingly not because of that letter that was sent out by all these private sector folks but- and I think that's that was sort of universal in that idea of saying that there's going to be a solution coming forward and we should not wait for one side or the other to try to tell us what it is. But there should be a conversation happening which is not really a budget request. It was just more of a an idea of saying might be something: that's what the board should be communicating, while this is happening at the same time. But that's the only thing I wanted yeah. We did not come to any real conclusion. We had a discussion back and forth. What we were discussing was the possibility of a study of no. It was not sure if it was a zoning study which would be much more technical, but just general land use and changes of use in terms of you know, office, buildings, residential vacancies, and we were aware that we're only at a point in time and no one knows exactly right now what the what the projection will be, what will be 18 months from now or three years from now? But if we thought that it would be helpful to have some kind of study of what's going on or what could go on, how it would fit into the our budget priorities we what we were not sure we did not suggest it be added, but we're thinking about it right. I want to go back to the survey, but christine was in the middle of saying something before her call, and I wonder if you want to finish that thought before we move. Thank you I'm so sorry I had an emergency yeah, I think. Well, first of all, do we have sent transportation, has sent a little survey just to the members saying please prioritize the issues we have which are, and we have selected a very small portion of issues to prioritize, so that would be a feed to this process and I think I think, that's important to also consult in a wider way. What are the priorities perceived by the community in this time of Covid-19, which may be different from what we perceive, and it may be an focus on something different, great okay. So, let's split, I think we should jump into the survey then specific. This is a perfect segue. It seems- and I think there are obviously many ways to skin a cat in terms of getting community input, and I I'm curious to people's thoughts on. I think the two ways that come to my mind are one to say: you know, let's pick the top ten of capital, expense and kind of feed them back to people or some number. I do not think it's all. You know all 40 and say what are your thoughts on these? Alternatively, you could just throw it up more open, more broadly and say: what are? What are the needs? As you are, you know as a resident of CB4, what are you seeing and we can have them select based on category or on agent? You know things that correspond to an agency, but maybe things that you know I'm mindful that the budget task force in the past has said you know committee has to hear things before it makes it onto a request and so opening it up broadly and maybe getting feedback that has not been really pursued by the committee could still be good for our board, but not necessarily instructive for this budget exercise. Jeffrey, I feel like you're he's. I do not know, I feel, like you, have something you're thinking about. No, I think that they'll know one of the questions that you guys are going through. I'm sorry has that ever happened. No, I do not think it has on a community board meeting Zoom Caller in person, okay, sorry, delores and then, and then christine so Jesse had included in the dropbox the needs assessment, which I do not know. If everyone has had a chance to take a look at that, and so there were four themes that and when in March and obviously March seems like ages ago that had come out from that study. One was around homelessness. One of them is around youth unemployment, and there was also the identification of senior concerns. I think all of these, because they're identified could be big buckets and then christine, since your committee has already identified the transportation that would be another bucket. I think it's important to give parameters only because I think if we leave it open in a survey, you'll just receive every single potential personal little story under the sun, which may be very hard to figure out. How does that translate? Acrosss, an entire district, I think using that document is helpful, because it's already been vetted that these are areas based on their methodology, that precove it and also it going into cova there. If you looked at it, does make comments about what they were observing at the beginning of the pandemic. So I'm just thinking that we just create those larger buckets, because I also think it's tough. If we give them our top, maybe 10 in expense and capital, those types of categories may not be necessarily understood as clearly as more food services for seniors or reallocating money into the summer youth employment program. Those are probably a little bit easier to understand in those categories. That's just my thought: okay, christine and then Leslie yeah. I agree with dolores. I think we, if we have major categories, you know major buckets and under those buckets examples of things that are already listed and I would not put ten, I would probably put six- I mean you know or five and say these are the kind of things we already have on the list and then tell them. If there is a very big need which is missing. Please mention it right. So the people could prioritize the category and then the list would be exp. You know Expl explaining the category in a sense and then ask them. If there is a big something we miss completely yeah, then they have a place to say that so and then they can prioritize. You know number one. Education number two homelessness, whatever it is, and then we get a sense that the bucket and the things under it are high priority. So that would, I think, that's maybe a way. I think dolores is on the right track: okay, Leslie and then I think, for I do agree with the bigger buckets. Also. Would it benefit us? I thought we were going to switch it up as far as what the priorities are now in the age of Covid-19 like before, DSNY was not maybe a priority and now basket pickup or trash, at least in our district is a huge priority for a lot of residents, or you know, arts funding. You know certain things that have just been decimated by Covid-19. Are we re- prioritizing, or are we just going for the survey or are we going to give what we already the pre- existing list? Well, I think we have not decided, but I think dolores suggestion was to look at the assessment, which highlighted those four big areas. I do think that you know we have the ability, whether it's christine's suggestion of saying and what else or even adding, on and saying you know I mean, I think honestly, we've heard a lot about trash pickup. I feel, like that's, become a very like we've heard that now at a lot of committee meetings and like there may be things we want to add on that list. But I am mindful that what I'm hearing a lot about might be different than what other people, how we have a thoughtful system or approach for deciding what we're adding versus what we're? Not adding. I think, as a committee, we still have to decide that I do not know Bert and then, but Jesse also has something I do not know I'll do I mean I defer to members first time. Okay, so we'll go to Bert and then Jesse oh you're, on mute, though thanks for your deferment Casey. I just wanted to endorse what dolores was saying and I do think we have to have some space there for people to contribute themselves, because otherwise they're getting a survey and it's all predetermined. If I were to get something with no room for me to have my say, I'd say what the hell am I doing this for yeah. I think I totally agree. I hope others do too. I think also the a big part of this was to say to recognize that there's a lot. That's happened, you know to our city globally and very locally and very personally, and I hear the concern that we do not want to hear you know what happened to Sally and why her trash is not being picked up specifically, but I do think we, the point of this survey, is really to get more community input. So I think the purpose of this survey is one to get more community input and two to get more awareness of the community board out there, and so I think, I'm sure you've already thought about this, but I think that needs to be some kind of preface not too detailed. But what is this part? What process is this part of? Why are we doing this survey and just a little bit about you, know every year, no not to drown the rest of the survey and turn people off by that first paragraph, but it needs to have something and we, I do think it's important that we're out there, because when we have this in the past last year, the year before the year before that you know when we present this to the full board, anybody have any comments from the public. Neither there's nobody there, almost I'm exaggerating, maybe yeah, that's only because Jeffrey's so thorough all right, so we want another way to engage people. That's what this is. I totally agree: okay, well, I'm just going to get to Jesse and then we'll go to christine I'll. Just quickly say I agree with dolores and everybody else, so I mean, I think, in my perspective, you're asking the community to give you the broad shifts right, like the general idea of like where what are the top three like the way that the document itself it runs as it runs. It says: what is there like what are what's really important to the community? What are your top? What are the top three things that you support to the Community board and then it goes into like the really detailed stuff right. I do not think we want to get into the detail stuff because that sort of then gets into also. What are we going to do with that and if that was not something that was ever brought to a committee, and now we've asked for that piece of information, and someone says oh well that my school or my block needs x, and you know we do not really have anywhere to send that, except to next year's board. You know I mean next doing budget process, so I think I think the idea of a broad of being broader- and I do agree with Bert- we definitely give a. We can put together something easily to sort of explain what it is and why it's important and all of that- and I would say that maybe the idea also just to look at the way that the document is broken up itself. I think, while this, while what's the each sort of spheres describe it given a certain title, we do not have to use that title, but it does break up sort of all of the sort of general ideas. If you look at the the summary of the beginning of the summary it sort of breaks out the eight or nine sort of spheres of you know, you know response and agency kind of involvement in the community and maybe that's a good way to start. You know so, and I think I agree that some issues that we're have been highlighted by and I do not know whether we had that but like sanitation and small businesses- is something that has been you know, elevated and I do not know whether we have that anywhere in our list, but I mean that's something we can put on the table as I do not know where it is. I mean you know EDC or whatever and say: could some business be helped or whatever and is it? Is it the top priority for you? That's. You know question one right, so just on that, how will we feel if there are things that are identified as our most top priorities? That honestly are things we have not yet thought of, or you know I do not know if everyone remembers, but the United States allowed someone to allow like a group to name a new ship and they named it like the what's its face like they actually had to name it that, because that's what that's, what the most crowdsourcing provides. So you know how will we feel if there are things that do not conform with what our committees or our needs, see and just from a process perspective? You know, how would we think about handling that yeah, I'm going to let Jeffrey go and then Bert will go to you. That's what scares me the most about it, because we need to provide for process, and I think that's the answer, so we have to if there's something new that comes about to me. It almost has to work the course of discovery. Okay, then, that new item gets referred to a committee, we learn about it and then it gets folded into next year's statement of District needs. I do not think that it inherently becomes a part of this package, but it you know, bubbles itself up to to being. You know in front of our eyes, so I'm seeing nods but Bert and then Christine yeah. I I'm not afraid and it could be very exciting, because we could discover something that in our vision we just did not see, and I would not preclude precluded from being included in this year's budget priorities or this year's statement of District needs. I really can't imagine something coming that among the nine of us or the 11 or 12 of us has not been seen or has not been thought about, but they just maybe- and I think your word Jeffrey was discovered part of the discovery process. I mean this is what we do. We want to expand the process and include yeah. I agree entirely. My worry is that if we have not opined or taken a position, is it appropriate to just insert it into this process? Not without referring it to a committee but to what Bert said that does not preclude it from the final cut this year right. I think there are two different levels. I think you know. Let's say it's small businesses right and we've I mean we have had a task force on it in this case, so it could be at the level of saying you know. Small business is a very big concern in our neighborhood and you know we wish something was done and we refer you to those recommendations or we do not have any recommendation and we just can elevate that as an introduction and not as a small, ask small or ask or specific ask you know: yeah Leslie guys know we will get micro stuff and I think it's going to be like there will be the bigger bucket, but they will write in something specific to them and I think I think the process will be great, but my fear would be that you get a group of people like you always do. Who are you know what I mean and they all kind of have their issue? And then that's the one that's going to come to the top. It's not necessarily a broader, a broader district issue. I do not. I should not really say it's a fear. I mean it would probably be good to bring to our attention either way right, but I think we can think about the additional framing language. I mean I'd love for this to be a almost a quick survey so that more people can participate. I think, like I think, if that's also part of our goal, to get a lot of feedback. I think something. That's too laborious we're going to lose folks, but hopefully this can be an entree if this is really about engagement, an entree or a way in to engage people more broadly, but maybe we do need some language. That says like we're. Looking for the issues that impact the most number of people, you know and those issues that are most local, I do not know but Jesse and then we'll go to doors yeah. I think we need to trust in the process. I think you guys will be fine. We have you know, we have sanitation needs in there from 10 years ago, and it's gone up and down and backwards and forwards and up the scale and down the scale and change to all sorts of different things. You've got education needs. So I think that's what we're asking in my opinion, you guys are asking for where what are the? What are the general topics that we should be prioritizing and then the specific stuff? We is that it falls under that and say yes. So that's why we're prioritizing that? I also think you do have to give yourself some leniency that, as we've discussed before at full board in other situations, we are in a whole different world here in terms of what's going on so right. Have we all you know? Have we been writing the last two months about specifically the basket pickup issue? No, but you know it's been on, it's been always a long time priority and it's in it and it's gotten dramatic cuts, so we're going to respond to that in some way. So I think he'll be, I think, he'll be fine and I think in some ways what it'll do is it'll give like Burke said for all those folks that, like more like Albert endlessly said like if some group comes out and they all organize around and they go, we really want x to happen. Then we can say great, come to our education committee next month or come to our housing committee and talk about it and we can get you on or transportation and we'll get you on the agenda to really start to advocate for and we'll get more people involved in the process. I love that I think it'll be. I think, it'll be fine, and I agree that I just and the idea at the beginning, this should be added into Bert's. Slope. Intro is that this is clearly so people to recognize. This is not participatory budgeting. This is this. Is that this advisory me that it's sounding a lot like participatory, but we're not asking which I am not people to like vote for their vote, for what's going to get funded, we're asking for people's you know really. I just I just feel like to the point like if we get 50 requests for one thing, that as a budget task force, we actually do not think should be highest on the priority list. We should not feel compelled to make that the priority just because we heard it the loudest and the most. I think it's very important that we do not apply the Pb logic or sort of majority rules logic to this process. I do not think so again. You trust in the process. Right you have it. You have a budget task force we good for that purpose. I mean, unless we could just expand above the public, the budget task force, and I could just be sending out surveys all day and we could all be. You know yeah. I just wanted to say Jeffrey. I know your concern and it's real, but I think that in the same way when we have at full board when people come to speak for two minutes, we may have a lot of people that show up to speak about it and if it has not been a position, that's been taken before we're always going to say at the very end of it. Please come please contact Jesse and we'll arrange for what committee that fits best with, and I think that I do not think I'm not worried about it. I think that even if we get the craziest things that are coming up, what will happen is again if it is something that's real and there's enough support around it becomes then a public discussion at some committee meeting and not something that we just throw into the into our document here. So I think it's healthy and I do not and again I do not think we've ever thought of budget task force as the most yelling and screaming gets it to the top of the list, because we have a history of what we've, what we built towards, asking for and also getting the temperature of what politically is feasible, and it's really like Jessica said it's just to get people in it's just to have more people in the neighborhood know what we do be aware of what we do and hopefully join the process more than a specific budget item, and maybe they'll come to another meeting and maybe they'll come to another meeting and I think that's healthy, well, you're on you all right to that end, I think when we send out the survey, we should probably say something up front that you know the ideas will be filtered through the budget task force to the Appropriate committee for review. So people do not think up front that hey. If I get 50 people to say this, we're going to get it funded right in the instructions or something does this need to be. I mean the budget task. Force means nothing to the average person on the street, and so I can appreciate that internally. We may need to identify this as a survey of the budget task force. I do not even know if we do need to, but like do, people need to know that this is being collected as we think about budget requests. Or could this be your CB4? You know leadership is asking for your for your thoughts and opinions right now like we're in a unique moment in time. I think the budget task force gets. I mean the CB4 budget task force which is charged with you know, formulating. The statement of district needs is asking for your input, we'll take all the requests, we'll filter them through the budget task force to the appropriate committee and consider them for inclusion in next year's statement of District needs. That gives us enough legal coverage that we can decide to do whatever the hell. We want with the information that we get yeah. Okay, christine asked the question in the chat: go ahead: Christine, I'm sorry yeah. There are some comments that there are some members of the public, whether we should open that well, if they have it, they raise their hand sure so for Rizia and sally I can I can if everybody's comfortable, like oh there, we go Freezer's open, perfect great. It looks like we need to unmute or yep she's good hi, I'm an intern for bid, the hell's kitchen and Hudson yards business improvement district, and for like the surveys and stuff, I was thinking. Why do not? If you would like to like pick, let's say 10 things that you think should be on the budget and kind of like send that out to people having them pick like out of those 10 which they think is number one, two three four five like their priorities and then kind of like, and then you still have you still get to put what you feel is the most important, but also getting other people's input. That's all! Okay! Thank you for the suggestion. Thank you for joining us tonight, okay. So how does sally, if you have anything to add? Please just you just let us know by raising your hand or that's really how you do it. Yes, it's really only the two of them. Can we just move them over to the make them? I'm fine with that, as long as everybody else is fine with them yeah. I, like the nice nine of you, but I guess in the interesting topics the end of the Brady Bunch seems to understand how we work and Sally knows how we work, so I'm not worried about them. Zoom bombing, us, okay, so oh Jeffrey go ahead. I was just going to try to move into whatever you wanted to package this into or no so I think I mean it sounds like we're going to Jesse. It also sounds like your staff off you offered that your staff could help pull something together. Is there anyone here who's, interested or able to help spearhead this survey component? I took some notes which I'd be happy to share back out. I'm also happy to work on it some, but to get this over the finish line, dolores delores, great, all, right, great and Alan great. So, yes again we'll be if it's okay, we'll wait to hear from you guys in terms of the questions and then we'll put together an example, a draft version of it and send it back out to everybody or just to you guys, first and then to everybody and get signed off, and I think it would be great in terms of timing. I do think we do want to get it out as give everybody as much time as possible and announce it at full board in October. So if we could do it next week is exec and we have all this week and then next week before full board. So if that's possible, that would, I think, would be great if we could blast it out with the full board notice. Let me clarify the process so you're going to get the top nine. I mean the organization of the budget. Try the top nine categories and then under those categories is what is in. Are we changing what goes under it or not? How do we select the three or four that go under that section? When there's a question, do you think transportation is? You know important blah? What are the four or five questions? Are that the current question? You need new questions, I so I it's still, I think very flexible. I mean my thought was. This was not going to get that deep where it was more about which of the top, which of the nine categories from for Ex. As an example, I mean again with prioritizing those categories and then, if there's something else we've missed, then we then there's and then there's so I thought we were going to put under. As I know what you're saying I thought we were going to put under those big categories example of what is in the budget for it, so that people get a sense of it. You know, but I think I think that's right, but if they're just examples then I think we could just pull like the top three or four requests that align with that category in the order that they've been previously prioritized, I will say we just run into a bit of with that way of doing it and again we'll if we can figure this offline and send it back around and figure it, for example, though, like what Leslie said is that like, if we do examples for ACES, which is mostly schools, we're listing like specific school projects, you know and then people some people are going to say. Well, that's not my school, so it's not a priority. You know what I'm saying I just do not want us to get into the people starting to get voting. Maybe they maybe they agree with that. Transportation is important, but we listed 34th street. You know bump outs as a as an important thing, but not their block and then they're like well. You know in the in the chat like the request is, for example, much more general than the specific reason, so we could just instead of using the actual specific project, but I do think there is. I know it seems like this. Nine is Jesse what you had sent over in the chat here: Health and Human, Et cetera on that list, but it also sounded like we were talking about using the four areas identified in the survey you know I just maybe we want to come up dolores Allen and I can kind of hit our heads against them. Maybe it's 12. right. I think it should be yeah. I think I think they're embedded in there I mean. Obviously you know under giving more examples under human services. Again we can make those buckets and again, even in our statement of district needs, we had the different buckets. There was requests for more funding that prevented homelessness, expanding vouchers, allowing you know for education so that people were not put out of their homes and then we also had specifically for providing for more shelter services. So I think that using those general buckets that Jesse provided and then the examples again like we've already suggested, not saying Ps 111 is looking for an air conditioning system, but your upgraded school system, or something like that right, very the very broad category, and that way we'll get a real pulse of where those concerns are all right. Now and I'll just touch base with you when you may be available to throw some ideas around. Can I just go back to the statement of district? Not this the the needs assessment. The community needs assessment. I just want to give that more weight, because I think we paid for that. It did the work that we're basically trying to already kind of replicate a little bit. You know in terms of you know, this is a little bit different. Obviously it's a but I just wanted to say like I, you know, I just think those are the those are clearly needs that the researchers have found, and so I think we should definitely use that document in terms of go when we make our final decisions about stuff. Just because it's you know it's a it's a real document, official document, that you know we paid a bunch of researchers to actually go out and do so. I do not know if we need any more. You know people from the I'm not saying we should include it. I'm just saying I just do not think it's. You know. I think this thing it's, it holds its weight already. I do not. I do not see the downside in doing a survey on top of it, though Jesse no I'm just like I just do not want us to get us yeah I just do not want to get lost, is what I'm? No it's like. We have a survey already done. I mean we have a study done and then we have a supplement, which is the survey right. We bring back we'll, put everything together, okay, say and that study as a lot of weight. Great okay. Are there other? So this survey we can dollars now and thank you for agreeing to work on this. I'm happy to work with you guys as well to get it done and let's try to get something. It sounds like before exact we could share an update there and then before board, have it be prepared to circulate just a reminder. Exec is next Tuesday yeah. No, I do not know if you saw the panic when he first said that, but yes, I did not say exactly by the way. I said full board: yeah Jessie, that's great, I'm giving you a whole another week, sorry, okay and then, in terms of I mean each committee should continue to go back and refine this list or the list that reflects their committees as well as identify these additional priorities that they may see, and the sooner that folks can share that back the better jessie. I assume we need to get another meeting of this group on the calendar. Yes, we should. We should should we in this meeting in this meeting. Should we go and remove you know, did what we did last time, which is really put put the things which have been done: remove them and those things which have been approved quote unquote, put them in continuous support so that we are left at least with the subset which is cleaner sure to to. We can do that quickly, right sure, I'm happy to start to take that on Jesse. Do you feel like we have like is everything? Is everything noted in the document yeah I mean I have not changed the document at all, so I mean I can pull it up on the Excel spreadsheet I mean. I also could just do that if for next meeting, if we want to say that we're going to basically pull everything that says that it's either funded, you know, you know, are partially funded and move them to Cs, and so what we're really talking about next meeting, I just again, I think we'll go over it anyway, at the end just to make sure, because there's always you know devils in the details of when they say it's partially funded or yes, we'll fund that with existing budget. You know that's, actually we have to be careful because it may have been funded, but no more now in July and it may have been cut in September. So we have to be aware: yeah Jesse, like the NYPD re, looking at all their spending, I mean, sadly, just I'm sure you guys have already looked through this, like I'm up to number 15 and only two things have been funded, so the list of things that they even said here in general, even it was a bad year for wins, even pre- covered right. So well. In fact, I had a question which is in some of the transportation the D.O.T said we are going to do it. We agreed that we are going to do it right number six. Are we going to move that to continuing support or we leave it on the on the list? What's your thoughts well for your new category, christine yeah, I agree, but it has not been done yet yeah. I think a new category makes real sense in Covid-19, saying that we recognize this. What has been committed but because of the uncertainty we want to ensure that this is still noted, that it's a priority for the community. I can't does not that undercut the idea of maintaining our ask be damned like. I think that creating a separate category gives the agency an out to say: oh, it's over there now all right, I'm going to use a concrete example. Here we knew that the NYPD was moving the service stage station service station, eight off of Pier 76 and Jesse heard last week that NYPD is re- looking at all their funding, they had committed to do that. They said they were going to do it, but now it's up in the air again. So it's not something to can you know continue the ask it's like hey. You said you were going to do. This still remains a priority to us. We expect you to get this done. Can I just jump in here real quickly? I it's. I do not. I it'll be hard. I agree with Jeffrey's Jeffrey on this. I one we do not have control of the categories. You have two categories: it's either on the list or it's continuing support or you're, taking it off the list. I guess you have three categories, you take it off the list. It's gone, it does not. You can always put it on next year, but there's no, you know funded list, there's continuing support and the and the list so you've got our cover letter, though, where we can create as many categories as we want. We can say continuing support on the budget. You know on their Excel spreadsheet, but on our but we're not going to get a response to the cover letter right we're going to get a response to a budget item that says this is still important, so I think we move it to cs to our knowledge, what the information we, because, first of all, again it's all up in the air by the time this gets voted on. We might be talking about an entirely. You know. We do not know what the actual cuts will be. So you know, I think you need to keep it on there or you put it lower on the on the priority list or you put it in a Cs. I do not. I do not think we have the you know. I mean I can go back to DCP, which or which is the one that designs the actual platform for the form to be filled out, and I can rally other community boards to in our district, our borough to see if we can get it, but I do have fear that their point with Jeffrey's point is valid, which is that it's not it's not going to be it's hard enough to get the responses that we do get to put on some sort of subsequent annexed form. I do not, I think, you'll lose you'll, lose it whatever traction, you get all right. I stand down. Okay. Is there a reason like? Why would not we put it as continuing support? Because if it's continuous support, they are not going to respond to it? So we are not. Let's assume it is. We think it's going to be done. We put it in continuing support and then they changed their mind and they cut it. We do not know whether it got cut or not, but is not that true for everything. Always no! I mean you know when it's continuing support, it's really funded and it's going, you know yeah, it's usually only keep continued support for something. That's got already initial, at least initial funding or is almost funded. You know, but I think christine your point. I think this is where you know we have to do our homework as members that we know you know, like you have a relationship with as a co- chair, you obviously have we have a relationship and the office has a relationship with the ot and we might need to go and send them that list and say we need to know is this all still is this actually all still accurate, and if we have to do that with other items, you know we'll have to do that and see. If we can get a better answer and if they go then we know we have to keep it on there right. Okay, come back and say: oh yeah, no, that's already! It's already budgeted. It's already been. You know the money's already out that you know already in the line. It's not going anywhere. What we're faced with right now is the old category of continuing support. Today is not the same as it was then yeah right. It means something different. It means it means that we had it in the budget, but we do not know what's going to happen tomorrow and in our internal list of what we, what we might have to give up they're not going to tell us, but it may be on their internal list, left to be given up just at dollars. I'll get two in one second, but I was just again my quick read: there are very few things that actually indicate support and at least two or three are DOT. So if christine, you could take those on to follow up and then that could help us determine what we want to do. The other is the NYCHA number three it says will accommodate in part, and I myself do not know what the NYCHA update is, but we could speak to and I can find that out. Yeah, great I'm sorry, dolores my thought was, is, I know it's more work for us, but perhaps an additional letter goes out to each of the agencies for areas where we think there's a risk that budget commitment is not met and if we flag those, even you know for once christine where you think you should still put it on the list for any that we think are at risk. We just from the budget task force, have a letter that goes out that says recognizing that things are in flux. We wanted to highlight that this has been committed to in the previous budget and, if there's any potential for an update, that would be helpful and at least that would status it if nothing else and puts on record that we still find that these are items of priority yeah good idea, all of you. Okay, are there other things we need to cover here tonight. Other ideas jessie just a reminder that we need to divvy up who's. Reviewing them. Oh yes, can you walk me through how that works, because I sure so in past we've all divvied up sections and typically usually, if it's someone who's, you know a co- chair of a committee we'll do we'll just quickly review the section on transportation, for example, christine will do and you know section on parks, you know Jeffrey can do you know Alan and you know, and so we do it that way, you and then, and then you usually review the the initial statement. The first service, this you know summary of what the district is and what the issues are and all that kind of stuff and then obviously give a quick review of the other, the other sections just to keep making sure that there's not so many glaring things which I can. I can obviously support help you with on that because well, I have my copy here, so I will, I will put it by my bedside and get on it. Maybe we can just go through there's like the sections that are broken down and not that I expect everyone to have it in front of them. But under summary, it lists the different areas. Maybe we can just is that what Jesse we would normally do divvy up to committee chairs yeah. Basically I mean you know. Each section starts off with the you know, like the healthcare and human services. Section starts off with a summary of what our concerns are and gets a little more into depth about homelessness, and things like that, and you know someone just needs to check that and make sure that's still all accurate and up to date and if there's stuff that we want to add that's also where we would add things obviously related to what is going on now. So I do think, that's specifically about homelessness and other areas that we know we're going to want to. You know we are not just so I'm clear on our assignment and apologies. You've all done this many times, and this is my first round, but we are not only reviewing we're, not just editing necessarily we're actually looking to add, based on the moment that we're in right now we can. We definitely can you know. Usually it's usually been quite static. I think as a document with rare exception, but I think we're in we are through the looking glass at this point. So I do not. I think we should decide on that too whether we want to address the temporary hotel shelters in that. Do we want to address the you know, reduction of the programming that sparks has done. We want to address the sanitation cuts. We want to address the facility issues with edge with DOE schools. You know open restaurants program whatever it may be. You know right, so I think that's a decision. We want to make whether we want to include that in that or do we again sort of similar to what the priority is saying, we're going to keep to that and maybe then just leave keep those portions static as they are update them in terms of year and if a couple data points or need to be corrected, but then maybe with the Covid-19 portion that we're looking to do right where we're trying to get the top priorities due to Covid-19 and the economic. You know impact of cobit, that's where we'll include all of the new and that current new information. So should we have a maybe at the beginning of each section, like a paragraph say you know, covey the highlight or something like that and then go from there. That's a way to do it too. Maybe you keep the thing and then have a news under the introduction you have Covid-19 highlight, and then you give a brief right. No, that might be a way to do it. So therefore, five years from now and well, you know you know. Hopefully some folks are still on here. They due to term limits only that's what I was referring to term limits, not anybody's health. You know that we are easily can just say: oh remember, those bad old days. We can take that off now. You know yeah. I like that christine that's a great idea, Chris point something out: Maria showed up just in time to be assigned all of them all of the work. Well, dolores generously operating oh hey, Maria hi, so we were just talking about the we're sort of wrapping up about looking at the statement of district needs and how traditionally the sections that are outlined here, get divvy back up to the committee, most responsible for those areas to review and update and with christine's suggestion sound like there was agreement. We'd also look to add to each relevant section, which is probably all of our sections, something unique to the Covid-19 moment like what is what is happening right now. That, maybe is not, maybe is new, maybe is or is it long term we do not yet know, but is happening right now, so maybe like the temporary shelter relocation, those kind of things for you so to go through this list and dolores offered. It starts with healthcare and human services and dolores offered to review that with you Maria. So if that's okay I'll go ahead and assign that to you, youth education and child welfare, I'm looking at you Allen and Leslie. Are you comfortable taking that on they have to they have to great? I was going to say in the matter. Yeah well public safety and emergency services. I take the upgrade core infrastructure, city services and resiliency. This is a typically a split category, because resiliency comes into a Wpe Bert. I think you've worked on this one before also. I do not know if we want to mix this one up or it's all yours. I've worked on sanitation. Is that included there? No city services, yes, city services, it's in there, sanitation, there's, sanitation there I'll, take sanitation, okay, so Bert and Jeffrey will review that housing, economic development and land use, maybe Bert and Maria. You can both look at that yeah and bert from a land use perspective, transportation parks, cultural and community facilities, Jeffrey, Yep, absolutely and Alan. I'm going to want your eyes on that too yeah. We can that's that that's arts too right, I'm guessing culture, arts, and I can help you with the parks parts Jeffrey. If you want. Thank you all right. Well, I was going to actually assign you to read the entire document. I know I know you were okay, I will do the same. Any I mean honestly. Feedback on all sections would be welcome and I think helpful, so if people do have the opportunity to review as a whole document, particularly given the unique moment that Covid-19 has you know offered us Alan. May I volunteer somebody from our committee to work perhaps on some of these issues yeah. Can I volunteer blake on something yeah, but he's not here. That's why we're volunteering here you can tell us, but that's not going to happen. No, I think, maybe on some of the issues that Jeffrey and Bert are working on. I think he might be an asset to him. That's just an opinion. I mean, if you know you do not have to. I guess it's just from a process standpoint, it's bringing them up to speed, looping them in. I do not know, and then my second question is: how are we getting this information? However, what's the process here? Are we sending stuff through to Jessica and Jesse? This is not a final, so we're not going in and editing ourselves are we? No. You we've done that in the past, I've sent the link out and you guys can go right in and start editing the actual documents. So I can do that shortly is not that when you set up an account with DCP and stuff, like that you I have to that's a great question Jeffrey originally, you did not have to do that. Let me yeah because you did have to do that last year, and so let me go back and make sure that does not. If that has to happen again, it's either that you guys have already done it once or if we have to do it all again, then we'll do it all again, but I would hope to God. We do not do we. Where do we put the small businesses? I was going to ask that exact same question. Actually so there's SBS under housing, economic development and land use, I believe, okay, which is what small business services and those types of things are. I believe EDC is there as well. So that's really where you would do support for small businesses through a budget lens. Obviously I mean through a city budget lens. I mean right again remember this is the needs section right, not the budget request section just so we're all aware right, so we're making our argument to then roll out our needs on that. So just you know right so who is taking care of that section? We had Bert and Maria and great again. I think we are at a very unique moment- and I think, the more for the city and I think, the more eyes that can look at this documented sections that maybe you are not even assigned to but may have feedback so that we do not miss opportunities like small businesses or safety or other things that may have connections to section to other sections. I think that would be helpful right. Jess. Do you want everyone to send this back to you and then you'll forward it on to me, or do you want everyone to copy both of us when they send it back? Well, I think it's a question also. How are we collecting that feedback and Jesse? It sounds like you were just that's what you and Jeffrey were just yeah, so I think I think what makes I mean if it's easy. I would hope that if we can get everybody access to the to the document, then it's simply just everybody goes in. Does their pieces lets us know when they're done? We then, once everybody's we'll cut we'll create a cut off date, then Jessica and Lowell can go in and you know review the whole thing, and you know if there's anything, that's questionable. We can just you know, send it back and forth and say: hey. You said this here in this section I think it that does not make sense or something. So if we can not, if it's a if for some reason, it's difficult to do that, then I think what we'll I'll do is we'll have to do it. The old- fashioned way, which is basically section by section word, document kind of thing. So if we do it directly in do you see it in track pages or no it's the platform. You you're not going to see any track changes, so you would, you would have to you're just updating the existing text. You can then send it around to let's say: let's say: if Jeffrey did, the parks and environment stuff got everybody's input on it from his team, his subgroup there sent it and then sends it to separately, sends it to you and Jessica and Lowell saying here's what I made the change. Here's the changes I put in I changed. You know, change this sentence and change that sentence. So then you know you're just looking at those two sentences really Jesse, I'm just wondering. Is it possible to download it work on it as a word document and then re- upload it instead of having to make the changes? No, it's not an upload and download situation. Each portion has its own text box. Thing Jesse you sent in the dropbox. The statement of District needs the 53-page document. It's in a pdf form. Is it possible? Do you are you able to convert that? I can get it converted at work yeah we can. We can convert that again. I just want them to make sure that what we're doing is then each person is taking their section, sending it to Jessica and lowell with. I guess the like track changes in it, they'll approve it and then I'll, then I'll just cut and paste it back into the into the platform all right so who has the pdf or who's going to generate Jeff Jeffrey can Jesse? Can you generate the pdf? We have it from last year, dropbox all right. I will get that converted tomorrow. Okay, I know this is extra work compared to last year, but I really last year scared me a lot because you were there was not track changes and it was, I remember, going through it multiple times just to just to make sure. So I think this is a good working group process. Yeah. Thank you, I'm glad, because I prefer to see it in track and felt bad asking for more work, but if it was would have been helpful last year. I appreciate that. That's fine. Can I make another suggestion, though? Can we maybe would it be okay, since we're all working off of different sections? So would it be people working on top of each other in the same section? Can we then turn it into a shared document, though we will talk, so we can all work on it at the same time right. So therefore, I'm not worrying. My concern is at the back that I you know christine sends her things in and Jessica approves them two weeks ago, and then we just get in something from parks and I'm you know I missed. You know a second third draft of something, and I you know- and I just do not want to miss that mess- that up redline. I'm sorry can we do redline in Google, Doc yeah. All right. Somebody has been the only issue with Google docs. Tell me: if I'm wrong is that you do you need a gmail? You do need a gmail to edit. No, I find editing Google docs a pain in the ass. Quite frankly, I agree with you. I have. I have a really hard time dealing with it, but dolores do you agree with this yeah? No, it's I avoid Google anything, but we can do hopefully not on it. You can work on it in real time and see it happening, I'm happy to send one by one of how to do track changes if we want to well that'd be helpful for that. It's super simple. As long as you can do it, I'm happy to send this for the how- to I'm willing to try. Thank you. I mean I failed miserably in the last two years. I was using it today on another document. I really hate it and would prefer to use word okay, so maybe what we can do, maybe as a compromise, if this is okay like if Jeffrey's willing to do a tutorial to get folks on board that can use it. That will be where most of us do our work. If anyone wants to send me their proposed changes in word, I will put them into the Google Doc. No, so let me let me let me can I offer something else, we're part of the city. At least our offices has you know, 365, you know and that's got cloud capabilities. Let me let me see, because that does not work the same way yeah. I do not know those do not work the same way. It does not work the same way. It does not work functionality of Google Doc, where you really have the document live in front of you, but I have I use word at work where we're all on one document making changes I mean 365. Now is completely cloud, I mean we have every program underneath it. I I'm almost certain we have this, the basically the same kind concept of it and it's windows. I mean it's word, so let me I'll I'm not okay, I'm let me just do my do my homework on it and if I can get it to work where it's where you all can edit it without having to create Google, Doc yeah, I think they may just require us to like give a password so that we can access the file. But if you share that with us, then that should do the trick. Okay, yeah, like that's the equivalent of the gmail address, like you, still have to log in to be able to access it, so the whole world can't access it sure yeah. No, I get it. I get it. Okay, 365 is better than Google docs, but some of us still the closest thing to hard copy. You can get we're old- fashioned. Well, I've sent it in that. Okay, so you still do word perfect. I do I'm a dinosaur. Is there anything else we needed to cover in our time together? No, I think, is everybody clear what their responsibilities are and what what sections they're reviewing I will send out. I will send out at least the what I can put together in terms of well. I guess Lol is going to take care of the form, the pdf thing into the into the word document and then we'll figure out how to we're adding is each of us sending something to Doris and Alan, and you about the survey. Like our own section of the survey, I thought Alan and delores were going to actually put together a draft first they're going to put together a draft and then we'll all comment on it and then they'll circulate it around. Got it and that'll be in a word aggressive. I hope so why not as we as we're working on this, I do not know why not okay Jesse, what is the timeline for having the statement of district needs updated, so we'll need it. So, let's just look at the calendar all together, we need to vote at November full board right, you devoted, but November full board, but let's just go backwards here it usually goes through. It does get a reward and then it goes through. Usually at least a summary conversation happens at exec so that this exec is October 26th right, so it needs to be ready by before exactly yeah one week before well, yeah I mean well, you know I mean I'll, be honest, we'll remember we we've given a very detailed explanation as to you know we can get the we can get the top priorities to go. You know the sheets, the Excel spreadsheets are the top priorities and all of that, and then we can go through like that at exec. But the document itself, I'll be honest with you- is truly not ready for you know, prime time in any way, until I'm like really the la right before, like the 30th, the Friday, the Friday before, because I have to do a there's, a lot of you know like cutting and pasting and putting it and re- prioritizing everything on the platform. Sorry, I think so the week before is the 19th you and unfortunately, we have Chelsea. Aces is very late due to due to conflicts and then transportation that week, so Thursday and Friday is are open. I know people do not like to do it on Friday, so we could do the 22nd for the budget task force to meet that'll, be after all, of the after all of the committees. It's right the night right after transportation, but great I mean we can do it. We can. We can do it the week after, but it'll be after exec, so you would not be able to really do that. So transportation has to do the letters and the budget. Okay, just kidding, that's okay! I think I think if we could do a meeting on the 22nd that just feels like it gives us more time to work through survey results things et cetera like this, but very specific. Like does that mean we need we? I would imagine we actually want edits to this document before the 22nd yeah the edits to the document. I think you want before so then you can make sure that there's any changes that you need to bring up at that meeting. You do and you're voting on that, and you know one week before. I'm sorry, you want to be finished one week yeah so I mean in terms of the statement of district needs portion. The 22nd is where it's sort of the Barton burner of where we stay there until we hack it out with for each of the budget priorities. So I think you know in terms of you, if you want to give everybody a deadline to get in their portions finished. You know Columbus day week. Columbus day is the 12th you want to. You want to give them until the 15th, so everybody the 15th, and so you have the is the deadline and that's a week to review looks like people are nodding. Okay, I would just ask that if people can get to their sections sooner recognizing we still have to get you the document in an editable format, but each section is not, if not all that long in terms of text, and so the sooner you can get it to us to me. I do not know I'll buy you cookies or something I mean we can make it earlier, I'm not trying to I'm just. I think I think you know if people like hard deadline, the 15th, but sooner or better, and recognizing that the sections are quite short, okay, anything else or maybe we want to have by the next exec. I'm sorry say that again survey we'd like to have by exec. I think, if we yes, I'm happy to put in some elbow grease to help make it happen. Okay, at least by exec. You need to have a sample of some questions, so otherwise everybody's going to ask a zillion all the zillion of questions we have asked ourselves. Oh bless, you and exactly sure 26.. You do not need execs approval. The majority of exec here, but I'm just saying, like you, can give a summary of what you guys are doing and get the. I just think we want to roll it out. Just look online people read the Full board newsletter, that's the big, and so that's where we're going to get the most like people. Looking going, oh I'm going to spend three minutes or whatever five minutes responding to this. If I send it out in the middle of the month, it's going to get it's going to get lost, so I rather get it when people really read it. Okay, so full board is my. That was my deadline, but you know if we want to have a you know: discussion exec about it. We can dolores looks like she's very excited to do it so I'm gone. It sounds like we're at a wrap and it's not eight o'clock. So I think this is a nice job, great job, Jessica. Okay, thank you, Jessica! Thank you. Thank you. Everyone good night, you.",
            "summary": "It's, a 303, West 43Rd street project that the old Times square, theater, the oh on the north side, the showroom, theater building And, then they've reached out to Jesse because they want to get to know the neighborhood So tell them they need to support GMHC.\nWe've also asked that committees have the opportunity to identify two to three other things that you know are like revealed by Covid-19.\nJust because you we should we'll get it to exactly allow ourselves to meet in late October to hopefully before exec to you know, you know, come up with the final product to then deliver or to summarize to exec and then prepare for full board sure, of course, but So with that I mean if there are any questions or any comments about what people are seeing at committee.\nYou know a decade of not longer's worth of work and advocacy, and that we want to continue this format, but that we really do want to see about calling out a small handful of things that we think you know either can impact the most number of people or have the greatest likelihood of getting done, or we just see as the absolute most critical and that we want to call those out in some form of a letter recognizing that.\nWe all know that the most pressing issue right now is homelessness in all of its forms, whether it's street homelessness or shelter, homelessness , We've had a long history of advocating for many things over the years that could have helped to reduce some of the reasons why people are actually homeless.\nBut I do think that we have a very clear understanding of what the needs are around homelessness and issues that create the situation where people lose their housing, and I think that we need to be very loud and very strong and really advocate, not only for the things that we have on the list, but update it to what we're seeing right now and how it's impacting the district, Leslie and then allen.\nSo I think, just for to do's, as we always normally do, is we sort of should make sure we divvy up the statement of district needs portion of the document, which is not the budget request, but is the you know the summary of each of the ideas and issues and like last year and the years prior we just you know people take on the reviewing of that doc.\nDo our office We'll send it around as a draft where people can make whatever changes they want, and then the last thing is that something that Jeffrey had an idea about And we're still working on, which is to make the the the co- chairs process of submitting their revised budget requests.\nIt was not sure if it was a zoning study which would be much more technical, but just general land use and changes of use in terms of you, know, office, buildings, residential vacancies, and we were aware that we're only at a point in time But if we thought that it would be helpful to have some kind of study of what's going on or what could go, on, how it would fit into the our budget priorities I'm.\nWhat are the priorities perceived by the community in this time of Covid-19, which may be different from what we perceive, and it may be an focus on something different, great And I think there are obviously many ways to skin a cat in terms of getting community input, And I, I'm curious to people's thoughts.\nWhat are you seeing I'm, mindful that the budget task force in the past has said you know, committee has to hear things before it makes it onto a request and so opening it up broadly and maybe getting feedback that has not been really pursued by the committee could still be good for our board, but not necessarily instructive for this budget.\nI thought we were going to switch it up as far as what the priorities are now in the age of Covid-19 , like before, DSNY was not maybe a priority and now basket pickup or trash, at least in our district is a huge priority for a lot of residents, or you, know, arts, funding.\nSo I, mean, I think, in my perspective, you're asking the community to give you the broad shifts right, like the general idea of like where what are the top three like the way that the document itself it runs as it runs.\nWhat are the top three things that you support to the Community board If that was not something that was ever brought to a committee, and now we've asked for that piece of information, and someone says oh well that my school or my block needs You, know We can put together something easily to sort of explain what it is and why it's important and all of that- You know response and agency kind of involvement in the community And But like sanitation and small businesses, is something that has been you know, elevated But I mean that's something we can put on the table as I do not know where it is.\nSmall business is a very big concern in our neighborhood I think the process will be great, but my fear would be that you get a group of people like you always do.\nI, just I just feel like to the point like if we get 50 requests for one thing, that as a budget task force, we actually do not think should be highest on the priority.\nI, do not think we've ever thought of budget task force as the most yelling and screaming Gets it to the top of the list, because we have a history of what we've, what we built, towards, asking for and also getting the temperature of what politically is feasible, and it's really like Jessica said it's just to get people in it's just to have more people in the neighborhood know what we do be aware of what we do and hopefully join the process more than a specific budget.\nWe should probably say something up front that you know the ideas will be filtered through the budget task force to the Appropriate committee for review.\nSo people do not think up front that If I get 50 people to say this, we're going to get it funded right in the instructions or something does this need to be.\nI do not even know if we do need to, but like do, people need to know that this is being collected, as we think about budget requests.\nAs I know what you're saying I thought we were going to put under those big categories example of what is in the budget for it, so that people get a sense of it.\nIf we do examples for ACES, which is mostly schools, we're listing like specific school projects, you know And, then people some people are going to say.\nRight we're going to get a response to a budget item that says this is still important, so I think we move it to cs to our knowledge.\nI mean right again remember this is the needs section right, not the budget request section just so we're all aware: And, I think, the more for the city, And I, think, the more eyes that can look at this documented sections that maybe you are not even assigned to but may have feedback so that we do not miss opportunities like small businesses or safety or other things that may have connections to section to other sections.\n, like you, still have to log in to be able to access it, so The whole world can't access, it sure Like, our own section of the survey, I thought Alan and delores were going to actually put together a draft first So why not as we as we're working on this, I do not know why not okay What is the timeline for having the statement of district needs?\nI know people do not like to do it on Friday, so we could do the 22nd for the budget task force to meet that'll, be after all, of the after all of the committees.\nI think you know if people like hard deadline, the 15th, but sooner or better, and recognizing that the sections are quite short, okay, anything else or maybe we want to have by the next exec."
        }
    }
}