{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Land Use Committee Meeting - Oct 20, 2020",
            "publishDate": "2020-11-18",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    DCP: Land Use Application N 210095 ZRY - \\Zoning for Coastal Flood Resiliency\\ Citywide Zoning Text Amendment\\n3.    Update on Two Bridges rezoning application\\n4.    Report from Public Housing \\u0026 Section 8 Housing Subcommittee\\n5.    Vote to adjourn",
            "lengthSeconds": "2:36:24"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "11/5/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "G0Bdp46g2xY",
            "fillerWordCount": {
                "uh": 167,
                "um": 635
            },
            "readTimeFullTranscript": "87 min read",
            "readTimeSummary": "12 min read",
            "wordCountFullTranscript": {
                "flood": 99,
                "building": 80,
                "buildings": 65,
                "floor": 51,
                "position": 49,
                "zoning": 46,
                "text": 46,
                "amendment": 35,
                "rules": 34,
                "feet": 30
            },
            "wordCountSummary": {
                "flood": 34,
                "building": 24,
                "buildings": 15,
                "floor": 14,
                "text": 11,
                "zoning": 10,
                "resiliency": 9,
                "percent": 8,
                "amendment": 7,
                "rules": 7
            },
            "fullTranscript": "You Linda is recording okay, great, I'm so good evening. Everyone welcome to CB Freeland Use Committee meeting for Tuesday November, 17, 2020 and- and we are doing this via zoom and my vice chairperson Linda- is managing the platform and and she's going to give us a brief introduction about the swim functions and of some brief guidelines. Linda yeah, the only thing we really need to understand that people find confusing is how to raise your hand. So if you look at the bottom of your screen, you will see participants. If you click participants, you will see a bunch of options, one of which should be raised hand. The other thing I want to say is: please don't use the chat room for crosstalk during the meeting. The chat room is for signing in. So if you would sign in give your name and affiliation put it in the chat, that would be much appreciated. That's all I know. Thank you. Linda, oh am I. Mute on okay and I also want to remind everyone that whoever wants to speak has to raise their hand first and get recognized by the chairperson. This is just to maintain the order of the meeting, so we can move it better Michael. Can you please do a road calling to take the attendance? Please sure Jackie? Yes, Linda! Sorry! Yes, no problem! Michael! Yes, Dominic Berg, Jonathan Chu! Yes, thank you Herman! Yes, thank you. Trevor, yes and I. Think the background noise is coming from Linda's computer, but not sure. Thank you Lisa. Just so. I'm clear here is all I need to say right. We're not voting on the minute. No next will be the minutes. Thank you, Linda. Thank you Olympia here. Thank you. Damaris I, don't see her okay Troy here. Thank you, Troy Steve, now Steve and then Tim I, don't see him in the list. All right, we're all set. Thank you Michael. So next is the approval of the menace. That's our November for our November meeting. The minute has been sent to you two or three days after the meeting, and so let me know if you have any problem with it or I will just approve it. Okay, I see no questions, so the minute is approved. Next item is the DCP applications for the citywide zoning test amendment on someone exactly one thing: only I don't think I received them, but it may be me usually I don't lose things, but if everybody else has received them two days after the meeting it you know it's the pandemic. Maybe my inbox got wild, but has everybody else received them? I did Olympia I'll check if you receive it, I believe you should because I always just send it to all the committee members. It may be just a glitch that I didn't get. I was just texting this earlier today, all righty, thank you and so tonight. The item we're going to discuss next is the zoning test amendment on the zoning for coastal flood resilience. So if you had a chance to read all the materials online, you will find that the amendment has a lot of information and Matthew from DCP I see he is with us tonight Matthew. Would you like to give us some presentations on what this test amendment is about? Yes, absolutely so, hi everyone. Let me share my oh Jackie or who's ever operating. Could you allow me to share my screen? Yes Linda. Can you make a Matthew co-host? Please perfect! Thank you all right. Can everybody see the first slide? You can't hear him for some reason: you're not able to hear me I can hear you choi. Can you hear I can hear fine. You can hear me okay, and can you see the first slide? Yes, great? Okay, so hi everyone, I'm happy to see everybody again. If it's just virtually for those of you that don't know my name is Matthew Petrus I work with the department of City planning. I'm joined here today by gene U, who is in our zoning division. Also at city planning she's one of the project managers she'll, provide some technical assistance for questions and then Scott Williams as well he's our he's on our East side team. So this is our zoning text, amendment which is going, which is called zoning for coastal flood resiliency, and so the impetus for this text amendment is really to create a city that is better resilient to climate change and the risks of a rising sea level. A lot of these measures that I'm going to be talking about are already in place and they were put in place on an interim condition after Hurricane Sandy, and they were really meant to allow buildings to have the flexibility to meet the building requirements for building in the flood zone. And so this is really just a. These. Are zoning flexibility tools to allow property owners to meet these different requirements because, as most of us know, it's a little more expensive to build in the flood zone for the number of protections that we have to provide, and so this is just a text amendment that's going out for referral and from the community boards. We're asking that you send any comments that you have by December 28th of this year. Okay, all right! So on this slide, we see three different maps, starting on the left. We have two maps which are the one percent annual chance flood plain, which is shown in blue, and so this is kind of our our high risk areas and then in our green. This is our moderate risk area, so areas that are less likely to flood. But as a lot of you saw when Hurricane Sandy came around in 2012, that moderate risk area was also inundated, and so that's shown in this middle map in the orange and so in the future on which is the far right in this red is our projected sea level rises, which is kind of we're kind of extending that flood plain further and further into the island and further into the other parts of the city, and so we're seeing that in these areas, buildings are currently have to comply in the blue areas on the far left with the appendix g requirements and then we're trying to provide flexibility for other buildings to meet to be resilient to future storms. So this is not the lower east side in any of these photos, as you probably could guess so, Alipon Creek in Queens, which is a marsh we're seeing the rockaways also in Queens these houses on piers, and so this is really just to show that we have a very diverse waterfront. We have 520 miles. Our city is a coastal one, and so that being said, you're going to see some building typologies used. As illustrative examples that may not fit into the context of the lower east side into the east village into Chinatown into any of the neighborhoods in community district 3. but this is a wide reaching text and a lot of our we're just trying to make sure that our message is consistent, and so, while it may not look exactly like a building that you might see, walking around the rules are still going to be pretty much the same all right. So the city is employing a multi-pronged approach to protect it itself against climate change. The first is a coastal strategy, which I think many of you. If not all of you are familiar with the East side, coastal resiliency project. That would be an example of a coastal resiliency strategy. The second one is referring to buildings and how to make them more resilient. The third is looking at infrastructure. If you see raised subway entrances, that's something there and then the fourth then, is looking at just how to protect residents and businesses, and so this text amendment is really focusing on the buildings part of it again we're not changing the building code. We're just making zoning a little more flexible so that these buildings can meet those higher requirements in the flood zone, all right. So here's a brief history of resiliency and zoning just really starting from Hurricane Sandy in 2012. so immediately after Sandy, the city started to work and tcp started to work on a flood text to respond and provide flexibility for these buildings in the recovery effort and in 2015 there was a recovery text that we did create, but that expired earlier this year and in from 2016 to 2018, we were conducting outreach to see how those previous regulations were working. What could be better and from there in 2019 after three years of outreach, we we've issued our preliminary recommendations, which we released in May of last year, and so the goals of this text amendment are threefold. It's first and foremost, to reduce damage from future coastal flood events. The second is to be resilient in the long term, by accounting for climate change. To so it's to provide these tools that you can use if you're out, if you're, not necessarily in the high risk now, but you might be in the future- and we know that we're projecting that this is going to go further inland to allow for those buildings that are at moderate now, but maybe higher risk later to be resilient, and the third is to save money on flood insurance costs. If you have flood protection measures in your building, you're going to it's going to reduce your insurance costs and then finally, the zoning for coastal flood resiliency is also going to lay out a framework for responding to disasters in the future, which I'm going to talk about a little bit later. Okay- and so I- wanted to put this on its own slide, just because I really think this is an important notion is that this text amendment is just making permanent temporary rules that we've already adopted. They have been tinkered with and changed some of them to make them, in our view, better, and these are intended to allow buildings to meet the flood resistant construction standards that are required by the building code, and the building code is something that DOB is enforcing and something that that's under their jurisdiction. But we don't want to be in conflict with that building code. We don't want to make it harder for buildings to become resilient because zoning's restricting them, and so that's why we're really that's the impetus for putting this text amendment forward? Okay, and so let's talk a little bit about that building code and if I'm looking to the right, I have two screens, so I'm not paying attention to you and so Appendix G is where the building code for buildings located within the flood plain. That's where that's located and a lot of those regulations have to do with this DFE, which is called the design flood elevation. You might recognize that term from the site- coastal resiliency project, but that's basically the elevation where you would expect to see this future flooding up to, and so here it's represented by the dotted blue line. We're saying that in the future, during a coastal storm surge, we might see water up to that level. So, within residential districts, none of the living spaces for new or substantially improved buildings can be located below that line, and so you're, seeing here that this is one of those buildings. I was talking about that you're. You may not recognize being in community district 3 here on the left here on the right might look a little more familiar to us, and so all the residential spaces must be above that design, flood elevation and then in some types of uses can be wet flood proofed, so parking garages and storage or sorry garages and storage. These things can be wet floodproof and what that means is that the water is going to flow through the building. So it's kind of a lower level, protection of flood proofing, dry flood proofing, which we can see on the right-hand side, is a little higher form of protection, and so that's really sealing the building off so that the water is going to go up to the building. But it's not going to go inside that and there's some uses that are allowed in there, like commercial uses and spaces below that design. Flood elevation must also be dry flipped in this scenario. Okay, so with that, our proposal has four different goals that we're really focusing on the first one is to encourage resiliency throughout the current and future floodplains. So this is really talking about applicability. The second goal is to support long-term resiliency designs of all building types, so providing that flexibility to meet the building code. The third is to allow for adaptation over time through incremental retrofits. These are like the partial protection measures that I'm going to talk about, so this is not getting your building fully compliant with Appendix G, but it's saying that we're going to provide some type of flexibility so that you can start to elevate your mechanicals or maybe flip through one thing or another, and the fourth goal is to facilitate future recovery by reducing these regulatory obstacles. Sorry, all right so goal one which is all about applicability. So this is in Queens, I, believe, and so you can see that the current rules would apply where this, on the other side on the further side of this blue dotted line, and so that's kind of the one percent annual flood plain that we was that we were seeing, but when Sandy came through that went further than the one percent. So this area behind it is the point two percent, and so we're going to extend the applicability of these rules to not just the one percent annual chance flood plain, but the point two percent as well, which is high risk and moderate risk. So on the left. This is this might be. This is going to be a theme throughout this presentation on the left is going to be kind of our current rules, so the 2013 flood text and on the right is going to be updated text so in the 2013 rules. It just applies to this, or these areas in orange. The areas in gray would not be allowed to use these different zoning measures to work with Appendix G. However, in our proposed tax, we're saying that it would extend further, so it would extend to that point two percent. So what does that mean for this community district? So here we're seeing in blue it's the one percent annual flood plain and in orange we're seeing the point two percent chance and, as most of you could probably guess, a lot of this is going to be just along the water, except here around Stuy, Cove or sorry, not around stuyco at the bottom of just north of pier 42. So we have a lot of different types of public housing in here we have multi-family residential housing. This is why the median income for the population living in these areas is quite low. So we see 18,000 as the median income, and this is from the just note. This is from the 2010 descending census, so it may have gone up a little bit, there's about 500 buildings here that are within that one percent chance and then about 21,000 dwelling units and a lot of those have to do with these bigger multi-family buildings. And then we have mostly renters when we extend it a little bit further. That population goes up from 32,000 to about 47,000. and so this 47,000 number here is almost or sorry the dwelling units is 27,000 as well, and this is almost one-third of the dwelling units that are within community district. 3 are located within both of these areas, and so it's a substantial amount and there's about 819 buildings. There. We can see that the median income goes up a little bit as we get further into the east village and alphabet city and then just a little bit about the typologies here you, as you all know, we have the nightship towers in the park. Then we have the older tenement style walk-ups, which are going to be in the east village. In alphabet city, and then we have these newer developments, which are usually a little bit wider, which typically have ground floor retail with residential on top, but a little bit bigger than our walk-up units. Okay, so goal two. This is a section: that's going to illustrate options that are available to the buildings that, if the building fully meets or exceeds the appendix g requirements of that of the building code, and so there are different types of strategies here, so to start with the building envelope and again, these are optional rules that would allow building owners to physically elevate habitable spaces and other building support features above expected. Flood elevations so currently, which we see on the left. The 2013 flood text allows maximum height to be measured from the design flood elevation that is currently called the frce or the flood resistant construction elevation in the zoning resolution. However, this is only available for buildings in the one percent plane which have a designated DFE in the building code, so to allow the buildings in the 0.2 floor plan to take advantage of this rule we'll be sending a standard flood elevation of two feet for buildings in that area, so the current rules also allowed extra height in situations where building are located in areas with certain high flood elevations. This extra height allows buildings to have a more useful ground floor. However, we learned over time that it also helps with long-term resiliency. Today, building heights can be bumped to 9:10 or 12 feet, depending on the building's use and zoning district, which is making this kind of a highly complex framework, so it kind of changes block by block use by use and because the applicability depends upon the flood elevation level. Slight topographic changes can lead to inconsistent outcomes that benefit some buildings more than others. The proposal would make those height allowances more consistent and equitable, so that buildings can be prepared in the long term and incorporate sea level projections into their design and so to create a consistent framework. The proposal would allow building heights to be measured from a new reference plane that can be placed up to 10 feet above grade in the one percent annual flood plain and up to five feet in the two percent annual flip plane, and so that's what we can see here on the right okay. So next, let's talk about ground floor regulations, so these sets of rules would help promote good, long-term resilient design and good neighborhood streetscape. The current rules allow ground floor uses in existing buildings that are retributed or retrofitted to be wet flood proofed to be exempted from floor area, so the entirety of the floor can be exempted. Currently, this helps buildings become resilient without having property owners have to lose a chunk of their building in the process. This proposal would allow such exemption to apply to both existing and new buildings. The intent is to apply the allowance more consistently and support new buildings adapting to climate change. The current rules also include floor area exemptions for spaces that are dry, so this is what flip-proofed sorry. The current rules also include floor area exemptions for spaces that are dry floodproof to promote active uses at the street level. So there are two sets of rules on the left. You can see a provision that applies to existing buildings, which could exempt the drive flip-proof space, but had a hard time relocating the floor area to recoup the investment of making the building water tight on the right. You can see a rule that applies to new and existing buildings, which allowed any space to be exempted from floor area. If more than half of the floor area is below the flood level, we call these spaces sellers. So these are sellers here on the right. The problem with the seller exemption is that it resulted in squished ground floors with low ceilings and suction sunken ground floors, which also ended up being encouraged. Ultimately, these two exemptions ended up promoting buildings that were out of scale and ground floors that were less marketable and effective for active uses. So the proposal would modify these regulations to instead only allow the first 30 feet of space that is dry floodproof to be exempted from floor area. So, instead of the whole floor, now it's just that first 30 feet, provided that the space is used for non-residential uses and complies with certain standards requirement standard requirements such as minimum transparency requirements and internal clearance. This would help to encourage active use close to the sidewalk level to promote a safe and lively pedestrian environment, while making sure that the resulted buildings are not out of scale great. So, in addition, this proposal would also mandate a set of streetscape requirements to improve the ground floor design of brazilian buildings, which we talked a little bit with this community board about as in the outreach process. So the proposed rules take existing streetscape requirements and make them more consistent and provide more design options to ensure that resilient buildings reflect and contribute to their surroundings. The proposed framework would require the design include elements that earn either one or three points so as a point system, depending on the elevation above the grade of the first floor above the flood elevation for floors more than five feet above grade. Such points have to be satisfied in two categories of mitigation: those that improve access and those that improve ground floor design. So here it's saying that if you are only five feet really above or if you're kind of have a smaller streetscape design impact, you only are required to have one point. So one mitigating factor and I'll talk about those mitigating factors on the next slide, but if you're higher than 5 feet, we're viewing that as kind of more of an impact so you're going to have more of a mitigating, either design component and an access component. So to meet these points, the proposal would provide a range of options for a range of building types. Some of these don't look familiar I understand, but there are quite a few here that would make sense here in the in community district 3. and so these would include additional options from what we have today and they're highlighted in orange, and so we can see kind of the ones that may apply are more decorative treatments or fenestration and different types of design elements that would make it allow building owners to flood proof their building, but not take away from that from a continuous street wall and the pedestrian experience on the street. Okay, and so last, as with a lot of text amendments, we realize that there might be a situation where a building can't meet any of these rules, and so there are, there is a possibility for discretionary actions, so these are ones that would go through the BSA special permits, and these would ensure that these unique situations and hardships that are based on things like lot shape can get relief from zoning certain zoning provisions in order to allow them to meet those building code requirements in the floodplain all right. So our third goal. So this is a set of provisions of, and we call these partial resiliency strategies and these are to help building owners, undertake incremental steps towards resiliency without requiring the structure or sites to fully meet the requirements of the building code. So we learned that raising mechanical equipment is often the first and most cost effective step to make buildings more resilient, so the proposal would enable more options for the placement of mechanical equipment above the flood level, either on top of roofs or in a separate structure, and so we kind of see this happening. A lot with NYCHA campuses currently I think this visual well I don't believe. This is a NYCHA campus, at least in community district. Three we're seeing that NYCHA is already engaging in relocating these things on top of roofs, but now there's going to be the flexibility to possibly put them in their open spaces as well. Okay. So the second part of this is these support spaces, which are basically meant to help the commercial ground floor uses so oftentimes ground floor retail spaces have seller space. That's used accessory to that store to allow them to store goods or have critical business functions down there, and so those instead of being located on the ground floor. It makes more sense to elevate those above the ground floor. So if you have your ground floor retail, you can put this new accessory space on the top floor and oftentimes. The underlying text doesn't allow second floor commercial uses a lot of commercial overlays, don't allow second floor commercial uses, and so this is just making sure that we're not having underlying taxes prohibiting buildings from becoming resilient all right. So the third one is are these are flood protection measures, and so these are different measures that could be installed and be allowed as permitted obstructions within within required yards or open spaces, and so these are just two images that are showing where a building owner has taken steps to help to flood proof. His building I believe here on the left, there's a window well down here and instead of allowing the water to flood through the building owner put in this knee wall here that protects against that on the right. There are these two different posts that I believe these are deployable. So these are the just-in-time types of protection measures that, when the flood's coming in, then you can deploy a protective gate to protect your building against coastal surge all right. So our fourth goal is different from the previous ones and that these rules would mostly apply not just in the flood plain, but on a city-wide level. So, as Sandy showed us, a storm's effects are not just limited to where our lines are drawn on our flood maps, and so it makes sense to then elevate different power systems throughout the city higher so that they can kind of be resilient to different coastal surges, and so we've seen that this is like raising mechanical spaces. If you're raising these power systems that are outside of the flood plain higher than or at least off the ground, a little bit you're going to be able you're going to be more resilient to coastal surges that we may not be able to predict. There may be a storm stronger than Sandy that comes through. That goes even further past the 0.2 percent, but we don't want to have rules that don't allow these power systems to be elevated, just because our current projections are not are saying that you're safe beyond this point. In addition, we want to make sure that all areas of the city can easily provide ADA access, and so the proposal would classify both ramps and lifts as permitted obstructions in all required open spaces, and this is to facilitate accessible design. The last has to do with the sighting of vulnerable populations or buildings that would serve vulnerable populations like and like nursing homes, and so we want to make sure that there's an ability to evacuate, folks that are living in nursing homes when there is a storm surge that comes through. We don't want to be locating these things when, when storms come through, then you're isolated and you're not able to get out of these areas, and it could be disastrous, as we've seen when there's different types of electrical outages that are shutting off power to different life support systems, and so we want to make sure that nursing homes can no longer be cited within these floodplains. Okay, so last Sandy showed us that a lengthy process to update the zoning regulations can slow our response, which we don't want. So the proposal would make certain recovery provisions available to be enabled quickly following future disasters, and some of these provisions would be implemented now to help address the Covid-19 pandemic and its associated economic effects. So currently immediately following the disaster. The american issue- exec emergency orders to temporarily remove obstacles to facilitate recovery efforts, but that process is limited to the duration of the disaster, which may not be enough time to address regulations that hinder long-term recovery. This proposal would include a series of disaster recovery provisions that could be made available through a text amendment when a disaster occurs. Applicable recovery provisions would be selected based on the issues caused by the disaster and would be available for a limited time period set at the time of the text amendment. The provisions could be limited to designated recovery areas based on the disasters impacts and the city's recovery plans. The set of provisions that could be made available are drawn from lessons learned from Sandy, as well as the current pandemic. Examples of rules in this menu include modification to the damage and destruction thresholds to allow the reconstruction of non-compliant buildings and non-conforming uses and rules that could allow uses in zoning districts where they are not typically permitted on a temporary basis. While these options would be included in the zoning resolution text, they would not all be enabled as part of this action. Considering the situation we are going through right now with Covid-19. The proposal would include enabling two sets of rules to help support more predictable, long-term recovery efforts, so we're moving from coastal resilience in here and kind of moving into that disaster preparedness component. The first one would give property owners who hold special permits and authorizations an additional term, so they can complete their original plan of construction on a longer timeline. The second one would support businesses that do not conform with zoning use regulations by allowing them more than two years, the current limit of discontinuance to return to operation this, and so this is everything we have about the proposed changes, and so now I'm just going to talk a little bit about the timeline so for the next steps. We hope that we can receive your comments by December 28th of this year from there it's going to move to through the land use review procedure, clock as you can see down here at the bottom, although this is not strictly speaking a ulurp item, as we typically see them. Zoning text amendments are just a little bit different and so just our timeline here, but it should look pretty similar to you all. So with that, I'm happy to take any questions. Thank you. Matthew. That's, really a great presentation, Jim I, believe you have some thoughts about about the test amendment. Would you like to share with the committee members yeah I will try to be really brief, I think just oh for everyone who has not met me or just members of the public. My name is Jim Shelton, I'm a staff member for CB3, I'm the assistant district manager, I work on a lot of land use and planning items for the district, so I just wanted to. We just went over it, but I think it's important to note those disaster recovery rules because that's a little bit it's slightly different than what I think we've seen in earlier outreach, which was a few years ago. I think we kind of discussed this, but it hadn't been codified. Necessarily so, like Matthew said, you know right. This is a relaxing of certain zoning rules. You know in the case of a disaster, that's declared- and you see this happen right through exec through mayoral executive order and emergency zoning changes already, but this is kind of codifying that and I think importantly, like Matthew pointed out, has that benefit of being able to be extended? You know beyond the period of the disaster which might be important when thinking about you know economic or physical recovery, depending on what kind of disaster it is so Matthew I know, I talked to you about this earlier, but I just want to confirm when we're looking at this new section proposed section of the zoning resolution right this article six chapter five in the case of like a disaster happening in you know three years or something, and the city wants to propose a text amendment here into it, to provide for, like certain exemptions. Is that considered an emergency order or would that have to come before the community board like a typical text? Amendment I think that might be helpful for the board to understand. I actually might Jean. Are you still here? I know she had to hop off, but I want to see I, I'm still here yeah, so I'm going to actually kick that one over to genus so she's in our zoning division, so I think to first talk about the kind of relationship with the executive order and this kind of interesting kind of framework for the disaster recovery rules. So during the emergency we believe that there would still need to be an emergency order or executive order to maybe kind of remove barriers for people to recover, whether it's you know a physical damage or whether it's a disaster that causes you know non-physical damages like what Covid-19 has kind of shown, so it we would definitely may need the emergency or the executive order. However, understanding that you know a lot of these cases, there are rules that are applicable with various kind of disasters. We will be kind of putting in in this framework kind of a list of things we know currently and have kind of researched through our kind of efforts with Hurricane Sandy and also the kind of Covid-19 research that is going on that we think will be able to you know kind of turn on in the case. We need these provisions for longer. I, don't know if that really answers your question. Let me know if I can supplement it a little bit more or if you have specific questions. That's super helpful, I. Think, there's kind of like a second part to that I think would be helpful because, from the perspective of the community board, what I'm pressing at is you know when an emergency order, an executive order, happens right I like significantly change certain regulations or procedures in the community district. You know that's not coming to the community. That's not getting referred out to the community Board for comment right, that's coming in here's office and I'm trying to understand in an emergency situation. You know if you have the emergency order from the mayor, that's like establishing a disaster and then on top of that this additional text amendment is invoked right to have like the longer term flexibility will that come before the community board, because I think the question is just like. Is there an opportunity for the community board to consider these emergency measures, or is it kind of bypassed in this process? So yeah I think I understand your question. So it is a city, it's a text amendment, so it doesn't go through the kind of formal Euler process. From my understanding, however, it does go through the Cpc and City Council and I do believe. Text amendments still get referred out to committee boards and borough President Matthew if you have any additional yeah. So the typical typical referral period is sometimes shorter for text amendments we usually say 45 days for citywide ones, with what we're planning as the applicant. We can do 60 days so I. There is the option for that to then be referred out to the city, the community Board for comment. I think it would depend on a case-by-case basis. How long that referral would be right so I guess that would depend on the severity of the disaster itself right, and that makes sense. The only reason I'm flagging this is that I think it actually, given that this is a formal text amendment and it most likely we get referred out to the community more. This may actually for board members right. I think this might be a benefit right, because you would not be reviewing the content of a mayoral executive order and you would at least get a chance to review this, barring any exceptions that happen because of the extremity of the emergency, so I think that's just something to consider that might be a little better than the process we go through. You know, including right now, where you're not reviewing the details of executive orders from the mayor's office. So that's one thing: I just wanted to talk through, because I think it's interesting and important for the board members and then the other piece I just want to flag here is because this is invoking. You know this is going to. There is going to be an emergency. You know Covid-19 relief, rule change right as part of when you're making a recommendation on the coastal resiliency measures right. Part of that is this Covid-19. You know rule change right for relief into particular areas and one of them I just want to flag as a potential conflict for the community board, based on complaints that I've heard over the years when I've been working here, so the it has to do with this section, 6513, that's being proposed, which is discontinuance provisions right for certain uses that are non-compliant so currently like the way that process works, which I think some of you may be familiar with. Is you know if you have a non-compliant use, let's say a commercial use in a residential district, and that use is. You know, let's say that the establishment is vacant for two years right that non-compliant grandfathered use right that expires and it reverts to the actual compliant zoning. We've had conflicts around this in the district over the years. We have quite a large amount of non-compliant commercial uses in residential zones and often it's things like bars and restaurants that are quite noisy and we get a lot of complaints and a lot of conflicts, because it's this kind of high impact use high impact commercial use in a residential side street right, and we try to stay on top of these with DOB. You know both because it can add residential units back to the housing stock in the district and cut down on some of these. You know somewhat noisy and recurring conflict locations right. So this section 6513 says like in an emergency like Covid-19 right, you can suspend the clock that you know it starts when that non-compliant use ceases right so and it gets extended. You know it's suspended rather for the length that the kind of disaster recovery period is declared, which in this case is two years so I just want to flag for board members that you know this would mean that, like the two-year clock that normally counts starts counting for like a vacant former bar on a residential block, you know would get an additional kind of two years of time to potentially you know resume that non-compliant. Use and I just I want to flag that, because I think we've heard complaints in that area before that would be. You know, making it I think you know easier for non-compliant use to go back into one of those spaces and more difficult to have that residential use revert back so that that's all I wanted to note. Just because I know people brought it up earlier beyond that. You know: I turned it over to the board. Thank you, Jim Lisa, can you hear me? Yes, okay, I guess. I have a couple of questions, and the first one I have is there's reference in the material that I read. Oh first thing: I'd like to say is the presentation was helpful and thank you very much because it did reinforce what I tried to understand when I read through as the 24 pages of the the introduction, but there's mention in there- and it was also mentioned again in the presentation that this is optional and I wanted to understand what that meant. Is it optional in all circumstances, or is it optional when it's minor renovations or, please explain sure? Well, first, thank you for I know it's a heavy text so and it's kind of a complex proposal so I appreciate that this made it clear so there's a difference between use the word. It didn't make it clear, perfect: okay, well at least we're getting there baby steps, so the zoning flexibility that what we're proposing is optional. The building code requirements are not so if you are a new building or you are a substantially improved building and substantially improved, is when the improvements are 50 or more of the market. Value of your building, so another depends on the project. But if it's one of those two things you were required to meet Appendix G flood resiliency standards, what architects is doing? It's just providing the flexibility, because we know that those regulations, incr are cumbersome, and so we don't want to have our zoning regulations prohibit folks from either substantially improving a building or developing a building or just trying to make their building more flood resilient. And so what we mean by optional is that the zoning mechanisms are the optional ones, but for everything that's required to meet the flood resiliency standards, those are not optional: flood resiliency, building code requirements, I see again and I guess. My second question is then: well let me frame it in terms of my overall reaction. I tried really hard to understand this to a degree that would make me comfortable in taking a position one way or another on the specifics. I 100 get the goals and the goals are certainly admirable and warranted, and all the rest, but really understanding the specifics in here to go far beyond what you've really tried to summarize and summarize really well I, just I had trouble with that. To be honest with you, so I think it's. It was very helpful for you to say that what you're looking for here are comments you do not need specifically or necessarily a vote by community board 3, as you would normally expect to have on a Euler item correct. If we chose to comment. That would be fine. If we choose not to comment that would also be satisfactory. Am I understanding this correctly. That would satisfy the Euler rules, but I know this board and we appreciate it submits comments for the projects that are in front of it. So that is a question for I. Think the board as well. We have no obligation, but should we choose to? We certainly would be encouraged to do it. It's kind of the bottom line, 100 yeah. This is similar to actually the Grand street guild, which was a non-euler item that you submitted comments for yeah, so just to Jackie and everybody I. You know, like I, really tried to understand this and I feel like I was in maybe somewhat better position than many people, because I do know a little bit about flood resiliency because of my day job that I had until very recently when I retired about a month ago, but this is the level of architectural and zoning complexity that really I feel Un uncomfortable in taking a detailed position on, but I'd like to hear what other people- okay, thank you Lisa, so I just put in a link. Sorry, this is gene again, I'm sorry I just put in the link to the project description for their project. That's on our website. But if you go through, this is oh, you did read this. Okay, all right! Thank you. I'm not sure if this is helpful, but we also have a longer presentation that has a slide to every single provision that we're proposing as part of this project on the website as well, that has more kind of visuals and diagrams. That goes with this kind of project description. If that will be helpful too, just wanted to note that. Thank you. Gene next Michael all right. Thank you, yeah I agree with Lisa, I'm I tried to understand things, and this presentation did help, but I, I'm still a little bit lost. I wanted to know. If you could expand on the floor area exemption pieces of this yeah. Can you talk about that? A little bit more sure, yeah, so I think there were a couple components that I've talked to this board about during the outreach and before about the like the big ticket items that were concerning- and this was one of them and I- think the other was streetscape. So I'm happy to talk about that a little bit more as well so right now, this is what currently exists in the 2013 flood text is that the entirety of a ground floor can be accepted in existing buildings if it is dry flood proofed. So if the owner takes steps to watertight seal her building, then she can exempt the entirety of that floor. So that's what currently exists now- and there was also another provision that if it's a seller, it can also be exempted. But that kind of resulted in these both resulted in really unintentional and undesirable results, so sunken floors and lower ceilings, and things like that. What we're proposing now is we're no longer considering these spaces sellers so getting rid of that first kind of unintended consequence and the second one is we're reducing the amount of that exemption, and so, instead of being the whole floor, now it's just up to 30 feet. So, a typical, if we're taking a walk up in the East village, say that the owner wants to dry flip proof the ground floor. If, typically, those lots are maybe 50 feet on the frontage by 100 feet in depth, so the exemption is going to allow them to. Basically, in this scenario, put a third exempt a third of the building from floor area. If their building is fully built out and they want to use that floor area, they can then reallocate that throughout the building with an improvement, but instead of being the entire floor, it's just a third of that floor. So if I am a building owner and I have I've used up all the far of my building and then I drive flood proof the ground floor I could technically be allowed to. My building could technically have a higher far than what the zoning allows. If I were to drive flood proof the ground floor, your building can get bigger. It's not going to be more than what the zoning allows, though, because that area is now exempted that 30 feet is now exempted, so it doesn't count anymore, but and so in practice there is more square footage on that lot than right. So I see that as I mean I agree with Lisa I get the need for all of this and I think it's a obviously incredibly important, but to me exempting floor area, incentivizes development in flood areas and I. Don't know why, looking to the future, that's something we would want so I guess do you have any thoughts on that on being able to build more in certain flood areas? Obviously, I understand with a lot of the lots in the flood areas, they're like single or detached homes, but in our district. That's not the case, and I'm just concerned that this would encourage more development on high-risk flood lots, yeah and I. That's a good point that one that we've been balancing so I think one there's two things: I just want to address one's the reason for allowing the incentive like you're, calling it and I think that is what it is. It's a carrot to give developers to allow them or property owners to allow them to flood proof, because we know that that's a lot of times cost prohibitive, and so we want them to be able to recoup their costs by reallocating the floor area elsewhere or have the option to do so. They may not do so and then the point about adding more density in the floodplain we have. There have been discussions just generally around resiliency about kind of retreating from the shoreline. We I would say that it's difficult to have that luxury in New York and even more so in Manhattan we have a very limited amount of buildable space, and so it's not just a matter of like say in Chicago, where you're, which isn't coastal per se, but say that lake were to go up three feet. You could have a retreat just further and further west, almost the entire way to California. Here we don't really have that option because we're bound in water bound by water on all sides, and so we're trying to balance a growing population with density and try to do so in a way that that's protective of the buildings, and so it's not always a one size fits all, but it's the best balancing act that we've before it. In this proposal we believe, but it's not a freed. It's a I mean it's just allowing more square footage to be built on these extremely high risk areas. So I, just I questioned the logic there of you know incentivizing development. You know so basically like if you had a you, know a high-end retail store in this Orange box that we see already in a building that was that used all of its far up, and then you flood proofed that floor. You would be able to just build essentially the amount of that Orange Box. You know on top of the building. Technically, yes, yeah I. That I don't understand the logic there so can I add, can I just add a little bit to maybe help the conversation. So the 2013 flood text had a provision where it allowed the entire floor if it was dry, fill proofed to be able to be exempted, even with that we've been kind of observing a lot of the developments that have been happening since sandy in the floodplain, but we actually haven't seen a lot of you know developers. You know taking advantage of this and a lot of development happy happening with this, and the reason why we're adding, even just a portion of what we had allowed before is again to Matt's point. We've heard a lot from practitioners and architects that end developers that drive floodproofing. These commercial spaces or active spaces generally, which would mean that water again, as Matt explained before, can't flow through and so a lot of times, if they're trying to meet transparency requirements or try to make the street more active, which is I, think important in you know, especially in Manhattan the aquarium glasses that need to be used for that are really expensive. So we're just you know, trying to add a little bit of you know flexibility, so that they may be able to offset that in terms of increasing density. Generally, you wouldn't be able to have more kind of far than what's allowed we're not changing the maximum. Far that's allowed. So in terms of the residential units that's allowed and the residential far that's not being changed so we're not technically adding density and a lot of times. These I know you're mentioning the small kind of orange box it's hard to, especially for existing buildings. It may be hard to locate them on the top for various. You know, architectural reasons with access and things, but again it's not. It wouldn't add too much density or again, like we're not really changing. The density, but it would that small kind of orange box wouldn't be adding too much on top of what is generally seen or built. Does that help a little bit yeah I mean it's I understand that the far isn't changing, but it is you know if I mean the I'm reading on page 22 of the 185 page application, the middle paragraph there's a quote that says quote this allowance would be limited to a maximum increase of 20 percent above what is permitted in the zoning district or 10,000 square feet, whichever is less I, hear you saying that it's not common and that the far doesn't change. But this text amendment technically allows a building to build up to an additional 10,000 square feet of florist place in these flood zones. Correct or am I misreading that quote I mean I share Lisa's concern, I'm just trying to get clarification. Sure I believe that 10,000 square feet comes from the 2013 flood text. I, don't believe we have a cap for the dry floodpoo floor area, except exemption for for the current proposal. But if you want to note that section that you just mentioned and send it over we'd be happy to kind of further answer your question. But I don't believe that ten thousand square feet yeah it's in the providing discretionary actions to special to address special situations. So I think it's the BSA special permit. Okay. So that's a different section. I think that the text that you're reading refers to Matt's kind of slide in the back that talks about allowing BSA to modify any kind of zoning regulations to help buildings that have to comply with flood resistance and construction standards, but can't because of barriers that we could not foresee, because you know, there's a lot of special conditions, but that would have to go through the BSA. Does that make sense? So that's not as of right that allowance that you're, seeing yeah right it's not as of right but BSA could just would be able to approve that. Yes, the section that you're describing now is yeah the section that the BSA would be able to modify, not anything that we were just talking about with the dry floodproof spaces or the the exemptions. Yes, okay, sorry and I just have one more quick question. Sorry I don't want to take up too much time. The other area or section that allows space used for temporary for the storage of temporary flood panels to be exempted also exempted from floor area calculations. How is that determined? And how is that monitored? And if a developer says I'm going to use, you know whatever 5,000 square feet for temporary flood panels? How does DCP know that they that developer will do that? You know for the entirety of that floor area exemption sure. So the there is a limit. So it is a limited amount that I think we're allowing for the storage of these flood panels, and this was in response to us hearing that I think the department of buildings and the flood business and construction standards sometimes would require these flood panels to be on site within the perimeter of the buildings, and you can imagine a lot of the kind of buildings here in Manhattan may already be. You know, maxed out on the far or may not have spaces within the buildings to be able to store these. So we were just responding to you know, providing just something very small for them to at least have that on-site department of buildings we'll be looking at the applications and we're working closely with them on all of these kind of floodplain related kind of regulations in the zoning, and so they will be kind of strictly enforcing and reviewing all of these again. So yes, it does that yeah that answers it. So there's not like a number. It's just going to be that it would that would be reviewed by DOB. So there is a number I believe in the text. Specifically, I think it's related to how much flood panels you provide or what, how much you're protecting of the building I think it's in linear. Sorry, I, don't remember the exact number, but it's in kind of linear footage, but it from what I remember. It is a very small amount and it really ties into how much protection you're providing like on the perimeter of the building for the flood panel. So it is very specific and there's specific numbers to it. Yes, great thanks for answering those questions. Thank you. Michael and I also have a quick question. So I understand the logic behind to demote the building of nursing home in the footprint, but it also conflict the Cp3 district needs statement, because we actually want to see a more nursing home in our area and I, but I just thinking about like a lot of the senior housings right now, the people in just regular senior houses. They are also very old and immobile. So when you put that put the restriction on nursing home in this project, have you ever considered a senior housing as well sure yeah? So we did have discussions about the definition of vulnerable populations and what that meant. Currently, we don't believe that this should be expanded beyond nursing homes. So our research looked at all uses with the occupancy code that referred to nursing homes and adult facilities and psychiatric facilities, and we didn't see what these those other types of oops sorry you're, just asking about: regular senior housing right, yes, yeah, so senior housing, I guess the easiest way to think about it for us is differs from nursing homes and that, while senior housing, they do have some immobility issues. Nursing homes have critical infrastructure that kind of has supportive life services, so you have some residents there that are maybe need a respirator or maybe are hooked up to these different machines and therefore their mobility. While it's difficult to evacuate during an emergency. Anybody with mobility issues, it's even more difficult for somebody, who's on supportive machines within the building and so to transport, an entire population who are kind of living off of the infrastructure of a building, that's kind of the ones that we're looking to get out of the flood zone. First and again, it kind of goes back to balancing the need for housing, we're seeing an aging population and if we're able to provide more senior housing, that's great I. Think generally, we prefer to see that in transit, rich non-flood risk areas, but that's not always possible, and so that's why we're not prohibiting that use right now. Thank you, Olympia, yes, thank you. I mean I want to echo the concerns raised. You know by Lisa and Mike I also read through the material and I mean to me: it's not even confusing it's just that this is a list of unintended consequences for me in the sense that you know, we know how real estate developers operate in the city, and so I'm very concerned. For instance, I can totally see this option in which you are giving, for you know the accessory space to be placed above the target. Let's say of 14th street. This is going to become the new standard and the reason they're going to do. That is because they're trying to do higher buildings because they think they can charge more for the top floor. The same thing, I had also noticed the exemption for storage of barricades and I was asking. Is this going to be the new mechanical void that they're going to say? Oh yeah, my barriers are 60 feet tall and now we're going to have this weird proposals going on in the flood zone, I mean I was going through them and I was you know, asking constantly making marks? Do you have a maximum height for this? You have a maximum height for that or the square footage like like Mike was suggesting. So with that in mind, my concern analysis of what you're trying to do. You know I understand that it is well intentioned, but I'm not sure zoning is the tool to use to address these concerns. I mean this obviously has to do with more comprehensive planning on one hand and then, on the other hand, you're trying to basically create financial mechanisms, because I mean you even said today. Your colleague mentioned that you know we have concerns because they're cost prohibitive. Now this assumes that you presume that any development needs to have a margin of gain. That is a given. That's how much they need to make, but the reality is like all over the world when you build another licensed architect in Europe like there is, let's say: if I'm building in seismic zone yeah it's going to cost me more to do the structure that will be resilient in the advent of what we call terror earthquake, but I have to do that. This is not like it's the cost of making business. If you want to say so, I think that if people choose to build in the flood zone, they need to occur that cost and I do agree with Mike that you know we should be very careful in incentivizing building in the flood zone. There is this. You know curb, had published this article about the new proposal by the De Blasio administration that we were going to be investing 10 billion dollar in flat, Zone and Klaus Jacob that I'm sure you guys have studied. That is the Columbia professor that talks about you know. A lot of the cost is going to be under water in the next 120 years. He's saying why are we like at some of it in 50 years? So why are we investing there? Why are we building this and so I really believe that you shouldn't try to use a permanent zoning text amendment because fundamentally, as we've sadly experiencing right now with the pandemic, every crisis is different than the next one and so on one hand, I think it's important that you are starting, and you have you know the various mechanisms, analyzed, etc, but once we create this appendix g amendment I am afraid we will be creating an incentive for predatory. You know real estate development to be looking at flood zones in which they can sum up all these little cookies. That I, you know, and Mike and Lisa were mentioning and basically not to do a service to the greater community or the city as a whole. Also to the comments that Jackie made I had also noticed the nursing home ban. Let's call it I mean I have huge concerns, because you know a lot in district 3. A lot of our flood zone is natural development and, as we you all know, NYCHA is said to have infill eventually will get infill and also people have been talking about air rights, transfers, etc. So, and we all know that BSA is not really reliable. The judge had to intervene recently twice I think with the Holmes Tower situation, so I believe that on one hand you know our community will need supportive housing, senior housing, nursing homes, etc. So banning certain uses versus other I understand what you're saying about life support but I. Think, overall, you know enforcing the rules but making development where it really makes sense and not where it makes sense in terms of the market, how much money they can make from the Laksa development that will be attached to that, but how much it makes sense from a community resiliency and an environmental resiliency point of view, and I'm not sure currently, this proposal prioritizes that thank you Olympia Matthew. Do you want to comment or I'll go to Trevor I was just going to comment on the heights and first I, don't think we've ever seen developers do anything. We did it in 10 by zoning right joking, so, but with that we still have the underlying zoning here. So what what's happening is we're? Not you can't just build a bunch of extra height. You still have height limits. A lot of the applicability in community district 3 is in the East village, which has R8B r7a all of these different contextual zoning districts. You can't exceed those Max heights. You can exceed those Max heights by more than this. If you're in the one percent room, we are allowing you to go 10 feet higher, so you're allowed to measure instead of from the curve you're allowed to measure from this new reference plane, so you are able to go 10 feet higher, but not 100, feet not 300 feet and if you're in the 0.2 percent, which a lot of this area is, if we go back here, we can kind of see these orange areas. Here, that's only five more feet, and so that's one limit. You do have height limits in these different districts that you can't exceed there's a little bit more flexibility given with these proposed rules, but it's not something that has an asterisk or has like can just keep going. The other thing is you only have a limited amount of far outside of that BSA special permit and these discretionary actions which allow for an increase more than what's allowed. The as of right is just saying you have this amount of floor area and that's what's regulating the size of the building and what currently exists with how to a big site will generate a bigger building. A smaller site will generate a smaller building, that's not being changed by this, and so that's just underlying zoning, and so we don't anticipate the new voids the new mechanical voids out of this proposal because it, the underlying zoning, still governs. Thank you Matthew. Thank you. Someone was speaking. Oh, I'm sorry, it's gene again, so I just wanted to add just a little bit to that is, and the giving kind of additional height just this little kind of minimum height for these buildings to you know, try to be more resilient, isn't something you know that has been happening recently or you know it's not the first time we're proposing it. It's actually been in the zoning resolution, since the city joined the national Flood insurance program in 1983. So since then, high flexibility was given just to allow again these buildings if they have to meet building code, to give them flexibility, and also just so that they're not really losing their development rights or losing. You know habitable spaces that they would normally be able to get so I just wanted to point out that this isn't the height flexibility, isn't something new. It's something that has been kind of. You know within the Zr. The zoning resolution for some time now so just wanted to mention that and oh sorry, and just one more with the nursing homes just to clarify when we're saying that we're kind of banning or prohibiting that's two new nursing homes, the existing nursing homes that are in the kind of one percent flood plain or in kind of you know, areas that we've designated they would still be able to be there and also we're giving them. Some flexibility to you know, do improvements and things so just wanted to clarify that to say that we're not you know removing all nursing homes from the floodplain. Thank you for that clarification, I! Guess it's just that nursing home is really needed in this community and when I see those language, it just triggers some thoughts and concerns, especially we just lost a big nursing home two three four two three years ago from this community Trevor. Yes, thank you a lot to digest here, so I'm going to try and make this a little more local. Could you bring up I believe it's page 12 which shows CD our community district, a map, yeah and I- know you've been focusing on the each villager and that most of that area does not have an extreme height. But if you look further down to the, which is really the two bridges area, you will see a lot of buildings that could be built because it's essentially an r10 area for most of that, but I won't focus on that. The two question or three questions I have the first one is: will the ESCR Bmcr projects which will essentially raise that land or provide some type of flood protection, change these maps or the requirements? Because if the new area or the new land makes it, it essentially raises it above the flood plain? Are they still in the floodplain area and subject to these to the Sony text? Amendment just the one question: well, I've got more I just want that: okay, good great one, okay, yeah I was going to say that's, unlike you perfect, so yeah I think I'm glad you brought up ESCR. So this is applicable where the flood maps are, and so the East side coastal resiliency project, as many of you know, is seeking to modify those flood maps. I believe the current timing for that is by 2026 at the earliest is when a revision might be made to these, and so that would provide a line of protection along the river and so a lot of from Montgomery. All the way up to 14th street really and beyond would no longer be in the floodplain, and so the rules that would apply just to these areas would not be applicable anymore. That's a that's the same for south of the area because we have the Bmc so I the bmcr projects. I is not I, don't I'm not sure the design, flood elevation, I think theirs is a little lower than Esker and I'm not as familiar with how they're changing those flood maps, but it would be the same, would apply if they provide flood Protection Act. Well, there's a difference also between active and passive here too. So if they're providing flood protection there and they are seeking a map change through FEMA- and it says that the one percent annual is not here anymore- then this would no longer be applicable. Okay and I'm just want to be able to try and understand what perfume, because that was a no-no after sandy or for most cases, if it's just a commercial space, not in nothing other than the commercial space, a one or two story. That's in this one percent flood plain is any elevation required if you were building on a CD and just to be local. Let's just take the two pictures area and looking at a purely commercial space right along the waterfront. That would be wet proof. Is there any elevation required for that type of building, so the only certain uses are allowed to be wet floodproofed, and so those are storage, access and parking. So commercial, new, commercial and substantially improved buildings with commercial spaces would need to be dry. Flood proofed dried floof, dry footprints, but not necessarily raised, not necessarily because if you're a dry floodplain yeah go ahead, I'm referring really to the underneath the FDR. Where you know the proposal initially was to put a number of pavilions underneath there and the new rules made it so that we'd have to raise those pavilions, and then that was an option, so they said well. Can we wet foot footprint the area and that didn't seem to be an option. I know in community number one area along the waterfront they've managed to get around those rooms and I. Imagine that governor's island is going to have to do something to get around those truths. I'm just curious about underneath the FDR, the underneath the FDR is sometimes a little trickier. It depends on the ownership there and if whether or not the structures are permanent, if they're temporary structures, it's going to be a little bit different. If there's not a Cfo, that means something else. So I'm not as familiar exactly with what's being built there and what's proposed there, but those rules may not be. They may follow a little bit different set of rules in these. Thank you, traffic Matthew I, have another question: have has DCP thought about. If this test amendment does not get passed, are there any backup plan to extend the 2013 and 2015 test amendment? Yes, I believe that the the one that just recently expired was part of one of the executive orders to be extended because it expired during the pandemic like July yeah, so I mean we're I, think that's a for lack of a better pun. That's a bridge that we hope we don't have to cross we're, hoping that this one does get approved and but I guess. If something were to happen, that's what we would consider that. Thank you, Matthew Olympia! Yes, so I wanted to ask when you use the design flat elevation DFE. It's not clear to me like this is. Are you using a specific number that is, you know, depending on the ocean level, rise like how many years out, because this is going to be changing right and also are you when you're saying it's going to flood up to there? It depends also what storm category you're looking at right. So what is the references that you're using here or you are just allowing it in the zoning and then the building code will talk about these specifics. So it's using the flood insurance maps, the firm maps which are put out by FEMA the one percent annual is they do change that and they are going through I believe now, they're updating those for future projections but, like we said we're adding that 0.2 percent, because we want to provide this flexibility to those moderate risk areas, even though those are ones where the we may not. We wouldn't expect to see with our projections as many floods, but with storms like sandy, we did see that they went even further than we would even think so. We're trying to be conservative by adding that additional area with the point two percent annual flood chance, but technically what I don't understand is so this is going to be an ever-changing eco incognito right. So are you designing a rule that is changing with that? Incognita or you are setting something? No, it's so it so these maps will not be static in the Zr. These are going to be based off of the theme of flood maps, and so, as those maps change, that's when the applica, the applicability changes so with like I, was saying with Esker. If it retreats, then applicability retreats, but if it expands in other places, that's where then it's going to expand more too great, and also during your presentation, you talked also about Frce and I was a little bit. Maybe was not paying attention, but you mentioned. This gives a 30 feet. You know allowance, and so what is this? How is that different? The flood, the Frc, the flood, resist the Fl I have to look up. The acronyms I know we're playing alphabet suits. Sometimes it's very confusing. It's what it's called in the zoning resolution, it's the same as the DFE, so we're trying also yeah we're trying to consolidate that language. So there's not too many things floating around, but it's one of the same. It's just it's just used that way. Currently, in the zoning resolution, the reason I was asking is because, in terms of understanding the maximum levels- and it was helpful to hear you say that in general- nobody will go above whatever is they are, but in this instance, though, in other reasons where it said it's going to be maximum up to 10 feet during your presentation, you said when you use the term fs c e instead of Tfv, you talked about 30 feet and that's why I attacked my ears, but I wasn't sure you know I think the 30 feet. The only place 30 feet comes up is for this slide, which is that the amount from the street wall that you're able to exempt from floor area if your ground floor is dry, flood proofed. So is this a height or is this the depth? It's oh I see so yeah. So this you could say this is DFE this right here. Let me just change that to there, so it changes a little bit easier. So this is just like whatever that design flood elevation is, but this measurement is basically from this solid orange line to the front of the building. So it's a 30 foot depth from the center. It's like a setback, kind of thing sure I mean you would measure it the same way as you'd measure a setback. It's not architecturally setback. It's just the amount of floor area that you're able to accept great and then I was a little bit confused from the comment that was made actually by Jim after your presentation and I wanted to understand it a bit better. I think what Jim suggested is that in his you know, planning perspective. This amendment makes sense because it would only apply in a case of emergency as opposed to an executive order that we don't have input in. But my understanding is that this is not in case of emergency. This will become the new rule for all the flood zone, currently the one percent and 0.2 percent- and it is not an as an emergency response- did I understand it correctly or did Jim understand correctly, or maybe he was saying something else. Just I was just referring to article six or yeah. What is it, what section six chapters yeah article six chapter- five, oh so not to the whole thing. Just for that area yeah, the news is regulated. Yeah I mean one last question. Sorry, just because you're really helpful with your answers, guys so I wanted to ask you if you can frankly respond to that I mean the thinking here. The reason for which you would like to have a zoning text. Amendment is because you noticed after Sandy that there was a lot of this retrofitting that is now law mandated by the building code, etc, is cost prohibitive, but is there anything else that is happening beyond the fact that this costs a lot like? Why would you need a zoning? You know text amendment I brought you the example of the seismic code. You know whatever there is no zoning for that. So people just need to comply with that and do the proper kind of structure and with flood zones you would think they would do the same. I mean we would love if every building owner dry floodproof their building, and we didn't have to do anything, but we just haven't. We haven't seen that, and so we know that it's very costly to do. It I understand that there's different expectations for how much is enough for somebody to gain from their investment in a property, but that's not something we dictate in zoning, so we're just trying to create an incentive where you can reallocate you. Can you don't have to lose the value of your building, so you can just flood proof it and so that you can make it more resilient, and so we haven't been seeing a lot of these resiliency efforts happen from private owners with the cur, and but we have seen new buildings go through it and there's been kind of a some have been great, but some have been have had those sunken floors. I was talking about where we just want to make sure that the interim text that we passed, because this stuff has been around for seven years most of it has been around for and some of it's been around longer. Like gene mentioned, the height flexibility has been around since 1983. This is just kind of one making permanent those temporary measures and two really just trying to make sure that property owners can protect their building, but also not just have their all their money sunk in doing so, and so they can recoup some of that value. But when you say that they don't they, if you haven't seen them dry proof, does that mean they are breaking the building code so like there should be enforcement, not necessarily so you're only required to meet Appendix G, which is that's the building code? That's just for this area, if you're, new or you're substantially improved, which is a really big improvement. So 50 of the market, value of your building is considered substantially improved if you're, an old building. I, don't think I mentioned this, but of the buildings in the two percent and the one percent flip plane in community district. Three most of those are built pre-1961. So these are it's a pretty old building stock and so we're not seeing substantial improvements to them and so all of those old buildings they are legally non-conforming or sorry legally non-compliant buildings. Thank you, Matthew. Next, I'm going to go to Damaris and after Damaris, I'm sorry Damaris and after you we need to try to wrap this up. Okay, cool I'll be as fast as I can. So, if I understand this correctly, this is largely a proposal that is meant to incentivize a building owners and developers to engage in flood proofing without you know so that it wouldn't be so cost prohibitive. I guess my question to that I mean that's very simplified, I know, but my question to that is: can you I mean, aside from the last statement that you just made that you know that some of these rules have been around for a long time and that we haven't necessarily, you know, seen building owners rush to make. You know needed upgrades and improvements? Has there been some push or call from the real estate? You know community saying this here is what is keeping us from being able to do that? And if you change these rules and you made it easier and less cost prohibitive, then we would engage in this activity. Yes, so we did do outreach with property owners. Come to your attention, I mean like how that's become such a big. You know a big enough issue to warrant and move the city to want to make such a change like this I. Well, I, wouldn't say: that's the impetus for us making the change. The impetus is that we're facing climate change and that we want to make a resilient city, and then we look at what tools zoning can provide, because it's city planning, that's the biggest tool in our toolbox, is what kind of zoning tools can we use? So if I go back to this slide, which is at the very beginning sorry, it's kind of this like multi-tiered approach, we're just talking about the buildings, there's a lot of other things that could be going on changes to infrastructure, to the coastal resiliency strategies and then just emergency preparedness, so making sure that folks know their evacuation plan that we're able to help out those who need to be evacuated first and things like that, we'll really just focus on the zoning here, I was I, think gene had to hop off, but the folks that were did the outreach from 2016 to 2018. A lot of that did include property owners, and so that's just something that I've heard anecdotally in working with property owners is that this is something that's really cost prohibitive. It's a reason. We actually see a little bit less new development in the flood zone than outside of the flood zone. That's not to say that we've never seen new development in the flood zone. We do definitely see it, but it's something! That's it's costly and it really comes down to just the sorry. What was that I said? Some of us kind of like that fact that there's not you know people rushing sure, I understand that too I think that's a different conversation, though so I'll try to answer this question, but those I mean those finishes to basically seal in your building are expensive. It's a really big aquarium, basically and I haven't tried to purchase an aquarium recently, but just knowing the small two by three those are expensive and that kind of just adds up those different things as you're going through construction. Thank you Michael. Thank you Matthew. So if there are no more questions, I would like to go to committee deliberations. So I have two questions to ask the committee first I would like to know: do we want to take a position or not on this issue and I see a couple committee members feel like they don't want to take a position and I also want to ask if we don't take a position on this application. Do we want to make comments, or not so I want some committee members to share their thoughts on that and I see. Lisa doesn't want to take a position. Olympia are you with Lisa on that as well? No I! Actually you know, especially with the last comment with the marriage, I'm almost thinking that we should have a position and be against so all right. So how about this? I'm going to ask the committee members to see if we I'm going to take a straw poll to see if we want to take a position first. So for those who do not want to take a position, please raise your hand. Wait! Oh I'm trying to know that I'm not out of like parliamentary procedure, but I'm just a little confused. Okay, when we say take a position, do you mean? Do we want to pass a resolution in favor of or in opposition to right and what's the, what is the alternative to that? Okay? So if we want to take a position right, so it's going to be either supported or we disapprove it with condition without condition, and then, if we don't want to take a position like we don't approve it or disapprove it do. The second question I have is that if we don't take a position, do we make comments about that or not so? The first question I'm asking the committee is that do we want to take a position or not and the position could be approve it or disapprove it, but this doesn't change that people can still submit comments by December, 28th right that is correct and then okay, I'm sorry I feel individuals can also or organizations can also send in their comments right or just for the community board on the Aids deadline. So that that's your deadline or that's our request is that that's when you submit them. If there are community organizations that have sent you things, you can forward them along to us or they want to send them a lot of them. Have my email, which is fine. You can send it to me too, and I can pass those along there's. Also the comment period. Then necessarily it's an it's a text amendment. So it's not going through Euler per se. So it's not a you're correct yeah. It's not like a traditional public comment period. That's just the courtesy that DCP is extending to the community board in terms of a deadline by which we should get in our comments, whether that be a resolution today or not, or you know whatever that might look like, but that we do that by the 28th right, yes, I mean we're, never I mean I, don't throw out any comments, whether or not it's you'll or Bernan Euler. So if somebody wants to send something to me, please do but officially it's not some big public comment period, correct, but I believe in that link. There might be some comments that gene put, that you can request. Information and contact can I ask a question as well to Matthew so a little bit earlier. You suggested that things wouldn't be changed much I. Guess I'm wondering like what you know if DCP gets comments from 90 of the community boards that they don't like certain pieces like what are the chances of things changing and how does that happen? How would you or will that happen at all, or do you think it's just this seems pretty likely to pass since there's not like the standard. Euler procedure I mean we always we look at all comments and then assess whether or not they weren't changes, it's kind of hard to say and hypothetical, but I would definitely if the there's a recurring theme from a lot of community boards, I mean that's something that's going to warrant more attention. If it's a specific to one community board, that's also it's still going to warrant attention. So it's kind of hard to say, but I hope I know that you folks always submit very detailed comments. I read all of them. I pass them. We talk about them in our office. We talk about them with our executive office, so they're always going into the deliberations. Thank you I'm going to. Let you I'm going to James. He raised a hand from the city. Council land use, yes, I'll just add just for I, suppose information that there would potentially I supposed to be a possibility for the council or the city, Planning Commission, to add modifications to it. Even though it's a non-new learn of action, so you could advocate I suppose with your council member or with the Cpc or if there was an overwhelming, if there was some overwhelming opinion that those organizations were aware of, they could request modifications, I believe, even though it's non-euler just for information. Thank you, James Olympia, so I guess my question is probably more for Jim than for you Matthew. But basically, if we understand correctly what was said today, the majority of district three buildings that are now in flood zone that would be nice and other kind of you know affordable housing. They wouldn't really benefit by this zoning text. Amendment, however, as your exchange with the Mary said overall, this zoning text amendment would create an incentive for new development in the flood zone, the infield and others that, as we've seen in previous analysis, is contributing factor for gentrification. And so it's hard why I told you zoning may not be the right way to go about that. Is there any zoning tool that we can use to say if you're going to do that, you're also going to make sure that this new for profit development somehow pays for upgrades to the other people that are not getting any? You know flat benefit by this flat protection benefit. Well, I would say: oh do you want no go ahead? No I would just say: I would be con while it does afford you know additional height right that can be used for private profit right there isn't inherently a substantial. There is actually there's zero additional far net, far being generated right, you're, moving it or you're moving it around right. There's new square footage being potentially available at a height that was formally not allowed pending height limits right, which are still which, if they exist, would still govern, but I, don't I would just I would caution that I, don't think it's generating enough additional floor area to like trigger any substantial development. You know it would trigger maybe some modifications at existing buildings or in new buildings, but it alone it wouldn't generate enough floor area to like substantially. You know it's not like the same volume as like MIH right: it's not a bonus even like MIH. It's it's like a reallocation so and actually, in my personal opinion, I would be concerned that, in fact the incentivism isn't even big enough to trigger the resiliency measures. That's actually my concern is maybe in the other direction, where I'm wondering, if there's still not enough incentive and I'm not saying that it should I'm not saying the incentive should come. Let's just keep poor area like. Maybe it should be subsidy right from the city or funding, but I'm cons, yeah, so I, don't know that this alone could like facilitate a new tower. If that makes sense, it couldn't actually right. It's just that Orange box that we saw in the slides right, which would but it's still an exemption I mean it's still exempting square footage that is going towards that far so like, and that could go above right well, it would go above right, functionally like if you could pull it off. You know architecturally, absolutely it would go above I think the concern from people sounds like it's not. You know the small tenement owner it's extel or someone using this like Olympia said as like. Another mechanical void situation and figuring out ways to exploit this and again I mean Matthew did say it does incentivize development in the flood zone, which, for me I guess just to answer Jackie's question I, do think we should take a position and I personally think we should stand against it because I don't think. As people have said, this is the way to deal with. That is fine and I. Think I should just take a straw pose so that all our opinions can be reflected. So we can move forward. So I'm going to try that question again. Those who think we should take a position. Please raise your hand if you think we should take a position. Please raise your hand. I want to do some counting Jackie. Maybe you should pose what the alternatives are, which I think are either take a position or you know, put make some points that can be conveyed. I'm sorry, let me try or do nothing either we take a position or we just comment or we do nothing right. Okay, so we have three questions: three options we need to. We can take a position or we just comments or we do nothing so the first is it easier for me to just do a roll call Jackie of what people's thoughts are? Yes, Michael, okay, so the three questions, three options: are we either take a pos, take a position or we just make comments. We don't take a position. We just make comments. Oh we do nothing Michael, okay, Jackie. What do you think? Nothing? Okay, Linda comment. I'm sorry one! Second, my dog is eating his pee pet. Is the dogs, the babies, the cats? Have you noticed how it became dark in my house, everybody's sleeping now, I did see a little face for a while later. Okay, next is me, I'm sorry, my computer is freezing I. Believe we should. My position is that we should make comment. Dominic, I, think it's not here. Right, I didn't hear what was that Mike? I'm sorry I think my computer's skipping I'm going to just mute, my video to make it, but you said that you yours, what was your straw poll response? I? Think we should make comment. Michael I can not take a position. Michael I thought. You said you want to take a position. I'm sorry, yes, I think we should take a position. Okay, I'm sorry about that. Jonathan is Jonathan. Still here he's still here. He might have stepped down to the restroom or something like that. Why don't we move to the next person Herman? Thank you. Lisa I'd rather do nothing, but I could be persuaded to make comments. Okay, thank you. Olympia, take a position. Thank you. Damaris. Take a position. Thank you! Troy. You have an opinion. If you're talking, we can't hear you Troy Michael we go back, Steve did Steve, come on no I, don't see him. No okay and then Jonathan are you here? Oh he's, he said his mic is messed up. Okay, Jonathan! Can you just type in the chat? What your opinion on what our opinion should be? Is: okay, so Jonathan, just to clarify that you think we should do nothing. I would be no yep okay and we don't have Troy right, yeah Troy. If you're here, can you maybe post in the chat or unmute yourself on your opinion? Okay, so barring Troy, we have three people who say we should do nothing. One person who says we should comment and five people who believe we should take the position. Then we just is that Troy. Okay, so looks like we are going to take a position. Oh Troy. What is your take on the options again because he wasn't here? Do you believe we should not make any comments whatsoever? Just say nothing to this position proposal. Do you think that we should just submit comments as a community board, or do you think that we should take a position either for or against this zoning text? Amendment I think we should take a position. Okay thanks, so we have six people who prefer to take a position. Yes, okay, great, don't we now have to discuss whether that position would be in favor or right before we yeah yep and next question is that we should try to get a direction like Lisa said: do we support it or we do we approve it or we disapprove it? And then we start from there do we want to take a straw poll again, but I mean my general feeling is that most of people who seems to prefer disapproving it, but I just want to set it on the record. So maybe we should take another struggle, just to be sure Jackie, I'm not sure. If that's actually accurate, I think the I know you have a draft of some of the items and I didn't participate in this. Perhaps we can go over that because there are some things that we're going to miss out on and granted. These are comments that go for the entire city. It's not just our district, so I know Matthew says they read them all, but you know this is just like in my district. But if you want to look at that first, perhaps to see what direction we should go in because it does go into some of the issues. Was it didn't you're talking about the draft Rezo, the draft resident just tried to summarize what was in the yeah. So the draft is, I'm sorry, you said: go ahead, that's basically what I was going to say it didn't take it left at the end, either that we support that or we don't support that. But it wasn't it didn't what I'm saying. I don't want to go through those 25 points at 8:30 right and also the draft just states some facts. It doesn't have any like a direction whether we approve it or disapprove it. Just some fact. We collect from the description from the test amendment proposal correct and understand, but if we're going to go over what, whether we disapprove or don't disapprove, what are we talking about right? So eventually, if we are going to do the arrests, so then we have to use that I'm just trying to get an idea like whether this committee, a majority of people, want to support the test amendment or not want to support the test amendment, and we always that we always do in the past. We can add a condition or we can not. We don't need to a condition either way. Then at that point we pull up the wrestle. I mean to be to give you an example: do you remember last year when there was that tech hub issue, and we had that hearing and instead of getting the tax hub rezoning that we wanted? We were given that hotel amendment and we just voted it down because, like that's not what we want, it has nothing to do with what we want and I feel what is happening here today is overall, our community has a lot of zoning ideas about the two bridges area, the China town area and those things never come to anything, and this thing that actually doesn't even serve so much our you know, built environment in the flood zone is not creating an incentive for our vulnerable population, is kind of becoming a priority. We're not saying that it's not good in itself. It's just! It is not the priority of this community. Why don't we deal with something else that is more meaningful and to Jim's point he's also fair. It may even not do what it is supposed to trying to be doing so. I think a fair criticism so that you know Matthew loves it to know that we are engaged and we keep him in check this way. He can have his game up. So it's 8:35. We really need to move on so I want to know just to get an idea. Linda actually can you I think eventually we have to use that wrestle. So actually can you display that right here, good question, Jackie, real, quick before we move forward I mean this may be totally crazy and maybe I should know the answer to this. But I, don't I mean it is 8:30. We still have stuff on our agenda. I, don't know if we're going to move forward because they need to hear or they've. Given us, I guess: I, don't know if it's an informal or formal deadline of December 28th is it possible once we determine you know whether or not our position is to oppose or not that we can play with the language, and then we can present that resolution at the next land use meeting. You know so that we're not here all night trying to write a resolution. So then that would go back to whether our position is to approve it with condition right, united with condition. So if so, you will go back to that. We still have to make that decision. First, yes, but at least we don't have to write the whole resume. No, we can like enter I mean if the. If it is outright denial, then we don't actually need to any conditions if this is outright denial. If the committee members prefer to outright deny this application, then we are done for the night. We only need two minutes. No, because you can deny with comments. You give the reason right and that's how you contribute right, because we want a meaningful contribute. That's what I'm asking the committee members to tell me which direction we are taking, because we need to decide like looks like people have problems with this application. So we need to decide whether we want to deny or approve with condition or deny with condition so Linda. Can you actually display that wrestle and then we go from there? So do you want me to send a file to you again if you want to give me permission, I have it up on my computer. So are you seeing the document folks nope, okay, no hold on there? How about now? Yep? Yes, thank you. So this draft has been shared with all the committee members and for the interest of time. I don't want to repeat them again and they just stay some facts. They don't have any preference which direction we should go so I want to ask committee members can I because of the for the interest of the time. Can I just only ask you to give you two options. The two options are we outright deny this application or with denial with conditions. I want to know what you guys feel I mean I, don't see a lot of people want to support this application. I have trouble seeing what the those conditions might be. So do we want to end the condition Jim mentioned something about about changing the the use for the non-conforming and non-complying use property use, and my concern is about the reduction of a nursing, home and Michael I. Don't recall what oh, your concern is about over development because you are at because my concern is not over development. I. Just don't think we should be using a Bloomberg Era Zoning text, amendment to incentivize developers to do coastal flood resiliency. In this way, I'm not concerned about over development. Okay, I thought. You know, I thought that the concern is that to allow like one more floors for the building to I, think I, don't I think we should be exempting floor area as a way to incentivize private developers to do coastal flood resiliency I. Think, like people generally I, think there are better ways to incentivize that don't involve incentivizing private developers and landlords Michael. Would you be able to take down those points so that we can add, as condition if we want if we choose to and I think what the marriage had mentioned is connected to that and I said. That is this zoning amendment Zoning text amendment would eventually result to more and easier development in the flood zone. So you know there are other things that we could be doing as a city. Why prioritize that, and one of the reasons is very often these are, you know very appetizable for real estate developers, and that is a huge red flag. Trevor and he said: do you have any anything you want to add? I was waiting for Lisa I have not changed my position that I find this too complicated and too nuanced in its details to really understand what the implications would be and I am uncomfortable, taking a position, so you prefer to do nothing right. Yes, that's correct and that's still five to four so taking a position is still winning I have voted before it had done. Don't count me twice: I, don't! Oh! Okay! All right I could easily change my position from comment to do nothing. Well, if that's the case, then it's Jackie and doing nothing is almost the same thing. Yeah. You are right, I'm sorry! You are right like if we're going to write a resolution. Now it's almost the same thing, except that in taking a position and saying we oppose this action. That at least is an actionable step. That tells that says something you know doing. Nothing can be interpreted that way, but it's not necessarily mean it doesn't necessarily mean that right. You know absent of understanding those two nuances for ourselves. You know I, I'm I would be more comfortable saying at this point. You know that I oppose this action, but I think mostly because I don't necessarily understand and think that it is going to. You know, I think that what it, what the I'm not convinced that providing an incentive to developers you know and not that this is the I understand that this is Matthew, that this is not the primary goal of this, but it is what happens in the end. So I would argue back to you then Demarisa. We should comment and not take a position, not a pose, but comment well, I couldn't comment, but I thought daenerys meant is just outright denial. Yes, I'm saying that for me, I don't want to see anything move forward in this current iteration as it stands right now, so in not taking a composition and only commenting, we may give the rationale, but we're not saying no don't move forward. Okay and I would like to say no don't move forward. I kind of agree with Demaris, however, I want to hear it from Trevor, and then we how about this, we should do a road call to decide to decide this, whether we do outright denial or denial with conditions. Trevor I was a little confused, but I think you just cleared it up, because I heard Lisa change her stance to just do nothing. She didn't. So. Are you guys? Okay with my questions, I'll write, denial or denial with conditions the two options I'm going to so do you want us to vote? Are we taking a straw poll? We are taking a straw poll Michael. Can you do that again? Please? Yes, one! Second, I'm sorry! So it's between those two options just to be clear, right, correct, okay, but also when you say conditions, do you mean comments like I? Don't know what do you mean by condition? Denial? Yeah? No, you go ahead. No I'm sorry! It wasn't my place, I'm sorry! It's just denial with those comments, the reasons that we just discussed it before so yeah, so the two options so with comments. Yes, I believe we should give comments. Okay, so I should vote, deny with comments. Mike Michael. Can we do the road calling again, I'm sorry? I was muted Jackie, I'll, write, denial, Linda I already know: I agree outright. Denial Dominic is not here. Jonathan. Are you Jonathan? If you want to just type in the chat your position, I'll move on since I know, you have mic issues: Herman Denial! Thank you, Trevor Denial, but I'm not going to lie I'm affected by this time and we have one more agenda. We have two more yeah. Olympia I mean denial. I would put comments too, but if you all go with denial, I hope we frame it well. This denial is still has comments right. It's just okay, good okay, then she knows. No. That makes no sense and what's the alternative, no denial, we don't add anything that is denial and denial with comments. Then we are comments. So these are the two options. I thought I was clear. I'm sorry but I think for the brevity, because we all want to finish the marriage suggested that we just write the razor for next month and we have enough time to write the comments because I don't think we can write the comments tonight and if we don't submit comments, then Matthew and the others won't know why we denied it and that's the most important thing to tell them our concerns. Demerits, I, don't even know what we're asking right now. I was confused between commenting, saying we're denying, because we have concerns about this and commenting saying we're denying unless we meet the conditions. But that's my bad I misunderstood that. So we a denial which everyone has voted for so far is just saying: no, we don't want this without adding anything, correct, yeah, okay, wait without adding any rationale. Why right? That's what you just said: I just want to make sure the mind is denial deny unless you do this, you know, or they approve what conditions so I just wanted to make sure we're not saying we deny unless you do this, we're saying outright denial, and this is why we don't support this. Is that that's what I want? Okay, or is it just no explanation, just a straight up denial and call it a day and be done? I thought that is what we meant. I, think understanding and I think everyone has voted so far to just deny it without adding any changes or comments or except for me, I wanted to give the rationale. I am happy with saying just tonight, but if we decide we want to give comments, I'm okay with that too. Okay. So long as those comments are not conditions for do this and then because I don't think we have that kind of time to understand what could be the alternative options that could you know result in a zoning change, that's beneficial to everyone right now or text them. You know a text, a language, so no I. Yes deny and if we give comments, then great, if we don't it's okay with me too awesome. Thank you. I think. If we want to give our rationale, that would tend to be in the whereases, not in the therefore right yeah, yes- and it definitely takes some thought so Michael. Can you continue to the road calling? So we have you just have Troy. What is your position and Jonathan Troy? Sorry, you just said full denial, yeah, okay and did Jonathan. Is he still here? Could I ask how I voted just a straight denial? No I did not okay I misunderstood. My vote is none of the above abstain. Then you abstain. We don't have to do anything, that's what Lisa do you just write about it, and so, unless Jonathan wants to take a position, everyone voted for a denial except Olympia voted with a denial with comments and Lisa said she did not want to vote none of the applause okay. So the committee members just told me to deny this application. That's it and we are done with this application. Do we have other comments? If not, then we should move to the next item. Let's move. Thank you, Michael, just to be clear, I'm just the only thing I'm changing in this draft reso is taking out, approves just making it community boy, 3 disapproves of application. City-Wide zoning text, amendment period right, okay and Jim Shelton- is with the current, whereas this makes sense logically or will we need to amend it? Well, it's your time. You know that's right. Personally, I think people brought up an important point that if you say no and don't outline, why you know what is the city getting from this. They were here. They heard you, but it's your time, it's nine o'clock, so I don't want to tell you what to do, but I think we should just move it for the next one, as Damari suggested like if somebody wants to volunteer and I can volunteer to do the, whereas that we need so that we give some rationale otherwise, I I think the position has been made. We should move to the next item and I met Phil I just want to thank you so much for is he still staying with us? Let me see I think he left this is his colleague Scott. He had to jump off for a minute so still here, but certainly convey his your appreciation. Thank you. Scott and I also want to tell you. The presentation is really helpful. Like Lisa said before, when I was reading, the description I had a lot of things. I didn't understand in the presentation really helped me clear those thoughts and thank you so much for that appreciate that. Thank you so much in the next item. Paula, I'm sorry to keep you waiting for so long are you is polar here. I finally gave up and ordered some people. I told you this would take long, I didn't imagine when I got your email, what that meant, I told you I thought. Oh, you know maybe an hour. How long have you been working with Community Board, three Paula I mean you know: I sent a private email to Paula before the meeting I was telling her that I could send her an email to come back to join this item so sh we didn't, we don't have to keep her waiting for too long, but anyway, it is what it is. Paula I would have been stuck in my house anyway. I would have learned less about the weird zoning incentives. Okay, so I'm losing my mind the next item. What is the next item is the update on the two bridges rezoning. So, as the committee members were aware of, we revised the application last month due to the outcome of one lawsuit and went through budget's lawsuit and also a DCP requirement. So I just feel like we need to update a committee member about it and Paula she's with us tonight and Paula is so involved in this new version of the application, so I'll let Paula to share with us why we need to do this and what are the major changes? Okay, I'm going to reframe I'm going to reframe that a little bit. No, there are no changes. We changed nothing. We are in the middle of doing the environmental review process, which I don't know if Matthew's still here, Matthew. Are you still here? No he's jumping? Is he really gone? Okay, so Matthew and his team sent us a letter. We have been three drafts into developing, what's called a reasonable worst case development scenario based on the assumption of the zoning in the neighborhood, as it is now without the approvals of the mega towers, because the approvals of the mega towers have been overturned by the court, so they weren't real right, and so we had gotten three drafts into developing the framework for the environmental review based on those assumptions and then Department of City planning sent us a letter and said: oh, since the appellate division has overturned the city Council's challenge to those to that approval, the conditions have changed so who's Trevor says Dcp's. Still here, I was hoping that whoever it was that wrote the letter would tell us about the letter, but they said we need you to redraft it to reflect the new conditions, as one of the attorneys was also litigating, the case that we that has not been overturned. That still says those approvals in December of 2018 were unlawful and the buildings can not be built. It's a little bit frustrating, but it actually kind of doesn't matter right because it would. Oh somebody from DCP is still on the call. Yeah I know I thought. Okay, now they don't know their names. I don't know who they are. My name is Scott I just spoke to Jackie a minute or two ago. So yes, I'm here I, don't know Scott I, don't think you're working on the team, that's working with us on the special district application. Only tangentially Matthew is the project manager, but I have become involved somewhat. Recently, I'm aware of the letter, but I couldn't tell you too much more than that I think. That's probably the extent of what the department has to say at the moment, yeah no I was just hoping Matthew would say we wrote the letter, we could do a little. We could say we wrote the letter, it wasn't a very long letter. It said the conditions have changed in order to move forward with environmental review. We need you to redo the analysis and include the mega towers as though they are the present. What's permitted in the neighborhood personally and my clients obviously disagree and the courts disagree about what's permitted in the neighborhood and department of city planning is making kind of making a prediction about what might happen in the courts. They don't really know, but in terms of asking us to do a different analysis that is entirely within their rights, and so we did and on October 30th we submitted a new application and wait Jackie, I'm going to if I can screen share. That would be super helpful, yeah, Linda yeah. Just give me a comment. Thank you. Linda I think a picture speaks a thousand words with a picture and then join the list. Oh there, you are. Thank you, okay, you should be good, so we submitted a new, not a new application. Excuse me a new reasonable worst case development scenario, and what you see here is our no action and with action conditions and the bottom drawing should look familiar because that's what we've been saying is the with action right, we're projecting new development on the Manhattan mini Storage Edison site, but it will have a it'll, be shorter. Squatter have more open space than what is currently permitted by the zoning on that site, which is not in any kind of special district. But it's just the underlying zoning and the department asked us to include these residential buildings in the no action scenario, there's a whole bunch of tables and text that goes with these pictures, but the pictures basically sum it up the with action. If we have the special district that we submitted is you know these changes to the Edison site, projection of what could be developed there? And, of course, the buildings not being there as proposed in 2018, because the buildings is proposed in 2018 do not fit the special district requirements and any new changes to the site plan of the lsrd I think you all can see my cursor so that lsrb covers this area would have to be approved by the city, Planning Commission and since nobody has put anything before the city Planning Commission, that would be new buildings that conform with the special district requirements that just doesn't exist at the moment. So the with action condition would be this. It doesn't mean that no one could later it doesn't mean that later the owners of these properties couldn't go back to the city, Planning Commission and say we'd like to make the site plan change and then conform with the special district rules. But there are some steps in between what, in between the special district becoming law and then being able to add those buildings, if that was what they wanted to, and then those are discretionary approvals that would again have to go to the city. Planning Commission are specific, so we submitted this in October. They have by the regulations days to get back to us, I'm crossing my fingers that this is our last fourth draft of the rhythm worst case development scenario, and then at that point we will have a scenario and we can move forward with doing an environmental assessment, and maybe we will be talking about how we're going to get that done. Hopefully soon we worked with George James on making these nice drawings he's always a pleasure. The community groups paid him with money that was nice. He knows this application well, so we anticipate, we might have opportunities to work with him in the future and hopefully we'll be able to find the support to do that. That's it I'm happy. Thank you! Paula I, don't have any questions. Other committee members do we have a time frame by when city planning is going to get back to you. They have 90 days, so they have to get back to us with it. So on November, December, January 30th, any other questions. Seeing none, I'm happy. Thank you! So much Paula you can I forgot. You can finish your dinner without seeing the community ball people. So I like y', all thank you so much. Thank you. Okay and the last item on the agenda is a nature update, so nature update is just a formality, because there's a committee needs to report to the land, use and I, because I was there. So I want to report this back to the committee. So last month we had the first Natchez at the meeting since February. It was a pretty well attacked about. We actually had over 20 people Paul, including a choice, Damaris and Tariq and I feel Sandra. Is here too so during that meeting the nature recovery and resilience department, they gave us a construction update on the recovery and resilience project for the lower east side properties, and so Smith and Laguardia are substantially compete and the, but the root and Jacob Reese are being delayed for for about a year and community members come who attend the meeting and block up issues such as surface interruption during the construction time, and also lack of outreach and communication from nature and and on the Covid-19 response. So nature told us they did rent reduction for those tenants who lost their jobs due to Covid-19 and community members also complained about other service issues such as rodent lack of garbage, pickup, water and elevator outage. There's a bunch of issues so John Blasco is the district leader over there. They in the Low East side, he suggested a CB3 to organize a town hall for nature, tenants to express their concern and also for nature to respond. The tango idea was well received in that meeting, but it has not been decided by the subcommittee and I think you know. I was expecting some other NYCHA subcommittee members to attend tonight's meeting, but I think what I'm going to do for the Tongho idea is that I want to confirm that at the nature subcommittee first and once it is confirmed, then then we can maybe have assigned like one or two community board members to start maybe making a plan. So the subcommittee can discuss. That's all I have for the Nhs Committee any other question Trevor. Just a quick question: did they go over 286 South Street, two bridges? Thank you. They do. They did I think you are also substantially completed if I remember. Well, it's not my building a CEO, I'm sorry right, I think it's also substantially complete if I remember correctly, because all I remember is that root. House and Jacob Reese are far behind and the rest of them seems to be okay, but I could look into that again. Thank you. Hi Jackie hi Hellman hi. This is just one item which I'm not sure it's going to be solved, but housing authority have this thing of maintaining sidewalk sheds for years and years. Without any work been done, and then they would take the bridges down for two weeks and then they put them back up again. The problem that we're having now, especially in the Far East side here, is that they are becoming shelters and you know for use for illicit acts and drug dealing and stuff, like that. I just needed to be brought to housing authority that if they are not reading it doing any job and if the jobs that is supposed to be done is that there is something to do because it makes the neighborhood looks awful. I mean and across from my office it's a drug dealing situation at the Bruschetta, housing and stuff like that, and then Avenue D, it's even worse. So I'm not sure what your plan is, but I would want just a quick question to be asked Herman. So what we can looks like this is a surface issue. What we can do is that, can you write me an email or actually can you write, Susan, email and copy me, and then I would try to follow up with her on that and also next month. December I, don't record the date, but during the night show meeting I can also bring this to the NYCHA people and follow up with them. But what you describe is not just a lower east side. Issue is actually a lot of nature. Properties have the same problem: it's not just us or the property in front of you and I agree with you. That is a problem they need to resolve. I will send Susan unknown yup. Thank you, Herman, any other questions. If no, then we are done for tonight. Any other questions, no okay, great. We need to do it all call now. Yes, you are right. Oh so don't go away. I know, I was so excited. I, just I was just going to jump, so we should have a motion to adjourn the meeting motion to adjourn. Second, any one. Second, all in favor hi wait. We have to do Michael, Right Michael. Do you? Can you darn, I'm just so excited to just jump off the computer? Yes, thank you. It's Linda, yes by all means. Now, yes from me, Dominic is not here. Jonathan Jonathan feel free to just drop. Your vote in the chat. I know you're having issues Herman yeah. Thank you Trevor. Yes, thank you. Lisa I didn't hear you. Oh yes, I'm sorry, no problem! Thank you! Damaris Olympia, sorry, I! Guess, yes and Damaris! Yes, thank you! Troy! Yes, thanks Troy, Steve, I, believe he's absent and Tim I believe and to the question in the chat. You should contact CB3 office. We are not allowed and myself in the chat. Oh sorry, thank you. Michael K, Michael Jonathan just said yes to I, send a test message to him. Okay, because he's still here, so he couldn't answer yep. Okay. Thank you guys. Thank you. That's all! Thank you. Good night, bye good night.",
            "summary": "This is our zoning text, amendment, which is going, which is called zoning for coastal flood resiliency, and so the impetus for this text amendment is really to create a city that is better resilient to climate change and the risks of a rising sea.\nA lot of these measures that I'm going to be talking about are already in place and they were put in place on an interim condition after Hurricane Sandy, and they were really meant to allow buildings to have the flexibility to meet the building requirements for building in the flood.\nSo in the future on which is the far right in this red is our projected sea level rises, which is kind of we're kind of extending that flood plain further and further into the island and further into the other parts of the city, and.\nWhile it may not look exactly like a building that you might see, walking around, the rules are still going to be pretty much the same.\nWe're, just making zoning a little more flexible so that these buildings can meet those higher requirements in the flood, zone, all right.\nWe know that we're projecting that this is going to go further inland to allow for those buildings that are at moderate now, but maybe higher risk later to be resilient, and the third is to save money on flood insurance, costs.\nThe zoning for coastal flood resiliency is also going to lay out a framework for responding to disasters in the future, which I'm going to talk about a little bit.\nYou may not recognize being in community district 3 here on the left here on the right might look a little more familiar to us, and so all the residential spaces must be above that design, flood elevation and.\nIt's kind of a lower level, protection of flood proofing, dry flood proofing, which we can see on the right-hand side, is a little higher form of protection, and so that's really sealing the building off so that the water is going to go up to the building.\nThe second goal is to support long-term resiliency designs of all building types, so providing that flexibility to meet the building code.\nSo this area behind it is the point two percent, and so we're going to extend the applicability of these rules to not just the one percent annual chance flood plain, but the point two percent, as well, which is high risk and moderate risk.\nWe're, seeing the point two percent chance and, as most of you could probably guess, a lot of this is going to be just along the water, except here around Stuy, Cove or sorry, not around stuyco at the bottom of just north of pier 42.\nThe 2013 flood text allows maximum height to be measured from the design flood elevation that is currently called the frce or the flood resistant construction elevation in the zoning resolution.\nThis is only available for buildings in the one percent plane which have a designated DFE in the building code, so to allow the buildings in the 0.2 floor plan to take advantage of this rule we'll be sending a standard flood elevation of two feet for buildings in that area.\nToday, building heights can be bumped to 9:10 or 12 feet, depending on the building's use and zoning district, which is making this kind of a highly complex framework.\nLet's talk about ground floor regulations, so these sets of rules would help promote good, long-term resilient design and good neighborhood streetscape.\nCurrent rules allow ground floor uses in existing buildings that are retributed or retrofitted to be wet flood proofed to be exempted from floor area.\nYou can see a provision that applies to existing buildings, which could exempt the drive flip-proof space, but had a hard time relocating the floor area to recoup the investment of making the building water tight on the right.\nYou can see a rule that applies to new and existing buildings, which allowed any space to be exempted from floor.\nThe proposal would modify these regulations to instead only allow the first 30 feet of space that is dry floodproof to be exempted from floor area.\nAs with a lot of text amendments, we realize that there might be a situation where a building can't meet any of these rules, and so there are, there is a possibility for discretionary actions.\nSo these are ones that would go through the BSA special permits, and these would ensure that these unique situations and hardships that are based on things like lot shape can get relief from zoning certain zoning provisions in order to allow them to meet those building code requirements in the floodplain, all right.\nCommercial uses a lot of commercial overlays, don't allow second floor commercial uses, and so this is just making sure that we're not having underlying taxes prohibiting buildings from becoming resilient.\nThese are flood protection measures, and so these are different measures that could be installed and be allowed as permitted obstructions within within required yards or open spaces, and so these are just two images that are showing where a building owner has taken steps to help to flood proof.\nHis, building, I believe here on the left, there's a window well down here and instead of allowing the water to flood through the building owner put in this knee wall here that protects against that on the right.\nA storm's effects are not just limited to where our lines are drawn on our flood maps, and so it makes sense to then elevate different power systems throughout the city higher so that they can kind of be resilient to different coastal surges, and so we've seen that this is like raising mechanical spaces.\nThat goes even further past the 0.2 percent, but we don't want to have rules that don't allow these power systems to be elevated, just because our current projections are not are saying that you're safe beyond this point.\nWe want to make sure that all areas of the city can easily provide ADA access, and so the proposal would classify both ramps and lifts as permitted obstructions in all required.\nWe, don't want to be locating these things when, when storms come through, then you're, isolated and you're not able to get out of these areas, and it could be disastrous, as we've seen when there's different types of electrical outages that are shutting off power to different life support systems, and so we want to make sure that nursing homes can no longer be cited within these floodplains.\nSecond, one would support businesses that do not conform with zoning use regulations by allowing them more than two years, the current limit of discontinuance to return to operation this, and so this is everything we have about the proposed changes, and so now, I'm just going to talk a little bit about the timeline.\nI work on a lot of land use and planning items for the district, so I just wanted.\nI know, I talked to you about this earlier, but I just want to confirm when we're looking at this new section proposed section of the zoning resolution right this article six chapter five in the case of like a disaster happening in you know three years or something, and the city wants to propose a text amendment here into it, to provide for, like certain exemptions.\nWe will be kind of putting in in this framework kind of a list of things we know currently and have kind of researched through our kind of efforts with Hurricane Sandy and also the kind of Covid-19 research that is going on that we think will be able to you know kind of turn on in the case.\nWhat I'm pressing at is, you know when an emergency order, an executive order, happens right I like significantly change certain regulations or procedures in the community, district.\nYou know if you have the emergency order from the mayor, that's like establishing a disaster, and then on top of that this additional text amendment is invoked right to have like the longer term, flexibility.\nWill that come before the community board, because I think the question is just like.\nThe only reason I'm flagging this is that I think it actually, given that this is a formal text amendment and it most likely we get referred out to the community, more.\nBased on complaints that I've heard over the years when I've been working here, so the it has to do with this section, 6513, that's being proposed, which is discontinuance provisions right for certain uses that are non-compliant so currently like the way that process works, which I think some of you may be familiar, with.\nSo I just want to flag for board members that you know this would mean that, like the two-year clock that normally counts starts counting for, like a vacant former bar on a residential block, you know, would get an additional kind of two years of time to.\nI think you know easier for non-compliant use to go back into one of those spaces and more difficult to have that residential use revert back so that that's all I wanted to note.\nZoning regulations prohibit folks from either substantially improving a building or developing a building or just trying to make their building more flood resilient.\nSo what we mean by optional is that the zoning mechanisms are the optional ones, but for everything that's required to meet the flood resiliency standards.\nAnd I feel like I was in maybe somewhat better position than many people, because I do know a little bit about flood resiliency because of my day job that I had until very recently when I retired about a month ago.\nBut this is the level of architectural and zoning complexity that really I feel Un uncomfortable in taking a detailed position on, but I'd like to hear what other people.\nSo I think there were a couple components that I've talked to this board about during the outreach and before about the like the big ticket items that were concerning.\nIf their building is fully built out and they want to use that floor area.\nIt's not going to be more than what the zoning allows, though, because that area is now exempted that 30 feet is now exempted.\nSo I guess: do you have any thoughts on that on being able to build more in certain flood areas.\nObviously, I understand with a lot of the lots in the flood areas, they're like single or detached homes, but in our district.\nIt's a carrot to give developers to allow them or property owners to allow them to flood proof, because we know that that's a lot of times cost prohibitive, and so we want them to be able to recoup their costs by reallocating the floor area elsewhere or have the option to do.\nThis text amendment technically allows a building to build up to an additional 10,000 square feet of florist place in these flood zones.\nI think that the text that you're reading refers to Matt's kind of slide in the back that talks about allowing BSA to modify any kind of zoning regulations to help buildings that have to comply with flood resistance and construction standards, but can't because of barriers that we could not foresee, because you know, there's a lot of special conditions, but that would have to go through the BSA.\nIf a developer says I'm going to use, you know whatever 5,000 square feet for temporary flood panels.\nWe were just responding to you, know, providing just something very small for them to at least have that on-site department of buildings we'll be looking at the applications.\nThe Cp3 district needs statement, because we actually want to see a more nursing home in our area and I, but.\nJust thinking about like a lot of the senior housings right, now, the people in just regular senior houses.\nOur research looked at all uses with the occupancy code that referred to nursing homes and adult facilities and psychiatric facilities, and we didn't see what these those other types of oops sorry you're, just asking: about, regular senior housing, right, yes, yeah, so senior housing.\nYou want to say so, I think that if people choose to build in the flood zone, they need to occur that cost.\nAnd I do agree with Mike that you know we should be very careful in incentivizing building in the flood zone.\nSo I really believe that you shouldn't try to use a permanent zoning text amendment because fundamentally, as we've, sadly experiencing right now with the pandemic.\nYou, know real estate development to be looking at flood zones in which they can sum up.\nI mean I, have huge concerns, because you know a lot in district 3.\nA lot of our flood zone is natural development and, as we you all know, NYCHA is said to have.\nI think with the Holmes Tower situation, so I believe that on one hand you know our community will need supportive, housing, senior, housing, nursing, homes, etc.\nThink, overall, you know enforcing the rules but making development where it really makes sense and not where it makes sense in terms of the market, how much money they can make from the Laksa development that will be attached to that, but how much it makes sense from a community resiliency and an environmental resiliency point of view, and I'm, not sure.\nThe as of right is just saying you have this amount of floor area and that's what's regulating the size of the building and what currently exists with how to a big site will generate a bigger building.\nOh, sorry, and just one more with the nursing homes just to clarify when we're saying that we're kind of banning or prohibiting that's, two new nursing homes, the existing nursing homes that are in the kind of one percent flood plain or in kind of you know, areas that we've designated they would still be able to be there.\nBut, like we said we're adding that 0.2 percent, because we want to provide this flexibility to those moderate risk areas, even though those are ones where the we may not.\nIf I understand this correctly, this is largely a proposal that is meant to incentivize a building owners and developers to engage in flood proofing without you know so that it wouldn't be so cost prohibitive.\nYou know a big enough issue to warrant and move the city to want to make such a change like this.\nIt's kind of this like multi-tiered approach, we're just talking about the buildings, there's a lot of other things that could be going on changes to infrastructure, to the coastal resiliency strategies and then just emergency preparedness, so making sure that folks know their evacuation plan that we're able to help out those who need to be evacuated first and things like that, we'll really just focus on the zoning here.\nSome of us kind of like that fact that there's not you know, people rushing sure, I, understand that too I think that's a different conversation, though so I'll try to answer this question, but those.\nThe committee first I would like to know: Do we want to take a position or not on this issue.\nAnd I see a couple committee members feel like they don't want to take a position.\nYou know, especially with the last comment with the marriage, I'm, almost thinking that we should have a position and be against so all right.\nThat's, just the courtesy that DCP is extending to the community board in terms of a deadline by which we should get in our comments, whether that be a resolution today or not, or you know whatever that might look like, but that we do that by the 28th right, yes.\nI'm wondering like what you know if DCP gets comments from 90 of the community boards, that they don't like certain pieces like what are the chances of things changing and how does that happen.\nThere's new square footage being potentially available at a height that was formally not allowed pending height limits, right, which are still which, if they exist, would still govern, but I, don't I would just I would caution that I, don't think it's generating enough additional floor area to like trigger any substantial development.\nYou know it would trigger maybe some modifications at existing buildings or in new buildings, but it alone it wouldn't generate enough floor area to like substantially.\nI mean it's still exempting square footage that is going towards that far so like, and that could go above right.\nAnd again I mean Matthew did say it does incentivize development in the flood, zone, which, for me, I guess just to answer.\nThe China town area and those things never come to anything, and this thing that actually doesn't even serve so much our you know, built environment in the flood zone is not creating an incentive for our vulnerable.\nI mean I, don't see a lot of people want to support this application.\nYou know, I thought that the concern is that to allow like one more floors for the building to I.\nI, don't I think we should be exempting floor area as a way to incentivize private developers to do coastal flood resiliency.\nWhat you just said: I just want to make sure the mind is denial deny unless you do this, you know, or they approve what conditions.\nI, think understanding and I think everyone has voted so far to just deny it without adding any changes or comments or except for me, I wanted to give the rationale.\nSo long as those comments are not conditions for do this and then because I don't think we have that kind of time to understand what could be the alternative options that could you know, result in a zoning change, that's beneficial to everyone right now or text.\nThink people brought up an important point that if you say no and don't outline, why you know what is the city getting from this."
        }
    }
}