{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB8",
            "channelId": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "title": "Land Use Committee Meeting",
            "publishDate": "2020-12-10",
            "shortDescription": "",
            "lengthSeconds": "3:14:40"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB8",
            "normalizedName": "Manhattan Community Board 8",
            "twitterName": "Community Board 8 M",
            "youtubeChannelName": "Community Board 8 Manhattan",
            "youtubeChannelURL": "https://www.youtube.com/channel/UClmnjGkAszTIah2X0x7pv_w",
            "twitterHandle": "@CB8M",
            "hashtags": null,
            "dateCheckLast": "11/28/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "g1gcT-cVsWM",
            "fillerWordCount": {
                "uh": 458,
                "um": 431
            },
            "readTimeFullTranscript": "113 min read",
            "readTimeSummary": "17 min read",
            "wordCountFullTranscript": {
                "building": 136,
                "buildings": 100,
                "flood": 97,
                "space": 78,
                "resiliency": 59,
                "floor": 56,
                "text": 53,
                "zoning": 40,
                "code": 35,
                "proposal": 32
            },
            "wordCountSummary": {
                "building": 46,
                "flood": 38,
                "buildings": 29,
                "resiliency": 26,
                "space": 26,
                "floor": 24,
                "text": 13,
                "code": 11,
                "mechanicals": 11,
                "zoning": 10
            },
            "fullTranscript": "Foreign me, okay, will tell me when it's a good time to oh, we have a lot of people already they jumped on. So is now a good time, or should we just check to make sure we have quorum, but actually Rebecca Dengor? Is that what you're about to tell us you went away faster than I? Could ask don't meet you? We're super close I think some people just joined, so we were at 22 last time, I checked, give it another minute or two yeah. You can give it a minute. Okay, I mean you can also start. You know explaining the zoom meeting protocol if you'd like okay, why don't we do that? Then? Okay, so welcome everyone to community board eight's land use meeting for December. This is a committee meeting, even though it is, the committee comprises the full board and it will run like a committee meeting not like the full board meeting. So in other words, we have a number of applications, each application the applicant will present it. Then there will be a public discussion on that application, only and then board discussion and then a vote on that application and we'll do that one by one at the end of the meeting, I'll be talking a little bit about the scoping meeting coming up next week on the blood center, but there won't be an opportunity for discussion about that. It will just be my comments and then we'll have committee reports from the housing committee and from street life. If we have time so, the public won't have the opportunity to comment on anything other than what is presented before it today in terms of procedure. It's the same as every other committee meeting and the full board meetings. If you click on the participants button at the bottom of your screen, which right now has the number 54 next to it, you'll see a list of people attending the meeting at the bottom of that list is a little virtual hand. That says raise hand if you click on that you'll be pushed to the top of the pile and you'll be able to comment so we'll see your hands in order and then I will call on you in the order in which you raise your hands, am I missing anything. Will we have a quorum now? Thank you, Rebecca. That was great. Thank you. Rebecca and I just want to mention before we get started with the substance of the meeting. That CBA is planning a memorial program for those who we have laws to Covid-19 in all of these months. Since the pandemic came upon us in March that is December 17th next Thursday at 4 pm. Anyone from the board that would like to comment is absolutely invited to anyone from the board or from the public who would like to have a name read of a lost family member loved one friend. We will do that too. We'll also be preparing a written document and the meeting will be the program will be recorded and it will be available if you're unable to we have a number of different religious organizations on the Upper East side in Roosevelt Island. Who will be participating in that if you have a special relationship with another church, I'm still reaching out to churches, synagogues mosques, any other organic religious organizations, if you have a relationship- and you would like to invite them to join by all means, please do so thanks very much, and should we begin I think so number one is the presentation by the Department of City planning on its zoning for cloak. Excuse me: zoning for coastal flood resiliency, who is here on behalf of DCP Scott Williamson, hey Scott, welcome back thanks for coming. Okay, Scott. Is there anybody else who will be joining you or? Oh, you, muted yourself, again, Scott hi. Can you hear me yes now we can sorry, I'm just having some trouble here with my zoom I see you now too right. Okay, thank you for having us back again. I think my colleague Oscar is on the line. As well, I believe she'll mainly be in the background, but she may be involved in answering some questions later so will, if it comes to that, please unmute her later sorry, I'm just trying to I'm struggling to see zoom here anyhow, I'm sure you can see me and hear me so I'll deal with that. So there we go sorry about that. Trying to share my screen right now. We've all had trouble with zoom, though no worries I just ended up in a place. I've never been before. I mean I've used zoom a lot over the last six months, but this is new, so I mean I, hope, you're, seeing my screen now, yes, great okay. So again, thanks for having us at the land use committee meeting this month, my name is Scott Williamson, I'm the team leader for the east side of Manhattan, so I mean some of you may have seen this project to the parks and the waterfront committee, which happened on October, 12th and I mean thank you for those of you who are engaged in that discussion constructively. This project is a very complex one, so I mean we're not strangers to that. We'll definitely try the best. We can to answer all of your questions and if we can't, we will chase them up as quickly as we possibly can but effectively. What zoning for coastal resiliency is updates to the zoning resolutions Article six chapter four and some other related sections and the presentation that I'm about to run through is it's a brief overview of what is, as I said, a very detailed text, amendment that it improves on the existing flood text and seeks to make it permanent. So we've tried to focus primarily on the provisions that are applicable to CB8 here in this presentation. But since this text has a city-wide application and the board is being asked to comment on the totality of that text, this presentation might show some building types. Perhaps that are not typical of Manhattan or CB8, but I mean I. Want you to know, the concept is still very relevant. So if you want to know any more information after we're done here about the proposal, you can take a look at the full details of the project which are on community board. Eight's website and they've been referred to the community board for that purpose. They're also on city planning's website and I'll stay for questions after and as I said, any that I can't cover I'll follow up with in writing. Probably through will. So what we're asking for is your recommendations on this proposal. Official recommendations from all community boards borough boards and borough presidents are requested by December 28 28th of this year. Okay, I guess we're not doing full screen, but I mean I hope you can still see. So, while there are many sources of flooding that pose issues in New, York City coastal storms present the most significant flood risk in terms of compromising human safety, property damage and business disruption with 520 miles of Coastline New York is very much a coastal city. When we're analyzing the city's coastal risk, we tend to focus on the area that FEMA has designated as the high-risk flood zone and the high-risk flood zone is the one percent chance area of being flooded every year and those are the darker colors that you can see on the maps in front of you. There, however, in 2012, Hurricane Sandy awakened us to a more widespread risk of inundation, which happened well beyond the 1 flood risk area close to half of the properties that are technically classified as being at moderate risk of flooding or having a 0.2 chance of flooding were inundated during that sandy storm event. In the two areas, combined, almost a million New Yorkers live and are at risk of being flooded by a coastal storm for Community board. Eight that translates to about 7,200 residents in the high risk zone and 10,600 residents in the moderate risk zone and with climate change ongoing, the floodplain will continue to expand by the 2050s. What is today considered the moderate risk flood zone will likely be high risk for flooding. So we have to look to the future when we're planning for resiliency. For this reason, so I also want to point out that, while this map is zoomed into Manhattan for the purpose of this presentation, this is a city-wide text amendment and the city's floodplain is hugely diverse. So this is a breakdown of buildings within the floodplain in community board. Eight many of those buildings would greatly benefit from the option to retrofit resiliency measures made available by this text and in order to understand how exactly this text promotes resistant resilient buildings, you must first understand the New York City, Building Code, but I mean to give you a summary of what you can see on the screen there. If it's a little small I know it is online, but I'm not I'm having trouble trying to make that big. For you, I'm sorry effectively. In the high risk zone, there is 178 buildings in Community, Board Aids. You know the vast majority of those are multi-family buildings. There's a lot of mixed use buildings in there as well and commercial buildings too. There's also some institutional community facility type uses. In the lesser, the moderate risk chance which this project is proposing to apply provisions to there are 264 buildings and the majority of those or the multi-family buildings make up 113 of those buildings and similarly there's a lot of mixed use in institutional commercial type development in those as well. So what I have here on at the bottom of the slide is a link to the New York City Flood hazard mapper, which is easily googleable, and if you want to dive into the details of all that stuff, it is available for everyone to see. So please take a look at that if it particularly interests you to know more so I mean the point of this slide is just to show that the neighborhoods within the flood plain, have very unique challenges to staying safe and this text amendment has to try and accommodate for those varying neighborhoods, and you can see the real extent of the challenge there. So the wide range of challenges that come with flood risk adaptation require a strategy that involves multiple lines of defense and the city's work includes coastal defense strategies like the East Coast Eastside coastal resiliency project, which many of you might be familiar with. The work also includes protection of our inland infrastructure like drainage and transit, and advanced emergency preparedness and I want to emphasize that this text amendment is just one of the many lines of defense and focuses specifically on improving resiliency in the city's building stock. It works in conjunction with other resiliency efforts to protect the city from future flood events. So the holistic you know, flood resiliency program of the city is called one NYC and what you can see at the bottom. There is the different parts that go into that buildings. Being you know, a small part of that and the zoning resolution being an even smaller part of what can be used to assist with that, but infrastructure and coastal strategies and things fall into a different category within one NYC, and that is all overseen by the mayor's Office of coastal resiliency. So before we move on from this slide, I wanted to take the opportunity to address a question in particular that came up at the parks and Waterfront committee in October, and that was well. There were several questions, were you know what about the FDR? What about hospitals and the esplanade and NYCHA buildings? Why are these not being addressed within this proposal and I mean one NYC, obviously encapsulates all of those things, but there is a certain scope that this text amendment has that can be. You know, digested within a single project. Infrastructure in particular, falls within different strategies within that. So when we are talking about hospitals and the Esplanade in particular those fall into a different category that are protected in different ways. This project, in particular, seeks to reduce zoning impediments to making resiliency improvements in private buildings and campuses like NYCHA, so NYCHA very much is relevant to this NYCHA and HPD have their own programs for how they implement resiliency upgrades. But the zoning I guess streamlining here that is trying to happen is aimed at NYCHA as well being the beneficiary of that and much of the text was developed in consultation with NYCHA, and it is intended to facilitate resiliency improvements in the long term for those communities as well as private property. So I hope that answers the question that I am sure a lot of you have from this as we go through further. So here is the technical stuff. The regulations based on FEMA standards for buildings in the flood zone are located in Appendix G of the New York City Building Code, and that's a large basis for which a lot of this text amendment is formulated because buildings are currently if they're, new or being substantially improved, are subject to the building code and they have resiliency requirements in the building code. So what the amendments to the zoning resolution within this project are trying to do is making those a little easier to access for people that want to make their buildings flood resilient according to the building code or at least take steps to try and get there. So the building code is a very firm requirement on how new buildings need to be built within the flood plain and the zoning resolution or the changes that are being proposed within this text. Amendment are trying to. You know, make that a little easier, because it is very difficult for owners to be able to accommodate that so I mean in short, Zcfr, which is I mean that the project is zoning for coastal flood resiliency. If I keep referring to it as Zcfr, the Zcfr would make permanent the temporary zoning rules adopted post Sandy to help buildings meet flood resistant construction requirements in Appendix g of the building code and we'll go into the detail of that. But I mean that's a high level. You know objective, so there's a lot going on here, and you know this is one of the building code requirements. One of the particular difficult ones and they're, based on the building's location within a flood zone, so the example you're looking at, is presumed to be within the flood zone and the building code has I guess an acronym called DFE, which is called design. Flood elevation, which can be seen here in the blue, dotted line and the DFE is the height that flood waters could be expected to rise, plus additional freeboard or additional elevation for protection. So for residential buildings. All living spaces must be located at or above the DFE. According to the building code, any space below must be wet, floodproofed, meaning it is designed to allow water to flow in and out those wet. Floodproof spaces may only be used for parking storage or access. You can't have living spaces below the DFE if you are upgrading your buildings to be a resilient building. According to the building code, these buildings again, these buildings may not have any living spaces below ground, also so for non-residential or mixed-use buildings. They can be designed with the same wet flood proofing methods, but they also have the option to dry flood proof and locate. Some of these uses below the DFE and dry floodproofing means meeting specific design and material requirements so that water can not enter the building during a flood event. This strategy allows uses to be located close to the sidewalk level, but it can be very expensive, especially and especially challenging in locations with high water table and higher dfes. So I mean to summarize that dry flood proofing is permitted within the building code and in the example that you see on your right there effectively. What that owner would have to do is build a reverse, fishbowl or of a reverse swimming pool at the ground floor of their building, to make sure that, firstly, the structure was resilient enough to keep the load of water out, that things like glazing and sealing and everything were strong enough to keep water out and that use, could you know effectively be still safely. You know continued in that space, so that is a hugely expensive upgrade to do and I mean again, this is what this project is trying to promote. Is you know, encouraging owners to what to undertake those upgrades, but again very expensive to do so? These building code regulations became widely applicable soon after the storm soon after Sandy, but posed conflicts with the zoning resolution in three main areas rule. Firstly, rules that regulate where certain uses shall be located. Secondly, bulk regulations that govern the size and the shape of buildings and finally, how resilient buildings interface with the public realm. So the proposed text builds on the two previous zoning text, amendments of 2013 and 2015 that were put in place shortly after Hurricane Sandy, and it removes barriers within the zoning resolution that make it hard for new and existing buildings in the flood plain to meet the building code requirements for flood resilient construction. Ultimately, zoning for coastal flood resiliency seeks to help those living and working in the flood plain to reduce damage from future coastal storms be resilient in the long term by accounting for future risks from climate change, potentially help save on flood insurance costs, and it would also assist with disaster recovery by setting a framework for emergency situations, including the present situation with the curved 19 pandemic. So the two text amendments that the city adopted Post Sandy on an emergency basis, helped address these issues. However, these rules are about to expire and given they're about to expire. That is a large incentive for why this project is being done at the moment, and if these rules are not made permanent, it could hinder the protection of existing vulnerable buildings and disincentivize resiliency measures in new construction, making our neighborhoods less resilient. So through several years, we've conducted city-wide research about resiliency strategies of different building types and studied 10 neighborhoods that were severely impacted by the storm. From this work, we gathered insights from stakeholders and partner city agencies, which helped us uncover additional zoning barriers to resilient construction. We've briefed more than 3,000 stakeholders across all boroughs through different forms of outreach, such as presentations to elected officials, the technical community workshops and other types of public events. Our community workshops were key in identifying neighborhood priorities and individual needs. As a result of this extensive outreach, we have learned valuable lessons which helped inform the current project. You have in front of you, including certain older neighborhoods, that didn't match our current rules and did not get enough relief to make their buildings more resilient. Our streetscape regulations also had inconsistent and insufficient applicability, particularly in medium and high density districts such as those in Manhattan. Lastly, we realized that there are rules that need to be readily available quickly after a disaster strikes, and so this attacks this text amendment could be one way to get closer to the city's overall disaster preparedness. So these are among the many lessons learned there and since the flood text was initially introduced in 2013, there has been a lot of investigation into that. So I mean the previous everything we've been through up to now is the current circumstance, or you know what outreach is being done and things how we got to where we are now so I mean to underline a couple of those points. A lot of what you're seeing here and what is being proposed was initially introduced in 2013, updated in 2015, and some of it is about to expire, and the incentive for doing it now is to try and make it permanent and expand it to the 0.2 percent floodplain as well so I mean now I'll briefly go through what the proposal is to try and summarize it for you to describe how zoning for coastal flood resiliency addresses these issues while encouraging the city's buildings to be more resilient. So after the long process of studying the floodplain and engaging with so many stakeholders and the community on a wide set of issues, we were able to establish four overarching goals that help us move from sandy recovery to a larger, a longer-term resiliency strategy and the first one we'll talk about, and the best way to think about this project is that it's split up into the four columns that you're looking at now and that's how the rest of the presentation will be structured as well. So the first is that the floodplain community wants to be able to prepare buildings for flooding, even if they are not located in what FEMA currently determines to be the high risk flood zone and that's the 1. The second is that people want the option to raise living spaces higher than the current flood level that FEMA projects, because they have seen higher flood levels already and expects that risk to grow in the future, with sea levels rising and therefore the expected flood level in the event of a storm. Thirdly, residents and business owners want to be able to invest in resiliency incrementally so it's more affordable over time. They want options like moving their mechanical equipment to a higher elevation, without necessarily triggering a requirement to raise the fully fl or fully flood proof the structure. And lastly, we know that we need a way for the city to be nimbler in responding to future events that might require you'd, say rebuilding of homes or buildings or other forms of recovery. So now for each goal, we will present a set of strategies that help achieve them and go through a selection of regulations that are what we're proposing that are applicable in community Board Aids. So the first goal speaks to where the proposed text would apply. These regulations are optional and they're intended to help buildings undertake resiliency improvements, so zoning for coastal resiliency would expand the applicability of the current text to a broader set of buildings that are also exposed to flooding in the event of coastal storms. Any lot located within the high risk and that's one percent chance, flood plain or moderate risk a 0.2 chance floodplain would be allowed to use the proposed special options for resilient building design. So you can see what has been allowed on the left up until now is highlighted there in orange, and we will get into a smaller scale map if you're squinting, to see that in the coming slides and the expansion of that in what is proposed now into the one point. The 0.2 percent chance as well is shown on the right and again I will show you that right here. So this shows what that means for or that expansion in geography means for CB8. The lots here in yellow are where the rules already apply and have done so since at least 2013 and the lots in red are where these regulations are being expanded to and again this is, as it applies to community Board 8. You can see most of the red that is being added. There is towards the down towards 59th street along the coast, there's some areas within Roosevelt Island as well centrally, and then there's a larger area up towards the 90s and in east Harlem, where you can see, there's some red being added there as well, so on to the second goal, and it illustrates options that would be available only if the building fully meets or exceeds Appendix g of the building code, and these are split into five separate strategies and I'll focus on the first few for CB8. So, firstly, it more streamlined optional rules for how height is measured in the floodplain would allow buildings building owners to physically elevate habitable spaces and other building support features above expected, flood elevations, so that they're safe in the long term. Currently what you can see on the left in the left three buildings, the current 2013 flood text, it already allows a maximum height to be measured from the design, flood elevation or the DFE, and it allows extra height in situations where buildings are located in areas with certain high flood elevations. This extra height allows buildings to have a more useful ground floor and we learned that over time it helps with long-term resiliency. Today, building heights under the 2013 flood text can be bumped up, 9 feet, 10 feet or 12 feet, depending on the building's size in the zoning district, making it a highly complex framework and because its applicability depends upon the elevation level slight to slight topography. Changes can lead to inconsistent outcomes on the same street of a neighborhood. The proposal would make those height allowances more consistent and equitably distributed by allowing heights to be measured from a new reference plane that can be placed ten feet above grade in the one percent and up to five feet above grade in the zero 0.2% flood Prem, so I mean I want to pause on this one just for a second, because this is really the crux of I think the questions that came up in the Parks committee as well so I mean there's a perception, or there was an understanding in that committee meeting that this just allows a whole bunch of additional height to you know, developers that might be building within the floodplain and what this diagram here is seeking to clarify that in the existing circumstance, as in today, within the one percent floodplain, a developer can add 10 or 12 feet, depending on their zoning district circumstances already, and what the text is trying to do is streamline that so that in the one percent they can add up to 10 feet, and that means the building would be measured from the reference plane of 10 feet above the ground level, which is where the water would rise to, or just around that and the expansion is five feet within the zero 0.2% flood plain so I mean, as far as the increased height ability that this text introduces. It is at maximum ten feet and otherwise five feet in the 0.2, so I mean I'm sure we'll revisit this. When you have questions later, but I wanted to point that out as we go through it. So it's a basis for what you understand the coming slides to highlight also so this would require would also require that the floor level is placed at or above this reference plane to ensure that the additional building height is tied to actual resiliency improvements and to close any loophole for developers that might want to try and get additional height without making the building resilient. So there is a mechanism in there to make sure that resiliency is tied to any claim to the additional up to 10 feet in height, if that's, what's being sought by a developer, so to help promote safer buildings with good, long-term resilient design and good neighborhood streetscapes. The proposal would also conduct small changes to existing ground floor regulations. The proposal would allow existing floor area exemption for spaces that are wet floodproofed to apply to both existing and new buildings. Since these spaces, pursuant to the building code, can only be used for parking storage and building access. This allowance helps support buildings as they adapt to climate change. So the example you're looking at here is obviously a building within the flood plain. You can see the blue dotted line. There outlines the water likely water level and that they have placed an access within that because access is allowed within the floodplain at that level, because that's one of the only uses that can be wet floodproofed in that instance. So the current rules also allow floor area exemptions for spaces that are dry floodproofed to promote active uses at street level. However, there are two sets of rules on your left. You can see a provision that applies to existing buildings and it applies today which could exempt the entire dry floodproofed space from floor area calculations. That is on the right. You can see a rule that applies to new and existing buildings, which allowed any space to be exempted from floor area if more than half of the floor area is being is below the flood level, and we call these spaces sellers. This rule was first implemented in 1989, and then it was edited in the 2013 flood text, amendment to be even more flexible and the problem we found with the seller exemption system is that it allowed full floors to be entirely exempted without actually requiring the building to comply with resiliency standards and that created a loophole, and the current project is trying to fix that. It also encouraged squished ground floors with low ceilings, as you can see on the right there and sunken ground floors which are extremely vulnerable to flooding. Ultimately, these two exemptions ended up promoting buildings that were out of scale and ground floors that were less marketable and effective for active uses. So again, I want to reiterate that this concept has been in place, for you know, since 1989 was critiqued in 2013 and again is being improved upon within the current proposal. So the proposal would modify these regulations to reduce the amount of floor area that can actually be exempted to instead allow only the first 30 feet of a space that is dry flood proofed to be exempted from floor area, provided that the space is used for non-residential uses complies with certain standards and requirements such as minimum transparency or window requirements and internal clearance. This would help encourage active uses close to the sidewalk level to promote a safe and lively pedestrian environment, while making sure that the resulting buildings are not out of scale. So again, the Florida exemption has been I, think something that was a point of question last time and I think I have a Q&A next on that. So one of the questions that came out of that is, why does dry floodproofing allow for so much more height, since it's not even providing a residence and I mean, as I had alluded to earlier, dry flood proofing is extremely expensive and by allowing a portion of the floor area that has been dry flood proof to be relocated within the lot, as in the floor area would be put somewhere else within the building, because a portion would be exempted from their calculations. We are incentivizing dry floodproofing, while keeping the streetscape active, so I mean the alternative for buildings that are upgrading within the flood zone is wet flood proofing, and that would result in a use that would be the parking, storage or accesses of access fronting the street, and none of those are active. So in many circumstances none of those uses are desirable in activating the streetscape, and that's all that the building code would allow if we didn't, encourage them to try and dry floodproof, so I mean the key takeaway there is that the difference between what exists today is a reduction in the current proposal. In terms of the floor area exemption that the text would allow, so this is proposed and it's limited to 30 percent sorry 30 feet of the street wall, whereas this existing provision, it was allowing up to the full floor of what was being dry flood proofed to be exempted so again regarding building height, which is part of what the question goes to there. The text amendment permits again up to a maximum of 10 additional fees in the high chance or the one percent chance area and up to five feet in the 0.2 chance area. So another question came up at the waterfront and Parks Committee, or the parks and Waterfront Committee. I'm sorry about funding mechanisms and incentivizing people to actually do this and I think there was some skepticism as to what the incentive was actually going to be for people to do these improvements and I mean there's a number of different solutions as to how you can incentivize people, you know financially or through other means. The zoning resolution has a very narrow scope of what can actually be put into it, and that is limited to regulating use and bulk, and it does not, unfortunately, extend to being able to provide incentives immediately in the zoning resolution, so that is dealt with separately by the mayor's office of resiliency. Whoever sees numerous programs that relate to flood resiliency, but to the extent that the zoning resolution is able to encourage owners to dry flood proof ground floor areas, the floor area concessions that I was just describing are the extent to which the zoning resolution can actually do that. So, in addition, this proposal would mandate a set of streetscape requirements to improve the ground floor level, design of resilient buildings. Sorry just to touch on that a little further as well. I guess this really reflects you know a building that is obviously built to the building code. After the sandy improvements of Appendix G came in they've raised the ground floor there you can see, and the extent of access that dominates. The streetscape here is a reflection that all they're allowed to put in that area below the flood level. Is that they can put access there, so I mean it really raises the whole building and it really restricts where active users can be put and how they can be facilitated and integrated with the streetscape. So the third goal- and we are getting there- there's only four. The setup provisions located within this goal are what we call partial resiliency strategies and they will help building owners to undertake incremental steps towards resiliency without requiring the structure or the sites to fully meet Appendix G, which is cost prohibitive, and everything within goal. 2 again was things that were required to fully meet Appendix G goal. 3 is dealing with incremental steps to achieving resiliency within Appendix G, and this would be extremely helpful. We heard for older buildings, in particular in community board 8, to implement resiliency efforts, so we learned that raising mechanical equipment, often located below grade within sellers, is the first and most cost effective step to making buildings resilient. The proposal would continue to allow the relocation of equipment and enable more options for their placement above the flood level, and that would occur even on either on rooftops or in a separate structure, by considering this type of equipment as a permitted obstruction. So, as shown in the picture, this is particularly relevant for housing, campuses and I mean one of those in community board. 8 is Isaac houses and there's several of them on Roosevelt Island as well and I mean this was a recommendation that came out of the outreach process and coordination with NYCHA and HPD on their resiliency work too. A big portion of the floodplain contains businesses that offer either neighborhood services or a part of the larger industrial economy of the city. Many of these buildings can not be completely dry or elevated or dry floodproof, due to the cost or operational needs of the business. Many of these business owners would like to raise priority spaces and equipment out of harm's way, so they can minimize business disruption in case of a storm event. So getting back to another question from the Parks Committee, a question was asked about mechanical voids in buildings and I mean particularly what I just went through I think there was perhaps a perception that this was giving. You know the recent discussion of mechanical voids on opening up a potential another loophole where this project could potentially grant more mechanical exemption or mechanical space in general for developers and I mean the intent of this part of the text is that it allows flexibility in the location of mechanicals. The mechanical voids text was passed in 2019 and it limits the height of predominantly mechanical flaws in residential buildings, and I mean to be clear that this project does not change the mechanical voids text. That I mean is very fresh in our minds because it only happened last year, but has certainly been written with the intent that is not reopening any. You know ability for developers to exploit a similar type mechanical issue that we previously were dealing with. Okay, so the proposal would also enable different types of flood protection measures to be implemented, and this would include allowances for flood panels and landscaped berms to be considered permitted obstructions in open areas. It would also allow spacers used for storage of panels to be exempted from floor area to enable on-site storage and again, this is a cost-effective strategy that older buildings can implement, without necessarily going to the full expense of raising their levels or completely dry floodproofing and those sorts of measures. And, lastly, when looking at our waterfront sites, zoning generally does not allow waterfront yards or required visual corridors to be raised to account for flood risk, and this proposal would offer more flexibility for the grading of these sites and would facilitate resiliency measures such as soft shorelines, which is what the example here is showing where the landscaping is actually intended to flood, and you know, provides a level of protection in the process. So we're on to the final goal, and this one is different from what I've outlined prior to this, because this one applies to the whole of community board eight and the whole of the city. For that matter- and it is not just the one percent or the 0.2% flood plain- the rules of Gulf Law are city-wide so to go into part of this Sandy showed us how a storm's effects can go beyond the floodplain, especially regarding issues with our energy grid. The proposal will therefore allow power systems, including generators, solar energy systems, fuel batteries, fuel cells, batteries and other energy storage systems to be considered, permitted obstructions within open spaces across all zoning districts to facilitate their installments. The text is subjecting this equipment to dimensional emplacement limitations such as maximum height, and you know, ground coverage and minimum distance from property lines, but it effectively means that you know power systems in particular could be placed within yards, and things like that subject to those placement heights and coverage type limitations. In addition to ensure all areas of the city can easily provide ADA access, the proposal would clarify would classify both ramps and lifts as permitted obstructions in all required open areas to facilitate accessible designs. So this slide I mean perhaps doesn't look like cb-8 at all, but the concept behind it is very relevant because this applies to vulnerable populations and specifically nursing homes, which I know there's a lot of in your district. Hurricane Sandy and other storms across the nation have exposed the difficulties facing nursing home residents in high risk areas for flooding, nursing homes are licensed to house populations that require continual medical care, and research shows that the dependency can be strained when nursing homes, shelter in place or evacuate prior to a coastal storm. Therefore, the city believes that it would be appropriate to limit the growth of nursing homes in high-risk areas, to lessen the health consequences and the logistical challenges of evacuating the residents of these facilities. The proposal would prohibit the development of new nursing homes within the one percent flood plain and other selected geographies to likely to have limited vehicular access during a storm events. Existing facilities would still be able to conduct enlargements for modest improvements, including those that help with resiliency, so I mean just to get ahead of a question that may come up there. This is proposing within the high risk zone, to not allow new nursing homes to locate, so the existing ones can continue. They can even make improvements if they needed to, but they could not do significant expansions and you could not build a new nursing home within the one percent flood plain and that's based upon the sheer vulnerability of this use and the people that occupy this use. So, lastly, Sandy showed us that a lengthy process to update zoning regulations can slow disaster response. The proposal would make certain recovery provisions available to be enabled quickly following future disasters, and some of these provisions would be implemented now to help address the curved 19 pandemic and its associated economic effects. So currently immediately following a disaster. The mayor can issue emergency orders to temporarily remove obstacles to facilitate recovery efforts, but that process is limited to the duration of the disaster, which may not be enough time to address regulation that may hinder long-term recovery. This proposal would include a series of disaster recovery provisions that could be made available through a text amendment when a disaster occurs. Applicable recovery provisions would be selected based on the issues caused by the disaster and would be available for a limited time period, which would be set at the time of the text amendment. The provisions could be limited to designated recovery areas based on the disasters impacts and the city's recovery plans. The set of provisions that could be made available are drawn from lessons learned from Sandy, as well as the current pandemic. Examples or rules in this menu include modifications to damage and destruction thresholds to allow the reconstruction of non-complying buildings and non-conforming uses and rules that allow uses in zoning districts where they are not typically permitted on a temporary basis. While these options would be included in the zoning resolution text, they would not all be enabled as part of this action. So considering the situation we're going through right now with Covid-19. The proposal would include enabling two sets of rules to help support more predictable, long-term recovery efforts and the first one would be to give property owners who hold special permits and authorizations an additional term so that they can complete their original plan of construction on a perhaps a longer timeline. The second one would support businesses that do not conform with zoning use regulations by allowing them more than two years, which is the current limit of discontinuance to return to operation. So, in terms of next steps, the citywide text amendment has been referred out on October 19 of this year to all 59 community boards by presidents and borough boards for 60 days. Then it will go to the Cpc and the City Council for adoption. More information about the project, as I had mentioned earlier, is including an annotated and an annotated version of the proposed zoning text can be found on Dcp's website and the community boards website as well. So thank you for the time, for you know allowing us to present this and happy to try and take any questions that you might have. Okay. Thank you very much Scott and thank you for making the presentation much more, not only Manhattan-Centric but Cba-focused I think it really helps us understand the or see better the implications so I see we have. Let me just first ask: are there any members of the public who have any questions on this I see several board members have raised their hands and I have a few questions, but I'll wait to see if anyone from the board asks them. First, okay, I see one member of the Public Wendy Mccaber and yeah Wendy will would you and meet Wendy, please yeah Wendy there you go. Thank you so much. Thank you so much for coming back, I'm a member of the public I've lived in this area. My entire life and I really appreciate how much effort went into presenting visuals and explanations that made it more relevant to our area. I had a couple of questions, one is and I'll ask them quickly, because I know my time will be limited. What is being lost in the streamlining process? I mean what are you? What are we putting aside in terms of streamlining? You also mentioned that there were 10 neighborhoods that were severely affected, that you studied to formulate this grand plan. What, specifically, are those 10 neighborhoods severely affected? The third issue really is goes to the heart of what you were saying about the height grab. It's. It really needs to be recognized in actual resiliency. These are wonderful remedies. Many of these are wonderful remediation measures. Moving mechanicals using resilient materials, making sure that new construction is compliant is incredibly important, trying to help older structures to also become flood proof, looking at all kinds of solutions of pumps and of other solutions and relocating living space. All very important, but one of the major problems in New York City, is that 67 to 75 percent of our climate change pollution, which causes these floods in this rising sea level, is caused by building height and we're not even talking about super tolls. So by adding a floor here and a floor there and 10 feet here and 10 feet, there, you're actually causing the problem that this commission is trying to prevent. So I am I'm worried about that. In addition, the reason that we have these regulatory reviews you're calling them regulatory obstructions but in fact they're there to protect us so that we don't have some runaway idea and oops while the floors are built. Well, you know the pilings are in well now. They're grandfathered in this is a problem that voters are tired of hearing about, and you know we see many promises that are made by all kinds of builders, I hate to make them the villains, because we definitely need them and I like them in inappropriate development and a new construction. But we don't see that there would be continuing oversight, there wouldn't be enforcement, and so these are the points that I wanted to address. But I had the earlier questions and I know that my time is limited, so I will yield back. So a lot of points I mean all good points as well, and I mean if you feel that those need to be reflected in your resolution, I think that's probably the you know the feedback we're looking for via the public review process. You know, obviously in generating or coming up with policy like this. It is, ultimately, you know a balance of you know. How can we make this viable, but also you know, as sympathetic as possible and to you know, actually encourage people to implement resiliency, and you know if we haven't found the right balance. I mean that's. What we're here for to you know, try and get your feedback on where you think that is so. Let me know how we're best to push that forward before my mic is cut off. Just let me say that, where that balance is for me is definitely move the mechanicals create whatever city incentive, but the incentive is not to build any higher than they are already permitted to build. In fact, in our area we're particularly sensitive to overbuilding, there was a long hearing about this last night on a different contextual matter, but you know involving a health care facility, something that you know ostensibly is good for the public in theory, but we definitely don't want extra height here, and so that's something I hope you will take back. That's not an acceptable solution, that's not an incentive. It has not worked in any of the other contexts of affordable housing or senior facilities and about senior facilities. I just want to jump in there. It's really important that senior facilities be integrated into a community where people live to have them far away from Fenty Wendy. Thank you now you can say, but let's just keep your comments as streamlined as possible. Yes, I, just as a personal matter, I took care of my two elderly parents. They from time to time, had to go into nursing home care for rehabilitation. It was essential that I'd be able to live close to them. I think that that's, if you can make these buildings resilient and there's new construction, then why would there be a problem putting nursing homes into these areas if you truly can make them resilient? If you can't, we have a different engineering problem. I will stop and thank you Alita and thank you Scott. So much for coming back Scott did you want to answer any of that before we move on to the next person? I don't know if I captured, all of it but again, like all points that I think we're, probably looking for as part of the public review process, so I mean whatever you see fit to include in your feedback to the department, and that is all relevant stuff to for us to hear. Okay, then seeing that there's, no one else from the public, let's turn to the board: Marco Europe Margaret Emily. Okay, can you hear me now? Yes, okay, I can't show my discontent on this coastal Florida brazilian city-wide tax amendment, because it's strategy is extremely weak, leaving our community unprotected and exposed to the flooding conditions in the future. While this proposal covers very well those low-income communities for our community, there is very weak solution which is using some protection planes or panels in front of the buildings, according with FEMA maps on the waterfront and in our community, specifically in our community, the float elevation is 11 feet. So now we have to talk about 11 feet in our community, which will be potentially eroding the Fbi Front Buildings 62nd Street 78 79th street, and the Natchez developments are not at 92nd street through 96th street. The floating elevation on those buildings will be approximately six to seven feet high, and this proposal is expected to contain the flooding with some floor plan panels as if the water is going to stop in front of these plates or panels. Even though these panels work very well, which will not the water table, will rise and percolate from the bottom up inside of these buildings, and these panels become useless elements. In addition, as per appendicity allows two types of the solution, the dry solution, which is not allowed when the flood level is three feet high or less, which are now our case, and it is permitted to use these panels and there was solution which does not permit to use these panels so using these panels will be unlocked. Furthermore, DOV is required to have the design for the elevation that you mentioned, which is two or three feet higher than the six or two seven feet elevation mentioned above, and these panels will have to have a height approximately between eight to ten feet, high, which will be a very serious challenge at a very serious structural charge. In short, our community is no resilience protected with this problem. Thank you. I'm not sure. If I can respond to a lot of the technical detail in there, I'm not sure if I got the question, but I mean again, if you have, you know, particular concerns with how it interacts with d, obese design, flood elevation or Appendix G or Fema's flood maps, and you know for some reason. You think that you know the flood elevation is actually higher than what this is. You know trying to address. That's obviously, a level of technicality that I would have to check with our experts on this, but I mean I would encourage you to include that in your feedback to the department as part of the project. If that's the case, okay, I'm trying to use my phone okay, then we next have Rebecca, Lamorte and I, see will's. Already I've muted, you Rebecca go ahead! Thank you. Hi Scott I have a question about a part of the presentation that spoke about accessibility, I. Believe you mentioned that barriers rams wheelchair lifts count as barriers for this resiliency plan. Excuse me did I hear that correctly in terms of barriers, you mean they can keep water out. Yes, no! Okay! So are you still looking at the power point here? Yes, okay, let me get back to that. Is this one of the slides you're referring to yes? So now, all this is referring to is that those types of infrastructure like stairs or ramps- and things like that are providing access, can be considered to be a permitted obstruction. They're not intended to actually themselves keep flood water out only that they can be provided as a means of you know, accessing a building because say, for instance, in this picture here the floor level is obviously raised for reasons of resiliency. It's saying that you can put a stair here in instances that you might not otherwise be able to because of say front or other yard type elevate restrictions, not that they can specifically be used as flooding barriers. Okay, because I just said, concern that obviously a wheelchair lift, there's, you know mechanicals a part of that, and it's so difficult to get accessibility updates in so many areas of life and throughout the community, so then to have them damaged by a flood or other natural disaster. I worry about the expediency and would be interested to know if there's any a part of the plan that would address impact on any accessibility options that were affected through this I mean to the extent that I understand your question there. Anything that is provided, that is on a site that is proposing something that is being constructed within the flood level. So on the picture, you're looking at anything that presumably is below the level of the doors on the left would have to go through DOB, and they would be reviewing it to see if it is satisfactory as something that can be located within the flood plain, as in that element that is being built would have to be designed to flood. So anyone that is putting say a wheelchair, ramp and I think there may be one on the right. There would have to be designing the mechanical system associated with that to be above the flood level or be designing it to be dry. Flood, proofed and DOB would be responsible for ensuring. That is the case. To make sure that access is actually, you know, maintained throughout such an event. Did I understand your question there properly yeah. Thank you for the clarification I just I'm concerned that you know we fight so hard to get some of these updates for access and then, if we, you know, have any flood waters or any natural disasters that they'll be at the very back of the list to be replaced for funding. So I just want to be sure that we're prioritizing the needs of people with disabilities as a part of resiliency as well. Thank you thanks, Rebecca, okay will. Would you and mute Michelle Burnbaum, please Michelle. Are you ready, yeah? Thank you Scott. It was an excellent presentation. I have a couple of questions. You clarified that within the flood plain no new, her nursing homes would be permitted. You didn't say, hospitals is hospitals included in that group or hospital buildings, because that's difficult for evacuation as well agreed. However, they fall within a different category of the one NYC plan, so I'll just go back up to the slide that clarifies that. So this one here is really how the Ny1 NYC plan is separated out and what we're looking at here is the blue circle of buildings as opposed to infrastructure and from what I understand hospitals fall under infrastructure and a lot of them have their own resiliency plans, health and hospitals in particular, and New York's mean public health operator has their own resiliency plans and I think they've been separated into infrastructure. For that reason, good understood clarified because I know the last hurricane Nyu had a very serious problem with their mechanicals, which were in the basement. They've since been moved, so I wonder, but it is considered under another headache, the other. The last thing I'd ask you is, if you recall you had a slide with those big boxes that looked like they housed mechanicals and they are permitted to be on adjacent properties or other properties. Can you clarify that for me what those exactly are and, in my mind, if you recall, with the building of the Second Avenue Subway, when they were building the ventilation towers, there was a call to build the exterior so that they match the surrounding area and I wondered number one. A clarification of what those buildings are. This slide exactly is the one that you have up. That's what I'm talking about clarify what those are and then, if you would, if there could be any circumstance under which we can address the aesthetics, as we did with the towers with the you know, the steam towers with the Second Avenue Subway, so that they can be adjusted in exterior aesthetics in accordance with their surroundings. Those two points, thank you. So, on the second point for things, subway ventilation towers that that's similar to your hospital question would fall under infrastructure. So this text amendment isn't actually capturing anything like that, because it would be in that infrastructure category, so I mean the zoning resolution is limited in general as to how it can you know, regulate aesthetics. However, the good news at being included in the infrastructure category is that say the MTA was trying to build. You know a subway ventilation tower or something like that. They would be doing their own outreach process as part of that individual project, where you would be able to have input on those types of aesthetics, so I mean kind of a good thing that is not included in this. So much because aesthetics is not I, guess the strength of what the zoning resolution tries to regulate as part of its use and bulk mandate. So what does this building? Are these an additional area where you can put mechanicals? Is that what this is for? No, so this is say this is using the campus development type example. So you know say this is Isaac houses, for instance, and that is the mechanical that is required to you know power heat you know, do any mechanical things associated with the operation specifically of those buildings. So I do recall what part of what you had said there was that it could be located on adjacent property, and it absolutely can't it all has to be located within the boundary of the site within which it is serving all the text amendment is trying is allowing in flexibility is that you can put it within what would have previously been or what is still considered to be a yard space. So this example here is locating the mechanical in the middle of what you know presently could be open space, and that would be in the interest of locating them somewhere. That is not going to flood because they're in the flood plain, so the building that you're looking at there looks like it's firstly being raised, and it secondly looks like it's, you know been taken out of say the basement of those buildings, because the basement has been identified to be particularly vulnerable. So why would this choice be made as opposed to putting them on the roof? An economic test I would render this being a choice for the mechanicals. That would be an economic decision, I believe solely economic. Yes, in providing flexibility, it's trying to provide owners options to get mechanicals out of the most vulnerable parts of their site, and if that includes building a structure, you know within certain bounds, such as what you are looking at there or if it involves putting him on the roof, then those are both options that an owner could take up. Based upon what you know, the limitations of their property are so the owner himself or the city in this case would be the sole decision maker yeah on the presumption. This is, you know, say: Isaac houses and it's a nature campus then NYCHA would decide where they could best provide those mechanicals to make sure that they were resilient. Okay, thank you, Michelle Barbara Ryder will. Would you have me Barbara there you go Barbara you're on YouTube I have a couple of very quick questions because I didn't get it or I know that you said that the area goes from like the 90s down to 59th what about East West? So that's kind of a complex answer. There's parts of this project that apply to the whole of community board eight. So that's the first thing and that's the more disaster recovery type provisions within this, but the vast majority of what we talked about or what I, what I've talked about over the last hour or so is related to areas that are flood prone, and the map here shows on the left shows the one percent flood. That's my question: I saw the map and I couldn't quite tell yeah, so I mean that's the most scale. I can really get up on at the moment. What I would point you to, though, is on one of my earlier slides I had a link to the flood hazard, mapper and I mean I'll, provide this presentation to will as I did previously. If you follow the link right here, it will take you to the flood hazard mapper and it allows you to go down to the scale of you know a building scale. So, whilst I can't do that in the presentation here right now, it does allow you to do that for a particular building. It just didn't make sense to that scale in the presentation and then I know you answered this question and I didn't understand it for projects where the buildings are either empty or they raised a building but haven't built for 10 years or more than that. I'm thinking of that 86th street that goes over to 85th street properties. Are they grandfathered in or do they have to? If you know just because they raise the building doesn't mean that when they do build that they don't have to follow this, I'm a little confused by your question. I know. I'm sorry, I said I'm saying it. I said it's confused that there are buildings that are that they raise the bill, they knock the buildings down and then they don't build for years and years when they do start building. Are they grandfathered in to build? You know previous to this, or do they have to follow the current rules, right, I, think I, understand so say, for instance, yes, a developer has a vacant site and they may have you know a special permit from city planning to build something say, for instance, their permit was to expire in the middle of Covid-19 when there was a construction moratorium. The provisions that I think you're referring to there would allow them an extension when a disaster is declared to allow them an additional I believe it's two years to conduct their special permit, where it otherwise would have expired. Oh so, in other words, if somebody I'm thinking on huge property that has been vacant and partially knocked down, and so on do they. It has to be a minimum of 10 years. At this point, so you're saying that 10 years may not count they don't start from 10 years ago. I'm worried that some of these buildings, we have so many empty lots in our district and I'm worried that when they do start building that they won't adhere to the regulations. Yeah I agreed it's not ideal. To have vacant lots around I, don't know if the text will go so far to address that. So much because there's a variety of different reasons that owners can just sit on vacant property- and you know very few of them, I presume- will be related to resiliency. All this is really aiming to do, and you know it is it's acknowledging that if they do have a special permit, which has a term limit on it, that if that term limit happens during a disaster being declared, they can act, they can automatically be given an action. I know. Yeah I was thinking more of a broader thing, just other two quick comments. I know you mentioned metropolitan hospital I know they're, building a tremendous wall. Fema is paying for a tremendous wall and be a couple of year process. The questions have come up whether the wall really protects the community, it may protect the hospital, but is that considered good? What happens to the water? So the water goes to the wall and then what happens to it? Do they have to build drainage? Do you know anything about that? So it I mean the hospital would have its own plan for how that wall works, but I mean the incentive for them to build. Such a wall like that is to obviously make sure that their infrastructure is resilient. If something does happen and they're flooded, so I mean based upon the substantial investment, and you know sheer amount of engineering involved in creating a flood wall. I would be highly doubtful. They would be taking shortcuts. That would, you know, forget about flooding and things like that. These projects are, you know so highly engineered and so expensive. That I, would you know I, can only presume I, don't know about that. Question was asked and the answer wasn't given very well and I. Just one very quick comment: I know that Stanley Isaacs is building I, think it's a generator on their land rather than on top there's an example of a mechanical that was that's being built on their land, as opposed to part of the building. I. Think yeah, so I mean they can do that. Now, yes, and I just said text is just allowing them more options for where they can put it. So previously, they may have only been able to put it in a couple of different areas on their sites, whereas now this will open up more options for them. Quite an impressive looking build, you know, structure, that's coming! Thank you. Anyone else with any questions. Trisha you had your hand up, I, guess, you've taken it down. No okay, Lowell has his hand up and Trisha and Russell and Craig. Oh my. What am I missing I, don't see any of them on here anymore. So I'll go with. You will who's next, because I don't see anybody, Pam, Lowell, okay, Lowell, go ahead. Hi I just want to expand on one of the answers on why somebody would spend a lot of money in finding resiliency building a wall raising the mechanicals, it's insurance, flood insurance, having owned waterfront property in my life. I understand now that it's well it's once a you know. Few hundred a year is now thousands a year if you're not compliant and the lawsuits behind it. If you rent out a basement apartment that gets flooded. So that's a major factor on why a lot of buildings would be taken advantage of these zoning am I correct. Very much so, yes, I, think one of the earlier slides says you know. Insurance is one of the factors for which owners would pursue this. So you're, you are very correct. Yes, thank you for pointing that out. Thank you! That's it! Okay will I, don't know who's next, because I don't see anything Trisha and then Russell and then Craig hi, Patricia hi. I really want to thank you for coming back and for giving a more specific presentation to the community board. I think it was just stronger overall I have a question and I guess: I should say that I was I. Feel I felt very ready to give my full support to this, but I have a question about the mechanicals in open spaces, piece that Michelle Birnbaum was asking about. Could you go back to that slide? Yes, this one right here, yeah, so I guess my concern is that if I understand this correctly, that building owners, including NYCHA, could opt to put their mechanicals on structures that take up open space and ultimately have their because I think I've been seeing this at our at Isaacs and homes where they have they're taking up open space in order to put their mechanicals there and therefore, ultimately, taking away some of that open space or severely changing it, so that it's not actually open space anymore. It's more like covered space I, pretty strongly believe that open space and parks parklands serve a very specific resiliency purpose, so I'm I feel not great about supporting something that is ultimately encouraging. The taking up about open space in the name of another resiliency measure am I wrong in thinking that no I, don't think so. I think there's a very legitimate concern and I mean, as I had alluded to earlier. There is, you know certain trade-offs that are made, and you know, balances that are trying to be. You know found within you know allowing resiliency measures to be incorporated, and you know to a degree. I would agree with you that some of the ability to locate mechanical equipment in open spaces is to the detriment of that open space. Yes, also just to expand on what Scott was saying earlier, as well. The for mechanical, like one of the reasons like especially the collaboration that happened with NYCHA, that the one of the resulting concerns was that these a lot of these buildings are a lot older and they're. They did their foundations, can't handle mechanicals on the rooftops. So, even if they were to be relocated on the rooftops, it's not you know structurally possible to do that, which is why a lot of them opt to do these within the open spaces and within the open spaces. The regulations do provide for certain screening and location as well as size maximums. So it's not just that they could build an entire open space, but yeah there is that balance that needs to be struck, and you know welcome any comments on that. Why couldn't you guys? Could you in the zoning text Amendment mandate that if the owner was going to use open space, that owner would have to then create other open space to balance it back out, I think we weren't actually losing any of our open space to this I. Think like a lot of these, because these are existing sites and not new construction. There is the limitation on the lot so taking that into consideration, I, don't think it's because a lot again, a lot of these places are already built, and they can. They only have so much space to work with okay, I guess I'm having a real problem with that I. Just I'm I, I'm really struggling to think about voting in favor of something that allows the taking up of open space. I'm gonna think about it and maybe raise my hand again once I chew it over. Thank you again. It's definitely understandable and it's probably the feedback that our resiliency people are looking for on this, because we acknowledge it as a trade-off with open space and resiliency to be made here. Thank you. Next is Russell right, so I have three questions and for the first I just want to distinguish between new buildings and existing buildings, and so for new buildings. If the goal is for them to have these various resiliency features, it's not clear to me why the city wouldn't just mandate. Those I mean why not you know, do it, for example, through the building code or something along those lines, just say if you're building a new building in one of these. You know flood zones, including the expanded flood zone. It has to have these resiliency measures as opposed to doing it through these zoning incentives, which, as I understand it would be, you know, would be optional and why we're using like an incentive structure. So that's question one. If you can answer that one question: two I'll just I guess let me just ask all the questions and then you can take them question two: is it's not clear me how some of these changes are going to apply to existing buildings like apartment buildings in our district? So, for example, you know how is an apartment building going to raise its ground floor by 10 feet? How is you know an far exemption for panel storage going to apply to an existing building other than you know, potentially selling it I guess so, if you could just clarify which of the proposals would apply to existing buildings of the sort that we have in our district and how those would apply. That would be helpful and then the third question is there: a cap on the panel storage, far exemption because I know you would address mechanical voids and wanting to avoid those in the context of the mechanical component of it. But it seems to me that the far exemption for panel storage has the potential to also be a kind of similar loophole and who's to say how tall a panel storage closet is allowed to be and stuff like that. So I don't know if there's a cap on that or if that's going to be addressed in some other way. So those are my questions. Okay, so a couple of things there so the first one, if I quote the extent of the question is a new building should know that it's building in the flood plain and therefore it shouldn't need incentives if I understood it properly. The question is, you know: could this also be done through the building code? Is there a reason why the city's chosen to do it through a zoning incentive as opposed to through a mandate? No so I mean Appendix G, the building code exists and developers have to do it now. So you know if, in the instance, the building you're looking at there was being built today, they have to comply with Appendix G, which inquir you know requires them to elevate habitable spaces, elevate their ground floor or drive flood proof or wet floodproof. The example you're looking at has obviously been being built. You know in accordance with some of those requirements, because otherwise their ground floor would be much lower. So they've done that without any of the you know, incentives that we're covering in the text amendment here, which I mean are primarily aimed at trying to get owners who have an existing building within the flood plain to adapt, because I mean we certainly acknowledge that most owners won't have the ability to create a new building on their light. Now that you know there's different flood resiliency requirements, all of a sudden, so I think it's less aimed at the incentives at least are less aimed at circumstances like this, where there is a new building where they can start from scratch and elevate it and more at you know those buildings that need to adapt and they end up losing the space on their ground floor because now, all of a sudden, it's not habitable, because it's below that blue dotted line. So primarily how this you know, I think, would apply to new buildings like this is that it allows things like the access structures that you're looking at here and plant and equipment to be located in other spaces that otherwise might not be allowed. So, for instance, there's the access provision that says you can put access structures in the yard space. So in this instance here, if that hypothetically was a front yard previously, they may not have been able to have that ADA access there. The intention is to allow them to get up to the level that they need their ground floor to be at without having to you know, come up with some very odd or perhaps prohibitive, solution to being able to actually get ADA access in that so I mean I hope that answers the first part there that yeah in part, you were not you weren't clear on how some of these changes would occur and how some apartment buildings could upgrade so I mean. Are you suggesting that say a fully residential apartment building would have trouble at its ground floor level? You know reallocating space somewhere else. Well, sorry, as I understood that provision that was going to incentivize having an elevated ground floor in some way, so yes, it certainly would but I mean you know Appendix g of the building code. It doesn't really discriminate whether an existing use is at the ground floor or not so I mean again these the measures where we're putting in the zoning resolution here are largely optional, so certainly there's a lot of residential buildings that would have ground floor apartments, for instance, in the flood plain and according to Penxg today they would not be compliant with the building code because they have habitable spaces within the flood plain. So you know that the incentives that are trying to be put in here are trying to allow, for you know some instance where that floor area may be allocated somewhere else, because there's an acknowledgement that, via the new requirements of the building code for resiliency, that ground floor is effectively being lost, so I mean how likely that is in a you know, a very established, fully residential apartment building, I'm not entirely sure at the moment, but I mean a lot of the dry. Floodproofing provisions are speaking to when there's a commercial space on the ground floor, so I mean there's some complexity there, but I mean the appendix g of the building code. Just it says you can't have habitable spaces below the flood level, and that would be effectively you know triggered for a building when it comes in, for some substantial upgrade. Did that answer what you were trying to try to ask there I think so, but I mean it just sounds like the in the case of the answer about the 10 feet, elevation increase, it sounds like in the case of an apartment, building as a practical matter. You know what you're saying like it. Just you know, potentially wouldn't be applicable or just wouldn't be used. It would be very difficult for some buildings to use this. Yes, I think that's. This is one strategy to try to help people to adapt to the provisions of what the building code requires. It's certainly not comprehensive in every circumstance and would be you know feasible for everybody. I mean we're coming up with the solutions that we can, but yeah I mean I'm not sure how else we could be flood-proofing without ground floor apartments. It's not what the building code allows. So the second! Oh sorry. The third question was about the storage of the gates and I mean great question. I'm not actually sure what the answer to that is but understand your concern there that you know say, for instance, it could be taken excessively, as you know, perhaps too much mechanical space allocated to gate storage. What well first I want to check if Oscar knows the answer to that: no I, don't okay. So in that instance, what I would like to do because I mean I would like to know the answer to that myself. I'd love to return to that in writing through will, if that's possible, and he can communicate that to you, because I mean very relevant question all right. Thank you also. Thank you. Okay, we're I'm sorry just to add to the existing buildings thing a lot of what's in goal, three, which talks about incremental, incrementally making buildings more resilient are aimed to be for existing buildings. So, in the instances where they're limited by what is currently already built, they're able to you know, move the mechanical equipment or create sports space. It is like in spaces, make them permit obstructions and things like that. Okay, thank you. Okay, we're going to bypass people who've already raised their hands in favor of people who haven't yet had an opportunity to speak. Given that it's almost eight o'clock and we still have a lot ahead of us, okay, Adam and then Sandra and then Craig did you already go because you were earlier. I saw it. No, he had to stand up yeah okay, so he has his hands up again. So let's go to Craig and then we'll go to Adam and Sandra. Okay, sorry, Adam hi! Thank you! I'm sorry, I, my internet cut out so I missed the last two to three minutes, but I was actually hoping to put forward a resolution and a second to speak to it. Supporting the proposed text. Change, Craig, I, appreciate that and I know that people may be anxious, but this is a really big deal because it covers the entire city and there is a lot of detail and a lot of different opportunities or different ways in which this change would impact buildings in the CBA area. So if you don't mind, I'd like to just hear from Adam and Sandra and I have a few questions and then we'll come back to you well I guess. My question is: why can't I put forward a resolution now and it's on the floor and the debate continues? Oh okay, we could do that. I'm sorry I, have a headache and I appreciate that. Thank you. So go ahead. So I guess. If someone would like to second it, then I'd like to speak to it all right. If you have a second just use your reactions button at the bottom of the screen, so we could see who that is. Well, you can you have a gallery. Gale gave a thumbs up, Gilbert, okay, thank you Gail, so, okay, so Craig, all right, so I get in terms of community con impacts. I really think this is going to be quite minimal, but as Elita just alluded to this is a citywide text change proposal and it is going to be extremely impactful and because there aren't on a citywide basis and because there are literally hundreds of thousands of people that are going to be. Perhaps impacted by this, it is really critical and these changes can mean the difference between survival and extreme loss. I know this personally, so many of you have probably heard me talk about this, but I live at east and 90th street in a large residential building that is in the one percent flood zone, and we were flooded out during sandy, resulting in all my buildings residents being evacuated during the height of the storm, as the East River came crashing into our building's garage, knocking down a retaining wall, causing the boiler to explode and then forcing us out onto the streets literally and my family, we had to negotiate our way through heavy winds and downed trees down 89th street, to get to my brother-in-law, who, thankfully, will only live the block away? It was really one of the scariest experiences of my life and we were displaced for two weeks and only because of the incredible work of my building staff. Where were you able to get back that quickly? We didn't get our gas back for two months, so it was really impactful for us. So, as a result, I'm extremely sympathetic to the needs of the hundreds of thousands of people across the city who are also vulnerable and need to take actions to prevent themselves and to protect their themselves and their livelihoods. So I, I'm I hear the concerns that people have and I recognize that this plan isn't perfect and there are definitely compromises that have to be made like Trisha, I'm completely in agreement about what you're saying about the open space issue, but I think I side on the support of an imperfect but overall, really well thought out, plan that may result in some hopefully infrequent very infrequent, negative impacts that are hopefully outweighed by the tremendous good that this plan will achieve in helping people, especially those who live on really vulnerable waterfronts. Who need these types of actions to be implemented, to protect themselves, to be able to do that to have that real impact. Thank you, Craig, okay, let's go to Adam and then Andrea Adam will could you and meet him thanks so much it's funny. Craig just went before me. My experience is eerily similar to Craig's. We live on the corner of 78th in the East River and we are one of the only buildings to get fully flooded. Our building when you walk in you descend down, so the entire first floor is below the street grade. All apartments were completely wiped out in Sandy, so the issue now with our building is that they've reoccupied, there's tenants in there now, but my building is an individual landmark. So when you talk about changes that can be made to the building, it's not just in a historic district, it's an individual landmark. So there's going to have, there's got to be some offsets that or maybe LPC is going to have to permit changes, but is the idea of the zoning to essentially eliminate the ability for our owners to have the first floor occupied? No, the building code does that already and given that this, the provisions that are being put in the zoning resolution right now are optional. So I mean it's not compelling. Buildings such as yours to you know immediately evict. You know people that live on the ground floors and then have that ground floor adapted for another use, but it's providing an option and hopefully some incentive. Your situation is a little murkier because you are a landmark, but I mean it's trying to provide strategies where we have them to get people out with not living within what is a highly vulnerable flood zone, as you experienced I mean as to the landmarks piece of that I believe things would still need to go before. Lpc doesn't just grant waivers. You know, they're, not yeah, especially for individual landlords. I mean that's quite a corner of land use policy that your buildings in there of you know the need to adapt for resiliency, but also to adhere to the landmark requirements. Some ask us: you know anything about the process of what landmark buildings would have to go through under the text as in if they were trying to relocate, say equipment or floor area yeah. So this doesn't supersede any of the supervision that LPC has over these buildings or historic districts, so they would still have to go through. You know the approval process and make sure whatever is proposed is okay with Lpcc, which it won't be, but that's, okay, yeah, I'm sorry! We don't have a better answer for you, though. That's a that's an extremely difficult situation and I mean it's certainly one that we want to look at, but I just I, don't think we have on a solution for that circumstance. Yeah, okay, open so I mean please incorporate anything. You have into your resolution, okay, what they've heard or what they plan. Thank you Adam. It's Andrea, Hi greetings! Thank you for the presentation. I am a resident of Isaac houses, which is a NYCHA property. We are having two generators being built due to the ramifications of hurricane Sandy. Due to this construction, my building has lost power for over 12 hours. One day recently, an electrical room has been built on one of the ground floors of Isaac houses. Actually, my building, which is a great concern to residents and myself. We are still experiencing elevator outages almost daily since the construction, work of generators and the electric room as well. Should the residents and I be concerned with this electrical room being placed on the premises of our ground floor, especially knowing what we have learned historically since Hurricane Sandy in 2012? That's my question. So I'm certainly sympathetic of the situation you have there. It certainly doesn't sound. You know tolerable in any way, I guess the complexity. There is what the text is trying to achieve here and what NYCHA has to actually do within its own remit, so I mean the extent to what I can talk to. That is the text part of it and I mean if I understood correctly, you're concerned that the ground floor would be used for a mechanical purpose. Is that correct? It's an actual electrical room that is built. They are already working out of it. They actually broke the bricks. There's a room on our on the ground floor, there's no apartments there, but they actually erected a loan, which is a very concern and we still are having elevator outages daily. Pretty much yeah so I mean NYCHA would have to have a plan for how that can be done, because, if they're installing an elevator room at ground floor level in the flood print plane electrical excuse me, electrical rail yeah I mean at minimum. It would have to be dry floodproof because the building code would not allow them to put mechanicals down that low. So you know, I would have to presume that they're required to adhere to the same conditions that any private owner is where you couldn't actually put mechanicals or electrical in harm's way, without having some offsetting action such as dry floodproofing, but I mean again I. Don't know that the circumstances are exactly there. I'm sorry, okay, thank you! I'll, look into it, I'm on it. Thank you thanks Andrea Peggy. Where would you want me? Peggy I just want to say I'm very much in favor of Craig's resolution with just one caveat, which is I'm not in favor of putting power systems in yards or other open space areas. As we all know, CB8 has among the least park and open space of any community in all of New York City. We should really take care of the open space that we have. So I'm wondering if there's anything we can add to the resolution that expresses our concern about the use of our prized open space for power systems and mechanicals. Is there something we can say in that resolution that expresses our long-standing concern at cv8 about our open space? Would you want to consider two resolutions, one for everything, but putting mechanicals or other systems into open space so that we can look at both of those separately? That's fine with me just so long as there is that concern expressed, because CBA has long been on the record as having an open space initiative to try to expand the open space in our community rather than shrink it. So whatever everybody wants, but it's very important I think to make that mention. Okay, well, we can hear from I know Michelle and Trisha. You have already asked questions, but I'd like I have a couple, and then we could go back to you if I haven't covered yours already. I must be missing something Scott this. There are already the provisions in the building code. That mandate resiliency measures is that right? Yes, that's correct, so this is to help owners financially. Basically, it sounds like be able to do their mitigation or their resiliency methodology, while not really losing money and there's even something about the cost it I had made. A note I think that it's an acknowledgment that the requirements of the building code to become actually resilient are extremely cumbersome and expensive. So I, wouldn't so much say that it's an effort to make sure that they can't lose money, but more so a circumstance where you know I think we're trying to incentivize owners that may otherwise do nothing and retain a building that is not resilient. It's trying to incentivize them towards perhaps actually doing something about it, so I mean circumstances like Adam race just earlier. Where I mean they have apartments in the flood plain and we're using the tools that we have to try and make sure that people are actually responsive to that, because yes, it's in the building code, but I mean until any you know, substantial upgrade is made that building doesn't have to comply with that part of the building code specifically, and those people at least that are on the lower floors, are going to keep living within a high-risk flood zone. So I would say the incentive is more directed at. You know, trying to change that circumstances that circumstance and acknowledging that the ability to do that is quite cumbersome rather than strictly I mean categorizing it as we don't want earners to lose money. So I have some concerns, one because we know how developers respond to anything where there may be a loophole, because you worked on the mechanical voids loopholes and we've seen other instances, plenty of instances of loopholes being exploited. So I'm wondering if the language in this is tight enough to prevent that. The other thing is: doesn't insurance incentivize owners to make their buildings resilient, because if they don't aren't there insurance issues for them? Yes, certainly I mean if the more resiliency provisions they include within their building I. Think that if I understand it properly that the less insurance they're able to pay, particularly if they become fully compliant with Appendix G, the exact incentive that provides I think we are acknowledging within the text is not sufficient, for you know people to be taking action, so this is trying to provide extra incentive. In that sense, the first part of your question there I missed I'm sorry Alita I. Don't even remember at this point. I'm sorry I, just I have a slew of them I, it's just about insurance that not only if they comply do they have to pay less insurance, but it may be that if they don't comply, they're not covered by their insurance policy, maybe their policies mandate requirement with the most recent building codes for resiliency if they're in a flood zone. So it feels like there's some kind of giveaway here, but I can't really put my finger on it, because I'm not knowledgeable enough about this. I'm also wondering- and maybe I'm just missing the boat entirely on this- is making buildings resilient. Does that affect any rent issues with rent regulation or the ability to evict tenants if they're now spending a lot of money or upgrading to comply with the building codes, great question and I mean I think that issue has been explored a lot with you know: people making just general upgrades to their building, but I mean at least my understanding is that if you're a rent-controlled tenant making upgrades be it you know, resiliency related or otherwise doesn't give you the ability to suddenly revoke that rent controlled status, but I mean, if that's a particular concern of the board, then I mean certainly something that is suitable to be put in your resolution. If you would like that and similar to you know the other question, I'm we're happy to follow that up, but I really suspect that you know making these upgrades does not get you out of you know some rent regulation from an owner's perspective as to the insurance. Certainly that's right, no you're not finished yet so you go ahead, yeah as to the insurance, I'm not sure if you know say a building that is in the floodplain and continues to be non-compliant with Appendix G of the building code, whether it pays more insurance or just can not be insured. I don't know. I would have to follow that up. Unless ask perhaps knows the answer to that. As far as I know any like dude, like from federal law, any building in the floodplain has to have flood insurance and I, don't think it's tied directly to resilient building or not, but we can confirm that there may be other types of insurance as well. I'm certainly no expert in that and I'm no expert in any of the rent and housing issues, but as a board, we're very concerned about affordable housing and the loss of rent, regulated apartments, and there has been a considerable amount. So I just don't understand, really the intersection between the building codes and compliance and ability to or desire to do work and changes in impossible rent. I'm almost done so they can use the basement or whatever you call it if it's wet floodproof for parking which may be of extreme financial benefit, not extreme, but financial benefit to owners and the same thing with storage and access. Maybe they take storage out of a store that they're using or renting to and putting it in the basement. So it just again. It feels as though they're benefiting in some way, maybe not the anticipated way, but that for certain things that the city, because their changes in zoning may be paying a price, I'm not sure again, I, don't know. I'm just raising questions. I also have real concerns about putting mechanicals in open space, whether it's open space in a NYCHA campus, or whether it's open space, someplace else or whether it's a backyard in a landmark area like around East End Avenue, and that would apply as well for people to put mechanicals in storage spaces in a backyard in a landmark building where there are in a landmark or historic district where there are requirements. And I'm sorry if I sound, argumentative I do have a headache, and that affects me a little bit so I think your points are very valid and are ones that I mean. We would certainly welcome as part of the public review process, and if we can clarify those, we will I mean your reference to a landmark building or a building in a historic district. I think we covered a little earlier with the LPC process, which this text doesn't try and supersede. So that would still need to be considered. Is my understanding and, as for the basement, being used for parking or storage, I mean really that's. One of you know a very few amount of uses that could actually be used for a space that was in the floodplain previously. So you mean I mean say those apartments that were vulnerable to flooding on the ground floor of a building were relocated elsewhere, there's a little else that space could actually be used for if it's not parking or storage or access, and that's the that's pretty much the three things that can be used for that can be put into a wet floodproofed space. So I mean it's really just using the space that was there for something. It doesn't introduce a parking allowance that perhaps wasn't there previously. Those are just being identified as the uses that can be accommodated below the flood level, because they are, they pose less risk to actual human life and I guess and I'll. Just sum up by saying people who buy in a flood plain understand what they're buying and especially I think as Russell, and if I'm misspeaking Russell I apologize, especially for new owners buying into a floodplain. They know what they're getting and here they're getting some other benefit. While we've seen on the Upper East side- and you know that, because we're looking for a height limit buildings that are very large buildings, that cast shadows, that cut off light in air that affect people in the way they live and yet there's nothing to help those people or businesses that are lost because their building is torn down for another building going up and so not to say that this is wrong because I understand what Craig is saying and what Adam is saying, but that there's not a balanced approach to zoning and helping people that are impacted by what's going on around them and in the same way that coastal flooding is something that's not anticipated or not sought after by building owners. Neither is the impact on their properties by the rampant construction and it's not development, but it's development that may be inappropriate for a neighborhood, that's already so dense and congested, and yet there are not consequential benefits to other families and other businesses in that district. So I'll end with that and I see that we cause and Elaine and Chalk have not yet said anything. So, let's go to cause in that order, cause and Elaine in chalk. Will please cause thank you and thank you again, Scott for the presentation. Yeah, I'm not going to have any comments. I'll keep it brief. But to what extent have third parties been involved in formulating this plan insurance companies developers? Builders? Has anybody had any externals had any input in this plan? Hi there? Yes, certainly so I mean the earlier slides that I covered, I'm just trying to find them right now had covered a lot of what the outreach was about, and that was related. I mean rather than I. Think your suggestion, those insurance companies I think it's more. The technical side of things so I mean engineers and that type of portion of the industry is really what was part of the consultation there, as well as the I mean the broader community and elected officials. So sorry, I'm struggling to find this here we go so yeah I mean like at least this slide is talking about architect, workshops and civil associations, and things like that, but I mean I, couldn't speak to whether insurance companies were directly related, but I mean it's obviously a relevant area of expertise. That's the specialists that we have within the department would have to reach out to properly understand what they're zoning, for so I mean I would certainly assume that is the case, but I mean I, wasn't directly involved in them, so I couldn't confirm. Thank you. Scott cause is that okay, yeah, okay Elaine? Will you need to unmute her I? Did it femur? Is a voluntary insurance program you're only required to take the flood insurance and get it privately or through femur if you're eligible when you have a mortgage? So when we look in our area, it would be the buildings looking at flood insurance for the building and then individuals who may be renting or co-op condo owners seeking their own insurance. The issue is unders when Sandy happened, the basements and that's what I'm concerned with this whole proposal, that for many were parking garages all flooded in addition to the homes, towers, etc. But that's where the insurance comes in, so it's an individual decision, that's made mandated by whether you have a mortgage or not. If not, then you're going to have communities not covered and then there's the question: should the government meaning us as taxpayers, be covering locations that chose not to have coverage because they didn't have a mortgage? Thank you, okay. That was not that wasn't a question, but thank you. Okay, let's go then to chuck. Yes, I. Call the question on this on the resolution. I thought you were going to do that so before I go to Barry who's going to second, it no doubt I just want to I think this is a big deal, and you know I'd just like to ask if Michelle and Trisha and Craig could very quickly ask what they want to ask no you're saying no I can't do that. No, I'm calling the question, I'm not taking it back, it's enough already! Well, I would disagree with you, but it's not up to me and it's not up to you. We could take a vote on calling the question I'm entitled to call the question if it's second and then we'll vote on it fair enough. Okay, second, just use the just use your you didn't she seconded it, okay, all right! So then, let's vote, can you lower everyone's hands? Will I'm calling the question? Okay? If you want to take a vote on the resolution, then don't do anything if you don't want to do that yet, because you feel that there is more to be said than just raise your hand almost two hours, and this is a vote to call to question not on the resolution. Yes, okay, Michelle doesn't there doesn't seem to be alright, we don't need to go through them. Rebecca there aren't enough hands raised to object to where to chuck so I guess we'll go ahead and vote. If someone wants to. There is already a resolution. I don't know how expansive it is. Craig, if you want to you, made the resolution, if you want to have a second resolution on the issue of the open space that were raised by a number of people well in terms of the open space, I just have one quick question and that is for Scott. Well wait a second! If you're gonna wait hold on Craig, because if you're gonna do that, then we need to ask the other people who also had their hands right. Then I won't I, think we should keep it as is, and if something, if it doesn't get approved, then we can go beyond this, because I have a feeling that I. My understanding is that the open space issue is really it's a last resort. It's not meant to encourage people to take our to take any open space. It's really meant to be in used in a situation where it's either, where a building a property owner doesn't really have another option in terms of how they're going to be able to make the changes to harden their property and have to use that as opposed to looking to just put it in the middle of an open space. For the sake of doing it so I, don't I have to believe that that's the case and if that's the case, then I think we can just vote on the question on the resolution. As is I, don't know that we could actually say that that's either Ccp's intent or that that's how any owners would view it that it's both an intent to be a last resort or an intent by an owner to use it as a last resort. I, don't think we could make those assumptions, that's what they are assumptions. So I! Guess I'm a little stuck here. I know I see the expression on your face chuck because there were a number of people who did want to see it as a second as something as an exception, or something else other than the resolution so Barry. How about we vote on the resolution right now? If someone wants to put second resolution regarding the specifics of the open space question, then they can do that and well maybe we I know that there's a flurry of hands that have gone up. Maybe we could do it as two resolutions and if they both pass, then they both pass and if not we're, looking at something that people were concerned about anyway. I think we're in the position, though, because the question's been called of needing to vote on it I think, then we should vote on just ex on the plan is proposed and then we'll. If someone wants to add on a second resolution, then I think it would be in order to do that. If I understand Robert's rules unless Chuck, maybe you can help with this or Valerie. If Valerie is here, then we'll go back to you chuck. Look. Why don't? We follow the rules for a change. We called the question Craig just had to state his abortion and it's out of order to get into that kind of discussion. We have to vote on Craig's motion. If someone can't wants to offer something after that, they can offer it okay all right. So then, let's do that so Rebecca. Are you calling the role yeah, let's lower all the hands? Okay, please raise your hand if you'd like to vote, no abstain or not vote for cause Russell. No sorry, I'm not sure you heard me. Abstain, may abstain, Elita, no Sharon, no Peggy Elaine, no Ed abstain, sherry, no Marco, I know Trisha Fame, Jack Epstein your hand went back up yeah. I'm sorry I I'd like to put a substitute an additional motion on the floor. I'd like to call on DCP to re-examine the open space mechanicals on open space and ensure that is that mechanism or that method is only used when the building is not structurally sound to hold mechanicals on the roof or mandate that should mechanicals be put on open space that the that, therefore be another way to ensure that we don't that any neighborhood doesn't lose additional open space in the process. Is there a second? Can we get the first vote? Oh yeah, sorry go ahead, yeah 27! Yes, six, no, six! Abstentions! Okay, so that resolution carries so now. Let's look at Trisha's proposal for a second resolution: okay, Michelle yeah well I wanted to clarify something: it's not only that the mechanicals could be put in a separate open space, because the roof space couldn't support the mechanicals. If you remember the clarification, because I asked specifically cost was the big issue so that any landlord or any decision maker could decide to put it in a separate building on in whatever the open space is, it could conceivably end up being a playground because it was cheaper, and that is my very big concern here. The other thing is, if mechanicals say, can't go on the roof, because the roof doesn't support it and instead of putting it in open space, it could go in the get in the basement. Why can't one of those protective barrier walls protect the mechanicals if they're, not necessarily in the most resilient location? So you know this is a very complicated plan. The showing it was. They really did an excellent job, but they're always going to remain unanswered questions, but I really can't fully support putting in an open space and a building that looked like that. One talk about a visual blight open space could mean playground open space can be anything if you're, counting on a resilient on a resilience wall to protect hospitals and other locations. Why can't you count on a resilience? Walls to protect mechanicals on the lower level when it's unfeasible for them to go on the roof, but I don't want costs to be an issue, and that leads me to another question: is there any? Are there any opportunities for government loans for landlords or owners for this? Is there any kind of a program like that to offset cost and then, finally, my understanding is there's no real repercussion if nobody complies so am I wrong about that, it doesn't seem like the thing has any teeth anyway, but I'm not happy with all the decisions being based on cost, because then the community has to live with it forever because of a momentary decision about costs. So I'm not happy with it. Thank you. It didn't sound like there was a question for Scott in there, so let's just go to Elaine and then Marco and then Russell. No, I'm sorry, I didn't have my hand up. I must have done something wrong. Oh it's: okay, Marco Russell and then Anthony yeah, okay, the issue is next well. This proposal is just only for the buildings that face the waterfront is not England proposal. This is a different discussion when you start discussing about affordable housing. This is far away from affordable or great destabilization, housing, no rent control. This is outside. We have three or four specific lots. We have NYCHA on 92nd, along with 90 buildings or asphalt green in that area. We have a wall, Adam Hall Building, and we have the next building, which is a landmark too, and then we have always another building in 60 seconds, which you already resolved all the resolutions, all the discussion they should be. According with that situation, anything is speculative in that part. This is not the scope of work of this proposal. It has to be very strict of that one and two this is, there is a lot of discussion that they talk about FEMA. They talk about insurance, look the only institution that insurance this building is FEMA. Now there is a new building, the new insurance commercial buildings, but they are very tricky this country insurance, so they don't insurance as Pima does so we don't need to go over there. Our discussion should be specifically in those areas, the other buildings that are inland. This is not part of the proposal, it has to be very clear. So therefore, yes, I'm I would like to support foreign spaces, but the opening space is a mistake. It's already built, the open space of Nige is gone because they waste the millions of dollars that it might give to NYCHA right away. He put in the open space. If you want to protect the open space which isn't we don't have anymore, maybe in the landmark buildings, but the llama ability will be regulated with the lung, with the line of the unsorted Landmark Commission. So we are rising issues that is no relevant to these proposals and they raise issue about issues such as building code. That has nothing to do in this proposal. We have to be very specific, our discussion and we have to target this in order to reach a good level. My precision is in this case. We should never recommend the approval. Why? Because the issue is the other communities is good for the other community. My complaint is nothing for our community for a specifically lot. The other lot you have on a higher level and the area of the or the hospital they have a retention wall already built before anything like that and the everything is well done in that section. So what we have to discuss, something that is not relevant in this matter. Are you talking about accessibility, now, accessibility? There are other regulations in the building code that it has nothing to do in this part. Thank you, I. I'm not sure that I agree with you. Marco most of Roosevelt's island seems to be covered by this. It also is intended to apply to the buildings under the building code. But it's really not me to answer that. Rebecca Dangor I received an email from Barbara Chalky that she would like to vote, no, that she had raised her hand which I didn't see and that nobody saw so I, don't know what you'd like. But how to? Can you change that? If you need to see the email I, don't know what you need, we already emailed me and I emailed it to the secretaries. Oh okay, I didn't know it's now, 26 to 7 to 6. Okay, thank you. Okay, let's go to Russell and Anthony. Thank you. Marco you're welcome another question. Oh call the question you said yeah. Is there a second Tricia, a second okay, Rebecca seconds? Okay? Well, then, let's see would could you lower the hands, knowing that Anthony had his hand raised just in case and everyone who does not want to vote on this? What are we voting on? What is the oh on Michelle's, okay, Trisha? Okay, sorry, we're calling on the community board urges DCP to ensure that, in their new plan that the construction of or the placement of mechanicals over open space is only done in circumstances where it is structurally necessary to do so, and if the mechanicals must be placed on open space that the building owner be required to somehow contribute to the open space in their communities to ensure that there is no net loss of space to any community. Could I make a friendly amendment and say comparable, open space, sure, okay, so then all and so we're just voting on calling the question. Anyone opposed raise your hands, please chuck, you've got your hand raised. Is that what you want to do? Okay, so those opposed to calling the question we're about is Billy here or Anthony, okay and Anthony. Okay, so you guys work out who's, doing which role and go ahead. One of you guys yeah, is our process just that for calling the question since there's only two hands up that we're moving on to the actual vote. Yes, now we will, since you recognize that there are only two hands up: okay, so we're going to take a vote now on resolution. Trish is proposed. Raise your hand if you are voting, no, not voting for cause or abstaining all right chuck. No! Thank you! Lowell Barton! Oh you have to mute yourself. No thank you any other hands. Seeing none will tally the vote. Thank you well, Billy's doing that Scott and I'm so sorry again, names I'm really bad your colleague Scott Oscar. Thank you very much for coming and preparing a detailed CBA, focused presentation and for spending this much time with us this evening. Thank you guys have a great holiday. Thank you for your time. We acknowledge this is certainly detailed and complex. So thank you for devoting so much time to it and have a great holiday as well thanks. So much okay before you go Rebecca Dangor has our hands up. I, don't know if it's directed for you Rebecca I, just yeah. No thank you for your presentation. I just saw that Valerie rejoined. So if we had meet her and make sure she catch her vote for this yeah as long as she was here for most of the presentation or the questions and feels competent to vote Valerie. Okay, so did you vote so you're voting I was here during the vote? Yes, okay, because we looked for you at one point and you weren't. There I appreciate that I had a little Wi-fi problem, but I did hear it. Oh okay, I did hear Trisha read the resolution and I'm I participated in the vote. Just like everybody did you vote on the okay. Did you vote on the first resolution? Craig's resolution? No, were you here for that? No I was not after that. Okay, that's when we were looking for you, okay or when I was looking for you, okay, really quickly. Before we move on Wilma Johnson just sent me a message: Wilma I mean you. Would you star, sixth unmute and then explain your votes on both of those two resolutions? Wilma, it's star, six to unmute I just want to get it before we move on. I'm sorry! No, we should absolutely Wilma Johnson. Did she call you? Will a text so can she vote by text if she's having trouble with this I'll send her a response saying to just explain her vote? Okay and then you could read that into the recording, so we have it and for the secretaries for Rebecca and for Billy I will okay, all right so, while will is getting ready for that? Let's move on to the next item, which is a public hearing, BSA calendar for 173 East, 83rd Street bode New, York, City or NYC, formerly Bikram. If I'm mispronouncing it so I apologize yoga, it's an application to re-establish a previously approved physical culture establishment on the second floor of an existing excuse me existing building located in a C-19 zoning district is the applicant here. That would be Francis Angelino, yes, okay! So then, why don't? We begin Francis will, are you ready? Do you need to focus on getting something from Wilma? No, I'm okay, frank right or Princess Frank? Okay, thank you very much. I represent, as the chair said, Bodhi yoga, which is formerly Bikram yoga. This is to reestablish, in a sense, to renew the application, which was previously approved by both CBA and the border standards and appeals over 10 years ago. The application is essentially the same as what was previously approved for those board members who were here at that discussion. The only changes are that the name previously was Bikram Yogurt. The name is now Bodhi to give it more distinguishment because of the type of yogurt that they do, and the other change is that they previously were offering massage and massage is no longer offered it's only yoga classes. So, in all other aspects, this application is exactly the same as what was there previously for over 12 years and it's the same owners Donna Rubin and Jennifer Lobo the same. Who are the owners and operators the same basic schedule of classes from the morning 6 a.m? In the morning to 11 pm at night seven days a week and it's two classrooms of yoga instructions only on the second floor, which is an all-commercial floor of the building that they're located in so in all aspects. This is a renewal of what was previously approved and what has been in operation and parenthetically well received by its local community for the last dozen years, and we asked the board to support its renewal. Thank you. Is there any? Are there any comments or questions from the public? I don't see any so then, let's move to the board. Barry Elaine, Sherry Barry, move to appearance, move to prove the application as presented. Is there a second Anthony Sorry Anthony Cohn, oh Anthony? Okay, then, let's move to a vote, so call a question. Someone or would you weep? Okay, I call the question you can use the reaction button, Rebecca, Dengor, okay, please respond somewhere. Please raise your hand if you'd like to abstain, vote no or you're not voting for cause going once going twice, seeing no hands, everyone will be recorded as a yes vote. Thank you, Rebecca. Thank you Frank. Thank you. Very much okay! Thank you good night, happy holidays good night. Thank you good night. Thank you good night. Okay. The next one is public hearings on the BSA calendar for east for 243 East 59th street. It's a renewal application for an existing advertising sign mounted on an existing building located in the C28 zoning district. As the applicant here Todd. Well, you know yeah I don't have to there. He is all right good evening, everybody yeah! So as stated, this is an application to extend a term of the variance that permitted the reconstruction of an advertising sign. The subject site is East 59th street and second Avenue. Do you have any images anything to share on the screen so that we could follow along? Let me see if I can share it. Hang on I would say place this advertising signs on the side of a five-story building. That is the end of the Queensborough Bridge. Hang on a second, let's see the photos here, I'm not sure do I have the ability to share screen. Yes, you do you can hear me there. Do you see that the photos yeah scroll down? It's that sign right there and I'll scroll down to the next photos here. So this is the corner of 59th and 2nd at east 59th, Second Avenue, and it's this advertising sign this billboard, that's on the upper side of this building that faces the bridge and that's the building itself, so I'll go back. I think this is probably the best photo here, but, as stated, this is an application to extend the term of the variants. This is originally approved by the BSA in 1977 that allowed the reconstruction of what was an existing advertising sign. It has been back before the BSA on five different occasions to extend the term the most recent action was in October 2009 when it was extended for a term to expire, July, 19 2020. This application was filed before the expiration of term, but, as we all know, things have slowed down during 2020 and we're. Finally, before the board. Excuse me the BSA and I believe the first hearing is scheduled in January before the BSA. No changes at all are proposed to the location of the sign or the design of the sign. It is not an illuminated sign, but there are lights that are mounted just to shine on the sign that are directed away from all other uses in the area. I, don't know if you can see them up there, but they basically just point. They lean over and point down onto the side to provide a little bit of lighting, but it is not internally illuminated, as I said, we're proposing to extend the term of the variance historically, the BSA has granted 10-year terms most recently in the past, it's been 5 years or 15 years, we're seeking a 10-year term. However, if the BSA is open to a longer term, we would take that term. I'm happy to answer any other questions about the application. Okay, let me just pull up the list. Okay, we have one of the board members yeah. I'm here I got a message from Judy Schneider that she's using Barry, Schneider's computer, so I think. If you're looking for a person from the public, it would actually be Barry Schneider, which is actually Judy, oh okay, because last time it was Barry. So it's very confusing. Okay, since Judy is from the public, let's go to Judy, but not you Barry, just Judy hi there. This is my only comment and then I'll, let give Barry back his chair. The sign has been up for many years. The last time they came to Us members of the community who live here in this part of the East 60s came and no one had any objections and I have not heard any objections from the East 60s neighborhood members about this sign. So we are in support of this. We see no reason for him not to con I am in support of this and I think the association is it's gotten. No complaints see no reason for it not to continue in use, and now I am turning. My chair back to Barry. Not yet I mean yes, you can but Barry you gotta wait a minute. Elaine go ahead. I just want to know what is the sign? I can't see what it is it changes depending on who chooses to rent advertising space. Currently, it is for I, don't know how to pronounce it long guys, watches I, don't know if we've got a close-up photo here. Let me see if I can do it, but currently it's just a watch advertisement for the there you go, it will change depending on you know the leasing of the space, so in other words, this is a not permanent sign, but a rotating sign based on who rents out space. Exactly it's an advertising sign. Thank you. Okay, Rita motion to approve. Is there a second Russell? Okay, then someone want to call the question or do we want a discussion? Michelle yeah, I'm actually glad to be able to speak on this, because for all the years that sign has been there. I have really been bothered by it. I think it's a big visual blight on the side of that building and I will oppose the extension of the time that it can be there. Thank you. Elizabeth rose I'd like to understand what it is about. The sign that requires the variance. Is it simply that it is an advertising sign or is it the size of the advertising? Sign advertising signs in general are not allowed in this particular district. This sign in particular, was one that was grandfathered in. However, it exceeded the height and the double check here, just to double check exactly what was listed on the resolution yeah. We can't hear you when you're faced away check my notes there. The variance was originally granted permitting reconstruction of the sign that exceeded the height districts at the time it was originally installed which predated the current zoning resolution. So the variance is required because you are correct, adversizing signs aren't allowed as of right and this one was grandfathered in, but it did require the reconstruction, which is why the variance was granted original, as I said, that was in 1977, so the sign has been there, at least under the BSA purview for 43 years and even longer, I don't have the exact date but prior to 1961 before that. So it's clearly it's not a permanent sign. It is there's modern technology. It can change with fair amount of frequency. I would imagine effectively. Why should this sign be kind of permanently grandfathered, because that that's a that is the process that we are in well, I mean why shouldn't at some point the variance go away. The variance would go away if the sign were not used generally, the general principle with grandfathered uses under the zoning resolution, not just this sign, but you know all uses. Let's say you had a commercial use in a residential district. You are permitted pursuant to the resolution, to continue the use as long as there's no interruption the interruption time frame is a rule is two years. So if this sign were not to be used for two years, then the grandfather provision would be abandoned. But again that's I. Don't want to mix too much the idea of just a true grandfather sign. Since this is now under the Bsa's purview. It would be if the term were not renewed, I, believe I, don't know if they ever cited the two-year grant in any of the older resolutions. I, don't believe so, but the short of it is that for this sign to be removed now it would have to be expiration of the term and the property owner would not choose to seek to file for an extension of term okay. Thank you very helpful. Valerie. You skipped over Russell a couple of times. I, don't know if you would I know I thought his hand was up still from the from his motion to approve before right. So if you oh I, didn't see that okay, then my apologies wrestled, let's go and mute him. Please I'll call the question there, you go. Okay! Is there a second Chuck Warren? Okay, then, are there votes on calling the question? Anyone, let's take down hands. Okay! Is there anyone opposed to going straight to a vote? No okay! Rebecca! Are you doing this, though yeah? So, if you'd like to vote, no abstain or not vote for cause, please raise your hand, sherry, no Michelle, no Valerie, no Polita abstain, Elaine, no Marco! No thanks! Okay, while you're counting that up will I need to ask you what did Wilma vote on the previous resolutions on the DCP proposal. All right, we can try on muting her again Wilma Star six to unmute. If you want to explain your vote, I tried texting you back Wilma. If you can hit start, you should be voting if you're here at the meeting, but we don't know what you're voting. So you either need to unmute yourself or send. Will a text back please in the meantime Rebecca do you have a count? Almost maybe no pressure. We just have one question: Marco voted no correct Marco. Could you confirm? Okay? Yes, that's correct, no okay! So it's 35 to 4 to 1. Okay, thank you and Wilma. I see that you're still on the phone. You need to vote. If you're going to vote during this meeting and if you're not going to vote, you need to abstain or not vote for cause or something but you're here, you're present you. We need to have your vote so please either unmute yourself and explain your vote or send will a text that he could read into the recording and for the public and board hearing right now, please, okay, in the meantime, while Wilm is getting that done, let's go to the next public hearing on BSA calendar for Equinox fitness at 330, East 61St street. Excuse me street block 1345 lot, 16 and 37. It's an application to the board of standards and appeals to extend the term of a variance permitting a physical culture establishment in an existing five-story building at the subject site located in a c84 zoning district is the applicant here. I am here it's Todd Dale again! Ah there you are, you didn't leave okay, there you go! So, as you stated, this is an application to extend the term of a variance that was previously approved, allowing the operation of a physical culture establishment pce within an existing sub-seller seller and five-story commercial building. This building I'll flip to the photos. I, don't know if you want to share the screen, is the equinox that is located on a site that is between 61st and 60, or excuse me, East, 61st and 8th 60th street. Excuse me for interrupting, but do you have images that you want us to look at because we're not seeing anything except you if you're not familiar with the equinox I? Just let me see I can share hang on. Thank you there. It is. These. Are the photos? Okay, just to give you an idea for those who are familiar. This is the Equinox gym that is located on a through parcel between East, 60th and East 61st street between first and second avenue parcel is actually on two different zoning lots which I'll explore. Excuse me on two different tax: lots that comprise a single zoning lot, which I'll explain in a second, but in short, this is a grant that was originally issued by the BSA in 1976. The original variants allowed for the construction of this building, which is the main building where the equinox flags are. It allowed construction for a building that was encroached into a required rear yard and penetrated the sky exposure plane, and it was originally occupied by a tennis club. This was known as the vertical club for those who have been in the area for a long time and then later on in 1979, an application was excuse me in 1979 an application was granted to amend the resolution to permit changes to the layout. There was then a subsequent grant in 1995 to change interior layout again to remove some of the tennis courts or courts that were inside and add in just traditional gym activity space. There was also, then, a change in operator in 2011 to the sports club La and then, most recently, in 2014 by letter, the BSA approved a change in operator with no change to the interior layout. Changing the operator to Equinox is still the current operator and is proposed to be the continued operator. They've been the operator since 2014. There's no change at all proposed in the facility. The main building, which is the sub seller. Five-Story building, is occupied entirely by the equinox, except for a portion of the first floor, which has an eating and drinking establishment which is not part of this grant. That is now an as of right use in the area, the equinox also this building. That is next door. You can see here on the side where it says: Tss, fitness, the lowest level. There does have some office space that is occupied by equinox and there is a connection between the buildings there, there's no patron or gym activity area in there, that's associated with the equinox and the zoning loft for the building consists of these two lots, which are lot 16 and 37, which is the main building, and then this smaller building. That's next to it. As I said, the proposal is just to extend the term of the variance with respect to this pce use. Only equinox is the operator. They don't propose any changes at all in operation, obviously, under current circumstances, they're limited as to what they can do as far as operation it changes. Equinox is complying with all current Covid-19 and public health requirements, but long term. The goal is to, as I said, to continue the operation with the same hours of operation, which are Monday to Thursday from 6 a.m, to 6 P.M, Friday, 6, A.M to 8 P.M and Saturday, and Sunday 7 A.M to 7 p.m. There is an interior fire alarm and sprinkler system that are installed and there was a certificate of occupancy that was issued most recently in September 2016 for the building as a whole upon grant by the BSA. Should this extension of term application be granted, the co would be updated to reflect the new term. A term of 10 years is sought again. That is typical for a variance for a commercial use. The BSA is not required to only grant a 10-year term, but 10-year term is typical practice for the BSA to grant I'm happy to answer any questions about the history of the site or its operation. Are there any questions from the public before we go to the board? I, don't see any hands, so let's go to Michelle will and we did get both from Wilma, but we'll do that after this one so Michelle and then Russell yeah, so I. My understand there have been no complaints about this and they occupy the entire building. Did you say, except for a portion on the main floor, where there's the eating establishment, yeah I, think it's a steak, restaurant? Okay! No, but they go to the top floor. They okay, so I will support this. But my question for you is this: is that signage legal? This signage is the signage, as was approved by the BSA. This is a c8, I'm not sure if I said it, but it is a c84 district, which is very liberal with the amount of signage that's permitted. This signage, that's shown right here, is actually far less than could be placed on the building, but they're not proposing any changes, and this is similar to what was on the plans that were previously proven, but you're saying under the existing zoning that size is permitted, because I'm thinking that this bar here is only allowed like 14 inches out from the building I can't measure it, but it looks, it just looks overwhelming for the site. So I'm going to approve it because you know I want the business to continue and there's no reason for it not to but I know that we have. You know the DOB doesn't have many inspectors going out these days or even before the pandemic, to enforce signage rules and regulations, and so I'm just you know cognizant of that and I wonder just for in general information if you can get back to the board as to whether or not what the measurements of those signs are and whether or not they are actually legal. Well, I would say that, since they are reflected on the plans that were previously approved by the BSA, they are permitted because the BSA grant you know the BSA will generally only grant things that are you know, relief for I didn't think they dealt with the signage well how's it. We just had a sign case. They will deal with signage, but this signage is shown. I'm trying to see right now, if I can figure out what the well it's okay, because I don't want to take any committee. I would appreciate it if the board office could have that information. I will send you and I think sign regulations for the C8 district. In reference to these signs. Thank you, Todd, okay, Russell and then Adam motion to approve. Is there a second Adam? Are you seconding I see Rita? Oh I, had it I had a question: okay, Rita has okay Rita had her hand, wait: okay, yeah, so it's second yeah just to continue on my question. Okay, the as of about a year ago, this property is part of a larger zoning lot with four other three other tax lots in which air rights were transferred from one lot to the three other lots that are co-owned by vertical projects. What is the is there? A plan development that we should know about our office only represents equinox as the tenant, I'm not familiar with any adjacent development of any adjacent property, so I wouldn't want to misspeak or speculate as to that. I can state now that, as far as the subject building there are no plans at all to change the physical structure of the building or any of the interior light. Okay, Barbara Rudder will. Could you and me Barbara rudder just now there you go Barbara call the question. Second, can you use your reactions, will come Elizabeth Ashby has her virtual thumbs up? Okay. So, let's the question is called I'm assuming that there are no objections to it. So, let's just move to a vote. Okay, please raise your hand if you are voting, no, not voting for cause or abstaining all right, seeing no hands I'll tally the votes. Thank you. Thanks. Todd have a happy holiday, I'll, just interject, really quickly. I'll still send an email, but just so you know that in the C8 district you're allowed signage, that's six times the street frontage, so in this particular instance, they'd be allowed. I think approximately 750 square feet of signage for each of the uses. That's in there I'll get the measurements on those signs, but those three signs and the signs that are on the door definitely do not exceed 750 square feet of signage. Thank you. Okay, as you know, oh, let's just do Wilma's vote will. Could you read out the email from Wilma and for the secretaries just to give them an opportunity to go back to the correct way? They know that has their hand up to probably do that. Okay, Rebecca, the only change, was to item one, which was Craig's resolution. The final vote is now 25. Yes, eight, no and six abstentions. Okay, thank you. Valerie, you have your hand up. Go ahead. I wasn't able to ask this to Todd, while he was speaking about Adam asked the question about the three properties and the transfer of air rights. Can someone just explain to me if they know the answer to this? He pond was just asking for an extension of the use, but he didn't say that equinox was actually the tenant would be the tenant of record for the extension of use. So I'm a little does it the extension of use go whether equinox is the tenant or not. I'm just curious. Does anybody know the answer to that Elaine or Elizabeth you're, probably better equipped, if you know or Adam, if you know any of you guys raise your hand if you know the answer to Valerie's question Adam I think it runs with the occupant, which is why they come before us every time. There's a change in operator in order to assign the expected, but there's no change in operator. Equinox has been operating it since 2014 so well. The variances are on a clock, they're 10-year variances, and you have to go for extensions every time right. So is it the operator then or is it the building? So if, let's just say three weeks from now, Equinox wasn't the operator they'd have to come before us and get another variance if they I believe if they were to assign it to a new operator? Yes, that the new operator would have to come before us for permission to have the variance assigned to them. Okay, then, why is that, then? Why is that a land use issue? Does that land? It's how the let's let Elaine or Anthony answer that question because they traditionally come to us on physical culture establishments. I know, there's a history. They've explained it before, but Elaine go ahead. I'm sorry, Adam did I step on yourself, I understand it was because massage parlors weren't supposed to be operated within the district and because of the way the law was written. They were shoehorned into that, but, okay, if that's, that makes it land use, I thought it might be, then a zoning issue and not a land use issue because of the variance Elaine. It is a zoning issue, but for some reason it's put on the land use. Historically, our board has a land use committee that no other community board in Manhattan has, but it goes with when the operator changes they come back for approval to continue in the site. Adam was absolutely correct. That's how it's done and it's almost automatic, but it it's you've raised an important question Valerie about it, and it makes no sense why it's a land use. It's only due to our why laws and how we're different than all the other community boards in Manhattan all right. Thank you. I misunderstood Valerie. Okay, as you know, on the blood center there's a scoping session next week on December 15th, there's been a certified Eas and a positive declaration. So what we need, and what I think is important, is for the board to submit commentary or testimony following the scoping session that could be included in the record and provided to DCP on this. So I would like to be able to present a written document written testimony to the full board at the meeting next week on this. With that goal in mind, I emailed all of the chairs of the various committees that seem to touch or might have questions based on this, so I'm asking I took notes. I mean I made notes to be able to do this right. So I asked all of the chairs to write something. If you have questions that could be answered, please send them by five o'clock on December 11 to get answers such as. Does this document? Does the Deas address shadows? That would be a sample question. So if you have questions that can be answered by looking at the documents- and you don't know what the answers are- email will by five o'clock on Friday we're going to send that for inclusion, we need it to be board approved. The public scoping session is the 15th, but written comments are accepted through December 31st and we want to submit those comments and I want to submit them from a unified board to have approval on everything. In addition, any board member any community organization, anyone individually may of course submit any kind of testimony or commentary, but we need comments on the scope of the Eas to be included in the document to be approved by the board, along with comments from an urban planner at the full board meeting will seek approval and that's why I need this information from the chairs of the various committees so I, for example, I sent to transportation, because the traffic issues, congestion and parking were raised by members of the community. Small business may want to give an opinion on the situation involving potential small businesses or what might happen to them. So there are lots of questions and lots of issues. You should send your questions or your comments to me and will you should submit those by Monday this coming Monday at 11, so they could be organized and put into a written document for board approval, along with the urban planner's comments for the dispersed discussion on Wednesday, we will also ask the public will be given the opportunity to make its comments at the scoping session and if they resonate with us and they'll, be included in the board's commentary or testimony as well. I see. There are some questions from board members, anything from the public, no okay, Craig, Rita Elaine. Sorry I would like to just respectfully request that we only submit things that aren't already going to be included in the scoping and in the Eas or the EIS. I should say the environmental assessment and from a transportation perspective, everything that was spoken about at the meeting is fair game and among the most critical and basic elements of any environmental assessment, that's going to be done for a project of this nature so or Ee Eas. So I guess my question: is there? We've spent a lot of hours in meetings recently. Many of us as members do we really need to do extra work, just to repeat things that are already included in there that are already mentioned in the documents. No, if they're, you said that and that's why you should read the documents, not you individually, but anyone who wants to give an opinion should certainly read the documents, if you don't have them we'll, send them out at least once possibly twice, maybe even more than that but they're at the top of his pile to send out. If you need to see them again, they're long, but the information that Craig is talking about is in there if they're, if it's in there to the end and answers the questions that you would like to have answered, then by all means, don't write anything and don't include anything. We don't know, excuse me, we don't need to be redundant. We don't need to be duplicative when it which in itself is a redundancy. So we only need to address things that aren't there or aren't there in the detail or with the new ones that we might want to see as a board. So don't make work for yourself, but if there are avenues or issues that have not been addressed or that you would like to see more information about, then we should be able to include that in testimony it's a long document both of those and it covers a lot of ground in a lot of different areas as we could see. If you look at it and in fact will just posted it in the chat, so look it over write what you can and we'll include it and I appreciate the chairs of the committees doing this work. We want to be thorough. We want to give everyone, the community, the blood center, the board a full opportunity to be able to discuss it and so that we understand the full scope and they understand what our concerns are and what we'd like to see and that's the best way to get all of these questions addressed. I think. Does that answer your comment, Craig yeah I, think so thank you, okay, Rita and then Elaine I, don't know if this belongs in there. But it appears to me that the community has not have has not had the time that the blood center had in order to present something cohesive at the scoping session. The community needs to have experts there and right now the community is not cohesive. Enough I think that they're, just being you know herded into this, if this doesn't belong, let me know if it does then I'll write something I'm going to ask Elaine to respond to you. Rita I do want to say, though, that we sent out letters requesting a postponement. We asked the elected officials to support us in seeking a postponement precisely for the reasons that we want to be sorrow, and it is, it encroaches upon the holidays that we're asked to provide all of the testimony and the commentary by December 31st. So, even though we're not traveling and we're not having big holiday parties, they are significant holidays, and so we want to be able to give this full attention so Elaine. Could you just respond to Rita's comment? Please, since you already have your hands up anyway, and then you could say what you'd like. Thank you. Yes, a reader and I won't repeat that we did ask for a postponement. We also asked the applicant to do it. I spoke to the lobbyists and asked them about it. They were to get back to me. The applicant does not communicate with us in any way last night at our major meeting on this. They did not come because they were busy too busy all of the team to prepare for the scoping session. So I agree with you as far as the time is not the best, but we will move forward because we again have an applicant who does not want to communicate to the community. Let me say from a zoning perspective, what we will ask is that the questions that have been raised and the challenges to doing this construction, that those questions all be answered by the applicant we've not been able to find any and I will go back with Elizabeth and review. There are a couple of things in there. I, don't think I've been straight forward as to even the gas container spot, but we will really examine it, but what we're asking is have them answer everything that has been raised and then we will respond after we see the report. It's a big challenge. This whole thing. Thank you, okay! Thank you all right. So that's what my request is to all of you guys and we'll be able to discuss it next week. So, let's move on to housing and the reason that housing is at the land youth meeting, even though it's not land use is because at the housing meeting there was a sense of urgency for the resolution that is before you right now and that's why we're doing it now, rather than waiting for an additional week so Ed and Barbara, if you would thanks Elita, so we'll be really quick. Oh can I just say one thing to start off with: yes, okay, why we? Why it's so critical that we do it now is because the may not thing we're doing, and everybody knows that there's been a federal in a state moratorium on evictions, but it's been on the state. One has been up by executive order and there's other tenant protections too all by executive order where we're asking and they don't have to go to Albany. To do this, they can do it. Virtual meeting we're asking and the present executive order on Evic moratoriums on evictions ends December 31st. If the governor does another one which he may then it still has a lot of loopholes. There are people who are getting eviction notices, even in our district and upstate and throughout the state, is not really all the protections that have to be put in there. So we want the state legislature to and I already spoke to, some of the legislators that spoke to Liz Krueger about it. We want them to have a meeting in December before they go back in January, which is the second or third week in January to p, to pass legislatively that the moratorium on evictions and also some other tenant protections. So the state law instead of just executive orders which people are being evicted now they're getting eviction, notices, there's a lot of loopholes. So that's what we wanted at this meeting. The resolution passed the housing committee 14 to zero, and we said we had a lot of participation and I think it's crucial that we get. We pass it today, so we can get going on it and get the legislature to meet virtually it's not going to be easy to get them to meet virtually. We want them to meet and finish the draft and finish the protections Ed. It's all yours, I have nothing to add to that Barbara, that's fantastic other than a gratuitous shout out to the zoning meeting last night for almost 200 people showing up great meeting but I have nothing to add to Barbara's summation. Anybody have any questions on the floor. Since the committee report the motions on the floor- okay, Michelle the minutes in the resolution, okay, then I'll call on Michelle yeah, I'm always concerned. I mean why this sounds fine, I'm always concerned when we're voting on legislation that we haven't seen or a project that we haven't seen it's a conceptual thing. So I would have to compare what the governor's executive order covered versus what legislation would cover yeah. Well, granted it's still being drafted. Well, that's why I moratorium? No evictions allowed that's the one Barbara! You made the statement that it has loopholes, the implication being that a bill would not all I'm saying is without knowing what it says. For me, it's difficult to vote on this, so I will abstain. Okay, no and you raise a valid point Michelle, and just so you know when we when Sam Stein, who had come from the community service society I think I sent the board members also the report he did we'll have something else on that next early next year we asked Sam because not much has happened. Okay, since July- and, let's put it in perspective, these executive orders, as we all know, are very temporary they last for a little while, then they have to be renewed. All of these things, the underlying authority for the executive orders, comes from the legislature, basically saying to the governor. You know the force was your all bets are off. You have whatever power you need and I. Think Sam's point was the loophole with these executive orders is that the deadlines come and go. People don't know what they are. People are falling through the cracks and even if they continue these executive orders at the end of this month, which I'm sure they'll do you still have hanging over all of this. The fact that if the governor declares the pandemic no longer an emergency, all the executive orders are no longer valid, so that was a part of the legislation. You are right. There is no specific bill. We had just asked if there's anything out there. One thing that Sam Stein had mentioned was this Topa, which I believe tenant opportunity. Protection Act. He had gone on to talk about some of these cities. Like Washington DC had a version of this that they've been doing for years again, not on the scale of New York, but it was one example of what they might be able to do. We just put it in there again, not knowing what the bill was. They didn't have a number. We were looking for. An assembly number I. Think Barbara, that's one of the reasons we reached out to Senator Krueger's office yeah. Well, she said it, but it's being worked on right now, but the big thing is the moratorium yeah that so that's how the bill came about anybody else. Who was wondering about the bill that that's how it got included and we didn't get into a whole lot. You know down in the weeds in terms of the minutes on that again, because it's evolving it's kind of complicated and it's also the urgency of it was you know we had this meeting right before Thanksgiving. As we all know it's the ninth. Now we were just trying to get Albany to do something to give people a little more certainty in their life. As you know, the holidays come and we move into the new year. That was all I hope that I don't know if that helps. But that's you know as much as you know, yeah. No, that's helpful. Knowing the history of it. Thank you, chuck I, see your hand is up or I should say Michelle. Are you done? I should ask you that yeah, okay, sorry yeah, chuck I want to call the question on the resolution. It's on the floor. Okay, any anybody, second, that Barry I, see your hands up, Elizabeth and Gail and I think a lot of seconds there on that: okay, Barry's hands down okay, so we'll looks like everybody's on for that all right. So we'll take a vote on that now. Yes, so one of the secretaries, whoever alternative who's abstain, not vote for cause or vote. No, please raise your hand now Michelle abstain, seeing no other hands. Everyone will be recorded as a yes vote. Thank you before I get muted, just a quick plug for Sam Stein's report at the css on the housing crisis very good stuff, and they have another report coming out at the beginning of next year. Anyway, I guess I'll see everybody next week, thanks Ted and Barbara. Thank you and Ed. Could you make sure either that you have the link or that will has a link to that report from Sam Stein in case anyone wants it available. Yeah I'll put it in the chat, yeah, absolutely okay! Thank you. Okay, so I know we've been here for a while street life should be pretty quick. I. Think, let's do that tonight, rather than waiting for next week, so is Abraham here Abraham is not here would because ran that meeting. So if cause feels comfortable, no I feel very uncomfortable at the moment, but not too uncomfortable to do this right, no it'll be quick. The whole lot were unanimous. So any questions, anybody calling the question Marco and Michelle have their hands up. I'm sorry Michelle! If you have any questions, but I'm calling the question. Thank you seconded by Carolina Tejeo, all in favor, no opposition. Let's call the roll okay. If you'd like to vote, no yeah I think everybody's going to vote. Yes very persuaded you gotta, wait pre-emptive if you'd like to vote, no abstain or not vote for cause. Please raise your hand seeing none. All the street life items passed unanimously. There were. There was one other new business which came up as a surprise. The green kitchen wanted support for us to apply to SLA to reinstate their license. I think everybody saw the photos, the videos, the everything that went on over summer and apparently they had several violations and they did lose their license. We have asked them to come back in January, but that you know that's not my decision. It's the chair and the co-chair. It was also interesting that they did lose, sadly lose their father to Covid-19 I, think it was in March and for them to act. The way they did in over the summer, I don't feel very personally I, don't feel very comfortable having them back, but that's up to the new chair and the co-chair and anybody else. Barbara, your Barbara Rada's got her hand. Well, you know: okay, I'm okay, now I will tell you I had a personal experience. I was the one it was mother's day and I went out. It was a gorgeous night. I went out for a walk around three o'clock or four o'clock, and this was at the height. You know where if you got sick, you know you were sharing ventilators with people and I passed the green kitchen. They had music blasting and they were hundreds of people and I. As will and Alita know, I was really upset. Since then I have to tell you I'm changing my feeling towards them. I did speak to Elios my favorite restaurant at high-end, at restaurant next door. That's very sympathetic to them. I said: aren't you bothered by them at this point they're one of the really pretty restaurants, they've done a wonderful job with their outdoors. It's perfectly safe and quiet. It's no longer that they were reacting to what was going on with their father and I. Think at this time I'm certainly ready to give them sympathy and excuse what went on and I hope. Others do too. These restaurants have had a tough time, both personally financially and they are a model. Restaurant at this point and I will say: I live on second avenue. It is one of the neighborhood restaurants that people love. I've been there for lunch and it's safe and pretty out there outdoors I don't go indoors, but their outdoors are pretty and I would ask for people to put aside and believe me, I mean just ask: will I was hysterical coming home, I was shaking coming home because I was so nervous about the number of people that were there and without masks and drinking, and so on. They really turned around the corner and I think we should have a little heart at this point. We're not going to be doing anything tonight. So I love that, as I said, that's up to the chair and the co-chair of the street life, whether they want to have them back in January, but they are willing to come back. I thought this was going to be short you're lying I just want to say that we are seeing a surge in cases. There are regulations for individuals on how we operate. There are regulations for restaurants, small businesses, etc. They knowingly knew what they were doing. They violated the regulations. We are seeing an increase in restaurants. Doing this, they have been given great opportunity to build outdoor dining, which I find more like indoor dining, because some of them even have doors on their little sheds, but I do not support any restaurant that violates the regulations that are in place from a public health safety perspective. Thanks I think Russell was next before Sharon Russell yeah I was just gonna suggest that additional comments about green kitchen just wait until the Street Life Committee next month. When it's, you know probably gonna be up, and everybody can talk about it then, and you know, there's no reason to go through it in front of everybody here now. Thank you, Russell I agree, and for that for the record we've sent them in bytes already they've already said. Yes, the they're going to flyer and everything which was the main reason why it was delayed at street life. Okay, that's the end of street life. Thanks. Will thanks Russell thanks. So later, no you're welcome before everyone goes. I just want to be sure. Sharon were you going to respond to anything about the green kitchen? Then you should wait or did you have a different comment? Oh I'm sorry, can you hear me I just wanted to I just wanted to ask Barbara. She thought that the green kitchen would have changed its ways on its own. Without their liquor license being revoked. Could we hold that spot Sharon and wait until January? Thank you, I want to thank you very much will. Could you just tell me because I know that there is an Hss committee meeting right or Hss Committee meeting the same night is the scoping. What time is the scoping to be clear? It's in the daytime, but always in the daytime? Okay, yeah, I think they're all at 2 pm, okay, so hope so and they'll want to leave before the meeting starts. I just didn't I wanted to be clear about a lack of conflict. Okay is there any old business Marco it's at 2 pm by the way and I. Thank you can I propose motion to adjourn. Hang on. You will as soon as I, make sure that there's no old business. Thank you. Marco I know everyone's eager to go. No all business any new business. Okay hit it Marco. Okay motion to adjourn any second Elaine, okay and Russell Great so and Sharon, terrific, okay, so we'll see you next week. Thank you have a great week and please for the people charged with it. Just look over the deas I appreciate it very much. Thank you Adam, I'm hoping that was a second, because did you want to say something at no? Okay, all right so then meeting is adjourned. Have a great weekend see you soon. Thank you very much will again an evening of hard work.",
            "summary": "But, since this text has a city-wide application and the board is being asked to comment on the totality of that text, This presentation might show some building types.\nI mean the point of this slide is just to show that the neighborhoods within the flood plain, have very unique challenges to staying safe and this text amendment has to try and accommodate for those varying neighborhoods, and you can see the real extent of the challenge.\nThe wide range of challenges that come with flood risk adaptation require a strategy that involves multiple lines of defense and the city's work includes coastal defense strategies like the East Coast Eastside coastal resiliency project, which many of you might be familiar.\nBeing, you know, a small part of that and the zoning resolution being an even smaller part of what can be used to assist with that, but infrastructure and coastal strategies and things fall into a different category within one NYC, and that is all overseen by the mayor's Office of coastal resiliency.\nThis project, in particular, seeks to reduce zoning impediments to making resiliency improvements in private buildings and campuses like NYCHA, so NYCHA very much is relevant to this NYCHA and HPD have their own programs for how they implement resiliency upgrades.\nThe zoning I guess streamlining here that is trying to happen is aimed at NYCHA as well being the beneficiary of that and much of the text was developed in consultation with NYCHA, and it is intended to facilitate resiliency improvements in the long term for those communities as well as private property.\nThe regulations based on FEMA standards for buildings in the flood zone are located in Appendix G of the New York City Building Code, and that's a large basis for which a lot of this text amendment is formulated because buildings are currently if they're, new or being substantially improved, are subject to the building code and they have resiliency requirements in the building code.\nWhat the amendments to the zoning resolution within this project are trying to do is making those a little easier to access for people that want to make their buildings flood resilient according to the building code, or at least take steps to try and get there.\nThe building code is a very firm requirement on how new buildings need to be built within the flood plain and the zoning resolution, or the changes that are being proposed within this text.\nYou're looking at, is presumed to be within the flood zone and the building code has I guess an acronym called DFE, which is called design.\nSome of these uses below the DFE and dry floodproofing means meeting specific design and material requirements so that water can not enter the building during a flood.\nSo I mean to summarize that dry flood proofing is permitted within the building code and in the example that you see on your right there, effectively.\nWhat that owner would have to do is build a reverse, fishbowl or of a reverse swimming pool at the ground floor of their building, to make sure that, firstly, The structure was resilient enough to keep the load of water out, that things like glazing and sealing and everything were strong enough to keep water out and that use, could, you know effectively be still safely.\nThese building code regulations became widely applicable soon after the storm soon after Sandy, but posed conflicts with the zoning resolution in three main areas: rule.\nThat is a large incentive for why this project is being done at the moment, And if these rules are not made permanent, it could hinder the protection of existing vulnerable buildings and disincentivize resiliency measures in new construction, making our neighborhoods less resilient.\nSo through several years, we've conducted city-wide research about resiliency strategies of different building types and studied 10 neighborhoods that were severely impacted by the storm.\nSo I mean now I'll briefly go through what the proposal is to try and summarize it for you to describe how zoning for coastal flood resiliency addresses these issues while encouraging the city's buildings to be more resilient.\nAfter the long process of studying the floodplain and engaging with so many stakeholders and the community on a wide set of issues, we were able to establish four overarching goals that help us move from sandy recovery to a larger, A longer-term resiliency strategy and the first one we'll talk about, and the best way to think about this project is that it's split up into the four columns that you're looking at now.\nThe first is that the floodplain community wants to be able to prepare buildings for flooding, even if they are not located in what FEMA currently determines to be.\nThe, second, is that people want the option to raise living spaces higher than the current flood level that FEMA projects, because they have seen higher flood levels already and expects that risk to grow in the future, with sea levels rising and therefore the expected flood level in the event of a storm.\nThey want options like moving their mechanical equipment to a higher elevation, without necessarily triggering a requirement to raise the fully fl or fully flood proof the structure.\nThese regulations are optional and they're intended to help buildings undertake resiliency improvements, so zoning for coastal resiliency would expand the applicability of the current text to a broader set of buildings that are also exposed to flooding in the event of coastal storms.\nA 0.2 chance floodplain would be allowed to use the proposed special options for resilient building design.\nSo, firstly, it more streamlined, optional rules for how height is measured in the floodplain would allow buildings building owners to physically elevate habitable spaces and other building support features above expected, flood elevations, so that they're safe in the long term.\nToday, building heights under the 2013 flood text can be bumped, up, 9, feet, 10 feet or 12 feet, depending on the building's size in the zoning district, making it a highly complex framework and because its applicability depends upon the elevation level slight to slight topography.\nAlready, and what the text is trying to do is streamline that, so that in the one percent they can add up to 10 feet, and that means the building would be measured from the reference plane of 10 feet above the ground level, which is where the water would rise.\nIt's a basis for what you understand the coming slides to highlight also so this would require would also require that the floor level is placed at or above this reference plane to ensure that the additional building height is tied to actual resiliency improvements and to close any loophole for developers that might want to try and get additional height without making the building resilient.\nThere is a mechanism in there to make sure that resiliency is tied to any claim to the additional up to 10 feet in height, if that's, what's being sought by a developer, so to help promote safer buildings with good, long-term resilient design and good neighborhood streetscapes.\nThe proposal would allow existing floor area exemption for spaces that are wet floodproofed to apply to both existing and new buildings.\nYou can see a provision that applies to existing buildings and it applies today which could exempt the entire dry floodproofed space from floor area.\nYou can see a rule that applies to new and existing buildings, which allowed any space to be exempted from floor area.\nThis rule was first implemented in 1989, and then it was edited in the 2013 flood text, amendment to be even more flexible and the problem we found with the seller exemption system is that it allowed full floors to be entirely exempted without actually requiring the building to comply with resiliency standards, and that created a loophole, and the current project is trying to fix.\nThe proposal would modify these regulations to reduce the amount of floor area that can actually be exempted to instead allow only the first 30 feet of a space that is dry flood proofed to be exempted from floor area, provided that the space is used for non-residential uses, complies with certain standards and requirements such as minimum transparency or window requirements, and internal clearance.\nThis would help encourage active uses close to the sidewalk level to promote a safe and lively pedestrian environment, while making sure that the resulting buildings are not out of scale.\nAnd I mean, as I had alluded to earlier, dry flood proofing is extremely expensive and by allowing a portion of the floor area that has been dry flood proof to be relocated within the lot, as in the floor area would be put somewhere else within the building, because a portion would be exempted from their calculations.\nWe are incentivizing dry floodproofing, while keeping the streetscape active, so I mean the alternative for buildings that are upgrading within the flood zone is wet flood proofing, and that would result in a use that would be the parking, storage or accesses of access fronting the street, and none of those are active.\nIn terms of the floor area exemption that the text would allow, So this is proposed and it's limited to 30 percent sorry 30 feet of the street wall, whereas this existing provision, it was allowing up to the full floor of what was being dry flood proofed.\nSo, in addition, This proposal would mandate a set of streetscape requirements to improve the ground floor, level, design of resilient buildings.\nProvisions located within this goal are what we call partial resiliency strategies and they will help building owners to undertake incremental steps towards resiliency without requiring the structure or the sites to fully meet Appendix G, which is cost prohibitive, and everything within goal.\nWe heard for older buildings, in particular in community board 8, to implement resiliency efforts, so we learned that raising mechanical equipment, often located below grade within sellers, is the first and most cost effective step to making buildings.\nYou know the recent discussion of mechanical voids on opening up a potential another loophole where this project could potentially grant more mechanical exemption or mechanical space in general for developers.\nIt limits the height of predominantly mechanical flaws in residential buildings, and I mean to be clear that this project does not change.\nOkay, So the proposal would also enable different types of flood protection measures to be implemented, and this would include allowances for flood panels and landscaped berms to be considered permitted obstructions in open areas.\nIt would also allow spacers used for storage of panels to be exempted from floor area to enable on-site storage and again, This is a cost-effective strategy that older buildings can implement, without necessarily going to the full expense of raising their levels or completely dry floodproofing and those sorts of measures.\nAnd, lastly, When looking at our waterfront sites, Zoning generally does not allow waterfront yards or required visual corridors to be raised to account for flood risk, and this proposal would offer more flexibility for the grading of these sites and would facilitate resiliency measures such as soft shorelines, which is what the example here is showing where the landscaping is actually intended to flood, and you know, provides a level of protection in the process.\nThe proposal will therefore allow power systems, including generators, solar energy, systems, fuel, batteries, fuel, cells, batteries and other energy storage systems to be considered, permitted obstructions within open spaces across all zoning districts.\nLines, but it effectively means that you know power systems in particular could be placed within yards, and things like that subject to those placement heights and coverage type limitations.\nI mean perhaps doesn't look like cb-8 at all, but the concept behind it is very relevant because this applies to vulnerable populations and specifically nursing homes, which I know there's a lot of in your district.\nExisting facilities would still be able to conduct enlargements for modest improvements, including those that help with resiliency, so I mean just to get ahead of a question that may come up.\nThey can even make improvements if they needed to, but they could not do significant expansions and you could not build a new nursing home within the one percent flood plain and that's based upon the sheer vulnerability of this use and the people that occupy this use.\nThe proposal would include enabling two sets of rules to help support more predictable, long-term recovery efforts and the first one would be to give property owners who hold special permits and authorizations an additional term so that they can complete their original plan of construction on a perhaps a longer timeline.\nSecond, one would support businesses that do not conform with zoning use regulations by allowing them more than two years, which is the current limit of discontinuance to return to operation.\nI. Had a couple of questions, one is and I'll ask them quickly, because I know my time will be limited.\nMoving mechanicals, using resilient materials, Making sure that new construction is compliant is incredibly important, trying to help older structures to also become flood proof, looking at all kinds of solutions of pumps and of other solutions and relocating living, space.\nAnd I mean if you feel that those need to be reflected in your resolution, I think that's probably the.\nI. Think that that's, if you can make these buildings resilient and there's new construction, then why would there be a problem putting nursing homes into these areas.\nYou think that you know the flood elevation is actually higher than what this is.\nThey're not intended to actually themselves keep flood water out only that they can be provided as a means of you know, accessing a building because say, for instance, in this picture here the floor level is obviously raised for reasons of resiliency.\nOkay, because I just said, concern that obviously a wheelchair lift, there's, You know mechanicals a part of that, and it's so difficult to get accessibility updates in so many areas of life and throughout the community, so then to have them damaged by a flood or other natural disaster.\nI worry about the expediency and would be interested to know if there's any a part of the plan that would address impact on any accessibility options that were affected through this I mean to the extent that I understand your question, there.\nA lot of them have their own resiliency, plans, health and hospitals in particular, and New York's mean public health.\nI mean the zoning resolution is limited in general as to how it can you know, regulate aesthetics.\nYes, in providing flexibility, it's trying to provide owners options to get mechanicals out of the most vulnerable parts of their site, and if that includes building a structure, you know within certain bounds, such as what you are looking at there or if it involves putting him on the roof, then those are both options that an owner could take up.\nYou know previous to this, or do they have to follow the current rules, right, I, think I, understand so say, for instance, yes, a developer has a vacant site.\nI know that Stanley Isaacs is building I, think it's a generator on their land, rather than.\nHi I just want to expand on one of the answers on why somebody would spend a lot of money in finding resiliency building a wall raising the mechanicals, it's insurance, flood insurance, having owned waterfront property in my life.\nMy concern is that if I understand this correctly, that building owners, including NYCHA, could opt to put their mechanicals on structures that take up open space and ultimately have their because I think I've been seeing this at our at Isaacs and homes where they have they're taking up open space in order to put their mechanicals there and therefore, ultimately, taking away some of that open space or severely changing it, so that it's not actually open space.\nI'm, really struggling to think about voting in favor of something that allows the taking up of open space.\nI mean why not you know, do it, for example, through the building code or something along those lines, just say.\nSo, for example, You know how is an apartment building going to raise its ground floor by 10, feet, I guess, so.\nOkay, so a couple of things there so the first one, if I quote the extent of the question, is a new building should know that it's building in the flood plain.\nSo, you know if, in the instance, the building you're looking at there was being built today, they have to comply with Appendix G, which inquir you know requires them to elevate, habitable spaces, elevate, their ground floor or drive flood proof or wet floodproof.\nAmendment here, which I mean, are primarily aimed at trying to get owners who have an existing building within the flood plain to adapt.\nNow that you know, there's different flood resiliency requirements, all of a sudden, so I think it's less aimed at the incentives at least are less aimed at circumstances like this, where there is a new building where they can start from scratch and elevate it and more at.\nThey end up losing the space on their ground floor because now, all of a sudden, it's not habitable, because it's below that blue dotted, line, You, know, I think, would apply to new buildings like this is that it allows things like the access structures that you're looking at here and plant and equipment to be located in other spaces that otherwise might not be allowed.\nSo certainly there's a lot of residential buildings that would have ground floor apartments, for instance, in the flood plain and according to Penxg.\nFor you know some instance where that floor area may be allocated somewhere else, because there's an acknowledgement that, via the new requirements of the building code for resiliency, that ground floor is effectively being lost.\nSo I mean how likely that is in a you, know, a very established, fully residential apartment, building.\nIn the case of the answer about the 10 feet, elevation increase, it sounds like in the case of an apartment, building as a practical, matter, Yes, I, think that's.\nI mean I'm, not sure how else we could be flood-proofing without ground floor apartments.\nI mean I would like to know the answer to that myself.\nAnd I know that people may be anxious, but this is a really big deal because it covers the entire city and there is a lot of detail and a lot of different opportunities or different ways in which this change would impact buildings.\nI know this personally, So many of you have probably heard me talk about this, but I live at east and 90th street in a large residential building.\nAnd I, recognize that this plan isn't perfect and there are definitely compromises that have to be made like Trisha, I'm, completely in agreement about what you're saying about the open space issue, but I think I side on the support of an imperfect but overall, really well thought out, plan that may result in some, hopefully infrequent very infrequent, negative impacts that are hopefully outweighed by the tremendous good that this plan will achieve in helping people, especially those who live on really vulnerable.\nI mean it's trying to provide strategies where we have them to get people out with not living within what is a highly vulnerable flood zone.\nSome ask us, you know anything about the process of what landmark buildings would have to go through under the text as in if they were trying to relocate, say equipment or floor area.\nSo you know, I would have to presume that they're required to adhere to the same conditions that any private owner is where you couldn't actually put mechanicals or electrical in harm's way, without having some offsetting action such as dry floodproofing, but I mean again I.\nAs we all know, CB8, has among the least park and open space of any community in all of New York City.\nIf there's anything, we can add to the resolution that expresses our concern about the use of our prized open space for power systems and mechanicals.\nYou want to consider two resolutions, one for everything, but putting mechanicals or other systems into open space so that we can look at both of those separately.\nI think that it's an acknowledgment that the requirements of the building code to become actually resilient are extremely cumbersome and expensive.\nSo I, wouldn't so much say that it's an effort to make sure that they can't lose money, but more so a circumstance where you know I think we're trying to incentivize owners that may otherwise do nothing and retain a building that is not resilient.\nI mean until any you know, substantial upgrade is made that building doesn't have to comply with that part of the building code specifically, and those people at least that are on the lower floors, are going to keep living within a high-risk flood.\nYou know, trying to change that circumstances that circumstance and acknowledging that the ability to do that is quite cumbersome rather than strictly I mean categorizing it as we don't want earners to lose.\nYes, certainly I mean if the more resiliency provisions they include within their building.\nI think we are acknowledging within the text is not sufficient, for you know people to be taking action, so this is trying to provide extra incentive.\nThink that issue has been explored a lot with you, know: people making just general upgrades to their building, but.\nAs far as I know, any like dude, like from federal law, any building in the floodplain has to have flood insurance and I, don't think it's tied directly to resilient building or not, but we can confirm that there may be other types of insurance as well.\nIt feels as though they're benefiting in some way, maybe not the anticipated way, but that for certain things that the city, because their changes in zoning may be paying a price, I'm, not sure again, I, don't know.\nI also have real concerns about putting mechanicals in open space, whether it's open space in a NYCHA campus, or whether it's open, space, someplace else, or whether it's a backyard in a landmark area like around East End Avenue, and that would apply as well for people to put mechanicals in storage spaces in a backyard in a landmark building where there are in a landmark or historic district where there are requirements.\nOne of you know a very few amount of uses that could actually be used for a space that was in the floodplain previously.\nSo, you mean I, mean say those apartments that were vulnerable to flooding on the ground floor of a building were relocated, elsewhere, there's a little else that space could actually be used for if it's not parking or storage or access, and that's the.\nYou know that, because we're looking for a height limit buildings that are very large buildings, that cast shadows, that cut off light in air that affect people in the way they live and yet there's nothing to help those people or businesses that are lost because their building is torn down for another building going up and so not to say that this is wrong because I understand what Craig is saying and what Adam is saying, but that there's not a balanced approach to zoning and helping people that are impacted by what's going on around them and in the same way that coastal flooding is something that's not anticipated or not.\nCraig, if you want to you, made the resolution, If you want to have a second resolution on the issue of the open space that were raised by a number of people well in terms of the open, space, I just have one quick question and that is for Scott.\nIt's really meant to be in used in a situation where it's either, where a building a property owner doesn't really have another option in terms of how they're going to be able to make the changes to harden their property and have to use that as opposed to looking to just put it in the middle of an open, space.\nAnd, if that's the case, then I think we can just vote on the question on the resolution.\nSomeone wants to put second resolution regarding the specifics of the open space question, Then they can do that and well maybe we I know that there's a flurry of hands that have gone, up.\nSomeone wants to add on a second resolution, then I think it would be in order to do that.\nPutting in an open space and a building that looked like that.\nWell, then, Let's see would could you lower the hands, knowing that Anthony had his hand raised just in case and everyone who does not want to vote on this.\nOn the second floor of an existing excuse me existing building located in a C-19 zoning district.\nIs there, a second Anthony Sorry, Anthony, Cohn, Okay, then, Let's move to a vote, so call a question.\nIs a c8, I'm, not sure if I said it, but it is a c84 district, which is very liberal with the amount of signage that's permitted, This signage, that's shown right, here, is actually far less than could be placed on the building, but they're not proposing any changes, and this is similar to what was on the plans that were previously proven, but you're, saying under the existing zoning.\nThat size is permitted, because I'm thinking that this bar here is only allowed like 14 inches out from the building I can't measure it, but it looks."
        }
    }
}