{
    "data": {
        "YoutubeMetadata": {
            "author": "MCB3",
            "channelId": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "title": "CB 3 Manhattan - Transportation Committee Meeting - 9/8/20",
            "publishDate": "2020-09-09",
            "shortDescription": "Agenda\\n1.    Approval of previous month's minutes\\n2.    DOT: response to CB 3 request to study proposals for E 2nd St and E 4th St to allow FDNY faster response north\\n3.    FDNY: findings from studies of turns and other studies to determine best route for FDNY to respond north\\n4.    Vote to adjourn",
            "lengthSeconds": "0:56:13"
        },
        "metadata": {
            "ID": "String",
            "creationDate": "datetime"
        },
        "CommunityBoardInfo": {
            "communityID": "MCB3",
            "normalizedName": "Manhattan Community Board 3",
            "twitterName": "Community Board 3",
            "youtubeChannelName": "Manhattan Community Board 3 NYC",
            "youtubeChannelURL": "https://www.youtube.com/channel/UC2HzoCJxu-rVSgcaop0K-_A",
            "twitterHandle": "@CB3Man",
            "dateCheckLast": "10/8/2020",
            "status": "live"
        },
        "properties": {
            "videoURL": "gAVm7gGio4c",
            "fillerWordCount": {
                "uh": 101,
                "um": 189
            },
            "readTimeFullTranscript": "34 min read",
            "readTimeSummary": "4 min read",
            "wordCountFullTranscript": {
                "street": 55,
                "parking": 28,
                "streets": 28,
                "response": 23,
                "fire": 17,
                "lane": 16,
                "month": 12,
                "department": 11,
                "end": 10,
                "reversal": 10
            },
            "wordCountSummary": {
                "streets": 10,
                "street": 7,
                "parking": 7,
                "response": 5,
                "program": 3,
                "block": 2,
                "responses": 2,
                "agenda": 2,
                "item": 2,
                "guys": 2
            },
            "fullTranscript": "Here we go good evening: everyone, it's about 6:35 p.m, on September, 8 2020, and welcome to Manhattan community boards, 3 transportation, public safety and Environment Committee meeting. My name is Paul Rangel. I am the chair of the committee. I am a lifelong resident of the lower East Side East village. This is home, for me always will be home if the rest of the committee members can also introduce themselves, starting with the vice share hi I'm Michelle Cooper Smith, I'm the vice chair and also the minutes taker tonight. So please bear with me if we have any hiccups and I live in Essex crossing, hey everybody, Lee Berman, also, a lifelong resident of lower East side yeah, I'm David Crane and I've been here a little over half my life on a block right near tompkins, where hi everyone thanks for watching hi, I'm tariQ&And, I'm also born and raised in lower east side and happy to be on the committee. It's wendy young, wendy, Lee, yes, hi, my name is Wendy, I'm also born and raised here. Let me know if I like start cutting in and out or stuff, because I think my connection is bad, not a problem. Thank you, Wendy did I get everyone. Does everyone know? I think I think we got everyone all right. So we're going to go to agenda item number one today, which is the discussion of the minutes. I did send the minutes out Sunday evening. I think Sunday night Sunday evening afternoon for discussion. Does anybody have any issues with the minutes before we take attendance or any discussion with the minutes? Are we good I'm gathered by everyone's silence that we are good to go? I like that agenda item. One number is done and now we can go right to attendance. Thank you. Michelle Paul Rangel! Yes, here! Thank you. Michelle Coopersmith, President, Lee Berman, here David Crane, here, Felicia Crookshank, okay, Wendy Lee present. Thank you. Ellen Lou yeah, three grandmas here. Thank you. It that's pretty quick, okay! So our agenda items, the past few months have been kind of jam, packed with a lot of fun. So we've decided to continue that fund in September, but we are getting updates on the Fdny Avenue B situation as well as D.O.T. I do not know what the time is like for Fdny today. I know we are really just getting updates. I do not foresee us doing any resolutions here tonight. We are really just getting updates on the situat on the situation and how things have improved or not improved, but I know Fdny is on the call I did see. Jack Spelaine come on and I also so David. Is it Winston? I'm sorry. I do not know if I saw him captain Winston yes, so I do not know which one of you would like to speak first, but you will have the floor untied on the updates for all the turns and everything that's been going on. It's specific to agenda item number three findings from the studies of turns and other studies to determine the best route for the fire department. I'm just reversing the order for tonight and starting with the fire department just for clarity purposes for the public. Okay. This is Jack Spillane Battalion chief from the 4th battalion is that if I speak absolutely the floor, is yours. Okay, we over the last couple weeks, we found a marked improvement in the response pattern, not that it's ideal, but the way it is set up currently from 6th Street north to East 14th street. We find it still difficult to traverse, but more I say it's a better. It's a better setup than it was prior. So we'd like to continue using that setup in the near future and continue evaluating as we speak, but I would say the initial it's our belief that so far it's it's better than it was so that's you know, that's where operationally was talking about in the fourth battalion. Okay, that's that's the nuts and bolts of it. I'd be happy to answer any questions regarding specifics: okay, Captain Winston! You said you had your hand up, I believe, did you want to speak as well? Oh, no! Actually I was deferring to chief spelaine, okay. These are boots on the ground. Our subject matter expert. Thank you, okay, great. Thank you. I appreciate that David Crane Committee. You are up there Gore that thank you around third street. I do not remember if it's one or both of the two blocks at Third Street and Avenue B they put in a restaurant only. I do not know the technical word for it, but restaurants know through traffic. So I have a couple questions about that. Does that mean that the fire engine actually has to go over to avenue a would be one of them and then b, if you're supposed to be allowed to use it I'll, have a follow- up question: okay, so yeah the during the open restaurant portion of the week after Friday five to eleven, I believe, Saturday and Sunday twelve noon to 11 pm the restaurant, the groups that run the open restaurants. They have put workers in place to move those barricades when the fire trucks come by. That was a little shaky in the beginning, especially when one of the establishments that was running the restaurant group from second to third street lost their liquor license. But another restaurant took up the mantle and, although again like it's not perfect, we when we need to get up the street like us, you know we will they they're there to move it, and if we have to move it, we won't replace it we'll just keep going and have somebody replace it. So, like that's like what I was saying before, like it's, not it's not ideal, but it's better than it was, and there are times when, if the well they're not going to avenue a specifically, you know there may be times when different responses to different areas require different routes. Obviously, and if you can get to something a little further west without going up b and taking a if you got to come down to fifth or sixth from a it can be done. Sometimes you have to. I was going to access. It sounds like it's working for you think that it is fine with that situation. I guess my follow- up is yeah, no go you're right, I always say fine, but it's better, like it's more manageable than it was before I'd say. I do not think it's not creating dangerous response times. That's your opinion. You know what I do not have the data on that see that that's one of the things I kind of wish. I do not have all the data on it to they. Just they just talk about the meeting this afternoon. They, I was going to be the Rep here so, but not that, that's not you know I did not have yeah. I just do not have the data to that at this time. Okay, I do not. I do not see the fire engines operating that often, but I do live there and I see the setup it's nice. It looks like you should be able to go right straight through having to be at 6th, Street and along the park. You know what I do not need. That's my follow- up, I think, as part of the setup period. There was a problem where someone was parking: a car acrosss, the Yellow Stripe of Avenue B. That would block any ability until you've got that car moved, but I only saw that once and it was over a month ago. Okay, Susan, you have your hand up yeah. Thank you. I wanted to ask. The fire department was going to do what they called turn studies on 2Nd Street to turn on Avenue B, and I wondered if that happened, and my second question is: is the they fire the different battalions or different firehouses? Are they now arriving in the correct order, because last time one on 2Nd street was arriving after the one on Pitt street that was causing problems so has that problem been rectified and you know, were there turn studies? Okay, the turn studies are still ongoing. I had not heard much of like until that day we were talking about the turn studies, but I believe they're going on and they're ongoing at this time. I will find out about that, for you, though, for certainly and I'll, send you some information on that. If, if it is not, you know what I mean as for the getting in to the alarm boxes at the right time. It's not, it has not been. Let's just say it's improved, it's not as it's not as bad as it was. That's why I say the situation has improved. It's not perfect, because we still have these situations that may arise, but they're arising at a less frequent clip. Okay, let me ask one more question. I was told that there's a task force with D.O.T and Fdny working together to keep improving these issues. Is that still ongoing? Yes, it is yes. Thank you just a question. On my end, I was on Avenue B on Sunday at on 2Nd Street, and I saw a couple of calls being answered by Fdny and they seem to make the left on Avenue B and then another left on Houston is that a traditional route or no? That is that traditional route, if they're going south of Houston that House does cover south of the house, so I had to know what the address they were going to, but that's not uncommon for it to happen. The problem be the problem with making that left and the left is that they got to go north but like they could be going south to anywhere. You know because that fire house on East Second street covers a lot of ground south. They go as far as East Broadway, sometimes maybe even down to water street, sometimes too so, depending on the okay. It could be for something else: okay copy. Thank you just it was a point of interest. Does the committee have any other questions for the fdny here tonight? Crickets Paul. I can't raise my hand, okay, okay, but I mean I I'm still. I do not know. I still feel a little uncomfortable with this if it's improved but like can't be answered whether or not this is putting people's lives in danger, I would love to like no know that I mean I know that the open streets program will probably not go that much longer, but I do not know I mean I do not think that people are using it so much that we could put people's lives in danger because of any sort of reduced response time or as captain spleen as or chief splain excuse me has explained to us over the past couple of months about the response order as well, which throws things into havoc. So I do not know if either of the representatives here can speak to that, because I mean I think when we had the full meeting in July. I want to say you know there was sort of like a life and death description given to us, so I'm still a little worried about that was a long- winded question, but if there are any more information about that, I'd love to hear it. You know if I could speak just to that real quick. You know, we've had a different dynamic right now. Also, our runs are we're down from this time. Last year, we're down 500 runs for non- emergencies, we're not because there's a lot less people in the area to call in some of the runs. We still got a lot of runs for odors of gas in the street or an odor in the street and we're not getting those runs anymore because there are not as many people around to you know, calling in so I think we're going to see an uptick in volume and runs now not at school, starting now, the people you know I got to get their children to school. More people come back into the neighborhood. The colleges are in session, so I you know, I that's why I'm saying like everything like so it's there's been an improvement, but it's not to speak that you know that improvement won't get. You know, I can't say if it will not continue based on the amount of people that come back into the neighborhood. So you know those things have not been eradicated 100, but it's been better than it's been better since, since the July, since our episodes in July and everything I've spoken to the officers and the apparatus operators, especially from the firehouse, the fire company on East second street, and they found to be improved, so you know like they're, more apt, you know it's better than it was and that's you know with the open with the parks apartment you know, whatever it is with the open street. You know this is the best we could do right now we had a fire on Avenue B. I believe it was 10 to 11th street 11th to 12th at about 7:30 in the morning the other day, and it was a very fast response because it was all the barricades down and everything was down, but that happens on in the early mornings. Anyway. You know so yeah, it's it like. I said it is better, but it's still not ideal would be nothing on the street blocking away. You know what I mean and that's really what it comes down to, but it's better. Okay, sorry, that's good. Does committee have any other questions or Michelle? Would you have anything else to follow up for be good? Well, I mean, I think you answered my next question, which is what would be the ideal situation which is to not have anything blocking the street, so thank you, okay, great. So if the committee does not have any ques any other questions, what I'm going to do for tonight is I'm going to pivot back to agenda item number two, which is the dot's response and then I'll take some questions from committee and then the public after the DOT presents all right. Thank you, fdny for joining the call captain, Winston and Battalion chief spelaine. Thank you if you guys can just hold on for a little while longer and if the D.O.T representative can speak on agenda item number two, which is the response to the request for the study proposals on E-, second and fourth street, to allow for faster response up north the floor is yours a point of personal approach. I guess someone has asked, I think it makes sense. Could we put the speaker in the middle of the screen as opposed to the text thing now, just so for people? Okay, thank you David. So we generally like to leave the guidelines up for a little while in case people are joining a call late, so they understand what they need to do, but we will take the guidelines down at seven o'clock that way. That's when we shut down the chat for anybody who's trying to sign up as a speaker so we'll take the guidelines down at the same time. So if anybody wants to speak to any of the agenda items which would be primarily two and three tonight I'll take a few questions on each of the presentations, but I will we will take down the guidelines at seven o'clock once we shut down the chat as well for signing up. So if anybody actually has a specific question, I know assemblyman Epstein has a question which I'll say that I'll line them up first after I'll line them up at first after the DOT presentation, so D.O.T Jackie Lazaro hi. Can everyone hear me? Yes, okay, perfect, so my name is Draculazzaro. I'm here for Jennifer Leong, I'm the newest borough, planner of the Manhattan borough commissioner's office, so just to confirm we're discussing the reversal on East Second between Avenue B and Avenue C and the upper part of Avenue B. Okay. So I believe when, for the reversal study, what I was told is that it would take some time for an evaluation to go through and on Avenue B. You know the open streets and the open tree. Restaurants are a temporary program, so by the time we determine the feasibility of a reversal of a reversal. The open streets program may no longer be in place, but if this is something that the community is interested in pursuing long term, this is we can certainly proceed within open study or to open a study for this reversal, and then I think in the resolution you guys also mentioned removing the barriers on Avenue B in favor of flexible delineators, so flexible delineators would not be a viable option, because the open streets is not in effect 24 hours a day. They do have set time so because of that we could not install flexible delineators and then for creating a employee, oh removing parking. Okay. So at this point, we're not looking to remove parking for open streets, but just to clarify is this to remove parking on the corners to accommodate the turning moves or just to widen the travel lane for the whole block we're talking force? I think we're talking about fourth street, yes for fourth street. Would this be removing parking to accommodate the engines turning or to travel the wide lane or excuse me to widen the travel lanes on the whole block you want me to answer? Is someone from the committee one answer. I think we originally were thinking that it would be helpful to give them more space to be able to go down the street because it's a pretty narrow street, if wanted to jump in on that, though so maybe Jackie could discuss and respond to both corner, eliminating parking on the corner and the full street, which I think the committee asked for. Okay, so yeah, like I said at the moment, we're not looking to remove parking for open streets, but I could bring back the this to my office and see what I would have to bring it back for further clarification. I mean, I think, that I do not Paul. Are you no go ahead? Michelle go! Oh I mean I just yeah. I mean I guess if it's a temporary program, probably not, but if it's something, that is something that this is going to go on for longer, I mean I think some cities have extended their open restaurants and streets to like December. Then, yes, potentially I do not know if chiefs blaine wanted to if he's still on or if captain Winston are still on and would want to say if that would be helpful for the response. Times Captain, Winston, okay, I could not find it sorry about that. Folks, I'm on my phone and I usually do it on my ipad and I could not find a button. So I think with the like. The real concern for us is if the open streets continues, we know like it's. We know it's going. What's going on this year and we're working with it this year, if it continues into next year and it becomes a normal so to speak, then is you know this is an ongoing issue that then you know this temporary. You know this. We can make do what we're doing right now, but changing the direction of second street if you're going to not have anything on Avenue C blocking in the future. That's a that's a viable alternative for us. It that helps us out a lot. Getting rid of the parking lane on 4th street is an another way for us to get down. It's a very narrow street, but it gets us to where we have to be in a quick and efficient amount of time. You know so, like everything is based upon this coming, you know all these alternatives are based upon is coming back next year, which I believe it will. But I can't you know I can't speak to it. You know that it will, but I believe, that's the direction. You know that seems to be the direction we're going. So that's what the fire department stands. We got ta. You know we got ta, make sure we can get down the street safely and I know there's a school in the area and we have to have a good alternative to Avenue B, if they're going to if Amy B is going to be shut down again come springtime through for the open streets. Now I forgive me if I'm wrong, I do not know if the open streets will close. I know the open restaurants has not had an end date of October 31st, but I was not sure if the open streets program had an end date. Forgive me for not knowing. I do not know if anybody can clarify that, but that to me fire department operations is what we're looking to as a long- term, viable correction to the situation. I'm finished speaking there you can answer to that. Please thank you. Could D.O.T answer that question for thank you yeah. So at the moment I am not sure if there is a set date for the end of open street, so I would have to actually get some questions I can. I can address that point. The dot's official like open streets announcement is that the open streets are for the duration of the coronavirus pandemic. Let's I'm sorry who was that speaking, that was a member I know and yeah Andrea Gilbert, I'm with Los Cc and a resident. So basically there's no end, no official end right now, no, nothing susan! You had your hand up, I'm sorry, yeah. So I'm kind of concerned by the lack of information we have so the open streets is a very successful program that people like so therefore it may be extended for a long time. It may come back next summer whether we have the Covid-19 or not. We do not know, but we have to plan on it, maybe only being a short term, maybe being a longer term. You know we, you know these things change every day, so we have to plan for both it is the fire department, and the committee has gotten this from the fire department has said. A very good alternative would be to go up, Avenue, B and then turn on 4th street, and then you avoid the whole open street area for many of the responses, particularly on Avenue D. So we know it's a good alternative. D.O.T is saying we're not looking we're not looking at this now, but not giving any reason for it. And you know this has been over a month, maybe two months, since we did our resolution asking for information on this. So I do not understand why the answer is we're not looking at it as opposed to we're not looking at it because of and I'm sorry to put Jackie in this position when she's brand new and she was just asked to cover for Jennifer who's on vacation. But it's just not acceptable to say we're not looking at it and not give a reason and Susan. I understand your frustration and I would be more than happy to connect Offline once we have once I have more information and I'm able to provide a great- and I appreciate that, but it does not give answers to the community members that are here for this and again I realize it's, not your fault, David go ahead, yeah, I'm just wondering now I mean we passed a couple of resolutions. You know a bit ago, I'm wondering if we re there's a lot on 4th street. There are. There are schools, I'm not sure that fourth street would be so suitable. I know that sixth, is you know they both have problems? Neither one is a very wide street. Do we really think that we want to pursue this? It is discouraging that there was not much looking at it and that there's not really opinions being offered to us that we had asked for not opinions. You know reasoned responses, but how critical Susan before I call on you, I we received an email on August 20th right with responses from the department of transportation to each of our points in the resolution from July. If the committee would like me to read it I'll, read those responses. If not, I can try to forward this to you. I think it was only sent to myself and to Susan. Does the committee object to me reading the responses from the DOT on each of each of those proposals of our proposals? Okay, we're good okay. So I'm going to the first one was reversing east second street, between b and C to accommodate eastbound traffic from the resolution as this and the response from the Department of Transportation was as discussed. The reversal study would take some time for evaluation, the Avenue B open streets, open restaurants or temporary programs. By the time we determine the feasibility of a reversal. Open streets may no longer be in place, however, that this, if this is something the community is interested in pursuing in the long term, we can certainly proceed to open a study for this reversal. That was, for the first point on the reversal. Removing the barricades on Avenue B in favor of flexible delineators that fdny vehicles could drive over as discussed. Flexible delineators are not a viable option, since the open streets is not in effect for 24 hours. That was the second response from DOT the third, the third proposal from our resolution, creating a dedicated first responder northbound Lane on Avenue B between East Second and East 10th. That would allow for an open street in the western lane and a full any foreclosure above East 10th. That would allow for an open street in the western lane and a full above he sent that would need to be at least 15 feet wide and clearly delineated. I believe Evcc and has been setting up the barriers to maintain an emergency lane from 6 to 14, with larger signage, to deter other drivers. We continued to monitor the setup that is from D.O.T. That was their response to that third one. The fourth proposal was removing parking on East 4th, as well as parking on the east side of Avenue B between 6th and 10th street, to widen the street to accommodate fdny vehicles. At this point, this is the ot's response. At this point, we are not looking to remove parking for opening streets to clarify. Is the request to remove parking at the corners to accommodate turning movements for fdny trucks, or just to widen the travel lane for the full block? Maybe that's something we're going to have to circle right now and five: creating an open street grid between East 14Th Houston, an avenue, and now you see similar to the Les open streets grid that would remove the need for barriers for on every Cross street intersecting without Ub a dedicated partner would be required to manage to set this up. We have not received any proposals for this open streets grid that is from Jennifer at DOT, a response to our propos to our resolution on August 20th. That is it for now Susan you have your head yeah. I was just going to say, particularly in response to to David's question. I do not think the question is right now, whether we want to pursue 4th street it's not happening, but I think we need the information from D.O.T they're, not considering it. Why or they're not considering it, and maybe that would inform you know whether we wanted to pursue or not pursue. So I just think we need the information. That's all chief spelling, I see it, you have your hand up. You can go ahead. Thank you with regards to the parking on East, 4Th. Street. Anything will help you know if they could, if D.O.T can remove the parking off the corner. That would be a great starting point. You know, and that, and that would help that just you know just as a point of reference. Just everybody knows that would definitely help us. Thank you. Well, Dot's response was, at this point they're not looking to remove parking for open streets. That's what's up on this email, they did have a clarifying question that we could respond to as a committee later on, to clarify the if the request is for removing parking at the corners or to com to accommodate the turning movements. Is that something you would want, or do you want the whole lane or to widen the home late and that's for you chief spilling? We would like the whole lane, but we will take whatever we could get yeah. You know, honestly, that's really what I mean. That's you know, I mean to be realistic. You know, I think that little, that little bit will help and then, if the next thing is to take the whole lane, then we'll we'd like the whole lane, but every little bit's going to help us okay, so our formal response will be whatever we can get. David Crane go ahead, good brief windows on top of windows. We could decide that we wanted to ask D.O.T to daylight that corner. If, if we agree that it's something we should ask for, we should just we should do it. They do not need to do an extensive study. They may have stated that they that they're not doing you know and as conceived they were not getting rid of parking spaces. I suppose, but it's separate from that, I mean maybe it's related downstream from it, but if we think that we have a safety issue that we could improve by asking them to daylight the corner, which means removing basically one car for each the corners that the fire truck is likely to apply to those cars. It would be. Oh boy, sorry for talking too long. Just go back on you just you should yeah, I meant to go back on Mute. I decided I was talking too long. I probably did not speak clearly at the end. I'm done. We can definitely ask as a committee if DOT would be willing to take a look at that at least the corner before the street. To take a car off, to remove a parking spot to sit to help fdny out is that something DOT can take back yep. I can put that back. Okay committee, any other questions for fdny or D.O.T before I go to the public, no everyone's good, all right! Well, I'm going to look at the chat to see who I signed up. First, I did agree to assembly member epstein being the first question so straps, then you can go right ahead. Oh thank you and thank you all for continuing to talk about this, and I know the open streets coalition and including myself with my office on Avenue B. Having that available for the community is extremely helpful. I've. You know, I've noticed you know and David and I've talked about this fun set during the day. There's sometimes there are not many people, but sometimes there's tremendous numbers of people on having to be using the open streets. So what we can do to support the community in social distancing is critically important, and I know the Fdu Dny has got serious concerns around response times, and I think this really falls on Dotd and I really would ask the DOT take seriously these recommendations or a request by the Community Board and not spend another month just kind of waiting around without having adequate response. We have no idea how long this is going to last. We have no idea how long coronavirus is going to be with us. Even if we get a vaccine, we have no idea how we're going to respond to the city, state and country and Globe, and so we need to be prepared, and that requires DOT to do the appropriate thing. I think you know we want FDA and why to have quick response times and if that requires them turning around at second street, or you know that requires turning around street. That requires thinking about forestry. I mean I do not think I think DOT just can't wait another month and not have responses, because the answer is then less social distancing for people and more risk for health issues, and I do not think that's the right answer. Either. We've done a lot for our small businesses by letting them into the streets, how about doing it for the reverse, as well. People who, like people who walk people, need to use the this open space is a way to for a healthy issue. I know I you know when I walk down Avenue B and I do that almost every day there is not a time where you know people with barriers or people try to get. You know push you out of your way. I think what we really need to do is have something that's really for emergency vehicles only and for people, and I wish the D.O.T would work on working with the community, because we see these all over the street, a city where there's real open streets and that accommodates for emergency vehicles, but does not accommodate for the community. So I mean I guess my question is to DOT: can we get a commitment from you to having an appropriate response to the Community Board next month with real answers of saying, hey, we're not sure, because they may not be around forever, but really studying it and really getting adequate answers to our community? Thank you for that assembly member. So I will be definitely bringing back these comments and concerns to the office and we will get back to you. Thank you. Thank you, assembly, member. Looking down the list, Laura you're right, hi, everyone. I want to thank you very much for hosting this conversation and continuing to host this conversation, and I hope I'm very glad to hear that the work we've been doing, made a difference and makes a difference and we've gone through a great effort to put together a combination of the metal barricades in the emergency lane position and wooden barricades blocking the Southbound lane so that our firefighters can get north when they need to and that the cars some cars will abuse a 12 to 15 foot lane and just go sailing through so mixing. It up seems to slow them down a little because they have to think about it and meanwhile, hopefully, the firefighters have had a steady route that they can. They can count on now that we've told the neighborhood to please stop dragging extra barricades back into the street. It took a lot of doing so. That was it's very good news to hear the reversal of 2Nd Street. I think I really hope that we will look into it. I completely agree that this is not a short- term situation and the open street is popular. I would love to see it continue. It was as the D.O.T liaison. It was told to me that it's for the duration of the Covid-19, so it does not have an end date. The way the open restaurants program does right now and who knows if that will be extended, the evens go east everywhere else. It only makes sense, so I'd love to know why it should not be and that we should that we could all move forward to that daylighting. The corner on 4th street is a great idea. One thing that has not been brought up that I'm. I would just like to raise the idea of loading zones on Avenue B. I think double parked cars and trucks block traffic, far worse than the barricades and in combination with the barricades they can. They can be a problem. So the idea of introducing some loading zones on b, no standing zones. If that could be looked at too- and you know unless the committee has any reason not to I would. I would love to add that to the list and thanks again, thank you. We're not updating the resolution per se tonight, but we'll have DOT take some of these thoughts back to their colleagues and see how they can work with them, whether it's a loading zone or freeing up fourth street a little bit. I think those would be the some of the takeaways here tonight is. These are just purely updates, we're not looking to update the resolution per se, but whatever ideas we can bring back to assist and help and continue to help the situation is needed. I only saw David I'm going to come back to you in a second I'm just going to finish off the public comment, because there was not that many on the list I saw John Blasco on. He asked that he would like to speak John. You have two minutes. Thank you happy to be here again. I'm John Blasco, I'm a district leader in the area, a NYCHA, Jacob, reese resident and a member of the coalition. So thank you again CB3 for continuing to have this topic on the agenda. I just want to say that, as a coalition, you know setting the new configuration because we wanted to be responsive to Fdny and we want to make sure that they do not have any challenges or barriers getting through to us for response time. At the same time, you know, I think, personally, I think that the emergency lane I've seen some drivers speeding down through Avenue B between 6th and 10th street. So I know thank you Jackie for being here. I will say that I'm just a little confused, also because the New York City Department of Transportation created an initiative for folks to have open space to be safe during a pandemic. Fdny is now sharing their concerns and some of the creative ideas that came out of last month's transportation committee meeting D.O.T is now saying we're not going to look at elimination of parking. This is going to take this long. This pandemic is taking a long time as well, and I just want to reiterate that we are about to have major parts of the East River Park closed, so our lack of public space is only going to get greater. I am a NYCHA resident. We have a ton of recovery and resiliency work going on with lack of public space as well, so making sure that this program is successful should be a priority, and I hope that DOT will come back with answers not next month, but maybe next week, because I do think that this is a priority and that's all thank you. Thank you. John got the clock late, that's about it! That's all I saw from the public who signed up before 7 o'clock. I had also submitted. Oh that's, Andrew Gilbert. He signed up oh he's way at the beginning. I'm sorry I it's just over here. Go ahead: apologies yeah, hi, I'm Andrew Gilbert, I'm here both the resident of Cv3 and as a member of the Los Cc, who were responsible for the Avenue B, barricade, maintenance and yeah. I mostly the second what both Laura and Nandra said about. You know. I think the I think there are two things that are most important. So obviously you know Fdny has valid concerns about the safety of the street and I think, ultimately you know the number one thing here we want to make. Is we want to make sure that the neighborhood is safe? And I think you know probably the number two thing is we want to make sure we have a pleasant community and I think, ultimately, the goals here of the open streets program and the fdny are in sync. In this sense, we want to have both streets that are safe for people to use and not worry about getting hit by cars, not worrying about being crammed in and getting in close contact with people and getting sick, and we want to have you know the ability for the fire department to get places, and I think you know over the past two three months, you know the community, both us, you know the other members of the Community Board Fdny have had a lot of productive talks and we've come up with a lot of different ideas that are really good, and I think it's really frustrating that the DOT has basically said we're not going to consider any of these. We are not going to put any effort into this, we're just going to have the status quo and that's no one's happy with that. Fdny is not happy about it. We're not happy with it. One specific point I wanted to say is on the point of the the super block proposal which I had originally brought up at. I believe, two months ago, at this committee I had sent both Paul and Carolina. Rivera's office and I believe, a member of the D.O.T- a copy of a specific proposal for that, and I believe that you know the lscc would be happy to maintain the barricades in that way. So the DOT statement that you know that there is not anyone who's willing to do that is not you know there may be some miscommunication there, but I think Jackie, if you, if you're still here, if you could, we can reach out, we have a specific proposal for the the super block already and we would be able to do that and I think that would meet all of our every member's needs. So thank you. Thank you. I do not know if the ot wants to respond. Go ahead, yup Andy, I'm happy to connect offline. I can put my or is it possible for me to put my contact information into the chat let's go on is not it. I just reversed that you can put the information back in the chat. Okay, perfect. I will do that. Thank you, yeah. Thank you I'll. Send you the info that I'd sent to Paul and Carolina's office the last time this came out. Thank you, Michelle was, I missing anybody. I do not know all right, so that is both agenda items two and three and since I believe D.O.T will be taking some of our responses back today to their colleagues. I really hope you guys do look at the fourth street potential of maybe daylight there a little bit to help free up, but the one thing I do like out of this is that there is has been improvement. We got ta, we got ta, look at that. There has been improvement for fdmy and that there is better response times and that things have looked better while not I ideal, but better and better is a good thing. Progress is a good thing. I do not. I also do not want this to be a DOT bashing session. So if you just take back our recommendations here tonight of the fourth street and looking at the loading zone, that'd be greatly appreciated and looking at the super block and Mr Gilbert has proposed in the past. That would be greatly appreciated. Oh man, I'm not going to take any other comments from community tonight. Thank you for coming out. There are no resolutions for tonight. I they are, we finished up district needs Susan. I think I'm almost done yeah. Is there anything? You need me to say to the committee. If I could speak, oh, go ahead, David! Okay! I want to get a little more color, maybe from Laura or someone about what's going on with truck loading zones, I mean there is not enough, in my opinion, there's not enough commercial truck loading unloading throughout the neighborhood. It's generally a worser problem, though, when there's congestion, because then you've got the double parking, but are you seeing that there's that there's you know the double trouble parking of deliveries happening that is blocking fire department activity? Yes, yeah! Yes, with a double park. I my windows are right on b, so I go and see which ladder is going up and the last time I hear the sirens I can tell if they're impeded and not- and I heard a horrendous amount of honking and I was horrified that it was us and it was a U- haul, yeah double phone call. I have a photo essay of double parked cars on b. It's a constant problem. Yeah so b is it's a fairly narrow street and it's two ways and what happens when a truck does stop to unload Kegs or whatever it blocks the on traffic as well, exactly almost impossible for them not to they're stretched acrosss the yellow line so anyway, this is more color for the, for, if DOT is taking this back, but that's what's going on there, it is true yeah over. Thank you anything else. David did you want to ask anything else? No you're, good, okay, yeah! I just want to make sure that I have everything in here that we want DOT to consider. So we have them in the minutes. I have day lighting parking on the corner of Avenue B and East 4Th Street we're moving the lane of parking on East 4Th Street between Avenue B and Avenue C, creating loading zones on Avenue B to reduce the number of cars, trucks, double parking and blocking traffic. Is there anything else? I'm missing? I mean I know we put the resolution, but all right, Susan's right near him, go ahead. Susan. I think the issue with the parking on fourth street is particularly, if they're not looking at it. Why are they not looking at it? You know, give us reason, give us the reasons behind what you can or can't do, and I also interject about parking on. Fourth, if there's going to be any investigation about that, then I think you also need to bring in the department of education is not there a school on East 4Th Street. I believe there is and is not there. Teacher partners there is. There is a school in these four, so there's teacher parking and other parking issues there that they need to be part of this discussion. Yes, I believe there are two schools on that. Third block between c and D, and when they're you know when school's letting out when the when there's school bus activity yeah nothing is going to be getting by while that's going on. That's why I'm not quite so sure that 4th street is a good. You know default fire route. What about removing parking on East 6th street is not that, because is not that fdny is using that right now. Should we say for East, 4Th or e6 day lighting the corner yeah. I think we should yeah. Daylighting is a good thing. These streets are narrow. You know, there's not been a whole lot of time for them to be able to look at drawings or whatever and decide that yes, it'll, be good daylighting. The corner makes it a lot easier for them to say. Yes, I think, okay, great! Thank you all right. Thank you anything else on any of these two topics. Okay, thank you all right, so I'm just going to pivot before we adjourn tonight. This is just for the committee. I want to thank the community for coming out tonight, but this is just for the committee. So this month I wrote an email about a week or so ago by looking for a secretary for the committee, because Michelle does do a lot and she willingly after I asked her and begged her yesterday to do minutes for today, knowing that it was just updates, I I'm going to go in a different path. So next month I'm going to appoint Wendy Lee to do the minutes for October reach out to me via email. So we can discuss that and get you ready for that for October and in November I'm going to have tariq. Do it I'm going to try everybody so and then at the end of November, I'm going to make a decision on appointing who will be the permanent secretary going forward for the committee. If you have any questions about that, please you know. Just let me know shoot me an email. Let me know if you're not receiving my emails, I do try to send them out relatively decent amount of time, but we have tried everybody out pretty much. As secretary of the past couple months, we've tried ellen we've, tried Lee we're going to try wendy next month and Tariq the month after that, so I'm going to just do it that way. Instead of just asking for volunteers, I'm just going to appoint and then at the end of November, going into December I'll, appoint an official secretary for the committee who will have that role from there forth on any questions about that. If not just shoot me an email, if you, if something pops up other than that, I think we are done for tonight at exactly almost one hour on the DOT. I know next month is going to probably be a quite a packed agenda with a lot of things coming up, so October is going to be pretty heavy. I think we're ready to go Michelle, let's go and I'll just say that being a secretary is not really a burden, it's a great way, especially if you're a new member to learn about the committee and forces you to pay attention free frankly, especially when you're at home, so I've enjoyed doing it. Just I'm both running the meeting and and taking notes, which is difficult but yeah. I've enjoyed it: okay, Paul Rangel, yes, Michelle, Cooper, Smith, yes, Lee Berman, yes, David Crane, yes, Felicia, Crookshank, Wendy Lee, here, Ellen Liu, yes, three gramos! Yes, thank you! Thank you. Everyone have a good night. Thank you. Members of the community who came out for tonight have a good one. Good night have a good one.",
            "summary": "Everybody, Lee Berman, also, a lifelong resident of lower East side, Yeah, I'm, David, Crane and I've been here a little over half my life on a block right near tompkins, where hi everyone thanks for watching hi, I'm, also born and raised in lower east side and happy to be on the committee.\nBut, another restaurant took up the mantle and, although again like it's, not perfect, we when we need to get up the street like us If the well they're not going to avenue a specifically, you know there may be times when different responses to different areas require different routes.\nIf it's improved but like can't be answered whether or not this is putting people's lives in danger, I would love to like No know that I mean I know that the open streets program will probably not go that much longer, but I do not know.\nYou know those things have not been eradicated 100, but it's been better than it's been better since, since the July, since our episodes in July and everything I've spoken to the officers and the apparatus operators, especially from the firehouse, the fire company on East second street, and they found to be improved.\nThink you answered my next question, which is what would be the ideal situation which is to not have anything blocking the street, so thank you, okay, great.\nIf the committee does not have any ques any other questions, what I'm going to do for tonight, Is I'm, going to pivot back to agenda item number two, which is the dot's response.\nThank you, if you guys, can just hold on for a little while longer and if the D.O.T representative can speak on agenda item number two, which is the response to the request for the study proposals on E, second and fourth street, to allow for faster response up north The floor is yours, a point of personal approach.\nThink in the resolution you guys also mentioned removing the barriers on Avenue B in favor of flexible delineators, so flexible delineators would not be a viable option, because the open streets is not in effect 24 hours.\nOkay, so yeah, like I, said at the moment, we're not looking to remove parking for open streets, but I could bring back the this to my office and see what I would have to bring it back for further clarification.\nThink some cities have extended their open restaurants and streets to like December.\nThe real concern for us is: if the open streets continues, we know like it's.\nAnd I know there's a school in the area If they're going to if Amy B is going to be shut down again come springtime through for the open, streets.\nThe open streets is a very successful program that people like so therefore it may be extended for a long time.\nAs this and the response from the Department of Transportation The reversal study would take some time for evaluation, the Avenue B, open, streets, open restaurants or temporary programs.\nIs the request to remove parking at the corners to accommodate turning movements for fdny trucks, or just to widen the travel lane for the full block?\nI. Do not think the question is right: now, whether we want to pursue 4th street But I think we need the information from D.O.T Thank you with regards to the parking on East, 4Th. Anything will help you know if they could, if D.O.T can remove the parking off the corner.\nWell, Dot's response was, at this point, they're not looking to remove parking for open, streets.\nThink DOT just can't wait another month and not have responses, because the answer is then less social distancing for people and more risk for health, issues, and People who, like people who walk people, need to use the this open space is a way to for a healthy issue.\nYou know unless the committee has any reason not to We're, not updating the resolution per se tonight, but we'll have DOT take some of these thoughts back to their colleagues and see how they can work with them, whether it's a loading zone or freeing up fourth street a little bit.\nFdny is now sharing their concerns and some of the creative ideas that came out of last month's transportation committee meeting D.O.T is now saying we're not going to look at elimination of parking.\nThe number two thing is: we want to make sure we have a pleasant community, And, I, think, ultimately, the goals here of the open streets program and the fdny are in sync.\nIf there's going to be any investigation about that, then I think you also need to bring in the department of education is not there a school on East 4Th, Street.\nWhat about removing parking on East 6th street is not that, because is not that fdny is using that right."
        }
    }
}